{
  "imDbId": "tt0112471",
  "title": "Before Sunrise",
  "fullTitle": "Before Sunrise (1995)",
  "type": "Movie",
  "year": "1995",
  "language": "en",
  "titleInLanguage": "Before Sunrise",
  "url": "https://en.wikipedia.org/wiki/Before_Sunrise",
  "plotShort": {
    "plainText": "Before Sunrise is a 1995 romantic drama film directed by Richard Linklater and co-written by Linklater and Kim Krizan. The first installment in the Before trilogy, it follows Jesse (Ethan Hawke) and Céline (Julie Delpy) as they meet on a Eurail train and disembark in Vienna to spend the night together.\r\nInspired by personal experiences, Linklater collaborated with Krizan, who previously appeared in his films Slacker (1991) and Dazed and Confused (1993), to develop the screenplay. Casting was extensive; it took nine months for Hawke and Delpy to be cast with principal photography taking place entirely in Vienna.\r\nThe plot is considered minimalistic, consisting mostly of monologues and casual conversation with extended dialogue as the characters navigate Vienna. Their contrasting ideas and perspectives on life and love are detailed, with Jesse a romantic disguised as a cynic, and Céline seemingly a romantic. Before Sunrise also explores time, death, and self-discovery.\r\nBefore Sunrise premiered at the Sundance Film Festival on January 19, 1995, and was theatrically released eight days later. It grossed $22.5 million against a $2.5 million budget and received critical acclaim, particularly for its exploration of postmodern romance, the screenplay, Linklater's direction, and acting performances. Before Sunrise also received a rating of 100% on Rotten Tomatoes, and appeared on many critics' lists of the greatest films of the year. A sequel, Before Sunset, was released in 2004, and a third film, Before Midnight, was released in 2013.",
    "html": "<p>Before Sunrise is a 1995 romantic drama film directed by Richard Linklater and co-written by Linklater and Kim Krizan. The first installment in the Before trilogy, it follows Jesse (Ethan Hawke) and Céline (Julie Delpy) as they meet on a Eurail train and disembark in Vienna to spend the night together.</p><p>Inspired by personal experiences, Linklater collaborated with Krizan, who previously appeared in his films Slacker (1991) and Dazed and Confused (1993), to develop the screenplay. Casting was extensive; it took nine months for Hawke and Delpy to be cast with principal photography taking place entirely in Vienna.</p><p>The plot is considered minimalistic, consisting mostly of monologues and casual conversation with extended dialogue as the characters navigate Vienna. Their contrasting ideas and perspectives on life and love are detailed, with Jesse a romantic disguised as a cynic, and Céline seemingly a romantic. Before Sunrise also explores time, death, and self-discovery.</p><p>Before Sunrise premiered at the Sundance Film Festival on January 19, 1995, and was theatrically released eight days later. It grossed $22.5 million against a $2.5 million budget and received critical acclaim, particularly for its exploration of postmodern romance, the screenplay, Linklater's direction, and acting performances. Before Sunrise also received a rating of 100% on Rotten Tomatoes, and appeared on many critics' lists of the greatest films of the year. A sequel, Before Sunset, was released in 2004, and a third film, Before Midnight, was released in 2013.</p>"
  },
  "plotFull": {
    "plainText": "Before Sunrise is a 1995 romantic drama film directed by Richard Linklater and co-written by Linklater and Kim Krizan. The first installment in the Before trilogy, it follows Jesse (Ethan Hawke) and Céline (Julie Delpy) as they meet on a Eurail train and disembark in Vienna to spend the night together.\r\nInspired by personal experiences, Linklater collaborated with Krizan, who previously appeared in his films Slacker (1991) and Dazed and Confused (1993), to develop the screenplay. Casting was extensive; it took nine months for Hawke and Delpy to be cast with principal photography taking place entirely in Vienna.\r\nThe plot is considered minimalistic, consisting mostly of monologues and casual conversation with extended dialogue as the characters navigate Vienna. Their contrasting ideas and perspectives on life and love are detailed, with Jesse a romantic disguised as a cynic, and Céline seemingly a romantic. Before Sunrise also explores time, death, and self-discovery.\r\nBefore Sunrise premiered at the Sundance Film Festival on January 19, 1995, and was theatrically released eight days later. It grossed $22.5 million against a $2.5 million budget and received critical acclaim, particularly for its exploration of postmodern romance, the screenplay, Linklater's direction, and acting performances. Before Sunrise also received a rating of 100% on Rotten Tomatoes, and appeared on many critics' lists of the greatest films of the year. A sequel, Before Sunset, was released in 2004, and a third film, Before Midnight, was released in 2013.\r\nPlot\r\nOn June 16, 1994, Jesse meets Céline on a train from Budapest, and they strike up a conversation. Jesse is going to Vienna to catch a flight back to the United States, whereas Céline is returning to university in Paris after visiting her grandmother. When they reach Vienna, Jesse asks Céline to disembark with him, saying that 10 or 20 years down the road, she might not be happy with her significant other and might wonder how her life would have been different if she had picked someone else. Alternatively, she may just realize Jesse himself is not that different from the rest. Lacking the money to rent a room for the night, they decide to roam around in Vienna until Jesse's flight the next morning.\r\nAfter visiting a few landmarks in Vienna, they share a kiss at the top of the Wiener Riesenrad at sunset and start to feel a romantic connection. As they continue to roam around the city, they begin to talk more openly with each other, with conversations ranging from topics about love, life, religion, and their observations of Vienna. Céline tells Jesse that her last boyfriend broke up with her six months ago, claiming that she \"loved him too much.” When questioned, Jesse reveals he had initially come to Europe to spend time with his girlfriend who was studying in Madrid, but they broke up soon after he was there. He found a cheap flight home, via Vienna, but it did not leave for two weeks so he bought a Eurail pass and traveled around Europe.\r\nWhen they are walking alongside the Donaukanal, they are approached by a man who offers to write them a poem with a word of their choice inside. Jesse and Céline decide on the word \"milkshake” and are soon presented with the poem Delusion Angel (written for the film by poet David Jewell)—a poem that Jesse cynically claims the man had already previously written and just inserts the words people choose. In a Viennese café, Jesse and Céline stage fake phone conversations with each other, playing each other's friends they pretend to call. Céline reveals that she was ready to get off the train with Jesse before he convinced her. Jesse reveals that after he broke up with his girlfriend, he bought a flight that really was not much cheaper, and all he really wanted was an escape from his life.\r\nThey admit their attraction to each other and how the night has made them feel, though they understand that they probably will not see each other again. They decide to make the best of what time they have left. They then get a bottle of wine and share it together in a park and begin discussing whether or not they should have sex. Celine says that she doesn't just want to be a one-night stand for Jesse, and then Jesse explains that, if given the choice, he would marry her instead of never seeing her again. They begin kissing passionately and embracing each other, then it is heavily implied Jesse and Celine have sex in the park. The film ends the next day at the train station, where, just as Céline's train is about to leave, the couple decides not to exchange any contact information but instead meet at the same place in six months.\r\nCast\r\nEthan Hawke as Jesse\r\nJulie Delpy as Céline\r\nAndrea Eckert as wife on train\r\nHanno Pöschl as husband on train\r\nKarl Bruckschwaiger as guy on bridge\r\nTex Rubinowitz as guy on bridge\r\nErni Mangold as palm reader\r\nDominik Castell as street poet\r\nHaymon Maria Buttinger as bartender\r\nBilge Jeschim as belly dancer\r\nAdam Goldberg as man sleeping on train (uncredited)\r\nProduction\r\nBefore Sunrise was inspired by a woman named Amy Lehrhaupt, whom writer/director Richard Linklater met in a toy shop in Philadelphia in 1989. They walked around the city together, conversing deep into the night. In 2013, Linklater revealed that Lehrhaupt had died in a motorcycle accident before the release of Before Sunrise.\r\nOriginally, in the screenplay, who the two people were and the city they spend time in was vague. Linklater realized that because the film is so much a dialogue between a man and a woman, it was important to have a strong female co-writer. He chose Kim Krizan, who had small roles in his two previous films Slacker and Dazed and Confused. According to Linklater, he \"loved the way her mind worked – a constant stream of confident and intelligent ideas\".\r\nLinklater and Krizan talked about the concept of the film and the characters for a long time. He wanted to explore the \"relationship side of life and discover two people who had complete anonymity and try to find out who they really were\". He decided to put Jesse and Céline in a foreign country because \"when you're traveling, you're much more open to experiences outside your usual realm\". He and Krizan worked on an outline. They wrote the actual screenplay in 11 days.\r\nLinklater spent nine months casting the film because had trouble finding the right actors for the roles of Jesse and Céline. When Linklater first considered casting Hawke, he thought that the actor was too young for the part. Linklater saw Hawke at a play in New York City and reconsidered after talking to the actor. For Céline, Linklater met Julie Delpy and liked her personality. After they did a final reading, Linklater knew that Delpy and Hawke were right for the roles. Once Delpy and Hawke agreed to do the film, they went to Austin and talked with Linklater and Krizan for a few days.\r\nControversies\r\nAs the film trilogy has become more renowned and beloved by fans, in 2016, Delpy told Creative Screenwriting regarding Before Sunrise, \"Ethan and I basically re-wrote all of it. There was an original screenplay, but it wasn't very romantic, believe it or not. It was just a lot of talking, rather than romance. Richard hired us because he knew we were writing and he wanted us to bring that romance to the film. We brought those romantic ideas and that's how I wrote something that actually got made, without really getting credit for it. But, if I had written Before Sunrise and been credited, then I doubt it would have been financed\".\r\nIn 2019, credited screenwriter Kim Krizan rebuffed Delpy's claim that the actors re-wrote the entire script and that it wasn't romantic by telling Illeana Douglas, \"Success has many parents, but failure is an orphan.\" Some have even called Krizan \"the real Céline.\"\r\nWhile all principals have acknowledged the final film was \"workshopped\" after Linklater and Krizan wrote the script, only Delpy is on the record suggesting a full re-write of the script. Linklater and Krizan are credited for writing Before Sunrise, while Delpy and Hawke are credited for co-writing the sequels and Krizan credited with story credit for Before Sunset and characters created by credit on Before Midnight.\r\nThemes\r\nBefore Sunrise revolves largely around the twin themes of self-fulfillment and self-discovery through a significant other, charging the concept through the introduction of a twelve-hour time constraint in which the goals implicit to the two themes have to be realized. They are underlined by the poem \"Delusion Angel\", which evokes a longing for complete and unifying, possibly even redeeming, understanding between two partners in a world which is itself unknowable, and over which one can exercise no control.\r\nAn important role is played by the theme of spontaneous and uninhibited response to one's environment. It is reflected by the actions of Jesse and Céline, whose joint stream of consciousness, initiated by a previously unmeditated decision to leave the train together, allows them to temporarily detach themselves from the world, and enter a realm where only the other's company is of importance. Come morning, Jesse remarks that he and Céline have again entered \"real time\".\r\nIt could be argued that Before Sunrise subsumes its main themes under that of life. In one scene, Céline and Jesse visit the Friedhof der Namenlosen, the Cemetery of the Nameless in Simmering. The people buried in the cemetery have found anonymity in death; by learning to know and understand one another, Céline and Jesse experience and embrace life, suspending their own mortality.\r\nThe film leaves audience members to decide for themselves whether Jesse and Céline will actually meet again in six months. Critic Robin Wood has written that after he published an essay on the film (in a 1996 issue of CineAction), Linklater wrote him to say that \"neither he nor the two actors ever doubted that the date would be kept.\"\r\nThe film takes place on June 16, Bloomsday.\r\nRelease\r\nBefore Sunrise had its world premiere at the 1995 Sundance Film Festival. It was released in the United States on January 27, 1995.\r\nCritical reception\r\nThe film was entered into the 45th Berlin International Film Festival where Linklater won the Silver Bear for Best Director.\r\nMTV Movie & TV Award nominated Hawke and Delpy for the Best Kiss award.\r\nThe review aggregation website Rotten Tomatoes reported that 100% of critics have given the film a positive review based on 46 reviews, with an average rating of 8.4/10. The site's critics consensus reads, \"Thought-provoking and beautifully filmed, Before Sunrise is an intelligent, unabashedly romantic look at modern love, led by marvelously natural performances from Ethan Hawke and Julie Delpy.\" On Metacritic, the film has a weighted average score of 77 out of 100 based on 18 critics, indicating \"generally favorable reviews\". Audiences surveyed by CinemaScore gave the film a grade B on scale of A to F.\r\nFilm critic Roger Ebert gave Before Sunrise three out of four and described Delpy as \"ravishingly beautiful and, more important, warm and matter-of-fact, speaking English so well the screenplay has to explain it (she spent some time in the States)\". In her review for The New York Times, Janet Maslin wrote, \"Before Sunrise is as uneven as any marathon conversation might be, combining colorful, disarming insights with periodic lulls. The film maker clearly wants things this way, with both these young characters trying on ideas and attitudes as if they were new clothes\". Hal Hinson, in his review for The Washington Post wrote, \"Before Sunrise is not a big movie, or one with big ideas, but it is a cut above the banal twentysomething love stories you usually see at the movies. This one, at least, treats young people as real people\".\r\nIn his review for the Los Angeles Times, Peter Rainer wrote, \"It's an attempt to make a mainstream youth movie with a bit more feeling and mysteriousness than most, and, in this, it succeeds\". Marjorie Baumgarten, in her review for The Austin Chronicle, wrote, \"Before Sunrise represents a maturation of Linklater's work in terms of its themes and choice of characters\". In his review for The New Yorker, Anthony Lane wrote, \"Just once, for a single day, Jesse and Céline have given life the sort of shape and charge that until now they have found only in fiction, and may never find again\". Entertainment Weekly gave the film an \"A−\" rating and Owen Gleiberman wrote, \"Small movies can be as daring as big ones, and Linklater, in his offhand way, is working without a net here. Before Sunrise may be the closest an American has come to the discursive talk gamesmanship of Eric Rohmer\".\r\nOnline film critic James Berardinelli has cited the film as \"the best romance of all time\". Entertainment Weekly rated Before Sunrise #25 on their Top 25 Modern Romances list. In a 2008 Empire poll, Before Sunrise was ranked as the 200th greatest movie of all time. In 2010 British newspaper The Guardian ranked Before Sunrise/Before Sunset #3 on their critics' list of 25 best romantic films of all time, and #2 in an online readers' poll.\r\nBox office\r\nThe film grossed $1.4 million in 363 theaters on its opening weekend, and went on to gross $5.5 million in the United States and Canada and $22.5 million worldwide, nine times its $2.5 million budget.\r\nSequels\r\nBefore Sunset was released in 2004 with Linklater, Krizan, Hawke, and Delpy to equally positive reviews, with the review-gathering site Rotten Tomatoes logging a 95% \"Fresh\" rating. A second sequel, Before Midnight, was released in 2013, again to rave reviews.\r\nJesse and Céline also had a very short scene together in Linklater's 2001 animated film Waking Life. In this scene, the two are together in bed talking, though since the film is all about lucid dreaming, and from the plot points established in Before Sunset, the thought is that this scene never existed in reality.",
    "html": "<p>Before Sunrise is a 1995 romantic drama film directed by Richard Linklater and co-written by Linklater and Kim Krizan. The first installment in the Before trilogy, it follows Jesse (Ethan Hawke) and Céline (Julie Delpy) as they meet on a Eurail train and disembark in Vienna to spend the night together.</p><p>Inspired by personal experiences, Linklater collaborated with Krizan, who previously appeared in his films Slacker (1991) and Dazed and Confused (1993), to develop the screenplay. Casting was extensive; it took nine months for Hawke and Delpy to be cast with principal photography taking place entirely in Vienna.</p><p>The plot is considered minimalistic, consisting mostly of monologues and casual conversation with extended dialogue as the characters navigate Vienna. Their contrasting ideas and perspectives on life and love are detailed, with Jesse a romantic disguised as a cynic, and Céline seemingly a romantic. Before Sunrise also explores time, death, and self-discovery.</p><p>Before Sunrise premiered at the Sundance Film Festival on January 19, 1995, and was theatrically released eight days later. It grossed $22.5 million against a $2.5 million budget and received critical acclaim, particularly for its exploration of postmodern romance, the screenplay, Linklater's direction, and acting performances. Before Sunrise also received a rating of 100% on Rotten Tomatoes, and appeared on many critics' lists of the greatest films of the year. A sequel, Before Sunset, was released in 2004, and a third film, Before Midnight, was released in 2013.</p><br/><h3>Plot</h3><p>On June 16, 1994, Jesse meets Céline on a train from Budapest, and they strike up a conversation. Jesse is going to Vienna to catch a flight back to the United States, whereas Céline is returning to university in Paris after visiting her grandmother. When they reach Vienna, Jesse asks Céline to disembark with him, saying that 10 or 20 years down the road, she might not be happy with her significant other and might wonder how her life would have been different if she had picked someone else. Alternatively, she may just realize Jesse himself is not that different from the rest. Lacking the money to rent a room for the night, they decide to roam around in Vienna until Jesse's flight the next morning.</p><p>After visiting a few landmarks in Vienna, they share a kiss at the top of the Wiener Riesenrad at sunset and start to feel a romantic connection. As they continue to roam around the city, they begin to talk more openly with each other, with conversations ranging from topics about love, life, religion, and their observations of Vienna. Céline tells Jesse that her last boyfriend broke up with her six months ago, claiming that she \"loved him too much.” When questioned, Jesse reveals he had initially come to Europe to spend time with his girlfriend who was studying in Madrid, but they broke up soon after he was there. He found a cheap flight home, via Vienna, but it did not leave for two weeks so he bought a Eurail pass and traveled around Europe.</p><p>When they are walking alongside the Donaukanal, they are approached by a man who offers to write them a poem with a word of their choice inside. Jesse and Céline decide on the word \"milkshake” and are soon presented with the poem Delusion Angel (written for the film by poet David Jewell)—a poem that Jesse cynically claims the man had already previously written and just inserts the words people choose. In a Viennese café, Jesse and Céline stage fake phone conversations with each other, playing each other's friends they pretend to call. Céline reveals that she was ready to get off the train with Jesse before he convinced her. Jesse reveals that after he broke up with his girlfriend, he bought a flight that really was not much cheaper, and all he really wanted was an escape from his life.</p><p>They admit their attraction to each other and how the night has made them feel, though they understand that they probably will not see each other again. They decide to make the best of what time they have left. They then get a bottle of wine and share it together in a park and begin discussing whether or not they should have sex. Celine says that she doesn't just want to be a one-night stand for Jesse, and then Jesse explains that, if given the choice, he would marry her instead of never seeing her again. They begin kissing passionately and embracing each other, then it is heavily implied Jesse and Celine have sex in the park. The film ends the next day at the train station, where, just as Céline's train is about to leave, the couple decides not to exchange any contact information but instead meet at the same place in six months.</p><br/><h3>Cast</h3><ul><li>Ethan Hawke as Jesse</li><li>Julie Delpy as Céline</li><li>Andrea Eckert as wife on train</li><li>Hanno Pöschl as husband on train</li><li>Karl Bruckschwaiger as guy on bridge</li><li>Tex Rubinowitz as guy on bridge</li><li>Erni Mangold as palm reader</li><li>Dominik Castell as street poet</li><li>Haymon Maria Buttinger as bartender</li><li>Bilge Jeschim as belly dancer</li><li>Adam Goldberg as man sleeping on train (uncredited)</li></ul><br/><h3>Production</h3><p>Before Sunrise was inspired by a woman named Amy Lehrhaupt, whom writer/director Richard Linklater met in a toy shop in Philadelphia in 1989. They walked around the city together, conversing deep into the night. In 2013, Linklater revealed that Lehrhaupt had died in a motorcycle accident before the release of Before Sunrise.</p><p>Originally, in the screenplay, who the two people were and the city they spend time in was vague. Linklater realized that because the film is so much a dialogue between a man and a woman, it was important to have a strong female co-writer. He chose Kim Krizan, who had small roles in his two previous films Slacker and Dazed and Confused. According to Linklater, he \"loved the way her mind worked – a constant stream of confident and intelligent ideas\".</p><p>Linklater and Krizan talked about the concept of the film and the characters for a long time. He wanted to explore the \"relationship side of life and discover two people who had complete anonymity and try to find out who they really were\". He decided to put Jesse and Céline in a foreign country because \"when you're traveling, you're much more open to experiences outside your usual realm\". He and Krizan worked on an outline. They wrote the actual screenplay in 11 days.</p><p>Linklater spent nine months casting the film because had trouble finding the right actors for the roles of Jesse and Céline. When Linklater first considered casting Hawke, he thought that the actor was too young for the part. Linklater saw Hawke at a play in New York City and reconsidered after talking to the actor. For Céline, Linklater met Julie Delpy and liked her personality. After they did a final reading, Linklater knew that Delpy and Hawke were right for the roles. Once Delpy and Hawke agreed to do the film, they went to Austin and talked with Linklater and Krizan for a few days.</p><br/><h3>Controversies</h3><p>As the film trilogy has become more renowned and beloved by fans, in 2016, Delpy told Creative Screenwriting regarding Before Sunrise, \"Ethan and I basically re-wrote all of it. There was an original screenplay, but it wasn't very romantic, believe it or not. It was just a lot of talking, rather than romance. Richard hired us because he knew we were writing and he wanted us to bring that romance to the film. We brought those romantic ideas and that's how I wrote something that actually got made, without really getting credit for it. But, if I had written Before Sunrise and been credited, then I doubt it would have been financed\".</p><p>In 2019, credited screenwriter Kim Krizan rebuffed Delpy's claim that the actors re-wrote the entire script and that it wasn't romantic by telling Illeana Douglas, \"Success has many parents, but failure is an orphan.\" Some have even called Krizan \"the real Céline.\"</p><p>While all principals have acknowledged the final film was \"workshopped\" after Linklater and Krizan wrote the script, only Delpy is on the record suggesting a full re-write of the script. Linklater and Krizan are credited for writing Before Sunrise, while Delpy and Hawke are credited for co-writing the sequels and Krizan credited with story credit for Before Sunset and characters created by credit on Before Midnight.</p><br/><h3>Themes</h3><p>Before Sunrise revolves largely around the twin themes of self-fulfillment and self-discovery through a significant other, charging the concept through the introduction of a twelve-hour time constraint in which the goals implicit to the two themes have to be realized. They are underlined by the poem \"Delusion Angel\", which evokes a longing for complete and unifying, possibly even redeeming, understanding between two partners in a world which is itself unknowable, and over which one can exercise no control.</p><p>An important role is played by the theme of spontaneous and uninhibited response to one's environment. It is reflected by the actions of Jesse and Céline, whose joint stream of consciousness, initiated by a previously unmeditated decision to leave the train together, allows them to temporarily detach themselves from the world, and enter a realm where only the other's company is of importance. Come morning, Jesse remarks that he and Céline have again entered \"real time\".</p><p>It could be argued that Before Sunrise subsumes its main themes under that of life. In one scene, Céline and Jesse visit the Friedhof der Namenlosen, the Cemetery of the Nameless in Simmering. The people buried in the cemetery have found anonymity in death; by learning to know and understand one another, Céline and Jesse experience and embrace life, suspending their own mortality.</p><p>The film leaves audience members to decide for themselves whether Jesse and Céline will actually meet again in six months. Critic Robin Wood has written that after he published an essay on the film (in a 1996 issue of CineAction), Linklater wrote him to say that \"neither he nor the two actors ever doubted that the date would be kept.\"</p><p>The film takes place on June 16, Bloomsday.</p><br/><h3>Release</h3><p>Before Sunrise had its world premiere at the 1995 Sundance Film Festival. It was released in the United States on January 27, 1995.</p><h4>Critical reception</h4><p>The film was entered into the 45th Berlin International Film Festival where Linklater won the Silver Bear for Best Director.</p><p>MTV Movie & TV Award nominated Hawke and Delpy for the Best Kiss award.</p><p>The review aggregation website Rotten Tomatoes reported that 100% of critics have given the film a positive review based on 46 reviews, with an average rating of 8.4/10. The site's critics consensus reads, \"Thought-provoking and beautifully filmed, Before Sunrise is an intelligent, unabashedly romantic look at modern love, led by marvelously natural performances from Ethan Hawke and Julie Delpy.\" On Metacritic, the film has a weighted average score of 77 out of 100 based on 18 critics, indicating \"generally favorable reviews\". Audiences surveyed by CinemaScore gave the film a grade B on scale of A to F.</p><p>Film critic Roger Ebert gave Before Sunrise three out of four and described Delpy as \"ravishingly beautiful and, more important, warm and matter-of-fact, speaking English so well the screenplay has to explain it (she spent some time in the States)\". In her review for The New York Times, Janet Maslin wrote, \"Before Sunrise is as uneven as any marathon conversation might be, combining colorful, disarming insights with periodic lulls. The film maker clearly wants things this way, with both these young characters trying on ideas and attitudes as if they were new clothes\". Hal Hinson, in his review for The Washington Post wrote, \"Before Sunrise is not a big movie, or one with big ideas, but it is a cut above the banal twentysomething love stories you usually see at the movies. This one, at least, treats young people as real people\".</p><p>In his review for the Los Angeles Times, Peter Rainer wrote, \"It's an attempt to make a mainstream youth movie with a bit more feeling and mysteriousness than most, and, in this, it succeeds\". Marjorie Baumgarten, in her review for The Austin Chronicle, wrote, \"Before Sunrise represents a maturation of Linklater's work in terms of its themes and choice of characters\". In his review for The New Yorker, Anthony Lane wrote, \"Just once, for a single day, Jesse and Céline have given life the sort of shape and charge that until now they have found only in fiction, and may never find again\". Entertainment Weekly gave the film an \"A−\" rating and Owen Gleiberman wrote, \"Small movies can be as daring as big ones, and Linklater, in his offhand way, is working without a net here. Before Sunrise may be the closest an American has come to the discursive talk gamesmanship of Eric Rohmer\".</p><p>Online film critic James Berardinelli has cited the film as \"the best romance of all time\". Entertainment Weekly rated Before Sunrise #25 on their Top 25 Modern Romances list. In a 2008 Empire poll, Before Sunrise was ranked as the 200th greatest movie of all time. In 2010 British newspaper The Guardian ranked Before Sunrise/Before Sunset #3 on their critics' list of 25 best romantic films of all time, and #2 in an online readers' poll.</p><h4>Box office</h4><p>The film grossed $1.4 million in 363 theaters on its opening weekend, and went on to gross $5.5 million in the United States and Canada and $22.5 million worldwide, nine times its $2.5 million budget.</p><br/><h3>Sequels</h3><p>Before Sunset was released in 2004 with Linklater, Krizan, Hawke, and Delpy to equally positive reviews, with the review-gathering site Rotten Tomatoes logging a 95% \"Fresh\" rating. A second sequel, Before Midnight, was released in 2013, again to rave reviews.</p><p>Jesse and Céline also had a very short scene together in Linklater's 2001 animated film Waking Life. In this scene, the two are together in bed talking, though since the film is all about lucid dreaming, and from the plot points established in Before Sunset, the thought is that this scene never existed in reality.</p><br/>"
  },
  "errorMessage": ""
}