{
  "imDbId": "tt0083658",
  "title": "Blade Runner",
  "fullTitle": "Blade Runner (1982)",
  "type": "Movie",
  "year": "1982",
  "items": [
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "100",
      "content": "The grafting of 40s hard-boiled detective story with SF thriller creates some dysfunctional overlaps, and the movie loses some force whenever violence takes over, yet this remains a truly extraordinary, densely imagined version of both the future and the present, with a look and taste all its own."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "Most important, several elements -- the film's tough, new ending; a sly, fleeting dissolve of a unicorn, not in the original; and a brilliant, trompe d'oeil flicker of life in a shot of a still photograph -- bring Deckard's existential dilemma into focus. [11 Sept 1992]"
    },
    {
      "publisher": "",
      "author": "Los Angeles Times",
      "link": "https://www.latimes.com/archives/la-xpm-1992-09-11-ca-30-story.html",
      "rate": "100",
      "content": "May be the best \"new\" American movie released this year."
    },
    {
      "publisher": "Washington Post",
      "author": "Desson Thomson",
      "link": "",
      "rate": "100",
      "content": "This movie is great in any version...I don't miss what has been cut from the new version. The overall effect is so beautifully wrought, a few details aren't going to bring things crashing down."
    },
    {
      "publisher": "Washington Post",
      "author": "Rita Kempley",
      "link": "",
      "rate": "100",
      "content": "Grand enough in scale to carry its many Biblical and mythological references, Blade Runner never feels heavy or pretentious -- only more and more engrossing with each viewing. It helps, too, that it works as pure entertainment."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "",
      "rate": "91",
      "content": "This is perhaps the only science-fiction film that can be called transcendental."
    },
    {
      "publisher": "USA Today",
      "author": "Susan Wloszczyna",
      "link": "",
      "rate": "88",
      "content": "What remains is a great Vangelis score, astonishing production design, Hauer's career role -- and a movie that deserves its cult reputation despite an unloving heart. [11 Sept 1992]"
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Edward Guthmann",
      "link": "",
      "rate": "75",
      "content": "Today, Blade Runner works better than ever: Scott's version not only has more dramatic integrity, but its visual aesthetic and futuristic vision are more in sync with today's movie-goers. [11 Sept 1992]"
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/blade-runner-1982-1",
      "rate": "75",
      "content": "It looks fabulous, it uses special effects to create a new world of its own, but it is thin in its human story."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "",
      "rate": "38",
      "content": "As before, the movie is more impressive for its finely detailed vision of Los Angeles as a futuristic slum than for its story, acting, or message. It's all downhill after the first few eye-dazzling minutes. [2 Oct 1992]"
    }
  ],
  "errorMessage": ""
}