{
  "imDbId": "tt0083658",
  "title": "Blade Runner",
  "fullTitle": "Blade Runner (1982)",
  "type": "Movie",
  "year": "1982",
  "items": [
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw4059597",
      "warningSpoilers": false,
      "date": "11 February 2018",
      "rate": "",
      "helpful": "307 out of 345 found this helpful.",
      "title": "A Milestone Of Science Fiction And A Cyberpunk Masterpiece",
      "content": "A feast for the eyes. Dark and uncompromising. With a haunting musical score by Vangelis that adds a hypnotic quality to those breathtaking megacity landscapes of future Los Angeles. Ridley Scott's adaptation of Philip K. Dick's post-apocalyptic bounty hunter story 'Do Androids Dream Of Electric Sheep' is a visionary work of art; it's a dystopian masterpiece and I'd personally call it as much a milestone of science fiction as Kubrick's '2001' (and be advised to watch the version known as the \"final cut\" if you want to catch 'Blade Runner' as it was intended by its director). It's hard to overstate how influential the film was; it invented the sci-fi subgenre now known as \"cyberpunk\", and it was also the first \"film noir\" in a sci-fi setting. And although it looks so distractingly gorgeous that even today there are people who still dismiss it as superficial and mere \"eye candy\", it is a philosphically deep film that ponders existential questions about the nature of being human. Its slow, brooding quality will perhaps leave some modern audiences who are used to a different pace and more action underwhelmed - but make no mistake: this is a groundbreaking masterwork of its genre and a timeles classic. 10 stars out of 10.Favorite films: IMDb.com/list/mkjOKvqlSBs/Lesser-Known Masterpieces: imdb.com/list/ls070242495/"
    },
    {
      "username": "Flagrant-Baronessa",
      "userUrl": "https://www.imdb.com/user/ur5513934",
      "reviewLink": "https://www.imdb.com/review/rw1429855",
      "warningSpoilers": false,
      "date": "25 July 2006",
      "rate": "10",
      "helpful": "563 out of 718 found this helpful.",
      "title": "A glorious, timeless nightmare",
      "content": "Dark, deep, uncertain, unsettling  imagine the most beautiful nightmare you've ever had  this is Blade Runner (1982).Ridley Scott's Blade Runner is a brilliantly crafted science fiction film that not only touches upon, but bravely plunges into deep philosophical questions, making it simply ten times more important than any film of its genre. I love it not only for the initial feeling it gives, but because of its perseverance  none of the visuals, themes or technology feel dated but as deep, gripping and current as ever. It is timeless beauty with huge doses of emotion.Set in 2019 Los Angeles, Blade Runner zooms in on the eerily-lit, urban streets of the city and follows Richard Deckard  superbly played by Harrison Ford who brings an exquisite moral ambiguity to his character  a special policeman who tracks down and terminates artificially-created humans called replicants, who have escaped from an Off-World colony and made their way to earth and need to be stopped. The things Deckard encounters on his detective journey raise many philosophical questions like: Who is really a replicant? Are replicants really bad? If replicants are bad, when why did we go to such lengths with our technology to create them? Are replicants really humans? Is Deckard a hero? This truly is a film that demands subsequent discussion and its ambiguous ending leave a haunting and eerie feeling.In spite of a rich glaze of science fiction and futurism coating this adventure, there are distinct film noir elements present  primarily in the bluish haze that the film is seen through and its gritty urban atmosphere. Whoever thought of this combination is a genius. Since it is all about technology, it fits then that Blade Runner features a ridiculous amount of product placement, especially from Atari. In any other film, this would have felt out-of-place but here it is simply perfect. The score by Vangelis is strangely gripping when combined with the striking cinematography of the film.Blade Runner deserves credit, celebration and remembrance for it is simply an excellent film. 10 out of 10 (and I don't just throw this grade out like SOME people)"
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1928334",
      "warningSpoilers": false,
      "date": "11 August 2008",
      "rate": "8",
      "helpful": "198 out of 266 found this helpful.",
      "title": "An incredibly beautiful-looking film as one would expect with director Ridley Scott",
      "content": "But it's almost like an art movie, the first science-fiction art film It's a futuristic film beautifully put together It's really impeccably made by one of the great visionary directors And you really saw a future that looked very different from the future you had seen before A future that looked very believable like the visual-effects shots of the flying car going over a futuristic city The fight sequence doesn't prepare you for the traumatic emotional side that there is in the film, it leaves you sort of broken There is a beautiful, delicate emotional great scene that I remember when I first saw the movie I'm in the theater and I'm so drawn in what Rutger Hauer's doing I'm so drawn in by what the theme of the movie has brought us to The magnificent moment where he is letting go of life And in those last moments of letting go of life he's really learned to appreciate life to the point where he spares Deckard's life, and where he's even holding a white dove because he just wants to have something that's alive in his hands It's an amazing sort of crescendo that's going and there's Rutger saying: \"I've seen things you people wouldn't believe. All these moments will be lost in time like tears in rain.\" Hauer puts all the things that are so amazing about people: sense of poetry, sense of humor, sense of sexuality, sense of the kid, sense of soul Scott brought out the best qualities in his performers He coaxed and very gently manipulated performances from his actors that in some instances I think they've rarely topped You feel the story, you feel the emotions of the characters and you will be lost in the middle of this wild world, you know, it's so rich and it's painful I mean it's a very bluesy, dark story and told very compassionately The overpopulation, the sort of crowd scenes is so rich and varied and there's such an extreme detail designing the magazine covers, designing the look of the punks, the Hare Krishnas, the biological salesman, everything is designed You have just Piccadilly Circus punks walking by You have a sense of layers in that society That is one of those things that you see again and again The city landscape with the big billboards à la Kyoto or Tokyo Scott was able to create the look based on what goes on in various cities all over the world Whether it is Tokyo, Kyoto or Beijing or Hong Kong or whatever, you're right in \"Blade Runner\" country \"Blade Runner,\" to me, embodies the elegance, the power, and the uniqueness of a film experience It's the most classical, beautiful, purest movie-making writing and then the film-making itself is The images and the sound and the music, it's pure cinema Ridley came out with an amazing, brilliantly executed future of an absolute dystopia The intensity of his perfectionism on \"Blade Runner\" made the movie This is a master at his best"
    },
    {
      "username": "snoozejonc",
      "userUrl": "https://www.imdb.com/user/ur120966602",
      "reviewLink": "https://www.imdb.com/review/rw6609071",
      "warningSpoilers": false,
      "date": "18 February 2021",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Do Welshmen dream of inflatable sheep?",
      "content": "Rick Deckard is given an assignment to 'retire' several biologically engineered fugitives.I love Blade Runner for it's visual beauty, themes and how it mixes two of my favourite movie genres: noir and sci-fi.The plot follows Deckard as he hunts replicants, falls in love and questions his own humanity. It moves deliberately slow, allowing you to take in all the sights and sounds of 2019 Los Angeles (as imagined in 1982), whilst pondering some of the themes it presents.If you want to know more about the philosophical themes in significant depth, I suggest you google 'Blade Runner Themes and Motifs'. A simple Welshman like myself would for the purpose of a review rather scratch the surface and say that the imagery and dialogue associated with what defines a sentient being and what makes us human is compellingly portrayed. The device used to explore these themes is the genetically engineered humanoid life-form, the godlike status of its creator and the morally compromised nature of the ordinary human. Additionally the number of references to the eyes and linking of what we see and remember versus what is fake and reality, is cleverly mixed into the story.The character of Roy Batty has been interpreted as both a religious and philosophical allegory, but these types of theories can be argued until the sheep come home. He is for me the most intriguing character in the movie and his final scene is one of the most memorable of all time. Along with Deckard, it made me actually wonder if there is any real difference between humans and replicants. He is portrayed wonderfully by Rutger Hauer who both looks and acts the part.Deckard is impressively played by Harrison Ford, who is perfect for movies with such an emphasis on visuals. Ninety percent of Ford's power as an actor comes from his striking visual presence and soulful facial expressions. His scenes with Sean Young young are as emotionally touching as the action scenes are brutal.One of Blade Runner's most memorable aspects is its depiction of 2019 Los Angeles, with its permanently dark rainy skies, overcrowding, neon lights, high concept technology, urban decay and environmental devastation. Take away the flying cars and off-world colonies and it's not far off an accurate prediction.I could write for hours about the cinematography, artistic designs and special effects, but there's nothing I can say that would do it justice. You should watch every incredibly atmospheric frame of Blade Runner and absorb what Ridley Scott is showing you.The much argued question of whether Deckard is a replicant or a human is interesting. There is evidence on both sides of the argument and you must watch the movie to decide. I ask myself, does it really matter? Personally, I think in the grand scheme of the movie it matters as much as whether Welshmen dream of inflatable sheep. If I had to decide though, I'd say that he is a replicant."
    },
    {
      "username": "imuckenschnabl",
      "userUrl": "https://www.imdb.com/user/ur64855640",
      "reviewLink": "https://www.imdb.com/review/rw5726035",
      "warningSpoilers": false,
      "date": "10 May 2020",
      "rate": "10",
      "helpful": "110 out of 133 found this helpful.",
      "title": "Best movie ever",
      "content": "Just my personal opinion. Everything is perfect about this movie. I saw the movie the first time when I was 12 and it was mind blowing for me. 38 years later I feel the same about this movie. Timeless and beautiful. For me 10/10 with a star and smile"
    },
    {
      "username": "SantiagoDM1",
      "userUrl": "https://www.imdb.com/user/ur67641452",
      "reviewLink": "https://www.imdb.com/review/rw4295221",
      "warningSpoilers": false,
      "date": "20 August 2018",
      "rate": "10",
      "helpful": "112 out of 126 found this helpful.",
      "title": "All those moments will be lost in time, like tears in rain...",
      "content": "Blade Runner describes a future in which, through genetics, artificial humans are manufactured and called \"replicants\"; employees in dangerous jobs and slaves in the outer colonies of the Earth. Made by Tyrell Corporation under the motto \"more humans than humans\" -especially the \"Nexus-6\" models- not only resembles humans, they are far superior physically.The replicants were declared illegal on planet Earth after a bloody mutiny occurred on the planet Mars, where they worked as slaves. A special police force, Blade Runners, is in charge of identifying, tracking and killing - or \"withdrawing\", in terms of the police itself - the fugitive replicants found on Earth. With a group of replicants loose in Los Angeles, Rick Deckard, the best agent that has existed in regard to the recovery and removal of the replicas, is removed from his semi-retirement to use some of \"the old magic blade runner\".Ridley Scott fantastic dark cyberpunk style and futuristic design is so well made that accomplished to create a visual vocabulary: neon lights, abandonment, decay, loneliness, obscurity, indifference and alienation are the core of the aesthetics of the film, which will eventually become and serve as a pattern for successive cinematographic works.The script David Webb Peoples adapted from 'Do Androids Dream of Electric Sheep?' takes the viewer into a dwelling and philosophical controversy, as it creates doubt and empathy to the so called replicants, primarily as seen in many shots of Rick Deckard hesitating about the true nature of his task.Harrison Ford and Rutger Hauer haunts the attention into the essence of the story. Their characterization throughout infiltrates the different conceptions of life. A saddened soul searching for the meaning of his punished existence and the other, ruminating a task sinking him into a moral void brimming with guilt.At the end, the movie leaves you wondering about the implications the creation of highly intelligent beings (IA) must have and, if it's worth treating them as machines or they have become so human that the difference is non existent.\"Time... to die\".10/10."
    },
    {
      "username": "Ivan-28",
      "userUrl": "https://www.imdb.com/user/ur0161789",
      "reviewLink": "https://www.imdb.com/review/rw0191246",
      "warningSpoilers": true,
      "date": "5 August 1999",
      "rate": "9",
      "helpful": "397 out of 498 found this helpful.",
      "title": "Still outshines the others 17 years later",
      "content": "Blade Runner belongs on a list of 2 or 3 movies that had me walking out of the theater in a stupor as though hit by a sledgehammer, the first time I saw it. It fulfills one of my requirements of great films in that I walked out of the theater a different person than when I entered. And it fulfilled another requirement in that it improved with repeated viewings.There is so much to take in visually, intellectually, and emotionally that my mind was overwhelmed at the first viewing trying to sort it all out. Unlike the so-called \"entertainment\" we get today at the movies, this film didn't spoonfeed its meaning to you. It left the ending ambiguous so your imagination has to supply it.The film demands discussion. There are so many topics to debate. Is Deckard a replicant? Do Deckard and Rachel live happily ever after? Why is there a unicorn in the director's cut? Is Deckard a hero? Or are the replicants really the good guys? Every time I watch it, my answers change.I may be one of the few that really likes the original. Probably because I've seen that version a couple dozen times since 1982 before the director's cut came out. This may contradict what I said earlier about being spoonfed, but I liked the narration because it explained what was going on in Deckard's mind. And I didn't mind the \"happy ending\" because it still implied that their troubles may not be over. \"I don't know how long we had together. Who does?\" But with that version memorized, I now appreciate the directors cut. It probably has the better ending. (At least I think so until I view it again!)It's also fun watching actors before they became more famous later like Sean Young, Daryl Hannah, M. Emmet Walsh, William Sanderson, and Edward James Olmos. I think they all did a great job. And Vangelis did a beautiful, moving score.After \"Blade Runner\", most of the big blockbuster science fiction movies boil down to good guys vs. bad guys with lots of loud explosions and in-your-face effects. Very simplistic messages, if any. That's why I still contend that an \"oldie\" like Blade Runner still outshines them all. It has incredible special effects, but never at the expense of the story. The cityscapes do more than dazzle you, they involve you.The more I think of it, the more I realize that \"Blade Runner\" is not only my favorite science fiction movie, but one of my favorite films in any genre. I wish Ridley Scott would return to science fiction, but then again today's Hollywood would never release a movie like \"Blade Runner.\""
    },
    {
      "username": "jaywolfenstien",
      "userUrl": "https://www.imdb.com/user/ur1298472",
      "reviewLink": "https://www.imdb.com/review/rw1813722",
      "warningSpoilers": false,
      "date": "2 February 2008",
      "rate": "",
      "helpful": "30 out of 38 found this helpful.",
      "title": "A frame to die for.",
      "content": "I spent a weekend with the new DVD set of Blade Runner. Watched all four versions pretty much back to back (minus the work print version) starting with the US theatrical and finishing with the Final Cut. And across those eight hours I spent with the film, I did not get tired of watching – just watching – that futuristic film-noir vibe: deep dark shadows and majestic use of light and color used to make a run-down polluted cityscape look so beautiful. In fact, when I got to the Final Cut, which had been cleaned up, restored, and remixed, the picture and sound quite literally took my breath away.Blade Runner is easily one of the best looking films ever made.In some ways, many ways, Blade Runner strikes me as silly. Particularly in its more climactic moments where the protagonist faces off against a replicant. Pris's acrobatic means of attacking Deckard? When Roy Batty chases Deckard in his shorts (when a few moments before he was fully clothed?) The film goes over-the-top to the point where I find myself asking, \"why in the world would the characters do that?!\" But here's what's interesting: as silly as Blade Runner may get it never betrays its own world. Everything that happens, in some queer way, feels natural to this strange futuristic world.I like the movie in its action scenes, but I simply adore it during the quieter moments – the parts where not a whole hell of a lot is happening, and you can simply watch and absorb Jordan Cronenweth's marvelous cinematography. My favorite scene comes when Rachel has saved Deckard's life. An emotional wreck of killing another replicant on top of the revelation that she, herself, is a replicant – she stands by a window where light floods in, so much light that the whole screen goes white, and then it recedes again and we see the characters again. Later in that same scene, she sits at the piano, plays for a bit, and then lets her hair down. Hearing Deckard stumbling in the other room, she looks out of the corner of her eye and shot after shot after shot through this entire sequence demonstrates absolute mastery over the frame.Plus some of the other quiet moments resonate with a truer low-key science-fiction feel such as the scene in Tyrell corporation where Deckard applies the Voight-Kampff test to Rachel. More or less a mundane questionaire/interview with a typical sci-fi gadget sitting on the table, but Ridley Scott and Terry Rawlings compacts the lengthy endeavor into a few short moments using a stunningly simple montage.Later on, Deckard sits in front of a voice-activated screen analyzing a photograph. The task is presented as a dull monotonous job (made especially evident in Harrison Ford's delivery), yet the scene, itself, never bores. The voice-activation not only serves as a staple sci-fi device, but cleverly allows Deckard to take the audience's hand and guide them through this investigative process. And perhaps what I like most about the scene: the audience, and even Deckard himself, doesn't even really know what he's found. Things don't magically fall into place with a Scooby-Doo moment of revelation. He finds another clue that might lead somewhere (albeit, since it's a movie it's a good guess the clue does lead somewhere.) In my mind at least moments such as the Voight-Kampff scenes, Deckard's briefing, the photograph analysis, both of Rachel's scenes in Deckard's apartment gives the world of Blade Runner a solid grounding so later on it can get away with the absurd.Which brings me to the replicants. Roy Batty (Rutger Hauer) in particular, whose strangely sympathetic in that his murderous tendencies spawn directly from his fear of dying. This is a man who possesses a strong conviction that he deserves life perhaps because he looks around on earth and sees people squandering their existence while he knows he only has a few short moments. Why should a shmuck like Deckard live for 50+ years when Roy in his 4 short years has seen attack ships burning off the shoulder of Orion and seen C-beams glitter in the dark \"If only you could see what I've seen with your eyes,\" he proudly and warmly tells one of the scientists who helped create him.As for which cut of the film, I don't think any single one is perfect (and I'd honestly watch any of them in a heartbeat.) I prefer the \"Final Cut\" over the others and admire Ridley Scott's restraint in his definitive DVD release. Most of the modifications are fine-tuning tweaks the casual viewer won't even notice unless watching two version back to back, and most of said fine-tuning improve the film (although, admittingly, Roy's beckoning of Sebastian could've been left out.) But hell, all versions of Blade Runner are included, so people don't have much room to complain about the changes. And no matter what version you go with, it's still a beautiful film to just watch."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1986540",
      "warningSpoilers": false,
      "date": "7 December 2008",
      "rate": "9",
      "helpful": "80 out of 120 found this helpful.",
      "title": "New Blu-Ray Disc Made Me A Blade Runner Fan",
      "content": "Sometimes you just need to give a film a second chance, even if it is 20 years later! Only some rave reviews about the picture quality of this new 5-disc \"Complete Collector's Edition\" enticed me to watch this again. Wow, I am glad; this was a very entertaining and a tremendous visual and audio treat.I actually appreciated the audio best because, even in this new Blu-Ray era, one doesn't often find a film with very active surround speakers. However, this \"restored\" version did and the sound is, at the point, the best I've heard on a Blu-Ray disc....or any DVD, for that matter. The visuals? Well, fans of Blade Runner know all about them. They are fantastic. Scene-after-scene reminded me of a Stanley Kubrick film or another bizarre 1980s movie called \"Jacob's Ladder.\"Because there are so many things to see and hear, and the story is different, one filled with strange characters, I can see where people would watch this film multiple times and enjoy it very much each time. The \"Collector's Edition\" has the best picture ever, according to director Ridley Scott, and \"is the version I'm most pleased with.\" It has added scenes one didn't see in earlier versions. The rest of the DVD has those earlier versions. Apparently, there are several including those with Harrison Ford doing narration, like out of a late '40s film noir.Speaking of the latter, that's what this film looked like: a combination film noir (or neo-noir) and sci-fi movie. It has many dark images, fantastic night-time scenes, wonderful closeups and an always-interesting color palette. Sci-fi films usually get dated in a hurry, thanks to ever-increasing special-effects progress in the movie industry, but this still looks very good. Despite being made over 25 years ago, Blade Runner still looks very much state-of-the-art.Scott says this is the best version and the best his film has ever looked and sounded. Since it's his movie, who am I to argue. So, if you're like me and never gave this movie a chance (I lost interest halfway through with my VHS look at it), give this a second look on this Blu-Ray edition....and you will be blown away. This is, indeed, an amazing film."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2362195",
      "warningSpoilers": false,
      "date": "1 January 2011",
      "rate": "10",
      "helpful": "52 out of 77 found this helpful.",
      "title": "One of Ridley Scott's best",
      "content": "Blade Runner is quite simply wonderful, and not only is it one of Ridley Scott's best films, but also one of the best of the genre. For one thing, the visuals are superb. Not just in the special effects which are just mind-blowing but also in the cinematography, colours and sets. Another strong asset is the score, in fact Blade Runner is easily one of Vangelis's best by how mysterious and haunting it all is.The story is just great. True, it is the sort of film you need to see more than once to understand/appreciate it, but that is not a flaw in any way, quite the contrary. The story is very compelling, and also very deep thematically. Blade Runner is further advantaged by memorable dialogue, superb direction by Scott and good pacing. I can understand why some are underwhelmed by the ending, I was at first, but the more I saw the film the more the ending made sense to me. Finally the performances. Harrison Ford is perfectly cast, and Sean Young supports him admirably, but the real star of the cast is Rutgar Hauer who is outstanding in his role.In conclusion, a brilliant film and something Scott should be proud of. 10/10 Bethany Cox"
    },
    {
      "username": "fryguy-88668",
      "userUrl": "https://www.imdb.com/user/ur98678316",
      "reviewLink": "https://www.imdb.com/review/rw7907210",
      "warningSpoilers": false,
      "date": "28 February 2022",
      "rate": "6",
      "helpful": "25 out of 29 found this helpful.",
      "title": "Overrated IMHO",
      "content": "I know it is blasphemy to many, but I didn't love this movie. Somewhat groundbreaking in its use of actual darkness to impart the bleak tone. I'm a fan of Harrison Ford and Ridley Scott. The supporting cast is solid. It's just a bit boring at times."
    },
    {
      "username": "Horst_In_Translation",
      "userUrl": "https://www.imdb.com/user/ur3914439",
      "reviewLink": "https://www.imdb.com/review/rw6063134",
      "warningSpoilers": true,
      "date": "4 September 2020",
      "rate": "8",
      "helpful": "8 out of 9 found this helpful.",
      "title": "A wonderful movie on perspective and also extremely entertaining",
      "content": "\"Blade Runner\" is a film of which at least everybody has heard the title on one occasion or the other and many, many people have seen it too if we take a look at the amount of ratings here on imdb. It is from the year 1982, so it will soon have its 40th aniversary and maybe this happened already depending on when you read my review. It runs for minimally under two hours and is based on a novel by Philip K. Dick, who sadly died of heart failure only months before this film got released. The two writers in charge of the screenplay here were Fancher and Oscar nominee Webb Peoples and both are still alive in their 80s now. But the big name here is of course director Ridley Scott, who has worked on many big movies over the course of his really long career, but the fact that this one here is a massive contender for being his biggest career success still says it all about the film's popularity. The one person where this is probably not a contender for most popular film is lead actor Harrison Ford, but this is only because he was also a crucial player in the Star Wars franchise. And let's not forget about Indiana Jones of course. I have never been a big fan of either and consequently also not a big fan of Ford, but he was alright here. The fact that he does not necessarily play a very likable man as I would say is kinda explained at the end. But I will get to that later.First, a few more words on the cast: There are many cast members in smaller roles that I am not familiar with, even if they are/were also prolific actors. But one mention goes out to Sean Young, who plays the maybe most interesting character from this film. Easily the most stunning though I would say. Daryl Hannah's character is called \"perfect\" on one occasion by another character, but I could not disagree more. Young is perfect here in my opinion. Then again, I have always had a soft spot for dark-haired girls, so certainly biased here. So I mentioned Hannah now, she was very young here of course and most people are also familiar with her from the Kill Bill films and I must admit I did not even remember she was in this film here although, especially with the makeup, her character here is pretty memorable and interesting too. The scene right before the fight when she is in disguise in a similar manner like Bond going against Scaramanga was nice too, but Ford/Deckard is too much of a professional to not spot her quickly, even if he is still taken by surprise by her. Edward James Olmos, another very established actor in here, also plays an interesting character who kind of could have deserved his own film too. And last but not least, Rutger Hauer. Sadly he passed away not too long ago, but this film is maybe his most iconic performance and with the twist towards the end, I can totally see why. He is strong, he is ruthless, but he is much more than that. I will elaborate a bit on that later on.Just one more thing here about the main character and his love interest: We see the two leave eventually and it's not safe to say if others will be on their tails, on her tail especially, but the scene with the little thingey on the ground in the end implies that they may have gotten help from the Asian guy, who made it look as if she was dead, so nobody will know she is still alive and on the run. Actually, a strong premise for a sequel too and that sequel came, but no less than 35 years later and I must say I did not like the sequel at all, maybe because I hadn't seen or wasn't too familiar with the original, but then again it should never be essential to have seen a film in order to appreciate another. Still, it got Roger Deakins an Oscar finally, so it's good it exists. Also, another interesting thing about the original here is that it is set in 2019 as we find out at the very start, so in the past now as we are in 2020. Always an interesting aspect how people saw the future back then.Okay, now I want to elaborate a bit on the story and scenes and inclusions that I liked the most. Must initially give a brief summary of the premise. Mankind created replicants, man-like creatures that are as smart as the smartest men and stronger than the strongest. And they are very pain-resistent too. On one occasion, they said that the only way to hurt them, is to kill them. However, conflicts arose and war was declared against said replicants who were at distant planets and had to work as slaves. In this movie, six replicants manage to flee and come to planet Earth. Two of them were killed immediately and a bit of a pity that we find out nothing else about those. The other four get decent inclusions though, at least two of them also considerable screen time. The snake woman does not. She is the first who gets found by Deckard and he manages to take her down after a fight. Immediately afterwards, the protagonist runs into the second replicant and is basically caught with his pants down by him (just metaphorically), but luckily an unexpected ally is there to save his life. Two remain.Hannah's character is the third. It is kinda interesting how Deckard takes down one by one just like the Bride does in \"Kill Bill\". Anyway, as for this one here, Hannah is eventually still at her buddy Sebastian's home and that place is indeed very creepy somehow and extremely bizarre with all the lights and of course the mechanical creatures that Sebastian considers his friends. He is a weirdo, but not an evil man. He has no real choice other than helping the replicants. Hauer's character is mostly interested in an idea how he can keep himself alive for more than four years. Or actually cares more about keeping Hannah's character alive. This is how long the replicants have. Not a lot. There is a good quote about a parallel they have compared to light bulbs. And that is why he wants to see Joe Turkel's character and well, of course it is pretty shocking and violent and brutal how the latter gets murdered eventually, but you can make a bit of a point for this being not motivated by hate or anything, but just by hopelessness and desparation against the man who caused this by creating the replicants with a life span of four years and there is no option to have them live longer as we find out while they discuss all kinds of scientific processes.Now, the one thing I want to elaborate on most of all here is the definition of who is the offender and who is the victim. We follow Ford's character and he represents one side here and of course we side with him sooner or later, but at the same time we forget how he was recruited here early on. He had no choice, but was literally forced by his boss to follow his orders. Apparently, he worked for him or for the agency in the past already and he clearly was not happy at all with it back then and just hoped he could get away, but he has no choice. Maybe the one thing missing here a bit is an explanation of why they are called blade runners, but that is just a minimal criticism. Anyway, take a look at how Ford's character shoots the first replicant. She is running from him, trying to be safe, to get away, but gets murdered in cold blood. You can call it that. There is not too much to say about the second victim. Of course, it is another fight about life and death for him. But seeing Hannah's character die is also very telling being in disguise before that and eventually on the ground like a severely wounded animals. That is what the replicants are: Animals. Slaves. But all their violence results from what was done to them and not from being evil or anything. Not at all.Then with Hauer's character, there is the big revelation. Yes he breaks Deckard's fingers, but he does so because his loved ones were taken from him and apparently he also knew that it was not Deckard who killed the other male replicant, so only two fingers. Also pay attention to the hands. Roy (Hauer) easily could have broken Deckard's hand in that situation, maybe torn it off even, but he lets go. And his own hand is very injured. It may be the wildness, the muscles we see as Hauer's character runs around topless that has him appear like a beast to us, but that is what he is, again an injured monster and one who is stronger than the others. He is called the prodigal son for good reason earlier. And when we have that shot outside in the pouring rain with Deckard being in danger of falling to his death, but Roy lends him a hand and pulls him up before dying himself making his last deed an act of mercy shows us that he is not evil and neither are the other replicants. That camera shot from down there pointing up to Roy with the dove in his hand is pretty massive and very memorable, also how he lets the dove go in the moment of his death. Okay, maybe a bit unrealistic that this exact moment the Asian guy is there, but okay. Everything before that was so brilliant that I can accept it.In-between, I had several moments where I thought I could actually give this four stars out of five and not just three and thus declare it as one of 1982's finest, but the final sequence with Hauer's character on the chase was initially a bit underwhelming I felt, so I was hesitant, but the final twist and explanation about goodness, mercy and perspective (like I said in the title of my review) were just too good to be ignored. The film also could have ended the moment Hauer's character died, but the epilogue is also tolerable I suppose, even if it was not necessarily required. Without it, we would have thought that Rachael left and will not be followed and hunted down by Deckard as he owes her. That's what he said himself. But yeah, it's the message about (not just) slavery and about people only wanting the best for them without being evil. Only being heartbroken and disappointed may bring out the worst in them. Or how it matters so much from which perspective you watch a movie in how you perceive the characters. But they are 100% authentic, also showing their \"love\" in front of Sebastian. Watch it!"
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw2709999",
      "warningSpoilers": false,
      "date": "24 November 2012",
      "rate": "",
      "helpful": "23 out of 33 found this helpful.",
      "title": "One of the Best Looking Dark Films Ever Made",
      "content": "Blade Runner (1982)** 1/2 (out of 4) Rick Deckard (Harrison Ford) is one of the best Blade Runner's in the business. A Blade Runner is a person who is paid to go after illegal replicants and the most recent case has him going after four including the sadistic Roy Batty (Rutger Hauer).Ridley Scott's BLADE RUNNER was released with minor fans but overtime it grew into what many consider one of the greatest science fiction movies ever made. It's really hard to judge or rate this movie because it's available in so many different versions. This viewing here was actually the third version I've seen and I gotta say that if you have to keep re-editing, adding and altering a movie then I question how good it is to begin with.I know many people consider BLADE RUNNER to be one of the greatest movies ever made. I honestly get their reaction but I certainly don't share it. The film is certainly one of the most brilliantly looking movies ever made. Visually this film is rather incredible as director Scott has no problem creating the mood of this dark city as well as the rather grim nature. The special effects, costume design, sets and music score are all flawless and perfectly capture a terrific vision.With that said, I think there's a lot more style than substance here. Not for a second did I ever get totally involved in the \"story\" going on. I thought it was a rather interesting idea but storywise there's nothing great here. I also thought the slow nature was a bit too boring. I know this is a thinking man's approach but it just didn't work with me. With that said, the ending is quite excellent and I thought the scenes between Ford and Hauer were extremely effective.The performances from the entire cast is another major plus with Ford perfect in the role, which is a throwback to the type of detectives that we'd see in film noir titles of the 40s and 50s. Hauer makes for a great villain and we get nice support from Sean Young, M. Emmet Walsh, Edward James Olmos, William Sanderson, Joe Turkel and Daryl Hannah among others.Again, I understand why some call BLADE RUNNER one of the greatest films ever made. In my opinion, the original theatrical cut is quite poor. The Director's Cut was certainly an improvement. Having now just watched \"The Final Cut\" it reall didn't improve too much from the director's cut. As is, I'd probably recommend the Director's Cut."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2542483",
      "warningSpoilers": true,
      "date": "2 January 2012",
      "rate": "6",
      "helpful": "80 out of 138 found this helpful.",
      "title": "I just don't get it....",
      "content": "I admit right up front that I am perplexed by this film and my review will no doubt annoy a lot of fans of this film. Let's face it, \"Blade Runner\" is a cult film--and those who like it usually don't just like it--they adore it. I've known several people who insist rather rabidly that it's one of the greatest films of all time. And, when I tell them that I don't particularly like the film, they are confused---'how could anyone not love the film?' often say. In one case, the film lover insisted that I borrow his Director's Cut (one of about 17 different Director's Cuts or Special Editions, I think) because I must have been mistaken. Well, after my second viewing, I did enjoy and appreciate the film a bit more. But I still didn't get the devotion to this film it often receives.Here is what I liked and didn't like about the film. It had great sets and was VERY other-worldly. While I think the print was a bit too dark, I understand this was done to fit the very dark mood of the film. However, I just felt the film was too dark--oppressively dark...even sadistically dark (such as the eye gouging scene). It completely depressed me--so much so that I found I just didn't like or care about anyone. And, to top it off, the film ended very badly. The director's original ending (where you learn that Harrison Ford's character is also a replicant) would have been so much better. So, this is one case where the Director's Cut is definitely better, as this original ending has been restored. Overall, the film looks impressive and is original--but these alone were not enough for me to give it a glowing endorsement. It's good but that is all."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw2290155",
      "warningSpoilers": false,
      "date": "3 August 2010",
      "rate": "10",
      "helpful": "30 out of 47 found this helpful.",
      "title": "Living in Fear in a Quest for Life",
      "content": "In the beginning of the Twentieth-First Century, the Tyrell Corporation releases the evolution of robots in the Nexus phase with Replicants that are identical to humans, but with superior strength and agility and the intelligence of the genetic engineers who created them. They are used off-world as slave labor in the colonization of other planets. After a bloody mutiny in a colony, the Replicants are declared illegal on Earth and hunted down by the Blade Runner units, special police squads that shoot them to kill. The execution of a Replicant is called retirement.In November 2019, in Los Angeles, the retired Blade Runner Rick Deckard (Harrison Ford) is summoned by his former chief Bryant (M. Emmet Walsh) that assigns him to hunt down four Replicants that are hidden in Los Angeles. Deckard studies the profiles of Roy (Rutger Hauer), Pris (Daryl Hannah), Leon Kowalski (Brion James) and Zhora (Joanna Cassidy) and finds that they had been designed with four years lifespan maximum and they tried to infiltrate themselves in the Tyrell Corporation. Deckard visits their creator, Dr. Eldon Tyrell (Joe Turkel), in his corporation. Sr. Tyrell asks Deckard to demonstrate his Voigt Kampff method to discover the Replicants in his assistant Rachael (Sean Young) and Deckard concludes that she is a sophisticated Replicant but she does not know. When Deckard \"retires\" Zhora and Leon, he feels affected by their deaths and by the question of Rachel whether he has tested himself to know whether he is a Replicant. But he needs to end his mission and find Roy and Pris. \"Blade Runner\" is a melancholic work of art that raises existential questions about fear, life, death, emotions, mortality, humanity, dehumanization and love among other philosophical questions in an environment totally destroyed by excessive pollution, technology, marketing and consumption. The wrecked Earth is left to police and little people only, the others inhabitants have moved to the colonies in the off-world. The conflict appears when the retired Blade Runner Deckard is forced to hunt down Replicants again but now with different feelings, after falling in love for the Replicant Rachel and in doubt whether he is also a Replicant. Sean Young certainly has the best role of her career. The bleak cinematography and special effects are awesome and the soundtrack of Vangelis is among the most beautiful of the cinema history. I can not precisely say how many times I have watched the different versions of this film that is among my five favorite movies in the movie-theater, on VHS, on DVD and now on Blu-Ray, but my guess is at least twelve times. The last times I had seen this film were on 06 May 2000 and 31 May 2003. My vote is ten.Title (Brazil): \"Blade Runner\""
    },
    {
      "username": "paul-allaer",
      "userUrl": "https://www.imdb.com/user/ur48675674",
      "reviewLink": "https://www.imdb.com/review/rw4977300",
      "warningSpoilers": false,
      "date": "4 July 2019",
      "rate": "10",
      "helpful": "18 out of 26 found this helpful.",
      "title": "\"Los Angeles, November, 2019\" - an unforgettable movie theater experience",
      "content": "I saw \"Blade Runner\" in the theater again today (more on that later). First time I saw this film, it was the original version when it came out in Belgium (where I grew up) in 1982. Decades later, I saw it again, this time on DVD and in the \"Director's Cut\" or \"Final Cut\", I can't quite remember. The version I saw today was definitely the Final Cut.\"Blade Runner\" (originally released in 1982; The FInal Cut released in 2007; 117 min.) brings the story of Deckard, as he tracks down 4 replicants who have escaped from an Off World and need to be \"retired\" with extreme prejudice. As the movie opens, we are reminded it is \"Los Angeles, November, 2019\". YES, this very year! In Ridley Scott's (bleak and dark) vision of the future, LA is in permanent darkness and rain, with lots of pollution, and lots of overcrowding. Our man Deckard (Harrison Ford) meets Rachel (Sean Young), who may or may not be a replicant, who can tell for sure? In the meantime Roy Batty (Rutger Hauer) is the leader of the replicants and up to no good...While watching this in the theater today, I was struck by several things: first, the enormous vision from Ridley Scott this movie asked for (and received). Second, the set design and production is out of this world STILL, now almost 40 years later. Third, while there is very little \"action\", this movie flew by in no time (same as its Blade Runner 2049 sequel, incidentally). A movie like \"Blade Runner\" begs to be seen on the big screen. As luck would have, my art-house theater here in Cincinnati is doing a month-long sci-fi classics festival during July, and this was the first (and certainly not the last) that I was eager to see again in the theater. The July 4 matinee screening where I saw this at was attended very nicely, and I imagine the later screenings will be PACKED. If you have a chance to see \"Blade Runner\" in the theater, run, do not walk! It makes for an unforgettable movie theater experience."
    },
    {
      "username": "Sober-Friend",
      "userUrl": "https://www.imdb.com/user/ur16178412",
      "reviewLink": "https://www.imdb.com/review/rw3706989",
      "warningSpoilers": true,
      "date": "13 May 2017",
      "rate": "7",
      "helpful": "44 out of 65 found this helpful.",
      "title": "Adding My Voice to a Loud Chorus",
      "content": "I was 15 when the film was released in 1982. I remember Gary Franklin (A Movie Critic on Television) gave this film a \"10\" on a scale of 1 to 10 \"10\" being best. When a friend of mine saw this he hated it and so I never saw until 1992. That is when the \"Director's Cut\" was released theatrically. I was now 25 years. I wanted to see this because I saw a clip on television and someone saying this film was meant to be seen on the \"Big Screen\" and so off I went. This cut of the film is most well known for being the version that \"Took Away\" the Harrison Ford Voice Overs. It also included a shot of a unicorn that implied that \"Harrison Ford\" is a Replicant. I was not blown away by this film. I thought it was \"good\" not \"great\"The story does take its time but the rewards are huge if you pay close attention. . Its haunting images are so memorable that it influenced future filmmakers. In more ways than one it became the \"Metropolis\" of a new era. From the future setting to having different versions released. \"Blade Runner\" and \"Metropolis\" are 2 films one should watch back to back. Now my problem with \"Blade Runner\" is that each version is SLOW! The action could of moved faster. The story is very thin. Ridley Scott film is like an old man trophy wife. Pretty to look at but has almost nothing to offer!"
    },
    {
      "username": "joelhoff",
      "userUrl": "https://www.imdb.com/user/ur1492033",
      "reviewLink": "https://www.imdb.com/review/rw0191548",
      "warningSpoilers": false,
      "date": "5 March 2002",
      "rate": "10",
      "helpful": "826 out of 1,084 found this helpful.",
      "title": "A compelling, thematically-deep SF film",
      "content": "This is truly one of the greatest science fiction films ever made, one that requires a thinking viewer in order to understand and appreciate it. The director's cut is the recommended one to see as it omits a somewhat distracting narration and avoids an unnecessary Hollywood-style ending that is at odds with the rest of the film's tone.A true science fiction story or film is about ideas, not spaceship battles, futuristic gadgets, or weird creatures. \"Blade Runner\" fully qualifies as this in its examination of the impact of technology on human society, existence, and the very nature of humanity itself. These themes are set in a fairly basic detective story that moves slowly but gradually builds power as the viewer is immersed in a dystopian futuristic Los Angeles.Harrison Ford fans accustomed to the normally dynamic roles that he plays may be dissatisfied with the seemingly lifeless lead character that he portrays here as the replicant-hunting detective known as a \"blade runner\". They should be, for this dissatisfaction is part of the film experience, part of the dehumanized existence in the story's setting. However, as the story unfolds, we see Ford's character, Rick Deckard, slowly come alive again and recover some humanity while pursing four escaped replicants.The replicants, genetically-engineered human cyborgs, that Deckard must hunt down and kill are in many ways more alive than Deckard himself initially. Their escape from an off-world colony has an explicit self-directed purpose, whereas Deckard's life appears to have none other than his job, one that he has tried to give up. By some standards, Deckard and the replicants have thin character development. However, this is a deeply thematic and philosophical film, and as such the characters are the tools of the story's themes. Each character reflects some aspect of humanity or human existence, but they lack others, for each is broken in ways that reflect the broken society in which they live and were conceived/created.There are several dramatic moments involving life-and-death struggles, but most of these are more subdued than in a normal detective story plot. The film's power is chiefly derived through its stunning visual imagery of a dark futuristic cityscape and its philosophical themes.Among the themes explored are the following: - The dehumanization of people through a society shaped by technological and capitalistic excess. - The roles of creator and creation, their mutual enslavement, and their role reversal, i.e., the creation's triumph over its creator. - The nature of humanity itself: emotions, memory, purpose, desire, cruelty, technological mastery of environment and universe, mortality, death, and more. - Personal identity and self-awareness. - The meaning of existence.If you are not someone who naturally enjoys contemplating such themes, the film's brilliance may be lost on you. The climax involves a soliloquy that brings many of the themes together in a simple yet wonderfully poetic way. Anyone who \"gets\" the film should be moved by this; others will sadly miss the point and may prefer watching some mindless action flick instead.\"Blade Runner\" is a masterpiece that deserves recognition and long remembrance in film history."
    },
    {
      "username": "perica-43151",
      "userUrl": "https://www.imdb.com/user/ur89494061",
      "reviewLink": "https://www.imdb.com/review/rw4245891",
      "warningSpoilers": false,
      "date": "20 July 2018",
      "rate": "10",
      "helpful": "23 out of 32 found this helpful.",
      "title": "The ultimate sci fi flick, well ahead of its time",
      "content": "Perhaps the best sci fi movie ever made, this cult classic was underappreciated at its time. This only shows how shortsighted critics and American public can be. This movie is perfect in many ways, is prophetic, well made, and if not the best movie ever made is close to that, certainly in the sci fi genre."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw8184176",
      "warningSpoilers": false,
      "date": "28 May 2022",
      "rate": "8",
      "helpful": "11 out of 15 found this helpful.",
      "title": "A Drenched & Decrepit Dystopia...",
      "content": "If your curse is accelerated decrepitude, longevity is something that's clearly not accrued, you'll be treated like a slave, when equality is all you crave, in the catastrophic climate you've been skewed.If you try to break the rules and integrate, the only recourse left to them is based on hate, where you're hunted like a dog, through the streets of rain and smog, unavoidably it's time to abdicate.Oozing metaphors from almost every pore, the dreams of unicorns lay behind several locked doors."
    },
    {
      "username": "chaswe-28402",
      "userUrl": "https://www.imdb.com/user/ur67278807",
      "reviewLink": "https://www.imdb.com/review/rw3801402",
      "warningSpoilers": false,
      "date": "9 September 2017",
      "rate": "10",
      "helpful": "14 out of 19 found this helpful.",
      "title": "Miraculous masterpiece: great",
      "content": "Several years ago I may have read the original story, but don't remember it; and it doesn't matter. The same bleakly powerful message probably pervades both book and picture. The fact is, we are all replicants. The bitter truth is, we have no purpose, except to reproduce ourselves. Whether our life-span last 4, 40 or 140 years, it is as purposeless and pointless as if we were androids. Which we are. It doesn't matter what we have seen or experienced. We will pass and be forgotten, like the rest. It has been noticed that this film contains no families, or children. The need for that traditional, outdated method of self-replication has been eliminated, and people are simply duplicated, in different models, with variations. Memories are routinely fed into replicants, to convince them that they have reality, however spurious. If there ever was a creator, he was definitely killed, for his presumption. There is no doubt that, like everyone else, Deckard is a replicant. The film is frighteningly and permanently effective, for anyone who thinks about it, in every way. It's an image of our actual lives, here and now.Everything about Blade Runner is absolutely fabulous. It soars where the clunky and semi-literate Kubrick stumbles and fumbles.Now that I've read the book, and watched \"Dangerous Days\", I learn that Tyrell, the supposed creator, was merely another replicant, which simply confirms what I already believed.The performances are nonpareil. The girl playing Rachael (funny spelling) is perfection itself. But all the players are flawless, anyway. The vision is transcendental, matchless. A magnificent meditation on the reality of death, and life's ultimate lack of meaning."
    },
    {
      "username": "THE-BEACON-OF-MOVIES-RAFA",
      "userUrl": "https://www.imdb.com/user/ur34290913",
      "reviewLink": "https://www.imdb.com/review/rw5487599",
      "warningSpoilers": false,
      "date": "16 February 2020",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "The pinnacle of quality film making. ( A+ Movie) My Ratings 10/10",
      "content": "Magic. The stuff books are made of. Palpable, dreamlike, experimental, industrial and just pure magic. When a film is this flawed and yet still floors absolutely everyone with its power to command tone and its ability to influence and yet still stand alone, it's clearly worthy of the praise and the acclaim. There are very few cyberpunk movies and even less good ones. Blade Runner is simply the best one. It's also a work of art and one of the best movies ever made. There are moments where Harrison Ford's Deckard aches with deep sadness, a lost soul himself looking out over the wretchedness that has become of the world, shaking and confused when he buys a bottle of vodka immediately after retiring his 'first' replicant. In these moments it doesn't matter either way if he is a replicant or not, amidst all the more well-known highlights of this classic, these humanising and most overlooked moments are why I love it so deeply."
    },
    {
      "username": "RusselleBell",
      "userUrl": "https://www.imdb.com/user/ur4387469",
      "reviewLink": "https://www.imdb.com/review/rw0979847",
      "warningSpoilers": false,
      "date": "12 December 2004",
      "rate": "",
      "helpful": "256 out of 365 found this helpful.",
      "title": "Finest hour.",
      "content": "This is simply Scott's finest hour. There are a sheer plethora of futuristic films with vision. Films which crudely grope into a possible time ahead,when perhaps a post apocalyptic era is scattered with cliché upon cliché and often miss the whole point. What Ridley Scott achieved with this film,is an entirely possible scenario. It really does feel like a science fiction novel brought to life,but not so much as its derivative penned by Phillip K Dick(do androids dream of electric sheep?). Its a grimy,violent world inhabited by the sick,lower class,villainous second citizens who haven't quite made the grade for the off world colonies. We have a true smelting pot of nationalities.The heavy eastern references within china town like inner cities is particularly poignant.This film also sees Ford in perfect casting.Theirs a rye charm that Ford has that no other actor could fake or fill quite as effortlessly. Its a mixed review depending on what version you have seen. For me,the directors cut is simply too cut. I preferred the audience friendly screening which had the wonderful narration. The finest moment with this narration has to be the moments described by Batty in his dying eyes and the summing up by Ford of this man/machines passion and love for life.. No other sci-fi futuristic film has ever made the grade before or since in my humble opinion. It captured the raw smells and light of a brutal future scarily depicted in films or even so well. From the chase scene with Zora to the flybys over the city capturing a stunning skyline,chimneys and skyscrapers in one shot. This is my favourite movie of all time for all the reasons above and many more i could effortlessly type all day and night."
    },
    {
      "username": "marntfield",
      "userUrl": "https://www.imdb.com/user/ur6073311",
      "reviewLink": "https://www.imdb.com/review/rw1126841",
      "warningSpoilers": false,
      "date": "14 July 2005",
      "rate": "9",
      "helpful": "335 out of 462 found this helpful.",
      "title": "Timeless",
      "content": "What can be said about this film that hasn't already been covered in preceding decennia? Blade Runner (either version) stands the test of time as an epic story which transcends a disparity of genres, as well as the seminal \"dark\" sci-fi film which has been mimicked so frequently (to varying degrees of success) since its original release. The interplay of film noir, sci-fi, and what is one of the most philosophically symbolic and academically analyzed narratives of the modern era holds its ground on both visual and cerebral levels even in the face of today's CGI laden blockbusters. The new director's cut, contrary to many cinematic re-hashings, actually serves to clarify many of the more nebulous aspects of the plot and makes a great film even better, arguably allowing it to be modernized and polished for a new generation of viewers who are more picky and yet simultaneously less idealistic. All while sustaining the feeling and flavor of the original. Call it restorative work if you will. The tinny and meandering score by Vangelis is pure 1980s at its most brooding and fits the texture and mood of the film beautifully. Indeed, for many reasons, finding this film in someone's DVD collection makes a true statement about their discriminating and refined taste in movies, and equally their appreciation of film as an artistic medium. I would suggest picking up a reader by someone like Nietzsche, Foucualt, Descartes, Kierkegaard, or any of the great existentialist philosophers after viewing this film in order to appreciate the story & its concepts at a whole new level, regardless if you're watching it for either the 1st, or the 100th time. An enduring classic and an intrepid piece of film-making with rich & often haunting visuals designed to entertain and promote introspection amongst its viewers. 9/10."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3204824",
      "warningSpoilers": false,
      "date": "19 March 2015",
      "rate": "9",
      "helpful": "13 out of 20 found this helpful.",
      "title": "important sci-fi film",
      "content": "Early in the 21st Century, the Tyrell Corporation advanced Robot evolution into the NEXUS phase known as Replicants. Replicants were used Off-world as slave labor, in the hazardous exploration and colonization of other planets. After a bloody mutiny, they were declared illegal on earth and Blade Runner units were created to retire trespassing Replicants. It's 2019 Los Angeles. Policeman Gaff (Edward James Olmos) brings in ex-blade runner Rick Deckard (Harrison Ford). Bryant (M. Emmet Walsh) orders him to track down four escaped Nexus 6 models. Roy Batty (Rutger Hauer) leads Zhora (Joanna Cassidy), Leon Kowalski (Brion James) and Pris (Daryl Hannah). Deckard goes to test the new Nexus 6 model by using the machine on Rachael (Sean Young). Dr. Eldon Tyrell (Joe Turkel) hasn't told her. The Replicants track down Hannibal Chew (James Hong) and J.F. Sebastian (William Sanderson) to meet Tyrell.I remember first seeing this on cable with the happy ending. It remains the version I like the most despite its inherit contradiction. I still like the shock of the green with the Vangelis music driving into the future. Also I like the voice-overs despite their detractors. I love the final voice-over during the happy ending which is eliminated in the final cut. In addition, I cannot abide by Deckard being a Replicant. This is great cyberpunk vision of the future. Its designs are still influential. I love the hard-boiled noir genre being married to a sci-fi movie. It does move slowly in the middle but I accept that flaw. It is meticulous and detailed visually. The Philip K. Dick story is compelling. It remains an important sign post in the sci-fi genre."
    }
  ],
  "errorMessage": ""
}