{
  "imDbId": "tt0084787",
  "title": "The Thing",
  "fullTitle": "The Thing (1982)",
  "type": "Movie",
  "year": "1982",
  "items": [
    {
      "publisher": "Empire",
      "author": "Adam Smith",
      "link": "https://www.empireonline.com/movies/reviews/thing-2-review/",
      "rate": "100",
      "content": "The Thing is a peerless masterpiece of relentless suspense, retina-wrecking visual excess and outright, nihilistic terror, placing 12 men at an Antarctic station while a shapeshifter takes them over one by one."
    },
    {
      "publisher": "",
      "author": "The Guardian",
      "link": "https://www.theguardian.com/film/filmblog/2011/nov/22/my-favourite-film-the-thing",
      "rate": "100",
      "content": "The menace of the dark polar night and the claustrophobic confines of the base are utilised to raise the fear, tension and paranoia to unbearable heights. This is a creature that doesn't just hide in the dark, but could be your friend, your colleague, or the girl beside you whose hand you are breaking in a terrified vice-like grip."
    },
    {
      "publisher": "Time Out",
      "author": "Tom Huddleston",
      "link": "",
      "rate": "100",
      "content": "The Thing has emerged as one of our most potent modern terrors, combining the icy-cold chill of suspicion and uncertainty with those magnificently imaginative effects blowouts."
    },
    {
      "publisher": "Austin Chronicle",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "The Thing is paranoid, bleak, uncompromising, and thankfully devoid of a traditional Hollywood happy ending. Led by Russell, the ensemble cast is outstanding, but the real star of the film is Rob Bottin's imaginative creature effects."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/thing-the",
      "rate": "75",
      "content": "A paranoia-choked atmosphere is the primary reason why The Thing works as well as it does. The setup is standard stuff, establishing that the characters are isolated and can expect no help from the outside. The realization there could be an alien among them, and any one of them might not be human, is what launches The Thing into a spiral of escalating tension."
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/movies/the-thing/review/2030277487/",
      "rate": "75",
      "content": "With its fades to blinding white and its atmosphere of testosterone-fueled paranoia, Carpenter's remake hews more closely to the source material — John W. Campbell, Jr.'s 1938 novella \"Who Goes There?\" — than THE THING FROM ANOTHER WORLD and is a masterful exercise in claustrophobic suspense."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/the-thing-1982",
      "rate": "63",
      "content": "The Thing is basically just a geek show, a gross-out movie in which teenagers can dare one another to watch the screen. There's nothing wrong with that; I like being scared and I was scared by many scenes in The Thing. But it seems clear that Carpenter made his choice early on to concentrate on the special effects and the technology and to allow the story and people to become secondary."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1981/film/reviews/the-thing-2-1200425077/",
      "rate": "40",
      "content": "If it’s the most vividly gruesome monster ever to stalk the screen that audiences crave, then The Thing is the thing. On all other levels, however, John Carpenter’s remake of Howard Hawks’ 1951 sci-fi classic comes as a letdown."
    },
    {
      "publisher": "The New York Times",
      "author": "Vincent Canby",
      "link": "https://www.nytimes.com/reviews/movies?res=9801E6DA103BF936A15755C0A964948260",
      "rate": "30",
      "content": "The Thing is too phony looking to be disgusting. It qualifies only as instant junk."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "30",
      "content": "Carpenter's direction is slow, dark, and stately; he seems to be aiming for an enveloping, novelistic kind of effect, but all he gets is heaviness."
    }
  ],
  "errorMessage": ""
}