{
  "imDbId": "tt0084787",
  "title": "The Thing",
  "fullTitle": "The Thing (1982)",
  "type": "Movie",
  "year": "1982",
  "items": [
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0197822",
      "warningSpoilers": true,
      "date": "26 July 2004",
      "rate": "10",
      "helpful": "510 out of 568 found this helpful.",
      "title": "A classic that still holds up to this very day",
      "content": "\"I know I'm human. And if you were all these things, then you'd just attack me right now, so some of you are still human. This thing doesn't want to show itself, it wants to hide inside an imitation. It'll fight if it has to, but it's vulnerable out in the open. If it takes us over, then it has no more enemies, nobody left to kill it. And then it's won.\"John Carpenter's \"The Thing\" is one of the most entertaining horror films ever made  fast, clever and purely exciting from start to finish. This is how all movies of the genre should be made.Taking place in the Antarctic in 1982, the movie focuses specifically on a group of American scientists. We are given no introduction to their mission, but are thrust into their existence when a pair of seemingly crazy Norwegians appears at their base camp, chasing an escaped dog. The Norwegians are killed, and the dog finds its way into the colony, which is when things really start to get crazy.It is soon made quite clear that the \"dog\" is actually a shape-shifting alien organism, which manifests itself upon the physical form of its victims  in other words, it begins to eat the Americans, and imitate them so well that the remaining humans cannot discern the difference between their friends and enemiesThe pack of scientists, led by MacReady (Kurt Russell), begin to fight for their own survival, using wits instead of brawn. If the Thing is indeed amongst them, then how are they to go about revealing it? How many Things are there? How can the Thing be killed? (Or can it be destroyed at all?)The creature's origins in the film are explained easily: Thirty thousand years ago a spacecraft plummeted to Earth, and was frozen in the Antarctic ice. The Thing tried to escape, and was discovered in the ice by the Norwegians, who unknowingly released it from its natural prison.\"The Thing,\" the movie itself, is similar to Ridley Scott's iconic \"Alien\" (1979). Many comparisons have been made  the protagonists are stranded in a desolate area, stalked by a seldom seen foe that manages to kill them off one-by-one. However, \"The Thing\"  for all practical purposes  came first.Based on the famous short story \"Who Goes There?\" by John W. Campbell, Jr. (writing under pseudonym as Don A. Stuart), the film was originally adapted as a feature production in 1951 by Howard Hawks and Christian Nyby. The result was \"The Thing From Another World,\" an unarguable classic. But to be fair, it bore little resemblance to the short story, and Carpenter's remake does it more justice.The idea of the Thing being able to adapt the physicality of anyone is what essentially makes this movie so great, and is the most vital link to the short story. In 1951 the special effects were simply too poor to reasonably portray the shape-shifting organism, but thirty-one years brought many advances in SFX.Creature effects artist Rob Bottin does an excellent job of turning what could have easily become a cheesy gore-fest into a startlingly frightening (and realistic) mess of blood and fear. The Thing, although never actually taking one specific form, is constantly seen in a morphing stage, and the effects are simply superb. They still pack a punch twenty-two years later.Ennio Morricone's score (nominated for a Razzie Award at the time) is a bit too electronic and tinny, but nevertheless haunting when used correctly. From the fact that its cast consists entirely of males, to the fact that its ending is one of the most thought-provoking and untypical conclusions of all time, \"The Thing\"  by any standards  is unconventional Hollywood at its best. It comes as no surprise that, at the time of its release, \"The Thing\" performed poorly in theaters, and \"E.T.\"  released the same year and featuring a much kinder alien  became the higher-grossing picture of the two (by far).In the long run, however, \"The Thing\" is superior in almost every conceivable way. Spielberg's tale is outdated and flopped during its 20th Anniversary Re-Release. \"The Thing,\" on the other hand, has gradually climbed a ladder of cult classics  it is one of the most famous non-famous movies ever made.Carpenter is notorious for having a very uneven career  from his amazing \"Assault on Precinct 13\" (1976) to the magnificent \"Halloween\" (1978) to the disappointing and silly \"Escape from L.A.\" (1996), \"The Thing\" remains his very best motion picture. Although its reputation over the years has never been honorary enough to land it a spot on most \"great movies\" lists, \"The Thing\" is still one of my favorite horror films, and  upon close inspection  masterfully crafted. It is a daring and ingenious thrill-ride that is simultaneously unique and chilling  a genuine relief for film buffs who are tired of the same old horror knock-offs. This one, at the very least, is genuinely unpredictable."
    },
    {
      "username": "ivo-cobra8",
      "userUrl": "https://www.imdb.com/user/ur15140057",
      "reviewLink": "https://www.imdb.com/review/rw3346521",
      "warningSpoilers": false,
      "date": "31 October 2015",
      "rate": "10",
      "helpful": "291 out of 322 found this helpful.",
      "title": "\"The Thing\" is John Carpenter's masterpiece and one of the best classic horror films!",
      "content": "A classic film. John Carpenter's \"The Thing\" is one of the most entertaining horror films ever made - fast, clever and purely exciting from start to finish. It is one of my personal favorite horror movies. This is how all movies of the genre should be made. Set on an isolated base in Antarctica, this version seems almost to pick up where the original version (The Thing From Another World) left off. The American scientists discover a decimated Norwegian base some miles distant. Everyone is dead, and only the half charred remains of some unidentifiable thing left to smolder outside the compound might offer any answers to what may have happened. The Thing is brought back to the American base and, too late, the scientists realize that it is alive and lethal. The Thing thaws out and is off, not only killing anyone and anything that crosses Its path, but also absorbing them, making Itself into whoever and whatever it wants. The film then turns into a brilliant paranoia piece. Everyone is suspect, anyone can be The Thing, and no one trusts anyone anymore. Gone is the strength and security found when human beings band together in spite of their differences to battle a monster. The group splinters and fear rules supreme. Who is the Thing?Seriously I Love this movie I love it To Death. I love Escape From New York and I love Escape From L.A. but I also love The Thing so much better this is definitely the best Carpenter film a truly masterpiece classic I love R.J. MacReady - Kurt Russell I love everything about this film that is. Science Fiction, Horror and an Action Epic Film. A lot of the practical effects were left out but the it looked nice and the acting was good and it expanded upon the monsters background and showing you the inside of the ship. It must of been tough to bring across on screen the visual design. In my opinion, nobody has topped this film in the 25-odd years since its release. I'll put any of \"The Thing's\" old-school effects up against any CGI-driven movie, or this cast against almost any other ensemble. If you haven't seen the film yet, I envy you because I WISH I could see \"The Thing\" again for the first time. WOW! Does more need to be said? How about this...there is no parallel. Who's your friend? Who's the Thing? Who do you trust? Who can you afford to trust? If you've never seen this movie...your in for a treat. The only other movie that had such an impact on me was The Matrix (the first movie)...where I left the theater touching the walls wondering if they were really real. This movie will leaving you wondering....is the guy/gal next to you really real?\"Trust is a tough thing to come by these days.\" John Carpenter's The Thing is a seminal piece of horror that is not only a fine specimen of its era, but it also serves as a shining example of horror done absolutely right in any era. Combining gross-out special effects reminiscent of Hellraiser, the nail-bitingly intense, claustrophobic filmmaking of Alien, offering a story that is very well-paced, such as George A. Romero's Dawn of the Dead, and presenting the idea that true terror can be found at any time, in any place, and inside anyone, much like Alfred Hitchcock's Psycho, The Thing works on every level, and represents the peak of each and every aspect that may be utilized to make horror films effective. Granted, this amalgamation of styles is not the only formula for winning horror.The basic plot about this movie is Horror-moister John Carpenter (Halloween, Escape from New York) teams Kurt Russell's outstanding performance with incredible visuals to build this chilling version of the classic The Thing. In the winter of 1982, a twelve-man research team at a remote Antarctic research station discovers an alien buried in the snow for over 100,000 years. Once unfrozen, the form-changing alien wreaks havoc, creates terror and becomes one of them.It is one of the best favorite horror films of the 80's ever. I love this film to death. The Thing is the best classic horror film from master and genius John Carpenter! 'The Thing' is classic Carpenter and one of the few remakes that is better than the original. Kurt Russell's characters: Snake Plissken, R.J. MacReady and Jack Burton are Kurt's best favorite characters he ever played. I also love the music score from Ennio Morricone! Awesome!!! 10/10 Grade: Bad Ass Seal Of Approval"
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw1833451",
      "warningSpoilers": false,
      "date": "4 March 2008",
      "rate": "10",
      "helpful": "191 out of 223 found this helpful.",
      "title": "Flips the scenario round from the original to great effect.",
      "content": "John Carpenter shows how much he loves the 1951 original by giving it the utmost respect that he possibly could, the only difference here is that Carpenter chooses to stick to the paranoiac core of John W Campbell Jr's short story.The secret to this version's success is the unbearable tension that builds up as the group of men become suspicious of each other, the strain of literally waiting to be taken over takes a fearful hold. Carpenter then manages to deliver the shocks as well as the mystery that's needed to keep the film heading in the right direction.Be it an horrific scene or a \"what is in the shadow\" sequence, the film is the perfect fusion of horror and sci-fi. The dialogue is laced with potency and viability for a group of men trying to keep it together under such duress, while Ennio Morricone's score is a wonderful eerie pulse beat that further racks up the sense of doom and paranoia seaming throughout the film.The cast are superb, a solid assembly line of actors led by Carpenter favourite Kurt Russell, whilst the effects used around the characters get the right amount of impact needed. But most of all it's the ending that is the crowning glory, an ending that doesn't pander to the norm and is incredibly fitting for what has gone on before it. Lets wait and see what happens indeed. 10/10"
    },
    {
      "username": "preppy-3",
      "userUrl": "https://www.imdb.com/user/ur0463200",
      "reviewLink": "https://www.imdb.com/review/rw0197779",
      "warningSpoilers": false,
      "date": "6 December 2003",
      "rate": "10",
      "helpful": "194 out of 239 found this helpful.",
      "title": "Right up there with \"Halloween\"--one of Carpenter's best!",
      "content": "Remake of the classic 1951 \"The Thing From Another World\". 12 men are in a completely isolated station in Antartica. They are invaded by a thing from outer space--it devours and completely duplicates anything it chooses to. It starts off as a dog but gets loose--and has a chance to duplicate any of the men. Soon, nobody trusts anyone else--they're isolated--the radio is destroyed--their helicopter likewise. What are they going to do?The 1951 film had the thing just be a big, super human monster. That movie was scary. This one is too--but the story is different (and based more closely on the source material--the novelette \"Who Goes There?\") and it's scary in a different way. The movie starts right off with Ennio Morricone's extremely eerie score setting just the right tone and--when the Thing gets attacked--the amount of gore is astounding. There's blood and body parts flying all over--arms are bitten off, heads detach and--in the strongest one--one man is devoured face first by the Thing. The gore effects are STRONG and real nightmare material. I don't scare easy but I had to sleep with the lights on when I saw this originally back in 1982. Rob Bottin's effects are just incredible--how this picture got by with an R rating is beyond me!It also has a very creepy feel--gore aside, it is very suspenseful. You're not sure who is what and Carpenter's direction and the score really build up the tension. One complaint--no one is given any distinctive personality traits. They actors just remain straight-faced and say their lines. That's annoying...but the movie still works.This was a critical and commercial disaster in 1982--it competed with \"E.T.\" and MANY critics complained about the amount of gore and there being no female characters in the movie. It's now considered one of John Carpenter's best. A must-see...for strong stomaches. NOT a date film!An amusing note: When this was released Universal sent a note along with all prints of the film. They suggested to theatre owners that they play the film in an auditorium near the rest rooms. They were afraid that people would be so sickened by the violence that they'd have to be close to a facility to throw up!"
    },
    {
      "username": "Gafke",
      "userUrl": "https://www.imdb.com/user/ur2074560",
      "reviewLink": "https://www.imdb.com/review/rw0197784",
      "warningSpoilers": false,
      "date": "28 December 2003",
      "rate": "10",
      "helpful": "362 out of 426 found this helpful.",
      "title": "Intelligent Splatter",
      "content": "This is another one of those films that I remember staying up late to watch on TV, scaring the crap out of myself at the impressionable age of 12 or so and dooming myself thereafter to a life of horror movie obsession. This is a GREAT movie, and stands as living proof that there were indeed realistic effects before CGI.Set on an isolated base in Antarctica, this version seems almost to pick up where the original version (The Thing From Another World) left off. The American scientists discover a decimated Norwegian base some miles distant. Everyone is dead, and only the half charred remains of some unidentifiable thing left to smolder outside the compound might offer any answers to what may have happened. The Thing is brought back to the American base and, too late, the scientists realize that it is alive and lethal. The Thing thaws out and is off, not only killing anyone and anything that crosses Its path, but also absorbing them, making Itself into whoever and whatever it wants. The film then turns into a brilliant paranoia piece. Everyone is suspect, anyone can be The Thing, and no one trusts anyone anymore. Gone is the strength and security found when human beings band together in spite of their differences to battle a monster. The group splinters and fear rules supreme. Who is the Thing?The gore effects here are absolutely amazing and messily realistic. I could have done without the dogs head splitting open like a banana peel, but that's just the animal lover in me being picky: kill all the humans you want, but leave the kitties and puppies alone. Sanity and reason disintegrate rapidly as, one by one, the humans are taken over by the shapeshifting alien. The power of this film lies in its paranoia, and although I liked the original version, I prefer this one; the real threat lies within, and is scarier for the fact that it cannot be seen or easily detected. When it is forced out of hiding, it's wrath is huge and the results are horrific.This is one of Carpenters best films, right up there with The Fog and Halloween. All of the actors give strong, realistic performances and the special effects are so powerful that they stand as their own main character. This film has something for any lover of the horror genre. Don't miss it."
    },
    {
      "username": "Stibbert",
      "userUrl": "https://www.imdb.com/user/ur5803818",
      "reviewLink": "https://www.imdb.com/review/rw1123843",
      "warningSpoilers": false,
      "date": "11 July 2005",
      "rate": "9",
      "helpful": "317 out of 354 found this helpful.",
      "title": "Today it's still one of the best horror films",
      "content": "Antarctica, winter 1982. The team on an American research base get surprised by a couple of mad Norwegians who is chasing a dog with a helicopter, trying to kill it. All the Norwegians are killed and the Americans are left with nothing, but a dog, a couple of bodies and questions. That's the beginning of the greatest horror/thriller film I've ever seen.From the very beginning all to the end you feel the tense, paranoid mood. Helpless and alone out in no-mans land. Ennio Morricone was nominated for a Razzie Award for his score. Why I don't know 'cause as far as I can see his score is simple, creepy and very good. It really gets you in the right mood.The acting is great! The best performance is probably given by the dog who's just amazing. As for Russell and the others on two legs I can say nothing less.You may think 1982 and special effects are not the most impressive? Well, think again! You haven't seen it all until you've seen this. Bodyparts falling off and creatures changing forms... Rob Bottin has done a great job witch today stands as a milestone is special effects makeup.The movie didn't get a big response when it first hit the big screen due to other alien films at the time and so it's not very well known. In fact you can almost consider it an unknown movie. Nobody I've asked have heard of it. However the movie has managed to survive for over twenty years as a cult film on video and DVD. Twenty years is a long time and except for the haircut the movie is still pretty much up to date. This movie is to be considered a classic.The movie is without doubt one of my, if not my favorite. I've seen it several times, but it's just as good as the first time I saw it. As a Norwegian the only thing I don't like about this movie is that MacReady keeps calling the Norwegians swedes!"
    },
    {
      "username": "Rainfox",
      "userUrl": "https://www.imdb.com/user/ur0411781",
      "reviewLink": "https://www.imdb.com/review/rw0197426",
      "warningSpoilers": false,
      "date": "27 May 2000",
      "rate": "",
      "helpful": "426 out of 477 found this helpful.",
      "title": "Good things come to those who wait",
      "content": "* * * * ½ (4½ out of 5) The Thing Directed by: John Carpenter, 1982 Looking back on John Carpenter's The Thing  today a highly treasured cult favourite  one has to wonder why it was dismissed by both the audience and critics when it first came out in 1982. Steven Spielberg's extra terrestrial adventure about a sweet alien that phoned home (that stole the hearts of both children and adults world wide) had opened just two weeks before and was on its historic box office rampage. Bad scheduling may have had a greater impact than anything else on the fate of Carpenter's first big studio effort for Universal Pictures. Nobody was prepared  moreover wanted anything so dark, gory and scary as this genuine remake of the famous 1951 original. This was the time of E.T.: The Extra-Terrestrial. It then makes for great movie history trivia, that The Thing has gained such a remarkable afterlife on video, DVD and television. Both financially and critically. Carpenter's version is less a remake of the Howard Hawks' version than a more faithful adaptation of John W. Campbell's short story \"Who Goes There?' (on which both were based), and critics today point out how well Carpenter plays his characters against each other. Kurt Russell will never top this one, and he gets a brilliant sparring from the entire cast. It opens in Antarctica with a sled husky running from a pair of crazed and armed Norwegian men in a helicopter. The scene is long, slow and uneasy. It feels like the Apocalypse. It oozes doomsday. This scene comprises one of the greatest opening sequences in film history. Ennio Morricone's moody synth score (heavy on naked thumping bass lines in classic Carpenter style), the windswept massive white of the desolate polar ice and the majestic husky running across the tundra chased by the chopper, compromises a completely mesmerizing piece of scenery. A satisfying example of a movie that today  18 years after  looks downright muscular in its simplicity. The budget was big ($14 mill), yet it allowed Carpenter to visualize his ideas better than ever before. There's a brooding darkness to this film, making the whites and blues of the icy Antarctic claustrophobia seem poetic and almost angelic. Dean Cundey's extraordinary photography created a palpable chill to every shot. The careful preparation (the crew went into a record 11-month pre-production) paid off immensely. Horror specialist Rob Bottin was handpicked for the many gory and grotesque special effects. Be warned  there's a lot of splatter and gore here. The Thing is actually notorious for its creature morphing scenes. Some find them disgusting, some mere cult.An argument could be made against The Thing being an Alien rip-off; it has its origins in an old sci-fi story and it creates tension by popping a crowd of people (note: all-male) on an isolated outpost (an Antarctic research facility) terrorized by an alien life form. Where Carpenter was clearly inspired by Ridley Scott's 1979 masterpiece, his own alien movie is original and intriguing in its own right. There's a rhythm and an environment that equals Scott's in every way. The husky was in fact half-wolf and half-dog, and it was noted that it never barked or growled on or off the set (Horror Takes Shape, the making of - DVD version). Watch in awe at the scene where it walks through the hallway and stares at a human shadow, slightly tilting its head forward in stalking position like a wild wolf. This is a fine piece of animal training, sure, but that's not the point. This is as spooky as anything ever made in a horror movie. Carpenter had all the right tools here, and he utilized them to perfection, making The Thing his best movie alongside Halloween."
    },
    {
      "username": "I_Ailurophile",
      "userUrl": "https://www.imdb.com/user/ur1964495",
      "reviewLink": "https://www.imdb.com/review/rw6379386",
      "warningSpoilers": false,
      "date": "19 December 2020",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "The tagline is no mere jest",
      "content": "\"The ultimate in alien terror,\" it says. It's not wrong. This is it. This is the greatest horror film ever made. John Carpenter's A-#1.Cinema is full of great creature designs, yet The Thing bests them all. Every incarnation we see of the creature, and all the practical effects and set pieces that bring it to life, are the best that the industry has to offer. The most realistic CGI will never compete.The paranoia and distrust in the outpost is palpable. Carpenter crafts a tangible atmosphere of desperation and suspicion, from the unassuming beginning to the classic, ambiguous end--one of my very favorite endings from any movie, ever.Composer extraordinaire Ennio Morricone lends his great skills with a minimalist, synth-driven score that adds immensely to the building unease. It very well complements the performances of the excellent ensemble cast that bring every feeling of terror and wariness to life. Kurt Russell once again shines as Carpenter's lead, MacReady, and Keith David is superb as the antagonistic Childs. It's easy to overlook other cast members with smaller roles and less time on screen--even the unmistakable Wilford Brimley--but have no doubt, they're all just as good, just as essential to the picture.Once again: not only is John Carpenter a master storyteller, a fantastic director generally, but his greatest skill is in slowly building the tension and suspense in his pictures until the explosive finale. He does it so well that it's impossible for the viewer not to experience the same misgivings, the same sense of horror, as the characters on-screen--not because you're watching it, but because you FEEL it just as deeply.It's violent, it's gory, and broadly it may not be for everyone. But this needs to be seen by anyone with the slightest interest in horror, or creature features, or with a keen interest in cinema history as a whole. Similar stories may be told, but there are no and will never be any imitators."
    },
    {
      "username": "PeachHamBeach",
      "userUrl": "https://www.imdb.com/user/ur0417992",
      "reviewLink": "https://www.imdb.com/review/rw1878268",
      "warningSpoilers": true,
      "date": "22 May 2008",
      "rate": "10",
      "helpful": "56 out of 64 found this helpful.",
      "title": "Still my all time favorite sci-fi/horror!!!",
      "content": "The silly saying, \"You can't touch this\" surely applies here. With all the clone horror and sci-fi films coming out, along with all the inferior remakes, it's hard to find anything worthy of 2 hours of your time. That's why I always rely on the classics that scared the weewee out of me when I was a pre-teen.THE THING is, without an ounce of doubt in my mind, the goriest, ickiest, screechiest sci-fi horror classic that John Carpenter, or any other director (sorry, even you Mr. Spielberg) ever made. What really gives it power, though, is not the gore (it OOOOOZES of slime and blood and God knows what other fluids), but rather the sense of dread, isolation, and distrust it fosters in the characters and the viewer.You can't get more remote than Antarctica, and in this howling, freezing white setting is where the story takes place. Several Americans, researchers and military men, are stationed there. One day, they witness a Siberian Husky dog running for dear life from gun-wielding Norwegians. Before they know it, the American outpost is battling a mysterious creature that can imitate any creature it wants. It may morph into disgusting slimy bloody shapes before it's finished, but once it's finished, if you didn't see it in progress, you can't tell it among humans or other normal Earth animals.Kurt Russell, Keith David, Wilford Brimley, Richard Masur, Donald Moffatt, TK Carter, Thomas Waites and Charles Hallahan are just a few of the fine cast. This film is the reason why horror CAN be a great genre. It actually STILL scares me. The alien blood \"jumping\" out of the petri dish when the hot wire touches it still makes ME jump!!!Still the scariest of them all."
    },
    {
      "username": "fullbug",
      "userUrl": "https://www.imdb.com/user/ur12596710",
      "reviewLink": "https://www.imdb.com/review/rw6976249",
      "warningSpoilers": false,
      "date": "29 May 2021",
      "rate": "10",
      "helpful": "43 out of 44 found this helpful.",
      "title": "One of the Most Re-Watchable Movies Ever Made",
      "content": "Classic and timeless that is now almost 40 years old. Great cast and character interaction, and covers the whole gambit of genre's (sci-fi, action, horror, thriller, mystery). There are even a few comedy moments, and with it taking place in Antarctica, it could even be classified as an adventure. It is one of the most re-watchable movies ever made."
    },
    {
      "username": "The_Wood",
      "userUrl": "https://www.imdb.com/user/ur1195884",
      "reviewLink": "https://www.imdb.com/review/rw0197544",
      "warningSpoilers": false,
      "date": "20 April 2002",
      "rate": "10",
      "helpful": "381 out of 469 found this helpful.",
      "title": "I worship this film. 10/10",
      "content": "John Carpenter's The Thing is hands down the best horror film ever made. Not only that, but it is also on of my personal favorite films of all time. What makes the movie so great? It's hard to put my finger on it. Everything just seems to work in The Thing, it's one of the rare occasions where everything just seems to fall in place. The film is even superior to Alien in creating a type of moody atmospheric hell. The fact that it's not only about the gore (which is wonderful btw), but it is able to create a paranoia that is unmatched in films. A truly wonderful film that is worshiped by all horror buffs, and anyone who has good taste in films."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw8539485",
      "warningSpoilers": false,
      "date": "12 September 2022",
      "rate": "8",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Who Goes There?...",
      "content": "You're stationed at an isolated outpost in Antarctica when a helicopter arrives intent on shooting a dog it had been pursuing across the tundra. Things get out of hand and the occupants of the chopper have their ability to pursue curtailed, more permanently than they'd like. Not too long after this carnage it becomes apparent that the pursuing shooters had a pretty good reason for wanting to remove the dog from the land of the living as the dog turns out to have the same aspirations as its pursuers, albeit in various guises, transformations, metamorphoses and reconfigurations.While this was made in 1981 it remains to this day one of the greatest and most engaging pieces of horror movie making that has ever been created."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3579072",
      "warningSpoilers": true,
      "date": "12 November 2016",
      "rate": "10",
      "helpful": "31 out of 38 found this helpful.",
      "title": "A creepy gem of imaginative sci-fi horror",
      "content": "Although this film clearly got made due to the success of ALIEN, I actually find it the better of the two. I certainly consider it Carpenter's joint best, along with that one with the Michael Myers guy. This is a film based on John W. Campbell's story \"Who Goes There?\", which also inspired the 1951 flick THE THING FROM ANOTHER WORLD which saw James Arness as a killer carrot-man in the same setting. Carpenter is closer to the original story, as his menace is a gory shape shifting alien which consumes and imitates its prey – forget the T1000, he has nothing on this thing. The look of the creature is extremely disgusting and disturbing and hard to forget – imagine some Lovecraftian terror in the flesh, covered in blood and tentacles and other less describable body parts, and you're halfway there.The rest of the special effects are incredible; witness heads slide off bodies and turn into spiders, and the infamous and gut-wrenching kennel transformation which I had the misfortune to watch when I was but a boy. You can bet I had plenty of sleepless nights after watching that one. Plenty of blood, gore, and violence throughout make this one of the hardest of horrors. Yet despite all the effects, this is still a plot-driven movie with absolutely loads of suspense and tension – not to mention a near overwhelming paranoia throughout.There are many imaginative moments – the opening sequence, in which Norbert Weisser tries to kill a poor little doggie – to the excellent blood test scene, in which the guys are tied down whilst Russell tests their blood samples for the alien virus. Russell is subdued but great and as an ensemble, the rest of the guys are true to life and so believable, which makes it all the more horrific. Every outburst, crack-up or breakdown seems to be happening for real and we do learn to care about these very natural researchers trapped in the worst scenario imaginable. Add to this a spooky Morricone score and you have a super movie about which I can say no more – except that you watch it for yourself."
    },
    {
      "username": "DavidSim240183",
      "userUrl": "https://www.imdb.com/user/ur2866837",
      "reviewLink": "https://www.imdb.com/review/rw1867031",
      "warningSpoilers": true,
      "date": "1 May 2008",
      "rate": "10",
      "helpful": "47 out of 56 found this helpful.",
      "title": "The last John Carpenter classic",
      "content": "In 1982, two films were released within weeks of each other that were both about aliens. Steven Spielberg's ET, and John Carpenter's The Thing. Of the two of them, ET was the one that won the hearts of people the world over, even though The Thing debuted first. Because people were so entranced with Spielberg's warm, fuzzy feelgood alien fable, they stayed away from The Thing in droves.Its not hard to see why. The two are diametrically opposed. One is an optimistic tale designed to warm the cockles of the still-beating heart. The other is a harsh, uncompromising film that paints alien life as something purely determined to destroy us. I guess audiences felt ET was a much cuter prospect than The Thing's tentacles and slime coated saliva!It's taken some time, but The Thing has gone on to win over a substantial cult audience. As it should. Because The Thing is that rare example of a superior remake. It takes all the best qualities of the 1951 classic, and reinvents them in startling and imaginative ways. Indeed Carpenter does his job so well he actually succeeds in making a film that is in every inch the equal of the genre's showrunner, Alien. And that's even rarer!Carpenter's film follows its source material more faithfully than The Thing From Another World did. It keeps the frigid wastes of Antarctica as a setting, because its the perfect backdrop when you're trying to establish a heightened sense of isolation. But although a bit thin on characterisation, the remake gets right inside the mindset of the actors, and amplifies the uncertainty and fear that slowly surrounds them.Frequent Carpenter collaborator Kurt Russell returns, hot off the success of Escape From New York, cast once again as one of Carpenter's perpetual anti-heroes. He plays MacReady, the helicopter pilot at an Antarctic research station (what they're researching is anyone's guess). The trouble begins when a Norwegian chopper from a nearby station flies over MacReady's, trying to gun down a Siberian Husky from the air.They end up dying for their troubles, and while the camp tries to solve the mystery of what happened, they take in the Husky and add it to their own. Except that this Husky, is not a Husky at all. But a shape-changing alien. The Norwegians discovered it frozen in the ice, and when they thawed it out, it massacred their crew. Capable of absorbing its victims at will, it can duplicate a living being right down to the smallest detail. Soon paranoia and suspicion works its way through the 12-man crew, until no-one is certain who is human and who is not.The Thing is one of John Carpenter's finest films. In fact I'm tempted to say its the best film he's ever made. Even surpassing classics like Halloween and Dark Star. The reason why I place The Thing at the top of Carpenter's list is that it feels like the last film of his that could truly be called a classic. All the others thereafter have felt like Carpenter was slumming it. Films that didn't flow with the cool sophistication and ragged intensity so prevalent in his earlier works.But The Thing had John Carpenter at the peak of his powers. Never has he generated suspense to such an unbearable degree. Not even in the ferocious Assault on Precinct 13. From the second the alien makes its presence known, Carpenter ratchets up the tension level relentlessly. And when he delivers his punches, they come with an agonising jolt.The film is a blend of pure atmospherics and visceral horror. An approach that can often seem at odds with one another, but in Carpenter's hands melds together beautifully. Bringing in Rob Bottin of The Howling fame, he lays to bear some of the most astonishing transformation effects you'll ever see in a horror film. Amorphous shapes. Half-formed human features starkly contrasted with gaping jaws, spider legs and fully flexible tentacles. Indeed the film's effects are so amazing and squirm-inducing, The Thing came under fire for being too realistic!That type of thinking misses the point entirely. It only shortchanges the film's values. And there are many. Carpenter only stages an effects setpiece when he needs to. Its in the film's quieter moments where he seems especially attuned to the story. The Thing is an often bewildering tale of shadows, whispers and implications. Characterisation has never been one of John Carpenter's strong suits, but it works to his advantage in The Thing. Because we hardly know anything about the cast, it only makes the present situation that much more confusing. We're never certain, from one moment to the next who is who. And because of this, The Thing holds up very well and maintains its mystery on subsequent viewings.A special mention should go to the excellent film score from Ennio Morricone. A pulsing thud thud every two seconds. It creates an eerie, spooky feeling that is very hard to shake. The whole film is a wonderful exercise in paranoid manipulation. The scene where they blood-test each other to see who's human is wound up with such dexterity by Carpenter, you may find yourself biting your nails without even realising.The Thing is a pure unadulterated classic. Even the ending leaves you with the vague suspicion that not everything is resolved. An underrated film, well worth the reappraisal it received. And so much better than ET!"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2410490",
      "warningSpoilers": false,
      "date": "8 April 2011",
      "rate": "10",
      "helpful": "55 out of 73 found this helpful.",
      "title": "A serious contender for the best remake ever",
      "content": "The Thing is not only a brilliant remake(which I was not expecting after seeing abominations such as Psycho and The Wicker Man) but it is also a brilliant film that seamlessly blends horror and sci-fi amongst other things.The atmosphere is especially what makes the movie so good. To this day, very few other movies have shocked, haunted or unnerved me as much as The Thing. The scenery, sets and costumes are eye-popping and the effects are brilliantly designed and suitably grotesque without distracting too much.There is also Ennio Morricone's most haunting score, a cracking script and a deliberately slow-paced but compelling story that is quite ahead of its time. Not to mention wonderful direction and credible and well-written characters. The acting is equally great, in my mind Kurt Russell has never been better, likewise with Keith David and Wilford Brimley has brilliant delivery of the lines.All in all, a brilliant film and one essentials and its genre(s). 10/10 Bethany Cox"
    },
    {
      "username": "BandSAboutMovies",
      "userUrl": "https://www.imdb.com/user/ur69172350",
      "reviewLink": "https://www.imdb.com/review/rw6379059",
      "warningSpoilers": true,
      "date": "19 December 2020",
      "rate": "8",
      "helpful": "15 out of 18 found this helpful.",
      "title": "Makes more sense now",
      "content": "This movie failed at the box office and nearly ruined the career of John Carpenter. Think of that as you watch it. But did it really fail? It made nearly $20 million on a $15 million budget, but audiences must have expected more. Studios certainly did.Was it because E.T. came out at the same time, as well as so many other science fiction and fantasy films? Did the recession make people not want to watch something so nihilistic? Did the sheer level of gore turn people off? Were people upset that he remade a film some considered a classic*?After one market research screening, Carpenter asked the audience what they thought. One answered, \"Well what happened in the very end? Which one was the Thing...?\" When Carpenter said that the answer was up to their imagination, the response was, \"Oh, God. I hate that.\"How could audiences respond to a movie that did not spoon feed them any of the story beats? That doesn't have a single character to root for or get behind? That is influenced by Lovecraft - as our the other Apocalypse Trilogy installments Prince of Darkness and In the Mouth of Madness - in that ordinary people face off with supernatural horror that they are doomed to be destroyed by, which isn't really what mainstream America wants from a popcorn film?Yeah, it could be all of those things. Or perhaps, the world was not ready for it. But watching the end of this film, as everyone sits around wondering who has a disease that they can barely understand and know will eventually impact them, yeah. I think the world of 2020 is ready for it.I wonder what it's like to watch this movie when it screens every year at the Amundsen-Scott South Pole Station. I bet it feels pretty real there, too.In an interview with the AV Club, Carpenter said, \"If The Thing had been a hit, my career would have been different. I wouldn't have had to make the choices that I made. But I needed a job. I'm not saying I hate the movies I did. I loved making Christine and Starman and Big Trouble in Little China, all those films. But my career would have been different.\"As it was, Carpenter was reluctant to make the film** and nearly quit before it ever started filming. A lifelong fan of Howard Hawks***, he felt that his version of the story - both are based on Who Goes There? by John W. Campbell Jr. - was unbeatable. But as he re-read the original story - spurred on by co-producer Stuart Cohen - he saw how he could make a movie with a vision for his time, just as Hawks had thirty years ago.Beyond Carpenter, so many talents make this film work. Of course, there are the actors on screen, like Kurt Russell, Keith David, T.K. Carter, Wilfred Brimley, David Clennon and Richard Dysart. But there's also the astounding production design and storyboards from Man-Thing artist Mike Ploog and Mentor Huebner, which were so detailed that several of the shots from this look like carbon copies of their sketches. There's Dean Cundy working to make every shot look amazing - this is his first major studio movie with Carpenter. Want it to get even better? Sure, Carpenter could have done the score, but he got Ennio Morricone****. And finally, the Rob Bottin-lef effects team were pushed to the brink of exhaustion - Bottin was only 21 years old and ended up going to the hospital for exhaustion, double pneumonia and a bleeding ulcer after working for an entire year on the film, sleeping on set - but the work they created will never be duplicated and puts any CGI efforts to remake this film to shame. Carpenter thought that having someone in a suit - like Alien - cheapened the film. He wanted something more. Well, he got it. In the last battle with the Thing, fifty different artists are operating the monster.We're lucky that this movie exists. I saw it at the drive-in this year and it felt like it could have been made today. It was too imaginative, too nihilistic and too good for most people, even nearly forty years later.*One of the reviews that upset Carpenter the most came from the co-director of the original, Christian Nyby, said, \"If you want blood, go to the slaughterhouse. All in all, it's a terrific commercial for J&B Scotch.\"**Originally, Universal was going with Tobe Hooper and Kim Henkel as the team for this movie, but were unhappy with their take. John Landis was also considered, but the film was really greenlit when Alien was such a big deal in 1979.***How big of a fan is Carpenter? You can see scenes of The Thing from Another World during Halloween.****Morricone's score for this film was nominated for a Razzie, while his score for The Hateful Eight - which has some unused music from this film in it - won him his only Best Original Score Oscar."
    },
    {
      "username": "YellowTea",
      "userUrl": "https://www.imdb.com/user/ur34627092",
      "reviewLink": "https://www.imdb.com/review/rw6974125",
      "warningSpoilers": false,
      "date": "28 May 2021",
      "rate": "10",
      "helpful": "17 out of 18 found this helpful.",
      "title": "Couldn't Be Better - One of History's Greatest Films",
      "content": "I remember being encouraged to watch this in my mid-teens. Naturally, being a teen, I was reluctant to give anything from the 80s a try as I felt it to be a long gone ancient era. I was pleasantly surprised. The practical effects were a very welcome change to the cgi I was used to. They were done so well that I was at no point removed from the illusion. To this day, they're still the best I've seen. It's proof that if done right, practical effects such as animatronics will always beat out cgi.The movie is fantastic in every way. Kurt Russell is such a good actor that I'd have to class him as one of my favorites. Carpenter and Russell were a tour de force in the 80s creating both The Thing, and Escape From New York."
    },
    {
      "username": "ChadKuhns",
      "userUrl": "https://www.imdb.com/user/ur1879522",
      "reviewLink": "https://www.imdb.com/review/rw0197658",
      "warningSpoilers": false,
      "date": "5 August 2002",
      "rate": "",
      "helpful": "392 out of 446 found this helpful.",
      "title": "A Timeless Look in Paranoia, a Horror Classic",
      "content": "Just to put things in perspective for you before I get into my thoughts on this film, I am only 20 years old and have grown up in the era of CGI, blue screen effects...and this movie was made around the same time i was born.With that said, WOW, I only recently saw John Carpenter's version of 'The Thing', and what a masterpiece it truly is. I have long since been a fan of John Carpenter, in particular his works from the late 70's and 80's. In 'The Thing' John Carpenter has truly crafted a paranoia inducing, perhaps gut wrenching classic.The movie is an update of the classic 'The Thing From Outer Space', but only like it's predecessor, this film is in full color, and the characters of this film have much more to worry about than an alien veggieThe film centers around a group of Arctic Researchers you encounter an alien lifeform capable of taking the form of anything it comes into contact with, and out of for that matter. Kurt Russell stars as R.J. MacReady, an alcoholic Vietnam Vet, thrust into the role of leader of a group of relatively cold and callous men all of whom are readily plunging into manic paranoia and somewhat madness once they realize that they are up against a creature that can take any form, be any one of them.John Carpenter, more than in any other of his films, manages to create a truly believable and incredible atmosphere. When watching this film you truly get the sense of the dark,sinister, desolate surroundings, you feel and realize that these characters have no where to go...never for one second do you not believe they are stuck on a polar ice cap. Also, this film has perhaps one of the greatest endings to any film of it's genre, or any genre for that matter. I'm not going to give it away here, but to say that it will leave you wondering would be an understatement.Kurt Russell is superb as MacReady....truly conveying the emotions of a man thrust into a situation of unimaginable horror, forced to lead a group of men who cannot trust that the man next to them is not the creature that has driven them to the brink of paranoia and emotional meltdown.I don't care if this movie is 20 years old by now, the special effects in this movie are gut wrenching, mind blowing, and absolutely awesome. They blow away any CGI pixel based crap out there today. The 'Thing' itself is a truly horrifying and disturbing creation...unlike any alien you have ever seen in a movie before. Those who have a low tolerance for gore and blood had best prepare themselves for watching this movie.This movie does what any good horror/sci fi movie should do, it really thrusts you into it's character's world. It leaves you wondering, what would you do, who could you trust if anyone you knew could be the creature waiting to feed on you, and take you over as well. The images, and ideals of this movie stayed with me long after i first saw it, and today as i write this review send a chill up my spine.It is a true shame this movie is only now getting the proper recognition it deserves. A box office flop when released, now more then ever when movies are paper thin with plot, and one dimensional in effects, this film can be appreciated as a true masterpiece of sci/fi and horror. If possible, get the Collector's Edition DVD, and enjoy it in anamorphic widescreen..the way it is truly meant to be seen. Marvel at the incredible scenery, the taught direction, the excellent atmosphere, the sweat inducing, gag reflex activating, and everything else that makes this movie great. Watch it with the lights out, with a group of close friends...maybe even with a dog around...if you don't what i'm talking about...you will afterwards.Don't let a classic pass you bye"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3102422",
      "warningSpoilers": false,
      "date": "11 October 2014",
      "rate": "9",
      "helpful": "20 out of 26 found this helpful.",
      "title": "Must-watch for all horror fans",
      "content": "It's the start of winter. An isolation group of scientists at the United States National Science Institute Station 4 in Antarctica is interrupted by a Norwegian helicopter buzzing around. The Norwegians are throwing charges and shooting at a dog. George Bennings (Peter Maloney) is shot and Garry (Donald Moffat) kills the supposed mad Norwegian. Clark (Richard Masur) takes the dog in. MacReady (Kurt Russell) flies Dr. Blair (Wilford Brimley) and Garry to the Norwegian camp. They discover it smoldering and a place of massacre. Windows can't reach anybody on the radio.The makeup special effect is gruesome and astonishing. The pre-CGI real effect reaches an all-new high. The snowy atmosphere is stark. No room is given to sentimentality. Director John Carpenter has crafted an incredible masterpiece that is a must-watch for all horror fans. He brings out his music sound effects once again. The testing scene raises the tension beyond high. It's one of the most intense scenes in any horror."
    },
    {
      "username": "drewnes",
      "userUrl": "https://www.imdb.com/user/ur40349280",
      "reviewLink": "https://www.imdb.com/review/rw6981571",
      "warningSpoilers": false,
      "date": "30 May 2021",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "\"First goddamn week of winter.\"",
      "content": "I saved the best for last. There is nothing I don't like about this movie. The music, the pacing, the story, the practical effects, the cast, the paranoia, the ending.. I love it all. Kurt Russell is so cool and the creature haunted my dreams when I first saw this, and is still creepy on a rewatch. Sucks that it was not popular when it first came out, because I would've loved to see this in theaters. The Thing might be my favorite horror movie of all time."
    },
    {
      "username": "Red-Barracuda",
      "userUrl": "https://www.imdb.com/user/ur1616919",
      "reviewLink": "https://www.imdb.com/review/rw2727477",
      "warningSpoilers": false,
      "date": "29 December 2012",
      "rate": "9",
      "helpful": "16 out of 20 found this helpful.",
      "title": "A cult favourite that has become a classic",
      "content": "A dog is chased through the wide open snowy expanse of the Antarctic by men in a helicopter who attempt to kill it with a rifle. They fail and die, and the dog enters an American compound unharmed. The men of this outpost now try to discover what events led to this bizarre scene John Carpenter's remake of the 1950 Howard Hawks original The Thing From Another World is a definite example of a remake that exceeds the original. With this film Carpenter upgraded the original with excellent use of very impressive practical special effects. These effects still look extremely good today thirty years on. But it's not just this that has been improved; the characters and dialogue are better, while the sense of paranoid mystery is an entirely new addition to the story. Despite all these aspects, it comes as a surprise to a lot of people that The Thing was a box office failure upon release in 1982. Even the fools at the Razzies jumped on the bandwagon and nominated Ennio Morricone's Carpenteresque soundtrack for 'worst musical score' – a frankly ludicrous decision. Anyway, it was only in the years that followed that The Thing built up a reputation as a cult favourite, to the point that it is now considered something of a classic. Which is the way it should be considering that this is a highly effective and claustrophobic sci-fi horror movie."
    },
    {
      "username": "desotowright",
      "userUrl": "https://www.imdb.com/user/ur16010676",
      "reviewLink": "https://www.imdb.com/review/rw1868224",
      "warningSpoilers": false,
      "date": "3 May 2008",
      "rate": "",
      "helpful": "27 out of 29 found this helpful.",
      "title": "The ultimate in alien terror.",
      "content": "A group of explorers in the arctic region have encountered a vicious alien organism that can consume a person and make itself a perfect copy. This is a classic horror film that is loaded with brilliant special effects and graphic violence that is a perfect way to spend a cold evening. Kurt Russel stars as a troubled alcoholic who takes charge and tries to find which person is really the alien creature. One of the most brilliant things about the movie is that it plays with the idea of not knowing who you can trust. I found it interesting that it had an all male cast, something uncommon for many movies. The acting is very natural and very realistic. This movie was surprisingly scary and the graphic scenes were surprisingly horrific. It's a dark, brutal, and claustrophobic sci-fi horror film that has stood the test of time from the genius of John Carpenter."
    },
    {
      "username": "atdmv",
      "userUrl": "https://www.imdb.com/user/ur5882292",
      "reviewLink": "https://www.imdb.com/review/rw6940025",
      "warningSpoilers": false,
      "date": "19 May 2021",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Better than the book",
      "content": "One of very few movies that are better than the books they're based on. Great storyline. The effects exceed expectations for their time. Excellent acting!"
    },
    {
      "username": "Vartiainen",
      "userUrl": "https://www.imdb.com/user/ur30163554",
      "reviewLink": "https://www.imdb.com/review/rw2930517",
      "warningSpoilers": false,
      "date": "29 December 2013",
      "rate": "9",
      "helpful": "16 out of 20 found this helpful.",
      "title": "Masterful horror",
      "content": "The movie opens to a frozen wasteland of Antarctica, as we spot the lonely figure of a dog fleeing from its pursuers. It's a bleak, unforgiving setting and a perfect opener to this movie. The Thing, based on John W. Campbell Jr.'s novella Who Goes There? is one of the finest horror movies ever made. In a way it reminds me a lot of Alien, another masterpiece of horror. They both have an isolated setting where no help will be forthcoming, they both feature an attack by an unknown alien entity and they both have unbelievably good special effects, the sheer brutality, goriness and impossibility of which are the stuff of nightmares.The Thing adds the fact that its alien is capable of assuming other shapes, and the movie evolves to a tense hide and seek game and as the pressure rises, the group of scientists and researchers starts to crack. It's an intense experience with long scenes of unbearable atmosphere followed by short bursts of soul-chilling terror facilitated by the special effects of one Rob Bottin, a master of his craft.It's a well-told story, ending on a perfect note that isn't too uplifting, but neither is it a complete downer. Easily one of the best endings to a horror film I've ever seen and the rest of the story is told equally as well. Perhaps my only nitpick is that some of the characters and their actors aren't as strong as, say, in the Alien. There's perhaps one or two too many for all of them to get enough screen time to really shine. On the other hand, some are really good, like Kurt Russell's MacReady or Wilford Brimley's Dr. Blair.This is a movie that every fan of horror owes to himself or herself to see at least once. Its special effects are so scary that I actually wouldn't recommend this to anyone who's prone to nightmares. They're not nice to look at, they're not pleasant and under no circumstances should any child ever see this film. It's that frightening, that good at what it does."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw3658392",
      "warningSpoilers": false,
      "date": "10 March 2017",
      "rate": "9",
      "helpful": "16 out of 21 found this helpful.",
      "title": "It Never Lets Up",
      "content": "I don't know if I could ever watch this film again. It's one of those where, once you get involved, you sit on the edge of your seat, feeling everything that befalls these poor men. If one wanted to create a hell on earth, this would be it. From the Norwegians chasing that dog, to a minute by minute effort to survive and save civilization from this horror. The special effects dealing with the aliens transformation are stunning, especially when one realizes it was 1982 and the CGI stuff was really barely a thought. We care about the characters but are not let in on anything, so when something jumps, we jump with it. If there is a criticism, there is no release from the tension. Even if one is able to relax for a minute or two, there is an atmosphere of threat over everyone. When you can't trust the person you've known much of your life, who works next to you, when he becomes a deadly beast, what can you do? This is one of the greatest horror films ever."
    }
  ],
  "errorMessage": ""
}