{
  "imDbId": "tt0081398",
  "title": "Raging Bull",
  "fullTitle": "Raging Bull (1980)",
  "type": "Movie",
  "year": "1980",
  "items": [
    {
      "publisher": "Austin Chronicle",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "The performances are riveting and the visuals are stunning. The boxing sequences are brutally realistic - there are no crappy Rocky theatrics here - and the humanity oozes out of every scene."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "The most painful and heartrending portrait of jealousy in the cinema--an \"Othello'' for our times."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Gene Siskel",
      "link": "",
      "rate": "100",
      "content": "Filmed in black-and-white and shockingly well acted by De Niro, Raging Bull suggests that if you are looking for the source of evil in the world, you don't have to look any further than yourself. It's inside you or it isn't. And it comes out or it doesn't. [19 Dec 1980]"
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "Another harsh character study, with poignant echoes of \"Taxi Driver.\""
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Sheila Benson",
      "link": "",
      "rate": "100",
      "content": "One of the bloodiest and most beautiful reflections on atonement in the Scorsese canon... It is still one of cinema's most breathtaking films."
    },
    {
      "publisher": "The New York Times",
      "author": "Vincent Canby",
      "link": "",
      "rate": "100",
      "content": "The entire film is played at such high pitch it may well exhaust audiences that don't come prepared. And, at the heart of the film, there is the mystery of Jake himself, but that is what separates Raging Bull from all other fight movies, in fact, from most movies about anything. Raging Bull is an achievement."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "100",
      "content": "Takes a cold, unflinching look at the violence both inside and outside of the ring."
    },
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "",
      "rate": "100",
      "content": "A fiercely poetic study of violence. Stunningly shot in black-and-white. [14 Dec 1989, p.23]"
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Jay Scott",
      "link": "",
      "rate": "88",
      "content": "The intensity of the film verges on the intolerable."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "40",
      "content": "As LaMotta, Robert De Niro gives a blank, soulless performance; there's so little of depth or urgency coming from him that he's impossible to despise, or forgive, in any but the most superficial way."
    }
  ],
  "errorMessage": ""
}