{
  "imDbId": "tt0325980",
  "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
  "fullTitle": "Pirates of the Caribbean: The Curse of the Black Pearl (2003)",
  "type": "Movie",
  "year": "2003",
  "items": [
    {
      "publisher": "USA Today",
      "author": "Claudia Puig",
      "link": "https://usatoday30.usatoday.com/life/movies/reviews/2003-07-08-pirates_x.htm",
      "rate": "88",
      "content": "Finally, there's a big-budget popcorn movie that delivers what moviegoers hunger for: humor, action, thrills and charismatic characters. Pirates of the Caribbean: The Curse of the Black Pearl is the summer blockbuster we've been waiting for."
    },
    {
      "publisher": "Charlotte Observer",
      "author": "Lawrence Toppman",
      "link": "",
      "rate": "75",
      "content": "A film that dares to be smart, reasonably complicated and scary while swashing its buckles."
    },
    {
      "publisher": "Seattle Post-Intelligencer",
      "author": "Sean Axmaker",
      "link": "",
      "rate": "75",
      "content": "Verbinski puts a Jackie Chan flourish of high energy and gymnastic action on the swashbuckling stunts and swordplay and keeps this lark sailing along."
    },
    {
      "publisher": "Boston Globe",
      "author": "Ty Burr",
      "link": "",
      "rate": "75",
      "content": "Pirates offers something for everyone: Bloom and Depp for the ladies, big action and Knightley for the men, self-aware gags for the postmodern crowd, Depp and Rush for fans of top-rank scenery chewing."
    },
    {
      "publisher": "New York Daily News",
      "author": "Jami Bernard",
      "link": "",
      "rate": "75",
      "content": "Letting any other actor run wild like this could have been a disaster, but Depp's peculiar buccaneer is an instant classic of actorly charisma."
    },
    {
      "publisher": "Village Voice",
      "author": "Ed Park",
      "link": "",
      "rate": "70",
      "content": "Convoluted but diverting."
    },
    {
      "publisher": "New York Post",
      "author": "Lou Lumenick",
      "link": "",
      "rate": "50",
      "content": "Trimming half an hour from this bloated, 143-minute blockbuster would have highlighted the film's treasures, not the least of which is Johnny Depp's endearingly eccentric performance as Captain Jack Sparrow."
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "Ken Fox",
      "link": "https://www.tvguide.com/?MI=44571",
      "rate": "50",
      "content": "Director Gore Verbiniski delivers the best one can hope for: a cleverly nostalgic, high-tech copy of the real deal."
    },
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "https://www.rollingstone.com/tv-movies/tv-movie-reviews/",
      "rate": "50",
      "content": "Depp swans through this swashbuckler with a scene-stealing gusto unseen since Marlon Brando in \"Mutiny on the Bounty.\" He's comic dynamite, but this plodding, repetitive bore should walk the plank for timidly refusing to light his fuse."
    },
    {
      "publisher": "L.A. Weekly",
      "author": "",
      "link": "",
      "rate": "20",
      "content": "The booty here is 100 percent fool's gold."
    }
  ],
  "errorMessage": ""
}