{
  "imDbId": "tt0325980",
  "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
  "fullTitle": "Pirates of the Caribbean: The Curse of the Black Pearl (2003)",
  "type": "Movie",
  "year": "2003",
  "items": [
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw3854357",
      "warningSpoilers": true,
      "date": "10 November 2017",
      "rate": "9",
      "helpful": "30 out of 30 found this helpful.",
      "title": "\"That's got to be the best pirate I've ever seen.\"",
      "content": "If you're ever in the mood for just a flat out entertaining flick, you can't go wrong with 'Curse of the Black Pearl\". I wasn't writing these reviews when this movie first came out, didn't even know there was such a thing as IMDb. So I'm finally getting back to it this many years later and even though I'd forgotten a lot about the story, I was blown away all over again by the outrageous antics of Captain Jack Sparrow and those transition scenes where the skeleton pirates manifest in the moonlight. In fact, the story itself might be incidental to the special effects and physical stunts that highlight the action in the film. Johnny Depp of course makes the movie with his swish-buckling (yeah, I misspelled it on purpose) approach to the character, and you couldn't ask for a more fetching lady in distress than Keira Knightley, although she managed to hold her own against most of those menacing pirates quite nicely. Orlando Bloom and Geoffrey Rush round out the rest of the principal cast, and each did a superb job. I've never gotten beyond this movie's sequel, 'Dead Man's Chest', but watching this one again inspires me to go forward and check out all the rest."
    },
    {
      "username": "mark.waltz",
      "userUrl": "https://www.imdb.com/user/ur0968789",
      "reviewLink": "https://www.imdb.com/review/rw6279021",
      "warningSpoilers": true,
      "date": "16 November 2020",
      "rate": "9",
      "helpful": "32 out of 33 found this helpful.",
      "title": "\"You better start believing in ghost stories. You're in one.\"",
      "content": "What a great line to describe probably the greatest pirate movie ever. Certainly, it isn't perfect, a bit over the top, yet filled with characters that you love to hate or you can't resist rooting for. Thanks to the performance of Johnny Depp as Captain Jack Sparrow, this has become a long-lasting franchise of Disney car and love the many sequels that followed up aren't as good, Jack has remained consistently strong in the ones where he was given a great opportunity to show off his huge talents.Johnny was justifiably nominated for an Oscar for his performance in this, and is ably supported by Geoffrey Rush as the ghostly Captain Barbarossa and Orlando Bloom as Will Turner (brought up as a pirate until he was rescued at sea as a child), and Keira Knightley as Elizabeth Swann, the daughter of the governor of a Caribbean island.In his performance, Depp gives several insights into the real character of Jack Sparrow, and it is debated whether he was just an eccentric drunk or possibly gay or bisexual. Certainly, the slaps he gets from various women throughout the film debate the second point, but other insinuations indicate that he had prolactivities. Sparrow and Turner are rivals at first until they must join forces to rescue Elizabeth who is kidnapped by Barbarossa. she goes to a frightening sequence when she learns of who they really are, and that brings terrific elements of horror into the film.Fans of the Disneyland ride will be gleefully surprised to see various elements of it from the drunk man sleeping with tags, the jailed men trying to get a dog to bring over the key or the various battle fights at sea. they are spread throughout the film so you don't feel like you taking the ride and then gone back into a plot, so it makes it fun for experienced riders of that tourist attraction as they pop up.The terrific makeup, costumes, photography and music add to the sensational performances. This takes the best elements of all the classic pirate movies (from \"Treasure Island\" to \"Captain Kidd\") and adds a reality with the violence and filth and crudeness, but somehow, some of the pirates (especially Sparrow) are quite loveable in a strange way. This is non-stop action, filled with humor both physical and verbal, and some of it in spite of the lack of etiquette of the characters is subtlety classy. I can see myself returning to this every couple of years because certainly, like a trip to Disney, it's a ride that you don't want to miss when you have the opportunity."
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5503552",
      "warningSpoilers": false,
      "date": "23 February 2020",
      "rate": "",
      "helpful": "98 out of 107 found this helpful.",
      "title": "Johnny Depp is fantastic!",
      "content": "Awesome action and swashbuckling adventure, great music from the likes of Hans Zimmer, good visuals and Johnny Depp's hilarious improvisational performance as Captain Jack Sparrow (the other performances are good as well but Depp's the highlight and you damn well know it) make the first Pirates of the Caribbean adventure a fun action flick that's not only a great first non-Touchstone/Hollywood Pictures/pre-2006 Miramax & Dimension PG-13 Disney movie but also a much better movie than a movie based off of a THEME PARK RIDE has the right to be."
    },
    {
      "username": "MaxBorg89",
      "userUrl": "https://www.imdb.com/user/ur5156288",
      "reviewLink": "https://www.imdb.com/review/rw1182704",
      "warningSpoilers": false,
      "date": "29 September 2005",
      "rate": "9",
      "helpful": "193 out of 228 found this helpful.",
      "title": "Terrific!",
      "content": "You will always remember this as the movie that made Johnny Depp a superstar and almost got him an Oscar.The fact that he didn't win isn't a problem,since thanks to him this is the best pirate film ever made.The opening concept is a clichè:a beautiful woman(Keira Knightley)is kidnapped by a bunch of filthy pirates(led by Geoffrey Rush's Barbossa)and the man(Orlando Bloom)who's desperately in love with her decides to track them down.From now on,things get unexpected,as he asks another pirate for help.And it's no ordinary pirate:it's Captain Jack Sparrow(Johnny Depp),a lying,cheating,but charismatic scumbag,the hardest man on Earth to predict,not to mention quite unlucky and clumsy(\"You are,with no doubt,the worst pirate I've ever heard of\" \"But you HAVE heard of me!\").It's got all the elements of a classic pirate movie,elements that would give this flick a 9/10.So,why am I giving it a 10/10? The answer is simple:Captain Jack.From the moment he makes his entrance,justly included in the Empire Top 10 Entrances of all time,we know he's the reason people will keep watching the movie.He 's Depp's best non-Tim Burton-character ever,and I can't wait 'til he returns.See you next summer,Captain!"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2065798",
      "warningSpoilers": false,
      "date": "13 May 2009",
      "rate": "10",
      "helpful": "42 out of 50 found this helpful.",
      "title": "Phenomenal!",
      "content": "If there was a minor quibble with the movie, it is that it is a little overlong. Putting that aside, this is a truly wonderful film, that is definitely one of the highlights of 2003. The whole film is a wonder to look at, with splendid costumes and very realistic sets. The script is just a gem, with classic and original lines like \"Stop blowing holes in my ship,\" that sometimes have you in gales of laughter. I did find the pirates as skeletons quite frightening though. Films that have scared me are The Mummy and Pitch Black. The performances were first-rate, especially Johnny Depp in possibly his best performance. His character Jack Sparrow is a somewhat charming, likable rogue, and Depp pulled him off to perfection. As Barbossa, Geoffrey Rush positively sinks his teeth into his role, sometimes sinister and sometimes fun. Kiera Knightly proves once again that she looks lovely in period dramas, because it really does suit her. Orlando Bloom is dashing as Will Turner. Before I round off, I want to mention another aspect of the film, the music by Hans Zimmer(Lion King)... it was outstanding! Zimmer should be up there with the great film composers, like James Horner(American Tail, Titanic), John Williams(ET, Home Alone) and the late Jerry Goldsmith.(Legend, The Shadow) All in all, a highly entertaining film! 10/10 Bethany Cox."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw0884682",
      "warningSpoilers": true,
      "date": "24 April 2004",
      "rate": "10",
      "helpful": "134 out of 171 found this helpful.",
      "title": "One of the Most Delightful Pirates Adventure Ever",
      "content": "When the daughter of the governor of a Caribbean island, Elizabeth Swann (Keira Knightley), is proposed by Commodore Norrington (Jack Davenport), she faints, fells into the sea and is rescued and saved by the pirate Captain Jack Sparrow (Johnny Depp) but he is arrested and sentenced to death for piracy. Meanwhile, the town is attacked by the ship Black Pearl, commanded by the former first mate Barbossa (Geoffrey Rush), who leaded a mutiny against Captain Jack Sparrow years ago. Barbossa kidnaps Elizabeth, and the blacksmith Will Turner (Orlando Bloom), who loves her, releases Jack Sparrow and they steal the fastest vessel of the navy to follow the Black Pearl, Will trying to save Elizabeth, and Jack trying to retrieve his ship. Along their journey, many secrets are disclosed about the course of the Black Pearl and her crew.The supernatural adventures of Captain Jack Sparrow, Elizabeth Swann, Will Turner and Barbossa are so spectacular that really deserves to be included among the best movies (Top 250) in IMDb. This film has action, humor, romance, mystery, special effects and is so delightful that the viewer does not feel the running time of 143 minutes. I saw this movie for the first time on 24 April 2004, and I have just watched again today (10 Feb 2007) enjoying the same way as in the first time. My vote is ten.Title (Brazil): \"Piratas do Caribe  A Maldição do Pérola Negra\" (\"Pirates of the Caribbean: The Curse of the Black Pearl\")"
    },
    {
      "username": "Brad2002",
      "userUrl": "https://www.imdb.com/user/ur1929797",
      "reviewLink": "https://www.imdb.com/review/rw0884790",
      "warningSpoilers": false,
      "date": "4 September 2004",
      "rate": "8",
      "helpful": "248 out of 298 found this helpful.",
      "title": "Surprisingly Good",
      "content": "Although I had expectations ( from watching the trailers ) that this might be a good movie, I was still surprised that it's as good as it is. The story is actually more complex than I had expected, involving cursed pirates and their quest to rid themselves of the curse. I won't say more than that so as not to spoil it if you haven't seen it.There aren't as many action scenes as I had thought there would be in a pirate movie, but the ones that are in the movie were very fun and enjoyable. After seeing it, I think it had the right balance of action and drama. There are also, of course, a lot of funny bits interspersed between the action and drama. Some really good special effects also add to the enjoyment of this movie.I wasn't much of a fan of Johnny Depp until I saw this movie. I think he deserved to win the Academy Award for best actor. It's largely because of his performance, IMO, that the movie was so good. Most of the supporting cast did well, mind you, just that Johnny Depp stood high above the rest. I did find Orlando Bloom's performance a bit wooden, but other than that the acting was good.Basically, it's a really fun movie and I'd give it about 8 out of 10"
    },
    {
      "username": "ForceofSU",
      "userUrl": "https://www.imdb.com/user/ur101517194",
      "reviewLink": "https://www.imdb.com/review/rw6017940",
      "warningSpoilers": false,
      "date": "22 August 2020",
      "rate": "10",
      "helpful": "23 out of 25 found this helpful.",
      "title": "Amazing",
      "content": "Yep, 20 years late with a review. But give me a break, i was a kid back then. Anyways this movie is amazing. It is original, full of twists and turns, fun, funny... It deserves 9 stars. However considering the fact i had to lower criteria for 'modern' movies made in the past decade, i have to give this a maxumum rating because compared to them it should get 15/10 stars."
    },
    {
      "username": "Igenlode Wordsmith",
      "userUrl": "https://www.imdb.com/user/ur1448185",
      "reviewLink": "https://www.imdb.com/review/rw0884389",
      "warningSpoilers": false,
      "date": "23 November 2003",
      "rate": "8",
      "helpful": "127 out of 169 found this helpful.",
      "title": "Finally, a real swashbuckling film to make me laugh",
      "content": "\"Even I love Johnny Depp, and I'm male,\" a previous reviewer declares, tongue in cheek. Well, I wouldn't go quite that far, but there's no doubt whatsoever that when I lost my heart to this film, Johnny Depp's outrageous Cap'n Jack Sparrow had almost everything to do with it. I don't normally review 'current' films, so the very fact that I'm writing this highlights an almost unprecedented event - after endless failures, Hollywood has finally rediscovered the spirit of the classic swashbuckler movie.With hindsight, I think the one brilliant decision that was made at some point - given a modern production environment - was to *separate the roles* of hero and swashbuckler. You can then have your worthy Costner-type juvenile lead, as required, who has to Come To Terms with his Past (although his eventual fate is a trifle unexpected in conventional terms...) - *but* you can also have your essential and irrepressible swaggering rogue (of course, he totally steals the film from the moment he first appears, but *that's* no hardship!)The moonlight special effects were overdone, in my opinion - not that they aren't believable, but that they would have been more effective if used more sparingly, for occasional flashes of nastiness rather than solid minutes of battle. However, that's a minor niggle. The stunts are energetic, highly satisfactory, *not* computerised, and on occasion even carried out by the stars :-)The other saving grace of the production is its humour - not that there aren't a few over-arch knowing references, but on the whole it manages to send itself up without suspending disbelief in the process. Jack Sparrow's first arrival on the scene (with total aplomb aboard a steadily-sinking boat) is a prime example, as indeed are the vast majority of subsequent scenes involving this character...The basic Romance and Rescue structure is satisfactory enough, with the addition of the requisite Feisty Female for the 21st century (though I felt the character would have been a little more historically plausible if she had been a little less liberated - she clearly possesses a stronger character than her young man, she doesn't have to strive to be his physical equal as well...) However, it is the pirates themselves who really make the film, simply by being a pack of unreconstructed and uninhibited villains (from the Jeffrey Farnol School of Historical Dialect) who are far larger than life and totally unselfconscious about it. To quote the opening words of the 'Guardian' review: \"we have been waiting [50 years] for a modern pirate film featuring someone who, in all seriousness, actually says the words, or perhaps the two-syllable single word: 'Ah-harrrrr!'\"Jack Sparrow, as swashbuckler extraordinaire and consummate rogue (of course, totally honest in his own way... ahem) is the main attraction of the entire film. Not so much loopy as totally round the bend - outrageous and unpredictable (there is a running gag throughout the first part of the film where he is repeatedly described as \"the worst pirate I've ever seen\", as in \"the worst at it\", only for the preposterous tactics in question to prove spectacularly successful).This character saves the hero in more ways than one - without him, the film would be another \"Mask of Zorro\", a rather stodgy attempt to update an old favourite for modern-day sensibilities and compensate with more and flashier sword-fighting (swashbuckling is not *about* fighting! It comes into it, yes, but it's not the point.) But together, the pair work off one another beautifully - reliability and inspired lunacy, self-doubt and cocky flamboyance, dogged devotion and shameless self-interest. The only question is which, precisely, is the sidekick...There are two beginnings to this film, neither of them bearing any relation to the wooden costume-drama-by-numbers prologue that actually opens the movie. The moment when events start to move (it could scarcely be less subtle) is signalled by the swell of the theme music for the first time at Sparrow's initial appearance. But for me the moment when the film really took off was in that instant during his first escape, when he seizes the rope and swings up, up, and out, in a classic swashbuckler move from the past that brought it all flooding back... and my heart flew up after him into my throat, and remained enjoyably in that position until the end of the movie, when the audience began spontaneously to applaud.The film is far from perfect - characters like Captain Norrington (*please* - 'Commodore', like 'Prime Minister', is a job description, not a form of address!) and the Governor are little more than pantomime stereotypes, with only frustrating hints of humanity to indicate that they do after all have potential denied them by the script. Annoying anachronisms slip in - \"it's okay\", \"I was rooting for you\" - most of the nautical jargon comes out with about as much sign of comprehension as a phonetic rendition of a foreign language, and Sparrow's one precious charge of powder gets soaked through often enough in the course of the plot to be utterly useless by the end. Both hero and heroine come across as wooden and thankless roles. Orlando Bloom may be costumed to look increasingly like Errol Flynn during the course of the film (was it my imagination, or does he spend it gradually cultivating a duplicate of that famous moustache?), but, alas, any resemblance ends there.But then it doesn't really matter. It is Depp, not Bloom, who has inherited the mantle of Flynn and Fairbanks in this film. Jack Sparrow was the character who caught my imagination - and, since I'm extremely impressionable, also had a distinctly peculiar effect on the way I stood and walked for several hours later. And there's not many films can say *that*..! ÿ"
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw1702964",
      "warningSpoilers": false,
      "date": "30 July 2007",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Captain Jack Sparrow arrives",
      "content": "And he has a great entrance. A really great one, if you haven't seen it yet, go watch it! Even if it's only the first scene with Johnny Depp as Cpt. Jack Sparrow! While many/some have dismissed Johnnys performance here as being gay, I do think his intentions were others! That's not only because he himself said so in an interview (his inspiration being Keith Richards as he said), but also because I saw him as crazy, but genius guy, who was different.But kudos have also to go out to Gore Verbinsky. First of all, for resurrecting the pirate movie \"genre\" (maybe genre is not the right word, but you get what I mean) and also for sticking to Johnnys decision to play Sparrow the way he did! It's know that the studio didn't want Johnny to play it like that. They were afraid, that Johnny's performance would destroy it at the box office ... quite the opposite happened! Captain Jack Sparrow is the one who saved this thing from drowning (excuse the pun)! If you haven't watched it yet, go out and see it now! A great adventure with a crazy/great guy in the middle of it!"
    },
    {
      "username": "Dalina",
      "userUrl": "https://www.imdb.com/user/ur26300439",
      "reviewLink": "https://www.imdb.com/review/rw6510482",
      "warningSpoilers": false,
      "date": "21 January 2021",
      "rate": "10",
      "helpful": "56 out of 66 found this helpful.",
      "title": "Justice for Johnny",
      "content": "You bs people need to rehire Johnny and give a public apology to him for what you have done."
    },
    {
      "username": "briancham1994",
      "userUrl": "https://www.imdb.com/user/ur5788055",
      "reviewLink": "https://www.imdb.com/review/rw6012697",
      "warningSpoilers": false,
      "date": "20 August 2020",
      "rate": "7",
      "helpful": "5 out of 5 found this helpful.",
      "title": "A true adventure",
      "content": "This film is the epitome of a solid action-filled adventure. It has a straightforward and fast-paced plot that drags you in, propelled by a charming lead, witty jokes and compelling special effects. It roars along with gusto and thrills the audience from beginning to end."
    },
    {
      "username": "gooeysmoo",
      "userUrl": "https://www.imdb.com/user/ur3024079",
      "reviewLink": "https://www.imdb.com/review/rw0956335",
      "warningSpoilers": false,
      "date": "2 November 2004",
      "rate": "",
      "helpful": "185 out of 240 found this helpful.",
      "title": "Proof that Disney can still create good movies",
      "content": "Disney seemed to be going down the tubes lately, with Atlantis and Home on the Range, but this movie is a masterpiece. If it wasn't for this movie, Johnny Depp wouldn't be as famous as he is today. Every scene with him or Geoffery Rush is brilliant. The movie is very crisp and the shots of the islands are breathtaking. Definitely a movie worth picking up at Blockbuster or even better, buying ( I don't buy DVDs often but this was one of them). The characters are thought out very well and plot is excellent. The script is one of the main stars of the film itself, every line that seems to come out of Sparrow or Barbossa's mouth or any of the other cast is original. If you like action films you'll love this, if you like comedy you'll love this, actually, this movie is great for everyone (except small kids, who may get frightened by the skeleton scenes). 10/10"
    },
    {
      "username": "eak-1",
      "userUrl": "https://www.imdb.com/user/ur2693213",
      "reviewLink": "https://www.imdb.com/review/rw1226155",
      "warningSpoilers": false,
      "date": "27 November 2005",
      "rate": "10",
      "helpful": "1,002 out of 1,125 found this helpful.",
      "title": "Depp for Emperor?",
      "content": "I am nearly fifty years old. A sober grown man. With children. Children with whom I have now sat through hundreds of movies. Many of which I have enjoyed. And I am not completely hardened in my sophistication. The opening music to The Lion King brought tears to my eyes when my little ones were but wee tots. But still, these are after all just children's movies. In another life, I would never have seen them. And, really, one can't take such movies too seriously, can one?And so, this summer, after the ritual badgering, I dutifully trudged into yet another Disney \"adventure\" movie. Named after that tired old ride in Anaheim I first went on in 1965. I mean really, how much can you expect?And then, it happened. The swirling intoxication. The stunned feeling. What? Who? How? Was this a movie? Or a religious experience? Perhaps more like an addictive experience...I cannot remember ever willingly paying to see any movie not starring a relative of mine more than twice, and I can count those movies on one hand. I have now seen \"Pirates\" four times. The only thing keeping me from seeing it again is the sense that this whole thing is just getting out of hand. I cannot get enough of it. It's like walking into a painting that you never want to come back out of. My children ask, with a note of concern in their voices, \"Dad, you really like Pirates of the Caribbean a lot, don't you?\"And that Depp fellow. My God. I never had any idea who he was, but his name sounded like something created for a pubescent cover-boy for magazines published to hook thirteen year-old girls on make-up and bad music. Wasn't Depp the name of some hair-goo product back in the 60s?I am a straight male. I have several good friends who are gay, but have never fantasized about any gender but the female. But now I understand how women can experience swooning crushes on male film stars. He is simply extraordinary. So sly, so seductive, so canny! I read an interview in which Depp said he went through a slight depression when he had to stop playing Captain Jack Sparrow. I can see why. His inventiveness and sheer pleasure in inhabiting the character come through in every frame. How can I admit to my children that I now troll through fan websites about a former teen heart-throb?I often don't even watch the Academy Awards, and I certainly never have any emotional investment in who wins.Except for this year.Go Jack.And, in a time when many big-budget movies are little more than a hodge-podge of loosely- connected \"money shots\" this movie puts all the pieces together, with a sense of fun and light-heartedness in special effects that are simply dazzling. I find myself laughing with dizzy appreciation when Barbossa barks out, \"You'd best be believing in ghost stories, Miss Turner, you're in one!\" and the grinning skeletons come into view, with Badelt's pounding score keeping time to the beat of their maniacal deck-swabbing. And then there's the scene of the pirate-ghouls slithering up from the darkened sea on the mooring cables of the Dauntless, like infernal cats stalking their prey.And now to the music. I can just hear the effete aesthetes dismissing this score, as Mr. Zimmerman anticipates with his winking \"overproduced by\" credit on the cover-liner. \"Bombastic.\" \"Overdone.\" \"Absurdly Stupendous.\"Well, perhaps it is, for those who spend their lives evaluating such things. To me, it is absolutely transporting. I first listened to it while doing a work-out on a rowing machine and found that I tripled my usual distance. It was like mainlining some hazardous tachycardic amphetamine.Once again, the children were wondering, \"What's up with Daddy? Is he OK?\"Perhaps I am just losing my grip, having an adolescent movie get to me this way. But when those final credits roll, and Captain Jack narrows his eyes and says, \"Now, bring me that horizon. Drink up me hearties, yo ho\" and the music swells ... it is difficult to put into words the effect it has.At this point my children have to yank me forcibly from the theater, lest I persist in watching the credits to the bitter end, and bid good-bye to the little monkey once more, wiping tears of exultation from my eyes.This is not just another \"entry\" in the summer blockbust sweepstakes. It is an exquisite work of fantasy and inventiveness, a true classic, on the order of \"The Wizard of Oz.\" I do hope Depp's performance garners not just awards, but a place in the pantheon, something we old fogies -- and our gently fogeying children decades hence -- will show to our children and grandchildren like a revealed treasure. I cannot recall any movie having such an effect on me."
    },
    {
      "username": "JPW_3",
      "userUrl": "https://www.imdb.com/user/ur2881828",
      "reviewLink": "https://www.imdb.com/review/rw0884570",
      "warningSpoilers": false,
      "date": "3 February 2004",
      "rate": "",
      "helpful": "340 out of 428 found this helpful.",
      "title": "Why is the rum gone?",
      "content": "A damn good movie. One of the best of 2003 in my view.This movie made me laugh, and it really pulled me in.At first I was afraid this would be another bad Pirate movie. I went to see it anyway, as I've always loved the legends of pirates, and I love adventure. I saw it once. Then twice. Then Quadrupul. Then six times. And one more 7. And now I eagerly wait for the DVD in Australia.What i'm saying is I couldn't get enough of this movie. It was so well done.Johnny Depp was hilarious a Jack Sparrow, and acted like a true Pirate. His obsessive drinking antics, and his walk really brought out this chaqracter. Plus he made character we could all love and enjoy, that deserves an Oscar in my view.Geoffrey Rush played Barbosa the bad guy. Who turned out to be quite a good bad guy in my view. He showed real potential, and I loved the way how he manipulated people.Keira Knightley plays Elizabeth, the governor's daughter. Prisoner of the Pirates. She is quite momorable in this role, and is a great jump for her evergrowing popularity.Orlando Bloom plays Will Turner. A simple blacksmith, who is also a well trained swordsman. Who is in hot pursuit of saving Elizabeth from the Pirates.The more memorable thing about this though is the curse. A well thought out curse. That can always lead to sequel or a prequel. You'll see what I mean when you watch it.The story is based on these Pirates who happen to be cursed, and they want to rid the curse. To do that they need the blood of a pirate, not just any pirate but the son of Bill Turner- William Turner. Mistaken for Bill Turner's child the pirates Capture Elizabeth, and take her hostage, while William teams up with a Rogue pirate, Jack Sparrow, who is on a streak for revenge against Barbosa. While all at the same time are being chased by the british fleet.A great adventure. Well played swordfighting. Great laughs. Great music. And great story. Pirates are back in my good book."
    },
    {
      "username": "sajugopz",
      "userUrl": "https://www.imdb.com/user/ur97161418",
      "reviewLink": "https://www.imdb.com/review/rw5458533",
      "warningSpoilers": false,
      "date": "4 February 2020",
      "rate": "10",
      "helpful": "29 out of 34 found this helpful.",
      "title": "This movie never gets old.",
      "content": "I just forgot how many times I watched this film.This film has comedy,adventure,action.The climax was awesome.A must watch movie."
    },
    {
      "username": "Lechuguilla",
      "userUrl": "https://www.imdb.com/user/ur2420383",
      "reviewLink": "https://www.imdb.com/review/rw1166051",
      "warningSpoilers": false,
      "date": "5 September 2005",
      "rate": "",
      "helpful": "78 out of 128 found this helpful.",
      "title": "A Pirate For Our Times",
      "content": "What lifts this film above typical Disney fluff is Johnny Depp's humorous performance as pirate Jack Sparrow, the eccentric, individualistic anti-hero, who confronts other pirates, and outwits a humorless, incompetent bureaucratic establishment. Sparrow looks more like Cher than Johnny Depp, and talks more like William F. Buckley than a pirate. Geoffrey Rush is a worthy foil as the main rival pirate, Barbossa, a character who vaguely resembles Margaret Hamilton in \"The Wizard Of Oz\".Most of the plot is silly. There's lots of fighting, shouting, and general mayhem, all accompanied by a frantic score. It's a cinematic slight of hand that conveys an illusion of substance. Still, it's an entertaining popcorn flick. I'm glad I watched it. Depp's deft performance gives us a memorable character, one that is perhaps unique in cinema history."
    },
    {
      "username": "AJB2002",
      "userUrl": "https://www.imdb.com/user/ur98539338",
      "reviewLink": "https://www.imdb.com/review/rw5959373",
      "warningSpoilers": false,
      "date": "1 August 2020",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Is it true, was this masterpiece really based of a Disney Land ride?",
      "content": "The answer is yes, yes it was. Does that sound like a good economic decision? No it does not. Was it a good economic decision yes, yes it was....but who cares? Certainly not me for this film is brilliant, in every single way. Acting: Flawless. Music: Perfect. Writing/Plot/Story: Exquisite. Comedy? Hilarious. This film is by far one of the greatest films Disney has ever made. Watch it."
    },
    {
      "username": "semioticz",
      "userUrl": "https://www.imdb.com/user/ur16276985",
      "reviewLink": "https://www.imdb.com/review/rw1751152",
      "warningSpoilers": true,
      "date": "22 October 2007",
      "rate": "",
      "helpful": "31 out of 42 found this helpful.",
      "title": "Depp: My Favorite Pirate",
      "content": "Captain Jack Sparrow (Johnny Depp) is not y/our typical Errol Flynn type of machismo, swashbuckling pirate; nor does he play another Disney Captain Hook. He's more like Fagan in \"Oliver.\" Capt. Sparrow's ever so fey. That's his charm.Though the pirates on the \"Black Pearl\" ship are dead & sometimes in their skeleton form they aren't scary enough for kids since this is a comedy.The story line goes as follows: A governor's daughter is in charge of a young boy her own age who has been pulled out of the sea by her father's bourgeoisie crew. She notices his necklace is a pirate's & takes it from him to protect him from being hung to death.But, the golden medallion is the last 1 of a pirate's treasure that has cursed the \"Black Pearl\" ship's crew. Without its return, with the blood of the boy on it, the skeletal crew remains dead, unable to feel any life in themselves; they are also not killable since they are already dead.Capt. Sparrow (Depp), though a bumbling comical pirate who's bent upon owning the \"Black Pearl,\" the ship the cursed crew stole from him, plays a marvelously lovable & lucky pirate who is the super glue that holds together the loose ends of the movie. Depp gives his cutest performance I've seen; he's now my favorite pirate! The script is clever; cinematography is fine; special effects are spot-on."
    },
    {
      "username": "tburke85",
      "userUrl": "https://www.imdb.com/user/ur19956219",
      "reviewLink": "https://www.imdb.com/review/rw2064986",
      "warningSpoilers": false,
      "date": "11 May 2009",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Pirates A Terrific Adventure Film",
      "content": "Pirates Of The Caribbean Curse Of The Black Pearl is a terrific adventure film with action, drama, suspense, some romance, and humor. Johnny Depp is amazing as Captain Jack Sparrow and he's clearly having a lot of fun with this character. The rest of the supporting cast are great in their roles including Geoffrey Rush as the villain Captain Barbossa, Orland Bloom as Will Turner a blacksmith, and Kiera Knightely as Elizabeth Swann. Gore Verbinksi does a fantastic job of bringing this movie to the big screen. From the action, to the drama, to the humor and adventure this film has something in it for everyone who's looking for an entertaining movie to watch. It really is that good and The Curse Of The Black Pearl is now one of the my favorite movies. With two possible sequels on the way lets just hope they can be just as good or even better than this one. Go see it you won't be disappointed even with a running time of 2 hours and 23 minutes the movie is fast paced and action packed. With plenty of humor thrown in that balances well between the drama, suspense, and action."
    },
    {
      "username": "localvolta",
      "userUrl": "https://www.imdb.com/user/ur85614780",
      "reviewLink": "https://www.imdb.com/review/rw5983685",
      "warningSpoilers": false,
      "date": "11 August 2020",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Perfect beginning",
      "content": "Beautiful,huge production.Amazing beginning of the magnificent series.Memorable Jack Sparrow acting.Well written scenario,well directed movie,well played pirate. Music.Hans Zimmer.Like his other jobs. perfect.Let the series begin."
    },
    {
      "username": "rajanpandey-36042",
      "userUrl": "https://www.imdb.com/user/ur121120832",
      "reviewLink": "https://www.imdb.com/review/rw5974854",
      "warningSpoilers": false,
      "date": "8 August 2020",
      "rate": "9",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Wow....!!!",
      "content": "Beautiful costumes..amazing story and concept and Johnny depp is simply amazing as captain jack sparrow. Must watch..its a combo of Action Mystery..Comedy and Adventure..."
    },
    {
      "username": "crazy_caz",
      "userUrl": "https://www.imdb.com/user/ur3419864",
      "reviewLink": "https://www.imdb.com/review/rw0884712",
      "warningSpoilers": false,
      "date": "22 May 2004",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "A VERY GOOD FILM!!!!!",
      "content": "Pirates of the caribbean is not only an action, but funny and a bit of horror too, EVERYONE who i have asked if they like it have said yes, its a film that almost everybody likes, no matter what age or genre they like.It stars Johnny Depp is the fearless pirate Jack Sparrow, Orlando Bloom is the young Blacksmith and Keria Knightly is the governors daughter. This is one of Johnny Depps best films, and he really makes the film what it is!!The graphics were above average and the story line is not boring what so ever, everyone is entertained.I have to say i cant wait for the next one to come out."
    },
    {
      "username": "rising_star-42",
      "userUrl": "https://www.imdb.com/user/ur1086407",
      "reviewLink": "https://www.imdb.com/review/rw0883211",
      "warningSpoilers": false,
      "date": "10 July 2003",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Bloody Brilliant!",
      "content": "Pirates of the Caribbean is a well-written, well-made, and well-acted film. Do not expect a simple action film; it is humourous and creepy, fascinating and thrilling. Like most films, there are a couple of holes here and there in the fabric of the story; but this film wasn't made for the Oscars, it's meant to entertain and it succeeds in full at that. It's a jolly good time with some good actors (and great Academy Award Winner Geoffrey Rush) and high adventure on the high seas. Not to be missed!"
    },
    {
      "username": "connork97",
      "userUrl": "https://www.imdb.com/user/ur48599944",
      "reviewLink": "https://www.imdb.com/review/rw2917479",
      "warningSpoilers": false,
      "date": "5 December 2013",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "This is a true classic",
      "content": "There are two few action-adventure movies now a days that delivers such original characters, played by a truly incredible cast. When I first saw The Curse of the Black Pearl as a boy I was fascinated. There where Pirates, cannons, sword fights, treasures funny monkey's and a beautiful girl, What more could you possibly ask for. I can still remember when I saw Jack Sparrow for the first time. He may not of had the typical \"hero\" qualities that would see in somebody like say William Turner, but that is what made jack so undeniably brilliant, he wasn't somebody we have experienced before. He was a witty, drunk, Sword fighting Pirate, with a flare for the dramatic. Seen for the first time in possibly the greatest hero entranced ever made. I glanced my stunned eye's at the screen to behold the one they called Jack Sparrow, or should I say \"Captain\" Jack Sparrow. There he stood in all his glory, the anthem soundtrack blared as he stood on top of his wooden sinking ship, or boat... As he floats by the pirate outlaws hung by there necks, with a sign on them that states \"pirates Ye Be Warned\" he stops bailing his sinking boat in time to offer a kind salute, to his fellow dead pirates.Its not long in till we are swept away by a amazing story of a two men desperately trying to find the loves of there life. One a Pirate after his stolen ship, and the other, a working hard blacksmith boy, trying to find his true love. Luckily for them, both loves have been taken by the \"crew of the dammed\". Barbossa, the fearless pirate with a pet monkey, yes a pet monkey. It soon becomes apparent that everyone in the story wants something, and they will screw and back-stab anyone who gets in there way, honestly this film there are know such thing as true friends, everyone will become an enemy in time.After years of watching this film, it still reveals itself as nothing more but a great adventure movie, just plain fun. So why not give it ten out of ten. There is everything you want in an adventure movie, girls, fights and a little magic and mystery. Not to mention some of the best 1-liners you will ever hear, \"you best start believing in ghost stories miss turner, you're in one\", and my personal favourite, the very last line in the film, as Jack prepares to embark on more of his adventures he quotes \"bring me that horizon\" as the ship sales off into the sunset."
    }
  ],
  "errorMessage": ""
}