{
  "imDbId": "tt0072684",
  "title": "Barry Lyndon",
  "fullTitle": "Barry Lyndon (1975)",
  "type": "Movie",
  "year": "1975",
  "items": [
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw2055218",
      "warningSpoilers": false,
      "date": "20 April 2009",
      "rate": "10",
      "helpful": "143 out of 178 found this helpful.",
      "title": "Great Paintings Come To Life",
      "content": "Some movies - I wish there were more of them - simply look like a series of great paintings. This film has that look. You could freeze-frame many of the scenes and swear you were looking at a Gainsborough, a Vermeer, a Hogarth or similar work of art by one the great artists of three to five centuries ago. It's just beautiful.For that, we have Director Stanley Kubrick and Photographer John Alcott to thank. Being a three-hour movie, there are plenty of wonderful shots to admire, too. In addition, the costumes are lavish and authentic and the scoring is notable. It's no accident that Oscars were garnered for art/set direction, cinematography, costume design and scoring. Yeah, if you enjoy classical music, you'll really enjoy the soundtrack, too, under the guidance of conductor Leonard Roseman.Not to be overlooked is the fine acting and the interesting and underrated story. I say \"underrated\" because this film, from what I've read, bored a lot of people and and it was a box-office flop. That's too bad because, frankly, I found the story (outside of the first 10--15 minutes) to be fascinating. As I watched, I kept wondering what strange occurrences will happen next to the lead character, \"Redmond Barry/Barry Lyndon,\" played beautifully by Ryan O'Neal. (For most of the movie, he's called \"Redmond Barry,\" so I will refer to him as that.) Overall, this was a low-key adventure story about the rise-and-fall of a \"scoundrel\" back in late 18th century Englishman. \"Mr. Barry\" is an Irishmen living in England who winds up dealing with a number of people: Irish, English, Prussian, French. His dealings with these people are bizarre at times. While he mainly is shown doing what he can to promote himself, for either monetary gain and prestige of a name and power, he's not all bad. There is a compassionate side to him, but it only shows itself in small doses. It makes him all the more interesting to watch, because you don't always know how he's going to react to his circumstances, which change radically every few years.We witness his rise to prominence and then his fall when his \"sins begin to find him out,\" as the Bible would describe. It's quite a roller coaster ride.This is an emotional, involving story, and a feast for the eyes and ears. It's quite different, too, certainly not the average fare from Kubrick. I can only hope this comes out on a high-definition disc some day. Admirers of this film need to see this in all its glory."
    },
    {
      "username": "Spleen",
      "userUrl": "https://www.imdb.com/user/ur0035229",
      "reviewLink": "https://www.imdb.com/review/rw0140181",
      "warningSpoilers": false,
      "date": "11 March 2002",
      "rate": "10",
      "helpful": "334 out of 405 found this helpful.",
      "title": "I can't believe that there are people who find this dull.",
      "content": "In fact it's one of Kubrick's most gripping pictures, with a narrative drive second only to that of \"Dr. Strangelove\" (and it's unquestionably a more glorious creation than, say, anything he made in the 1950s). English director Michael Powell (while attributing a similar failing to one of his own works) says that Kubrick fell into \"the trap of the picturesque\", but while I admire Powell as a creator, the judgment is absurd: at the VERY least, each lush image shows us people not just occupying a part of the screen but inhabiting a world, and tells us much about their relation to that world. Many shots are indeed amazing and beguile the eye, but they don't have the effect they do simply because they would make nice postcards.THIS, I feel sure (without having read Thackeray), is the proper way to adapt a long story from novel to screen. Each scene is either allowed as much time as it needs to make its point and its impact, or it's cut altogether - you won't catch Kubrick skating too quickly over his material for no better reason than to fit it all in. The third-person narration (consisting of witty, beautifully crafted sentences - it's about time I did read Thackeray) almost performs a kind of dance with the images, gliding in just when we need it, taking a step back when we don't. (So rarely is even third-person narration used so well.) And as always, Kubrick's musical sense is unerring. My impression at the time was that I was listening to mid-eighteenth century music that gave way to pieces from the classical era as the hero started to move in higher and higher circles. I was more or less right. But then I noticed Schubert's name in the credits - and I realised with a start that I'd been listening to, had even started tapping my feet to, a Schubert piece I was familiar with, without the anachronism registering.It's a pity Kubrick stopped making epics after this. Look at the ones he's responsible for: \"Spartacus\" (not a project Kubrick was fond of, admittedly, but still the most magnificent of all Roman epics) \"2001\" (the most magnificent of ALL epics), and \"Barry Lyndon\". The last of the three is by no means a poor cousin."
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw1658035",
      "warningSpoilers": false,
      "date": "18 May 2007",
      "rate": "10",
      "helpful": "163 out of 198 found this helpful.",
      "title": "\" good or bad, handsome or ugly, rich or poor, they are all equal now\".",
      "content": "The beauty, the depth, and the mystery of this film are unsurpassable - what Kubrick was doing with light is just a miracle. Special lenses were designed to shoot interiors and exteriors in natural light. In one scene Barry (Ryan O'Neil) was having a dinner with a German woman who was feeding her baby and the candle light made the whole scene look like a Caravaggio's painting. This is just one of many scenes. Each of them is perfection and harmony. Costumes and sets were crafted in the era's design. Age of Enlightenment with its gallantry, wars, and duels, had been recreated in the film with the precision of the celebrated landscape and portrait masters of the period such as Thomas Gainsborough; Sir Joshua Reynolds, founder of the Royal Academy of Arts; George Romney to name just a few. If nothing else, watching BL is pure aesthetic delight - and there is one man who responsible for it, Stanley Kubrick. If ever divine film was made, \"Barry Lyndon\" was it and Kubrick could've quoted the Bible - \"God looked at everything he had made, and he found it very good\".I've read the comments and articles that call \"Barry Lyndon\" cold, slow, boring, \"the collection of pretty pictures', \"flawed\" masterpiece, and the most ridiculous one, \"glittering ornament with a hollow center\". I simply can't understand it. \"Barry Lyndon\" is the most compelling and compassionate realization of the inevitable finality of everything in this world which was presented by the visionary director with elegant sensual melancholy. Stanley Kubrick known for his detached, seemingly remote and non-sentimental style chose to reach out to his viewer directly during the epilogue, \"It was in the reign of George III that the aforesaid personalities lived and quarreled, good or bad, handsome or ugly, rich or poor, they are all equal now\". I don't recall any other movie that would illustrate the old wisdom, \"everything will pass\" in such sublime and deeply moving way."
    },
    {
      "username": "Captain_Couth",
      "userUrl": "https://www.imdb.com/user/ur0361658",
      "reviewLink": "https://www.imdb.com/review/rw0956575",
      "warningSpoilers": false,
      "date": "3 November 2004",
      "rate": "10",
      "helpful": "232 out of 300 found this helpful.",
      "title": "The World of Stanley Kubrick: A young rapscallion makes good in 18th century Europe.",
      "content": "Barry Lyndon (1975) has to be Stanley Kubrick's most realized project that he has ever taken. A big task for the maverick director. For a film like this to be made during the free wheeling seventies had to take some big stones. One must admire Mr. Kubrick for even trying to produce and direct such a complex and expensive film that had all the ear markings of a financial and personal disaster. Not only did Kubrick manage to out do his last epic \"2001\" but he has created a movie that not only showcases the untapped acting abilities of Ryan O'Neil, but a beautifully lensed film that uses minimal lighting , gorgeous sets, perfect balance, positioning and meticulous timing. I have never seen such a magnificent film such as this one. Every shot and frame plays out like an eighteenth century oil painting.A young Irish man of lower class has the strangest quirk of luck. After participating in an illegal duel, young Barry is forced to flee from his home village. After being accosted by some gentlemanly highway robbers, Barry winds up cross country and becomes a conscripted soldier. Rising in rank, Barry is sent to fight in the Seven's Year War. Whilst in battle he watches his friends and fellow soldiers being slaughtered in combat due to poor tactics and leadership. Having enough of this life of hardship and struggle, Barry uses his god given talents to do what he has to do in order to survive and become a man of proper social standing.I was very impressed with this movie. I've put off watching this film until recently. Some have told me how long and boring this movie was. Others have said it was pretty self serving and not worth watching. But after seeing part of it on T.C.M., I just had to find a copy of my own. The film is over three hours in length but they go by very quickly because Barry's story is so captivating. Kubrick poured his heart and soul into this film. The results are on the screen. He's clearly a master film maker. His reputation is cemented forever with this movie. Ryan O'Neil impressed the hell out me with his role as Barry Lyndon. He gives the character some dignity and depth that no other actor could have possibly given to the title role.Overall I would have to give this film one of my highest recommendations. This is one of my top ten films of all time. If people tell you not to watch this masterpiece ignore them. I advise you to get a copy and enjoy. For a film like this you need to set aside a weekend afternoon to fully appreciate a film such as this. Believe me you will not regret it.Highest recommendation possible.It doesn't matter whether you watch it on D.V.D. or V.C.D. because the transfers are excellent on either format."
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw1696002",
      "warningSpoilers": true,
      "date": "18 July 2007",
      "rate": "",
      "helpful": "59 out of 80 found this helpful.",
      "title": "A man at war with the cosmos",
      "content": "Kubrick's \"Barry Lyndon\" project was initially a project about Napoleon Bonaparte. Simply titled \"Napoleon\", the film aimed to portray the life of a lowly man who had seemingly conquered his environment. Like an obsessive film director (guess who), Napoleon tamed his surroundings, forcing the cosmos to bow to his own singular vision.Kubrick envisioned this film as being awash with intricate plans, strategies, military formations, and animated schematics. His Napoleon was a man who took control and waged war, not against the Spanish, Russians or Italians, but against an indeterministic, malevolent universe. But of course, like Johnny Clay in \"The Killing\", Napoleon does eventually fail. He suffers a series of military defeats which leads to him realising that, even without his obsessive micromanagement, all his battles would have achieved the same results. Variables far beyond his reach governed the final outcome.The Napoleon project failed to materialise for various financial reasons. Always the pragmatist, however, Kubrick then decided to make the complete thematic opposite of Napoleon.And so we have \"Barry Lyndon\". Unlike Napoleon, Barry doesn't scheme or try to force things into position. A man at the mercy of (or oblivious to) the cosmos, he does as told, taking fortunes and misfortunes as they occur.While Kubrick's \"form as content\" approach dictated that Napoleon be awash with intricate plans. . .plans in which a mere man seemingly thwarts nature (a largely Gnostic nature that is evil, malevolent and hostile), Barry Lyndon's \"form as content\" approach dictates that Kubrick's universe completely subvert Barry the man.And so we have a cosmic tragedy in which the very form of the film attempts to reduce man to nothingness. Kubrick's painterly canvas locks his actors into predetermined compositions, such that they appear to have no free-will, unable to break free. He portrays the universe (director) as the ultimate artist, its beautiful brush-strokes concealing its suffocating ugliness, life itself portrayed as being the artistic result of the universe's unmappable web of rules and formulae.Similarly, each event in the film is portrayed as being the direct result of some prior occurrence. The first scene highlights this continuous past/present relationship. Watch too how the clouds, trees and walls in the first shot \"frame\" Barry' father; man is a spec on the horizon, playing his ritualised games as the cosmic order engulfs him. Likewise, the character's are all bound by duty and rigid social roles. Their lives are ritualised, robotic, learnt and rehearsed. While \"Dr Strangelove\" and \"2001\" are swathed in birth and sex imagery, here Kubrick uses a semiotic fabric of chance. Every scene is awash with games of chance, duels, courtship, cards, gambling, luck etc, all of which bolster the notion of fate on Barry's life.Even the narrator subverts Barry's story. While the acting and visual compositions attempt to relegate Barry to the background, the narrator attempts to undermine his tale by negating all drama and tension. Why are you watching this man, he says? He is nobody. (\"Though this encounter is not recorded in any history books, it was memorable enough for those who took part\") Of course, visually, the film is unsurpassed. But this is a film in which beauty and cosmetics seduce us away from innate malevolence. This is a Schopenhaueren world in which finiteness is at war with the infiniteness of Time and Space. A world in which the present is constantly Becoming without Being, man a desire machine continually wishing without being satisfied, his efforts always thwarted, victory rarely won. Time, and the transitoriness of all things, are merely the form under which the will to live, has revealed to Time the futility of its efforts. In this world, no man is happy, always living in expectation of better things, always striving or demanding \"satisfaction\". A world in which man accepts the present as something that is only temporary and regards it only as a means to accomplish his aims. Beauty, sensuality, aesthetics, splendour and riches, are thus futile attempts to escape the inherent misery. Disillusion behind illusion.Thus, Kubrick places emphasis on the landscape and background to such an extent that his visual style subverts the character's on screen drama. Typical cinematic language is therefore REVERSED, such that we have a BACKGROUND which is constantly fighting to drown out Barry's FOREGROUND story. Expanding the metaphor further and we have a universe which gradually dwarfs and suffocates Barry's life.Kubrick's constant use of long zoom ins and zooms outs further highlights this theme. Here is man, ZOOM OUT. . .and here is man put in context. The irony is that whenever Barry attempts to assert himself over this natural law, he's punished terribly.The most severe punishment occurs during the duel at the end of the film. After a misfire, fate rolls in Barry's favour, giving him the opportunity to shoot his opponent down. But no. Refusing yet again to be a pawn, Barry altruistically chooses to exhibits free will at its most pure. He sacrifices himself. And of course he's punished dearly for this. Frozen in time, he's robbed of his leg, immobilised, pinned in place by history, no longer able to prowl his pretty canvas.And so the entire film is about the inevitability of loss. Barry loses his father in the first shot, his first love (cousin) in the next. He loses his home, his family, his surrogate father (the general), his second surrogate father (chevalier), his son, his wealth and finally his leg. With the loss of his leg, he is then literally frozen as \"art\". As historical image. Significantly, the only object in the film able to outpace Kubrick's zoom out is a coffin, which moves inexorably toward the moving camera. As death is constant, all history is about loss.20/10 - Doomed to never be fully appreciated."
    },
    {
      "username": "TheAnimalMother",
      "userUrl": "https://www.imdb.com/user/ur18519281",
      "reviewLink": "https://www.imdb.com/review/rw7253234",
      "warningSpoilers": false,
      "date": "21 August 2021",
      "rate": "8",
      "helpful": "15 out of 16 found this helpful.",
      "title": "Death Or Glory - Just Another Story",
      "content": "In terms of story this is on the surface at least, the simplest thing Kubrick ever made. However in terms of the technical aspect, it must have been one of his most challenging. The plot is basically about how greed, arrogance and ignorance can easily become the ruin of a man. The story itself is well told, but mostly quite simple as I said. The humor keeps us interested in the story, as does its undeniable visual beauty. It is not a stretch to say that this must be among the most beautiful looking films ever made. Every scene is filmed in all natural light, whether it be by sun or fire, and the landscapes and architecture handpicked by Kubrick himself are amazing. As in all Kubrick films, so much attention to small details equates to a great result in the end. Spielberg himself has called this film \"possibly the most beautifully shot film in history.\".In terms of story, it's entertaining, in terms of it's technical achievement, the film is a landmark. Even for all the story's simplicity, there is a startling statement in the film that certainly can give the viewer real pause and thought. The finality of this world, the equality of all things in the end. It is certainly an interesting, powerful and very humbling down to earth observation. It is the kind of worldly observation that could perhaps lead some people to ruin, and yet lead others to strive for perfection. Perhaps that is part of Kubrick's thinking here, a Kubrickian challenge if you will, as he certainly was always an artist that was challenging his viewers. That through this observation people may become more aware of what they're leaving behind in this world...as one day, we will all equally be gone. For all the things written about this film, it is probably not nearly as unimportant of a story as many critics have said of it. Then again, critics and moviegoers alike have long been trying to catch up to Stanley, and never the other way around. 8.5/10."
    },
    {
      "username": "TBJCSKCNRRQTreviews",
      "userUrl": "https://www.imdb.com/user/ur2093818",
      "reviewLink": "https://www.imdb.com/review/rw0980755",
      "warningSpoilers": false,
      "date": "18 December 2004",
      "rate": "10",
      "helpful": "83 out of 122 found this helpful.",
      "title": "A tale of love, war and power",
      "content": "While this is, in my opinion, not the best of Kubrick's films, it is in no way a bad film of his... some have claimed it is overlong and dull, but I don't think so. From what I've heard, it does the novel justice, and I believe that is what Kubrick went after, more than anything else. That is admirable, for a man who throughout his career was known for making unfaithful film adaptations of famous and popular novels, much to the dismay of the authors. The film perfectly presents everything from the time period in which it takes place... something that few, if any, other films have accomplished. It deals with the life of Redmond Barry, his ups and downs. The first half has us feeling sympathy with him, and shows his rise to a high position and gain the name Barry Lyndon, and everything that entitles. The second seems to turn us a little more against him, as he goes through the expected downfall that must always follow an unexpected rise to high life. Through the film he gets desensitized and careless. We follow him through most of his life, and an uneventful one it is not. As all other Kubrick films, the visual side is probably the most prominent one of the film, as he grants us several long looks at the beautiful sets and locales, and there are more than a few of his trademark shots slowly zooming out from the focus point to display the surroundings. The plot is great, and almost constantly developing. It is narrated with a good sense of irony and clever social satire on the time period. There's plenty of humor in the film to make the three hour run-time seem less long. The pacing is good and thorough without the film being slow(though I do admit that it isn't a film for those who are not used to long, visual films). The characters are well-written and credible. The acting is excellent all the way. Not even the child-actors seemed less than perfectly convincing. The costumes and sets are great. From what I understand, there is no detail in the film that is even slightly historically inaccurate. That is quite impressive for a film that takes place about a century and a half before it was made. I have heard of great deals of work done to keep many films accurate, but I don't believe one exists that manages to do so with such perfection as this. Even the very language that they speak is accurate. The special effects in the film also deserve mention here... for a film that is almost thirty years old, it's impeccable how believable and convincing the effects are... I couldn't tell how most of them were done. Kubrick was indeed one of the most brilliant directors ever... he was not only a master at his craft, he was also one of the most innovative and inspiring film-makers to have ever lived. I recommend this great piece of cinema to anyone who has an interest in the time period the film is set and any fan of Stanley Kubrick. Don't miss this one. Not his greatest, but a truly great one nonetheless. 10/10"
    },
    {
      "username": "pooch-8",
      "userUrl": "https://www.imdb.com/user/ur0197287",
      "reviewLink": "https://www.imdb.com/review/rw0140115",
      "warningSpoilers": false,
      "date": "24 August 1999",
      "rate": "",
      "helpful": "84 out of 109 found this helpful.",
      "title": "Opulent costume drama from the great filmmaker",
      "content": "Kubrick's adaptation of Thackeray's Barry Lyndon sharply divides fans of the great director's work, as the languid pace and seemingly interminable running time -- not to mention Ryan O'Neal's questionable performance in the title role -- are cherished by some and deplored by others. Little argument will be made against John Alcott's Academy Award-winning cinematography or Ken Adam's production design, however, and Kubrickian motifs are manifest in the gallery of characters' wide-ranging displays of cowardice, guile, duplicity, avarice, jealousy, greed, and cruelty. Marisa Berenson is terribly short-changed in her role as the Lady Lyndon, but a number of other performers are given the opportunity to create a handful of memorable moments -- especially Arthur O'Sullivan (albeit briefly) as the charming, intelligent highwayman and Patrick Magee as the Chevalier. Love it or hate it, Barry Lyndon will remain essential viewing for aficionados of the director, who enjoys taking his usual shots at the more discouraging aspects of human behavior."
    },
    {
      "username": "DennisLittrell",
      "userUrl": "https://www.imdb.com/user/ur0226855",
      "reviewLink": "https://www.imdb.com/review/rw0140175",
      "warningSpoilers": false,
      "date": "6 February 2002",
      "rate": "10",
      "helpful": "137 out of 199 found this helpful.",
      "title": "Lavish, engrossing, picaresque",
      "content": "(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon.)Stanley Kubrick's beautifully opulent production takes many liberties with William Makepeace Thackeray's picaresque romance, The Memoirs of Barry Lyndon, Esq (1843), narrated in the first person depicting events from the eighteenth century. In particular, Redmond Barry who becomes Barry Lyndon, is something of an admirable rake, whereas in Thackeray's novel he is a braggart, a bully and a scoundrel. No matter. Kubrick, in keeping with a long-standing filmland tradition, certainly has license, and Thackeray won't mind.Ryan O'Neal is the unlikely star, and he does a good job, rising from humble Irish origins to the decadence of titled wealth, employing a two-fisted competence in the manly arts, including some soldiering, some thievery at cards and a presumed consummate skill in the bedroom. Marisa Berenson plays Lady Lyndon, whom Barry has managed to seduce; and when her elderly husband dies, she marries Barry thus elevating his social and economic station in life. But Barry is rather clumsy at playing at peerage, and bit by bit manages to squander most of the Lyndon fortune until his stepson, Lord Bullingdon (Leon Vitali) grows old enough to do something about it.This really is a gorgeous movie thanks to the exquisite sets and costumes and especially to John Alcott's dreamy cinematography and a fine score by Leonard Rosenman. The 184 minutes go by almost without notice as we are engrossed in the rise and fall of Barry's fortunes. There is fine acting support from Patrick Magee as the Chevalier de Balibari and Leonard Rossiter as Captain Quinn, and a number of lesser players, who through Kubrick's direction bring to life Europe around the time of the Seven Years War (1754-1763) when decadence and aristocratic privilege were still in full flower.The script features two dueling scenes, the first showing the combatants firing at one another simultaneously at the drop of a white kerchief, the second has Barry and his stepson face each other ten paces apart, but due to the flip of a coin, the stepson fires first. Both scenes are engrossing as we see the loading of the pistols with powder, ball and ramrod, and we are able to note how heavy the pistols are and how difficult it must be to hit a silhouette at even a short distance. It is this kind of careful attention to directional detail that absorbs us in the action and makes veracious the story. Notice too the way the British soldiers march directly en mass toward the French guns. They actually used to fight battles that way! Also note the incredible pile of hair atop Lady Lyndon's head. Surely this is some kind of cinematic record. Bottom line: one of Kubrick's best, certainly his most beautiful film."
    },
    {
      "username": "KimotoCat",
      "userUrl": "https://www.imdb.com/user/ur3992535",
      "reviewLink": "https://www.imdb.com/review/rw1005547",
      "warningSpoilers": false,
      "date": "24 January 2005",
      "rate": "10",
      "helpful": "443 out of 504 found this helpful.",
      "title": "A film so easily dismissed",
      "content": "In the midst of the many wonderful films made by Stanley Kubrick, it is strange to note how rarely people mention \"Barry Lyndon\".The film portrays an unusual young Irish man, Redmond Barry, and his endeavours as he is forced to leave his home and tries to make good his life elsewhere. His life away from home starts out as a career in the British Army; only to evolve in surprising ways and lead to as different places as a position of trust within the Prussian Army and later a title of nobility, gained by what our time can only measure as rather disgraceful means.Some consider Barry Lyndon a slow and tedious film  and it is in deed past three hours in length, but this is because of the artistic flow of a film that strays not only to tell a tale about a man who is by no means neither hero nor villain, but also a film which is in no hurry and takes the time for every detail to sink into the mind and heart of the viewer. Some of the scenic images in \"Barry Lyndon\" are in themselves pieces of art, rendered with a passion for the landscapes and the man-made structures within them.The myth that all scenes were recorded using no artificial lighting no doubt stems from the very realistic lights during indoor takes, and some of them truly did not feature artificial light. This is but one of the many details that so easily conveys a sense of a realistic portray of the era; the 18th century and the time after the seven-year war in the later half of the century. The impressive atmosphere and the wonderfully picturesque scenarios along with the fact that the entire plot moves at a calm pace makes this film a very pleasant experience.\"Barry Lyndon is\", amidst Kubricks' many masterpieces, a film so easily dismissed due to length and the fact that it is overshadowed by others, but I deeply recommend this film to anyone who would like to see a film both for the plot line, the story and the pure enjoyment of the images presented. Stanley Kubrick made many great films  and this one is most definitely one of them! KimotoCat"
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0140168",
      "warningSpoilers": true,
      "date": "28 November 2001",
      "rate": "",
      "helpful": "34 out of 53 found this helpful.",
      "title": "Living in Space",
      "content": "Spoilers herein.Kubrick is a hard filmmaker to touch. He's obviously competent, even brilliant in some ways. And a few of his films -- `Strangelove' comes to mind -- make enough sense superficially that one is not compelled to go farther. The problem is that Kubrick never gives us much hint that his films are a whole different beast than the others on the shelf at the video store. I think he relished the confusion.Most films tell a story in the old fashioned way: time moves, things happen, characters act. In these films, the story is largely apart from the storytelling. Because film is different than everything else, the means of storytelling are unique to film. And because film is still new, we have lots of room for discovering how to tell a story.So we have the vast majority of filmmakers and viewers who think of a film purely in terms of the story. But we have another group of people who watch the storytelling, and perhaps (like myself) don't demand that much from the story itself. That's why we admire empty stylists like De Palma, but of course prefer master visual storytellers like Kurosawa.The holy grail is when the narrative of the conventional threads and the cinematic ones mesh, or are coordinated in some clever way. By cinematic threads, I mean a narrative invested in the very fabric of the camera, like `Marienbad,' like `Pillow Book,' like Welles' `Othello,' or with the aid of actors like `Sweet and Lowdown,' or `Vanya on 42nd Street.' There's a sublime joy to parallel immersion in both the story and cinematic narratives.But sometimes along comes a Kubrick to confound us. I spent a lot of time with `Eyes Wide Shut' before understanding it, because I was looking for the tie with the story. But Kubrick has the equation the other way around. The primary narrative anchor is in the cinematic narrative. The story isn't a skeleton around which the filmmaking takes place, rather an annotation or an incomplete dream that results from it. Jarmusch, Malick, and Kar-wai Wong (`In the Mood for Love') have this same attitude, with minor twists.Freed from limiting expectations, I am now able to enjoy `Barry Lyndon' in more the way I think Kubrick saw it. It is not a story about a Black Irish told through pretty pictures. It is a visual tone poem on the seduction of beauty, with a dissonance between natural beauty and cosmetics. The primary story is visual. It needs space. It needs time. (`2001' has the same cinematic narrative, with the `cosmetics' being logic; the minor twist in `Clockwork' is that the cultural cosmetic is in the future.)The part of the narrative that O'Neal contributes is a loose stitching of this to plot elements as seasoning to help our digestion: war/ gambling, arbitrary privilege, duals and duels, face and body costumes, superposition of languages.The ironic point is that Kubrick tricks you into soaking up the lushness, and doesn't punish you at the end. That's why you leave the theater feeling guilty and not knowing why. (He takes away one of our legs -- the story -- and sends us to wander in America, not quite sure what has happened to us.) Can you think of any other artist with that power?"
    },
    {
      "username": "Angry_Arguer",
      "userUrl": "https://www.imdb.com/user/ur1578251",
      "reviewLink": "https://www.imdb.com/review/rw0140217",
      "warningSpoilers": false,
      "date": "14 August 2003",
      "rate": "10",
      "helpful": "114 out of 180 found this helpful.",
      "title": "The Camera and the Stage",
      "content": "When I was in high school, it was considered \"cool\" to watch Stanley Kubrick movies as they were seen as \"more enlightened forms of entertainment\" over stuff by Steven Spielberg and John Hughes. If you didn't memorize the opening speech to Full Metal Jacket or hadn't seen Nicole Kidman in Eyes Wide Shut then you were rejected from the clique. This was at the time when I was first viewing Kurosawa's Rashomon and Ran and accidentally came across this gem. Sure, the rest of the gang would be quoting along with Alex DeLarge in A Clockwork Orange, but not one of them would dare sit down and watch this or 2001: A Space Odyssey. Fools.Barry Lyndon is another sign of sheer genius on behalf of Kubrick. Notice that in his career he is never concerned about making money, just creating an image and telling a story. Imagine if Michael Bay did the same, he'd be out of the business in no time and having to sell his own movies at the Video Hut. This movie is one of his better detailed (and yet mysteriously unsung) masterpieces that is so beautiful to look at that it almost becomes artistic pornography (in the sense of creating intense emotion). This isn't to say that Barry Lyndon is vulgar. By comparison to Eyes Wide Shut and The Shining, this is a kid's cartoon.Kubrick is once again a certified genius with his camera. The elaborate and glamorous scenes ranging from duels to gardens and even just the opening prologue are beautifully rendered in a style reminiscent of Monet or other artists. I found it interesting how Kubrick includes pigeons (doves?) in the final duel. Perhaps John Woo gained some inspiration from this.The story is paper thin compared to 2001 and lacks much of the symbolism. In fact, it is very hard to either sympathize with Ryan O'Neil as the title character because of his lack of portrayal. As a whole, none of the characters gain either support or disapproval because of their fleeting presence. The sets and costume designs themselves become more of a character than the actors. Thankfully, the story is not as convoluted as I expected. It flows nicely and never gets boring because of the variety of powerful elements infused into it.First off, kudos to both Ken Adam and Vernon Dixon for their brilliant production design. I loved what Ken did with Dr. Strangelove (smart move for him to ditch the Bond series for that). John Alcott is one of Kubrick's lesser cinematographers, but he is still very talented here. I'm certain that, if he had lived longer, Kubrick would've kept using him. He is not as concerned about symmetry, that or the topics aren't, as the rest of Kubrick's work. The biggest irony about Barry Lyndon would have to be that everyone in the categories EXCEPT Kubrick won an Oscar for their work. I think the Academy has something of a grudge against him because of his superior quality of work.Overall, a phenomenal quality of film that they just don't make anymore. I put this in my Top 10 required viewings for anyone who wants to be in film. Kubrick has transcended Shakespeare with this film. 4.5 out of 5 stars."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2368804",
      "warningSpoilers": false,
      "date": "13 January 2011",
      "rate": "10",
      "helpful": "27 out of 43 found this helpful.",
      "title": "One of Kubrick's best and most misunderstood",
      "content": "Not his best(2001), but Barry Lyndon is a beautiful film that is so easily dismissed. I am fond of Stanley Kubrick's movies, and I honestly think Barry Lyndon is one of his best. I am not sure about it being underrated, but it is almost certainly misunderstood. Yes it is long, and yes it is slow. The length didn't bother me, and neither did the pace actually. The slow pacing as others have said is deliberate, it is essential to the rhythm of this film. Even if you can't adjust to the film's pace, so many other things compensate, especially the authentic period look, the ravishingly beautiful photography, Kubrick's superb direction and a hypnotizing music score. The story is well constructed, as is the dialogue, while the acting is fine. Ryan O'Neal and Marissa Berenson have often been criticised, but I think their bloodlessness and vacancy are a strength rather than a weakness. That aside, Leonard Rossiter, Hardy Kruger and especially Leon Vitali give fine supporting performances, while the climatic duel scene is definitive and the narration from Michael Hordern is excellent. So all in all, actually an excellent film. 10/10 Bethany Cox"
    },
    {
      "username": "jamesrupert2014",
      "userUrl": "https://www.imdb.com/user/ur58781741",
      "reviewLink": "https://www.imdb.com/review/rw3868031",
      "warningSpoilers": false,
      "date": "26 November 2017",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Magnificent costume drama from a master director",
      "content": "\"Barry Lyndon\", William Makepeace Thackeray's tale of the rise and fall of young Irish ne'er-do-well Redmond Barry in late 18th century Europe is brought to the scene by legendary auteur Stanley Kubrick. The cinematography is outstanding as Kubrick was experimenting with a number of high-aperture lenses originally developed for NASA to allow filming in minimal light, allowing him to shoot candle-lighted interiors in ambient light. There are also extremely long-distance wide-angle shots of the English countryside and long-distance pull-back zoom shots. There was some criticism of Ryan O'Neil's limited range as an actor when tasked to play such a complicated and central character and the long film (184 min) moves at a very languid pace (ultimately, not a lot happens), but I found the story interesting and the character development superb. Overall, \"Barry Lyndon\" is a beautifully crafted 'costume drama' and if a bit of patience is required to see the story through, it is well rewarded."
    },
    {
      "username": "Boba_Fett1138",
      "userUrl": "https://www.imdb.com/user/ur1416505",
      "reviewLink": "https://www.imdb.com/review/rw1208009",
      "warningSpoilers": false,
      "date": "3 November 2005",
      "rate": "10",
      "helpful": "13 out of 19 found this helpful.",
      "title": "One of the most beautiful movies ever made.",
      "content": "This is certainly one of the most beautiful movies ever made. Beautiful is of course something totally different than saying 'this is the best movie ever made'. With beautiful I mean that the movie is superbly looking with flawless costumes and sets and impressive landscapes and camera-work. And please lets also not forget the beautiful and perfect use of classical music that was all rearranged by composer Leonard Rosenman, for which he also received an Oscar. Same goes for the flawless art-direction, cinematography and costume design. Truly all the Oscars that it at least deserved to get. \"Barry Lyndon\" is a long movie, like Kubrick movies often are. A lot is happening in the story but it never gets to much because the story is told in a slow way. Almost the entire life of the character Redmond Barry/Barry Lyndon is told in the movie. As a sort of Irish 18th century Forrest Gump he travels and sees Europe through the eyes of many different sides. It gives a great view and feel of the 18th century Europe and the British 'gentleman' culture in particular.There is some absolutely stunning dialog in the movie. It's this typical old fashioned English polite way of talking that is used in this movie. It was a real joy to listen to and it provided some highly entertaining and memorable moments at times. The lines are all perfectly delivered by the fine actors. It was also great to see Pat Roach in this movie. Pat Roach is known for playing almost every of the big thugs in all the Indiana Jones movies. It's funny, I didn't recognized him by his face or voice but I did by his style of fighting. He fought in the same manner as he later did in \"Raiders of the Lost Ark\" during the airplane fight.The story is told slowly and beautifully and is all beautiful narrated by Michael Hordern. You'll never be bored while watching this movie, I can guarantee that. There is simply too much happening in this movie to allow that.An absolutely beautiful movie that also is an absolute must see.10/10http://bobafett1138.blogspot.com/"
    },
    {
      "username": "the red duchess",
      "userUrl": "https://www.imdb.com/user/ur0805697",
      "reviewLink": "https://www.imdb.com/review/rw0140159",
      "warningSpoilers": true,
      "date": "17 August 2001",
      "rate": "10",
      "helpful": "34 out of 52 found this helpful.",
      "title": "A film worthy of the superlative superlatives - Kubrick's masterpiece, best film of the 1970s, one of the 20 best of all time...Etc. Etc. (spoilers)",
      "content": "Like the sustained cinematic fugue it is, 'Barry Lyndon''s opening scenes provide a theme that will be treated to increasingly virtuosic variations throughout. Barry's father is killed in a duel. Barry lives with his mother who refuses to remarry. Barry loses his virginity to a woman playing a role while playing cards. These are the great threads - Fathers, Duels, Mother, Sex, Women, The Unattainable, Masks, Games, Gambling - weaving into the web that will eventually trap Barry Lyndon, Fate like a spider picking him off sadistically limb by limb.'Barry' is structured around duels - the film begins and climaxes with one; key plot points centre around duels and 'organised' brawls. These duels are not just of the fencing/shooting type - they can be a stand-off in gambling; the deceptive games men and women play; the punishment meted out by fathers on stepsons, elder brothers on young half-brothers; a summons to redundancy; the phlegmatic defiance of a crippled cuckold; the attempt to hoodwink an officer. it doesn't even have to be negative - Barry's introduction to the chevalier begins with tacit antagonism, ends in a moving and genuine friendship. these duels are tests Barry must pass, traps he must avoid in his forward movement towards status and wealth.But this duality has more thematic resonance than that, signified in the name-change form Redmond Barry to Barry Lyndon. It is a conflict between the individual and society, between that individual's genuine self, if there is such a thing, and the masks he adopts to hide any defects that self might have. The moral significance of the duels change as Barry moves from being a passionate lover to a ruthless schemer. For all Thackeray's ironic wit, there is a moralising streak in his novel, not necessarily of the 'Don't rise above your station' variety, but suggesting the unhappiness waiting for anyone who will forsake their true character for glittering, but fake baubles.Kubrick takes this material and makes it his own, framing another story about a criminal outsider and a rigid, immovable social structure far more powerful than its individual constituents. Masks for Barry aren't necessarily a fragmentation of his identity, a degeneracy of his values. They are his way of beating the system, of infiltrating the fortress and destroying it from within. Far from becoming a monster, Barry is deliberately shown as both a debauchee and a loving father (the theme of fathers, from Barry's dead one, to his two benevolent father-figures; his replacing Bullingdon's father and his relationship with his own son, contrasted with the figures of mothers, is a powerful theme throughout) It is a cliche that Kubrick is a bleak misanthrope and 'Barry Lyndon' doesn't suggest otherwise, with its farcically horrifying vision of war, and the more lethal machinations of society. The film deliberately sets in conflict (another duel) two 'times', a historical time of war and Great Powers, linked to Barry's journey from fugitive to aristocrat, and a circular time, in which events simply repeat themselves, and nothing ever changes. This is the Age of Enlightenment, where 'progress' was the soundbite, the idea that the sum of human knowledge and hence the sum of human happiness could be improved.kubrick, bleakly, counters this - visualised in a film of staggering beauty, a successful attempt to fuse all the progressive art forms of the of the era (painting, theatre, sculpture, architecture, landscape gardening, music etc.) into a blinding whole - with scenes, especially the climactic duel with Bullingdon, suggestive of regression, primitivism, a reversion to tribalism (which, in effect, is what happens, a social order regrouping and expelling the outsider). The Church is now a henyard covered in straw, dark stage for a primitive rite, one that has been repeated throughout the film, denying all progress. the ritual, tribal drums make this overpoweringly apparent.Barry ends up back where he began: worse, with the loss of a leg. Decades on, nothing has changed for Lady Lyndon either, signing cheques for her new 'husband', her son. The last date we see is 1789, that famous date of Revolution in France, spiralling out everywhere else, but not here, and Kubrick implies, not really anywhere. the old cliche, 'Plus ca change...'Call me sentimental (or Irish) though, but in that final duel, when Barry refuses to kill his enemy, the light shining behind him through the narrow slits, the white doves flapping around him, suggest a religious interpretation, a suggestion that Barry may lose the world, but is somehow saved, redeemed: condemned to repetitious purgatory on earth, but beyond, who knows? Because this is Kubrick's second duality, his own, a miraculous balancing act between a film of pure abstraction, and a moving, funny, horrifying character study. Throughout Barry is made ridiculous, the dupe, the victim, and yet always retains our sympathy (largely through that heartbreakingly pained face) making even us atheists desire some salvation for him.The film's greatest scene - the gambling table, where Barry and Lady Lyndon stare at each other in the candlelight like clockwork figures forced into humanity, is a masterpiece of cinema translating minimalist acting into genius - Ryan O'Neal in this film gives one of the great performances thanks to Kubrick, worth a thousand of yer celebrated hams."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw5848136",
      "warningSpoilers": false,
      "date": "23 June 2020",
      "rate": "7",
      "helpful": "24 out of 39 found this helpful.",
      "title": "A Challenging Piece to Take Satisfaction From...",
      "content": "... no matter how many pistols or shots are fired. Poor old Barry manages to squander all he could ever have wished for but ultimately gets what he deserves, as does the audience, but only after an unsatisfying three hour wait."
    },
    {
      "username": "slokes",
      "userUrl": "https://www.imdb.com/user/ur2375356",
      "reviewLink": "https://www.imdb.com/review/rw1279910",
      "warningSpoilers": false,
      "date": "31 January 2006",
      "rate": "6",
      "helpful": "33 out of 55 found this helpful.",
      "title": "See The Pretty Pictures",
      "content": "The same things that make \"Barry Lyndon\" interesting are what make it problematic. Long drawn-out scenes, lingering close-ups of stiff-faced actors, no rooting interest, a sudden personality shift (for the worse) in the lead character, and minute attention to period detail that seems director Stanley Kubrick's main reason for making this.Kubrick shoots his 18th-century costume drama, based on the William Makepeace Thackeray novel, with nods in the direction not of other filmmakers but rather period painters like Gainsborough and Hogarth. His frame, often moving but slightly in the course of a scene, captures moments of wondrous, intense beauty which seem to defy gravity in their not-quite static state, such as a woman in her bath or a man riding across a country path. For that, it is a unique film, one that transfixes many still.Still, it's a hard film to love, at least for me, starting with the main character, a young Irishman named Redmond Barry (Ryan O'Neal) forced to flee his homeland after a duel who gets himself trapped in not one but two armies in the middle of the Seven Years' War. He escapes with a tricky gambler to Belgium where he meets Lady Lyndon (Marisa Berenson) who falls in love with him and offers him an opportunity to rise in the highest realms of society, if only he can control his mendacity and bitter temper.Not a lot to love there, and some say it's either O'Neal's fault or Kubrick's for casting him. O'Neal is in typically wooden form, but this is one film that serves such an acting style, as the cast here converses less in dialogues than colloquies while barely moving so much as an eyebrow so as not to disturb Kubrick's delicately candlelit interiors. O'Neal surprises on occasion, especially late in the film when he delivers a crying scene as powerful as Russell Crowe's in \"Gladiator.\" Once you get past his weak Irish accent, you may find him as good a man for the job here as anyone.There's also nice character work by Murray Melvin as the dour minister Mr. Runt, Leon Vitali as Lady Lyndon's son by a prior marriage, and Steven Berkoff, unrecognizable as the same man who menaced Eddie Murphy in \"Beverly Hills Cop\", as a foppish dandy who trifles with Barry to his regret. Patrick Magee, often over-the-top on screen, nicely underplays his part of the gambler, Barry's tutor for a time. Kubrick's work with the child actors here showcases his exceptional, undercommented work in that department.This is one Kubrick film where there is little overacting. It's hard to overact when you can't even move. Kubrick is so bent on making with his pretty pictures that any droplets of vitality dribble off the screen. Audience identification, too, is hard, except I think some of the charm of this film is in how alien it is, presenting a world we think we know in an askew but somehow more real-seeming way than ever before.It's a triumph in \"Barry Lyndon\" how fine and layered a visual scheme Kubrick is able to put on screen, and the story, especially in its first half when Barry is on the rise, has its compelling moments. A mordant narration by Michael Hordern that carries on for the length of the film seems intrusive at first but gradually turns out a rather sublime counterpoint to the action on screen. You come to need Hordern after a while. At a little over three hours, one feels like one is sitting through Barry's wastrel life in real time. Some may see that as an accomplishment, but you can only stare so long at a painting, even a masterpiece, before yawning sets in. It sets in more quickly here."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1414443",
      "warningSpoilers": false,
      "date": "8 July 2006",
      "rate": "3",
      "helpful": "131 out of 289 found this helpful.",
      "title": "Gee,...I feel like such an unsophisticated boob!",
      "content": "This is a movie that is often hailed as a masterpiece because of its godlike director, Stanley Kubrick. And I know I'm going to get some serious negative reactions out there, but I really didn't like this movie at all and think it's one of the most overrated films of the 1970s.This is a costume drama that looks very pretty on the surface, but down deep it lacks a soul and any trace of warmth or humanity. Ryan O'Neil is inexplicably chosen to play the title character, though why this American was chosen I have no idea--particularly since, at times, he appeared to be half asleep during the film. This movie is just dreadfully dull and uninteresting.I seriously wonder what would have happened if a lesser-known or obscure director had made this film. I'm sure it wouldn't have received all the kudos and people might have recognized that it was a poor film.After noting all the \"not helpful\" scores given to the other reviewers who panned this movie on IMDb, I guess I'll just sit back and wait for them to start pouring my way!"
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0140129",
      "warningSpoilers": false,
      "date": "13 February 2000",
      "rate": "10",
      "helpful": "15 out of 27 found this helpful.",
      "title": "an excellent, rewarding on multiple viewings kind of masterwork",
      "content": "Stanley Kubrick's Barry Lyndon was a film that upon first experience was a little sluggish, and compared to the bizarre nature of many of his other masterpieces (Clockwork Orange, Dr. Strangelove, the Shining) is lacking. But this was years ago, when I perhaps didn't quite have the patience and attention to underlying emotions the film asks. Upon a few more viewings up until now, I find that this really is a remarkable, deliberately paced film about a man trying to find the cues and the ways into this upper class world. This man, played convincingly by Ryan O'Neil, is like the total con-man in the guise of the perfect gentleman (in a sense, of course less violently and less ambitious, the character has a little in common with Alex from Clockwork Orange). Aside from the characterizations, which do become richer in multiple viewings, the compositions are truly unique, and ask of a viewer more than most can handle. Barry Lyndon is the kind of film that, if nothing else, shows that Kubrick wasn't only this madman director of these satires and totally visual experiences (which he was terrific at), but also could do a tender, expressive, and period-perfect film about a world that most of us know from looking at paintings in museums, which is precisely what Kubrick was going for. Deservedly winning of four academy awards (unfortunately not for Kubrick), it also boasts a fine soundtrack of classic works of music."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw2926317",
      "warningSpoilers": false,
      "date": "21 December 2013",
      "rate": "7",
      "helpful": "10 out of 17 found this helpful.",
      "title": "Irish social climber",
      "content": "Acclaimed by many as Stanley Kubrick's finest, I think Barry Lyndon is a good film that misses being a great one due to some truly bad casting. I can only imagine such folks as Peter O'Toole, Richard Harris, and Albert Finney were off doing other projects that Ryan O'Neal was selected for the title role. Try as he might O'Neal is just way too American to fit the part of an 18th century Irishman who wishes to rise in society and not care how he does it.I have to say that Kubrick's recreation of the 18th century in both its look and mores is nothing short of magnificent. Small wonder that Barry Lyndon won Oscars for Costume Design, Best Music Score, Cinematography and Art&Set Design. The technical aspect he nailed down beautifully.As for O'Neal in 18th century Ireland and assuming he's a Protestant there are still limited means of opportunity. Seduced by Gay Hamilton his first love, she abandons him for marriage to a wealthy British officer. And when O'Neal refuses to leave she and her family play a very interesting trick which I won't reveal to force him to leave.After time in both the British and Prussian armies during the Seven Years War and some lucrative years at the gaming tables, O'Neal has his turn at seduction when he beds Marisa Berenson while she's still married to the titled Frank Middlemass. Then he dies and O'Neal weds her and her money, but earns the undying enmity of her son Leon Vitali. That in fact seals his fate.O'Neal and Berenson do have a child of their own and seeing the scenes between O'Neal and his own son made me think that Thackerey's treatment of the father/son relationship was the model for what Margaret Mitchell did with Rhett Butler and Bonnie Blue Butler in Gone With The Wind.Kubrick opted for a full treatment of Thackerey's novel just as David O. Selznick did with Gone With The Wind. Unfortunately Ryan O'Neal just did not fit the title role as Clark Gable did with Rhett Butler."
    },
    {
      "username": "JoeKulik",
      "userUrl": "https://www.imdb.com/user/ur58945063",
      "reviewLink": "https://www.imdb.com/review/rw3294021",
      "warningSpoilers": true,
      "date": "9 August 2015",
      "rate": "4",
      "helpful": "40 out of 66 found this helpful.",
      "title": "Main Characters Give Us A Mannequin Act !!!",
      "content": "Stanley Kubrick's screenplay adaptation and direction of Thackeray's Barry Lyndon (1975) is VERY POOR, in my opinion.The two main characters, Barry Lyndon and Lady Lyndon are portrayed as deadpan through the whole film. This is particularly weird for the Barry character since his life story, the topic of the film, undergoes great transformations from start to finish. Yet, Ryan O'Neal, as Barry, looks like a lifeless, emotionless mannequin just reciting his script lines for almost the entire film. Marissa Berenson, as Lady Lyndon, is also a lifeless, emotionless mannequin just reciting script lines, although she is portrayed as being seduced by Barry while still being married to her elderly husband, although the narrator says that she falls in love with Barry before her husband suddenly dies, and although Barry is blowing her fortune and openly cheating in front of her after their marriage. It is true that the film is set in 18th Century England, when we would expect \"propriety and decorum\" to dominate more than today, but the flat, emotionless portrayal of the two main characters in such a tumultuous storyline is just unreal and just indicates a VERY POOR directing job by Stanley Kubrick.I was even more amazed when I read a Wikipedia summary of William Thackeray's The Luck Of Barry Lyndon (1844). In the original novel, Thackeray definitely sets up Barry Lyndon as a hot tempered young man at the start of the novel, using this as his motivation for his duel over his cousin Nora. In the novel, Barry is not the victim of highway robbers, but makes it all the way to Dublin, where he immediately begins hanging around with low lifes and accrues so much gambling debt that he joins the British Army just to escape. Wiki says Barry seduces and bullies Lady Lyndon into marrying him. The novel not only has Barry's stepson Lord Bullington join the British Army to fight in the American Revolution, but has Barry plotting long distance to have Lord Bullington deliberately killed in battle in America.Although I'm the first to say that an auteur should have the creative freedom to revise a screen adaptation of a novel however much he wants, it is VERY STRANGE to me that Kubrick BOTH revised the storyline of the original novel and focused his direction of the main characters in a way that turned his main characters into such lifeless, emotionless, script reciting mannequins. What kills me is that Wiki's plot summary of the novel reveals Barry Lyndon to be a truly colorful and adventuresome guy, a character who already would be a wonderful film character. So what the hell was Kubrick thinking here?? I don't know, but he FAILED BADLY as far as I'm concerned.The elaborate and obviously expensive costumes, period settings, and period accessories such as the horse drawn coaches in this film make it even more puzzling to me what Kubrick was thinking in his production of this film, that is, if he was thinking at all. In any case, elaborate and obviously expensive costumes, period settings, and period accessories do not compensate for a POOR screen adaptation of a novel, and for POOR direction, and that's all I can see in Kubrick's Barry Lyndon (1972).Anyone who thinks that this is a great film must first start with the assumption that Kubrick is a great filmmaker and then work his way backward from that assumption to justify the \"greatness\" of this film. I just don't see it any other way."
    },
    {
      "username": "baileycrawly",
      "userUrl": "https://www.imdb.com/user/ur61096584",
      "reviewLink": "https://www.imdb.com/review/rw6340490",
      "warningSpoilers": false,
      "date": "5 December 2020",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Carefully Crafted Masterpiece",
      "content": "Barry Lyndon is a special film. Stanley Kubrick has carefully and lovingly crafted a brilliant tale, utilizing the brilliant technique of featuring almost exclusively natural lighting for authenticity. Through his ingenious story-telling abilities, Kubrick has crafted a film that just passes over the 3 hour runtime, but never once drags or drones. Every second of screen time matters and is accounted for. The character-building is second to none, giving the audience a cast of characters they can easily care about and find a connection with, which makes the more emotional moments resonate so much more deeply. The costuming on this film is top notch, the cinematography is gorgeous (this may very well be the most beautiful Kubrick film to look at, and that's including his magnum opus, 2001: A Space Odyssey). It's crafted to Kubrickian proportions, with a fantastic score to compliment the visuals, some incredible action scenes and some of the tensest drama that I've seen on screen in a while. To promote the digital version of this film, Warner Bros. proudly declares that this is \"One of the most beautiful films ever made,\" and it's easy to dismiss such claims as being (obviously) hastily written pleasantries designed to sell more copies of the film, but there's some serious merit behind the claim they make about this film. It's not common for me to invest so heavily in such a long film, but Kubrick grabbed me in and didn't let me go, and from start to finish every single note in this film hit exactly the way Kubrick intended it to. Another masterpiece from the master, and without question my favorite of the Kubrick films I've seen (which is about half)."
    },
    {
      "username": "funkyfry",
      "userUrl": "https://www.imdb.com/user/ur0178741",
      "reviewLink": "https://www.imdb.com/review/rw0140203",
      "warningSpoilers": false,
      "date": "15 February 2003",
      "rate": "10",
      "helpful": "9 out of 14 found this helpful.",
      "title": "Classic costume epic may be Kubrick's masterpeice",
      "content": "Kubrick at his very best, in a ponderous film about a less than heroic main character, Lyndon, who lets no human values get in the way of his quest for power and wealth. The film doesn't let us simply dismiss the often unpleasant (to say the least) Barry, however, forcing us to sympathize with his dreams and the sadly human means he uses to find his personal immortality through the acquisition of titled nobility for himself and his progeny. Kubrick almost lets his glorious picture of the period overpower the characters, but it is plausible that this was his goal. A very adult period peice that blows away all Hollywood epics before and since, and pointed the way for James Ivory's superior efforts along the same lines."
    }
  ],
  "errorMessage": ""
}