{
  "imDbId": "tt0072684",
  "title": "Barry Lyndon",
  "fullTitle": "Barry Lyndon (1975)",
  "type": "Movie",
  "year": "1975",
  "language": "en",
  "titleInLanguage": "Barry Lyndon",
  "url": "https://en.wikipedia.org/wiki/Barry_Lyndon",
  "plotShort": {
    "plainText": "Barry Lyndon is a 1975 period drama film written, directed, and produced by Stanley Kubrick, based on the 1844 novel The Luck of Barry Lyndon by William Makepeace Thackeray. Starring Ryan O'Neal, Marisa Berenson, Patrick Magee, Leonard Rossiter, and Hardy Krüger, the film recounts the early exploits and later unravelling of an 18th-century Anglo-Irish rogue and golddigger who marries a rich widow to climb the social ladder and assume her late husband's aristocratic position.\r\nKubrick began production on Barry Lyndon after his 1971 film A Clockwork Orange. He had originally intended to direct a biopic on Napoleon, but lost his financing because of the commercial failure of the similar 1970 Dino De Laurentiis-produced Waterloo. Kubrick eventually directed Barry Lyndon, set partially during the Seven Years' War, utilising his research from the Napoleon project. Filming began in December 1973 and lasted roughly eight months, taking place in England, Ireland, East Germany, and West Germany.\r\nThe film's cinematography has been described as ground-breaking. Especially notable are the long double shots, usually ended with a slow backwards zoom, the scenes shot entirely in candlelight, and the settings based on William Hogarth paintings. The exteriors were filmed on location in Ireland, England and West Germany, with the interiors shot mainly in London. The production had problems related to logistics, weather, and politics (Kubrick feared that he might be an IRA hostage target).\r\nBarry Lyndon won four Oscars at the 48th Academy Awards: Best Scoring: Original Song Score and Adaptation or Scoring: Adaptation, Best Costume Design, Best Art Direction, and Best Cinematography. Although some critics took issue with the film's slow pace and restrained emotion, its reputation, like that of many of Kubrick's works, has grown over time. In the 2012 Sight & Sound Greatest Films of All Time poll, Barry Lyndon placed 19th in the directors' poll and 59th in the critics' poll.",
    "html": "<p>Barry Lyndon is a 1975 period drama film written, directed, and produced by Stanley Kubrick, based on the 1844 novel The Luck of Barry Lyndon by William Makepeace Thackeray. Starring Ryan O'Neal, Marisa Berenson, Patrick Magee, Leonard Rossiter, and Hardy Krüger, the film recounts the early exploits and later unravelling of an 18th-century Anglo-Irish rogue and golddigger who marries a rich widow to climb the social ladder and assume her late husband's aristocratic position.</p><p>Kubrick began production on Barry Lyndon after his 1971 film A Clockwork Orange. He had originally intended to direct a biopic on Napoleon, but lost his financing because of the commercial failure of the similar 1970 Dino De Laurentiis-produced Waterloo. Kubrick eventually directed Barry Lyndon, set partially during the Seven Years' War, utilising his research from the Napoleon project. Filming began in December 1973 and lasted roughly eight months, taking place in England, Ireland, East Germany, and West Germany.</p><p>The film's cinematography has been described as ground-breaking. Especially notable are the long double shots, usually ended with a slow backwards zoom, the scenes shot entirely in candlelight, and the settings based on William Hogarth paintings. The exteriors were filmed on location in Ireland, England and West Germany, with the interiors shot mainly in London. The production had problems related to logistics, weather, and politics (Kubrick feared that he might be an IRA hostage target).</p><p>Barry Lyndon won four Oscars at the 48th Academy Awards: Best Scoring: Original Song Score and Adaptation or Scoring: Adaptation, Best Costume Design, Best Art Direction, and Best Cinematography. Although some critics took issue with the film's slow pace and restrained emotion, its reputation, like that of many of Kubrick's works, has grown over time. In the 2012 Sight & Sound Greatest Films of All Time poll, Barry Lyndon placed 19th in the directors' poll and 59th in the critics' poll.</p>"
  },
  "plotFull": {
    "plainText": "Barry Lyndon is a 1975 period drama film written, directed, and produced by Stanley Kubrick, based on the 1844 novel The Luck of Barry Lyndon by William Makepeace Thackeray. Starring Ryan O'Neal, Marisa Berenson, Patrick Magee, Leonard Rossiter, and Hardy Krüger, the film recounts the early exploits and later unravelling of an 18th-century Anglo-Irish rogue and golddigger who marries a rich widow to climb the social ladder and assume her late husband's aristocratic position.\r\nKubrick began production on Barry Lyndon after his 1971 film A Clockwork Orange. He had originally intended to direct a biopic on Napoleon, but lost his financing because of the commercial failure of the similar 1970 Dino De Laurentiis-produced Waterloo. Kubrick eventually directed Barry Lyndon, set partially during the Seven Years' War, utilising his research from the Napoleon project. Filming began in December 1973 and lasted roughly eight months, taking place in England, Ireland, East Germany, and West Germany.\r\nThe film's cinematography has been described as ground-breaking. Especially notable are the long double shots, usually ended with a slow backwards zoom, the scenes shot entirely in candlelight, and the settings based on William Hogarth paintings. The exteriors were filmed on location in Ireland, England and West Germany, with the interiors shot mainly in London. The production had problems related to logistics, weather, and politics (Kubrick feared that he might be an IRA hostage target).\r\nBarry Lyndon won four Oscars at the 48th Academy Awards: Best Scoring: Original Song Score and Adaptation or Scoring: Adaptation, Best Costume Design, Best Art Direction, and Best Cinematography. Although some critics took issue with the film's slow pace and restrained emotion, its reputation, like that of many of Kubrick's works, has grown over time. In the 2012 Sight & Sound Greatest Films of All Time poll, Barry Lyndon placed 19th in the directors' poll and 59th in the critics' poll.\r\nPlot\r\nPart I: By What Means Redmond Barry Acquired the Style and Title of Barry Lyndon\r\nAn omniscient (though possibly unreliable) narrator relates that in 1750s Ireland, Redmond Barry's father is killed in a duel over a sale of some horses. The widow devotes herself to her only son. Barry becomes infatuated with his older cousin, Nora Brady. Nora and her family plan to improve their finances through marriage to a well-off British Army captain, John Quin. Barry shoots Quin in a duel, then flees. He is robbed by highwayman Captain Feeney. Penniless and dejected, Barry joins the British Army. Later, family friend Captain Grogan informs him that his dueling pistol had been loaded with tow, and Quin is not dead: the duel was staged by Nora's family to get rid of Barry.\r\nBarry's regiment fights in Germany in the Seven Years' War. Grogan is fatally wounded in a skirmish. Fed up with the war, Barry deserts. En route to neutral Holland, he encounters Frau Lieschen. The two briefly become lovers. Later, Barry encounters Prussian Captain Potzdorf, who, seeing through his disguise, offers him the choice of being handed over to the British to be shot or enlisting in the Prussian Army. Barry enlists and later receives a special commendation from Frederick the Great for saving Potzdorf's life in a battle.\r\nTwo years later, after the war ends in 1763, Barry is employed by Captain Potzdorf's uncle in the Prussian Ministry of Police. The Prussians suspect the Chevalier de Balibari, a professional gambler, of spying for the Austrians, and have Barry become his servant. Barry reveals everything to the Chevalier, a fellow Irishman. They become confederates. After they cheat the Prince of Tübingen at cards, the Prince accuses the Chevalier of cheating and demands satisfaction. Barry's Prussian handlers, still suspecting that the Chevalier is a spy, arrange for the Chevalier to be expelled from the country. Alerted by Barry, the Chevalier flees in the night. The next morning, Barry, disguised as the Chevalier, is escorted from Prussia.\r\nOver the next few years, Barry and the Chevalier travel across Europe, perpetrating gambling scams, with Barry forcing payment from reluctant debtors with sword duels. In Spa, he encounters the beautiful and wealthy Countess of Lyndon. He seduces and later marries her after the death of her elderly husband, Sir Charles Lyndon (caused by Barry's goading and verbal repartee).\r\nPart II: Containing an Account of the Misfortunes and Disasters Which Befell Barry Lyndon\r\nIn 1773, Barry takes the Countess's last name and settles in England. Lord Bullingdon, Lady Lyndon's ten-year-old son by Sir Charles, quickly comes to despise Barry. Barry retaliates by physically abusing Bullingdon. The Countess bears Barry a son, Bryan Patrick, but the marriage is unhappy: Barry is openly unfaithful and enjoys spending his wife's money, while keeping her in seclusion.\r\nBarry's mother comes to live with him. She warns him that if Lady Lyndon were to die, Lord Bullingdon would inherit everything, and advises him to obtain a noble title to protect himself. Toward this goal, he cultivates the acquaintance of the influential Lord Wendover and spends large sums of money to ingratiate himself to high society. However, Lord Bullingdon, now a young adult, crashes a lavish birthday party Barry throws for Lady Lyndon. He publicly explains why he detests his stepfather and declares he will leave the family estate for as long as Barry remains there and married to his mother. Barry viciously assaults Bullingdon until he is physically restrained. This causes him to be cast out of polite society.\r\nBarry proves an overindulgent father to Bryan and gives him a full-grown horse for his ninth birthday. Bryan is thrown from the horse and dies a few days later. The grief-stricken Barry turns to alcohol, while Lady Lyndon seeks solace in religion, assisted by the Rev. Samuel Runt, who had been tutor to Lord Bullingdon and Bryan. Barry's mother dismisses Runt, both because the family no longer needs (nor can afford, due to Barry's spending debts) a tutor and for fear that his influence will worsen Lady Lyndon's condition. Lady Lyndon later attempts suicide. Runt and Graham, the family's accountant, then seek out Lord Bullingdon, who returns and challenges Barry to a duel.\r\nA coin toss gives Bullingdon the first shot, but he nervously misfires his pistol. Barry magnanimously fires into the ground, but Bullingdon refuses to let the duel end. In the second round, Bullingdon shoots Barry in the leg. The leg has to be amputated below the knee. While Barry is recovering, Bullingdon takes control of the Lyndon estate. He offers Barry 500 guineas a year provided he leave England forever. With his credit exhausted, Barry accepts. The narrator states that Barry resumes his former profession of gambler (though without his former success). In December 1789, a middle-aged Lady Lyndon signs Barry's annuity cheque as her son looks on.\r\nCast\r\nMichael Hordern (voice) as Narrator\r\nRyan O'Neal as Redmond Barry (later Redmond Barry Lyndon)\r\nMarisa Berenson as Lady Lyndon\r\nPatrick Magee as the Chevalier de Balibari\r\nHardy Krüger as Captain Potzdorf\r\nGay Hamilton as Nora Brady\r\nGodfrey Quigley as Captain Grogan\r\nSteven Berkoff as Lord Ludd\r\nMarie Kean as Belle, Barry's mother\r\nMurray Melvin as Reverend Samuel Runt\r\nFrank Middlemass as Sir Charles Reginald Lyndon\r\nLeon Vitali as Lord Bullingdon Dominic Savage as young Bullingdon\r\nDominic Savage as young Bullingdon\r\nLeonard Rossiter as Captain John Quin\r\nAndré Morell as Lord Wendover\r\nAnthony Sharp as Lord Hallam\r\nPhilip Stone as Graham\r\nDavid Morley as Bryan Patrick Lyndon\r\nDiana Koerner as Lieschen (German Girl)\r\nArthur O'Sullivan as Captain Feeney\r\nBilly Boyle as Seamus Feeney\r\nJonathan Cecil as Lt. Jonathan Fakenham\r\nPeter Cellier as Sir Richard Brevis\r\nGeoffrey Chater as Dr Broughton\r\nWolf Kahler as Prince of Tübingen\r\nLiam Redmond as Mr Brady\r\nRoger Booth as King George III\r\nFerdy Mayne as Colonel Bulow\r\nJohn Sharp as Doohan\r\nPat Roach as Corporal Toole\r\nHans Meyer as Schulffen\r\nCritic Tim Robey suggests that the film \"makes you realise that the most undervalued aspect of Kubrick's genius could well be his way with actors.\" He adds that the supporting cast is a \"glittering procession of cameos, not from star names but from vital character players.\"\r\nThe cast featured Leon Vitali as the older Lord Bullingdon, who then became Kubrick's personal assistant, working as the casting director on his following films, and supervising film-to-video transfers for Kubrick. Their relationship lasted until Kubrick's death. The film's cinematographer, John Alcott, appears at the men's club in the non-speaking role of the man asleep in a chair near the title character when Lord Bullingdon challenges Barry to a duel. Kubrick's daughter Vivian also appears (in an uncredited role) as a guest at Bryan's birthday party.\r\nOther Kubrick featured regulars were Leonard Rossiter (2001: A Space Odyssey), Steven Berkoff, Patrick Magee, Godfrey Quigley, Anthony Sharp, and Philip Stone (A Clockwork Orange). Stone went on to feature in The Shining.\r\nProduction\r\nDevelopment\r\nAfter completing post production on 2001: A Space Odyssey, Kubrick resumed planning a film about Napoleon. During pre-production, Sergei Bondarchuk and Dino De Laurentiis' Waterloo was released, and failed at the box office. Reconsidering, Kubrick's financiers pulled funding, and he turned his attention towards an adaptation of Anthony Burgess's 1962 novel A Clockwork Orange. Subsequently, Kubrick showed an interest in Thackeray's Vanity Fair but dropped the project when a serialised version for television was produced. He told an interviewer, \"At one time, Vanity Fair interested me as a possible film but, in the end, I decided the story could not be successfully compressed into the relatively short time-span of a feature film ... as soon as I read Barry Lyndon I became very excited about it.\"\r\nHaving earned Oscar nominations for Dr. Strangelove, 2001: A Space Odyssey and A Clockwork Orange, Kubrick's reputation in the early 1970s was that of \"a perfectionist auteur who loomed larger over his movies than any concept or star\". His studio—Warner Bros.—was therefore \"eager to bankroll\" his next project, which Kubrick kept \"shrouded in secrecy\" from the press partly due to the furore surrounding the controversially violent A Clockwork Orange (particularly in the UK) and partly due to his \"long-standing paranoia about the tabloid press.\" Kubrick was initially rumored to be developing an adaptation of Arthur Schnitzler's 1926 novell Dream Story, which would serve as the source material for his later film Eyes Wide Shut (1999).\r\nHaving felt compelled to set aside his plans for a film about Napoleon Bonaparte, in 1972 Kubrick set his sights on Thackeray's 1844 \"satirical picaresque about the fortune-hunting of an Irish rogue,\" Barry Lyndon, the setting of which allowed Kubrick to take advantage of the copious period research he had done for the now-aborted Napoleon. At the time, Kubrick merely announced that his next film would star Ryan O'Neal (deemed \"a seemingly un-Kubricky choice of leading man\") and Marisa Berenson, a former Vogue and Time magazine cover model, and be shot largely in Ireland. So heightened was the secrecy surrounding the film that \"Even Berenson, when Kubrick first approached her, was told only that it was to be an 18th-century costume piece she was instructed to keep out of the sun in the months before production, to achieve the period-specific pallor he required.\"\r\nPrincipal photography\r\nPrincipal photography lasted 300 days, from spring 1973 through to early 1974, with a break for Christmas. Kubrick initially wished to film the entire production near his home in Borehamwood, but Ken Adam convinced him to relocate the shoot to Ireland. The crew arrived in Dublin, Ireland in May 1973. Jan Harlan recalls that Kubrick \"loved his time in Ireland – he rented a lovely house west of Dublin, he loved the scenery and the culture and the people\".\r\nMany of the exteriors were shot in Ireland, playing \"itself, England, and Prussia during the Seven Years' War.\" Kubrick and cinematographer Alcott drew inspiration from \"the landscapes of Watteau and Gainsborough,\" and also relied on the art direction of Ken Adam and Roy Walker. Alcott, Adam and Walker were among those who would win Oscars for their work on the film.\r\nSeveral of the interior scenes were filmed in Powerscourt House, an 18th-century mansion in County Wicklow, Republic of Ireland. The house was destroyed in an accidental fire several months after filming (November 1974), so the film serves as a record of the lost interiors, particularly the \"Saloon\" which was used for more than one scene. The Wicklow Mountains are visible, for example, through the window of the saloon during a scene set in Berlin. Other locations included Kells Priory (the English Redcoat encampment) Blenheim Palace, Castle Howard (exteriors of the Lyndon estate), Huntington Castle, Clonegal (exterior), Corsham Court (various interiors and the music room scene), Petworth House (chapel), Stourhead (lake and temple), Longleat, and Wilton House (interior and exterior) in England, Lavenham Guildhall at Lavenham in Suffolk (amputation scene), Dunrobin Castle (exterior and garden as Spa) in Scotland, Dublin Castle in Ireland (the chevalier's home), Ludwigsburg Palace near Stuttgart and Frederick II of Prussia's Neues Palais at Potsdam near Berlin (suggesting Berlin's main street Unter den Linden as construction in Potsdam had just begun in 1763). Some exterior shots were also filmed at Waterford Castle (now a luxury hotel and golf course) and Little Island, Waterford. Moorstown Castle in Tipperary also featured. Several scenes were filmed at Castletown House outside Carrick-on-Suir, Co. Tipperary, and at Youghal, Co. Cork.\r\nThe filming took place in the backdrop of some of the most intense years of the Troubles in Ireland, during which the Provisional Irish Republican Army (Provisional IRA) was waging an armed campaign in order to bring about a United Ireland. On 30 January 1974, while filming in Dublin City's Phoenix Park, shooting had to be cancelled due to the chaos caused by 14 bomb threats. One day a phone call was received and Kubrick was given 24 hours to leave the country; he left within 12 hours. The phone call alleged that the Provisional IRA had him on a hit list and Harlan recalls \"Whether the threat was a hoax or it was real, almost doesn't matter ... Stanley was not willing to take the risk. He was threatened, and he packed his bag and went home\" Production of the film was one-third completed when this occurred, and it was rumored that the film would be abandoned. Nonetheless, Kubrick continued shooting the remaining two-thirds of the film at locations in southern England and West Germany. Locations in England included the Wilton House in Salisbury, Corsham Court, Stourhead House, Castle Howard, and Glastonbury.\r\nCinematography\r\nThe film, as with \"almost every Kubrick film\", is a \"showcase for major innovation in technique.\" While 2001: A Space Odyssey had featured \"revolutionary effects,\" and The Shining would later feature heavy use of the Steadicam, Barry Lyndon saw a considerable number of sequences shot \"without recourse to electric light.\" The film's cinematography was overseen by director of photography John Alcott (who won an Oscar for his work), and is particularly noted for the technical innovations that made some of its most spectacular images possible. To achieve photography without electric lighting \"or the many densely furnished interior scenes… meant shooting by candlelight,\" which is known to be difficult in still photography, \"let alone with moving images.\"\r\nKubrick was \"determined not to reproduce the set-bound, artificially lit look of other costume dramas from that time.\" After \"tinker with different combinations of lenses and film stock,\" the production obtained three super-fast 50mm lenses (Carl Zeiss Planar 50mm f/0.7) developed by Zeiss for use by NASA in the Apollo Moon landings, which Kubrick had discovered. These super-fast lenses \"with their huge aperture (the film actually features the lowest f-stop in film history) and fixed focal length\" were problematic to mount, and were extensively modified into three versions by Cinema Products Corp. for Kubrick to gain a wider angle of view, with input from optics expert Richard Vetter of Todd-AO. The rear element of the lens had to be 2.5 mm away from the film plane, requiring special modification to the rotating camera shutter. This allowed Kubrick and Alcott to shoot scenes lit in candlelight to an average lighting volume of only three candela, \"recreating the huddle and glow of a pre-electrical age.\" In addition, Kubrick had the entire film push-developed by one stop.\r\nAlthough Kubrick and Alcott sought to avoid electric lighting where possible, most shots were achieved with conventional lenses and lighting, but were lit to deliberately mimic natural light rather than for compositional reasons. In addition to potentially seeming more realistic, these methods also gave a particular period look to the film which has often been likened to 18th-century paintings (which of course depict a world devoid of electric lighting), in particular owing \"a lot to William Hogarth, with whom Thackeray had always been fascinated.\"\r\nThe film is widely regarded as having a stately, static, painterly quality, mostly due to its lengthy, wide-angle long shots. To illuminate the more notable interior scenes, artificial lights called \"Mini-Brutes\" were placed outside and aimed through the windows, which were covered in a diffuse material to scatter the light evenly through the room rather than being placed inside for maximum use as most conventional films do. In some instances, the natural daylight was allowed to come through, which when recorded on the film stock used by Kubrick showed up as blue-tinted compared to the incandescent electric light.\r\nDespite such slight tinting effects, this method of lighting not only gave the look of natural daylight coming in through the windows, but it also protected the historic locations from the damage caused by mounting the lights on walls or ceilings and the heat from the lights. This helped the film \"fit… perfectly with Kubrick's gilded-cage aesthetic – the film is consciously a museum piece, its characters pinned to the frame like butterflies.\"\r\nMusic\r\nThe film's period setting allowed Kubrick to indulge his penchant for classical music, and the film score uses pieces by Bach, Vivaldi, Paisiello, Mozart, and Schubert. The piece most associated with the film, however, is the main title music, Handel's Sarabande from the Keyboard suite in D minor (HWV 437). Originally for solo harpsichord, the versions for the main and end titles are performed with strings, timpani and continuo. The score also includes Irish folk music, including Seán Ó Riada's song \"Women of Ireland\", arranged by Paddy Moloney and performed by The Chieftains. \"The British Grenadiers\" also features in scenes with Redcoats marching.\r\nCharts\r\nCertifications\r\nBox office and reception\r\nContemporaneous\r\nThe film \"was not the commercial success Warner Bros. had been hoping for\" within the United States, although it fared better in Europe. In the US it earned $9.1 million. Ultimately, the film grossed a worldwide total of $31.5 million on an $11 million budget.\r\nThis mixed reaction saw the film (in the words of one retrospective review) \"greeted, on its release, with dutiful admiration – but not love. Critics… rail against the perceived coldness of Kubrick's style, the film's self-conscious artistry and slow pace. Audiences, on the whole, rather agreed…\"\r\nRoger Ebert gave the film three and a half stars out of four and wrote that it \"is almost aggressive in its cool detachment. It defies us to care, it forces us to remain detached about its stately elegance.\" He added, \"This must be one of the most beautiful films ever made.\" Vincent Canby of The New York Times called the film \"another fascinating challenge from one of our most remarkable, independent-minded directors.\" Gene Siskel of the Chicago Tribune gave the film three and a half stars out of four and wrote \"I found 'Barry Lyndon' to be quite obvious about its intentions and thoroughly successful in achieving them. Kubrick has taken a novel about a social class and has turned it into an utterly comfortable story that conveys the stunning emptiness of upper-class life only 200 years past.\" He ranked the film fifth on his year-end list of the best films of 1975. Charles Champlin of the Los Angeles Times called it \"the motion picture equivalent of one of those very large, very heavy, very expensive, very elegant and very dull books that exist solely to be seen on coffee tables. It is ravishingly beautiful and incredibly tedious in about equal doses, a succession of salon quality still photographs—as often as not very still indeed.\" The Washington Post wrote, \"It's not inaccurate to describe 'Barry Lyndon' as a masterpiece, but it's a deadend masterpiece, an objet d'art rather than a movie. It would be more at home, and perhaps easier to like, on the bookshelf, next to something like 'The Age of the Grand Tour,' than on the silver screen.\" Pauline Kael of The New Yorker wrote that \"Kubrick has taken a quick-witted story\" and \"controlled it so meticulously that he's drained the blood out of it,\" adding, \"It's a coffee-table movie; we might as well be at a three-hour slide show for art-history majors.\"\r\nThis \"air of disappointment\" factored into Kubrick's decision for his next film, an adaption of Stephen King's The Shining, a project that would not only please him artistically, but was more likely to succeed financially.\r\nRe-evaluation\r\nOver time, the film has gained a more positive reaction. On review aggregator Rotten Tomatoes, the film holds an approval rating of 89% based on 79 reviews, with an average rating of 8.30/10. The website's critical consensus reads, \"Cynical, ironic, and suffused with seductive natural lighting, Barry Lyndon is a complex character piece of a hapless man doomed by Georgian society.\" On Metacritic, the film has a weighted average score of 89 out of 100 based on reviews from 21 critics, indicating \"universal acclaim\". Roger Ebert added the film to his 'Great Movies' list on 9 September 2009 and increased his original rating from three and a half stars to four, writing, \"Stanley Kubrick's Barry Lyndon, received indifferently in 1975, has grown in stature in the years since and is now widely regarded as one of the master's best. It is certainly in every frame a Kubrick film: technically awesome, emotionally distant, remorseless in its doubt of human goodness.\"\r\nThe Village Voice ranked the film at number 46 in its Top 250 \"Best Films of the Century\" list in 1999, based on a poll of critics. Director Martin Scorsese has named Barry Lyndon as his favourite Kubrick film, and it is also one of Lars von Trier's favourite films. Barry Lyndon was included on Time's All-Time 100 best movies list. In the 2012 Sight & Sound Greatest Films of All Time poll, Barry Lyndon placed 19th in the directors' poll and 59th in the critics' poll. The film ranked 27th in BBC's 2015 list of the 100 greatest American films.\r\nIn a list compiled by The Irish Times critics Tara Brady and Donald Clarke in 2020, Barry Lyndon was named the greatest Irish film of all time.\r\nThe Japanese filmmaker Akira Kurosawa cited this movie as one of his 100 favorite films.\r\nAwards and nominations\r\nCinematic analysis\r\nThe main theme explored in Barry Lyndon is one of fate and destiny. Barry is pushed through life by a series of key events, some of which seem unavoidable. As Roger Ebert says, \"He is a man to whom things happen.\" He declines to eat with the highwayman Captain Feeney, where he would most likely have been robbed, but is robbed anyway farther down the road. The narrator repeatedly emphasizes the role of fate as he announces events before they unfold on screen, like Bryan's death and Bullingdon seeking satisfaction. This theme of fate is also developed in the recurring motif of the painting. Just like the events featured in the paintings, Barry is participating in events which always were.\r\nAnother major theme is between father and son. Barry lost his father at a young age and throughout the film he seeks and attaches himself to father-figures. Examples include his uncle, Grogan, and the Chevalier. When given the chance to be a father, Barry loves his son to the point of spoiling him. This contrasts with his role as a father to Lord Bullingdon, whom he disregards and punishes.\r\nSource novel\r\nKubrick based his adapted screenplay on William Makepeace Thackeray's The Luck of Barry Lyndon (republished as the novel Memoirs of Barry Lyndon, Esq.), a picaresque tale written and published in serial form in 1844.\r\nThe film departs from the novel in several ways. In Thackeray's writings, events are related in the first person by Barry himself. A comic tone pervades the work, as Barry proves both a raconteur and an unreliable narrator. Kubrick's film, by contrast, presents the story objectively. Though the film contains voice-over (by actor Michael Hordern), the comments expressed are not Barry's, but those of an omniscient narrator. Kubrick felt that using a first-person narrative would not be useful in a film adaptation:\r\nI believe Thackeray used Redmond Barry to tell his own story in a deliberately distorted way because it made it more interesting. Instead of the omniscient author, Thackeray used the imperfect observer, or perhaps it would be more accurate to say the dishonest observer, thus allowing the reader to judge for himself, with little difficulty, the probable truth in Redmond Barry's view of his life. This technique worked extremely well in the novel but, of course, in a film you have objective reality in front of you all of the time, so the effect of Thackeray's first-person story-teller could not be repeated on the screen. It might have worked as comedy by the juxtaposition of Barry's version of the truth with the reality on the screen, but I don't think that Barry Lyndon should have been done as a comedy.\r\nKubrick made several changes to the plot, including the addition of the final duel.",
    "html": "<p>Barry Lyndon is a 1975 period drama film written, directed, and produced by Stanley Kubrick, based on the 1844 novel The Luck of Barry Lyndon by William Makepeace Thackeray. Starring Ryan O'Neal, Marisa Berenson, Patrick Magee, Leonard Rossiter, and Hardy Krüger, the film recounts the early exploits and later unravelling of an 18th-century Anglo-Irish rogue and golddigger who marries a rich widow to climb the social ladder and assume her late husband's aristocratic position.</p><p>Kubrick began production on Barry Lyndon after his 1971 film A Clockwork Orange. He had originally intended to direct a biopic on Napoleon, but lost his financing because of the commercial failure of the similar 1970 Dino De Laurentiis-produced Waterloo. Kubrick eventually directed Barry Lyndon, set partially during the Seven Years' War, utilising his research from the Napoleon project. Filming began in December 1973 and lasted roughly eight months, taking place in England, Ireland, East Germany, and West Germany.</p><p>The film's cinematography has been described as ground-breaking. Especially notable are the long double shots, usually ended with a slow backwards zoom, the scenes shot entirely in candlelight, and the settings based on William Hogarth paintings. The exteriors were filmed on location in Ireland, England and West Germany, with the interiors shot mainly in London. The production had problems related to logistics, weather, and politics (Kubrick feared that he might be an IRA hostage target).</p><p>Barry Lyndon won four Oscars at the 48th Academy Awards: Best Scoring: Original Song Score and Adaptation or Scoring: Adaptation, Best Costume Design, Best Art Direction, and Best Cinematography. Although some critics took issue with the film's slow pace and restrained emotion, its reputation, like that of many of Kubrick's works, has grown over time. In the 2012 Sight & Sound Greatest Films of All Time poll, Barry Lyndon placed 19th in the directors' poll and 59th in the critics' poll.</p><br/><h3>Plot</h3><h4>Part I: By What Means Redmond Barry Acquired the Style and Title of Barry Lyndon</h4><p>An omniscient (though possibly unreliable) narrator relates that in 1750s Ireland, Redmond Barry's father is killed in a duel over a sale of some horses. The widow devotes herself to her only son. Barry becomes infatuated with his older cousin, Nora Brady. Nora and her family plan to improve their finances through marriage to a well-off British Army captain, John Quin. Barry shoots Quin in a duel, then flees. He is robbed by highwayman Captain Feeney. Penniless and dejected, Barry joins the British Army. Later, family friend Captain Grogan informs him that his dueling pistol had been loaded with tow, and Quin is not dead: the duel was staged by Nora's family to get rid of Barry.</p><p>Barry's regiment fights in Germany in the Seven Years' War. Grogan is fatally wounded in a skirmish. Fed up with the war, Barry deserts. En route to neutral Holland, he encounters Frau Lieschen. The two briefly become lovers. Later, Barry encounters Prussian Captain Potzdorf, who, seeing through his disguise, offers him the choice of being handed over to the British to be shot or enlisting in the Prussian Army. Barry enlists and later receives a special commendation from Frederick the Great for saving Potzdorf's life in a battle.</p><p>Two years later, after the war ends in 1763, Barry is employed by Captain Potzdorf's uncle in the Prussian Ministry of Police. The Prussians suspect the Chevalier de Balibari, a professional gambler, of spying for the Austrians, and have Barry become his servant. Barry reveals everything to the Chevalier, a fellow Irishman. They become confederates. After they cheat the Prince of Tübingen at cards, the Prince accuses the Chevalier of cheating and demands satisfaction. Barry's Prussian handlers, still suspecting that the Chevalier is a spy, arrange for the Chevalier to be expelled from the country. Alerted by Barry, the Chevalier flees in the night. The next morning, Barry, disguised as the Chevalier, is escorted from Prussia.</p><p>Over the next few years, Barry and the Chevalier travel across Europe, perpetrating gambling scams, with Barry forcing payment from reluctant debtors with sword duels. In Spa, he encounters the beautiful and wealthy Countess of Lyndon. He seduces and later marries her after the death of her elderly husband, Sir Charles Lyndon (caused by Barry's goading and verbal repartee).</p><h4>Part II: Containing an Account of the Misfortunes and Disasters Which Befell Barry Lyndon</h4><p>In 1773, Barry takes the Countess's last name and settles in England. Lord Bullingdon, Lady Lyndon's ten-year-old son by Sir Charles, quickly comes to despise Barry. Barry retaliates by physically abusing Bullingdon. The Countess bears Barry a son, Bryan Patrick, but the marriage is unhappy: Barry is openly unfaithful and enjoys spending his wife's money, while keeping her in seclusion.</p><p>Barry's mother comes to live with him. She warns him that if Lady Lyndon were to die, Lord Bullingdon would inherit everything, and advises him to obtain a noble title to protect himself. Toward this goal, he cultivates the acquaintance of the influential Lord Wendover and spends large sums of money to ingratiate himself to high society. However, Lord Bullingdon, now a young adult, crashes a lavish birthday party Barry throws for Lady Lyndon. He publicly explains why he detests his stepfather and declares he will leave the family estate for as long as Barry remains there and married to his mother. Barry viciously assaults Bullingdon until he is physically restrained. This causes him to be cast out of polite society.</p><p>Barry proves an overindulgent father to Bryan and gives him a full-grown horse for his ninth birthday. Bryan is thrown from the horse and dies a few days later. The grief-stricken Barry turns to alcohol, while Lady Lyndon seeks solace in religion, assisted by the Rev. Samuel Runt, who had been tutor to Lord Bullingdon and Bryan. Barry's mother dismisses Runt, both because the family no longer needs (nor can afford, due to Barry's spending debts) a tutor and for fear that his influence will worsen Lady Lyndon's condition. Lady Lyndon later attempts suicide. Runt and Graham, the family's accountant, then seek out Lord Bullingdon, who returns and challenges Barry to a duel.</p><p>A coin toss gives Bullingdon the first shot, but he nervously misfires his pistol. Barry magnanimously fires into the ground, but Bullingdon refuses to let the duel end. In the second round, Bullingdon shoots Barry in the leg. The leg has to be amputated below the knee. While Barry is recovering, Bullingdon takes control of the Lyndon estate. He offers Barry 500 guineas a year provided he leave England forever. With his credit exhausted, Barry accepts. The narrator states that Barry resumes his former profession of gambler (though without his former success). In December 1789, a middle-aged Lady Lyndon signs Barry's annuity cheque as her son looks on.</p><br/><h3>Cast</h3><ul><li>Michael Hordern (voice) as Narrator</li><li>Ryan O'Neal as Redmond Barry (later Redmond Barry Lyndon)</li><li>Marisa Berenson as Lady Lyndon</li><li>Patrick Magee as the Chevalier de Balibari</li><li>Hardy Krüger as Captain Potzdorf</li><li>Gay Hamilton as Nora Brady</li><li>Godfrey Quigley as Captain Grogan</li><li>Steven Berkoff as Lord Ludd</li><li>Marie Kean as Belle, Barry's mother</li><li>Murray Melvin as Reverend Samuel Runt</li><li>Frank Middlemass as Sir Charles Reginald Lyndon</li><li>Leon Vitali as Lord Bullingdon Dominic Savage as young Bullingdon</li><li>Dominic Savage as young Bullingdon</li><li>Leonard Rossiter as Captain John Quin</li><li>André Morell as Lord Wendover</li><li>Anthony Sharp as Lord Hallam</li><li>Philip Stone as Graham</li><li>David Morley as Bryan Patrick Lyndon</li><li>Diana Koerner as Lieschen (German Girl)</li><li>Arthur O'Sullivan as Captain Feeney</li><li>Billy Boyle as Seamus Feeney</li><li>Jonathan Cecil as Lt. Jonathan Fakenham</li><li>Peter Cellier as Sir Richard Brevis</li><li>Geoffrey Chater as Dr Broughton</li><li>Wolf Kahler as Prince of Tübingen</li><li>Liam Redmond as Mr Brady</li><li>Roger Booth as King George III</li><li>Ferdy Mayne as Colonel Bulow</li><li>John Sharp as Doohan</li><li>Pat Roach as Corporal Toole</li><li>Hans Meyer as Schulffen</li></ul><p>Critic Tim Robey suggests that the film \"makes you realise that the most undervalued aspect of Kubrick's genius could well be his way with actors.\" He adds that the supporting cast is a \"glittering procession of cameos, not from star names but from vital character players.\"</p><p>The cast featured Leon Vitali as the older Lord Bullingdon, who then became Kubrick's personal assistant, working as the casting director on his following films, and supervising film-to-video transfers for Kubrick. Their relationship lasted until Kubrick's death. The film's cinematographer, John Alcott, appears at the men's club in the non-speaking role of the man asleep in a chair near the title character when Lord Bullingdon challenges Barry to a duel. Kubrick's daughter Vivian also appears (in an uncredited role) as a guest at Bryan's birthday party.</p><p>Other Kubrick featured regulars were Leonard Rossiter (2001: A Space Odyssey), Steven Berkoff, Patrick Magee, Godfrey Quigley, Anthony Sharp, and Philip Stone (A Clockwork Orange). Stone went on to feature in The Shining.</p><br/><h3>Production</h3><h4>Development</h4><p>After completing post production on 2001: A Space Odyssey, Kubrick resumed planning a film about Napoleon. During pre-production, Sergei Bondarchuk and Dino De Laurentiis' Waterloo was released, and failed at the box office. Reconsidering, Kubrick's financiers pulled funding, and he turned his attention towards an adaptation of Anthony Burgess's 1962 novel A Clockwork Orange. Subsequently, Kubrick showed an interest in Thackeray's Vanity Fair but dropped the project when a serialised version for television was produced. He told an interviewer, \"At one time, Vanity Fair interested me as a possible film but, in the end, I decided the story could not be successfully compressed into the relatively short time-span of a feature film ... as soon as I read Barry Lyndon I became very excited about it.\"</p><p>Having earned Oscar nominations for Dr. Strangelove, 2001: A Space Odyssey and A Clockwork Orange, Kubrick's reputation in the early 1970s was that of \"a perfectionist auteur who loomed larger over his movies than any concept or star\". His studio—Warner Bros.—was therefore \"eager to bankroll\" his next project, which Kubrick kept \"shrouded in secrecy\" from the press partly due to the furore surrounding the controversially violent A Clockwork Orange (particularly in the UK) and partly due to his \"long-standing paranoia about the tabloid press.\" Kubrick was initially rumored to be developing an adaptation of Arthur Schnitzler's 1926 novell Dream Story, which would serve as the source material for his later film Eyes Wide Shut (1999).</p><p>Having felt compelled to set aside his plans for a film about Napoleon Bonaparte, in 1972 Kubrick set his sights on Thackeray's 1844 \"satirical picaresque about the fortune-hunting of an Irish rogue,\" Barry Lyndon, the setting of which allowed Kubrick to take advantage of the copious period research he had done for the now-aborted Napoleon. At the time, Kubrick merely announced that his next film would star Ryan O'Neal (deemed \"a seemingly un-Kubricky choice of leading man\") and Marisa Berenson, a former Vogue and Time magazine cover model, and be shot largely in Ireland. So heightened was the secrecy surrounding the film that \"Even Berenson, when Kubrick first approached her, was told only that it was to be an 18th-century costume piece she was instructed to keep out of the sun in the months before production, to achieve the period-specific pallor he required.\"</p><h4>Principal photography</h4><p>Principal photography lasted 300 days, from spring 1973 through to early 1974, with a break for Christmas. Kubrick initially wished to film the entire production near his home in Borehamwood, but Ken Adam convinced him to relocate the shoot to Ireland. The crew arrived in Dublin, Ireland in May 1973. Jan Harlan recalls that Kubrick \"loved his time in Ireland – he rented a lovely house west of Dublin, he loved the scenery and the culture and the people\".</p><p>Many of the exteriors were shot in Ireland, playing \"itself, England, and Prussia during the Seven Years' War.\" Kubrick and cinematographer Alcott drew inspiration from \"the landscapes of Watteau and Gainsborough,\" and also relied on the art direction of Ken Adam and Roy Walker. Alcott, Adam and Walker were among those who would win Oscars for their work on the film.</p><p>Several of the interior scenes were filmed in Powerscourt House, an 18th-century mansion in County Wicklow, Republic of Ireland. The house was destroyed in an accidental fire several months after filming (November 1974), so the film serves as a record of the lost interiors, particularly the \"Saloon\" which was used for more than one scene. The Wicklow Mountains are visible, for example, through the window of the saloon during a scene set in Berlin. Other locations included Kells Priory (the English Redcoat encampment) Blenheim Palace, Castle Howard (exteriors of the Lyndon estate), Huntington Castle, Clonegal (exterior), Corsham Court (various interiors and the music room scene), Petworth House (chapel), Stourhead (lake and temple), Longleat, and Wilton House (interior and exterior) in England, Lavenham Guildhall at Lavenham in Suffolk (amputation scene), Dunrobin Castle (exterior and garden as Spa) in Scotland, Dublin Castle in Ireland (the chevalier's home), Ludwigsburg Palace near Stuttgart and Frederick II of Prussia's Neues Palais at Potsdam near Berlin (suggesting Berlin's main street Unter den Linden as construction in Potsdam had just begun in 1763). Some exterior shots were also filmed at Waterford Castle (now a luxury hotel and golf course) and Little Island, Waterford. Moorstown Castle in Tipperary also featured. Several scenes were filmed at Castletown House outside Carrick-on-Suir, Co. Tipperary, and at Youghal, Co. Cork.</p><p>The filming took place in the backdrop of some of the most intense years of the Troubles in Ireland, during which the Provisional Irish Republican Army (Provisional IRA) was waging an armed campaign in order to bring about a United Ireland. On 30 January 1974, while filming in Dublin City's Phoenix Park, shooting had to be cancelled due to the chaos caused by 14 bomb threats. One day a phone call was received and Kubrick was given 24 hours to leave the country; he left within 12 hours. The phone call alleged that the Provisional IRA had him on a hit list and Harlan recalls \"Whether the threat was a hoax or it was real, almost doesn't matter ... Stanley was not willing to take the risk. He was threatened, and he packed his bag and went home\" Production of the film was one-third completed when this occurred, and it was rumored that the film would be abandoned. Nonetheless, Kubrick continued shooting the remaining two-thirds of the film at locations in southern England and West Germany. Locations in England included the Wilton House in Salisbury, Corsham Court, Stourhead House, Castle Howard, and Glastonbury.</p><h4>Cinematography</h4><p>The film, as with \"almost every Kubrick film\", is a \"showcase for major innovation in technique.\" While 2001: A Space Odyssey had featured \"revolutionary effects,\" and The Shining would later feature heavy use of the Steadicam, Barry Lyndon saw a considerable number of sequences shot \"without recourse to electric light.\" The film's cinematography was overseen by director of photography John Alcott (who won an Oscar for his work), and is particularly noted for the technical innovations that made some of its most spectacular images possible. To achieve photography without electric lighting \"or the many densely furnished interior scenes… meant shooting by candlelight,\" which is known to be difficult in still photography, \"let alone with moving images.\"</p><p>Kubrick was \"determined not to reproduce the set-bound, artificially lit look of other costume dramas from that time.\" After \"tinker with different combinations of lenses and film stock,\" the production obtained three super-fast 50mm lenses (Carl Zeiss Planar 50mm f/0.7) developed by Zeiss for use by NASA in the Apollo Moon landings, which Kubrick had discovered. These super-fast lenses \"with their huge aperture (the film actually features the lowest f-stop in film history) and fixed focal length\" were problematic to mount, and were extensively modified into three versions by Cinema Products Corp. for Kubrick to gain a wider angle of view, with input from optics expert Richard Vetter of Todd-AO. The rear element of the lens had to be 2.5 mm away from the film plane, requiring special modification to the rotating camera shutter. This allowed Kubrick and Alcott to shoot scenes lit in candlelight to an average lighting volume of only three candela, \"recreating the huddle and glow of a pre-electrical age.\" In addition, Kubrick had the entire film push-developed by one stop.</p><p>Although Kubrick and Alcott sought to avoid electric lighting where possible, most shots were achieved with conventional lenses and lighting, but were lit to deliberately mimic natural light rather than for compositional reasons. In addition to potentially seeming more realistic, these methods also gave a particular period look to the film which has often been likened to 18th-century paintings (which of course depict a world devoid of electric lighting), in particular owing \"a lot to William Hogarth, with whom Thackeray had always been fascinated.\"</p><p>The film is widely regarded as having a stately, static, painterly quality, mostly due to its lengthy, wide-angle long shots. To illuminate the more notable interior scenes, artificial lights called \"Mini-Brutes\" were placed outside and aimed through the windows, which were covered in a diffuse material to scatter the light evenly through the room rather than being placed inside for maximum use as most conventional films do. In some instances, the natural daylight was allowed to come through, which when recorded on the film stock used by Kubrick showed up as blue-tinted compared to the incandescent electric light.</p><p>Despite such slight tinting effects, this method of lighting not only gave the look of natural daylight coming in through the windows, but it also protected the historic locations from the damage caused by mounting the lights on walls or ceilings and the heat from the lights. This helped the film \"fit… perfectly with Kubrick's gilded-cage aesthetic – the film is consciously a museum piece, its characters pinned to the frame like butterflies.\"</p><h4>Music</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Barry Lyndon</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\">various</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">27 December 1975</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span>Classical</span>, <span>folk</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">49</span>:<span class=\"s\">48</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\">Warner Bros.</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Producer</span></th><td class=\"infobox-data hlist\"><span>Leonard Rosenman</span></td></tr></tbody></table><p>The film's period setting allowed Kubrick to indulge his penchant for classical music, and the film score uses pieces by Bach, Vivaldi, Paisiello, Mozart, and Schubert. The piece most associated with the film, however, is the main title music, Handel's Sarabande from the Keyboard suite in D minor (HWV 437). Originally for solo harpsichord, the versions for the main and end titles are performed with strings, timpani and continuo. The score also includes Irish folk music, including Seán Ó Riada's song \"Women of Ireland\", arranged by Paddy Moloney and performed by The Chieftains. \"The British Grenadiers\" also features in scenes with Redcoats marching.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:40%\">Title</th><th scope=\"col\" style=\"width:30%\">Writer(s)</th><th scope=\"col\" style=\"width:30%\">Performer/conductor/arranger</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"<span>Sarabande–Main Title</span>\"</td><td><span>George Frideric Handel</span></td><td><span>National Philharmonic Orchestra</span></td><td class=\"tracklist-length\">2:38</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Women of Ireland\"</td><td><span>Peadar Ó Doirnín</span>, <span>Seán Ó Riada</span></td><td><span>The Chieftains</span></td><td class=\"tracklist-length\">4:08</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Piper's Maggot Jig\"</td><td><i>traditional</i></td><td>The Chieftains</td><td class=\"tracklist-length\">1:39</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"<span>The Sea-Maiden</span>\"</td><td><i>traditional</i></td><td>The Chieftains</td><td class=\"tracklist-length\">2:02</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Tin Whistles\"</td><td>Ó Riada</td><td><span>Paddy Moloney</span> &amp; <span>Seán Potts</span></td><td class=\"tracklist-length\">3:41</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"<span>The British Grenadiers</span>\"</td><td><i>traditional</i></td><td>Fifes &amp; Drums</td><td class=\"tracklist-length\">2:12</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"<span>Hohenfriedberger March</span>\"</td><td><span>Frederick II of Prussia</span></td><td>Fifes &amp; Drums</td><td class=\"tracklist-length\">1:12</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"<span>Lillibullero</span>\"</td><td><i>traditional</i></td><td>Fifes &amp; Drums</td><td class=\"tracklist-length\">1:06</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"Women of Ireland\"</td><td>Ó Riada</td><td><span>Derek Bell</span></td><td class=\"tracklist-length\">0:52</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"March from <i><span>Idomeneo</span></i>\"</td><td><span>Wolfgang Amadeus Mozart</span></td><td>National Philharmonic Orchestra</td><td class=\"tracklist-length\">1:29</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Sarabande–Duel\"</td><td>Handel</td><td>National Philharmonic Orchestra</td><td class=\"tracklist-length\">3:11</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"Lillibullero\"</td><td><i>traditional</i></td><td>Leslie Pearson</td><td class=\"tracklist-length\">0:52</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"German Dance no. 1 in C major\"</td><td><span>Franz Schubert</span></td><td>National Philharmonic Orchestra</td><td class=\"tracklist-length\">2:12</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Sarabande–Duel\"</td><td>Handel</td><td>National Philharmonic Orchestra</td><td class=\"tracklist-length\">0:48</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"Film Adaptation of the Cavatina from <i><span>Il barbiere di Siviglia</span></i>\"</td><td><span>Giovanni Paisiello</span></td><td>National Philharmonic Orchestra</td><td class=\"tracklist-length\">4:28</td></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"Cello Concerto in E minor (third movement)\"</td><td><span>Antonio Vivaldi</span></td><td><span>Lucerne Festival Strings</span>/<span>Pierre Fournier</span>/<span>Rudolf Baumgartner</span></td><td class=\"tracklist-length\">3:49</td></tr><tr><th id=\"track17\" scope=\"row\">17.</th><td>\"Adagio from <i><span>Concerto for two harpsichords in C minor</span></i>\"</td><td><span>Johann Sebastian Bach</span></td><td>Münchener Bach-Orchester/<span>Hedwig Bilgram</span>/<span>Karl Richter</span></td><td class=\"tracklist-length\">5:10</td></tr><tr><th id=\"track18\" scope=\"row\">18.</th><td>\"Film Adaptation of <i><span>Piano Trio in E-flat, Op. 100</span></i> (second movement)\"</td><td>Schubert</td><td>Moray Welsh/<span>Anthony Goldstone</span>/Ralph Holmes</td><td class=\"tracklist-length\">4:12</td></tr><tr><th id=\"track19\" scope=\"row\">19.</th><td>\"Sarabande–End Title\"</td><td>Handel</td><td>National Philharmonic Orchestra</td><td class=\"tracklist-length\">4:07</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"4\" scope=\"row\"><span>Total length:</span></th><td>49:48</td></tr></tbody></table><h4>Charts</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Chart (1976)</th><th>Position</th></tr><tr><td>Australia (<span>Kent Music Report</span>)</td><td align=\"center\">99</td></tr></tbody></table><h4>Certifications</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption></caption><tbody><tr><th scope=\"col\">Region</th><th scope=\"col\">Certification</th><th scope=\"col\" data-sort-type=\"number\"><span>Certified units</span>/sales</th></tr><tr><th scope=\"row\">France (<span>SNEP</span>)</th><td>Platinum</td><td>300,000<sup>*</sup></td></tr><tr class=\"sortbottom\" style=\"text-align: center;\"><td colspan=\"3\"><p><small><sup>*</sup> Sales figures based on certification alone.</small></p></td></tr></tbody></table><br/><h3>Box office and reception</h3><h4>Contemporaneous</h4><p>The film \"was not the commercial success Warner Bros. had been hoping for\" within the United States, although it fared better in Europe. In the US it earned $9.1 million. Ultimately, the film grossed a worldwide total of $31.5 million on an $11 million budget.</p><p>This mixed reaction saw the film (in the words of one retrospective review) \"greeted, on its release, with dutiful admiration – but not love. Critics… rail against the perceived coldness of Kubrick's style, the film's self-conscious artistry and slow pace. Audiences, on the whole, rather agreed…\"</p><p>Roger Ebert gave the film three and a half stars out of four and wrote that it \"is almost aggressive in its cool detachment. It defies us to care, it forces us to remain detached about its stately elegance.\" He added, \"This must be one of the most beautiful films ever made.\" Vincent Canby of The New York Times called the film \"another fascinating challenge from one of our most remarkable, independent-minded directors.\" Gene Siskel of the Chicago Tribune gave the film three and a half stars out of four and wrote \"I found 'Barry Lyndon' to be quite obvious about its intentions and thoroughly successful in achieving them. Kubrick has taken a novel about a social class and has turned it into an utterly comfortable story that conveys the stunning emptiness of upper-class life only 200 years past.\" He ranked the film fifth on his year-end list of the best films of 1975. Charles Champlin of the Los Angeles Times called it \"the motion picture equivalent of one of those very large, very heavy, very expensive, very elegant and very dull books that exist solely to be seen on coffee tables. It is ravishingly beautiful and incredibly tedious in about equal doses, a succession of salon quality still photographs—as often as not very still indeed.\" The Washington Post wrote, \"It's not inaccurate to describe 'Barry Lyndon' as a masterpiece, but it's a deadend masterpiece, an objet d'art rather than a movie. It would be more at home, and perhaps easier to like, on the bookshelf, next to something like 'The Age of the Grand Tour,' than on the silver screen.\" Pauline Kael of The New Yorker wrote that \"Kubrick has taken a quick-witted story\" and \"controlled it so meticulously that he's drained the blood out of it,\" adding, \"It's a coffee-table movie; we might as well be at a three-hour slide show for art-history majors.\"</p><p>This \"air of disappointment\" factored into Kubrick's decision for his next film, an adaption of Stephen King's The Shining, a project that would not only please him artistically, but was more likely to succeed financially.</p><h4>Re-evaluation</h4><p>Over time, the film has gained a more positive reaction. On review aggregator Rotten Tomatoes, the film holds an approval rating of 89% based on 79 reviews, with an average rating of 8.30/10. The website's critical consensus reads, \"Cynical, ironic, and suffused with seductive natural lighting, Barry Lyndon is a complex character piece of a hapless man doomed by Georgian society.\" On Metacritic, the film has a weighted average score of 89 out of 100 based on reviews from 21 critics, indicating \"universal acclaim\". Roger Ebert added the film to his 'Great Movies' list on 9 September 2009 and increased his original rating from three and a half stars to four, writing, \"Stanley Kubrick's Barry Lyndon, received indifferently in 1975, has grown in stature in the years since and is now widely regarded as one of the master's best. It is certainly in every frame a Kubrick film: technically awesome, emotionally distant, remorseless in its doubt of human goodness.\"</p><p>The Village Voice ranked the film at number 46 in its Top 250 \"Best Films of the Century\" list in 1999, based on a poll of critics. Director Martin Scorsese has named Barry Lyndon as his favourite Kubrick film, and it is also one of Lars von Trier's favourite films. Barry Lyndon was included on Time's All-Time 100 best movies list. In the 2012 Sight & Sound Greatest Films of All Time poll, Barry Lyndon placed 19th in the directors' poll and 59th in the critics' poll. The film ranked 27th in BBC's 2015 list of the 100 greatest American films.</p><p>In a list compiled by The Irish Times critics Tara Brady and Donald Clarke in 2020, Barry Lyndon was named the greatest Irish film of all time.</p><p>The Japanese filmmaker Akira Kurosawa cited this movie as one of his 100 favorite films.</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Award</th><th scope=\"col\">Category</th><th scope=\"col\">Recipient</th><th scope=\"col\">Result</th></tr><tr><th scope=\"row\" rowspan=\"7\"><span>Academy Awards</span></th><td><span>Best Picture</span></td><td rowspan=\"3\"><span>Stanley Kubrick</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay – Based on Material from Another Medium</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Art Direction</span></td><td>Art Direction: <span>Ken Adam</span> and <span>Roy Walker</span> <br> Set Decoration: <span>Vernon Dixon</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Costume Design</span></td><td><span>Milena Canonero</span> and <span>Ulla-Britt Söderlund</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Cinematography</span></td><td><span>John Alcott</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Scoring: Original Song Score and Adaptation or Scoring: Adaptation</span></td><td><span>Leonard Rosenman</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\" rowspan=\"5\"><span>British Academy Film Awards</span></th><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td>Stanley Kubrick</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Art Direction</span></td><td>Ken Adam</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Costume Design</span></td><td>Milena Canonero and Ulla-Britt Söderlund</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td>John Alcott</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\" rowspan=\"2\"><span>Golden Globe Awards</span></th><td colspan=\"2\"><span>Best Motion Picture – Drama</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td>Stanley Kubrick</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"row\" rowspan=\"3\"><span>National Board of Review Awards</span></th><td colspan=\"2\"><span>Top Ten Films</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Stanley Kubrick</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><h4>Cinematic analysis</h4><p>The main theme explored in Barry Lyndon is one of fate and destiny. Barry is pushed through life by a series of key events, some of which seem unavoidable. As Roger Ebert says, \"He is a man to whom things happen.\" He declines to eat with the highwayman Captain Feeney, where he would most likely have been robbed, but is robbed anyway farther down the road. The narrator repeatedly emphasizes the role of fate as he announces events before they unfold on screen, like Bryan's death and Bullingdon seeking satisfaction. This theme of fate is also developed in the recurring motif of the painting. Just like the events featured in the paintings, Barry is participating in events which always were.</p><p>Another major theme is between father and son. Barry lost his father at a young age and throughout the film he seeks and attaches himself to father-figures. Examples include his uncle, Grogan, and the Chevalier. When given the chance to be a father, Barry loves his son to the point of spoiling him. This contrasts with his role as a father to Lord Bullingdon, whom he disregards and punishes.</p><br/><h3>Source novel</h3><p>Kubrick based his adapted screenplay on William Makepeace Thackeray's The Luck of Barry Lyndon (republished as the novel Memoirs of Barry Lyndon, Esq.), a picaresque tale written and published in serial form in 1844.</p><p>The film departs from the novel in several ways. In Thackeray's writings, events are related in the first person by Barry himself. A comic tone pervades the work, as Barry proves both a raconteur and an unreliable narrator. Kubrick's film, by contrast, presents the story objectively. Though the film contains voice-over (by actor Michael Hordern), the comments expressed are not Barry's, but those of an omniscient narrator. Kubrick felt that using a first-person narrative would not be useful in a film adaptation:</p><blockquote>I believe Thackeray used Redmond Barry to tell his own story in a deliberately distorted way because it made it more interesting. Instead of the omniscient author, Thackeray used the imperfect observer, or perhaps it would be more accurate to say the dishonest observer, thus allowing the reader to judge for himself, with little difficulty, the probable truth in Redmond Barry's view of his life. This technique worked extremely well in the novel but, of course, in a film you have objective reality in front of you all of the time, so the effect of Thackeray's first-person story-teller could not be repeated on the screen. It might have worked as comedy by the juxtaposition of Barry's version of the truth with the reality on the screen, but I don't think that Barry Lyndon should have been done as a comedy.</blockquote><p>Kubrick made several changes to the plot, including the addition of the final duel.</p><br/>"
  },
  "errorMessage": ""
}