{
  "imDbId": "tt0372784",
  "title": "Batman Begins",
  "fullTitle": "Batman Begins (2005)",
  "type": "Movie",
  "year": "2005",
  "items": [
    {
      "username": "pyrocitor",
      "userUrl": "https://www.imdb.com/user/ur3728510",
      "reviewLink": "https://www.imdb.com/review/rw1151361",
      "warningSpoilers": false,
      "date": "15 August 2005",
      "rate": "10",
      "helpful": "660 out of 737 found this helpful.",
      "title": "Why do we fall? So we can learn to pick ourselves up. And such is the case for the Batman franchise",
      "content": "It sickened me in the past to see the Batman movie franchise slowly digging it's way to an early grave. After the quality Tim Burton films, the series pretty much went down the toilet, beginning a horrifically campy age of 'Bat credit-cards' and an armored Arnold Schwarzenegger tossing cringe-worthy puns at a Batman who seemed to be trying not to be embarrassed by the fact that his costume had nipples. So what could Warner Brothers producers hope to do to resurrect the franchise? Pretend it never happened, and start the whole series over again with a talented director, compelling story and capable cast. Enter Christopher Nolan, the mastermind behind 2000's 'Momento', widely praised as one of the most innovative films of the decade. As director/co- screenwriter, Nolan creates a richly dark, atmospheric world for Batman to inhabit, similar to that of the Burton films, but less cartoony. The film's screenplay, written by Nolan and David S. Goyer is quality stuff, it's true that some of the dialog exchanges can seem kind of contrived, particularly between Wayne and Liam Neeson's character, Ducard, but it sounds so classy you tend not to care. Nolan also puts a lot of trust in his audiences to stay put while the first hour of the film comprehensively explores Bruce Wayne's backstory, with no cape donning and few fight sequences. Nevertheless, the pace never slows, and the story is so unexpected and fascinating (who would have expected a Batman film to begin in a prison in Tibet? only Nolan could pull it off!) there's little chance of us losing interest. And this way, we really get a sense of who Bruce Wayne is, a trait none of the past movies were able to capture, including the Burton films. We see what drives him, what leads him to become this iconic crime fighter, and the reasoning behind the mask.Of course, to help the audience get under Bruce Wayne's skin, it doesn't hurt to have such a talented lead as Christian Bale. Bale has been emerging as one of the most talented actors of his generation, and he brings that talent to a peak here, playing the darkest of all superheroes. If you were to break down the role of Batman/Bruce Wayne, you would find that it is essentially three characters: Wayne as Batman, behind the mask; Wayne's public facade as the billionaire playboy; and the real, brooding Bruce Wayne. Bale plays all three of the characters to absolute perfection, and molds them together well enough to make it clear to show they are still the same person. He has been given tons of accolades for his performance already, and needless to say, he deserves every one.And the sheer quality of the supporting cast is mind-boggling, if for the number of big names only. It's very hard to find a weak spot in the incredibly strong array of performances here, but if one had to be found, it would have to be Katie Holmes. It's not that she gives a bad performance, on the contrary, but just she seems too young to be convincing as a district attorney. For me, Michael Gough will always be the definitive Alfred, but Michael Caine does an excellent job of taking over the role, giving a very strong (and often funny) performance. Liam Neeson is sheer class as Ducard, Wayne's mysterious mentor, as is Morgan Freeman as Lucius Fox, Wayne's arms manufacturer and provider of the Batman gear. It's wonderful to see the incredibly talented and much underrated Gary Oldman as Sgt. Gordon, the only decent cop in Gotham, and he truly makes the role his own. Even cult favorite Rutger Hauer makes an appearance as Richard Earle, the ambitious head of Wayne Enterprises. And (surprise surprise!) the villains are also actually menacing for once, as opposed to cartoony and corny. Cillian Murphy just about walks away with the show as the truly chilling Scarecrow (the sequences involving his 'fear gas' are surprisingly frightening) Ken Watanabe is mysterious and creepy as guild leader Ra's Al Ghul and Tom Wilkinson is very convincing as Carmine Falcone, head of the Gotham city mob. Nolan's knack for realism also comes as a breath of fresh air in this age of CGI bloated blockbusters - there are next to no computer generated shots in the movie, even a sequence with Batman standing on top of a high building staring down at the city was filmed with a stuntman. And it really works, the Batmobile actually interacts with it's environment, and looks so much better real than computer generated. But don't think that the film will come across as too serious and stuffy because of Nolan's realism - true, Gotham seems too dark and dirty to come across as a fantasy world, but Batman Begins retains that unmistakable sense of fun that seems to only be present in comic book movies. We jeer and fear the villains, and cheer the hero as he lays his life on the line to vanquish evil and save the city. And that is how it should be. There's even a surprising twist near the end, which is doubly surprising because it actually comes as a shock. What's not to love here?(and, further cudos to director Nolan for finally managing to make a swarm of bats actually frightening for once)Overall, I'd have to label Batman Begins 'The must see movie of the summer' - it's a well written, authoritatively directed, impeccably acted (especially by Bale's powerhouse lead performance and Cillian Murphy's sickly menacing Scarecrow) and very high quality production. Indeed, most other summer blockbusters could learn a thing or two from Batman Begins. If the Batman franchise died under it's own gaudiness years ago, let us rejoice this glorious rebirth - Batman truly does begin here.-10/10"
    },
    {
      "username": "tenten76",
      "userUrl": "https://www.imdb.com/user/ur1287516",
      "reviewLink": "https://www.imdb.com/review/rw1096419",
      "warningSpoilers": false,
      "date": "5 June 2005",
      "rate": "10",
      "helpful": "1,302 out of 1,518 found this helpful.",
      "title": "A darker, stormier knight.",
      "content": "Christopher Nolan (and cast) have pulled off what I hadn't dared to dream - a Batman every bit as good as Burton/Keaton's vision - and eradicated the camp, feverish memories of Clooney, Kilmer and (cough..) O'Donnell.The story is as good an origin story as you'll find - covering all the major (true-to-the-comic) events, and not wasting ages on them. We see Wayne's all-important training period (previously ignored), and his connection to the Tibetan shadow-ninja clan led by Ra's Al Ghul. We see Bruce come up with ideas for his symbol, his costume, his gadgets, his car, his cave - IT ALL FITS SO PERFECTLY.That's not all - Liam Neeson is perfect (as ever, when Lucas isn't writing his lines), Batman's first mad nemesis (the Scarecrow) is genuinely frightening; with some outstandingly scary 'fear' effects.. Gary Oldman looks just like a young Commissioner Gordon (and doesn't dominate), Morgan Freeman and Rutger Hauer give solid heavyweight support to the boardroom machinations at Wayne Enterprizes. I love Michael Gough(?) but Michael Caine is great as Alfred. It's only Katie Holmes who didn't ring true for me - not because of her performance, but simply because she looks all of 15 years old (sorry Katie). I am always blown away by Christian Bale, and this is no exception.The fights are great, the Bat-gadgets all there, the car is amazing, the plot is thorough and exciting, Gotham looks great, Batman really is frightening & menacing (and lethal!).. And the scenes with the bats themselves FINALLY get across the idea of how scary they can be.There is some humour, but it's fairly dry. The soundtrack, like all the best original soundtracks, is excellent - you hardly know it's there, but the emotions of the scene are enhanced and boosted. For the most part this is a serious Batman film, with plenty for long-time fans. This NEW Batman is one I'd like to see again. Bravo Mr Nolan, bravo."
    },
    {
      "username": "jaredpahl",
      "userUrl": "https://www.imdb.com/user/ur35359466",
      "reviewLink": "https://www.imdb.com/review/rw3314688",
      "warningSpoilers": true,
      "date": "10 September 2015",
      "rate": "8",
      "helpful": "34 out of 36 found this helpful.",
      "title": "Mature Batman Origin Story With Enough Comic Book Flair To Satisfy Fans Of Every Kind",
      "content": "Batman Begins was a massive breath of fresh air when it came out in 2005. Coming 8 years after Warner Brothers jumped the bat, as it were, with Joel Schumacher's childish mess, \"Batman and Robin\", Christopher Nolan's Batman Begins brought a maturity and seriousness to The Caped Crusader that had been absent since Tim Burton left the world of Gotham. While Batman Begins might not boast the visual prowess or rich villains of Burton's two Batman movies, it fleshed out the character of Bruce Wayne in a way no movie has since.Batman Begins is an origin story straight through, detailing Bruce Wayne's (Christian Bale) emergence from tragically scarred child to a symbol of heroism and darkness. After training with Ra's al Ghul and the League of Shadows, Bruce Wayne returns to Gotham in perfect mental and physical shape. What Nolan and screenwriter David Goyer do perfectly here, is inject Bruce Wayne with an emotion never before seen in a Batman movie. You can feel the pain and grief Wayne is experiencing and you can see why he decides to become a living symbol of good. The first full origin story for Batman on film, Batman Begins is very much told from Bruce's point of view. Earlier Batman movies often focused more heavily on developing the villains, leaving Bruce Wayne in the shadows. The approach that keeps Batman a dark, mysterious figure is a valiant one, and it makes sense. However, context rarely hurts, and Batman Begins provides the character with heaps of context. You can clearly understand the emotions and motivations of the man behind the mask. The origin is also utterly believable. You can see why Bruce Wayne dresses like a bat, why he needs a cape, how he gets a super-car and super-gadgets, and why he hides in a cave. Does it strip Batman of his mythic status? Yes, a bit. Luckily, unlike Nolan's two follow-ups, Begins doesn't get too carried away with realism, retaining a comic book style that its successor would forget.While it does take a while for Bruce Wayne to fully become the bat, it is worth it. Once Bruce Wayne finally dons the cape and cowl, there are a few jaw-dropping action scenes including a brilliant batmobile chase scene and a thrilling climax on Gotham's elevated trains. The atmosphere and feeling of Gotham City is nearly perfect in it's own way. It does not have the Gothic beauty of Tim Burton's Batman universe, but it's blend of comic book dinginess and contemporary sleekness makes Gotham a terrifically realized cityscape. The city feels like what a comic book world would be like if it actually existed. Batman himself is a dark, brooding, wonderfully realized character in his own right and he shares the screen with an ensemble of great actors. Michael Caine as Alfred, Morgan Freeman as Lucius Fox, and Gary Oldman as Commissioner Gordon are standouts in an ensemble cast that is playing the comic book material straight as an arrow. Cillian Murphy as the Scarecrow is an excellent but criminally underused baddie, but on the whole, the supporting cast elevates the material.Batman Begins is still as fresh today as it was more than a decade ago. The origin of Batman is engaging, engrossing, and emotional. The story provides a context to the Bruce Wayne character that elevates the movie beyond its fun comic book plot. The origin is a satisfying and believable one, and once Batman finally enters the scene, the action is unmatched. Batman Begins is a strong, confident summer superhero blockbuster with more maturity and emotional truth than most dramas. I hesitate to call it the definitive interpretation of Batman (Batman 1989 takes that title), but Batman Begins is the best of Christopher Nolan's Batman movies, a film that balances gritty realism, human drama, and thrilling comic book fun.85/100"
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8782296",
      "warningSpoilers": false,
      "date": "6 January 2023",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "A first class movie.",
      "content": "A young Bruce Wayne watches in horror, as his parents are killed in front of him, later in life, he vows to remove the criminal element from Gotham City.A word on Christopher Nolan first, I am a huge fan, I think of Inception, Dunkirk and Interstellar, but his magical trio of Batman movies began here, a movie that put the franchise back on top.I'm not always sold on origins movies, there have been several misfires, this is one of, if not the best, it feels very organic, at no point does it try too hard, or overdo it, the balance between story, introduction, action and character, pretty much perfect.The Cinematography is incredible almost twenty years on, the choreography, fight scenes look terrific, made at a time where the purpose of the music was to assist the film and not to drown it out, it is also excellent.Christian Bale was perfect casting, one of the best actors in the business, he is first rate, the balance between Bruce Wayne and Batman is spot on, what a skilled actor he is.An incredible supporting cast, Cillian Murphy is equally as good as Bale, putting in a fiendishly creepy and sinister performance as Crane, Freeman, Caine, Neeson, Oldman, I don't think it could have gotten any better than this.Fantastic, 10/10."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3336573",
      "warningSpoilers": false,
      "date": "16 October 2015",
      "rate": "9",
      "helpful": "21 out of 23 found this helpful.",
      "title": "A reboot that works",
      "content": "British director Christopher Nolan is better known for his lower-profile thrillers such as the excellent MEMENTO and the brilliant INSOMNIA, but his first big-budget Hollywood blockbuster is still in the same league as the other two: a tremendously inventive and exciting piece of filmmaking, which breathes a whole new life into the Batman saga and proves to be the best film of the series (shame it took till number five to get it right, but that's life). Nolan dispenses with any previous cast or story lines, instead taking Batman back to his roots, and the result is a tough, violent, realistic adventure which isn't marred by any of the comic-book campness or flights of fancy which spoiled the others. Batman is just an ordinary guy here, without any superpowers, but instead his Bond-style gadgets allow him to become the caped crusader by night.The casting is extraordinary and the ensemble all give outstanding performances. Bale is terrific, finally getting some of the acclaim he deserves; I've been watching this guy for a few years now and he's been great in everything I've seen. Caine is cast as Alfred the butler, and supplies genuinely warm comedy and wit. Gary Oldman and Morgan Freeman are friendly allies, although their roles are relatively minor. Katie Holmes is the attractive love interest and she, too, is surprisingly good. However, it's the villains which have the best parts; Liam Neeson has his best role in many years and is fantastic in it, whilst THE LAST SAMURAI's Ken Watanabe is creepy as a cult leader. Cillian Murphy (28 DAYS LATER) is truly memorable as weirdo bad guy The Scarecrow, whilst Tom Wilkinson is almost unrecognisable as a hardline gangster. Even Rutger Hauer is in it, and that's gotta be good, seeing as he's been stuck in DTV movie hell for a decade.The film is long – 2 ½ hours to be precise – but the suspense and action keep it moving. There are car chases, fist fights, massive battles and lots of other stuff going on. The plot keeps you guessing all the way through and there are plenty of surprising twists. My only complaint is that the action is cut too fast, and too close, so that it's pretty hard to see what's happening, but the excellent soundtrack helps make up for that. Still, a minor complaint with what is otherwise a flawless film – let's hope they all team up to make some more classics like this."
    },
    {
      "username": "motta80-2",
      "userUrl": "https://www.imdb.com/user/ur0480585",
      "reviewLink": "https://www.imdb.com/review/rw1096424",
      "warningSpoilers": false,
      "date": "6 June 2005",
      "rate": "10",
      "helpful": "1,300 out of 1,541 found this helpful.",
      "title": "Everything I could have hoped for",
      "content": "I had fearful reservations about this one. I loved Tim Burton's Batman - 12 years old when it came out I was the perfect age for it and I also enjoyed Batman Returns. The franchise went so wrong under Joel Schumacher that I wasn't sure I wanted it resurrected. Not least because Batman was one of the few comics I read and enjoyed as a kid and was always my favourite superhero. I grew up reading the comics, watching reruns of the Adam West TV show and then getting Burton's celluloid vision. I was spoilt for choice as a kid but as an adult now I was concerned revisiting the franchise, especially given Warner's record over the last decade of screwing up summer blockbusters with potential all over the place (dare I bring up the Matrix sequels?)However, I am pleased to report I could not have been more wrong about how great Christopher Nolan's Batman Begins is. This is better than Burton. Sacrilege, you say?! Well Burton was still cartoony in many elements, he wasn't churning out the bilge of Schumacher but Burton's Batman was still over the top. As a kid this was ideal but Nolan's Batman is real. Everything in this world seems plausible and it is therefore a world that draws you in. Characters' vulnerability is that much more present. Every bruise, every scare, every concern, every emotion seems real.Part of this is that Nolan has assembled an exemplary cast. Again, this concerned me prior to seeing the film. I wasn't sure a cast of big name legends like Michael Caine and Morgan Freeman and well known names like Liam Neeson and Katie Holmes wouldn't detract and distract from Batman. I was always sure Christian Bale could be the great moody Batman he's been waiting his career to be but the others I wasn't so sure about.That said Bale is not just good, he's superb. I never thought I'd really be able to envision anyone other than Michael Keaton as the definitive Batman for me but since seeing Batman Begins a couple of days ago Bale has cemented himself in the position. Perhaps Keaton will now be able to escape the spectre of Batman he hasn't truly shaken off for 13 years.The rest of the cast is also pitch perfect. Cillian Murphy is creepy as hell, Liam Neeson is authoritative and imposing, Katie Holmes is strong and sexy (I particularly thought she'd be insipid, she should jettison Tom Cruise and let her talent - which she does have naysayers just watch Pieces Of April - speak for itself) and Michael Caine is an Alfred you've never seen but in fact far more likely as a butler than the aristocratic pomp with which he is usually portrayed. Gary Oldman is also superb in a rare wholly decent character for him as Lieutenant Jim Gordon who gets far more to so here than Gordon has ever had to do before. Only Tom Wilkinson is a little off with a slightly comedic wise-guy American accent that never really convinces.The emotional bond between Bruce Wayne and Alfred is actually a wonderful human heart to the film than Nolan and Goyer have written perfectly.Don't let that make you think the action is not front and centre though. From Wayne's training through the early stages of the film to his early missions as Batman at about the half way point to a thrillingly choreographed chase sequence and an edge of your seat finale this film delivers the cool quotient in bucket loads.Great villains (especially Murphy), great story, great cast, great action... put simply, great film. Probably the best comic-book movie ever made (that's excluding the genius Sin City which I consider a moving comic-book rather than a comic-book movie, that will never be bettered but Batman is a different beast and the best of its kind)."
    },
    {
      "username": "KissEnglishPasto",
      "userUrl": "https://www.imdb.com/user/ur47239035",
      "reviewLink": "https://www.imdb.com/review/rw3516221",
      "warningSpoilers": false,
      "date": "28 July 2016",
      "rate": "10",
      "helpful": "41 out of 46 found this helpful.",
      "title": "One Super-Hero Film With Tremendous Depth!",
      "content": "From PASTO, COLOMBIA-Via: L. A. CA; CALI, COLOMBIA+ORLANDO, FL-----------The ONLY Tony Kiss Castillo on FaceBook!----------------------Warner Brothers gave us a very special gift for Father's Day, 2005... BATMAN BEGINS. Despite displaying some lethargy in its opening scenes, and suffering from some of the excesses so common in this genre of film, not only might you say it is the best of the Batman Franchise, so far, but also that it is definitely the best super-hero film ever!Director, Christopher Nolan, who dazzled with his amazing talent in the 2000 Cult Classic, MEMENTO, has assembled a formidable cast (Michael Caine, Liam Neesom, Gary Oldman, Tom Wilkinson & Morgan Freeman, among others), an outstanding script and special effects all well focused in a film that transforms a two dimensional comic strip into a work of real depth!In the title role, we have Christian Bale, British, 31 at the time the film was made, someone who has spent most of his life in front of the cameras, without reaching, at least at this juncture in time, the long-awaited status of \"Super-Star\". In 2000, Bale took on another title role in American Psycho, a 'Cult Classic' which received ample attention from both critics and audiences alike. (If you have not seen this psychological thriller, do soWhat a gem it is! Bale is chillingly creepy!)On the one hand, Mr. Bale is one of very few British actors (Well, Welsh, to be exact) capable of playing an American where his accent, intonation, and even body language, is absolutely perfect, impeccable! (After taking in American Psycho, I could have sworn he was American!) However, in BEGINS, although his performance seemed quite good, it was slightly below my expectation. I attribute this to two factors. First, as I'm sure Bale was already awareaudiences went in with tremendously high expectations regarding his role. And secondly, with a supporting cast of the caliber involved in this film, it would have been almost impossible to stand out in the same way he did in American Psycho. .For my taste, the only really weak link was the now famous for being Tom Cruise's-EX, Katie Holmes! Before appearing in BEGINS, Ms. Holmes never had a real stand-out role, at least in my opinion, nor really had been in many high profile films. To all fairness to her, though, it wasn't so much that her characterization was extremely lacking as much as that her performance just wasn't up to those of others in this brilliant cast! .To highlight the very best that Batman Begins shows us, unlike almost all movies in this genre, its characters are anything BUT black and white. Just as in real life, almost all of them evolve in a kind of constant metamorphosis, responding and interacting with lady luck, day to day life events, and reactions from those around them! And they do it most convincingly, not the least bit far-fetched. .Before rushing out to see it, just a little warning. For those who yearn for Action-packed blockbusters, Begins might leave you feeling somewhat unfulfilled! And for those who crave really intense human drama, since, at the end of the day, this is still a comic book \"super-hero\", not some conflicted politician, or not even anything closeLet's try to keep things in perspective, O. K.? In conclusion, if you have EVER seen any film based on a comic strip that you have liked in the past, then don't hesitate to see Batman Begins...I guarantee you'll be rating it at least 7 STARS!10********** SuperHero *Stars*...ENJOY! / DISFRUTELA!Any comments, questions or observations, in English o en Español, are most welcome!......"
    },
    {
      "username": "Doylenf",
      "userUrl": "https://www.imdb.com/user/ur1048771",
      "reviewLink": "https://www.imdb.com/review/rw1108575",
      "warningSpoilers": false,
      "date": "21 June 2005",
      "rate": "10",
      "helpful": "61 out of 75 found this helpful.",
      "title": "Let's get serious...the real Batman has arrived!...",
      "content": "BATMAN BEGINS lives up to what I heard about it being a \"darker\" version, with much less reliance on flippant one-liners or gags, the result being a more realistic feel for what might have been.From the very start, there is a nice chemistry between Alfred, the butler (superbly played by Michael Caine) and Bruce Wayne (excellent job by Christian Bale). The humor is of the gentle kind, almost subtle in its implications, and it sets the stage for the more realistic flow of events to follow. There's a pulsating background score by Hans Zimmer and John Newton Howard that races along with the film, punctuating it in just the right places, at just the right moments, to give a vigorous punch to the action scenes. And there are plenty of them.But the quieter moments are all extremely well played and given depth by real characterizations--not just cartoonish figures. There is depth in all of the performances with the possible exception of Katie Holmes, an actress who speaks in a voice barely above a whisper and fails to project the belief that she is an assistant district attorney. Miss Holmes needs lessons in projecting her voice.Looming over the landscape is Liam Neeson, a distinguished actor who excels in his carefully concealed villainy. He is a force to be reckoned with and displays all of his versatility here. Equally effective in lesser roles are Morgan Freeman, Rutger Hauer as the Board Chairman that Bruce Wayne ultimately replaces, and Gary Oldman.The story is forcefully presented with magnificent visuals and eye-popping sets that all have a realistic gleam and are yet stylized enough to give credence to the fact that this is all based on a comic strip character.I can't praise Christian Bale enough as the man who dons that mask. He has all the strength and wily intelligence behind his serious good looks and makes the perfect embodiment of the action hero he is portraying. Firm of jaw, direct of gaze, he makes an excellent hero.Praise too for Cillian Murphy, who makes the most of his Scarecrow role behind a mask of creepy blandness, underplaying his role (as most of the others do) so as not to become a caricature, as so often happens in these Batman enterprises. If it's a series of running gags that you expect--as from previous Batmans--you won't find them here. The thrills come one after another, set pieces that are astounding to watch.Well worth the wait. Christopher Nolan has done an excellent job of handling his subject matter with great skill and flourish. Warning note: Perhaps a little too intense for children, but adults are certainly going to appreciate the fact that the real Batman has arrived."
    },
    {
      "username": "marshall_web",
      "userUrl": "https://www.imdb.com/user/ur2552805",
      "reviewLink": "https://www.imdb.com/review/rw1399745",
      "warningSpoilers": false,
      "date": "22 June 2006",
      "rate": "10",
      "helpful": "172 out of 183 found this helpful.",
      "title": "Nolan is the real superhero",
      "content": "To tell the truth, I thought the Batman franchise could never be saved, and I was really let down that I may never see my favorite superhero in a good movie ever again. Then I saw the preview to Batman Begins, I didn't really know what to think. New Batman. New Alfred. New story. New style. I wasn't sure why I wanted it 'the old way', but maybe I wanted to the actors in the Batman films I grew up with, to revive themselves and make a good Batman movie. I wanted Robin and sadly, Batgirl, alongside Batman saving the world from another familiar villain.I heard Batman Begins, and I thought great, this was called \"Batman\" in 1989, selfishly I said, \"I want something new!\".But, of course being a big Batman fan, I went opening night to Begings. 2 and half hours later, like the rest of the audience was completely blown away. It was the only movie I had ever been to (and yes I have been to some great ones) where the crowd claps and the end. This was not just golf claps for a popcorn clip, this was a standing ovation for 10:30 pm show in a crowded theater in Austin, Texas.I never would have thought this would have worked, even with Nolan directing. But I was wrong, so wrong. After seeing the X-Mens and Spidermans, I clearly thought Marvel had the upperhand and DC was just simply trying to keep up, again, so wrong.Nolan gave us a dark, gritty, and pleasantly realistic, view of Batman. Bale gives a tremendous performance as both Batman and Bruce Wayne. Michael Caine was a fabulous Alfred, and Morgan Freeman almost stole the show as Luscious Fox.Even though X-Men and Spiderman(all of them) are wonderful superhero movies, Batman Begins, is just a good, no, great movie. And I think that is what blew people away, that it wasn't just some superhero, special effect, hero gets girl, good guy wins movie, it was a truly dark and well crafted movie, and it maybe stupid to say, but it didn't even feel like you were watching a superhero movie.I don't even think Burton, and his animated style(which works), could have revived this troubled series, that Schumaker wrecked, because like Fantastic Four and Daredevil, tried over do it and give us the latter part of things.So, here is to you Chris Nolan. You saved a franchise. You made an unforgettable movie, that will be remembered as the best superhero movie of all time, but just an all around great and unforgettable movie classic."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2263252",
      "warningSpoilers": false,
      "date": "12 June 2010",
      "rate": "9",
      "helpful": "19 out of 22 found this helpful.",
      "title": "A Batman that is stylish, dark and gritty- simply brilliant!",
      "content": "My only criticism of this otherwise brilliant movie is that it is a little too long. But it is an extremely good film, that along with the original Batman could very well be the best of the Batman films(thought perhaps just lacking the original film's sophistication). People may find this blasphemy, but I did prefer this over The Dark Knight, but that was still very good. Christopher Nolan's Batman Begins is stylish, dark and gritty, pretty much what Batman should be. I have seen complaints that the film \"contradicts\" the 1989 film. Perhaps so, but what I can say in the film's defence is that Batman Begins is sort of a very loose prequel to the original movies.Visually, Batman Begins looks absolutely incredible! It could very well be the most beautiful visually of the Batman films, with beautiful cinematography and a simply dazzling view of Gotham City itself. Another asset I appreciated was that the music score didn't overpower the action, in fact it gave some atmospheric flavour to it. As much as Danny Elfman's scores were outstanding and definitely memorable, Hans Zimmer and James Newton Howard do a great job with the score.The script is taut and well-written with lines that really make you think along with some occasional offbeat humour, the plot isn't convoluted or predictable but original, the film moves briskly(the second half was marginally better in terms of pacing to the first half though but that is in no way a flaw) and the action is explosive particularly the climax and the bat-mobile car-chase. Also Christopher Nolan's direction is excellent.The acting, aside from the visuals is what drives the film. Christian Bale is for me the best Batman since Michael Keaton. In the role of Batman he is suitably dark and brooding, like Batman should be, and as Bruce Wayne, he is dashing, handsome and ambitious. Katie Holmes actually surprised me and in a good way. She wasn't bland or annoying, I actually found her sympathetic and surprisingly good. Liam Neeson is also very good, though he has been better, while Michael Caine is perfect as Alfred. Cillian Murphy, Tom Wilkinson and the excellent, underrated Gary Oldman are also solid in their roles, while Morgan Freeman is wonderful as always.Overall, a brilliant film that is visually stunning, gripping and atmospheric. 9.5/10 Bethany Cox"
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw1386412",
      "warningSpoilers": false,
      "date": "5 June 2006",
      "rate": "9",
      "helpful": "12 out of 13 found this helpful.",
      "title": "By far the most intense of them all",
      "content": "I've seen all the Batman movies. Most aren't that deeply lodged in my memory. I know that the scene stealers in most of them are the villains. This movie puts it on the strong shoulders of Bruce Wayne/Batman. The movie is about him and his ghosts and his baggage. It is about a man coming to grips with immense guilt. It goes into great detail to explain to us how Batman came to be. It has verisimilitude. The bad guys are, of course, really exaggerated in their evil plans. Everything is neatly plotted. There is fragility in both the character of Wayne and the city he and his family loved. Organized crime abounds and he must face it pretty much alone. I was quite impressed with Inspector Gordon (Gary Oldmann). He was believable and fragile, yet committed to what was right amidst a culture of evil (even on the police force). Like is so often the case, I can't speak for the people who know these comics so well that they fall into depression when a movie doesn't follow their dictates; yet, I really was involved in this. This is quite an all star cast with excellent direction with a bleakness that Tim Burton also did well. I think it was one of last year's best films."
    },
    {
      "username": "BigHardcoreRed",
      "userUrl": "https://www.imdb.com/user/ur0762960",
      "reviewLink": "https://www.imdb.com/review/rw1104382",
      "warningSpoilers": false,
      "date": "16 June 2005",
      "rate": "",
      "helpful": "485 out of 630 found this helpful.",
      "title": "DC Finally Got It Right. This Is A Grittier And Darker Batman Story",
      "content": "Batman Begins is a well told story of the origin of Bruce Wayne/Batman (Christian Bale). It covers a lot of the same ground as Michael Keaton's original Batman, but goes much further in depth in many factors of his creation. It goes into great detail about subjects such as how he got his costume, what exactly it is. Same goes with the Batmobile. We also find out why he chose to be bat-like.One of the more interesting aspects here is how it shows Bruce's father, Thomas Wayne (Linus Roache), and how he molded Bruce's life and instilled good judgment within him, a point which is misunderstood about him by most people he comes in contact with. Thomas, too, teaches Bruce valuable lesson, such as \"We fall so we can learn to pick ourselves up\". This is pretty close to the theme of the movie or motto Bruce Wayne lives by. The resemblance of the father & son is pretty good, too.I also thoroughly enjoyed the training Bruce Wayne endured becoming \"invincible\". Bruce is trained by Ducard (Liam Neeson) in many ways like a ninja (The concept of Batman IS similar to a ninja). He is taught many valuable lessons in this temple and is shown no mercy. Eventually, we even see his first real enemy as a superhero/vigilante.Although I am not positive as to how true to the comic book this movie is, I am sure it took a few liberties, as did Spider-Man. Most of the small examples I have noticed are for the better and make for a good story. The Batmobile is more believable as an expensive armored vehicle that the military would not spend the money on than a juiced up Corvette (or whatever that was). Same with the Batsuit.Katie Holmes is excellent as Rachel Dawes, a D.A. who is not afraid to go after the big villains in court. Also worthy of mentioning is Michael Caine as Alfred the butler. I do not believe they could have found a better man for that role, although I could not get the image of Caine as Austin Powers' dad out of my head when he was on screen.Finally, in my opinion, Christian Bale makes a much better Batman than the three recent previous ones in Michael Keaton, Val Kilmer and George Clooney. Something about him makes Batman darker and more mysterious. Hopefully, DC Comics and movies have learned from their mistakes and we will not have to worry about Batman picking up a sidekick in this newest installment of the Batman series. 9/10"
    },
    {
      "username": "mjw2305",
      "userUrl": "https://www.imdb.com/user/ur3174947",
      "reviewLink": "https://www.imdb.com/review/rw1290960",
      "warningSpoilers": false,
      "date": "13 February 2006",
      "rate": "9",
      "helpful": "13 out of 14 found this helpful.",
      "title": "And i thought the Combination of Tim Burton and Michael Keaton was as good as its gonna get?",
      "content": "I loved Batman and Batman Returns, Tim Burton's direction and Michael Keaton's Batman were really good, and seemed to be the best we were ever going to get.I'm glad to say that i was wrong, Christopher Nolan has taken the character of Batman to the very beginning, fleshing out the characters of both Bruce Wayne and Batman down to the finest details. Nolan's use of realism in the creating the Batman character makes him more believable than ever.Christian Bale quite simply personified the character of Bruce Wayne/Batman and actually puts everyone else's portrayal in the shadows. Bale is supported by a wonderful cast, including Michael Caine, Liam Neeson, Katie Holmes, Gary Oldman, Morgan Freeman and more, but i found Cillian Murphy's performance as Dr. Jonathon Crane to be one of the finest in the movie.Overall Batman begins is an very honest, detailed and compelling adaptation of the Batman character, that is worthy of the recognition it has received. For Bat fans and movie lovers alike; this is a must see.9/10"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2935361",
      "warningSpoilers": false,
      "date": "4 January 2014",
      "rate": "8",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Good start to Nolan's trilogy",
      "content": "Director Christopher Nolan is rebooting the Dark Knight with a ever darker style. It is faux realism. He starts off with the death of Bruces' parents. After not able to kill their killer, Bruce is in a Chinese prison where he meets the mysterious Ra's Al Ghul. It is the anti-Obi-Wan Kenobi. His message is a dark perversion of Justice. When he returns to Gotham, he invents Batman.There are two things that keep this from an even more impressive start of Nolan's Batman Trilogy. The first is Katie Holmes. She is not up to the task. She is still playing that little girl character from Dawson's Creek. She doesn't have the seriousness or gravitas to play this gutsy lawyer character. It's a big character, and not just another girlfriend.The second is that Scarecrow (Cillian Murphy) isn't a big enough villain. The evil plan has too much of a silly Bond feeling. It is too unrealistic in a Batman movie that is suppose to be realistic. It leaves a bad taste for the climatic ending. Other than those two, this is still a great start to the trilogy. It sets the tone for the final two."
    },
    {
      "username": "colm-hearne365",
      "userUrl": "https://www.imdb.com/user/ur22074254",
      "reviewLink": "https://www.imdb.com/review/rw3342302",
      "warningSpoilers": false,
      "date": "24 October 2015",
      "rate": "10",
      "helpful": "32 out of 38 found this helpful.",
      "title": "The best and most underrated in the Dark Knight Trilogy",
      "content": "Eight years after the infamous abomination Batman & Robin that killed the Batman franchise, Christopher Nolan stepped in and started a whole new series a darker (even darker than the first two Tim Burton Batman movies) and realistic level. Now at first, I wasn't mad on Batman Begins because at first I thought it was boring and it took a while to get to the part where Bruce Wayne becomes Batman. But after a while, I loved the film. In fact, it turned out to be my favourite Batman movie even though I really like the first two Batman movies by Tim Burton. I really like how we get to see the origins of Batman like the tragic death of his parents and becoming a martial arts expert in somewhere in Asia. Also I think it's clever how they made Batman act like a ninja than a superhero. Christian Bale is really good and intimidating as Batman but I think he's not as good as Michael Keaton's Batman. But also I think the rest of the cast did very well like Katie Holmes, Liam Neeson, Michael Caine and Cillian Murphy. But I can't understand why Katie Holmes was nominated for a Razzie for Worst Supporting Actress. I liked her as Rachel and she was a lot better than Maggie Gyllenhaal; not to mention better-looking. It's too bad The Dark Knight and The Dark Knight Rises weren't as great as Batman Begins. I mean I think The Dark Knight is really overrated. I mean most people seem to be overglorifying it just because of Heath Ledger's performance as the Joker and his death. But The Dark Knight Rises was brilliant and gave a nice ending to the trilogy but I don't think it wasn't as fresh as Batman Begins. By the way, happy birthday to the creator of Batman, the late Bob Kane!"
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5478835",
      "warningSpoilers": true,
      "date": "12 February 2020",
      "rate": "",
      "helpful": "15 out of 18 found this helpful.",
      "title": "Batman",
      "content": "We waited for years to get a new and better \"Batman\" movie than the one we got back in 1997 with \"Batman & Robin\" which was a complete disaster. This movie is probably the best of all the \"Batman\" movies to ever be released. Christopher Nolan reinvents this iconic character in the most humane way we have ever seen the character in before. It's also the greatest way we have ever seen. Christian Bale is a very good Batman, but I don't believe in his judgment all the time, taking a scene where he is about to kill a man, but fails when the same man is killed by another assassin. I didn't really get his full emotion in that scene, but he is still very good. Liam Neeson is the best villain for Batman to take on as he inhabits the iconic villain Ra's al Ghul who we all know from the comicbooks. This is a great movie that I can't help but love even more every single time I watch the movie."
    },
    {
      "username": "ivo-cobra8",
      "userUrl": "https://www.imdb.com/user/ur15140057",
      "reviewLink": "https://www.imdb.com/review/rw3372664",
      "warningSpoilers": false,
      "date": "16 December 2015",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Rebirth Of A Legend - The greatest reboot of an origin story!",
      "content": "Batman Begins (2005) is actually great reboot of The Dark Knight trilogy and a start of the origin tale of Batman, but is not the best one in the series, that will be The Dark Knight (2008). Batman Begins is strayed from the comic books. My DC comic super hero on a 1st rank will always be Batman I always love Batman from comic books, cartoons and movies more than other superheroes. The first time I saw this movie, I didn't like it because I thought, it was boring and I didn't got the story. I grew up with Batman (1989) Michael Keaton and I did too loved much more than this one. But than I kept watching and watching it and I fall in love it, It always entertained me. In my opinion Christopher Nolan's and Burton's Batman are all great movies. If it weren't for its amazing sequel this would be the greatest superhero film ever made. The film that started it all... a Batman film but with a more realistic, gritty and original approach. If your a fan of Batman and you haven't seen this you are going to LOVE every minute. It is smart, innovative, awe-inspiring and for a bat-fan, iconic. Christopher Nolan focuses on the origin and story behind a man standing against justice rather than the quirky early attempts. Its just a shame that this isn't as popular as The Dark Knight because it deserves the glory just as much. If your new and you've only just seen TDK, watch this purely because it catapulted this reinvention of a hero to great heights. TDK has the rise of The Clown Prince Of Crime and the escallation that was inevitable. Batman Begins has the creation of Batman and the lengths of which he had to go in order to combat injustice in a city that did not know justice. Watch this, it is a classic. What I like in Batman Begins is the origin story. I like that the movie focus on a comic book movie sadly Burton Batman doesn't follow on Batman origin story but follows more Joker story and I didn't pay for this movie to see Katie Holmes but naked and to be laid I am glad he didn't do that don't get me wrong but I don't like action hero's that always, always get a girl at the end of the movie and get laid I hate that! I am glad this was the beginning of Batman and the film took a different turn. Bruce Wayne (Christian Bale) did not get laid or get the girl once. I love this movie and I am true Batman fan I always was more Batman fan than a Superman fan. Bruce Wayne being trained and been ninja the long path how he become Batman the fighting the suit the climbing the wall. Car chases, action sequences are awesome! The actors: Christian Bale is an excellent darker Batman. He acted perfectly his role as Bruce and Batman the same time. I love Liam Neeson I think that actor did a wonderful convincing performance as Ducard/Ra's Al Ghul. He deserve a credit for his role that this movie redeem it self. Liam Neeson was terrific awesome convincing actor. This role was one of the reason why I become Liam Neeson fan and I enjoy his new action thrillers: Taken, Walk Among the Tombstones , Non-Stop, Taken 2 and Unknown. Rutger Hauer was awesome did you know he had a small role in comic book series Smallville? He was in Season 3 Episode 1 & 2. Cillian Murphy was great as Scarecrow! I love him and Tom Wilkinson was awesome too! Gary Oldman was amazing as Jim Gordon.Things I don't like in this movie: Batman Begins was really slow, the first hour of the movie was boring and really dramatic. The fighting sequence in this movie were shot to close with camera so we barely see a any fights between Batman and Ra's Al Ghul. Bruce Wayne blamed him self for his parents death. It wasn't his fault! The murder of his parents was too much dramatic too much for my eyes and Katie Holmes sadly I don't like her in this movie I would replace her with Maggie Gyllenhall or any other actress. I thought Maggie portrayed Rachel Dawes much better and made a better job in the sequel than Katie Holmes did. The fight between Batman and Ras' Al Ghul on a train I don't like it. Because the fight scene is too close, you can barely see who hit's who. That is the thing, that bothers me the most in this movie. The fight scenes in Burton's Batman are so much better, awesome than in Christopher Nolan's Batman and he could have made the fights scenes believable like Burton did. Peace <3./: I love this movie and it is a 9 by me. Batman Begins is a 2005 epic superhero film based on the fictional DC Comics character Batman, co-written and directed by Christopher Nolan9/10 Score: A- Studio: Warner Bros, Legendary Pictures, DC Comics Starring: Christian Bale, Michael Caine, Liam Neeson, Katie Holmes, Gary Oldman, Cillian Murphy, Tom Wilkinson, Rutger Hauer, Ken Watanabe, Morgan Freeman Director: Christopher Nolan Producers: Charles Roven, Emma Thomas, Larry Franco Screenplay: Christopher Nolan, David S. Goyer Story by David S. Goyer Based on Characters appearing in comic books published by DC Comics Rated: PG-13 Running Time: 2 Hrs. 20 Mins. Budget: $150.000.000 Box Office: $372,710,015"
    },
    {
      "username": "paul_haakonsen",
      "userUrl": "https://www.imdb.com/user/ur22654354",
      "reviewLink": "https://www.imdb.com/review/rw3372531",
      "warningSpoilers": false,
      "date": "16 December 2015",
      "rate": "6",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Better the second time around...",
      "content": "The first time I watched \"Batman Begins\" I can't really claim to have been overly impressed with this origins story, and I remember finding the characters sort of plain and the story equally so.Now, several years later, watching the movie on TV, I am a bit surprised to say that the movie is actually a lot better this time. And the storyline actually had more depth and flavor than I remembered.Christian Bale is unquestionably the best chance for portraying Batman and Bruce Wayne, and manages to take the character and his performance one step further with each successive movie.The characters in the movie were adequate, although the Scarecrow character wasn't really fully utilized, nor given as much time on the screen as I would have liked. And Cillian Murphy was an interesting choice of actor for this role; not a bad choice, mind you. Gary Oldman and Michael Caine are also excellently cast for their roles.Chris Nolan also turned out to be the director with the most interesting approach to directing Batman movies."
    },
    {
      "username": "daniel-johnston",
      "userUrl": "https://www.imdb.com/user/ur9844177",
      "reviewLink": "https://www.imdb.com/review/rw1340305",
      "warningSpoilers": false,
      "date": "13 April 2006",
      "rate": "9",
      "helpful": "37 out of 41 found this helpful.",
      "title": "Batman has truly begun!",
      "content": "To start off this review I'd like to go back to the original batman series. Adam West hammed it up in what has to be the campest yet enjoyable version of batman. It was cheesy, it had the POW, WHACK, KABOOM, very very tongue-in-cheek which, brings me to my next point, is what batman eventually became. Batman, featuring Michael Keaton was a good film, keaton was a good batman, he portrayed the dark knight to a whole new army of fans, a darker batman, less camp, plus with a villain such as Jack Nicholson (turning in another great performance) as the Joker it was win win. Where from there? A sequel, Keaton yet again, Batman Returns, not as good as its predecessor but still a thoroughly enjoyable film with the villains being Penguin (Devito) and Catwoman (Pfeiffer) adding something different to the batman series. All is going well, then things start to go sour. Keaton is gone and in comes Kilmer who has to be the most wooden Batman ever, in come the clichés, the tongue in cheek one-liners and so on but Batman still has some credibility until, dare I mention it, Batman & Robin. This ruined the Batman series with Clooney just being the eye-candy for the ladies, the addition of Batgirl (oh dear Lord) and the villains just coming out with the most tongue-in-cheek one liners ever, example Mr Freeze \"You're not sending me to the cooler\", wrong, oh so wrong. Something had to be done and this was Batman Begins. This film rescues the Batman series single-handedly, it's a shame it didn't start off this way as it might not of died on it's rear. Bale is an inspired choice as Batman bringing a more serious side to Batman, the story is well paced, it's not all talk or just mind-numbing action, it actually keeps you gripped as you want to find more about Bruce Wayne's past. The only reason it misses out on a 10 is the quite pitiful bad guy scarecrow If you've not seen it I don't want to give too much away about the story but throw away all your perceptions about Batman because Batman is back and Batman has truly begun. D-man."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1404700",
      "warningSpoilers": false,
      "date": "28 June 2006",
      "rate": "10",
      "helpful": "26 out of 37 found this helpful.",
      "title": "Outstanding Batman 'Prequel'",
      "content": "This latest Batman film disappointed a lot of people....but not me. I appreciated it because they didn't overdo the violence, didn''t have a stupid romance angle to muddy up the real story, and fount it an interesting history of how Batman became Batman. The first hour of this \"prequel\" dealt with his origins. If you're a fan of the comic book stories and the other Batman films, this part in the film should not bore you. It was like a documentary to me, about a topic I was interested in. In fact, on the second viewing I enjoyed this even more.Christian Bale did a fine job as the latest Batman. It's too bad there have been so many actors playing this role, ruining the continuity of this latest series. I hope Bale continues with a few more efforts with this character.It was nice to see Michael Caine in the role of \"Alfred.\" He was excellent and the stabilizing force of the story. Katie Holmes did not have anywhere near as big a role, or romantic one, as I expected, and that was fine with me. I just enjoyed looking at her face, leaving it go at that. Gary Oldman was also interesting as a low-key young detective Gordon who would go on to become Commissioner Gordon in all the other episodes (but, once again, played by another actor.)The film ends with what would be the beginning of the first Batman, featuring \"The Joker.\"After having seen all the Batman films several times, I now think is the best of them all....perhaps an unpopular choice, but that's my opinion. Don't let the naysayers keep you from watching this movie. You might be missing the best of the Batmans!"
    },
    {
      "username": "bobsgrock",
      "userUrl": "https://www.imdb.com/user/ur9972457",
      "reviewLink": "https://www.imdb.com/review/rw1912810",
      "warningSpoilers": false,
      "date": "18 July 2008",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "The start of something truly spectacular.",
      "content": "This is certainly, without question the best Batman film ever made, although that isn't saying much. Christopher Nolan makes this into a very dark and brooding tale that tells more about Bruce Wayne than Batman, something the other movies would never have done. Nolan is a great director and he takes a great leap of faith by showing perhaps the most important screen superhero in such a way that the city of Gotham and its components don't feel like taken from a comic book, but from real life. Batman Begins is based more on graphic novels and the original characters by Bob Kane, so the realism and details are there without all the fluff and showboating Joel Schumacher would have put out. Christian Bale is perfect as the title character and he creates a more interesting Bruce Wayne than Batman only because we see more of Wayne in this installment. All other roles are perfectly cast, especially Liam Neeson as a mysterious yet intelligent and brutal member of the League of Shadows. Katie Holmes is nice and sweet as Wayne's childhood friend, and there will never be another Alfred as long as Michael Caine resides.Simply put, Batman Begins is worth the time and money. It pulls you into a world you would never expect to see in a Batman movie, than transports you to Gothan City, the rotting core of it mostly. When we do get a glimpse of Batman, it really is quite different than other interpretations. The action here is based more on suspense than violence and the plot moves along quite well to make this movie feel shorter than its 140 minute running time. So, if you are going to see The Dark Knight this weekend, be sure to check this out first. Indeed, if it is anything like this one, this franchise is going somewhere truly spectacular."
    },
    {
      "username": "streetsmarts101",
      "userUrl": "https://www.imdb.com/user/ur5607415",
      "reviewLink": "https://www.imdb.com/review/rw1097419",
      "warningSpoilers": false,
      "date": "6 June 2005",
      "rate": "10",
      "helpful": "917 out of 1,140 found this helpful.",
      "title": "Finally!!!",
      "content": "I got a chance to see 'Batman Begins' just this past Friday evening. I must say that before seeing the film, I felt in my heart this is the 'Batman' film we've been waiting for. Within ten minutes into the movie, I turned to my date and said to her, \"This is it! This is the movie!\" I just can't believe that after all these years, Warner Bros. finally got it right. For me the most intriguing part of the film, apart from the great script, and great acting, was Christopher Nolan's decision to base the film in reality. Deciding that Batman could really exist in our universe and our world was a stroke of genius. Another aspect of the film that's so refreshing is that instead of the focus being on the villain, Batman is the film's star. And rightly so. It's amazing what can happen when a studio leaves a respected director, and the creative team alone, and allow them to make the best movie possible. The only two negatives that I can think of is Katie Holmes and the fight sequences. Holmes does indeed look like a teenager playing grown-up. Her performance isn't bad per SE, it's just that you really don't buy her as an Assistant D.A. As for the fight sequences, I felt the cameras angles were too tight on the action, edited too quickly, and lit too dark so that you really couldn't tell what was going on and determine who was hitting who. Maybe we can attribute this to the fact that Nolan is not an action director. Hopefully the next film will open up the fight sequences so we can actually see Batman use the martial arts skills he developed during his exile. But apart from those relatively minor quibbles, the film is excellent, and I'm definitely going back on opening day June 15th, and seeing it a second time. A third and fourth viewing is definitely not out of the question."
    },
    {
      "username": "gavin6942",
      "userUrl": "https://www.imdb.com/user/ur1234929",
      "reviewLink": "https://www.imdb.com/review/rw1169365",
      "warningSpoilers": false,
      "date": "10 September 2005",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Batman Begins Again - This Time With a Vengeance",
      "content": "Anything I say about this film will sell it short. I was originally skeptical when I saw the Urban Assault Vehicle in the trailer, but my fears were calmed when I saw it in context. Everything about this film is perfect - the acting, the directing, the mood, the plot, and all else. It is rare to see such intricate storytelling mixed with bone-shattering intensity in the action department. And fans of the comic will not be disappointed with this apt translation.I hope Chris Nolan directs all future Bat-movies, because his lighting and architectural canvasing was so perfect, it outdid Tim Burton's interpretation (which I previously thought impossible). As of this review, IMDb has rated the movie #117 of all time, and I agree completely. This film has universal appeal. Christian Bale is perfect as Bruce Wayne, Katie Holmes actually acts for once in her career, Liam Neeson is the quintessential villain. Other stars shine brightly. I can only hope that Crispin Glover becomes the Joker in the sequel. Highest possible recommendation..."
    },
    {
      "username": "freemantle_uk",
      "userUrl": "https://www.imdb.com/user/ur17571044",
      "reviewLink": "https://www.imdb.com/review/rw1839258",
      "warningSpoilers": true,
      "date": "13 March 2008",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "The best Batman film so far",
      "content": "This is the best Batman film so far. I enjoy for the fact that it was psychological and takes the most realistic approach possible. This was because the director Chris Nolan is known for making psychological thrillers, and he also only used CGI when needed, he made the film using stunts and keeping the action down to earth.The film focuses on Bruce Wayne becoming Batman and looks at the psychology of the man. It showed his personal angst and fears and how he used it to fight crime. The starts with a flashback of Bruce and his friend Rachel Dawes as children before seeing Bruce in a Chinese prison, aiming to understand the mind of criminals. Fear was a major theme. Bruce Wayne as Batman wanted to cause fear within criminals in Gotham, whilst the Scarecrow used fear as a weapon. Bruce's relationships are also looked at. In the film he is emotionally stunted because of the murder of his parents. It shows that he has few friends, Alfred, he was a father figure to him, Lucius Fox, who helps Bruce become Batman, Sgt. Gordon who is one of the few good cops in Gotham and Rachel, Bruce's love interest.As well as showing Bruce/Batman as a more realistic human, Nolan takes great care to show how it was possible for someone to become Batman. The equipment used in the film is down to earth and not out the realms of possibility and the Batmobile looks like a real vehicle. I hated the 1960s programme of Batman, I really disliked the camp in it and I hated the silliness. I didn't like Batman Forever or Batman and Robin (that one was laughably bad). The Tim Burton version was better, but I still felt like a cartoon. However Batman Returns is a good film in it's own right. I liked that fact that Gotham looked like a city, namely because it was filmed in Chicago, but I felt it was just right for the film.The film also had an excellent case, and I personally enjoyed the British/Irish favour to it. Christian Bale was brilliant as Batman, Michael Caine was good as Alfred. Gary Oldman, an actor I've always liked played Gordon who grows as a character in the film. Tom Wilkinson, Liam Neeson and Cillian Murphy were good as the villains. Morgan Freeman, one of the felt Americans to have a major part was also had a fine performance as Fox. The only person I had a problem with was Katie Holmes, but it was only because I thought she was too young to be playing a Deputy DA, not because she was a bad actress. I think Maggie Gyllenhaal should be more suited for the role in the next film.The film also has the feeling of it being like Batman: Year One by Frank Miller. It is not a carbon copy of the Graphic Novel, but it is very similar and the ending is lifted from the Graphic Novel. Year One also set out to show Batman's origins and show how it could have been possible. Batman Begins in my opinion was also influenced by the first two X-Men films which tried to take the most realistic approach possible. They is also a trend in Hollywood for taken the realistic approach, such as Casino Royale, Lord of the Rings (as in the battle scenes) and the Bourne Trilogy.I can't wait for The Dark Knight to come out in the cinema."
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw1838929",
      "warningSpoilers": false,
      "date": "13 March 2008",
      "rate": "",
      "helpful": "12 out of 16 found this helpful.",
      "title": "Very Good",
      "content": "Batman Begins (2005) *** 1/2 (out of 4) Hooray, I finally enjoyed a Batman movie. Everything wrong with the previous four films is corrected here and since this movie got everything right I can now forget the first four films and just hope future sequels contain the same level of darkness, character and story development. What I enjoyed most about this film was that the characters were so well written and the Bruce Wayne character was given just as much strength as his Batman ego. I wasn't sure what to expect from Christian Bale but I'm glad the director kept his darkness and didn't try to lighten him up as an actor. The supporting players were also very well acted with a cast to die for. Liam Neeson, Michael Caine and Morgan Freeman are serious actors and they helped bring some seriousness to this comic book tale. It was also great seeing Gary Oldman playing a good guy. I always love rooting for his villains so rooting for him as a good guy just added more charm to the film. The only real weakness I found with the film was the poison gas, which just never really grabbed me as anything too interesting."
    }
  ],
  "errorMessage": ""
}