{
  "imDbId": "tt0066921",
  "title": "A Clockwork Orange",
  "fullTitle": "A Clockwork Orange (1971)",
  "type": "Movie",
  "year": "1971",
  "items": [
    {
      "publisher": "Austin Chronicle",
      "author": "Marjorie Baumgarten",
      "link": "https://www.austinchronicle.com/gyrobase/Guides/Film/?Film=oid%25253A138050",
      "rate": "100",
      "content": "A chilling classic, the movie is a scabrous satire about human deviance, brutality, and social conditioning that has remained a visible part of the ongoing public debate about violence and the movies."
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "Kubrick's liberal, anti-authoritarian reading of Anthony Burgess's very Catholic allegorical novel is morally confused but tremendously powerful... No serious moviegoer can afford to ignore it."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "100",
      "content": "It demands thought, compels the attention, and refuses to be dismissed. And, for that reason, A Clockwork Orange must be considered a landmark of modern cinema."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Gene Siskel",
      "link": "",
      "rate": "100",
      "content": "Kubrick's contributions are his wit and his eye. The wit, too much at times, is as biting as in \"Dr. Strangelove,\" and the production, while of another order, is as spectacular as in \"2001.\" [11 Feb 1972]"
    },
    {
      "publisher": "Empire",
      "author": "Kim Newman",
      "link": "",
      "rate": "100",
      "content": "A much-maligned and misunderstood classic, this is one of Kubrick's finest movies."
    },
    {
      "publisher": "The New York Times",
      "author": "Vincent Canby",
      "link": "https://archive.nytimes.com/www.nytimes.com/library/film/010972kubrick-orange.html",
      "rate": "90",
      "content": "It seems to me that by describing horror with such elegance and beauty, Kubrick has created a very disorienting but human comedy, not warm and lovable, but a terrible sum- up of where the world is at... Because it refuses to use the emotions conventionally, demanding instead that we keep a constant, intellectual grip on things, it's a most unusual--and disorienting--movie experience."
    },
    {
      "publisher": "Variety",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "A brilliant nightmare... The film employs outrageous vulgarity, stark brutality and some sophisticated comedy to make an opaque argument for the preservation of respect for man's free will - even to do wrong."
    },
    {
      "publisher": "Village Voice",
      "author": "Michael Atkinson",
      "link": "",
      "rate": "80",
      "content": "The first punk tragicomedy, a chain-whipped cartoon meditation on Good, Evil, and Free Will that is as seductive as it is tasteless. That Kubrick misjudged the distance between comedy and cruelty seems to be unarguable."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "50",
      "content": "It is just plain talky and boring. You know there's something wrong with a movie when the last third feels like the last half."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "20",
      "content": "A very bad film--snide, barely competent, and overdrawn--that enjoys a perennial popularity, perhaps because its confused moral position appeals to the secret Nietzscheans within us."
    }
  ],
  "errorMessage": ""
}