{
  "imDbId": "tt0066921",
  "title": "A Clockwork Orange",
  "fullTitle": "A Clockwork Orange (1971)",
  "type": "Movie",
  "year": "1971",
  "items": [
    {
      "username": "Agent10",
      "userUrl": "https://www.imdb.com/user/ur1696608",
      "reviewLink": "https://www.imdb.com/review/rw0115514",
      "warningSpoilers": true,
      "date": "28 April 2002",
      "rate": "10",
      "helpful": "716 out of 937 found this helpful.",
      "title": "One of those films you have to watch multiple times",
      "content": "It's hard to judge a film such as this. Its cold and hard, yet can be exhilarating and sarcastic. It can be average, yet it can be visionary. Exploitive? Satirical? Too many questions to consider when one watches this film.Even after 34 years, this film still speaks volumes about our current culture, which many ideals are ringing true today. The younger generations are out of control due to lack of parental control, junk culture is becoming commonplace, violence is desensitizing the masses, and we all seem to be enjoying the ride on the way down. It's very difficult to find movies which can make such startling commentary, yet hold on to such accusations for an extended period of time. Nowadays, films are focused-grouped to death, conformity is more powerful than artistry, and money is far more important than quality. Kubrick took a huge leap with this film, challenging society to take a hard look at itself. Unfortunately, society wasn't ready for this film, which is why it is revered now more than ever."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw1315267",
      "warningSpoilers": false,
      "date": "14 March 2006",
      "rate": "9",
      "helpful": "53 out of 65 found this helpful.",
      "title": "We Are Seeing Our Future",
      "content": "Having read Anthony Burgess's novel years ago and working my way through the amazingly creative, futuristic dialogue, I really looked forward to seeing the movie. It was not a disappointment. In the hands of Stanley Kubrick, it comes to life. It is the product of the desensitized world that we see unfolding before us in the beginning of the 21st century. There will be a lot of Alexes in the future; there already are. We are slowly moving away from conventional morality and playing with forms of nihilism. Our politics are beginning to diminish the individual rights and safety of our citizens. Our young people are beginning to band together in little covens, the cell phone and the computer creating little worlds where anonymity can lead to diminution of what is good. Pardon my diatribe, but what Alex and his droogs are doing isn't all that out of the ordinary these days. The manipulative, controlling, anything for \"me\" society is just being formed. Kubrick and Burgess had a a vision. Sometimes this movie is called science fiction. The only science fiction thing about it is that it takes place in the future. The violence we see is the violence of those who no longer care what that word means. This whole world is more frightening than the terrorists we see behind every rock. This enemy is us; or the us yet to be."
    },
    {
      "username": "davidmvining",
      "userUrl": "https://www.imdb.com/user/ur110212703",
      "reviewLink": "https://www.imdb.com/review/rw5282735",
      "warningSpoilers": true,
      "date": "26 November 2019",
      "rate": "8",
      "helpful": "39 out of 46 found this helpful.",
      "title": "A great, but hard watch",
      "content": "I've struggled a bit with this film more than any other Kubrick. The problem is that I think I get it too easily, or I don't get it at all. I'm never quite sure.One thing's for sure, it's a hard watch at times. Kubrick, taking Anthony Burgess' novella and running with it, creates a main character so loathsome and charming all at once that it can create a certain dissonance in an audience (Roger Ebert's review of the original release is a fantastic example of a reviewer who simply could not see past Alex de Large as anything other than a celebration of antisocial behavior). The film jumps off the deep end from the very beginning, showing the audience Alex at his most primal and pure, an advocate of the good ultra-violence in charge of three droogs out to cause mayhem and pursue their own pleasures. So unburdened by any existing power structures at any level that Alex can simply get high, beat up other gangs, steal cars, break into houses, rob said houses, and rape women and just crawl back into the bed in his parents' apartment without so much as a serious question from an authority figure. He's not getting caught by the police, so he doesn't care and neither do his parents, so it seems.The introduction of Alex's violence is interesting in its structure. The first incident involves the beating of an old drunk man. It's filmed in shadow to help hide the particulars of the violent act, but it shouldn't endear Alex to the audience. The second, I believe, has an unexpected and subtle effect on its audience. Seemingly just bored, Alex seeks out a rival gang. When he finds them, the other gang is in the process of trying to rape a woman, and in comes Alex whose presence allows the woman to escape. No matter what Alex's intention, one of the direct results of his actions is that a woman is saved from rape. I think there's an unconscious acknowledgement by much of the audience at that which pushes many of them to side with Alex. That is undercut, though, by the next sequence where Alex breaks into the country home, beats an old man (crippling him), and cutting off his wife's clothes (while singing \"Singin' in the Rain\" of course) and, implicitly, raping her. Alex is a monster, but in the middle of our long introduction to him where he intentionally does nothing good, he accidentally does something good. I suspect it has an effect on some people they don't really realize.Anyway, Alex, dealing with some internal strife from his gang led by Georgie, ends up killing a woman and turned on by his mates. He's thrown in prison where, two years later, he is the chaplain's devout assistant. In fact, our introduction to Alex's settled life in prison doesn't really focus on him. The scene is focusing on the chaplain giving a sermon and some rowdy prisoners. Alex is off to the side, manning the projector for when they are to sing. Alex, though, hasn't changed at all. He's modified his external appearance, dressing well in his uniform and studying the Bible, but he only really likes the bits about blood and sex. In his mind, he's still the same depraved monster he was at the beginning.He jumps at the idea of an experimental treatment that promises to get him out of prison early. The treatment is that famous bit where Alex is tied into a chair, his eyes pried open, and he watches horrible things on a cinema screen. Combined with an experimental drug, Alex grows sick at the ideas of three things: violence, sex, and Beethoven's 9th symphony. He's not happy with any of the three, but it's the loss of his beloved Beethoven that hits him the hardest. The very sound of the 9th makes Alex ill and unable to function. It's around these experimental treatments that the chaplain makes explicit (shockingly so in a Kubrick film) that what I consider to be the central idea, \"Goodness comes from within. Goodness is chosen. When a man cannot choose, he ceases to be a man.\"Alex can no longer chose to be bad. To a certain extent, he ceases to be human, and his return home after the successful demonstration of the treatment's effects help solidify this. His family want nothing to do with him. They've rented out his room and can't, for the sake of their boarder, let Alex move back in. Alex finds his former Droogs as police officers after the old man from the beginning of the film attacks Alex while he's incapacitated. The former Droogs nearly drown Alex as he's unable to fight. He's become so dehumanized that he can't even stand up for himself in any way. He ends up required to rely on the kindness of a stranger, the man whom he crippled and whose wife he raped. This man uses Alex's inability to take Beethoven's 9th symphony and drives him to a suicide attempt, casting himself out of the window.Recovering in a hospital, we discover that Alex has been cured of his cure. He's right back to being the antisocial loathsome creature he started the film. The fantasy sequence that ends the film, showing Alex romping with a naked woman to a cheering, Victorian dressed, audience solidifies that.So, is Kubrick saying that Alex's victory is being violent and psychopathic, as Ebert asserted nearly 50 years ago? No, I think Ebert missed the point. The point isn't that curing people of violence isn't a worthy goal, but that the cure needs to originate from within the person. Alex had to want to be changed, and he never wanted to change. He was always looking for ways out of his predicaments in order to get right on with the good ultra-violence. Forcing the change on him dehumanizes him. Better to do what the Chief Guard obviously thought best for Alex, locking him up forever, was probably a better fix.So, that's a thousand words on the film's thematic exploration. After having written it, I feel like I have a greater grasp on the ideas of the film than before, so that's quite nice. I still think that A Clockwork Orange is a second tier Kubrick film, though. I've read the film as a black comedy for a while, and it can be quite funny through that lens. The performances require a certain special mention. I don't think anyone in the film is doing a straight performance. Everything is mannered to such odd degrees, and I love them all. Patrick Magee as Mr. Alexander, in particular, tickles me. It's so off-kilter and perfect for the world yet still so utterly bizarre as to be eminently watchable.It's smart, but I don't think it looks as good as many of his other films. I feel like having the chaplain explicate the movie's central theme twice makes the ideas less interestingly presented. These are relatively minor complaints, but when comparing this to such films as 2001, Barry Lyndon, The Shining, Dr. Strangelove, or Eyes Wide Shut, I have to just say that A Clockwork Orange isn't as successful. Perhaps it will grow on me more with time, but I cannot imagine ever quite loving this movie as much as the listed others with a first act that makes me cringe so much. Yes, it's intentional and successful, but still...that's a hard watch."
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0115800",
      "warningSpoilers": true,
      "date": "25 February 2004",
      "rate": "10",
      "helpful": "240 out of 324 found this helpful.",
      "title": "One of Kubrick's best",
      "content": "To say that the Alex character from Stanley Kubrick's \"A Clockwork Orange\" is unlikable is like saying the Manson family was sort of bad. He's not just unlikable; he's despicable, terrifying, sick, twisted, and ultimately a haunting embodiment of all our greatest realistic fears and worries. But Alex does not see himself as a sick person. The key to this is in his voice-over narrative.Alex does not see himself as a pervert, just as we do not see our own flaws and Ramond Babbitt did not see his own autism. To us, we are all normal, which is a scary thought.\"A Clockwork Orange,\" which was originally released in 1973 after an appeal for an R rating (that was granted after originally being tagged as an X-rated motion picture), had been banned from Britain for close to thirty years. Most film fans in Europe will tell you that they had seen the movie on grainy bootleg videotapes years ago when they were young and curious.But for those of us lucky enough to enjoy (or squirm through) \"A Clockwork Orange\" in its entire odd splendor, it is an experience you are likely to never forget. Its characters, its style, its subject matter, its explicit material--all of it combines to create a marvelous whole that will stay with you long after the credits stop rolling.Essentially a tale focused on Alex's journeys in jail and his process of being re-submitted to the world after inhumane treatments to cure the evil out of him, \"A Clockwork Orange\" is indeed as offbeat as its title.All tales of redemption involve characters that we gradually come to appreciate, or like, or--at the very least--learn to tolerate. Not \"A Clockwork Orange.\" Our narrator remains the same throughout the movie, always an incarnation of everything wrong in today's modern world. He goes through no cleansing process and by the end of the film we like him less than we did at the beginning. That's daring."
    },
    {
      "username": "kevin_robbins",
      "userUrl": "https://www.imdb.com/user/ur131783850",
      "reviewLink": "https://www.imdb.com/review/rw7123672",
      "warningSpoilers": false,
      "date": "15 July 2021",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "This is an all time masterpiece",
      "content": "A Clockwork Orange (1971) is a movie I recently rewatched on HBOMAX. The storyline follows a little gang of misfits who travels the streets of England causing chaos through their random acts of violence. When they cross each other one night trying to establish a leader the direction of the gang and leader of the gang changes permanently...this movie is directed by legend Stanley Kubrick (The Shining) and stars Malcolm McDowell (Halloween), Patrick Magee (Zulu), Michael Bates (Patton), Warren Clarke (Firefox) and Adrienne Corri (Bunny Lake is Missing). This story from beginning to end is absolutely captivating. The sets are eccentric and unique. The dialogue is brilliant as the terminology is entertaining and well delivered. The acting by McDowell is all time great. One of my favorite all time performances. The circumstances throughout the film are horrifying, hilarious, intense and unpredictable all at the same time. The cinematography within the film keeps your mind turning throughout. This is an all time masterpiece that is an absolute must see and a 10/10."
    },
    {
      "username": "nycritic",
      "userUrl": "https://www.imdb.com/user/ur0384847",
      "reviewLink": "https://www.imdb.com/review/rw1209695",
      "warningSpoilers": true,
      "date": "6 November 2005",
      "rate": "10",
      "helpful": "113 out of 155 found this helpful.",
      "title": "Kubrick and the Art of Violence.",
      "content": "Stanley Kubrick has a way of telling stories about violence without actually exploiting them, or going into exaggeration. In DR STRANGELOVE, OR HOW I STOPPED WORRYING AND LEARNED TO LOVE THE BOMB violence as war was discussed, overheard, never truly seen until the final reel when a flurry of atomic bombs exploded into bright mushrooms as the song \"We'll Meet Again\" lovingly played in the background. In 2001: A SPACE ODYSSEY Hal-9000 terminates an entire crew in a most chilling way and all we see is a computer screen indicating the termination of life. Now, in A CLOCKWORK ORANGE, Kubrick actually brings a story about violence, and even then it is art directed within an inch of its life.Alex DeLarge is the leader of a band of 'droogs' who move from location to location terrorizing their victims, putting them under outrageous acts of violence. When two of his 'droogs' refuse to follow Alex's path of destruction, he turns on them and beats them, until an act of reversal turns against Alex and he is brought down by the medical industry who decides to \"reform\" his heretofore sociopathic tendencies. One he is cured, an interesting chain of humiliating events that bring Alex even farther down ensue: he is, for example, now attacked by his very ex-mates, now policemen, and his ex-victims. Sometimes the cure is far worse than the illness. Karma is a bitch.Kubrick has a particular way of visualizing his films. A CLOCKWORK ORANGE has a look and feel completely out of its time, closer to sometime in the future, and its torture sequence in which Alex is regenerated also looks straight out of a science fiction movie. However, this is not a science fiction film. It's actually quite difficult to categorize CLOCKWORK because it's something of a social satire, something of a drama, has comedic moments and deconstructs a musical for a horrifying rape sequence; however, its approach to the material gives it the feel of a hybrid out of time, out of place, but visually arresting and impossible to take for granted. It's this approach that makes the work the product of a master of direction -- it can be seen multiple times and every time a different perspective arises, and all one can be left with is with the notion that this is pure, ultra-modern cinema."
    },
    {
      "username": "sol-",
      "userUrl": "https://www.imdb.com/user/ur1355003",
      "reviewLink": "https://www.imdb.com/review/rw0990772",
      "warningSpoilers": false,
      "date": "3 January 2005",
      "rate": "10",
      "helpful": "220 out of 323 found this helpful.",
      "title": "My brief review of the film",
      "content": "A disturbing but yet very beautiful piece of film-making, Kubrick has created the ultimate study of mind manipulation in this film. It is a protest against reform programs that take away freedom of a choice, and the message of the film in terms of paying for one's sins in all eternity is inescapable, evident to a large extent in the sardonic nature of the tale. Although set in the future, it hardly feels like it is, this being because the message of the film is overwhelmingly powerful and capable of applying to any age. The film has a number of possible hidden meanings to it  a feat equaled on scale only by Kubrick's former film '2001: A Space Odyssey'. Besides for the meaning behind the film, there are still the marks of a masterpiece. Kubrick's direction is superb alongside the good photography, capturing shadows and angles needed to establish tone. The editing is excellent too, done in a flashy, brainwashing style at times to have relevance to the film. The choice of cast is again inspirational, however the film achieves the most in terms of music. Kubrick manages to use one of the earliest forms of art, classical music, and give it an unforgettable style and importance in the film. It is truly a difficult task to explain what is so great about a film such as 'A Clockwork Orange'  it is maybe best explained by watching the film itself."
    },
    {
      "username": "tyson-hunsaker",
      "userUrl": "https://www.imdb.com/user/ur33875393",
      "reviewLink": "https://www.imdb.com/review/rw3630983",
      "warningSpoilers": false,
      "date": "31 January 2017",
      "rate": "8",
      "helpful": "61 out of 79 found this helpful.",
      "title": "A controversial and offensive masterpiece.",
      "content": "Anyone looking to watch A Clockwork Orange might be wanting to revisit some of Stanley Kubrik's work and might be interested in studying this film. Those who have already seen this film tend to already have strong opinions regarding this dark sci-fi movie but for me, I approached this film recently to obtain an opinion for myself and study one of the great masters of cinema. The fact that this film was regarded as one of the most controversial films ever made (rightfully so) sparked genuine curiosity to give this flick a full viewing and while I have large issues with the film, the experience as a whole was both satisfying and a learning experience. This story centers on \"Alex\" our main protagonist and his gang of hoodlums set in a not so distant, dystopian Great Britain. The beginning portion unfolds Alex's dark and twisted soul as we watch him and his gang fight, rape, and kill. When he's eventually caught, he undergoes controversial \"treatment\" to be cured of his dark soul.I first appreciated the inmate concepts of this story and the type of questions the story attempted to raise to the audience. Furthermore, much of the psychological ideologies surrounding freedom, choice, good vs evil, and selfishness were extremely thought-provoking. It had a way of making me feel self-exploratory despite the character's complete inability to relate with (hopefully) any viewer. Performances were top notch; especially from the lead: Malcom McDowell. His performance felt so authentic there's never a single moment that feels fake or forced with his dark character. As always, Stanley Kubrick directs the hell out of this. His commanding and authoritative shooting style is apparent in every frame of the picture and he does a wonderful job at sucking the viewer into this terrible world to the point of enthrallment. While all these positives make for a great movie-going experience and when Kubrick is at the director's helm not much can go wrong, the film's biggest downfall is indeed its controversy. Disturbing subject matter in this piece is indeed vital to the essence of the story but taking off the gloves when it comes to fighting, rape, and killing (especially the rape) make this so incredibly disturbing that it's difficult to muscle through. I found that A Clockwork Orange was not only offense because of its disturbing content, it was personally offensive in so many ways. Frankly, these extremely rare and offensive movie experiences are not quite the reason I enjoy films in the first place; stories can still be thought-provoking while not morally offend and damage the viewer internally. In addition, a viewer looking to study the work of Stanley Kubrick can still experience some of cinema's greatest and transcendent experiences without feeling like their conscience has blackened.It's understandable that not everyone feels this way; just as stated before, opinions about this film are all across the board. As time has passed however, A Clockwork Orange has stood out has one of Kubrick's finest and has been adored by die-hard fans so much its fan base has grown over the years. The best advice to give is to see it for yourself. Much like all other Kubrick films, relying on anyone's opinion won't help one bit. Seeing it and deciding for yourself is the best course of action. That being said, despite it's strong artistic merit, I wouldn't recommend seeing it simply because of the morally offensive and sickening content that most don't appreciate. Overall, it's been the hardest one to review in a long time because it's not a simple: see it or don't see it. There's much more to this picture than that. If you do decide to see it though, be warned and well prepared. If not, that's probably just fine too."
    },
    {
      "username": "Ch4ndler_B1ng",
      "userUrl": "https://www.imdb.com/user/ur89818312",
      "reviewLink": "https://www.imdb.com/review/rw7736351",
      "warningSpoilers": true,
      "date": "9 January 2022",
      "rate": "10",
      "helpful": "20 out of 23 found this helpful.",
      "title": "A second viewing does the trick",
      "content": "A Clockwork Orange is directed by Stanley Kubrick, my favorite director of all time and this is my second favorite movie of all time including one of my favorite villain performances of all time! A Clockwork Orange is every genre, it's Sci-Fi mixed with crime, drama, psychological thriller, satire, horror elements and most importantly romance (nah, I'm kidding).At the time of release it was considered purposefully disturbing, boring and overall just not a great movie, however years later, when critics gave it a second viewing, they retracted their reviews and it is now considered one of the best movies of all time! Same kind of thing with two other Kubrick movies- 2001: A Space Odyssey and The Shining- when these movies were released critics hated on them, same complaints with all three of these films, yet a second viewing (once again) proved that it was misunderstood and genius.A Clockwork Orange has one of the greatest opening scenes in cinematic history, we have Alex looking directly at the camera, while his droogs are passed out and looking elsewhere. His intense stare and narration create a weird and already disturbing atmosphere. On this first viewing, I strongly disliked the movie, and I couldn't make it through that first r**e scene, I was completely and utterly disturbed. A year later I decided to rewatch it, after watching other mature movies I think I was ready for A Clockwork Orange, and I was right, this movie is beautifully filmed, perfectly scripted and the fact that Kubrick did most camera work, wrote the film, directed it and produced it is beyond me. He is a perfectionist and you can tell that with each shot - even the minimal ones - he put in the most amount of effort that he could and it truly made me appreciate cinema more.Some scenes are deeply disturbing, when I went back and watched it for a third and fourth time, I always shut my eyes during the \"Singin' in the Rain\" scene. Alex DeLarge is a monstrous human being, yet he is our protagonist, he commits these heinous crimes and he gets jail time he deserves. He runs into all of these people who he has beaten earlier in the film, even runs into his two droogs, they all punish him and we feel slight sympathy for his character, he is locked in a room by Mr Alexander (the husband of the woman who died from injuries sustained during the Singin' in the Rain scene) and forced to listened to Beethoven - this music reminds him of the crimes he commited and it tortures him to the point of near-suicide. He jumps out of the window and Mr Alexander goes to jail.The Ludovico techique is seen as wrong and is being pushed to be stopped, Alex is now seen as a hero in the newspapers and the ending is left to interpretation, I think that Alex definitely wasn't cured, he is going to continue this endless cycle of r**e and violence, unlike the book's ending which has Alex become a normal human being. Overall, this is the most unique and intriguing movie I have ever seen."
    },
    {
      "username": "TBJCSKCNRRQTreviews",
      "userUrl": "https://www.imdb.com/user/ur2093818",
      "reviewLink": "https://www.imdb.com/review/rw0969872",
      "warningSpoilers": true,
      "date": "29 November 2004",
      "rate": "10",
      "helpful": "73 out of 111 found this helpful.",
      "title": "One of the greatest films ever made",
      "content": "I haven't read the novel that this film is based upon, and I didn't know that much about it before I sat down to see it. I decided to see it after hearing pretty much nothing but praise for the film(in fact, the only negative comments I've ever heard about it is that it deviates too much from the original novel... which is something Kubrick was famous for) and because I immensely enjoyed The Shining and Kubrick's directorial style as seen in it. I must say, it's been quite a while since I saw something so full, spectacular, exhausting and powerful. From the very first frame to the very last... amazing. Kubrick's style is magnificent, his storytelling is among the best ever seen in cinema. With this film he truly captures the raw and pure qualities of violence. I don't think(well, I certainly don't hope) that anyone who ever has or ever will see this film confuses this as an ode or a tribute to violence... this is not, in any way, shape, or form glorifying violence or violent behavior. Quite the contrary, you might say. The film proves, once and for all, that violence spawns violence. Visually, the film is absolutely stunning. The angles, pans, tracking shots... fantastic work. The ideas presented in the film are more than enough to disturb and freak out any normal person... which is(at least part of) the point. If I mention the words 'eyes opened forcefully' you probably already know what I'm talking about, right? That famous sequence has been referenced, spoofed and talked about more times than just about any other visual impression in the history of cinema. The way everyone and everything turns at Alex after he's apparently cured... truly disturbing. I found a surprise at every change in scenery or even in immediate situation, especially in the latter part of the movie. The way society turns against Alex after he rejoins it, apparently a better man... one of the most 'true' and real cinematic truths ever told of humanity. We are beasts, we are what is commonly referred to as 'inhumane'... and Kubrick tells us this in a truly astonishing manner. The plot is very good. It deals with the main character of Alex, beautifully played by Malcolm McDowell, who loves 'a bit of the old ultra-violence'. He is incarcerated and offered a chance to be re-entered to society, after being 'cured' of his psychotic tendencies. The pacing is... well, hard to describe, really... it feels slow, the movie seems to move slowly... but it hardly drags at all. It's exhausting, not to mention hard to sit through, both due to the extreme content and the slowly moving plot, but it's all worth it. The point is pure genius. Pure Kubrick. The acting is flawless... and believe me, that is not a term I use lightly. Every single actor performs perfectly. The characters are perfectly written, credible in every scene and interesting. The cinematography is pure beauty... pure excellence. I've come to love Kubrick's visual style. His cuts of varying speed and intensity, his long takes when dealing with dialog... truly amazing. His use of music is astounding... the use of classical music is great and really adds to the ironic tone and the atmosphere, the mood of the film. This is truly a work of art, and an exhausting but truly worthwhile film. I haven't seen anything quite like it for a while... in fact, maybe I never have. I recommend this to any fan of Kubrick or intelligent theater. If you believe yourself to be perceptive and intelligent enough to understand the film on most or all of its levels(I don't claim to, not at all), or even on the most basic levels, such as theme and morale(which is what I understood of it) then you should, nay, then you *need* to see this film. Be prepared, though, it does contain quite a lot of disturbing themes and ideas, and is not in any way for the faint of heart. 10/10"
    },
    {
      "username": "FZ-FX",
      "userUrl": "https://www.imdb.com/user/ur5010057",
      "reviewLink": "https://www.imdb.com/review/rw1051402",
      "warningSpoilers": false,
      "date": "1 April 2005",
      "rate": "9",
      "helpful": "389 out of 489 found this helpful.",
      "title": "Brilliant, stunning and disturbingly entertaining",
      "content": "Few films are as sensational or infamous as Stanley Kubrick's \"A Clockwork Orange\". It's impossible to sit through ACO and not have a reaction; whether it be shock, disgust or amazement. The savage tale of a brutal young droog and his subsequent \"reformation\" by the government is as shocking and thought-provoking as ever. While the film's depictions of violence and sex are what it's most known for, ACO works on far deeper levels. The disturbing portrayal of youth and its satirical depiction of a government's attempts to create a better society are brilliant, but the most fascinating aspect of ACO is the questions it poses about good and evil. While the crimes Alex commits at the beginning of the film are atrocious, what the government does to him is worse. The film presents the absolute worst aspects of man, but shows that even these are still favorable to a man without the choice. People can denounce the film because of its brutal content, but the importance of the questions it poses can't be denied. Equally excellent to the film's content is the effort by the crew. Kubrick's perfectionism pays off well, as ACO in one of his most visually striking films. Malcolm MacDowell is nothing short of amazing as Alex. Kubrick's use of surreal imagery and set pieces, as well as the ingenious use of music to compliment the on-screen action, creates a world that perfectly reflects the protagonist's behavior and the government's policies. A Clockwork Orange is by no means an easy film to get through, as many will be turned off by the scenes of violence and rape. But this masterpiece is far more complex than a simple romp through a world of youthful violence. It's a rare example of film-making that demands that the viewer actually think. Real horrorshow all around, Oh my brothers."
    },
    {
      "username": "nickenchuggets",
      "userUrl": "https://www.imdb.com/user/ur107418055",
      "reviewLink": "https://www.imdb.com/review/rw6869143",
      "warningSpoilers": true,
      "date": "1 May 2021",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "\"I was cured all right\"",
      "content": "It's not an everyday occurrence where you watch a movie that is just so weird and hard to describe to people that haven't watched it that it stands in a category of its own, but that is clockwork orange. This movie was banned for many years and catholics were prohibited from seeing it because of its sexual nature, which literally makes itself known in only the first minute or two. Right from the beginning, when you see Alex, the \"protagonist\" who beats, rapes, and tortures people for his own wicked amusement, staring emotionlessly into the camera, you know you're about to see something that doesn't hold anything back. Clockwork orange is full of acts of violence, sexual imagery, and brutality throughout its various scenes, but that's the whole beauty of it and why this movie still holds up after half a century now. It does what other movies (especially back in the 70s) were afraid to do. The only other one that comes to mind is the exorcist, but that was still 2 years away. Anyway, Alex commands the audience's attention in the first half of this movie, and it's understandable why the people watching would be afraid of him and his sociopathic tendencies. Even his fellow criminals are appalled by his actions, but he makes it very clear to them that he's the leader. That is until the second half of the film where he is arrested and sent to undergo an experimental procedure which is supposed to cure his violent nature and habits. The infamous scene in which his eyes are forced open while watching acts of violence in the theater is something the viewer won't ever forget. Clockwork Orange is another rare example of a movie that, in my view, doesn't have a single dull or disinteresting moment in it, and the film can be easily classified as three parts: the first segment where Alex is still a criminal, the second one where he is sent to prison and \"rehabilitated\", and the last segment when he is released. As said earlier, there will probably never be another movie like this one, and it stands alone in its own category because it is just that unique. There's horror movies, there are comedies, there are thrillers, there's film noir, and then there's clockwork orange."
    },
    {
      "username": "Movie-12",
      "userUrl": "https://www.imdb.com/user/ur0111563",
      "reviewLink": "https://www.imdb.com/review/rw0115214",
      "warningSpoilers": true,
      "date": "18 September 1999",
      "rate": "10",
      "helpful": "197 out of 313 found this helpful.",
      "title": "The number one film of all time. **** out of ****",
      "content": "A CLOCKWORK ORANGE (1971) ****Starring: Malcolm McDowell, Patrick Magee, Michael Bates, Warren Clarke, and Adrienne Corri Written and Directed by Stanley Kubrick 137 minutes Rated R (for strong explicit sexual content and rape, perverse nudity, brutal violence, and some language)By Blake French: Stanley Kubrick's \"A Clockwork Orange\" holds the recent record of being the number one film of all time on my charts. The film is everything that you'll never want to watch. The scenes are disturbing, gut wrenching, mind twisting, and way over the top. In result, \"A Clockwork Orange\" has the most powerful and overwhelming dramatic impact that I have ever experienced in a mainstream film. \"A Clockwork Orange\" is the story of a young man named Alex DeLarge, who is, by day, a regular student who lives with his parents at home, but, by night, a homicidal rapist/killer with his accomplices who dress up like demented clowns at a bleak freak show. He and his buddies weasel their way into the happy homes housing innocent people by chanting the same deceiving phrase every night: they scream that their friend has been critically wounded in an accident near by--and plead to use their telephone to call for help.For a few unfortunate souls, this devious trick proves to be successful in nature. One night, however, a woman known as \"The Cat Lady,\" refuses their plead, and calls the police in suspicion. Alex, being both smart and sneaky, somehow manages to break into this perverted woman's home, while his accomplices wait outside. Once indoors, a fight begins. A struggle featuring a sex toy owned by \"Cat Lady,\" one that not only causes panicked arousal, but also is featured as the weapon of her graphic and disturbing murder. Alex quickly flees the scene once the police sirens reach his shaky ears, but when he gets back to his pal's waiting outside, they return their experiences with him by bashing him over the head with a hard object, allowing their jumbled escape, but his certain demise. After the process of being sent to prison, Alex grows to learn to tell offices and guards what they like to hear. He reads the bible, is never involved with any major fights or complications, and almost volunteers for a new kind of experiment. An experiment so probationary it is still being tested and held under wraps. What it does, though a series of \"sessions,\" is cure a violent individual from his sickness; he will feel terrible pain if involved in any sort of violence after the medicine takes place.The scenes involving the \"cure\" of Alex's disturbances are truly emotionally troublesome. They are so explicit and detailed that I myself felt tempted to look away from the screen at points. This is not a film for those who are prone to walk out of movies, those who are easily offended, or especially for those with week stomachs. This is the most grizzly enumerated film I have even screened, but it happens to be one of the most perfect and precise in message. I definitely don't recommend the production to everyone, though. The soundtrack to \"A Clockwork Orange\" is one of the most inspirational and spirited ones I have ever heard; right up there with the turns to \"The Graduate\" (1967). Although the actual music is far from fitting each individual scene, the overall presence is not only worth listening to, but also worth the purchase price.Here, a young Malcolm McDowell explores the character of a lifetime with vivid imagination and tremendous description. His character fits him very well as an actor. Even though the character is meant to be despised, I couldn't help but to be very convinced and interested in his sick, demented, psychotic mind. Most of this is because of the flawless point of view the film contains, one that both provokes empathy and involvement. It investigates the mind of a killer, rapist, and a confused, somewhat harmless, adolescent--all existing in the same character. This is no doubt the character, and the performance, that inspired a generation.As well as being a movie of violent and sexual repulsion, Stanley Kubrick's direction to \"A Clockwork Orange\" also forces us to investigate deep down in ourselves and chew on the idea of us being in the character's shoes. There is a scene in this movie that forces two parents to make a decision of a lifetime. After receiving the treatments he volunteered for, Alex returns to his household only to discover that the only mom and dad he's even known have rented his old room out to some strange college kid, who is said to have been there for them during many hard times--like a real son. His parents must make a choice: to throw their only son, who has suffered for years in turn for making others suffer, out of the house for good, or allow him to return with open arms trusting that he is \"cured.\" Well, dear reader, what would you do? Brought to you by Warner Bros."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2442351",
      "warningSpoilers": false,
      "date": "12 June 2011",
      "rate": "10",
      "helpful": "27 out of 40 found this helpful.",
      "title": "Controversial yet very fascinating",
      "content": "I like and respect Stanley Kubrick, and feel that along with 2001, Dr Strangelove, Full Metal Jacket and Barry Lyndon, A Clockwork Orange is one of his best films. It is probably Kubrick's most controversial film, but it is also one of his most fascinating at the same time. It is the sort of movie that you need to see more than once though, I didn't think much of it first time I love it and appreciate it much more now for what it set out to do.A Clockwork Orange is a shocking film I give you that, particularly with the rape and sadistic ultra-violence in the first half, and the scenes where Alex is being brainwashed do bring forth ambiguous messages. Still, like with the rest of Kubrick's work it is very well made, has a haunting soundtrack that fits wonderfully with the tone of the film(especially loved the use of the Beethoven), superb writing and direction from Kubrick and a compelling story that evokes thought afterword complete with a purposefully unrepentent ending. Also Malcolm McDowell is absolutely superb in what I consider the performance of his career.In conclusion, very fascinating film. 10/10 Bethany Cox"
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0115320",
      "warningSpoilers": true,
      "date": "31 July 2000",
      "rate": "",
      "helpful": "28 out of 41 found this helpful.",
      "title": "Sick and Disturbing, But Ultimately Brilliant",
      "content": "Stanley Kubrick directed and co-wrote this wild and crazy film which deals with a murdering, stealing, and raping Malcolm McDowell and his small gang of thugs in a not-too-distant future. They are in London and by night they terrorize anyone and everyone who they want. When McDowell is betrayed by his fellow mates, he is put into prison and is subjected to an experimental therapy which works wonders for the youth. Now the thought or sight of violence is sickening to him. He also grows sick of Beethoven's music, which he once loved, because of its use in the experiment. When he is freed, he runs into all those who he crossed in his past and they all have revenge in mind for McDowell. McDowell ultimately tries suicide to escape his life, he fails, and is then given a formal apology from the state and is reverted back to the way he was in the beginning. \"A Clockwork Orange\" is ultimately sick and disturbing, but conveys some real strong messages in unconventional ways. Kubrick shows that there are some solutions to various problems, but many times those solutions cause new problems that are just as nasty, if not more so, than the first set. McDowell shines in his role. His character is basically the only three-dimensional person in the movie and it is meant to be that way. The other characters are meant to be somewhat flat and under-developed to show just how alone McDowell is in his twisted world. Overall a great film and easily one of Kubrick's best. 5 stars out of 5."
    },
    {
      "username": "coombsstephen",
      "userUrl": "https://www.imdb.com/user/ur97849810",
      "reviewLink": "https://www.imdb.com/review/rw7364501",
      "warningSpoilers": false,
      "date": "20 September 2021",
      "rate": "6",
      "helpful": "35 out of 50 found this helpful.",
      "title": "I just didn't get why it's a masterpiece",
      "content": "I looked forward to seeing this classic for the first time but came out a bit bemused about what all the fuss was about.It was an ok film and certainly quite out there in the content and the way it was filmed but I failed to see what made it such a cult classic.Maybe its a generation thing."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0115616",
      "warningSpoilers": true,
      "date": "30 July 2002",
      "rate": "",
      "helpful": "36 out of 56 found this helpful.",
      "title": "The Eye and the Genital",
      "content": "Spoiler herein.Kubrick's films are misunderstood. Reading the professional reviews and comments here, one would think the reason for this film to exist is for Kubrick to make a strong satire. What bunk. What a small view.This movie is about the tyranny of movies (and similar performances). The fact that so few people see it as something else is a testament to the self-protective nature of films in our soul.The Droogs engage in performances. Their speech is theatrical. Their rival gang is discovered on the stage. There is a focus on the eye. They wear costumes. The sex with the teeniboppers is cast as a performance (and photographed that way). The accosted writer is (selfreferentially) the writer of the film, who incidentally drives the character to suicide by exposing him to a performance. During that attack, the Droogs act out another film.The therapy is forcing `us' to watch movies precisely like the one we are watching. Kubrick follows the Film-within-the-film rule of having the distance of abstraction from the film with to the film be the same as from `real' life to the film. The entire film can be seen as (pick one): one of the punishment films; a subsequent vision in the hospital; a musical drama played out in some kid's head; a simple hallucination in the milk bar; a simple invention of the gay writer (who pretends he had a wife).All of Kubrick's work starting with Lolita is an exploration into the plasticity of narrative, in the context of obsession (`Lolita'), war (Metal'), power , space (meaning the environment as in `Lyndon'), and invented reality (`2001') and adulterous fantasies (`Eyes'). Here we work with violent adolescent sex: cockworks. It is what Phil Dick had in mind.Ted's Evaluation: 3 of 4: Worth watching."
    },
    {
      "username": "Prismark10",
      "userUrl": "https://www.imdb.com/user/ur4569900",
      "reviewLink": "https://www.imdb.com/review/rw3579742",
      "warningSpoilers": false,
      "date": "13 November 2016",
      "rate": "7",
      "helpful": "12 out of 16 found this helpful.",
      "title": "The milky bar kid",
      "content": "A Clockwork Orange was always a film I wanted to watch but it was one of these films that I was too young to watch when it was initially released in British cinemas and then banned by Director Stanley Kubrick from being available in Britain. The ban remained until he died.The film became infamous for its depiction of violence and sex. It overlooked the fact that despite its initial scenes of brutality and rape, in its heart it is a dark comedy set in a futuristic Dystopian Britain.An adaptation of Anthony Burgess novel, Malcolm McDowell might be a shade too old to play the teenage delinquent Alex getting high on milk-plus which is infused with drugs and then partakes in an orgy of ultra-violence which includes beating up a vagrant, fighting with a rival gang and then speeding through the country roads where they burst into the house of a writer who gets beaten up and watches his wife get raped as Alex sings Singin in the rain.We know Alex is still at school as he lives in his parents flat and is visited the next morning by his probation officer who is concerned about his absence from school.However Alex's luck runs out. He falls out with his fellow gang members and when he breaks into another house, he kills a woman with a phallic sculpture, betrayed by his gang and caught by the police, he is sentenced to 14 years in jail.The opening part of the film would had been deemed shocking in early 1970s Britain. I doubt that level of sex and savagery would had ever been seen before in a mainstream British film.However the film becomes more of a surreal prison film once Alex ends up in jail where he joins a church group and tries to fend off advances from fellow inmates. A visiting government minister offers him a chance to take part in an experiment. Once he undertakes an experimental aversion therapy for rehabilitating criminals within two weeks the film becomes a black revenge comedy.Once freed from prison and rehabilitated Alex finds there is no room for him in his parents home, he gets set upon by a gang of vagrants as the tramp who he beat up in the beginning recognises Alex. His old gang members are now in the police and they torture him. Worse still he stumbles into the house of the writer who he attacked and he gets his vengeance as well. Poor Alex now cannot listen to his favourite piece of Beethoven without doing harm to himself.There is an underlying political satire of a government wanting to tackle violence in society by being draconian themselves until public opinion turns against them.The film contains a lot of slang derived from east European languages and although I mentioned he looked rather old to play the teenage Alex, Malcolm McDowell delivers an amazing performance providing a narrative with his Yorkshire tones.The film might put off some of its audience with its disturbing opening but settles in well after that."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3422253",
      "warningSpoilers": true,
      "date": "26 February 2016",
      "rate": "8",
      "helpful": "10 out of 13 found this helpful.",
      "title": "Daring and provocative",
      "content": "This classic controversial film from Stanley Kubrick is a love-it-or-hate-it movie which tends to divide audiences like the rest of the director's filmography. It's certainly a unique movie, perfectly made up to Kubrick's impeccable standards and with important messages for us all. Take for example the core \"corrupt oppressive society\" vibe that runs from 1984 to BRAZIL and you have the basis for A CLOCKWORK ORANGE, which tells of mind control being used on thugs and irredeemably evil prisoners. As well as this, Kubrick's movie looks at violence and its effects on both the purveyors and victims and proves to be a rewarding character study of an angry young man, as played by Malcolm McDowell (CALIGULA) in what can be called one of the defining performances of his career.Classical music has never been put to such good use as this in a film (aside from, perhaps, Kubrick's own 2001: A SPACE ODYSSEY) and it fully complements the on screen action. Brutal street battles are played out in slow-motion as soothing tunes blast out on the soundtrack and the result is an effective depiction of the beauty of violence, if it can be called as such. Scenes showing Alex and his droogs going about their daily business of raping innocent women and beating innocent men are thoroughly horrific and very violent for the time, although of course the impact has been dulled by what has come since. However, the best parts of the film come during Alex's therapy, as he is forced to watch violent film after violent film in a dark cinema and gradually becomes sickened to the sight of violence and, indeed, sex. The aftermath keeps you guessing as to the eventual outcome, making for some very tense scenes when Alex finds himself in the home of a man he had previously crippled.The acting is of a high calibre, with many strong supporting performances to complement Malcolm McDowell's own shining example. Of particular note are Warren Clarke and the others playing Alex's scarily sadistic droogs; Patrick Magee (DEMENTIA 13) who has a field day as the mentally unstable victim; Adrienne Corri as a rape victim of the gang and the actors playing the various doctors and scientists. Sharp eyes may spot future Darth Vader Dave Prowse playing Magee's strongman bodyguard. My only complaint with the movie is that it has now become inevitably dated. The use of obscure language for the most simple of terms just seems a bit pretentious and unnecessary and defeats the air of realism the movie is trying to put across. However, seen with a fresh eye, A CLOCKWORK ORANGE is daring and intelligent cinema and a well-made film to boot, not exactly entertaining but certainly though-provoking and challenging."
    },
    {
      "username": "Theodorum",
      "userUrl": "https://www.imdb.com/user/ur80714899",
      "reviewLink": "https://www.imdb.com/review/rw4130581",
      "warningSpoilers": false,
      "date": "15 April 2018",
      "rate": "10",
      "helpful": "35 out of 47 found this helpful.",
      "title": "Of course it's perfect!",
      "content": "A masterpiece of a movie that contains one of the best introduction scenes in movie history and also one of the best ending scenes in movie history. The satirical content is obvious. The soundtrack is also a killer... especially the electronic synthetic music parts! Isn't that the darkest piece of music you've ever heard in a dystopian movie? Those synths sound so haunting and the psychedelic effects are awesome! No wonder it was a major influence for the early synth pop bands!"
    },
    {
      "username": "Analog_Devotee",
      "userUrl": "https://www.imdb.com/user/ur107152571",
      "reviewLink": "https://www.imdb.com/review/rw5638878",
      "warningSpoilers": false,
      "date": "14 April 2020",
      "rate": "1",
      "helpful": "73 out of 120 found this helpful.",
      "title": "The most overrated film in cinema history.",
      "content": "I've seen this film three times over the years. The first time I saw it, I was completely blown away by how awful it was. Surely I was missing something, right? I mean, after all, it's considered to be not only one of the best films of the 1970's (no slouching decade) but of all time! I asked a friend of mine who was studying film in California what I was missing, and his answer was, \"Well, it's a Kubrick film, so you may have to watch it more than once.\" And so, that following year, I sat down and watched this film two more times waiting for the reveal to finally wash over me. Today, I can tell you that was easily the worst piece of advice I've taken so far in my life. This film makes absolutely no sense whatsoever, and any \"underlying themes\" people speak of is a load of hogwash. It's just bad. Period.So, why did this film become so popular over the years? Probably because people LOVE to bow down to Kubrick as being the greatest filmmaker of all time, and nothing could be further from the truth. In fact, the only movie I've seen from him that's actually good is Full Metal Jacket.Although I've never read the book, I'm sure it's much better than this film. People were a lot less likely to bandwagon books pre-Harry Potter. If a book got a lot of attention back then, it probably deserved it. My recommendation would be to read the book and not waste your time on this pretentious, illogical, downright frustrating film."
    },
    {
      "username": "ChrJahnsen",
      "userUrl": "https://www.imdb.com/user/ur0841228",
      "reviewLink": "https://www.imdb.com/review/rw0115406",
      "warningSpoilers": false,
      "date": "27 June 2001",
      "rate": "10",
      "helpful": "608 out of 965 found this helpful.",
      "title": "Best movie ever made",
      "content": "A Clockwork Orange is the finest film that has ever been made, in my view. Stanley Kubrick has made so many masterpieces, and is by far the best director that ever graced our world. A Clockwork Orange is simply his finest hour!The film grabs you and glues you to your seat from start to finish. Malcolm McDowell gives us a shining example of superior acting, and the movie is as perverted as any of Kubrick's masterpieces (and then some!). It contains horrifying violence, extreme emotions, perversity and weirdness at it's very worst. It all boils down to serve you a plethora of thoughts for you to take with you and contemplate, after the film ends.However, with all the perversity bursting out of this film, you will probably NOT like this film the first time you see it. I know I didn't. Fortunately, I gave it a second chance, and thought: Hey, it was actually not bad at all. After the third time, I was lost for words.After the fourth time, there was little doubt in my mind, that this was the finest film ever made, and regardless of how many great masterpieces I see, A Clockwork Orange still towers above them. I'm sure you'll agree, if you give it the chance it deserves, although it may require for you to see it more than once."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3307716",
      "warningSpoilers": false,
      "date": "30 August 2015",
      "rate": "8",
      "helpful": "6 out of 7 found this helpful.",
      "title": "orchestra of violence",
      "content": "In a dystopian world, Alex DeLarge (Malcolm McDowell) leads his 3 followers in ultraviolence. Eventually, he is arrested for killing an old lady. In prison, he finds the violence in religion to be calming. He volunteers for an experimental treatment program. The treatment makes him ill when confronted with violence and sex. He is released and is confronted by the violence that he himself promoted.This is almost experimental in its examination of sex and violence in society. It is an unique surreal film. The ideas behind it may be lost to people who sees this simply as an artistic violent movie. No matter how one dissects this, Malcolm McDowell's performance is beyond reproach. He shows his great acting abilities."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw0115299",
      "warningSpoilers": true,
      "date": "15 June 2000",
      "rate": "9",
      "helpful": "75 out of 126 found this helpful.",
      "title": "A film described as the sociological masterpiece of the decade and, often as dangerously vicious",
      "content": "\"A Clockwork Orange\" starts out with Alex and his gang of \"droogs\" sitting in the Kerova milk bar drinking the milk plus... Then the camera starts slowly to move back and we see naked female statues and drink machines which purl out the milk through their breasts...McDowell is splendid as the star-child Alex... He is simply a vicious and amazing sadist monster, lethal in his sincerity, taking delight in rape and violence... Never such a vile character has been so charismatic and attractive... His life is perplexing, questionable and terrifying... He doesn't show the slightest regard for other's rights or morality... He doesn't even regard his victims as human beings...His paradoxical character is in nearly every scene... McDowell captures Alex's human and inhuman side with equal skill... Alex is a victim at the mercy of an uncaring society, condemned to the physically unbearable \"dislike therapy\" and preyed upon by his former targets...Set in England in the near future a future which vaguely reflects our own, but it seems that society has started to crumble and at night the streets are driven with teenage gangs who run free of parental control...\"A Clockwork Orange\" is too strong for some people to accept and is still too powerful today... It is an extremely disturbing meditation on the violent nature of man... Kubrick emphasizes the human element by paradoxically dehumanizing the characters...Viewers see images they may not have wanted to see, but will never be able to forget... He presents violence in a confusing and increasing fashion that makes it alarmingly attractive... He invites us to join Alex in raping and pillaging into London urban jungle to show that violence and power are invariably attractive... He makes good use of the camera, showing, in strange ways, the furious underworld of Alex... Kubrick is the driving force behind \"A Clockwork Orange.\" The film is without exception his picture... He took the novel of Anthony Burgess re-shaping it to fit his own vision... Images and sound pull in different directions, stimulating conflicting emotions... In a bizarre juxtaposition of often classical music with violence, we see ourselves manipulated into cheering for Alex, despite his brutal and amoral nature... We are forced to really think about the implications of the events with no answer...The film serves as a battleground for philosophical arguments making comments without forcing an opinion instead preferring that we ourselves decide what to make of the satire... Exposing themes to think about, significant prediction, liberalism of society, sexual acts gaining acceptance, violent films in higher degree, alcohol-currently legal, accounts for many acts of violence, crime out of control, violence in schools, television, illustrating the inconstant nature of public opinion, raising questions, themes and ideas that many people would prefer not to confront...Style has always been one of Kubrick's strong points... He maintained a reputation for an obsessive attention to detail... He was known for getting the most out of his actors... Distinct images often play a significant part in his films...With its dynamic bizarre sets and pulsating classical music score, and with a word of warning on how bad violence is and should be watched very closely, Kubrick's motion picture is unsurpassed with intellectual content... It is a film described often as the sociological masterpiece of the decade and, often as dangerously vicious a film with more violent sex and dangerous thugs than any other I can remember, a film which daringly brought to larger-than-life those areas of the unconscious mind which some people felt were best left hidden It is also highly dramatic, extremely graphic, compelling and provoking... It is frightening and intriguing masterpiece with a powerful message about the reality of human nature..."
    },
    {
      "username": "maryolalov",
      "userUrl": "https://www.imdb.com/user/ur69458085",
      "reviewLink": "https://www.imdb.com/review/rw4562065",
      "warningSpoilers": true,
      "date": "5 January 2019",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "\"Viddy well, little brother. Viddy well.\"",
      "content": "To be honest I'm not a big fan of Kubric as I find some of his movies overrated. But I have to admit that this movie is truly a masterpiece and a classic in both crime and anti utopian geners.There are many things that make this movie so great. The acting is on a very high level and Malcolm Mcdowell gives an outstanding performance. The scrip is well written and the plot is intriguing. I can go on and list many other things that make this movie a masterpiece but probably the most important one is the storytelling. Kubric has shown that he is a good storyteller and this movie proves it undoubtedly.Let's not forget how controversial \"A Clockwork Orange\" is. There are many scenes that might seem disturbing to some viewers. But these scenes are of great importance for this movie as they make it more intense and intriguing.It is a controversial movie, indeed. But even though filled with violence and sex, \"A Clockwork Orange\" manages to talk about important themes that concern the human society."
    }
  ],
  "errorMessage": ""
}