{
  "imDbId": "tt0066921",
  "title": "A Clockwork Orange",
  "fullTitle": "A Clockwork Orange (1971)",
  "type": "Movie",
  "year": "1971",
  "language": "en",
  "titleInLanguage": "A Clockwork Orange (film)",
  "url": "https://en.wikipedia.org/wiki/A_Clockwork_Orange_(film)",
  "plotShort": {
    "plainText": "A Clockwork Orange is a 1971 dystopian crime film adapted, produced, and directed by Stanley Kubrick, based on Anthony Burgess's 1962 novel of the same name. It employs disturbing, violent images to comment on psychiatry, juvenile delinquency, youth gangs, and other social, political, and economic subjects in a dystopian near-future Britain.\r\nAlex (Malcolm McDowell), the central character, is a charismatic, antisocial delinquent whose interests include classical music (especially Beethoven), committing rape, theft, and ultra-violence. He leads a small gang of thugs, Pete (Michael Tarn), Georgie (James Marcus), and Dim (Warren Clarke), whom he calls his droogs (from the Russian word друг, which is \"friend\", \"buddy\"). The film chronicles the horrific crime spree of his gang, his capture, and attempted rehabilitation via an experimental psychological conditioning technique (the \"Ludovico Technique\") promoted by the Minister of the Interior (Anthony Sharp). Alex narrates most of the film in Nadsat, a fractured adolescent slang composed of Slavic languages (especially Russian), English, and Cockney rhyming slang.\r\nThe film premiered in New York City on 19 December 1971 and was released in the United Kingdom on 13 January 1972. The film was met with polarised reviews from critics and was controversial due to its depictions of graphic violence. After it was cited as having inspired copycat acts of violence, the film was withdrawn from British cinemas at Kubrick's behest, and it was also banned in several other countries. In the years following, the film underwent a critical re-evaluation and gained a cult following. It received several awards and nominations, including four nominations at the 44th Academy Awards, including Best Picture.\r\nIn the British Film Institute's 2012 Sight & Sound polls of the world's greatest films, A Clockwork Orange was ranked 75th in the directors' poll and 235th in the critics' poll. In 2020, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".",
    "html": "<p>A Clockwork Orange is a 1971 dystopian crime film adapted, produced, and directed by Stanley Kubrick, based on Anthony Burgess's 1962 novel of the same name. It employs disturbing, violent images to comment on psychiatry, juvenile delinquency, youth gangs, and other social, political, and economic subjects in a dystopian near-future Britain.</p><p>Alex (Malcolm McDowell), the central character, is a charismatic, antisocial delinquent whose interests include classical music (especially Beethoven), committing rape, theft, and ultra-violence. He leads a small gang of thugs, Pete (Michael Tarn), Georgie (James Marcus), and Dim (Warren Clarke), whom he calls his droogs (from the Russian word друг, which is \"friend\", \"buddy\"). The film chronicles the horrific crime spree of his gang, his capture, and attempted rehabilitation via an experimental psychological conditioning technique (the \"Ludovico Technique\") promoted by the Minister of the Interior (Anthony Sharp). Alex narrates most of the film in Nadsat, a fractured adolescent slang composed of Slavic languages (especially Russian), English, and Cockney rhyming slang.</p><p>The film premiered in New York City on 19 December 1971 and was released in the United Kingdom on 13 January 1972. The film was met with polarised reviews from critics and was controversial due to its depictions of graphic violence. After it was cited as having inspired copycat acts of violence, the film was withdrawn from British cinemas at Kubrick's behest, and it was also banned in several other countries. In the years following, the film underwent a critical re-evaluation and gained a cult following. It received several awards and nominations, including four nominations at the 44th Academy Awards, including Best Picture.</p><p>In the British Film Institute's 2012 Sight & Sound polls of the world's greatest films, A Clockwork Orange was ranked 75th in the directors' poll and 235th in the critics' poll. In 2020, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".</p>"
  },
  "plotFull": {
    "plainText": "A Clockwork Orange is a 1971 dystopian crime film adapted, produced, and directed by Stanley Kubrick, based on Anthony Burgess's 1962 novel of the same name. It employs disturbing, violent images to comment on psychiatry, juvenile delinquency, youth gangs, and other social, political, and economic subjects in a dystopian near-future Britain.\r\nAlex (Malcolm McDowell), the central character, is a charismatic, antisocial delinquent whose interests include classical music (especially Beethoven), committing rape, theft, and ultra-violence. He leads a small gang of thugs, Pete (Michael Tarn), Georgie (James Marcus), and Dim (Warren Clarke), whom he calls his droogs (from the Russian word друг, which is \"friend\", \"buddy\"). The film chronicles the horrific crime spree of his gang, his capture, and attempted rehabilitation via an experimental psychological conditioning technique (the \"Ludovico Technique\") promoted by the Minister of the Interior (Anthony Sharp). Alex narrates most of the film in Nadsat, a fractured adolescent slang composed of Slavic languages (especially Russian), English, and Cockney rhyming slang.\r\nThe film premiered in New York City on 19 December 1971 and was released in the United Kingdom on 13 January 1972. The film was met with polarised reviews from critics and was controversial due to its depictions of graphic violence. After it was cited as having inspired copycat acts of violence, the film was withdrawn from British cinemas at Kubrick's behest, and it was also banned in several other countries. In the years following, the film underwent a critical re-evaluation and gained a cult following. It received several awards and nominations, including four nominations at the 44th Academy Awards, including Best Picture.\r\nIn the British Film Institute's 2012 Sight & Sound polls of the world's greatest films, A Clockwork Orange was ranked 75th in the directors' poll and 235th in the critics' poll. In 2020, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".\r\nPlot\r\nIn a futuristic Britain, Alex DeLarge is the leader of a gang of \"droogs\": Georgie, Dim and Pete. One night, after getting intoxicated on drug-laden \"milk-plus\", they engage in an evening of \"ultra-violence\", which includes a fight with a rival gang. They drive to the country home of writer Frank Alexander and trick his wife into letting them inside. They beat Alexander to the point of crippling him, and Alex violently rapes Alexander's wife while singing \"Singin' in the Rain\". The next day, while truant from school, Alex is approached by his probation officer, PR Deltoid, who is aware of Alex's activities and cautions him.\r\nAlex's droogs express discontent with petty crime and want more equality and high-yield thefts, but Alex asserts his authority by attacking them. Later, Alex invades the home of a wealthy \"cat-lady\" and bludgeons her with a phallic sculpture while his droogs remain outside. On hearing sirens, Alex tries to flee, but Dim smashes a bottle in his face, stunning Alex and leaving him to be arrested. Deltoid brings word that the woman has died of her injuries, and Alex is convicted of murder and sentenced to 14 years in prison.\r\nTwo years into the sentence, Alex eagerly takes up an offer to be a test subject for the Minister of the Interior's new Ludovico technique, an experimental aversion therapy for rehabilitating criminals within two weeks. Alex is strapped to a chair, his eyes are clamped open, and he is injected with drugs. He is then forced to watch films of sex and violence, some of which are accompanied by the music of his favourite composer, Ludwig van Beethoven. Alex becomes nauseated by the films and, fearing the technique will make him sick upon hearing Beethoven, begs for an end to the treatment.\r\nTwo weeks later, the Minister demonstrates Alex's rehabilitation to a gathering of officials. Alex is unable to fight back against an actor who taunts and attacks him and becomes ill wanting sex with a topless woman. The prison chaplain complains that Alex has been robbed of his free will; the Minister asserts that the Ludovico technique will cut crime and alleviate crowding in prisons.\r\nAlex is released from prison, only to find that the police have sold his possessions to provide compensation to his victims and his parents have let out his room. Alex encounters an elderly vagrant whom he attacked years earlier, and the vagrant and his friends attack him. Alex is saved by two policemen but is shocked to find they are his former droogs Dim and Georgie. They drive him to the countryside, beat him, and nearly drown him before abandoning him. Alex barely makes it to the doorstep of a nearby home before collapsing.\r\nAlex wakes up to find himself in the home of Mr Alexander, who is now using a wheelchair. Alexander does not recognise Alex from the previous attack, but knows of him and the Ludovico technique from the newspapers. He sees Alex as a political weapon and prepares to present him to his colleagues. While bathing, Alex breaks into \"Singin' in the Rain\", causing Alexander to realise that Alex was the person who assaulted his wife and him. With help from his colleagues, Alexander drugs Alex and locks him in an upstairs bedroom. He then plays Beethoven's Ninth Symphony loudly from the floor below. Unable to withstand the sickening pain, Alex attempts suicide by jumping out of the window.\r\nAlex survives the attempt and wakes up in hospital with multiple injuries. While being given a series of psychological tests, he finds that he no longer has aversions to violence and sex. The Minister arrives and apologises to Alex. He offers to take care of Alex and get him a job in return for his co-operation with his election campaign and public relations counter-offensive. As a sign of goodwill, the Minister brings in a stereo system playing Beethoven's Ninth. Alex then contemplates violence and has vivid thoughts of having sex with a woman in front of an approving crowd, thinking to himself, \"I was cured, all right!\"\r\nCast\r\nMalcolm McDowell as Alex DeLarge\r\nPatrick Magee as Frank Alexander\r\nMichael Bates as Chief Guard Barnes\r\nWarren Clarke as Dim\r\nMichael Tarn as Pete\r\nJohn Clive as Stage Actor\r\nAdrienne Corri as Mary Alexander\r\nCarl Duering as Dr Brodsky\r\nPaul Farrell as Tramp\r\nClive Francis as Joe the Lodger\r\nMichael Gover as Prison Governor\r\nMiriam Karlin as \"Catlady\" Weathers\r\nJames Marcus as Georgie\r\nAubrey Morris as P. R. Deltoid\r\nGodfrey Quigley as Prison Chaplain\r\nSheila Raynor as Mum\r\nMadge Ryan as Dr Branom\r\nJohn Savident as Conspirator Dolin\r\nAnthony Sharp as Frederick, Minister of the Interior\r\nPhilip Stone as Dad\r\nPauline Taylor as Dr Taylor\r\nMargaret Tyzack as Conspirator Rubinstein\r\nThere were early roles for Steven Berkoff, David Prowse, and Carol Drinkwater.\r\nThemes\r\nMorality\r\nThe film's central moral question is the definition of \"goodness\" and whether it makes sense to use aversion therapy to stop immoral behaviour. Stanley Kubrick, writing in Saturday Review, described the film: \"A social satire dealing with the question of whether behavioural psychology and psychological conditioning are dangerous new weapons for a totalitarian government to use to impose vast controls on its citizens and turn them into little more than robots.\" Similarly, on the production's call sheet, Kubrick wrote: \"It is a story of the dubious redemption of a teenage delinquent by condition-reflex therapy. It is, at the same time, a running lecture on free-will.\"\r\nAfter aversion therapy, Alex behaves like a good member of society, though not through choice. His goodness is involuntary; he has become the titular clockwork orange—organic on the outside, mechanical on the inside. After Alex has undergone the Ludovico technique, the chaplain criticises his new attitude as false, arguing that true goodness must come from within. This leads to the theme of abusing liberties—personal, governmental, civil—by Alex, with two conflicting political forces, the Government and the Dissidents, both manipulating Alex purely for their own political ends. The story portrays the \"conservative\" and \"leftist\" parties as equally worthy of criticism. The writer Frank Alexander, a victim of Alex and his gang, wants revenge against Alex and sees him as a means of definitively turning the populace against the incumbent government and its new regime. He fears the new government and, in a telephone conversation, he says: \"Recruiting brutal young roughs into the police; proposing debilitating and will-sapping techniques of conditioning. Oh, we've seen it all before in other countries; the thin end of the wedge! Before we know where we are, we shall have the full apparatus of totalitarianism.\"\r\nOn the other side, the Minister of the Interior (the Government) jails Mr Alexander (the Dissident Intellectual) on the excuse of his endangering Alex (the People), rather than the government's totalitarian regime (described by Mr Alexander). It is unclear whether he has been harmed; however, the Minister tells Alex that the writer has been denied the ability to write and produce \"subversive\" material that is critical of the incumbent government and meant to provoke political unrest.\r\nPsychology\r\nThe film critiques the behaviourism or \"behavioural psychology\" propounded by psychologists John B. Watson and B. F. Skinner. Burgess disapproved of behaviourism, calling Skinner's book Beyond Freedom and Dignity (1971) \"one of the most dangerous books ever written\". Although behaviourism's limitations were conceded by its principal founder, Watson, Skinner argued that behaviour modification—specifically, operant conditioning (learned behaviours via systematic reward-and-punishment techniques) rather than the \"classical\" Watsonian conditioning—is the key to an ideal society. The film's Ludovico technique is widely perceived as a parody of aversion therapy, which is a form of classical conditioning.\r\nAuthor Paul Duncan said: \"Alex is the narrator so we see everything from his point of view, including his mental images. The implication is that all of the images, both real and imagined, are part of Alex's fantasies.\"\r\nPsychiatrist Aaron Stern, the former head of the MPAA rating board, believed that Alex represents man in his natural state, the unconscious mind. Alex becomes \"civilised\" after receiving his Ludovico \"cure\" and the sickness in the aftermath Stern considered to be the \"neurosis imposed by society\".\r\nKubrick told film critics Philip Strick and Penelope Houston: \"Alex makes no attempt to deceive himself or the audience as to his total corruption or wickedness. He is the very personification of evil. On the other hand, he has winning qualities: his total candour, his wit, his intelligence, and his energy; these are attractive qualities and ones, I might add, which he shares with Richard III.\"\r\nSociety\r\nThe society depicted in the film was perceived by some as Communist (as Michel Ciment pointed out in an interview with Kubrick) due to its slight ties to Russian culture. The teenage slang has a heavily Russian influence, as in the novel; Burgess explains the slang as being, in part, intended to draw a reader into the world of the book's characters and to prevent the book from becoming outdated. There is some evidence to suggest that the society is a socialist one, or perhaps a society evolving from a failed socialism into an authoritarian society. In the novel, streets have paintings of working men in the style of Russian socialist art, and the film shows a mural of socialist artwork with obscenities drawn on it. As Malcolm McDowell points out on the DVD commentary, Alex's residence was shot on failed municipal architecture and the name \"Municipal Flat Block 18A, Linear North\" alludes to socialist-style housing.\r\nWhen the new right-wing government takes power, the atmosphere is certainly more authoritarian than the anarchist air of the beginning. Kubrick's response to Ciment's question remained ambiguous as to what kind of society it is. Kubrick asserted that the film held comparisons between both ends of the political spectrum and that there is little difference between the two. Kubrick stated: \"The Minister, played by Anthony Sharp, is clearly a figure of the Right. The writer, Patrick Magee, is a lunatic of the Left... They differ only in their dogma. Their means and ends are hardly distinguishable.\"\r\nProduction\r\nAnthony Burgess sold the film rights of his novel for US$500 (equivalent to $4,800 in 2022), shortly after its publication in 1962. Originally, the film was projected to star the rock band The Rolling Stones, with the band's lead singer Mick Jagger expressing interest in playing the lead role of Alex, and British filmmaker Ken Russell attached to direct. However, this never came to fruition due to problems with the British Board of Film Classification (BBFC), and the rights ultimately fell to Kubrick.\r\nMcDowell was chosen for the role of Alex after Kubrick saw him in the film if.... (1968). When asking why he was picked for the role, Kubrick told him: \"You can exude intelligence on the screen.\" He also helped Kubrick on the uniform of Alex's gang, when he showed Kubrick the cricket whites he had. Kubrick asked him to put the box (jockstrap) not under but on top of the costume.\r\nDuring the filming of the Ludovico technique scene, McDowell scratched a cornea and was temporarily blinded. The doctor standing next to him in the scene, dropping saline solution into Alex's forced-open eyes, was a real physician present to prevent the actor's eyes from drying. McDowell also cracked some ribs filming the humiliation stage show. A unique special effect technique was used when Alex jumps out of the window in a suicide attempt, showing the camera approaching the ground from Alex's point of view. This effect was achieved by dropping a Newman-Sinclair clockwork camera in a box, lens-first, from the third storey of the Corus Hotel. To Kubrick's surprise, the camera survived six takes.\r\nAdaptation\r\nThe cinematic adaptation of A Clockwork Orange (1962) was not initially planned. Screenplay writer Terry Southern gave Kubrick a copy of the novel, but, as he was developing a Napoleon Bonaparte-related project, Kubrick put it aside. Kubrick's wife, in an interview, said she had given Kubrick the novel after having read it. Kubrick said: \"I was excited by everything about it: the plot, the ideas, the characters, and, of course, the language. The story functions, of course, on several levels: political, sociological, philosophical, and, what's most important, on a dreamlike psychological-symbolic level.\" Kubrick wrote a screenplay faithful to the novel, saying: \"I think whatever Burgess had to say about the story was said in the book, but I did invent a few useful narrative ideas and reshape some of the scenes.\" Kubrick based the script on the shortened US edition of the book, which omitted the final chapter.\r\nDirection\r\nKubrick was a perfectionist who researched meticulously, with thousands of photographs taken of potential locations, and many scene takes. Like Malcolm McDowell, he usually \"got it right\" early on, so there were few takes. He was so meticulous that McDowell stated: \"If Kubrick hadn't been a film director he'd have been a General Chief of Staff of the US Forces. No matter what it is—even if it's a question of buying a shampoo it goes through him. He just likes total control.\" Filming took place between September 1970 and April 1971. Technically, to achieve and convey the fantastic, dream-like quality of the story, he filmed with extreme wide-angle lenses such as the Kinoptik Tegea 9.8 mm for 35 mm Arriflex cameras.\r\nMusic\r\nThe main theme is an electronic arrangement of a short excerpt from Henry Purcell's Music for the Funeral of Queen Mary, and the soundtrack has two of Edward Elgar's Pomp and Circumstance Marches.\r\nAlex is fanatical about Ludwig van Beethoven in general and his Ninth Symphony in particular, and the soundtrack includes an electronic version specially arranged by Wendy Carlos of the Scherzo and other parts of the Symphony. The soundtrack contains more music by Rossini than by Beethoven. The fast-motion sex scene with the two girls, the slow-motion fight between Alex and his Droogs, the fight with Billy Boy's gang, the drive to the writer's home (\"playing 'hogs of the road'\"), the invasion of the Cat Lady's home, and the scene in which Alex looks into the river and contemplates suicide before being approached by the beggar are all accompanied by Rossini's William Tell Overture or The Thieving Magpie Overture.\r\nReception\r\nCritical reception\r\nOn release, A Clockwork Orange was met with mixed reviews. Vincent Canby of The New York Times praised the film: \"McDowell is splendid as tomorrow's child, but it is always Mr. Kubrick's picture, which is even technically more interesting than 2001. Among other devices, Mr. Kubrick constantly uses what I assume to be a wide-angle lens to distort space relationships within scenes, so that the disconnection between lives, and between people and environment, becomes an actual, literal fact.\" The following year, after the film won the New York Film Critics Award, he called it \"a brilliant and dangerous work, but it is dangerous in a way that brilliant things sometimes are\". The film also had notable detractors. Film critic Stanley Kauffmann commented, \"Inexplicably, the script leaves out Burgess' reference to the title\". Roger Ebert gave A Clockwork Orange two stars out of four, calling it an \"ideological mess\". In her New Yorker review titled \"Stanley Strangelove\", Pauline Kael called it pornographic because of how it dehumanised Alex's victims while highlighting the sufferings of the protagonist. Kael derided Kubrick as a \"bad pornographer\", noting the Billyboy's gang extended stripping of the very buxom woman they intended to rape, claiming it was offered for titillation.\r\nJohn Simon noted that the novel's most ambitious effects were based on language and the alienating effect of the narrator's Nadsat slang, making it a poor choice for a film. Concurring with some of Kael's criticisms about the depiction of Alex's victims, Simon noted that the character of Mr Alexander, who was young and likeable in the novel, was played by Patrick Magee, \"a very quirky and middle-aged actor who specialises in being repellent\". Simon comments further that \"Kubrick over-directs the basically excessive Magee until his eyes erupt like missiles from their silos and his face turns every shade of a Technicolor sunset\".\r\nOver the years, A Clockwork Orange gained a status as a cult classic. For The Guardian, Philip French stated that the film's controversial reputation likely stemmed from the fact that it was released during a time when fear of teenage delinquency was high. Adam Nayman of The Ringer wrote that the film's themes of delinquency, corrupt power structures and dehumanisation are relevant in today's society. Simon Braund of Empire praised the \"dazzling visual style\" and McDowell's \"simply astonishing\" portrayal of Alex. Roger Ebert softened on the film years after first viewing it, declaring on his talk show that while he still thought the film had \"all head and no heart\", he felt Kubrick's detachments from the violence more so than he did in the first viewing.\r\nOn review aggregator website Rotten Tomatoes, the film holds an approval rating of 88% based on 80 reviews, with an average rating of 8.8/10. The website's critical consensus reads: \"Disturbing and thought-provoking, A Clockwork Orange is a cold, dystopian nightmare with a very dark sense of humor\". Metacritic gives the film a score of 77 out of 100, based on reviews by 21 critics, indicating \"generally favorable reviews\".\r\nBox office\r\nThe film was a box-office success, grossing $41 million in the United States and about $73 million overseas for a worldwide total of $114 million on a budget of $1.3 million.\r\nThe film was also successful in the United Kingdom, playing for over a year at the Warner West End in London. After two years of release, the film had earned Warner Bros. rentals of $2.5 million in the United Kingdom and was the number three film for 1973 behind Live and Let Die and The Godfather.\r\nThe film was the most popular film of 1972 in France with 7,611,745 admissions.\r\nThe film was re-released in North America in 1973 and earned $1.5 million in rentals.\r\nControversies\r\nAmerican version\r\nIn the United States, A Clockwork Orange was given an X rating in its original release in 1972. Later, Kubrick replaced approximately 30 seconds of sexually explicit footage from two scenes with less explicit action to obtain an R rating re-release later in 1972.\r\nBecause of the explicit sex and violence, The National Catholic Office for Motion Pictures rated it C (\"condemned\"), a rating which forbade Roman Catholics seeing the film. In 1982, the office abolished the \"condemned\" rating. Subsequently, films deemed to have unacceptable levels of sex and violence by the Conference of Bishops are rated O, \"morally offensive\".\r\nBritish withdrawal\r\nAlthough it was passed uncut for UK cinemas in December 1971, British authorities considered the sexual violence in the film to be extreme. In March 1972, during the trial of a 14-year-old boy accused of the manslaughter of a classmate, the prosecutor referred to A Clockwork Orange, suggesting that the film had a macabre relevance to the case. The film was linked to the murder of an elderly vagrant by a 16-year-old boy in Bletchley, Buckinghamshire, who pleaded guilty after telling police that friends had told him of the film \"and the beating up of an old boy like this one\". Roger Gray, for the defence, told the court that \"the link between this crime and sensational literature, particularly A Clockwork Orange, is established beyond reasonable doubt\". The press also blamed the film for a rape in which the attackers sang \"Singin' in the Rain\" as \"Singin' in the Rape\". Christiane Kubrick, the director's wife, has said that the family received threats and had protesters outside their home.\r\nThe film was withdrawn from British release in 1973 by Warner Bros at the request of Kubrick. In response to allegations that the film was responsible for copycat violence Kubrick stated:\r\nTo try and fasten any responsibility on art as the cause of life seems to me to put the case the wrong way around. Art consists of reshaping life, but it does not create life, nor cause life. Furthermore, to attribute powerful suggestive qualities to a film is at odds with the scientifically accepted view that, even after deep hypnosis in a posthypnotic state, people cannot be made to do things which are at odds with their natures.\r\nThe Scala Cinema Club went into receivership in 1993 after losing a legal battle following an unauthorised screening of the film. In the same year, Channel 4 broadcast Forbidden Fruit, a 27-minute documentary about the withdrawal of the film in Britain. It contains footage from A Clockwork Orange. It was difficult to see A Clockwork Orange in the United Kingdom for 27 years. It was only after Kubrick died in 1999 that the film was re-released theatrically, on VHS, and on DVD. On 4 July 2001, the uncut version premiered on Sky TV's Sky Box Office, where it ran until mid-September.\r\nCensorship in other countries\r\nIn Ireland, the film was banned on 10 April 1973. Warner Bros. decided against appealing the decision. Eventually, the film was passed uncut for cinema on 13 December 1999 and released on 17 March 2000. The re-release poster, a replica of the original British version, was rejected due to the words \"ultra-violence\" and \"rape\" in the tagline. Head censor Sheamus Smith explained his rejection to The Irish Times: \"I believe that the use of those words in the context of advertising would be offensive and inappropriate.\"\r\nIn Singapore, the film was banned for over 30 years, before an attempt at release was made in 2006. However, the submission for an M18 rating was rejected, and the ban was not lifted. The ban was later lifted and the film was shown uncut (with an R21 rating) on 28 October 2011, as part of the Perspectives Film Festival.\r\nIn South Africa, it was banned under the apartheid regime for 13 years, then in 1984 was released with one cut and only made available to people over the age of 21. It was banned in South Korea and in the Canadian provinces of Alberta and Nova Scotia. The Maritime Film Classification Board also reversed the ban eventually. Both jurisdictions now grant an R rating to the film.\r\nIn Brazil, the film was banned under the military dictatorship until 1978, when the film was released in a version with black dots covering the genitals and breasts of the actors in the nude scenes.\r\nIn Spain, the film debuted at the 1975 Valladolid International Film Festival under the dictatorship of Francisco Franco. It was expected to be screened in the University of Valladolid but, due to student protests, the university had been closed for two months. The final screenings were in the commercial festival venues, with long queues of expectant students. After the festival, the film went into the arthouse circuit and later in commercial cinemas successfully.\r\nIn Malta, a ban on the film was lifted in 2000, when it was shown in local cinemas for the first time. The film was brought up during the compilation of evidence on the rape and murder of Paulina Dembska, which took place on 2 January 2022 in Sliema, for the accused attacker compared himself to Alex during police interrogation.\r\nNovelist's response\r\nBurgess had mixed reception about the film adaptation of his novel, publicly saying he loved Malcolm McDowell and Michael Bates, and the use of music. He praised it as so \"brilliant\" that it might be dangerous. He was concerned that it lacked the novel's redemptive final chapter, an absence he blamed upon his American publisher and not Kubrick. All US editions of the novel prior to 1986 omit the final chapter. Kubrick called the missing chapter \"an extra chapter\" and claimed that he had not read the original version until he had virtually finished the screenplay, and that he had never seriously considered using it. In Kubrick's opinion – as in the opinion of other readers, including the original American editor – the final chapter was unconvincing and inconsistent with the book.\r\nBurgess reports in his autobiography You've Had Your Time (1990) that he and Kubrick at first enjoyed a good relationship, each holding similar philosophical and political views and each very interested in literature, cinema, music, and Napoleon Bonaparte. Burgess's novel Napoleon Symphony (1974) was dedicated to Kubrick. Their relationship soured when Kubrick left Burgess to defend the film from accusations of glorifying violence. A lapsed Catholic, Burgess tried many times to explain the Christian moral points of the story to outraged Christian organisations and to defend it against newspaper accusations that it supported fascist dogma. He also went to receive awards given to Kubrick on his behalf. He was in no way involved in the production of the film. The only profit he made directly from the film was the initial $500 that had been given to him for the rights to the adaptation.\r\nBurgess's own stage adaptation of the novel, A Clockwork Orange: A Play with Music (1984), contains a direct reference to Kubrick. In the final moment of the play Alex joins in a song with the other characters. In the script's stage directions it states that while this happens: \"A man bearded like Stanley Kubrick comes on playing, in exquisite counterpoint, 'Singin’ in the Rain' on the trumpet. He is kicked off the stage.\"\r\nAccolades\r\nComparison of film and novel\r\nKubrick's film is relatively faithful to the Burgess novel, omitting only the final, positive chapter, in which Alex matures and outgrows sociopathy. While the film ends with Alex being offered an open-ended government job, implying he remains a sociopath at heart, the novel ends with Alex's positive change in character. This plot discrepancy occurred because Kubrick based his screenplay on the novel's American edition, in which the final chapter had been deleted on the insistence of its American publisher. He claimed not to have read the complete, original version of the novel until he had almost finished writing the screenplay, and that he never considered using it. The introduction to the 1996 edition of A Clockwork Orange says that Kubrick found the end of the original edition too blandly optimistic and unrealistic.\r\nCritic Randy Rasmussen has argued that the government in the film is in a shambolic state of desperation, whereas the government in the novel is quite strong and self-confident. The former reflects Kubrick's preoccupation with the theme of acts of self-interest masked as simply following procedure.One example of this would be differences in the portrayal of P. R. Deltoid, Alex's \"post-corrective advisor\". In the novel, P. R. Deltoid appears to have some moral authority (although not enough to prevent Alex from lying to him or engaging in crime, despite his protests). In the film, Deltoid is slightly sadistic and seems to have a sexual interest in Alex, interviewing him in his parents' bedroom and smacking him in the crotch.\r\nIn the film, Alex has a pet snake. There is no mention of this in the novel.\r\nIn the film Alex's prison number is 655321, in the book his prisoner number is 6655321.\r\nIn the novel, F. Alexander recognises Alex through several careless references to the previous attack (such as his wife then claiming they did not have a telephone). In the film, Alex is recognised when singing the song 'Singing in the Rain' in the bath, which he had hauntingly done while attacking F. Alexander's wife. The song does not appear at all in the book, as it was an improvisation by actor Malcolm McDowell when Kubrick complained that the rape scene was too \"stiff\".\r\nHome media\r\nIn the US, the film has been widely available on home video since 1980 and was re-released several times on VHS. It was first released on DVD in the US on 29 June 1999.\r\nIn the UK, the film was eventually released by Warner Home Video on 13 November 2000 (on both VHS and DVD), individually and as part of The Stanley Kubrick Collection DVD set. Due to negative comments from fans, Warner Bros re-released the film, its image digitally restored and its soundtrack remastered. A limited-edition collector's set with a soundtrack disc, film poster, booklet, and filmstrip followed, and was discontinued. In 2005, a British re-release, packaged as an \"Iconic Film\" in a limited-edition slipcase was published, identical to the remastered DVD set, except for different package cover art. In 2006, Warner Bros announced the September publication of a two-disc special edition featuring a Malcolm McDowell commentary, and the releases of other two-disc sets of Stanley Kubrick films. Several British retailers had set the release date as 6 November 2006. The release was delayed and re-announced for the 2007 Holiday Season.\r\nAn HD DVD, Blu-ray, and DVD version was re-released on 23 October 2007, alongside four other Kubrick classics, with 1080p video transfers and remixed Dolby TrueHD 5.1 (for HD DVD) and uncompressed 5.1 PCM (for Blu-ray) audio tracks. Unlike the previous version, the DVD re-release edition is anamorphically enhanced. The Blu-ray was reissued for the 40th anniversary of the film's release, identical to the previously released Blu-ray, plus a Digibook and the Stanley Kubrick: A Life in Pictures documentary as a bonus feature.\r\nIn 2021, a 4K restoration was completed with Kubrick's former assistant Leon Vitali working closely with Warner Bros. It was released in the US on 21 September 2021 and 4 October 2021 in the UK.\r\nLegacy and influence\r\nAlong with Bonnie and Clyde (1967), Night of the Living Dead (1968), The Wild Bunch (1969), Soldier Blue (1970), Dirty Harry (1971), and Straw Dogs (1971), the film is considered a landmark in the relaxation of control on violence in cinema.\r\nA Clockwork Orange remains an influential work in cinema and other media. The film is frequently referenced in popular culture, which Adam Chandler of The Atlantic attributes to Kubrick's \"genre-less\" directing techniques that brought novel innovation in filming, music, and production that had not been seen at the time of the film's original release.\r\nThe Village Voice ranked A Clockwork Orange at number 112 in its Top 250 \"Best Films of the Century\" list in 1999, based on a poll of critics. The film appears several times on the American Film Institute's (AFI) top movie lists. The film was listed at No. 46 in the 1998 AFI's 100 Years... 100 Movies, at No. 70 in the 2007 second listing. \"Alex DeLarge\" is listed 12th in the villains section of the AFI's 100 Years... 100 Heroes and Villains. In 2008, the AFI's 10 Top 10 rated A Clockwork Orange as the 4th greatest science-fiction movie to date. The film was also placed 21st in the AFI's 100 Years... 100 Thrills\r\nIn the British Film Institute's 2012 Sight & Sound polls of the world's greatest films, A Clockwork Orange was ranked 75th in the directors' poll and 235th in the critics' poll. In 2010, Time magazine placed it 9th on their list of the Top 10 Ridiculously Violent Movies. In 2008, Empire ranked it 37th on their list of \"The 500 Greatest Movies of All Time\", and in 2013, Empire ranked it 11th on their list of \"The 100 Best British Films Ever\". In 2010, The Guardian ranked the film 6th in its list of 25 greatest arthouse films. The Spanish director Luis Buñuel praised the film highly. He once said: \"A Clockwork Orange is my current favourite. I was predisposed against the film. After seeing it, I realised it is only a movie about what the modern world really means\".\r\nA Clockwork Orange was added to the United States' National Film Registry in 2020 as a work considered to be \"culturally, historically or aesthetically\" significant.",
    "html": "<p>A Clockwork Orange is a 1971 dystopian crime film adapted, produced, and directed by Stanley Kubrick, based on Anthony Burgess's 1962 novel of the same name. It employs disturbing, violent images to comment on psychiatry, juvenile delinquency, youth gangs, and other social, political, and economic subjects in a dystopian near-future Britain.</p><p>Alex (Malcolm McDowell), the central character, is a charismatic, antisocial delinquent whose interests include classical music (especially Beethoven), committing rape, theft, and ultra-violence. He leads a small gang of thugs, Pete (Michael Tarn), Georgie (James Marcus), and Dim (Warren Clarke), whom he calls his droogs (from the Russian word друг, which is \"friend\", \"buddy\"). The film chronicles the horrific crime spree of his gang, his capture, and attempted rehabilitation via an experimental psychological conditioning technique (the \"Ludovico Technique\") promoted by the Minister of the Interior (Anthony Sharp). Alex narrates most of the film in Nadsat, a fractured adolescent slang composed of Slavic languages (especially Russian), English, and Cockney rhyming slang.</p><p>The film premiered in New York City on 19 December 1971 and was released in the United Kingdom on 13 January 1972. The film was met with polarised reviews from critics and was controversial due to its depictions of graphic violence. After it was cited as having inspired copycat acts of violence, the film was withdrawn from British cinemas at Kubrick's behest, and it was also banned in several other countries. In the years following, the film underwent a critical re-evaluation and gained a cult following. It received several awards and nominations, including four nominations at the 44th Academy Awards, including Best Picture.</p><p>In the British Film Institute's 2012 Sight & Sound polls of the world's greatest films, A Clockwork Orange was ranked 75th in the directors' poll and 235th in the critics' poll. In 2020, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".</p><br/><h3>Plot</h3><p>In a futuristic Britain, Alex DeLarge is the leader of a gang of \"droogs\": Georgie, Dim and Pete. One night, after getting intoxicated on drug-laden \"milk-plus\", they engage in an evening of \"ultra-violence\", which includes a fight with a rival gang. They drive to the country home of writer Frank Alexander and trick his wife into letting them inside. They beat Alexander to the point of crippling him, and Alex violently rapes Alexander's wife while singing \"Singin' in the Rain\". The next day, while truant from school, Alex is approached by his probation officer, PR Deltoid, who is aware of Alex's activities and cautions him.</p><p>Alex's droogs express discontent with petty crime and want more equality and high-yield thefts, but Alex asserts his authority by attacking them. Later, Alex invades the home of a wealthy \"cat-lady\" and bludgeons her with a phallic sculpture while his droogs remain outside. On hearing sirens, Alex tries to flee, but Dim smashes a bottle in his face, stunning Alex and leaving him to be arrested. Deltoid brings word that the woman has died of her injuries, and Alex is convicted of murder and sentenced to 14 years in prison.</p><p>Two years into the sentence, Alex eagerly takes up an offer to be a test subject for the Minister of the Interior's new Ludovico technique, an experimental aversion therapy for rehabilitating criminals within two weeks. Alex is strapped to a chair, his eyes are clamped open, and he is injected with drugs. He is then forced to watch films of sex and violence, some of which are accompanied by the music of his favourite composer, Ludwig van Beethoven. Alex becomes nauseated by the films and, fearing the technique will make him sick upon hearing Beethoven, begs for an end to the treatment.</p><p>Two weeks later, the Minister demonstrates Alex's rehabilitation to a gathering of officials. Alex is unable to fight back against an actor who taunts and attacks him and becomes ill wanting sex with a topless woman. The prison chaplain complains that Alex has been robbed of his free will; the Minister asserts that the Ludovico technique will cut crime and alleviate crowding in prisons.</p><p>Alex is released from prison, only to find that the police have sold his possessions to provide compensation to his victims and his parents have let out his room. Alex encounters an elderly vagrant whom he attacked years earlier, and the vagrant and his friends attack him. Alex is saved by two policemen but is shocked to find they are his former droogs Dim and Georgie. They drive him to the countryside, beat him, and nearly drown him before abandoning him. Alex barely makes it to the doorstep of a nearby home before collapsing.</p><p>Alex wakes up to find himself in the home of Mr Alexander, who is now using a wheelchair. Alexander does not recognise Alex from the previous attack, but knows of him and the Ludovico technique from the newspapers. He sees Alex as a political weapon and prepares to present him to his colleagues. While bathing, Alex breaks into \"Singin' in the Rain\", causing Alexander to realise that Alex was the person who assaulted his wife and him. With help from his colleagues, Alexander drugs Alex and locks him in an upstairs bedroom. He then plays Beethoven's Ninth Symphony loudly from the floor below. Unable to withstand the sickening pain, Alex attempts suicide by jumping out of the window.</p><p>Alex survives the attempt and wakes up in hospital with multiple injuries. While being given a series of psychological tests, he finds that he no longer has aversions to violence and sex. The Minister arrives and apologises to Alex. He offers to take care of Alex and get him a job in return for his co-operation with his election campaign and public relations counter-offensive. As a sign of goodwill, the Minister brings in a stereo system playing Beethoven's Ninth. Alex then contemplates violence and has vivid thoughts of having sex with a woman in front of an approving crowd, thinking to himself, \"I was cured, all right!\"</p><br/><h3>Cast</h3><ul><li>Malcolm McDowell as Alex DeLarge</li><li>Patrick Magee as Frank Alexander</li><li>Michael Bates as Chief Guard Barnes</li><li>Warren Clarke as Dim</li><li>Michael Tarn as Pete</li><li>John Clive as Stage Actor</li><li>Adrienne Corri as Mary Alexander</li><li>Carl Duering as Dr Brodsky</li><li>Paul Farrell as Tramp</li><li>Clive Francis as Joe the Lodger</li><li>Michael Gover as Prison Governor</li><li>Miriam Karlin as \"Catlady\" Weathers</li><li>James Marcus as Georgie</li><li>Aubrey Morris as P. R. Deltoid</li><li>Godfrey Quigley as Prison Chaplain</li><li>Sheila Raynor as Mum</li><li>Madge Ryan as Dr Branom</li><li>John Savident as Conspirator Dolin</li><li>Anthony Sharp as Frederick, Minister of the Interior</li><li>Philip Stone as Dad</li><li>Pauline Taylor as Dr Taylor</li><li>Margaret Tyzack as Conspirator Rubinstein</li></ul><p>There were early roles for Steven Berkoff, David Prowse, and Carol Drinkwater.</p><br/><h3>Themes</h3><h4>Morality</h4><p>The film's central moral question is the definition of \"goodness\" and whether it makes sense to use aversion therapy to stop immoral behaviour. Stanley Kubrick, writing in Saturday Review, described the film: \"A social satire dealing with the question of whether behavioural psychology and psychological conditioning are dangerous new weapons for a totalitarian government to use to impose vast controls on its citizens and turn them into little more than robots.\" Similarly, on the production's call sheet, Kubrick wrote: \"It is a story of the dubious redemption of a teenage delinquent by condition-reflex therapy. It is, at the same time, a running lecture on free-will.\"</p><p>After aversion therapy, Alex behaves like a good member of society, though not through choice. His goodness is involuntary; he has become the titular clockwork orange—organic on the outside, mechanical on the inside. After Alex has undergone the Ludovico technique, the chaplain criticises his new attitude as false, arguing that true goodness must come from within. This leads to the theme of abusing liberties—personal, governmental, civil—by Alex, with two conflicting political forces, the Government and the Dissidents, both manipulating Alex purely for their own political ends. The story portrays the \"conservative\" and \"leftist\" parties as equally worthy of criticism. The writer Frank Alexander, a victim of Alex and his gang, wants revenge against Alex and sees him as a means of definitively turning the populace against the incumbent government and its new regime. He fears the new government and, in a telephone conversation, he says: \"Recruiting brutal young roughs into the police; proposing debilitating and will-sapping techniques of conditioning. Oh, we've seen it all before in other countries; the thin end of the wedge! Before we know where we are, we shall have the full apparatus of totalitarianism.\"</p><p>On the other side, the Minister of the Interior (the Government) jails Mr Alexander (the Dissident Intellectual) on the excuse of his endangering Alex (the People), rather than the government's totalitarian regime (described by Mr Alexander). It is unclear whether he has been harmed; however, the Minister tells Alex that the writer has been denied the ability to write and produce \"subversive\" material that is critical of the incumbent government and meant to provoke political unrest.</p><h4>Psychology</h4><p>The film critiques the behaviourism or \"behavioural psychology\" propounded by psychologists John B. Watson and B. F. Skinner. Burgess disapproved of behaviourism, calling Skinner's book Beyond Freedom and Dignity (1971) \"one of the most dangerous books ever written\". Although behaviourism's limitations were conceded by its principal founder, Watson, Skinner argued that behaviour modification—specifically, operant conditioning (learned behaviours via systematic reward-and-punishment techniques) rather than the \"classical\" Watsonian conditioning—is the key to an ideal society. The film's Ludovico technique is widely perceived as a parody of aversion therapy, which is a form of classical conditioning.</p><p>Author Paul Duncan said: \"Alex is the narrator so we see everything from his point of view, including his mental images. The implication is that all of the images, both real and imagined, are part of Alex's fantasies.\"</p><p>Psychiatrist Aaron Stern, the former head of the MPAA rating board, believed that Alex represents man in his natural state, the unconscious mind. Alex becomes \"civilised\" after receiving his Ludovico \"cure\" and the sickness in the aftermath Stern considered to be the \"neurosis imposed by society\".</p><p>Kubrick told film critics Philip Strick and Penelope Houston: \"Alex makes no attempt to deceive himself or the audience as to his total corruption or wickedness. He is the very personification of evil. On the other hand, he has winning qualities: his total candour, his wit, his intelligence, and his energy; these are attractive qualities and ones, I might add, which he shares with Richard III.\"</p><h4>Society</h4><p>The society depicted in the film was perceived by some as Communist (as Michel Ciment pointed out in an interview with Kubrick) due to its slight ties to Russian culture. The teenage slang has a heavily Russian influence, as in the novel; Burgess explains the slang as being, in part, intended to draw a reader into the world of the book's characters and to prevent the book from becoming outdated. There is some evidence to suggest that the society is a socialist one, or perhaps a society evolving from a failed socialism into an authoritarian society. In the novel, streets have paintings of working men in the style of Russian socialist art, and the film shows a mural of socialist artwork with obscenities drawn on it. As Malcolm McDowell points out on the DVD commentary, Alex's residence was shot on failed municipal architecture and the name \"Municipal Flat Block 18A, Linear North\" alludes to socialist-style housing.</p><p>When the new right-wing government takes power, the atmosphere is certainly more authoritarian than the anarchist air of the beginning. Kubrick's response to Ciment's question remained ambiguous as to what kind of society it is. Kubrick asserted that the film held comparisons between both ends of the political spectrum and that there is little difference between the two. Kubrick stated: \"The Minister, played by Anthony Sharp, is clearly a figure of the Right. The writer, Patrick Magee, is a lunatic of the Left... They differ only in their dogma. Their means and ends are hardly distinguishable.\"</p><br/><h3>Production</h3><p>Anthony Burgess sold the film rights of his novel for US$500 (equivalent to $4,800 in 2022), shortly after its publication in 1962. Originally, the film was projected to star the rock band The Rolling Stones, with the band's lead singer Mick Jagger expressing interest in playing the lead role of Alex, and British filmmaker Ken Russell attached to direct. However, this never came to fruition due to problems with the British Board of Film Classification (BBFC), and the rights ultimately fell to Kubrick.</p><p>McDowell was chosen for the role of Alex after Kubrick saw him in the film if.... (1968). When asking why he was picked for the role, Kubrick told him: \"You can exude intelligence on the screen.\" He also helped Kubrick on the uniform of Alex's gang, when he showed Kubrick the cricket whites he had. Kubrick asked him to put the box (jockstrap) not under but on top of the costume.</p><p>During the filming of the Ludovico technique scene, McDowell scratched a cornea and was temporarily blinded. The doctor standing next to him in the scene, dropping saline solution into Alex's forced-open eyes, was a real physician present to prevent the actor's eyes from drying. McDowell also cracked some ribs filming the humiliation stage show. A unique special effect technique was used when Alex jumps out of the window in a suicide attempt, showing the camera approaching the ground from Alex's point of view. This effect was achieved by dropping a Newman-Sinclair clockwork camera in a box, lens-first, from the third storey of the Corus Hotel. To Kubrick's surprise, the camera survived six takes.</p><h4>Adaptation</h4><p>The cinematic adaptation of A Clockwork Orange (1962) was not initially planned. Screenplay writer Terry Southern gave Kubrick a copy of the novel, but, as he was developing a Napoleon Bonaparte-related project, Kubrick put it aside. Kubrick's wife, in an interview, said she had given Kubrick the novel after having read it. Kubrick said: \"I was excited by everything about it: the plot, the ideas, the characters, and, of course, the language. The story functions, of course, on several levels: political, sociological, philosophical, and, what's most important, on a dreamlike psychological-symbolic level.\" Kubrick wrote a screenplay faithful to the novel, saying: \"I think whatever Burgess had to say about the story was said in the book, but I did invent a few useful narrative ideas and reshape some of the scenes.\" Kubrick based the script on the shortened US edition of the book, which omitted the final chapter.</p><h4>Direction</h4><p>Kubrick was a perfectionist who researched meticulously, with thousands of photographs taken of potential locations, and many scene takes. Like Malcolm McDowell, he usually \"got it right\" early on, so there were few takes. He was so meticulous that McDowell stated: \"If Kubrick hadn't been a film director he'd have been a General Chief of Staff of the US Forces. No matter what it is—even if it's a question of buying a shampoo it goes through him. He just likes total control.\" Filming took place between September 1970 and April 1971. Technically, to achieve and convey the fantastic, dream-like quality of the story, he filmed with extreme wide-angle lenses such as the Kinoptik Tegea 9.8 mm for 35 mm Arriflex cameras.</p><h4>Music</h4><p>The main theme is an electronic arrangement of a short excerpt from Henry Purcell's Music for the Funeral of Queen Mary, and the soundtrack has two of Edward Elgar's Pomp and Circumstance Marches.</p><p>Alex is fanatical about Ludwig van Beethoven in general and his Ninth Symphony in particular, and the soundtrack includes an electronic version specially arranged by Wendy Carlos of the Scherzo and other parts of the Symphony. The soundtrack contains more music by Rossini than by Beethoven. The fast-motion sex scene with the two girls, the slow-motion fight between Alex and his Droogs, the fight with Billy Boy's gang, the drive to the writer's home (\"playing 'hogs of the road'\"), the invasion of the Cat Lady's home, and the scene in which Alex looks into the river and contemplates suicide before being approached by the beggar are all accompanied by Rossini's William Tell Overture or The Thieving Magpie Overture.</p><br/><h3>Reception</h3><h4>Critical reception</h4><p>On release, A Clockwork Orange was met with mixed reviews. Vincent Canby of The New York Times praised the film: \"McDowell is splendid as tomorrow's child, but it is always Mr. Kubrick's picture, which is even technically more interesting than 2001. Among other devices, Mr. Kubrick constantly uses what I assume to be a wide-angle lens to distort space relationships within scenes, so that the disconnection between lives, and between people and environment, becomes an actual, literal fact.\" The following year, after the film won the New York Film Critics Award, he called it \"a brilliant and dangerous work, but it is dangerous in a way that brilliant things sometimes are\". The film also had notable detractors. Film critic Stanley Kauffmann commented, \"Inexplicably, the script leaves out Burgess' reference to the title\". Roger Ebert gave A Clockwork Orange two stars out of four, calling it an \"ideological mess\". In her New Yorker review titled \"Stanley Strangelove\", Pauline Kael called it pornographic because of how it dehumanised Alex's victims while highlighting the sufferings of the protagonist. Kael derided Kubrick as a \"bad pornographer\", noting the Billyboy's gang extended stripping of the very buxom woman they intended to rape, claiming it was offered for titillation.</p><p>John Simon noted that the novel's most ambitious effects were based on language and the alienating effect of the narrator's Nadsat slang, making it a poor choice for a film. Concurring with some of Kael's criticisms about the depiction of Alex's victims, Simon noted that the character of Mr Alexander, who was young and likeable in the novel, was played by Patrick Magee, \"a very quirky and middle-aged actor who specialises in being repellent\". Simon comments further that \"Kubrick over-directs the basically excessive Magee until his eyes erupt like missiles from their silos and his face turns every shade of a Technicolor sunset\".</p><p>Over the years, A Clockwork Orange gained a status as a cult classic. For The Guardian, Philip French stated that the film's controversial reputation likely stemmed from the fact that it was released during a time when fear of teenage delinquency was high. Adam Nayman of The Ringer wrote that the film's themes of delinquency, corrupt power structures and dehumanisation are relevant in today's society. Simon Braund of Empire praised the \"dazzling visual style\" and McDowell's \"simply astonishing\" portrayal of Alex. Roger Ebert softened on the film years after first viewing it, declaring on his talk show that while he still thought the film had \"all head and no heart\", he felt Kubrick's detachments from the violence more so than he did in the first viewing.</p><p>On review aggregator website Rotten Tomatoes, the film holds an approval rating of 88% based on 80 reviews, with an average rating of 8.8/10. The website's critical consensus reads: \"Disturbing and thought-provoking, A Clockwork Orange is a cold, dystopian nightmare with a very dark sense of humor\". Metacritic gives the film a score of 77 out of 100, based on reviews by 21 critics, indicating \"generally favorable reviews\".</p><h4>Box office</h4><p>The film was a box-office success, grossing $41 million in the United States and about $73 million overseas for a worldwide total of $114 million on a budget of $1.3 million.</p><p>The film was also successful in the United Kingdom, playing for over a year at the Warner West End in London. After two years of release, the film had earned Warner Bros. rentals of $2.5 million in the United Kingdom and was the number three film for 1973 behind Live and Let Die and The Godfather.</p><p>The film was the most popular film of 1972 in France with 7,611,745 admissions.</p><p>The film was re-released in North America in 1973 and earned $1.5 million in rentals.</p><h4>Controversies</h4><h4>American version</h4><p>In the United States, A Clockwork Orange was given an X rating in its original release in 1972. Later, Kubrick replaced approximately 30 seconds of sexually explicit footage from two scenes with less explicit action to obtain an R rating re-release later in 1972.</p><p>Because of the explicit sex and violence, The National Catholic Office for Motion Pictures rated it C (\"condemned\"), a rating which forbade Roman Catholics seeing the film. In 1982, the office abolished the \"condemned\" rating. Subsequently, films deemed to have unacceptable levels of sex and violence by the Conference of Bishops are rated O, \"morally offensive\".</p><h4>British withdrawal</h4><p>Although it was passed uncut for UK cinemas in December 1971, British authorities considered the sexual violence in the film to be extreme. In March 1972, during the trial of a 14-year-old boy accused of the manslaughter of a classmate, the prosecutor referred to A Clockwork Orange, suggesting that the film had a macabre relevance to the case. The film was linked to the murder of an elderly vagrant by a 16-year-old boy in Bletchley, Buckinghamshire, who pleaded guilty after telling police that friends had told him of the film \"and the beating up of an old boy like this one\". Roger Gray, for the defence, told the court that \"the link between this crime and sensational literature, particularly A Clockwork Orange, is established beyond reasonable doubt\". The press also blamed the film for a rape in which the attackers sang \"Singin' in the Rain\" as \"Singin' in the Rape\". Christiane Kubrick, the director's wife, has said that the family received threats and had protesters outside their home.</p><p>The film was withdrawn from British release in 1973 by Warner Bros at the request of Kubrick. In response to allegations that the film was responsible for copycat violence Kubrick stated:</p><blockquote>To try and fasten any responsibility on art as the cause of life seems to me to put the case the wrong way around. Art consists of reshaping life, but it does not create life, nor cause life. Furthermore, to attribute powerful suggestive qualities to a film is at odds with the scientifically accepted view that, even after deep hypnosis in a posthypnotic state, people cannot be made to do things which are at odds with their natures.</blockquote><p>The Scala Cinema Club went into receivership in 1993 after losing a legal battle following an unauthorised screening of the film. In the same year, Channel 4 broadcast Forbidden Fruit, a 27-minute documentary about the withdrawal of the film in Britain. It contains footage from A Clockwork Orange. It was difficult to see A Clockwork Orange in the United Kingdom for 27 years. It was only after Kubrick died in 1999 that the film was re-released theatrically, on VHS, and on DVD. On 4 July 2001, the uncut version premiered on Sky TV's Sky Box Office, where it ran until mid-September.</p><h4>Censorship in other countries</h4><p>In Ireland, the film was banned on 10 April 1973. Warner Bros. decided against appealing the decision. Eventually, the film was passed uncut for cinema on 13 December 1999 and released on 17 March 2000. The re-release poster, a replica of the original British version, was rejected due to the words \"ultra-violence\" and \"rape\" in the tagline. Head censor Sheamus Smith explained his rejection to The Irish Times: \"I believe that the use of those words in the context of advertising would be offensive and inappropriate.\"</p><p>In Singapore, the film was banned for over 30 years, before an attempt at release was made in 2006. However, the submission for an M18 rating was rejected, and the ban was not lifted. The ban was later lifted and the film was shown uncut (with an R21 rating) on 28 October 2011, as part of the Perspectives Film Festival.</p><p>In South Africa, it was banned under the apartheid regime for 13 years, then in 1984 was released with one cut and only made available to people over the age of 21. It was banned in South Korea and in the Canadian provinces of Alberta and Nova Scotia. The Maritime Film Classification Board also reversed the ban eventually. Both jurisdictions now grant an R rating to the film.</p><p>In Brazil, the film was banned under the military dictatorship until 1978, when the film was released in a version with black dots covering the genitals and breasts of the actors in the nude scenes.</p><p>In Spain, the film debuted at the 1975 Valladolid International Film Festival under the dictatorship of Francisco Franco. It was expected to be screened in the University of Valladolid but, due to student protests, the university had been closed for two months. The final screenings were in the commercial festival venues, with long queues of expectant students. After the festival, the film went into the arthouse circuit and later in commercial cinemas successfully.</p><p>In Malta, a ban on the film was lifted in 2000, when it was shown in local cinemas for the first time. The film was brought up during the compilation of evidence on the rape and murder of Paulina Dembska, which took place on 2 January 2022 in Sliema, for the accused attacker compared himself to Alex during police interrogation.</p><h4>Novelist's response</h4><p>Burgess had mixed reception about the film adaptation of his novel, publicly saying he loved Malcolm McDowell and Michael Bates, and the use of music. He praised it as so \"brilliant\" that it might be dangerous. He was concerned that it lacked the novel's redemptive final chapter, an absence he blamed upon his American publisher and not Kubrick. All US editions of the novel prior to 1986 omit the final chapter. Kubrick called the missing chapter \"an extra chapter\" and claimed that he had not read the original version until he had virtually finished the screenplay, and that he had never seriously considered using it. In Kubrick's opinion – as in the opinion of other readers, including the original American editor – the final chapter was unconvincing and inconsistent with the book.</p><p>Burgess reports in his autobiography You've Had Your Time (1990) that he and Kubrick at first enjoyed a good relationship, each holding similar philosophical and political views and each very interested in literature, cinema, music, and Napoleon Bonaparte. Burgess's novel Napoleon Symphony (1974) was dedicated to Kubrick. Their relationship soured when Kubrick left Burgess to defend the film from accusations of glorifying violence. A lapsed Catholic, Burgess tried many times to explain the Christian moral points of the story to outraged Christian organisations and to defend it against newspaper accusations that it supported fascist dogma. He also went to receive awards given to Kubrick on his behalf. He was in no way involved in the production of the film. The only profit he made directly from the film was the initial $500 that had been given to him for the rights to the adaptation.</p><p>Burgess's own stage adaptation of the novel, A Clockwork Orange: A Play with Music (1984), contains a direct reference to Kubrick. In the final moment of the play Alex joins in a song with the other characters. In the script's stage directions it states that while this happens: \"A man bearded like Stanley Kubrick comes on playing, in exquisite counterpoint, 'Singin’ in the Rain' on the trumpet. He is kicked off the stage.\"</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th></tr><tr><td rowspan=\"4\"><span>Academy Awards</span></td><td><span>Best Picture</span></td><td rowspan=\"3\"><span>Stanley Kubrick</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay – Based on Material from Another Medium</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Bill Butler</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"7\"><span>British Academy Film Awards</span></td><td><span>Best Film</span></td><td rowspan=\"3\">Stanley Kubrick</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Direction</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Editing</span></td><td>Bill Butler</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Production Design</span></td><td><span>John Barry</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td><span>John Alcott</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound</span></td><td>Brian Blamey, John Jordan and <span>Bill Rowe</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td>Stanley Kubrick</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Evening Standard British Film Awards</span></td><td colspan=\"2\">Best Film</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Actor</td><td><span>Malcolm McDowell</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Motion Picture – Drama</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor in a Motion Picture – Drama</span></td><td>Malcolm McDowell</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director – Motion Picture</span></td><td>Stanley Kubrick</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Hugo Awards</span></td><td><span>Best Dramatic Presentation</span></td><td>Stanley Kubrick and <span>Anthony Burgess</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Kansas City Film Critics Circle Awards</td><td colspan=\"2\">Best Film</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Nastro d'Argento</span></td><td>Best Foreign Director</td><td>Stanley Kubrick</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Film Preservation Board</span></td><td colspan=\"2\"><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td></tr><tr><td rowspan=\"3\"><span>National Society of Film Critics Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">3rd Place</td></tr><tr><td><span>Best Director</span></td><td>Stanley Kubrick</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor</span></td><td>Malcolm McDowell</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>New York Film Critics Circle Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Stanley Kubrick</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td>Malcolm McDowell</td><td style=\"background: #DFF; vertical-align: middle; text-align: center;\" class=\"table-cast\">Runner-up</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Rondo Hatton Classic Horror Awards</span></td><td>Best DVD Commentary</td><td>Malcolm McDowell</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Satellite Awards</span></td><td colspan=\"2\"><span>Best Classic DVD</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Saturn Awards</span> <span style=\"font-size:85%;\">(2008)</span></td><td><span>Best DVD Collection</span></td><td><i>A Clockwork Orange</i> <span style=\"font-size:85%;\">(as part of <i>Stanley Kubrick: Warner Home Video Directors Series</i>)</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Saturn Awards</span> <span style=\"font-size:85%;\">(2012)</span></td><td><span>Best DVD Collection</span></td><td><i>A Clockwork Orange</i> <span style=\"font-size:85%;\">(as part of <i>Stanley Kubrick: The Essential Collection</i>)</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Saturn Awards</span> <span style=\"font-size:85%;\">(2015)</span></td><td><span>Best DVD or Blu-ray Collection</span></td><td><i>A Clockwork Orange</i> <span style=\"font-size:85%;\">(as part of <i>Stanley Kubrick: The Masterpiece Collection</i>)</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Turkish Film Critics Association Awards</span></td><td colspan=\"2\">Best Foreign Film</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">5th Place</td></tr><tr><td><span>Venice International Film Festival</span></td><td>Pasinetti Award (Best Foreign Film)</td><td rowspan=\"2\">Stanley Kubrick</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Best Drama Adapted from Another Medium</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><br/><h3>Comparison of film and novel</h3><p>Kubrick's film is relatively faithful to the Burgess novel, omitting only the final, positive chapter, in which Alex matures and outgrows sociopathy. While the film ends with Alex being offered an open-ended government job, implying he remains a sociopath at heart, the novel ends with Alex's positive change in character. This plot discrepancy occurred because Kubrick based his screenplay on the novel's American edition, in which the final chapter had been deleted on the insistence of its American publisher. He claimed not to have read the complete, original version of the novel until he had almost finished writing the screenplay, and that he never considered using it. The introduction to the 1996 edition of A Clockwork Orange says that Kubrick found the end of the original edition too blandly optimistic and unrealistic.</p><ul><li>Critic Randy Rasmussen has argued that the government in the film is in a shambolic state of desperation, whereas the government in the novel is quite strong and self-confident. The former reflects Kubrick's preoccupation with the theme of acts of self-interest masked as simply following procedure.One example of this would be differences in the portrayal of P. R. Deltoid, Alex's \"post-corrective advisor\". In the novel, P. R. Deltoid appears to have some moral authority (although not enough to prevent Alex from lying to him or engaging in crime, despite his protests). In the film, Deltoid is slightly sadistic and seems to have a sexual interest in Alex, interviewing him in his parents' bedroom and smacking him in the crotch.</li><li>In the film, Alex has a pet snake. There is no mention of this in the novel.</li><li>In the film Alex's prison number is 655321, in the book his prisoner number is 6655321.</li><li>In the novel, F. Alexander recognises Alex through several careless references to the previous attack (such as his wife then claiming they did not have a telephone). In the film, Alex is recognised when singing the song 'Singing in the Rain' in the bath, which he had hauntingly done while attacking F. Alexander's wife. The song does not appear at all in the book, as it was an improvisation by actor Malcolm McDowell when Kubrick complained that the rape scene was too \"stiff\".</li></ul><br/><h3>Home media</h3><p>In the US, the film has been widely available on home video since 1980 and was re-released several times on VHS. It was first released on DVD in the US on 29 June 1999.</p><p>In the UK, the film was eventually released by Warner Home Video on 13 November 2000 (on both VHS and DVD), individually and as part of The Stanley Kubrick Collection DVD set. Due to negative comments from fans, Warner Bros re-released the film, its image digitally restored and its soundtrack remastered. A limited-edition collector's set with a soundtrack disc, film poster, booklet, and filmstrip followed, and was discontinued. In 2005, a British re-release, packaged as an \"Iconic Film\" in a limited-edition slipcase was published, identical to the remastered DVD set, except for different package cover art. In 2006, Warner Bros announced the September publication of a two-disc special edition featuring a Malcolm McDowell commentary, and the releases of other two-disc sets of Stanley Kubrick films. Several British retailers had set the release date as 6 November 2006. The release was delayed and re-announced for the 2007 Holiday Season.</p><p>An HD DVD, Blu-ray, and DVD version was re-released on 23 October 2007, alongside four other Kubrick classics, with 1080p video transfers and remixed Dolby TrueHD 5.1 (for HD DVD) and uncompressed 5.1 PCM (for Blu-ray) audio tracks. Unlike the previous version, the DVD re-release edition is anamorphically enhanced. The Blu-ray was reissued for the 40th anniversary of the film's release, identical to the previously released Blu-ray, plus a Digibook and the Stanley Kubrick: A Life in Pictures documentary as a bonus feature.</p><p>In 2021, a 4K restoration was completed with Kubrick's former assistant Leon Vitali working closely with Warner Bros. It was released in the US on 21 September 2021 and 4 October 2021 in the UK.</p><br/><h3>Legacy and influence</h3><p>Along with Bonnie and Clyde (1967), Night of the Living Dead (1968), The Wild Bunch (1969), Soldier Blue (1970), Dirty Harry (1971), and Straw Dogs (1971), the film is considered a landmark in the relaxation of control on violence in cinema.</p><p>A Clockwork Orange remains an influential work in cinema and other media. The film is frequently referenced in popular culture, which Adam Chandler of The Atlantic attributes to Kubrick's \"genre-less\" directing techniques that brought novel innovation in filming, music, and production that had not been seen at the time of the film's original release.</p><p>The Village Voice ranked A Clockwork Orange at number 112 in its Top 250 \"Best Films of the Century\" list in 1999, based on a poll of critics. The film appears several times on the American Film Institute's (AFI) top movie lists. The film was listed at No. 46 in the 1998 AFI's 100 Years... 100 Movies, at No. 70 in the 2007 second listing. \"Alex DeLarge\" is listed 12th in the villains section of the AFI's 100 Years... 100 Heroes and Villains. In 2008, the AFI's 10 Top 10 rated A Clockwork Orange as the 4th greatest science-fiction movie to date. The film was also placed 21st in the AFI's 100 Years... 100 Thrills</p><p>In the British Film Institute's 2012 Sight & Sound polls of the world's greatest films, A Clockwork Orange was ranked 75th in the directors' poll and 235th in the critics' poll. In 2010, Time magazine placed it 9th on their list of the Top 10 Ridiculously Violent Movies. In 2008, Empire ranked it 37th on their list of \"The 500 Greatest Movies of All Time\", and in 2013, Empire ranked it 11th on their list of \"The 100 Best British Films Ever\". In 2010, The Guardian ranked the film 6th in its list of 25 greatest arthouse films. The Spanish director Luis Buñuel praised the film highly. He once said: \"A Clockwork Orange is my current favourite. I was predisposed against the film. After seeing it, I realised it is only a movie about what the modern world really means\".</p><p>A Clockwork Orange was added to the United States' National Film Registry in 2020 as a work considered to be \"culturally, historically or aesthetically\" significant.</p><br/>"
  },
  "errorMessage": ""
}