{
  "imDbId": "tt0082096",
  "title": "Das Boot",
  "fullTitle": "Das Boot (1981)",
  "type": "Movie",
  "year": "1981",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "Wolfgang Petersen's direction is an exercise in pure craftsmanship. [Director's Cut]"
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Kenneth Turan",
      "link": "",
      "rate": "100",
      "content": "The most convincing war movie ever made."
    },
    {
      "publisher": "The A.V. Club",
      "author": "Keith Phipps",
      "link": "http://survey-smiles.com/",
      "rate": "100",
      "content": "At once a devastating condemnation of war and an exciting action film...The additional running time only adds to Petersen's masterfully bleak, claustrophobic atmosphere. Das Boot is by no means a pleasant experience, but it's an intelligent and emotionally gripping one that you won't forget. [Director's Cut]"
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "100",
      "content": "Takes all of the drama and suspense inherent in a submarine-based story and delivers it in a near-perfect package, establishing Das Boot as not just a terrific adrenaline rush, but one of the best movies ever made. [Director's Cut]"
    },
    {
      "publisher": "Salon",
      "author": "",
      "link": "",
      "rate": "90",
      "content": "Absolutely devastating filmmaking that makes you simultaneously feel the glory and the absolute futility of war. [Director's Cut]"
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Marc Savlov",
      "link": "https://www.austinchronicle.com/events/film/1997-04-25/boot-the-directors-cut-das/",
      "rate": "89",
      "content": "One of the most suspenseful films of all time, its wartime action setting makes it easy to forget it's also one of the most spiritually righteous. [Director's Cut]"
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "",
      "rate": "83",
      "content": "Sweaty and claustrophobic, exciting and horrifying at the same time, it never lets us forget we're riding aboard a giant, primitive tin can, a hunk of industrial machinery that mingles the illusion of omnipotence with the reality of a floating prison cell. [Director's Cut]"
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Jay Scott",
      "link": "",
      "rate": "75",
      "content": "As torpedoes shoot through the seas and depth charges pass by, carrying their whining cargo of destruction, Das Boot brings the presence of death to within a whisper of the eardrum."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Edward Guthmann",
      "link": "https://www.sfgate.com/movies/article/FILM-REVIEW-Rebooted-Das-Boot-Was-Fine-the-2847341.php",
      "rate": "75",
      "content": "A visually spectacular film, distinguished by strong performances and brilliant Steadicam photography that snakes through the U-boat as its patrols the North Atlantic during World War II. [Director's Cut]"
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "60",
      "content": "The film has no qualities beyond its formal polish--and its careful avoidance (or rather, displacement) of the moral and political issues involved can seem too crafty, too convenient."
    }
  ],
  "errorMessage": ""
}