{
  "imDbId": "tt0082096",
  "title": "Das Boot",
  "fullTitle": "Das Boot (1981)",
  "type": "Movie",
  "year": "1981",
  "items": [
    {
      "username": "jaywolfenstien",
      "userUrl": "https://www.imdb.com/user/ur1298472",
      "reviewLink": "https://www.imdb.com/review/rw1051627",
      "warningSpoilers": false,
      "date": "1 April 2005",
      "rate": "",
      "helpful": "550 out of 583 found this helpful.",
      "title": "Epic",
      "content": "What impresses me the most about the film, as the title makes apparent, is that it's a German made film about a German U-boat. Patriotism for my own country would tend to make me hate the crew on this ship by definition (especially if portrayed as typical mindless killing machine Nazis), but these characters are so well developed and played like human-beings facing difficult decisions that I find myself sympathizing with these guys.I love the flow and pacing of the Director's Cut; it takes its time, and does not feel like typical Hollywood formula \"first major plot point at minute 12\" cookie-cutter routine. Das Boot gives us plenty of time to know these characters, discover how they kill time while waiting for orders, how they feel about their job and each other. Then when the action finally starts: how they deal with the possibility of dying deep underwater, how they react to the sounds of a sub going deeper than it should, the look on their faces as a destroyer is heard pinging them, and dozens of little personality quirks--subtle details that bring the crew to life. It truly does feel like an epic about a submarine crew, and I'm interested in some day viewing the 6 hour TV version.The underwater battles somewhat remind me of Sergio Leone in that Wolfgang Peterson takes forever and a day to get the fights started. Unlike Leone, once the torpedos are launched and the depth charges dropped, the cat-and-mouse game is ongoing and relentless, but never boring.And despite the fact that most of the film takes place inside a cramped submarine, Das Boot is never boring to look at; in fact, it's a visually spectacular film (given the dated special effects, who hold up reasonably well and add to the old-school charm). And the freedom of the camera in those tight corridors came as an incredibly pleasant surprise. The color and composition of the shots in those tight quarters -- particularly upon approaching the first destroyer when we get the first real glimpse of the interior prepped for war -- it is both haunting and beautiful.Jurgen Prochnow delivers the most believable performance of a ship captain I've ever seen on film. All the emotions register on his face--his concern for his own life, ship, and crew; his hatred for the decisions he's forced to make; the disbelieving joy of beating the overwhelming odds--while simultaneously holding it back so the crew sees a strong unmoving man forever in control of the situation. His performance is, in a word, brilliant.The rest of the cast also delivers amazingly believable performances, and trust me, I could write an entire review on the film's characters and their portrayals. It's both disappointing and satisfying that I'm not given enough space to do so (I wish I could state that about a tenth of the films I've reviewed here on IMDb.) I liked the entire crew of this U-boat, the war correspondent and his character arc as he realizes the truth behind these \"heroes\", the chief and his longing to return to his wife, Johann and the story of his redemption--all well cast, well acted, and believable.Another aspect I adored about Das Boot - the controversial scenes simply rolled by with no more or less emphasis than any other statement the film makes. In fact, I saw the film before really reading anything or researching it and found myself somewhat shocked to hear about these \"talked about\" scenes. Granted, the film does pose some moral questions, but I felt the film handled it with grace and great subtlety, showing what it needs to get the point across and not a step further . . . unlike typical Hollywood where controversy gets bold print, italics, and a highlighter. Maybe I should move to Germany.I can go on for a long while: Over three hours of wonderful visuals and strong performances, a sparse but great score (this film's lack of music is quite appropriate, making the presence of music much more impactful in its key places). Realistic writing from people who lived the experience first hand. As I said, I can go on for awhile but I'll sum it up and end this review with one statement: Das Boot is the definitive submarine movie."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1418315",
      "warningSpoilers": true,
      "date": "12 July 2006",
      "rate": "10",
      "helpful": "59 out of 63 found this helpful.",
      "title": "Probably the greatest WWII naval movie",
      "content": "This is an amazing achievement, and it's obvious because it is one of the only German language films to receive widespread distribution in American theaters since the silent era. It was just that good! When it came to America, the movie was cut down a little from it's original HUGE length and it was released in both dubbed and subtitled versions.The film is about a single WWII German U-boat and it follows it through a very hazardous mission until it eventually makes it back to port. While this may not sound very interesting, it certainly is, as the movie is less a traditional movie but an experience meant to instill in the audience the daily life and horror of serving on one of these submarines. For example, when the sub is being pursued, you find yourself tense, on edge and feeling the claustrophobia of the crewmen. Viscerally, it is an amazing film and remains a true and faithful film--the crew is extraordinary but they are hardly romanticized--they are just men doing their best to stay alive! To top all this off, when the movie concludes, there is the most fitting and inspired ending I have seen in a war film. Like anything you've seen from Hollywood? No way--this is like real life in all its starkness and terror."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw3867480",
      "warningSpoilers": false,
      "date": "25 November 2017",
      "rate": "10",
      "helpful": "41 out of 44 found this helpful.",
      "title": "German Masterpiece",
      "content": "In October 1941, the German Capt.-Lt. Henrich Lehmann-Willenbrock (Jürgen Prochnow) of the U-96 U-Boat receives the war correspondent Lt. Werner (Herbert Grönemeyer) to cover the work in the submarine during their mission in the Atlantic Ocean. They sail out of the shipyard La Rochelle and along the next weeks, Werner learns the lives, loves, fear and behavior of the young crew, the veteran Captain and his officers. The skilled captain hunts British vessels to sink and dives to depths below the limit of the boat to escape from the destroyers. Near Christmas, they plan to return to La Rochelle; but out of the blue, Captain Henrich receives an order to cross the Strait of Gibraltar to go to Italy. But the captain knows how protected the area is and plans a means to lure the British Navy. Will the U-96 succeed in crossing the Strait of Gibraltar?\"Das Boot\" is a German masterpiece by Wolfgang Petersen with 2h 29 min. The \"Superbit\" director's cut on DVD with one additional hour is a supreme masterpiece of a war (or anti-war) film. It is impressive how a 3h 29 min film is never boring, keeping the viewer on the edge of his or her seat until the very ending. The claustrophobic and tense story increases the drama and the character development in this version, becoming one of the best movies in the cinema history. The German captain, officers and crew are not shown as one-dimension character or sad killing machine like in many war films, but as human beings with families and friends, very efficient in their works but with fear and other feelings. My vote is ten.Title (Brazil): \"O Barco: Inferno no Mar\" (\"The Boat: Hell in the Sea\")"
    },
    {
      "username": "Essex_Rider",
      "userUrl": "https://www.imdb.com/user/ur2661632",
      "reviewLink": "https://www.imdb.com/review/rw6345420",
      "warningSpoilers": false,
      "date": "7 December 2020",
      "rate": "10",
      "helpful": "67 out of 67 found this helpful.",
      "title": "Emotionally Draining",
      "content": "My late father served in the Royal Navy in WWII and was torpedoed by a U Boat, so when I sat with him to watch this in 1986, I fully expected him to be filled with hatred for them. Nothing could have been further from the truth. He told me that seamen, even those on opposite sides, share something unique. He told me that his ship picked up some U Boat survivors from a ramming. They were just ordinary men doing the bidding of their masters, just like he was. They were put down at Scapa Flow as POW's after being at sea for 5 weeks. Many of them had formed friendships with the Royal Navy men, including my father. He formed a friendship with a submariner called Gotz Stiffel and they remained friends until Gotz passed away. My father attended his funeral in Duisburg and he was welcomed as an old friend by the survivors of that U Boat sinking. My father said that film bought tears to his eyes. They were just ordinary men caught up in extraordinary times and this film captured everything from fear to boredom and relief. He said, and I utterly agreed with him this was just about the finest anti-war film ever made."
    },
    {
      "username": "secondtake",
      "userUrl": "https://www.imdb.com/user/ur20961309",
      "reviewLink": "https://www.imdb.com/review/rw2355307",
      "warningSpoilers": false,
      "date": "19 December 2010",
      "rate": "8",
      "helpful": "19 out of 19 found this helpful.",
      "title": "Believable, above all, and a WWII submarine movie, all the rest is just intensity",
      "content": "Das Boot (1981)Widely considered the most impressive submarine movie ever made, I'll go so far as to say it's easily the most accurate that I've seen. The action scenes, the sense of doom, the eerie quiet and then explosive depth charges, the grime and the crowded conditions, all of this is palpable. But more impressive, I think, is how the movie works as a German movie about Germans in a war where the Germans were painted as evil. American movies to this day still glorify and make heroic their roles in WWII (unlike the willingness, at times, to show the problems of Americans involved in Viet Nam, say), especially in the European side. But in movie after movie, the German film industry has confronted the real problem of being aggressors, and of being under the Nazi sway. \"Das Boot\" is typical, and key. The captain goes so far as to openly make fun of the German propaganda coming in on their radio. It isn't just that war is bad, but that the Nazis are bad.Nevertheless, there they are, and they have a job to do, and they're going to do it well. So a small group of men in a small underwater tin can try to survive the boredom as much as the British, who come very close to getting them several times. It's a great movie, one of the best at capturing the feeling of being there.What is less impressive, at times, is the more ordinary character development that seems inevitable in a movie this long--2 ½ to 4 hours depending on the version you have, I saw the long one, the director's cut. I think the acting is superb, and so it's easy to go along with the conversations and interactions, but they aren't always compelling in themselves, more just creating some space before the next conflict arises. Maybe, in some honest sense, this is exactly how it would have been. Life for most people is pretty ordinary.But this movie is not. Or it makes what is ordinary in war--the nostalgic to the profound and deadly--believable, and not simply big and dramatic, which it also is. For full German effect, I suggest seeing it with the original German language track on and subtitles if you need them, though I tested the dubbed version in English and it's really well done. I also suggest, if you have doubts about such an involved war movie, trying to find the older, shorter release. The visuals are not enhanced, but some of the character development sections are left out and I don't think you'll miss them. Then, of course, if you want the whole kit and caboodle, try to find the 5 hour version released in sections for British and German television."
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw0183005",
      "warningSpoilers": true,
      "date": "18 August 2004",
      "rate": "9",
      "helpful": "62 out of 72 found this helpful.",
      "title": "Review Of The Director's Cut",
      "content": "I've decided not to review the 1981 dubbed cinematic release of DAS BOOT . Instead I've decided to review Wolfgang Petersen's director's cut which is far closer to the miniseries version which most readers will be familiar with When someone makes an anti war statement it's important that they differentiate between being \" anti war \" and \" anti military \" . The Brits don't seem to know the difference and seem keen to make anti- military / anti - soldier self loathing war movies with Paul Greengrass's RESURRECTED a good example . Having suffered the tragedy of Vietnam the Americans finally made anti- war movies that were a million miles removed from the old John Wayne and Errol Flynn star vehicles where a man wipes out 30 enemy soldiers single handed without suffering a scratch . But when it comes to making anti - war movies that shows the horrors of war and the courage of men in battle the Germans are top of the league , heads and shoulders above everyone else . This is because present day Germans realize that the enemy isn't the other side - it's war itself that's the enemy and DAS BOOT is a great example of this thinking The story starts slowly by introducing us to the crew via the war correspondent who are celebrating a last night ashore before they sail on their mission to sink British convoys sailing from America to Britain carrying vital supplies for the war effort against Nazi Germany . This is where DAS BOOT is superb , I really felt empathy for these crew man . Okay I didn't want them sinking British ships but I didn't want them to die either an opinion that shouldn't be taken lightly since my paternal grandfather was a merchant seaman during the war while my maternal grandfather was a crewman on a destroyer . The fact the crew of U-96 are presented as being utterly human and for this Brit hoping they make it home in one piece is a great achievement DAS BOOT was nominated for several Oscars and it's not difficult to see why. Watch it on widescreen television with stereo surround and you'll be amazed with the very clear sound effects and sound editing . Perhaps the best technical aspect is the cinematography where during moments of crisis the camera shoots along the length of the U- boat as it follows crewmen rushing about . When a foreign language movie is nominated for several Oscars you just know it's good!!!!! SLIGHT SPOILERS !!!!This is a superb movie but it's not perfect . Being a German movie Nazis feature at one point but none of them are crew members , the only Nazis featured are the crew of a supply ship who have who have never seen a days fighting in their lives . It's understandable for German film makers to play down the courage of Nazi party members of the Second World War but it should also be remembered that the Waffan SS were exclusively composed of party members and they were the most feared fighting force of the conflict . CROSS OF IRON ( My favourite movie featuring WW 2 ) does make the valid point that because someone isn't a fan of the Nazis it doesn't necessarily make them a good person either . The screenplay also drags due to the fact that there's two subplots of U-96 being damaged and stuck on the Atlantic seabed when one subplot of sinking and then resurrecting the vessel would have sufficedBut the pros far outweigh the cons and I recommend this movie to people who have never seen a foreign language film in their life . It's placing in the IMDb top 250 is well earned . You may be shocked to know that director Wolgang Petersen later went onto to make Hollywood crap like OUTBREAK and A PERFECT STORM"
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw1530845",
      "warningSpoilers": true,
      "date": "26 November 2006",
      "rate": "10",
      "helpful": "32 out of 36 found this helpful.",
      "title": "\"Now it all turns psychological, gentlemen.\"",
      "content": "The more films I view, the harder it is to dole out a rating of '10', and I've never been liberal about it anyway. With \"Das Boot\", I have no such reservations. Here's a film that takes all your preconceived notions about Nazi villains and stands them on their head, by portraying a World War II submarine crew as human beings, facing life and death daily in the cramped confines of an underwater prison. Not only does one come to understand their plight, but sympathize with them as well, to the point of hoping that they make it through their Atlantic ordeal. The only problem being that once they do, a cruel fate intervenes to usurp the lives of innocents in a way that their harrowing underwater ordeal could not.Perhaps part of the reason that one identifies with the German cast has to do with the treatment of Adolph Hitler in the story. Not once was he identified as a Nazi hero or figure of respect. Early in the film, the Captain (Jurgen Prochnow) himself establishes his posture as less than a fan of the Fuhrer. The much later scene of the celebration in Vigo painted an even more resolute snub of Hitler by the officer crew of U-96, along with their elite German hosts. It is possibly the only time I've witnessed anything less than outright undying loyalty to the Nazi leader by members of the Party.Told from the German point of view by director Wolfgang Peterson, the story opens with the staggering statistic that only twenty five percent of Germany's forty thousand submarine sailors ever made it home alive. By Autumn 1941, the battle for the control of the Atlantic Ocean was turning against them, ominously conveyed by the Captain himself - \"Those Brits don't make mistakes anymore\". It's stated not in anger or defiance, but as a statement of fact, one which further emphasizes the plight of this enemy sub. Men crack under the pressure of battle, as personified by Johann 'the ghost' (Erwin Leder), who has a nervous breakdown before he can be of use to his Captain one last time. So fascinating is Peterson's direction, that the entire time the sub lies doomed on the ocean floor, this viewer finds himself saying a prayer along with the crew for that one unbelievable miracle that might pull them through.Through it all, I maintained such an alert focus that I managed to catch a continuity error. When Lt. Werner (Herbert Gronemeyer) returns the packet of letters to Ullman (Martin May) that he volunteered to forward to Ullman's pregnant girlfriend, it was only half the size of the original bundle.Prior to seeing this movie, it would have been hard to imagine a war film to be as compelling that hadn't been produced by Hollywood. However by any account, \"Das Boot\" ranks up there with not only the best war stories ever told, but one of the best movies ever committed to film. It deserves a strong recommendation."
    },
    {
      "username": "susy-7",
      "userUrl": "https://www.imdb.com/user/ur0433942",
      "reviewLink": "https://www.imdb.com/review/rw0182849",
      "warningSpoilers": false,
      "date": "8 September 1999",
      "rate": "10",
      "helpful": "717 out of 737 found this helpful.",
      "title": "15 years and I'm still thinking about it",
      "content": "Das Boot is not just a great war film: it's a great film period. Maybe it is true that epic themes make the greatest novels and films. Here is a movie that explores heroism, duty, patriotism, hope, fear and the futility of war--all grand themes--explored in the confined, and collapsing, spaces of a German u-boat.I saw this film when I was a freshman in college during a weekend that I later dubbed my \"depressing movie festival.\" (The Wall and Apocalypse Now were the other weekend \"entries.\") Of these films, it was Das Boot that haunted me--when I laid down at night, I saw Jurgen Proctow's pained blue eyes. When I woke in the morning, I felt as if I were escaping through the hatch of the submarine. I could not shake the images, and now some fifteen years later, I still remember how completely meaningless the movie made everything seem, and the nihilistic message stayed with me for a long, long time. How few films are there which affect the viewers on this level. To say this film is \"powerful\" seems so weak a description.Part of the \"power\" of the film comes, I think, from a certain restraint in the direction. So often, films which aspire to move the audience quickly fall into melodrama, over-acting, and overblown images. Too much. These often succeed in the immediate response (usually crying) but fail to impact the viewer on anything more than a surface level. Here, it is the small moments which fill the screen. Everywhere, all around is War, but for these men as we witness them, war does not begin with a capital \"W\". It is reality, not a grand concept. The director lets the story shock and horrify the audience, not by forcing it, but by letting the story just tell itself. Drama, tension and resolution occur naturally in Das Boot, which contributes to the very real impact of the film.Story is a 10, direction is a 10, acting is a 10 and the cinematography is a 10. One of the all-time greatest films."
    },
    {
      "username": "Mike_Wiggins",
      "userUrl": "https://www.imdb.com/user/ur3707399",
      "reviewLink": "https://www.imdb.com/review/rw1046417",
      "warningSpoilers": false,
      "date": "25 March 2005",
      "rate": "10",
      "helpful": "272 out of 287 found this helpful.",
      "title": "The best submarine film ever made.",
      "content": "While it has been a very long time since I have seen this movie, it is one of the very few that I own. Wolfgang Petersen's magnificent accomplishment in \"Das Boot\" is reiterating the dictum that \"war is hell\", no matter which side you look at it from and no matter where the battlefield is located.*** Minor spoilers ***The plot has been well described by other viewers so I won't rehash it again. But my personal observations, as an ex-submarine sailor, are that Petersen probably portrayed life on board the sub pretty accurately. I say \"probably\" because todays subs are hotels compared with the German U-boats and American submarines. The commonality between yesterday and today is how the crew deals with being closed up in a \"sewer pipe\" for weeks at a time. More importantly, you as a viewer become an invisible crew member as the crew lives in very cramped conditions (American WW2 subs used to be called \"pig boats\"), deals with an unfortunately believable political officer, deals with drills, actual torpedo firings, actual ships casualties, and deals, most frighteningly, with retribution from the \"enemy\". My own experience watching the depth charging of the U-boat was such that I was thinking \"stop it, Stop It, STOP IT, STOPITSTOPITSTOPIT...!!!!!\" That's how real it felt to me. For the rest of you, I feel certain you will too be dragged in and know what it is like to live on board a WW2 U-boat.This movie also shows how leadership is so important in keeping the crew (and ultimately the sub) together. Petersen's direction for Captain Lehmann-Willenbrock was masterful because it didn't portray the captain as a god. It showed him as a man who knows how to lead, knows his submarine as if he were married to it (and in many ways he is) but isn't perfect at the job. It also shows that even with great leadership qualities, Captain Lehmann-Willenbrock can not do the job alone: he must have both officers and enlisted men who have the knowledge and skill to not just do their jobs, but to also advise the captain. Petersen also managed to give each member of the crew their own separate personalities instead of the predictable cookie-cutter personalities that Hollywood feels is needed.I could go on and on. So I will close by saying that with the plot, direction, cinematography, acting, sound, music, editing all being top notch, this is one of the few movies that I can truly rate a 10 out of 10. I also preferred the German version with subtitles.------------------------------------ I believe that this movie was either the first or one of the first to use Steadicam technology. It was truly amazing for me to see a camera zip its way through a submarine, specifically through the open watertight doors, without a break in the filming. Up until I heard what Steadicam was, I was always wondering how Petersen managed to hide the camera dolly track or the wires the camera hung from.(It turns out I was wrong: \"Bound For Glory\" was the first.)EDIT (12 OCT, 2006): I have been corrected by an observant viewer. Wikipedia has the following comment on what I thought was Steadicam usage:\"Most of the interior shots were filmed using a hand-held Arriflex of cinematographer Jost Vacano's design to convey the claustrophobic atmosphere of the boat. It had a gyroscope to provide stability, a reinvention of the Steadicam on a smaller scale, so that it could be carried throughout the interior of the mock-up. Vacano wore full-body padding to minimize injury as he ran and the mock-up was rocked and shaken.\" So, literally, a Steadicam was NOT used in the filming of \"Das Boot\". However, a camera that resembled Steadicam in function (in the way it gyroscopically leveled the filming platform) was used.------------------------------------ Even though todays submarines are far cleaner then their predecessors, and we have refrigerators, freezers, air conditioning, are able to take showers, etc., there is one aspect of living in an enclosed space that still lives on: the smell. While the smell of the \"pig boats\" of WW2 was truly atrocious, even with todays ability to clean the atmosphere, you can not escape the fact that any smell that is created, from burned toast in the galley, from the smell of the \"sanitary gasses\" (to be kind), to gasified hydraulic oil and diesel fuel, all these particulates will eventually become absorbed in your clothing. You, as a sailor, may get used to it, but when you get home, your wife will most likely declare that you smell like a submarine and demand that whatever you are wearing get thrown in the wash ... immediately!"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3145669",
      "warningSpoilers": false,
      "date": "21 December 2014",
      "rate": "9",
      "helpful": "15 out of 16 found this helpful.",
      "title": "Superior submarine movie",
      "content": "It's the Autumn of 1941. The German U-boat fleet is starting to suffer heavy losses. The Captain (Jürgen Prochnow) shows Naval war correspondent Lt. Werner (Herbert Grönemeyer) around as his men party while on leave. The Captain is a pragmatic veteran. Some are on the verge of a mental breakdown, others are concerned but all respect their captain. They leave port for the dangerous North Atlantic. After a tough tour, they are redirected to pass through the Strait of Gibraltar and go to Italy.This is one of the first movie to show submarine warfare with gritty realism. The setting is claustrophobic. The characters are compelling and specific. Each of the main actors bring life to their characters. The action scenes are exciting. They hit the audience in the gut. This movie doesn't take a stance on the war other than being as real as possible. There is nothing about the holocaust. There is a general sense of war weariness which is the central message. It shows the futility of war in the best submarine movie up to that point. It can be argued that it has yet to be surpassed."
    },
    {
      "username": "TxMike",
      "userUrl": "https://www.imdb.com/user/ur0438066",
      "reviewLink": "https://www.imdb.com/review/rw0182857",
      "warningSpoilers": false,
      "date": "6 November 1999",
      "rate": "",
      "helpful": "27 out of 31 found this helpful.",
      "title": "Das Boot (the boat) is without doubt one of the finest movies ever!",
      "content": "This is a review of the DVD version of the 1997 \"Das Boot - The Director's Cut\".I remember, in 1981, when this movie came out and received so much acclaim. I didn't see it, mostly because it didn't sound very interesting, and I didn't like watching sub-tilted movies.I still would not have watched it if my neighbor hadn't brought over his DVD and said, \"you have to watch this.\"I was overwhelmed. It is one of the very finest movies I have ever seen (I'm in my 50s), maybe even the very best! Yes, it is about war. Set in 1941, it is about the German U-boat fleet. A statistic shown at the beginning says \"40,000 German men were sent out on U-boats and 30,000 never returned.\" This movie is about one of those U-boats, its battles, and the lives of its crew. Two-thirds into the movie the captain says, \"You have to have good men. Good men, all of them.\" And that's really what this movie is all about. Even though it is almost 3 1/2 hours long, it never becomes dull or boring. Even if you don't like \"war\" movies. It is based on actual events, and will probably make you want to never serve on a submarine! I watched half on successive nights.This DVD is the \"Director's Cut\" which is (we are told in the extra features) almost like a new movie. All sound tracks were digitally remastered. Scenes were totally re-edited and 60 minutes total were added. New \"foley\" editing was done to provide 8 tracks of sound (down to 6 on the Dolby Digital 5.1 on the DVD). And, of course, it has both German and English language dialog tracks. All the main characters came back to work on this movie to dub in their own voices in English, so they look and sound authentic. You forget very quickly that it is a dubbed version.And the sound! You'd better have a super subwoofer, because the dynamic range of sound is amazing. Explosions are the most realistic sounding I've heard on a home theater system. And the perfect surround sound balancing makes it seem like you are really in the submarine.Do yourself a big favor - see the new release of \"Das Boot\" if you haven't already."
    },
    {
      "username": "film-critic",
      "userUrl": "https://www.imdb.com/user/ur1601212",
      "reviewLink": "https://www.imdb.com/review/rw0183006",
      "warningSpoilers": false,
      "date": "25 September 2004",
      "rate": "",
      "helpful": "38 out of 43 found this helpful.",
      "title": "You have to have good men. Good men, all of them.",
      "content": "If I had the time to take this movie door-to-door and sit down with everyone in America to watch this film, I would. Everyone needs to realize that I have a fascination with submarine films. I loved The Hunt for Red October and Crimson Tide. Both of them rank as my top action films. I don't know why I love this genre so much. I think it has to do somewhat with my passion for sci-fi. The ocean is almost like fighting in another world. So many times we have seen wars play out on land, and while there is only so much you can show with a land fight, the war field on the open sea allows for so much more creativity. Director Wolfgang Peterson gives us some great characters. While not much dialogue happens in this film, you can see everyone's expressions on their faces, and those expressions tell better stories than words. You can see their fear, their excitement, their sadness, and their power by just the way that Peterson directs them. With his direction, I felt that I was on this U-Boat with the crew. Peterson perfectly portrays a feeling of crampness and claustrophobia wrapped together as one. I think that during one of the bombing scenes I broke a sweat because of what was happening on screen. Finally, I am also a fan of films that tell a different angle on the story. So many years I have watched war movie after war movie that show the victorious American's beating the classic \"evil-doers\". Now don't get me wrong, these are fun sometimes, but I love to see a different angle. In history class we didn't learn about the casualties of the Germans in WWII. We learn about them as a statistic, and never put these heroes on a human level. This film humanizes the German's conditions during the war. The Germans are human being also, who fought for their country just as valiantly as our soldiers did during WWII. They had families, they had pasts, they had homes that they left to become a part of history. To fight for your beliefs. That is what America teaches us, fight for what we believe in....doesn't it? I could talk about this for hours, but instead I am going to sit back, relax, and tell you how wonderful Das Boot was to watch. I have not been this entertained for a long time. Bravo to everyone involved in this film. I think it IS the best war film ever released (that I have seen). I want everyone to get out of their seats this weekend and go rent this movie. I guarantee that you will not be disappointed. Grade: ***** out of *****"
    },
    {
      "username": "shmuey barak",
      "userUrl": "https://www.imdb.com/user/ur0790750",
      "reviewLink": "https://www.imdb.com/review/rw0182893",
      "warningSpoilers": false,
      "date": "7 July 2000",
      "rate": "10",
      "helpful": "1,238 out of 1,281 found this helpful.",
      "title": "Take it from a real submariner-",
      "content": "on modern \"boats\" life isn't easy- but compared to the living hell that the German U-Boats were, modern submariners have nothing to complain about. People in certain professions don't like to watch movies about those professions (Doctors and Nurses shy away from hospital dramas, for example). Submarine sailors are different. We love to watch every submarine movie ever made, from \"Run Silent, Run Deep\" and \"Destination: Tokyo\" to \"The Hunt For Red October\", \"Crimson Tide\" and \"U-571\". Why? Because we can always use a good laugh. For those in the know, submarine movies are usually absolutely hilarious. Except this one. After being in the Navy for four years, serving with around 350 different men, and being acquainted with a further 200-300, all of them submarine sailors, I think that I can state with absolute certainty that this film is the ONLY submarine movie that ALL submariners take seriously. And that is the highest praise a movie like this can possibly get."
    },
    {
      "username": "dunmore_ego",
      "userUrl": "https://www.imdb.com/user/ur2446936",
      "reviewLink": "https://www.imdb.com/review/rw2282541",
      "warningSpoilers": true,
      "date": "20 July 2010",
      "rate": "9",
      "helpful": "26 out of 29 found this helpful.",
      "title": "The Reich Stuff.",
      "content": "Never has nothing happening been such compelling viewing.No debate, no discussion, no contenders - DAS BOOT is THE submarine movie for the ages.In autumn 1941, World War II U-Boat 96, crewed by young rowdy Germans, puts to sea with its veteran captain, wildly Teutonic Jürgen Prochnow, his eyes the color of eagle and high cheekbones set on stun.The battle for control of the Atlantic is turning against the Germans, yet Hitler orders more and more U-boats with ever younger crews into battle against the British freighters and their destroyer escorts. This opening pitch and the antsiness of Jürgen's young hooligan crew seems to presage a roaring Hitlercoaster of war war war Amerikan style - but director/co-writer Wolfgang Petersen and writers Lothar G. Buchheim and Dean Riesner swerve to port with a counter intuitive yet singularly entertaining and tension-filled, character-driven non-action action movie. These young punks discover that being at war is much like the waiting room in any doctor's office.DAS BOOT is filled with periods of waiting in fear, waiting in boredom, waiting in terror, waiting in anxiety - and sudden action that rips throats and bends steel with its bare hands.DAS BOOT does something which most commercial war films are too gutless to do - humanizes Germans: they carry photos of their girls, they write home, there are heroes and cowards, there are hard men and those that crack under the strain; they catch crabs and rib each other about it; at one point, a sailor stops a celebration with the announcement of bad news on the radio - into the silence, he declares that back home, their team has lost! These men doubt much of the war propaganda they are fed. Even though German tacticians convey Churchill as a \"paralyzed guzzler\" the officers on U-96 respect the British fleet (\"Those aren't amateurs up there\"). Yet they do not fear the British simply because that is the default position of Germans in Westernized film, but because the British had better equipment. These Germans are not one-dimensional haters, not committed blindly to the Führer, not simple villain props as in countless Brit and U.S. movies. They are the heroes. And our hearts are with theirs in their throats every watery step of the way.Even in its shortest version, DAS BOOT is 2 hours, 29 minutes. The Director's Cut is 209 minutes, the uncut version is 293 minutes (4 hrs, 53 mins). It's the most fun you'll have growing a five o'clock shadow.DAS BOOT attains such a high level of drama, we forgive Wolfgang Petersen for the subpar exteriors, with those model subs and little dolls on the tower being foamed in slow motion to emulate a sizable u-boat.When most movies are ending - at the 1:33 mark - this movie sees its first action. Yet even the action is not what one expects: after U-96 fires torpedoes at a British convoy, they submerge and wait in silence, listening for the muffled far-off explosions and counting the British ships sinking by the groans of steel they hear through the depths. And they know they're in for repercussions - depth charges. The waiting begins anew - the interminable, unbearable waiting for death to claim you or not - as they \"run silent,\" all lights out, submerging further, engines at minimum. The sound of sonar pings their only warning that something is closing on them from above. The Captain says into the silence, \"Here it comes. The revenge.\" And all they can do is hang on through the bucking explosions and bolts bursting on pressurized pipes.After the terror subsides, Prochnow simply declares, \"That's the end of that.\" Not heroes. Not cowards. Just doing their job.When U-96 surfaces to survey their kills, they are outraged to find that one of the flaming ships they torpedoed still has men onboard, jumping off, screaming, aflame. And the focus of the Captain's outrage will surprise you: \"Why weren't they rescued after all these hours?\" One of his officers begins to weep for the dying. It's a wondrous portrayal of war empathy, of humanity. It makes us question war yet again, and question the supposed intelligence of the species that can create the marvel of submarines and battleships only to use them in such unproductive, moronic fashion against each other.Imagine the frustration of knowing that on a submarine, humans are the least important cargo - literally stacks of torpedoes, spare parts, tools for repairs (it's like being in space - there is nowhere you can turn if you need a certain part), food, fuel, ballast, the mechanics of the sub itself, and at the very bottom of the list - as evidenced by the way sleeping bunks are haphazardly squeezed into crawlspaces - people.Director Petersen instructed the whole crew not to go out into the sun during filming, so they would retain that bloodless pallor. He effectively suffocates us in the ghastly, claustrophobic passageways and \"living spaces\" of a submarine; he sends his cameras barreling through crawlspaces full tilt, pursuing running men who trip and glide through hatches; we almost feel the cracking of our skulls on jutting iron overhangs; sea water thunders in every time the top hatch is opened, drenching the plastic-coated charts and everyone nearby; everything is wet and damp, dark and cold...DAS BOOT is a gritty study in patience, tactics, anxiety, tolerance, futility, and brings a whole new meaning to wetting the bed."
    },
    {
      "username": "yenlo",
      "userUrl": "https://www.imdb.com/user/ur0313186",
      "reviewLink": "https://www.imdb.com/review/rw0182834",
      "warningSpoilers": false,
      "date": "13 May 1999",
      "rate": "9",
      "helpful": "155 out of 195 found this helpful.",
      "title": "Top of the line",
      "content": "When you go to a liquor store to buy Vodka you can purchase one of several brands or you can purchase Stoli. That's what Das Boot is when it comes to Submarine films. You can watch any one of several or you can watch Das Boot. Like Stoli Vodka it's in a class by itself. Superb film either way you see it i.e. subtitles or the dubbed version. See the directors cut if you can. The German crew could be any nationality the film is so well done it doesn't matter. Andy Rooney once said that when you're in a war you live life at 100%. The opening scene of this film demonstrates that. The men are living life at 100%. I never saw any other war movie that captured that like Das Boot."
    },
    {
      "username": "DICK STEEL",
      "userUrl": "https://www.imdb.com/user/ur0317399",
      "reviewLink": "https://www.imdb.com/review/rw1205813",
      "warningSpoilers": false,
      "date": "31 October 2005",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "A Nutshell Review: Das Boot: The Director's Cut (1981)",
      "content": "This is touted as one of the best WWII submarine films of all time, and it's not difficult to understand why. From the story to the cast, from the cinematography to the sound, everything's top notch on this German film directed by Wolfgang Petersen (who's now helming more Hollywood flicks). I'd rate it above U-571, K19: The Widowmaker, Crimson Tide, and The Hunt for Red October.We follow the exploits of the crew of German U-boat U-96, as it gets sent on its mission to destroy Allied convoys. We learn of the frustrations of inaction, having no targets, and living the lonely life aboard a submarine. We experience the claustrophobic environment, one which is shared amongst crew, where maintaining hygiene and tolerable living conditions is of the utmost importance of staying well. We pick up on the fear of the Captain about his inexperienced crew, most of whom were in their early twenties, and haven't seen much action in the high seas.What's gripping in this film is when things start to pick up. Technology those days aren't as advanced, and we see that U-boats are more likely to be sitting ducks when Allied destroyers hover above them on the water's surface, dropping multiple depth charges to rattle and hopefully destroy their underwater prey. The U-boat is the hunter, but once it has hunted, it becomes the prey.And such is the marvellous depiction of Fear in the crew's eyes, as they huddle in silence each time the enemy lurks above. The suspense literally keeps you at the edge of your seat, the silence, deafening. Many set action pieces bring out the different scenarios and challenges that the crew face in their voyage on the seas, and all these capped by the beautiful soundtrack which accompanies each scene. My favourite was the charge through Gilbratar.Although this movie takes on an Axis power's point of view, one can discard the political aspect of this film, and understand that lives on both ends are similar - each are fathers, brothers, husbands, and are thrown into a senseless political war. It doesn't go preachy on who's right and wrong, but touches on more human and basic issues of survival. Boys become men, and it is this transformation that is most obvious throughout the story.If you've got the chance, you must see the Director's Cut, running at about 209 minutes, just as Wolfgang Petersen envisioned it to be. Excellent stuff!"
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw1315715",
      "warningSpoilers": false,
      "date": "14 March 2006",
      "rate": "10",
      "helpful": "31 out of 38 found this helpful.",
      "title": "Hunters or hunted?",
      "content": "Probably the main reason that \"Das Boot\" is so great is because it shows that the men in the submarine aren't really Nazis: they were just drafted. But once the submarine dives, then the suspense sets in. Capt. Heinrich Lehmann-Willenbrock (Jurgen Prochnow) leads his men on a voyage of adventure and terror alike. As the viewer, you feel like you're in the submarine, getting attacked from all sides. Rarely do you see the kind of intensity that you see in this movie. Overall, it makes us question the idea of who's good and who's bad in wartime. It's widely agreed that the Axis Powers were the bad guys in WWII, but the men here don't hold Nazi ideology; we sympathize with them every step of the way. A great movie."
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw2426483",
      "warningSpoilers": true,
      "date": "9 May 2011",
      "rate": "10",
      "helpful": "15 out of 17 found this helpful.",
      "title": "A gripping, realistic, and forever haunting depiction of War's hellish nature ...",
      "content": "If you asked me why I expressed so much contempt toward pseudo 'great war' movies like \"Saving Private Ryan\" or \"Inglourious Basterds\", the answer is quite simple. Because there is still a certain breed of films that managed to perfectly capture the essence of War, among them, the masterpiece \"Apocalypse Now\", closely followed by the one I will review now: \"Das Boot\".\"Das Boot\", the boat, what a title! Very restrained, yet extremely meaningful, for two reasons : first, it sets the film, the U-Boat commanded by the experienced and respected Captain Lieutenant Lehmann-Willenbrock, the boat as a Goddess-like character in the film, who has the power to kill or spare her infants. Secondly, the language: German. The protagonists are German and if you look at them at Nazis, you miss the point. The film doesn't invite us to cheer for guys who belong to the bad side, but to reconsider our own approach to War. Spielberg makes glorious War movies with simplistic 'good vs. bad guys' formulas, when he should have taken some lessons of realism from Wolfgang Petersen who made a movie about men. They are only men who happen to wear one military suit, and we can't blame them for wearing 'the bad one'.Indeed, there is a lot to root for in the beginning, as they are not the cruel and stereotypical Germans, cinema used to portray, we're not in \"Stalag 17\" anymore, and the United States doesn't have the monopoly of War movies. A German director makes a movie about German soldiers for a change, and without any bias. He even, detached the main characters from any Nazi etiquette. At the drunken party in La Rochelle, the two veteran officers express very cynical ideas about Hitler : nice touch from Petersen not to portray the leads as zealous fanatics. The rest of the crew follows the orders, and during the first sequence, they just drink, dance, shout and vomit. The realism again works on a double level, it helps us to feel empathy for these young rosy-cheeked boys and pity at the same time; because this party could be their last. The fun is so extreme it almost looks like a last burst of youth and amusement before the serious adult stuff happens.And when it starts, you just have to hold your breath and prepare yourself for one of the most nightmarish and hellish journeys ever, making \"Apocalypse Now\"'s mission look like a cruise. It's a modern odyssey conducted by one of the most haunting cinematic scores ever, and a beautiful cinematography. And the central character of this odyssey is Lieutenant Werner, the Correspondent. We discover the boat through his eyes, and share his discomfort among the regulars. He represents the audience, the coming-of-age element of the story, and inspires through his clumsiness some very interesting statements from the Captain, like in the beginning, when he asks him to wait till the soldiers have grown beards before taking pictures of them. They still look too shamefully young, but as the movie goes on, their facial features become mature and likelier to make us accept a tragic fate. Facing other clean-shaved and well-dressed officers later, we notice the difference; they didn't act like Nazis; at the end, they don't even look like soldiers. \"Das Boot\" creates indeed a quite alienating environment, like living a War in microcosm.There's a growing feeling of claustrophobia invading our hearts, as we're embarked with these men making the empathy work on a physical level. When they listen to the ultrasonic detector with that scary repetitive sound, you know the shock is imminent. The question is: when? The thrills are so intolerable that the shock comes almost as a relief. But the worst has yet to come when they're hit by a flight attack that cause their sinking. It goes down, deeper and deeper, even below the pressure limit the previous false alarm taught us. It's a suffocating experience, and an extraordinary thrilling moment ... For my part, I literally held my breath, couldn't even gulp, didn't know what I was waiting for. Since there were Germans, and we know they won't win the War, they could really die in the boat, but that would have been too predictable I guess. And from the way they handled the crisis, becoming just men, crying, going mad, praying, struggling, while driven by their self-conservation instinct, we understand, that they're only victims of the alienating effect War applies on human minds, and when they think their fate sealed, they realize that all the military pride is just bullshit.But the ending is probably what saddened me the most, not to mention the shock. After all they went through, they died anyway, on the harbor, at their arrival. The point? I guess if the Germans were not the good guys of WWII, when it came to the individual battles, it was just a side against another one, they were still fathers, brothers, sons, lovers, dying there. We feel uncomfortable in the scene where they refuse to help the poor Allies soldiers drowning after the bombing of their destroyer, but in a way, it's another sign of maturity from the German director: now they are the 'poor' soldiers, every death is tragic And we feel sad because we rooted for them. The second point, is to show that after having understood the very pointlessness of War when they were in the bottom, they simply lowered their guard again, drunken by the appetite of victory, which transformed their joy into hysterical screams of disbelief during the bombings. As if you must lose in order to understand the meaning of War.Which might explain why the best War movies are still about wars that were lost, after all ..."
    },
    {
      "username": "Ruskington",
      "userUrl": "https://www.imdb.com/user/ur99782462",
      "reviewLink": "https://www.imdb.com/review/rw6347518",
      "warningSpoilers": false,
      "date": "8 December 2020",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Quite possibly the greatest war movie ever made",
      "content": "Astounding piece of cinema, presenting the horrors of war in a particular powerful way. Amazing use of colour and tone. Unlike other films in this genre, there is a real sense of humanity. Might well be the greatest film I'll only be able to watch once."
    },
    {
      "username": "faraaj-1",
      "userUrl": "https://www.imdb.com/user/ur8282981",
      "reviewLink": "https://www.imdb.com/review/rw1469361",
      "warningSpoilers": false,
      "date": "7 September 2006",
      "rate": "10",
      "helpful": "19 out of 21 found this helpful.",
      "title": "Lost men in a lost war",
      "content": "Das Boot (The Boat) is film-making at its finest. Not only is this the greatest naval film, it is one of the finest statements on war ever filmed.Jurgen Prochnow is the excellent lead as the Captain of a U-Boat faced with impossible odds. A compassionate man, he is a veteran at the age of 30. His performance really ties the film together and gives it a strong human touch.The tension in this film reminded me of Clouzot's Wages of Fear (especially the last 45 minutes). This is a deeply impacting film because the audience really feels the claustrophobia, the filth, the tension and all the other emotions that the 42 crew members of the U-Boat go through.The sentiments of Das Boot are decidedly anti-war. By showing that it consists of bureaucratic senselessness, German officers living in a fantasy world, the despair of the fighting men - it makes for a touching tale.The director's cut is the version to be seen although it is long. Each scene of the movie is a classic and will show you the realities of war."
    },
    {
      "username": "ShootingShark",
      "userUrl": "https://www.imdb.com/user/ur5232598",
      "reviewLink": "https://www.imdb.com/review/rw1072574",
      "warningSpoilers": true,
      "date": "2 May 2005",
      "rate": "8",
      "helpful": "15 out of 17 found this helpful.",
      "title": "Incredibly Intense WWII Submarine Action Drama",
      "content": "In 1941, Britain and Germany are battling for control of crucial Atlantic supply routes. German submarine U-96 leaves the French port of La Rochelle; its mission, to inflict as much damage as possible on cargo-ship convoys.This is a unique movie and for my money one of the best war pictures ever made. Whilst maintaining a very high level of drama and suspense for a long film, it also seems so real and credible, and the filmmakers went to great lengths to convey this authenticity. It is based on an autobiographical novel by Lothar-Günther Buchheim who was a real-life war correspondent. The stunning submarine set by Rolf Zehetbauer was built with incredible attention to period detail and as an enclosed space, restricting the camera-work but adding tremendously to the crucial atmosphere of confinement. The great cast gave everything to the picture (for example, they were not allowed out in the sun during the shooting) and their transformation as it progresses into haggard, bearded, weary ghosts is startling and unsettling. Prochnow is stunning as the unnamed Captain; a man who has the respect of his crew yet is essentially alone, but the entire ensemble are brilliant - I especially like Wennemann (the chief engineer), Tauber (the navigator) and Hoenig (the radio-operator) all of whom give quiet, thoughtful, understated performances, very atypical in an epic movie filled with action. The eerily effective use of sound adds to the movie's tension, and there is brilliant claustrophobic camera-work by Jost Vacano. The depiction of the crew's struggles - alternating intolerable boredom with sheer terror when the alarm is raised, evading depth charges and destroyers, running dangerously deep to avoid detection, repairing the ship (literally everything breaks at some point), following suicidal orders - is the heart of the film. U-Boat crews had a one in four chance of surviving, and the movie's heartbreaking conclusion is deeply profound and moving, regardless of your views on World War II. This is a film about people, not politics, which is why it's such a great war movie. Shot as both a 145-minute feature released first, and as a six-hour TV miniseries screened later; this review is of an even better 200-minute version recut by Petersen and re-released in 1996."
    },
    {
      "username": "Blueghost",
      "userUrl": "https://www.imdb.com/user/ur1552793",
      "reviewLink": "https://www.imdb.com/review/rw2366684",
      "warningSpoilers": false,
      "date": "9 January 2011",
      "rate": "",
      "helpful": "11 out of 12 found this helpful.",
      "title": "I'm jealous.",
      "content": "I'm jealous because this is probably the best sub film ever made. And I'm jealous that no American studio had the wherewithal to create such a human look at the undersea warriors and the lives they led. The shots are inspired. I don't know what it is, but there's something both commercial and artistically palpable about foreign feature films that beat American gloss hands down. \"Das Boot\" is no different. It differs in one regard from American films about the second World War, no demons are presented. There's a lot of demonization regarding \"the enemy\" in a lot of films depicting military conflict. There is no such effort here. Partly because we're looking at the second world war from the German viewpoint. But we're not seeing Nazi German soldiers fight for the \"Fatherland\". We're seeing people like you and me ordered to fight for a cause they're not all that sure about, but are duty bound to execute it to the best of their ability.There's no waving of flags in this film. None, other than that of the human spirit. The men involved are there to survive as they carry out their orders. The horrors of what the Nationalistic Socialist regime are doing to labeled undesirables in their home land is not on their minds. They either don't know or are focused on other matters.We see the lives of submariners. They happen to be German, but they are submariners none the less. The dangers of fire, pressure, power outages, smoke, gas, flooding, are all palpable in this film. So much that you're there sweating it out with them. You feel for them as they make a run for the sea or for home. They too feel for their victims. They steel their hearts, but you know they're more than uneasy about the task at hand, much less the \"cause\" for which they fight.The cinematography on board the sub is excellent. You feel the the non- spacious confines of their world of steel, valves, pipes and gauges. And when things go bad, you're there with them.Now, on the negative side, and I'm sorry to turn a somewhat serious and sombre review slightly comical, but there's one exterior SFX shot that bugs the hell out of me :-) It's a POV shot from the German U-boats bridge looking at another U-boat. The footage used for the background plate is recycled over and over again. To me this states that whoever was in charge didn't have the budget to get in contact with us here in California to sex up the visuals for that sequence. In terms of the drama it's functional, and the visuals don't collide too badly with that same drama. Yet there it is.The one draw-back is that it's awfully long. So much that you actually need to flip the DVD to see the rest of the film. In this regards it is a bit of a labor to watch.I don't care who you are, if you must see a submarine film, then see this one.Definitely not to be missed.Enjoy!"
    },
    {
      "username": "caffienated mind",
      "userUrl": "https://www.imdb.com/user/ur0690768",
      "reviewLink": "https://www.imdb.com/review/rw0182880",
      "warningSpoilers": false,
      "date": "18 April 2000",
      "rate": "",
      "helpful": "184 out of 199 found this helpful.",
      "title": "Nerve racking",
      "content": "Das Boot is one of the most emotionally involving movies I have ever seen. The characters are developed richly, without those awkward moments in movies when you realize that the director is doing so. You sympathize with the crew, and FEEL their plight as they struggle, cramped in a rickety U-boat against the odds. At times the movie grows slow and drawn out, but that is intentional- to make you feel like you are trapped in an underwater coffin with nothing to do, no where to go. The directing is great, the sound is fabulous! I've never heard faint noises tell a story like this before."
    },
    {
      "username": "Rick_Terminal",
      "userUrl": "https://www.imdb.com/user/ur1995448",
      "reviewLink": "https://www.imdb.com/review/rw1470046",
      "warningSpoilers": false,
      "date": "8 September 2006",
      "rate": "10",
      "helpful": "42 out of 47 found this helpful.",
      "title": "See the original 6 part epic rather than the film",
      "content": "10/10.8/10 for the cut version.This is a superior war film, and I don't want to add to the reviews praising it. It's one of those films that will make you watch if only you can spare the ten minutes it takes for it to grip you.Being British, I thought it impossible to feel sorry for the U-boat crews, especially after what they did to us - but this film forces you to realise that we are all fragile and emotional (despite what Hitler says).I would recommend people watch the mini-s rather than the film (i.e. German subtitled version) to get the full flavor.As a side note, my grandfather (twice decorated destroyer captain) burst in to tears watching this at two points: One was at Gibralta, the other on the straights :| Says a lot."
    },
    {
      "username": "everyones-a-critic",
      "userUrl": "https://www.imdb.com/user/ur3234013",
      "reviewLink": "https://www.imdb.com/review/rw0182991",
      "warningSpoilers": false,
      "date": "24 March 2004",
      "rate": "10",
      "helpful": "43 out of 46 found this helpful.",
      "title": "Listen up Hollywood - this is how its done",
      "content": "What can be said about this epic that has not already been said? Peterson has created the grittiest, most realistic war drama ever. It knocks hollywood epics like Saving Private Ryan on their sorry overproduced, oversentimental behinds, it torpedoes other submarine films before they have a chance to shout \"dive!, dive!, dive!\".I first saw this in its original form as a miniseries with english subtitles, and if you can find this version then this should be your first port of call, although the Director's cut I now own is also top notch and doesn't miss much from the series.where to begin? The lurking claustrophobia, the dark humour, the gritty reality of the piece. The excellent acting, the perfect timing, the garotte of suspense tightened with every passing minute in much of the undersea scenes. The lack of any known \"star\" who you know will just save the day and live to tell the tale. The historical accuracy and attention to detail. The lack of a demonised \"other\" figure for the enemy. The lack of any kind of preachy message in the finale other than \"War is Hell\". It has everything you could ask of a TV series or film about the era. 10 out of 10."
    }
  ],
  "errorMessage": ""
}