{
  "imDbId": "tt0091251",
  "title": "Come and See",
  "fullTitle": "Come and See (1985)",
  "type": "Movie",
  "year": "1985",
  "items": [
    {
      "username": "FilmFlaneur",
      "userUrl": "https://www.imdb.com/user/ur0867063",
      "reviewLink": "https://www.imdb.com/review/rw0987277",
      "warningSpoilers": false,
      "date": "29 December 2004",
      "rate": "10",
      "helpful": "521 out of 593 found this helpful.",
      "title": "One of the greatest wars films ever made",
      "content": "One of the greatest of all war films, Klimov's stunning work stands amongst such works in which the horror and sorrow of conflict are made fresh over again for the viewer, left to stumble numb from the cinema thereafter. Produced for the 40th anniversary of Russia's triumph over the German invaders in WW2, based upon a novella by a writer who was a teenage partisan during the war, the propagandist use to which it was later put - when the GDR was still in the Eastern Bloc, citizens were forced to watch this to warn them of another rise of fascism - does not impair its effect today at all. It echoes intensity found in another masterpiece by the director. Klimov's shorter Larissa (1980) is a remorseful elegy to his late wife. Poetic and very personal, its sense of shock anticipates the heightened anguish that ultimately reverberates through Come And See. Through his images, the director stares uncomprehendingly at a world where lives are removed cruelly and without reason, if on this occasion not just one, but thousands.At the heart of the narrative is Floyra, both viewer and victim of the appalling events making up the film's narrative, his history a horrendous coming-of-age story. It begins with him laboriously digging out a weapon to use and much changed at the end, he finally uses one. As he travels from initial innocence, through devastating experience, on to stunned hatred, in a remarkable process he ages before our eyes, both inside and out. His fresh face grows perceptibly more haggard as the film progresses, frequently staring straight back at the camera, as if challenging the viewer to keep watching; or while holding his numbed head, apparently close to mental collapse. Often shot directly at the boy or from his point of view, the formal quality of Klimov's film owes something to Tarkovsky's use of the camera in Ivan's Childhood, although the context is entirely different.The film's title is from the Book of Revelations, referring to the summoning of witnesses to the devastation brought by the Four Horsemen of the Apocalypse. 'Come and See' is an invitation for its youthful protagonist to arm up and investigate the war, but also one for the audience to tread a similarly terrible path, witnessing with vivid immediacy the Belorussion holocaust at close hand. Here, the intensity of what is on offer justifies amplification by the use of a travelling camera, point-of-view shots, and some startlingly surreal effects pointing up unnatural events: the small animal clinging nervously to the German commander's arm for instance, soundtrack distortions, or the mock Hitler sculpted out of clay and skull.Main character Floyra is the director's witness to events, a horrified visitor forced, like us to 'see' - even if full comprehension understandably follows more slowly. For instance during their return to the village, there is some doubt as to if Floyra is yet, or will be ever, able to fully acknowledge the nature of surrounding events. In one of the most disturbing scenes out of a film full of them, Glasha's reaction to off-screen smells and sights is profoundly blithe and unsettling. So much so, we wonder for a brief while if the youngsters really know what is going on. Its a watershed of innocence: one look back as the two leave and the reality of the situation would surely overwhelm Floyra - just as later, more explicit horrors do the viewer.Come And See was not an easy shoot. It lasted over nine months and during the course of the action the young cast were called upon to perform some unpleasant tasks including, at one point, wading up to their necks through a freezing swamp. Kravchenko's face is unforgettable during this and other experiences, and there are claims that he was hypnotised in order to simulate the proper degree of shell shock during one of the major early sequences. The sonic distortion created on the soundtrack at this point later appeared to a lesser extent in Spielberg's Saving Private Ryan, as did elements of a much-commented scene where a cow is caught in murderous crossfire. Klimov's camera ranges through and around the atrocities, although one doubts that a steady cam was available. By the end Florya is isolated from humanity, technically as well as mentally, by a striking shot that excludes the middle foreground. Disturbingly expressionistic though these scenes are, others such as the scene where Florya and the partisan girl Rose visit the forest after the bombing, achieve an eerie lyricism that are however entirely missing from the Hollywood production. And whereas Spielberg's work concludes with a dramatic irony that's perhaps a little too neat, contrived for different audience tastes, Klimov's less accommodating epic finishes on a unique, cathartic moment - no doubt partly chosen to avoid any bathos after events just witnessed, but one which sends real blame back generations.Hallucinatory, heartrending, traumatic and uncompromising, such a movie will not to be all tastes. It certainly does not make for relaxing viewing, although those who see it often say it remains with them for years after. This was Klimov's last film for, as he said afterwards \"I lost interest in making films. Everything that was possible I felt had already been done,\" no doubt referring to the emotional intensity of his masterpiece, which would be hard to top. By the end of their own viewing, any audience ought to be shocked enough to pick up a rifle themselves and vengefully join the home army setting out to fight the Great Patriotic War - a necessarily stalwart response without limit of participation, symbolised by the director who tracks a camera through the dense forest before finally rejoining a column of soldiers heading to the front. If you feel, like I do, that any real war film should succeed in conveying the power and pity of it all, then Come And See is an absolute go and watch."
    },
    {
      "username": "Asa_Nisi_Masa2",
      "userUrl": "https://www.imdb.com/user/ur4344252",
      "reviewLink": "https://www.imdb.com/review/rw1648309",
      "warningSpoilers": false,
      "date": "3 May 2007",
      "rate": "10",
      "helpful": "626 out of 684 found this helpful.",
      "title": "Masterpiece alert!",
      "content": "Even before the final credits rolled, I strongly suspected this movie would end up on my Top 20; in fact, perhaps even my Top 10. A teenage boy, his hearing impaired from having just been at the site of a bombing, and a young woman clutching at him, the two of them stumbling and sludging through a slimy, smelly bog. A stork in the woods as it rains. A cluster of dolls piled up on the floor with flies buzzing all over the room. You don't need vast, elaborately choreographed battle scenes to bring home the message of the senselessness and pain of war. Reading viewers' comments on the movie, it seems that most found the second half  which admittedly contained some of the most powerful massacre scenes ever filmed  as the most \"satisfying\". A few other viewers seem to imply the movie doesn't really get going until the second half. For me, it was the first half that got under my skin the most, for its cinematic originality, poetry and symbolic power. War is experienced by civilians as well as by soldiers: this may seem like an obvious statement, but it's only after watching Come and See that you realise how few war movies are truly about the suffering of the ordinary man and woman, defenseless child and frail senior citizen. Also, never before had I seen the plight of raped women in war so powerfully conveyed, and all this without the movie ever being voyeuristic or graphic. In cinema, rape is often portrayed as something that looks like rough sex. It isn't always quite clear why women get so upset over it. In Come and See, rape is shown as nothing but pure, unadulterated, hate-fuelled violence with only a superficial, external resemblance to sex. Unlike other raped women on film, you cannot imagine those in Come and See ever healing from their scars. On another subject, whoever thinks this movie contains \"propaganda\" is obviously prejudiced against the movie simply because it's a Soviet production, and should think things over a little more carefully. It's astonishing how you can still find little traces of the Cold War mentality surviving to this day, even in younger viewers... The fact that as detractors of Come and See claim, Stalin \"was no better than Hitler\" has nothing to do with anything at all, in this movie's context - Klimov's picture is NOT about nationalistic oneupmanship on who had the worst tyrant - it's about the basic suffering of ordinary humanity in war - ANY war, though this one happened to be going on in Bielorussia. There was in fact ten times more propaganda in ten minutes of Saving Private Ryan than the whole of Come and See. This is painful, sublime cinema. I've always believed there's something special about Russians when it comes to producing art, especially literature - this movie goes some way towards reinforcing that impression in me."
    },
    {
      "username": "HumanoidOfFlesh",
      "userUrl": "https://www.imdb.com/user/ur0865972",
      "reviewLink": "https://www.imdb.com/review/rw1412146",
      "warningSpoilers": true,
      "date": "6 July 2006",
      "rate": "10",
      "helpful": "194 out of 233 found this helpful.",
      "title": "Jaw-droppingly powerful and truly disturbing Russian war drama.",
      "content": "\"Come and See\" has to be one of the most powerful war movies ever made.It left me emotionally drained.The film tells the story of 12-year-old Florya(Alexi Kravchenko),whose desire is to join his countrymen in the battle against the fascists.His enthusiasm is written all over his face:in the opening scenes,which show Florya's recruitment by partisan soldiers,he wears the blissed-out smile of a hopeful child.After a bombardment,which leaves him temporarily deaf,he is left behind and stumbles across Glasha(Olga Mironova),who has also been abandoned.Together they return to his village, the atrocities witnessed there anticipating horrors to come.\"Come and See\" is a deeply unsettling film.It's hallucinatory,hellish,traumatizing and uncompromising.There's an aura of profound sadness here,as Florya ages dramatically over the course of the story's events.The film's most disturbing sequence revolves around the raising of one village and the slaughter of most of its inhabitants.The acting is excellent,the cinematography is stunning and the use of Mozart on the soundtrack is particularly effective.10 out of 10.A must-see!"
    },
    {
      "username": "clanciai",
      "userUrl": "https://www.imdb.com/user/ur10491760",
      "reviewLink": "https://www.imdb.com/review/rw6853453",
      "warningSpoilers": false,
      "date": "26 April 2021",
      "rate": "10",
      "helpful": "18 out of 20 found this helpful.",
      "title": "Overwhelming masterpiece of a child's awakening to the realities of war",
      "content": "This is one of the most realistic war films ever made, and it's the more realistic for being shown and exposed from the point of view of a child, which enhances the impact and makes the realism with its constantly increasing chain reaction of shocks, more and more growing to unbearable self-tormenting horrors and abhorrence, the more almost unendurable, but you have to stay on and see it all thorugh to the end. It is to be noted, that he never uses his rifle until in the very end, and the only target of his ultimate fire is some images. But that final outburst opens the finale of the greatest sequence of the film.You can't say too much about a film like this, words will never be enough, it is one of the greatest cinematographic experiences you'll ever have at the cinema, and although just one view of it all is enough for a lifetime, you will never be able to forget the details, and many sequences will recur in your mind, forcing you to consider this part of the war and its reality with no end to your shocked emotions and deeply disturbed indignation of an endless upset. It is very reminiscent of Tarkovsky, but it is better still than Tarkovsky, more realistic and more consistent in its absolute implementation. The Tarkovsky film that comes closest to this is his major masterpiece \"Anton Rublev\", which is equally consistent and overwhelming in its composition. But Elem Klimov and his writers go further, forcing the realism on their audience in constantly increasing crescendo in its horros, worse and more realistic than anything that Jerzy Kosinski wrote. This is a towering masterpiece of war films looming over all other war films, as it is a true story and almost more documentary than any realism could be for its unfathomable psychology in depicting a child's experience and reactions to all this."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw3614468",
      "warningSpoilers": false,
      "date": "7 January 2017",
      "rate": "10",
      "helpful": "30 out of 36 found this helpful.",
      "title": "horrors of war in 1940s Belarus",
      "content": "Elem Klimov's final film is a devastating look at the horrors of war through the eyes of a teenage boy who joins the partisans in Belarus (then the Byelorussian SSR or White Russian SSR). Much like Mike Nichols's \"Catch-22\" and Steven Spielberg's \"Saving Private Ryan\", \"Idi i smotri\" (\"Come and See\" in English) makes you feel as if the war is hitting you directly. And this movie leaves little to the imagination in showing the Nazis' brutality. Probably the most famous scene is when the Nazis burn down a house. There's music playing the entire time to ensure that the noise doesn't stop. You have rarely seen something as intense as this on screen.Klimov's wife Larisa Shepitko directed the equally intense movie \"The Ascent\", about some Soviet troops who try to defend a house from the Nazis (Shepitko got killed in a car wreck a few years later). The important thing to remember is that the Soviet Union lost almost 27 million people fighting the Nazis, more than any other country (it probably would've been more if the winter hadn't held the Nazis back). There's a reason why Russians still refer to the Great Patriotic War, as opposed to simply World War II. And this is one of the many movies that emphasize it. Definitely watch it."
    },
    {
      "username": "bnm81510",
      "userUrl": "https://www.imdb.com/user/ur0121336",
      "reviewLink": "https://www.imdb.com/review/rw0233821",
      "warningSpoilers": true,
      "date": "5 January 2000",
      "rate": "9",
      "helpful": "174 out of 218 found this helpful.",
      "title": "Apocalypse Then",
      "content": "In all fairness, this Belorussian-made World War II picture detailing Nazi atrocities, holds a special distinction in world cinema: it is by far the most brutal and emotionally draining of all - in fact, a viewer whose senses have not been properly trained would most likely find it unwatchable. Those brave souls willing to be put through an ordeal of almost 2 1/2 hours will find themselves deeply immersed in an absolutely horrifying experience that will not easily subside whether they want it to or not.The title, \"Come and See\", taken from the frequently repeating lines of the book of Revelation, clearly dares the audience to assume the role of St. John, witnessing the Apocalypse, or rather one of the darkest periods in the history of humankind. What we are assaulted with, plays somewhat like a demented version of \"Modern Times\" transpiring across the panel of Brueghel's \"Trimuph of Death\", if such a combination is possible. The camera is consistently filtered through a murky, slightly unfocused gaze, and the sound is often heard through shellshocked ears. This tends to eirly distance the events, yet make them even more frightening and unsettling. Much of the dialogue lacks specific meaning or even concrete sentences - it is replaced by subhuman growling, wailing and other spine-chilling, gluttural sounds of the war. What the director prepares is something Spielberg would never even dream of - no sign of compromise with the audience. A crowd of civilian villagers locked up in a barn by Nazi soldiers is not spared at the last minute like \"Schindler List's\" Jews- they are burned alive, and we get to watch all of it.Unlike most of the films in this genre, \"Come and see\" relies mainly on images and sounds instead of a coherent plot, which is not necesserily a weakness, since the sheer terror distorts time and space into a kind of hallucinatory blur, clearly intentional and understandable. But this incredible level of bleak intensity in the long run, has a negative effect on the film: the viewers have to desensitize themselves just so they can keep watching, so the most harrowing scenes are sat through in numbness.Another questionable move on the director's part is his occasional use of surrealism. While some visuals are painfully believable, while others are simply baffling: crazed villages consructing an effigy of Hitler, a pensive German commander with a pet slender loris (a rare African primate) on his shoulder, a female Nazi eating raw red lobster, not even mentioning a bizzare final montage wich is both inexplicable and obvious, ending with a real-life photograph that is perhaps the most terrifying of all in its implications. Yes, at times the movie overachieves its goals and seems almost like the footage in \"The Clockwork Orange\" that they made Alex watch to cure him of \"ultraviolent\" behaviour; yet other times it delivers the kind of jolts those accustomed to mainstream cinema could only wish they had. The face of a youth who had lost all sanity and aged many decades over several days, will be etched for an indefinite amount of time into the memory of anyone who has seen this film."
    },
    {
      "username": "JAM-31",
      "userUrl": "https://www.imdb.com/user/ur0413600",
      "reviewLink": "https://www.imdb.com/review/rw0233813",
      "warningSpoilers": true,
      "date": "11 December 2001",
      "rate": "",
      "helpful": "143 out of 181 found this helpful.",
      "title": "Possibly the definitive Russian front film",
      "content": "\"Come and See\" is bizarre, disturbing, and haunting. It is more moving and enlightening than all of the other (mostly disappointing) films I have seen depicting the Russian front in World War II. Strangely enough, the Red Army is entirely absent from the movie.As a Russian film, it begins less conventionally than most films produced in the west. It starts off very surreal, and it is difficult at some points to understand what is going on or what certain characters are doing. This gives the theme a foreign and realistic feel. We follow the life of a peasant boy in Byleorussia in 1943, as he joins the partisans. Certain events involving his family and his introduction to the partisans (especially one involving a young girl) make his fight more personal. Strange interactions between characters and Director Elem Klimov's follow tracking shots dominate the film, and give it a unique method of storytelling. Then the nightmare begins.The destruction of a Russian village is the horrific centerpiece of the story. It is brutally realistic, with more tracking shots that hold for long periods of time without cutting. We see the German Wehrmacht burn a barn loaded with civilians to the ground as these soldiers clap, smile, and embrace each other. The chaotic action involves many scenes that are sporadic (flames burning out of control, a German soldier accidently shoved into the barn house with the victims) and possibly improvised, which lend a great authenticity to the material. The images are unforgettable, and will stay with you long after you've seen the film. Klimov has succeeded in putting the viewer in the village. Surprisingly, despite coming out of the Soviet Union in 1985, \"Come and See\" never felt to me like propaganda. There was no communist rhetoric, and the heroes were all partisans, many of which were flawed. The Germans aren't caricatures at the same time they commit acts of evil, and view their actions in a banal way. When one of them defends the atrocities of his platoon, he states, \"inferior races spread the microbes of communism.\" The character delivers this line not with fierce anger, but with nonchalance, as if it were common knowledge, not something that he needs to explain to anyone. Some reviews have criticized the \"afterthought,\" a rewind of the Nazi rise to power and invasion of Europe, as unnecessary. It may be, but it is still powerful. Other \"flaws\" people find with the movie are all characteristics of the director's style, therefore I don't find them flaws. \"Come and See\" is a great, very different, and very moving film. Grade: \"A-\""
    },
    {
      "username": "paulmartin177",
      "userUrl": "https://www.imdb.com/user/ur10257171",
      "reviewLink": "https://www.imdb.com/review/rw1365708",
      "warningSpoilers": false,
      "date": "12 May 2006",
      "rate": "10",
      "helpful": "253 out of 298 found this helpful.",
      "title": "I saw a film today , oh boy...",
      "content": "I have a bad habit of reading too many reviews and comments about a film before I've seen it, mainly to get an idea about whether it's going to be worth a couple of hours of my time watching it. As a result, I am often slightly disappointed with much of what I see, as all the hype that I've read about a film kind of blows my expectations out of all proportion. I had a feeling this would be the case with Elem Klimov's 'Come and See', a film I'd read a lot about, particularly here on the IMDb. (Imagine my \"excitement\" when, having tried to see the film for nearly a year, I discovered it was to be released on DVD a week or two ago from today!) Well, I finally watched the film yesterday and... well, nothing could have prepared me for the sheer intensity and unflinching visceral horror of the atrocities that 'Come and See' invites us to... come and see. (Has anyone commented before on what a clever title that actually is...?) This is one of those films, like, say, 'Requiem For A Dream' or 'The Magdalene Sisters' (both of which, though great films, are simply not in the same league as Klimov's film), that one does not (obviously) so much enjoy as submit oneself to. By the end of such films we are left numbed and shell-shocked, wondering what we are supposed to do with the intense emotions that have been evoked within us. Yes, I felt like the ground had been pulled from beneath me; yes, what I saw in that film made my blood boil, my head hurt and my heart pound; and, yes, it showed me things I'd seen before but to a degree of intensity and detail that I had not experienced before. The point though, I guess, is that the role of cinema (and art in general) is not to offer answers or tell us what to think but to simply show us particular events and characters and allow us to come to our own decisions about what those things 'mean'. I'm rambling now, but I'll simply end by saying that 'Come and See' is, with its outstanding technical and artistic credentials aside, a film whose very title alone demands that it be seen. It is the work of a visionary, a cry of despair from the depths of hell, and an important reminder of humanity's capacity for inhumanity Go and see..."
    },
    {
      "username": "MacAindrais",
      "userUrl": "https://www.imdb.com/user/ur6267301",
      "reviewLink": "https://www.imdb.com/review/rw1483629",
      "warningSpoilers": true,
      "date": "25 September 2006",
      "rate": "10",
      "helpful": "110 out of 147 found this helpful.",
      "title": "And I heard one of the four living creatures saying, as with a voice of thunder...",
      "content": "Come and See (1985)**** I first saw this movie a couple of years ago. I didn't really know what to think of it at first. The soundtrack on the DVD is a little messy and the acting was a bit strange. I knew it had affected me though in a way that not many other movies had. As time went by I began to realize just how much of an impact the movie had on me. It really, really stuck with me. One night, while writing a review of Errol Morris's latest documentary \"Fog of War\", I found myself thinking more and more about Come and See, and decided that I had to watch it again immediately. I ran out after midnight and rented it, and watched it 3 times or so over the next week. I started to see why the film had been haunting me and sticking around my thoughts. The reason was that this movie is simply a masterpiece.Elem Klimov directs the film, starring Aleksei Kravchenko as Florya, a young boy who desires to fight with the Partisan's army against the invading Nazi army. He digs until he finds a rifle, then the next day he is off to a camp in the middle of the woods. The scene is chaotic it seems and unorganized. The fighters try to take a photo that takes about 5 minutes to accomplish because everyone keeps messing up their positions. Florya spots Glasha (Olga Mironova), a young girl, who has the younger fighters swooning over her, and who also seems to have some sort of relationship with the leader of the camp. What that relationship is exactly we never find out. Florya gets left behind on the attack because he is perhaps too young, and besides another older fighter needs some new boots, and swaps with the new kid. .The anxious Florya is upset by this decision and he takes to the woods for some solitude, he cries and then discovers that near by Glasha is also crying at being left at the camp, more so for being left alone than behind. The two begin to bond and end up in an open field when German planes attack and begin to bomb the encampment. The scenes that follow next teeter on the brink of madness on film. Come and See is likely one of the most maddening films ever made for that matter. The key is the soundtrack. Florya is struck deaf for a few moments by the bombs. Sounds are muffled, but not like anything you've ever seen in a Hollywood film. The soundtrack is a mix of strange ringing and sounds and music, adding to the atmosphere of chaos that the two youngsters have now been thrown into. Much of the film has this style of soundtrack, which makes the Florya's descent into madness much more poignant.The film movies forward from here back to Florya's village which has now been deserted. The two head to an island on the other side of a bog where Florya believes the town is hiding along with his mother and sisters. The scene where they climb through the mud is another example of Florya losing his mind. The soundtrack again becomes ambient and menacing in its strange blends of sounds. They eventually find some villagers and Florya now even more loses his sanity, along with some of his hair, which is given to recreate a statue of Hitler. This will be the last time we see Glasha in the movie, as Florya goes with a party to collect food for the starving people.The most famous scene, and the one that will likely never leave you, is of a village being ransacked by Nazi soldiers. The scene is chaotic and culminates in a barn stuffed with the townspeople being burned and shot apart. Another one of the most famous shots from the movie is of Florya shooting a photo of Hitler, each bullet making time reverse. The photo goes back in time until it is a picture of Hitler as a baby on his mothers lap. He is an innocent infant, and Florya cannot bring himself to fire another shot. These shots are incredibly powerful and they stick in your mind.Obviously, Come and See was filmed with influences of Soviet Propaganda in it, but it hardly matters because it is so well made and so maddening you can't help but be totally absorbed by the experience. The movie has a hypnotic quality about it, and without being horrifying because it's a jump out of your seat surprise bloodbath, it is horrifying in its representation of the cruelty people are capable of in war.I can't remember ever seeing another film that expressed the descent into madness any better and being so involving as Come and See. By the end of the film, you feel like you've just experienced what it must be like to lose your mind. The film never goes into the desensitizing of violence in war. Instead it focuses on the violence which causes those who witness to become desensitized from the madness of its cruelty.Elem Klimov created this film out of his actors and their emotions, and essentially used the viewer as another character. This movie draws you in and makes you experience exactly what the characters must. There are few other films that do that to you, especially to the extent that this one does it. And for that, Come and See is not only a masterpiece, it's really one of the best films you'll ever see. Find it, but don't just watch it. Allow it to take you in; even if that means you have to see it a couple times. Let it take you in, and you're in for an experience rarely found in cinema anymore"
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw1066105",
      "warningSpoilers": true,
      "date": "23 April 2005",
      "rate": "10",
      "helpful": "81 out of 114 found this helpful.",
      "title": "Come And See If You Dare:",
      "content": "Historical note:\"The film concerns the Nazi policy of \"total annihilation\" in the republic of Byelorussia (now known as Belarus or White Russia, adjacent to Poland) in 1943. The racial policy of the Nazis was to eliminate all \"inferior races\" such as Jews and Slavs from Eastern Europe and to make land available for German settlement in the east (Lebensraum). Because of the importance of Eastern Europe to Nazi policy the bulk of the German Army was sent to the eastern rather than the western front. Estimated that 20 million or more Russians (by Russians I mean the people of many nationalities that included Russians, Ukrainians, Byelorussians, Jews and many others who used to live on the Soviet territories occupied by Germans during 1941-1943) died fighting Hitler (recent estimates place figure 25-30 million). Units of the SS (Schutzstaffel) and SD (Sicherheitsdienst) were used to carry out the genocide. The SD was separated from the main body of the German Army (Wehrmacht) and made up of fanatical Nazis and fascist East European (often from the Baltic) collaborators.\"Elem Klimov's and Ales Adamovich's Film is perhaps one of the most powerful and horrifying films about the war (I would add Tarkovsky's \"The Childhood of Ivan\" aka \"Ivanovo Detstvo\" and Mikhail Romm's documentary \"Obyknovenny Fascism\" aka \"Ordinary Fascism\" aka \"Triumph Over Violence\"). Not for a moment would the film let the viewer relax. With each scene, the feeling of horror increases. We are transformed into the main character, 16 year old boy Florya. We are forced to see with his eyes, to hear with his ears. In the beginning of the film, Florya is a child. At the end, after having witnessed the unspeakable terrors of the fascists, he becomes an adult, and not just an adult  an old man. His face is the face of War  and it is to us, the viewers, authors say  come and look in this face if you dare. War unmistakably selects as its victims the weakest, the youngest and the tenderest - the authors could not go against this truth. In the military camp, Florya meets the young girl, Glasha. Together, they try to make their way to the village where his family lived. But no one is there, it is empty - it is burnt out. And again some force pushes Florya, Glasha and us to go further. But where? To the shed where the women and the children are burning alive? Into the hands of the rapists- fascists? Or to be photographed with the revolver put at your temple, surrounded by the laughing SS-men? Is there any way out of the Inferno of War? The mystery of the final episode Florya can not force himself to shoot the child at the photograph sitting at his mother's lap. Even if the child's name is Adolph Hitler. Florya puts his rifle down. The clear blue sky is above him. Sounds Mozart's \"Requiem\". What is this? Victory? Or defeat? Did Florya survive or did he perish like millions and millions during the endless days, months, and years of the worst war the humankind had known? Even if survived physically, he is a changed forever man, the man who looked triumphant death and horror in the eye for too long to ever forget them."
    },
    {
      "username": "robred69",
      "userUrl": "https://www.imdb.com/user/ur0585703",
      "reviewLink": "https://www.imdb.com/review/rw0233803",
      "warningSpoilers": false,
      "date": "20 February 2001",
      "rate": "",
      "helpful": "158 out of 214 found this helpful.",
      "title": "Awesome , powerful and brutal.",
      "content": "Come and See , well if you hate violence and brutality then you certainly wont want to see this. This Picture set in 1943 occupied Byelorussia is most probably the most true to life war movie ever, only Saving Private Ryan and Schindlers List can come close. What is amazing in this picture , is how the director uses a child's perspective and view in circumstances that you can only describe as evil. The director pulls no punches in how bad times actually were for peasents and partisans alike as German and collaborators show the viewer how low and depraved a fascist military machine actually is. I dont want to go into the plot , as this film is a MUST for anyone who considers themselves a film buff. Disturbing and terrifying scenes do not in anyway spoil the flow of the film , but when viewing this film , please desist from seeing this movie in the early evening , as you wont sleep.The acting accolades of course goes to the main characters , but I wish to give a special mention for the Russian Partisan Commander , who was just simply , superb. Everything about him was what you'd expect a Red Army Officer to be. The looks , the attitude and the steely determination is simply a credit to the actor. The best scene involving the Red Army Commander was when they had captured an Einsatgruppen Unit , and the SS soldier , who knew they were facing death was allowed to speak , after there own Commanding Officer was pleading pitifully for his own life. The SS soldier tells his captors that they are sub-human and that there peasent belief in Marxism was grounds enough that they should be eradicated. The Red Army Commander then in just a few words tells his men , that they are not just fighting for Socialism , but also the right to exist.What happens after...well you'll have to see.Come and See is nothing short of disturbing, awesome, powerful and brutal. This is the best film I have ever seen regarding films portraying the Eastern Front 1941-1945 war. This film should be engraved in gold as the standard for any budding war film director. Only Saving Private Ryan and Schindlers List can be put in the same League table."
    },
    {
      "username": "swillsqueal",
      "userUrl": "https://www.imdb.com/user/ur1825656",
      "reviewLink": "https://www.imdb.com/review/rw1983961",
      "warningSpoilers": false,
      "date": "1 December 2008",
      "rate": "",
      "helpful": "65 out of 88 found this helpful.",
      "title": "What happened in the Soviet Union during WWII...",
      "content": "This is the greatest war movie ever. The best way to describe it, I reckon, is to pass on a newspaper article written by Ilya Ehrenburg during World War II when all the things which happen in \"Come and See\" were happening:NIKOLAI VLADIMIROVICH -- ONE YEAR OLD Red Star, November 30 1943How much the Germans have taken from us! They have taken from us not only loved ones, homes, and possessions. Life was complicated. There were dreams, joys, people, many books, many countries. But now everything in me is unchangeably focused on one thing: on the German. I see him -- blue-eyed and inhuman. He walks and kills, he sings and kills, he laughs and kills.Among the papers of the town head of the village of Vyazovaya, recently liberated from the Germans, was found the following document:\"List of executed residents of the village of Vyazovaya, Uzninskaya region:1) Muzalevskaya Natalia Ivanovna. 43 years old. 2) Muzalevskaya Natalia Nikolaevna. 18 years old. 3) Muzalevskaya Diana Nikolaevna. 16 years old. 4) Muzalevsky Lev Nikolaevich. 13 years old. 5) Muzalevskaya Valentina Nikolaevna. 9 years old. 6) Muzalevskaya Tamara Nikolaevna. 5 years old. 7) Muzalevskaya Rima Nikolaevna. 3 years old. 8) Davydov Vladimir Ilych. 35 years old. 9) Davydov Anatoli Vladimirovich. 8 years old. 10) Davydov Victor Vladimirovich. 5 years old. 11) Davydov Nikolai Vladimirovich. 1 year old. 12) Pryadochkina Maria Petrovna. 60 years old.19 September 1942. Town head Muzalev.\"Can this be forgotten? Is it possible to live knowing that people are walking the earth who shot Davydov Nikolai Vladimirovich to death, one year old, an infant, the baby Kolya, shot him and ordered his name entered into a list? It is hard to talk about it, but impossible to forget. We still have a long way to go. But we will get there. We will find them. We will find them under their beds, in their vegetarian cafeterias, at the ends of the Earth. We will remember the one-year-old Kolya Davydov. We will remember much. **********The director, Klimov, concentrates on faces. From the faces you can see what they saw. Come. Come and see what this war was about in the Soviet Union. This was a war to the death; the Soviets knew and the Germans knew it. The Germans knew it because their leaders declared it so and 23 million Soviets paid with their lives. Ten million Germans also paid the price of that sale. The seller pays the price of the sale."
    },
    {
      "username": "rogierr",
      "userUrl": "https://www.imdb.com/user/ur0925512",
      "reviewLink": "https://www.imdb.com/review/rw0233814",
      "warningSpoilers": false,
      "date": "17 January 2002",
      "rate": "",
      "helpful": "83 out of 118 found this helpful.",
      "title": "unremitting graphical terror and accumulating atrocities",
      "content": "Elem Klimov and Aleksei Rodionov's handheld cinematography, present the viewer with the mental and physical destruction of a boy who changes in front of your eyes beyond recognition.Cacophoneous, industrial sounds and sometimes cryptic story-elements (for as far as there is a story) contribute to this ruthlessly escalating history lesson about Nazi's who burned down hundreds of villages in 1943 in Russia. The realism makes you wonder how many people were harmed making the film, while the score represents the mindnumbing experiences of Florya, a tour-de-force performance by Aleksei Kravchenko (16 at the time). All along, somehow Klimov knows very well how to prevent the audience from becoming numb.ILM's specialFX are smoother, but the FX here in 'Come and see' are so realistic, it's almost unreal: reminiscent of the first 30 min of Saving private Ryan, Thin red line (watch the animals), Apocalypse Now and the painstaking 'Band of brothers'. Indeed forget about the rest of 'SPR', Platoon and even Full Metal Jacket. However, I would like to recommend Deer Hunter (Cimino, 1978) and Hotaru no haka (1988). But I never suspected there was something massive like this. 10/10"
    },
    {
      "username": "sellery",
      "userUrl": "https://www.imdb.com/user/ur3761369",
      "reviewLink": "https://www.imdb.com/review/rw1367451",
      "warningSpoilers": false,
      "date": "14 May 2006",
      "rate": "10",
      "helpful": "438 out of 514 found this helpful.",
      "title": "Unbelievable",
      "content": "The best true-to-life war movie I have ever seen, and possibly the best movie I have ever seen. My eyes were opened when I saw this for the first time a few days ago. It made me realise what I miss 99% of the time when watching movies. So few affect me like this one did.No special effects of note, no big budget, no set-pieces of note, no heroes, no redemption. I feel quite sure the director has really captured what war 'feels' like - unlike Spielberg and Coppola's depictions of war, this director lived through WW2 and the horrific siege of Stalingrad, as well as spending many months researching the massacres in Belarus, one of which he depicts in this film (this from the DVD extras, well worth watching).The direction, cinematography, soundtrack and AMAZING acting by a first-time untrained actor in the main role are faultless, in my humble opinion.I found this film depressing and emotionally draining, but cannot wait to watch it again."
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw2198583",
      "warningSpoilers": true,
      "date": "28 January 2010",
      "rate": "9",
      "helpful": "33 out of 49 found this helpful.",
      "title": "Once Seen Never Ever Forgotten",
      "content": "Elem Klimov's COME AND SEE is a film best remembered for one scene and it'd probably be wrong to say it should be remembered for more that since THAT scene is one of the most disturbing and harrowing ever committed to celluloid . It also means the rest of the movie struggles hard to make up for it even though it tries . In many ways it's a throwback to the Soviet Home Front type of war movie mixed with Tarkovsky . Nature in all its imagery features prominently throughout the film . Forests are beautiful , green and silent on the surface but feature filthy , stinking swamps where a human can drown in . Man is also a hostage to the elements where rain soaks the skin and causes a human being to shiver . Man is not as fortunate as a bird who evolution has blessed with feathers and can sit on a swamp without sinking Like Andrie's Tarkovsky' 1962 film IVAN'S CHILDHOOD the story revolves around an older child - Florya - who finds himself caught up in the insanity of war in Byelorussia . While nature is cruel there's nothing more cruel than human tribalism coupled with unthinking ideology , a lesson Florya and the audience will find out later in the film . Until then the film concentrates on Florya's almost naive sense of adventure . The partisans leave him behind as they go to fight the Nazis so Florya wanders through the deep forests with his companion , an older girl called Glasha , perhaps blissfully unaware what the future holds for them both The film climaxes with an atrocity brought upon a village occupied by a Nazi death squad Einsatzkommando unit . People often use SCHINDLER'S LIST as the one film to show the brutality of the Nazi regime but to be honest the impact of Nazi atrocities may have a stronger impact here . There's a clinical ,impersonal feel to humans being murdered by zyklon B in gas chambers but to watch people being burned alive while the perpetrators laugh and treat the massacre as a nice day out does chill the blood . Worse still it's all based on truth . COME AND SEE finishes with a caption that 626 Byelorussian villages and their inhabitants were burnt to the ground . This was only in Bylorussia . This isn't counting the towns in Russia , Ukraine and other places in the USSR that was visited by Nazi murder squads . Disgracefully Mel Gibson recreated this very scene in THE PATRIOT where the British red coats committed an identical act even though there's no record of anything similar having happened during the American war of independence In conclusion COME AND SEE is a film that deserves to be seen by everyone even though it's sometimes distressing . It's this nihilistic and horrifying , brutal impact war has upon people in general and the young in particular that makes it a must see movie . It's also the last film director ElemKlimov ever made which is possibly just as well since it's the one one film a director should be remembered for . Such great talent going to Hollywood making romantic comedies and action blockbusters would have been such a waste"
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw1691449",
      "warningSpoilers": true,
      "date": "11 July 2007",
      "rate": "",
      "helpful": "74 out of 118 found this helpful.",
      "title": "Makes Schindler's List look like Sesame Street",
      "content": "Elem Klimov directs \"Come and See\". While the film predominantly follows the rites-of-passage journey of a young boy, it is remarkable how often and effortlessly Klimov shifts visual perspective, offering us the objective and subjective states of a wide range of characters and objects. For example, in one of the films most surreal scenes, several characters are shown guiding a cow across what seems to be open and unguarded terrain. Suddenly a series of intense firefights break out. Several characters are killed, but it is the fate of the cow with which the film is most preoccupied.The images of the cow standing untouched by the raging skirmish, then struck by a barrage of bullets, and finally of its eyes rapidly shifting and dilating before death, are indicative of \"Come and See's\" ability to produce indelible images from what are often quite standard war film situations. Like Malick, Klimov is as much interested in the landscape (and the objects and people that inhabit it), as he is in representing the minutiae and widening horror of his protagonist's journey from home to the multiple sites of slaughter and genocide that mar his countryside.The journey of a wide-eyed innocent across apocalyptic terrain is common territory for the war film (Ichikawa's \"The Burmese Harp\", Tarkovsky's \"Ivan's Childhood\", \"The Human Condition\" etc), but Klimov is going for a much more macabre tone, bludgeoning us with the sheer intensity and sick morbidity of his images.Unlike, say, \"Schindler's List\", \"Come and See\" is also remarkable for its use of abstract colour and sound. This is not a realist film; its shocks and effects are more dreamlike, from the mutedness of its burnished cinematography, to the extraordinary close-ups of several of its characters' impossibly aged faces, to the hyper expressive performances of many of its actors, to the impressionistic and at times almost expressionistic use of sound. In this context, the title of the film is not just a call for audiences to bear witness, to \"see\" that which is not imaginable, that which has little visual record, and to get a sense of the physical conditions (the \"come\" of the title) experienced by those during the war, but a description or pointer towards the more spectatorial expectations of the film. Of course the order \"come and see\" also functions as an exploitative challenge; \"Come and see if you dare!\" Indeed, many Chinese war-porn/propaganda films feature eerily similar titles.The film is essentially an epic journey and many of its images possess an almost Dantesque quality. It can also be seen as a \"coming of age\" film, a remarkable \"coming\" or progression (or is it regression?) that is etched upon the utterly transformed face of its central character. Unsurprisingly, Spielberg screened \"Come and See\" several times for cast and crew prior to shooting his Holocaust film. \"See\" would prove a huge influence on Spielberg's \"Empire of the Sun\", \"Schindler's List\", \"Wr Horse\" and \"Private Ryan\", in its mixture of child-like innocence (lots of dollying in to the shocked children's faces) and brutality. This is the worst aspect of Klimov's legacy, his film opening the doorway for an onslaught of other shock-porn movies - all the way to Gibson's \"The Passion of the Christ\" - all of which pretend to be history lessons and important \"humane\" testimonies, when in reality they simply use progressions in technology to escalate violence levels, push tolerance levels and are built around a primary need to jolt apathetic, desensitised audiences. Hilariously, as war-porn gets more hard-core, in real life the numbers of genocides, wars and atrocities demonstrably increase, whilst media coverage decreases and public apathy increases. This is the mistake of all \"war films\": people don't repeat because they forget (the implication being that we must therefore shock ourselves into awareness), we forget because we repeat (see \"The Shining\"). The human animal needs denial more than food.So while \"Come and See\" and its Spielberg imitators lack any real historical depth, complexity, nuance, understanding of human beings, and trade in simple exploitation, they also possess a kind of psychological naivety, perhaps best exemplified by Klimov's final scene, in which a kid essentially refuses to shoot a young Hitler. WW2's engine had little to do with Hitler, but here he's reduced to the genesis of evil, the seed from which WW2 blossoms.Though commissioned by the Soviet Union as a propaganda piece, \"Come and See\" was made shortly prior to the fall of the Iron Curtain, a period in which artists had a certain amount of freedom. Klimov's films is thus at times self consciously a meditation on Stalinist war films. In this regard the film literally begins upon the beach where Tarkovsky's \"Ivan\" ends, from where it attempts to create a new \"war narrative\", shunting aside Stalinist glorification for a kind of psychological shell shock. The result, though, is basically a Soviet version of \"Men Behind the Sun\", the infamous Chinese propaganda film in which we're called to bear witness to the activities of sadistic Japanese soldiers. In Klimov's case - the film focuses on the Nazi atrocities in Byelorussia - we leer at sadistic, vile, rapacious, murderous and cowardly Nazis while Communist partisans are portrayed as playful, comradely and righteous people. If a countries leadership willingly sided with the Germans from 1939-41, invaded countries (Poland, Lithuania, Latvia, Finland etc) carried out numerous atrocities against other nations and their own people and supported the Gulag system, then the viewer needs to be extremely careful when they view material that has been officially sanctioned by that leadership.8/10 - Worth one viewing."
    },
    {
      "username": "gavin6942",
      "userUrl": "https://www.imdb.com/user/ur1234929",
      "reviewLink": "https://www.imdb.com/review/rw2840916",
      "warningSpoilers": false,
      "date": "29 July 2013",
      "rate": "8",
      "helpful": "13 out of 17 found this helpful.",
      "title": "A Soviet Perspective of World War II",
      "content": "After finding an old rifle, a young boy joins the Soviet Army and experiences the horrors of World War II.Roger Ebert called this film \"one of the most devastating films ever about anything, and in it, the survivors must envy the dead... The film depicts brutality and is occasionally very realistic, but there's an overlay of muted nightmarish exaggeration... It must unfold as a surprise for you. It pretends to roll back history. You will see how. It is unutterably depressing, because history can never undo itself, and is with us forever.\" That probably sums it up. This could be considered one of the greatest war films of all time, or at the very least one of the greatest World War II films of all time. The story is gruesome and realistic, and all the more terrifying for focusing on two children rather than the world of the adults. The contrast between \"playing war\" and actually taking part in one is so strong that it may have us wondering why we \"play\" such games at all..."
    },
    {
      "username": "notoriousCASK",
      "userUrl": "https://www.imdb.com/user/ur31221670",
      "reviewLink": "https://www.imdb.com/review/rw3814661",
      "warningSpoilers": true,
      "date": "25 September 2017",
      "rate": "10",
      "helpful": "62 out of 84 found this helpful.",
      "title": "One of the finest films of all time.",
      "content": "World War II in Belarus, in the region near the Polish borders. Compelled by patriotism and youthful idealism one young boy (Aleksei Kravchenko) leaves his village to fight with the Soviet partisan resistance against the Nazi invasion. Within minutes his innocence is stripped away and the premature knowledge of war is revealed to him. He gets away from his unit and returns home, only to find the whole village including his family slaughtered and their bodies stacked behind an old farm!The horrendous depiction of war that Klimov creates is unique in the history of cinema. There is no plot, only a terrifying wandering in the nature, as the boy comes face to face with constant terrorizing and horrendous scenarios. Heroisms and sacrifices do not exist, nor inspiring speeches that excite the people to resist and fight the enemy. There is only the unexpected, death, violence and victims! A poem of a nightmare, relentlessly grim, deeply disturbing, and made unquestionably more dread-inducing by the fact that almost everything depicted really happened, it is a depressing but necessary reminder of one of the darkest chapters in human history. Idi i Smotri also manages to be both poetic and realistic and that is a supreme accomplishment on the part of the director.The film depicts real and surreal images that only war can justify. Transporting us back to World War II setting with its aptly-chosen locations and era-appropriate set pieces Alexei Rodionov's documentarian cinematography incorporates a lot of steady-cam and captures the events without any interruptions by employing long takes, and stands as one of the best films to use it as extensively as this one does, while desaturated colour tones add an urgency and bleak feel to its aura. The imagery at times is darkly psychedelic and truly arouses a sense of fear within the viewer because Fliora's surroundings are often made to seem out of this world. Such an image is the one where a soldier of the resistance, using mud, pieces of wood and a Nazi uniform, creates a German soldier totem. The widows and the mothers attack the totem and destroy it in a primitive act of violence and catharsis. There are moments in which the film is depicted through the eyes of the protagonist, and all sounds collapse into oblivion, reinforcing his deafness after the bombs' explosions.Come and See is one of the most affecting and confrontational war films ever made. The majority of war films claiming to be anti-war, show heroic acts with weapons and very capable soldiers that can save the day. Come and see does not offer such relief and comfort. It shows that in the war there are only victims. Though no one could possibly describe the experience of watching Come and See as a fun time, the film is nonetheless a masterpiece, worthy of consideration as not just the best war movie ever made, but also one of the greatest films ever made. Come and See is an enduring landmark of Soviet cinema whose potency and relevance will never be diminished by the test of time."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1278371",
      "warningSpoilers": true,
      "date": "29 January 2006",
      "rate": "8",
      "helpful": "20 out of 29 found this helpful.",
      "title": "exceptionally gritty and realistic",
      "content": "This film was no fun to watch, nor should it have been considering it is about the Nazi atrocities in Belarus during WWII--as seen through the eyes of a young recruit for the partisans. This young boy appears to be about 12 or maybe 13, though through the course of the film, he ages what appears to be many years, though the action that occurs seemed to take place over just a few days. The movie was a solid recreation of the horrors and is good because it makes the faces and lives affected by this sick war so very real. Because of its content, it is not a film for children, though it probably is okay for teens provided you discuss the movie with them afterwards. No serious complaints about the movie at all, though it would have been nice if the German planes they used in the film weren't the same FW-189 reconnaissance aircraft over and over again--but this is the most minor of complaints--it was a great picture overall."
    },
    {
      "username": "AndreiPavlov",
      "userUrl": "https://www.imdb.com/user/ur6694944",
      "reviewLink": "https://www.imdb.com/review/rw2807950",
      "warningSpoilers": false,
      "date": "5 June 2013",
      "rate": "10",
      "helpful": "51 out of 78 found this helpful.",
      "title": "\"The soundtrack is boring\"",
      "content": "To write a simple review seems to be an easy task. Let's complicate the matters a bit. If You have time and inclination, perceive my point and method of commenting this particular movie. All right, here we go. What do we have on the negative side? The following lines are taken out from the IMDb reviews.1 \"The soundtrack is boring, without any decent music at all... Indeed, this is not a realistic film in any way, shape or form... Its propaganda, devoid of any artistic merit. I give it the minimum score because of its extreme pro-Soviet bias, which makes the film offensive and indeed Soviet propaganda\". (by Jose Cruz)2 \"And I love films, but really films are supposed to be entertaining. Or shocking. Or thought provoking. This is so tedious it feels like the director is calling the viewers bluff\". (by robc-26 from United Kingdom)3 \"A war movie should educate the viewer in any of a number of ways. We should appreciate courage and sacrifice, we should empathise with the cold, hungry and terrified. We should be told about historical events and their impact on the final outcome\". (by Reebox from United Kingdom)4 \"Lack of dialogue and explanation means that much of the time you don't know who people are or where they're going or what they hope to accomplish when they get there\". (by hanfuzzy from Barrie, Ontario, Canada)5 \"The character of the boy doesn't seem developed enough and the imagery presented in some so-called \"intense\" scenes did not truly attract my attention nor made me empathize with the character\". (by dubbs37 from United States)6 \"Bad lead character development\". (by entej from Russian Federation)7 \"The film is very slow and at many times throughout, nothing much is happening... The long, ringing in your ears, muted sound is off putting and not effective\". (by richard6 from United Kingdom)8 \"I wanted to see more actual fighting, and how the war was perceived by soldiers not a 12 year old boy...\" (by Steve Johnson (twiglet-1))9 \"The Nazis was professional killers, OK, but they were yet civilized (if I could say so) beside of a savage hypocrite murders called russians with their red army!.. Nazis were stupid kids beside Red Holocaust and Stalin. Be serious!!!!!\" (by nazratst from Romania)10 \"The infamous village massacre happens in the last fifteen to twenty minutes of the film, and the German soldiers look so ridiculously evil and cartoon-like that it's very hard for this scene to have any particular interest or emotion. To be honest, I was so bored up to this point that the barbaric events unfolding on screen before me were almost welcoming as at least something was finally happening\". (by JSwallowX1 from Ireland)So, we can sum it all up in the lines below (adding some groovy spice will also help).Being a piece of blunt Soviet propaganda, the film is devoid of any historical accuracy and artistic merit. It's dull and tedious with an uninteresting main character (who has absolutely no background and is free from any development – either physical or mental). Who cares about some kid during the war times? Give us a HERO, not a whimpering child! This \"war\" flick is neither entertaining nor serious. Its fictional happenings (women and children burnt in the barns by the Nazis? come on, in reality it was vice versa! read the historical documents!) pump up to the levels of \"Star Wars\" with one serious difference: \"Star Wars\" was at least thought-provoking and shocking. There is no decent music in the movie at all and the whole soundtrack cries out to get turned off. The last straw that could break any camel's back (i.e. insult any viewer's ears) was some cheap melody at the end of the flick. The whole movie is boring to such degree that any normal human being will yawn and fall asleep during the initial 10 minutes. If you want to see a real feat for the eyes and ears, watch the documentary \"Der Ewige Jude\", which IS a masterpiece at all levels and on top of everything has realistic cow scenes (unlike this one). Watch any USA picture with the WWII topic – they are not many, but at least they represent the historical facts and show us WHO won the World War II and at WHAT unspeakable price... The Russians exaggerate things immensely, making the events going on on their territory look like some kind of annihilation. Nonsense. The Germans were never cruel during the WWII on the USSR territory and they always behaved in a most decent manner. It was Russian troops who were deranged killers (there is even a historically accurate photo of a Russian soldier bullying a poor German woman and robbing her of her bicycle! and it happened in the streets of Berlin when the war was over! Check out the I-net archive footage if you don't believe! just imagine WHAT was happening during the war days!). The verdict: if you are a sane civilized and thinking European, stay far away from this schmoopy fantasy.Do You agree? What do You know about the WWII? How empty is Your vision? To which extent are Your brains brainwashed and \"freed\"?Any further comment is superfluous. Actually, this movie does not need any review or comment. But our today's way of life needs it badly. And today's cinema.Thank you for attention."
    },
    {
      "username": "vlad_reven",
      "userUrl": "https://www.imdb.com/user/ur18834323",
      "reviewLink": "https://www.imdb.com/review/rw1844421",
      "warningSpoilers": false,
      "date": "22 March 2008",
      "rate": "10",
      "helpful": "281 out of 324 found this helpful.",
      "title": "a brief comment on some comments",
      "content": "What most of the foreign viewers perhaps don't understand is that the factual side of the movie has always been a common knowledge among millions of Russians especially those of older generations. People like me, who were born 10-15 years after the war ended, knew it all along first hand from the stories told by parents and grandparents actually living through those times and events. My own mother at the age of seven was thrown by German soldiers into a barn that got lit, her front teeth were knocked out by the butt of a German soldier's rifle and she, along with tenth of other village kids, was saved by my grand-mother and other villagers only because some partisans had chosen to attack and deliberate the village that day. What most of Western viewers find horrifying, shocking and disturbing is nothing but the truth being accurately depicted by some later movie makers. This movie is pretty much like a documentary that could actually be shot with the help of some sort of a \"time machine\" in case there was one in 1985 when the movie got filmed."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw3863155",
      "warningSpoilers": true,
      "date": "20 November 2017",
      "rate": "10",
      "helpful": "13 out of 19 found this helpful.",
      "title": "\"You didn't know it would turn out like this, did you?\"",
      "content": "It's probably a good thing that we have movies like this that show the brutality and evil of war, but I don't know if the mass of humanity ever learns from them. In recent days I've watched this movie and \"The Battle of Algiers\", and if you look at present day headlines and follow news of terrorism around the world, one must concede that the aggressive use of force is a distinct part of Man's nature. This is a viscerally disturbing film to watch, with scene after scene of intense brutality that would render a normal person who experienced it dysfunctional and mentally unhinged from reality.It's those utterly insane things that young Florya Gaishun (Aleksey Kravchenko) experiences after he quite enthusiastically joins the war effort against the Nazis in his home country of Byelorussia. The most disturbing scene for this viewer occurred when the German soldiers herded the citizens of Perekhody into a barn and set it on fire. A rationale offered later by a young captured German soldier reflected a hideous ideology, that all Russians needed to be exterminated and children had to die because 'the trouble starts with them'. To claim that this warped Nazi thinking belonged to butchers is an understatement; that's too kind a word to apply to the monsters that they were.I'm appreciative for having watched this movie, it's story and images will remain with me a long time. Some consider it the greatest war movie of all time, and though I would disagree, I would point to \"All Quiet on the Western Front\" as another film with a similar emotional impact and rates a similar rating to this one on IMDb, the point of difference being that 'All Quiet' was made in 1930 and relates the horror that took place during World War I. Both films ought to be a timely reminder that war is hell, and can turn one's life into something unimaginable in an instant."
    },
    {
      "username": "dbborroughs",
      "userUrl": "https://www.imdb.com/user/ur3079504",
      "reviewLink": "https://www.imdb.com/review/rw1802998",
      "warningSpoilers": false,
      "date": "19 January 2008",
      "rate": "9",
      "helpful": "26 out of 43 found this helpful.",
      "title": "One of the greatest war films ever made",
      "content": "I needed to have two hours and twenty odd minutes to watch this with out interruption. I didn't want to break it for any real reason or for any real length of time other than to change the disc (more on that later).I had the time so I watched the movie.I could argue that with two small flaws this is one of the greatest anti-war films ever made.This is the SUBJECTIVE story of a boy who joins the partisans during the German invasion of Russian and his decent into hell.This is a tough movie. its in your face and everyone else's, literally as we see everyone and everything that our hero does even to the point that if he's talking to someone the camera will hold on them as they speak with no cut aways. We learn everything about people by their faces since we have the time to study them. This is simply one of the few times where even if the film had had a different aspect ratio other than 1.33 (tv shape) I would rally to have it full screen rather than letterbox simply because for this movie you MUST lose yourself in what you see and hear. Having someone facing you, looking at you is more powerful when all you can see is their face. Faces are a landscape in this film.This is especially true of Floyra, our hero who's stunned expression at all that happens around him is a constant source of wonderment.As we as shocked and rattled by what we see we know that he is even more rattled because he is there and he is expressing it on his face. Its said he was hypnotized to be able to get the right expressions, and seeing the pain on his face I believe it since you could only express what he is by living through it... Wide eyed numbness his mouth sometimes agape we watch as he tries to just get on...The film as I said is subjective and we see and hear, literally, what Floyra does. When his hearing is thrown askew by shelling what we hear becomes less distinct. Sound will drift in and out and we get a sense of being there. The camera also holds on some scenes at times Not cutting away for better angles simply because Floyra doesn't have them.This film will rock your world and then some.I want to tell you everything about the film but at the same time fear that doing so will set up expectations as to what happens. Reading the material on the film and seeing the trailer set up some expectations in my mind, some of which was right and some was wrong. I would like to have you see the film knowing as little about what actually happens as possible so you experience the film straight. I lost my expectations the minute the film began and I was wondering what was going on... I was hooked as the long strange trip took over. I'm certain that once the film stats you will be free of expectations too but, at the same time I think if I told you too much it would ruin the what happens next.This is GREAT film making.That said there are two small flaws.First, as some reviews have said the Germans, when they finally show up on screen are just a tad cartoony. menacing but slightly cartoonish...I could be wrong... but regardless through it all Floyra's pained expression cuts the cartoon away and reminds us this is bad stuff going down.The second flaw is a montage of actual footage used near the very end. I know why it was done, or can guess, but its too long. It breaks the spell in some ways... I think it would have been more apt had the film had the original desired title of \"Kill Hitler\".The last point I want to make is the fact the film is on two DVDs. Released two years ago there is no logical reason for the film to be broken into two parts, the tape is a single cassette release, except that like many films from the Russian Film Council its loaded with subtitles, 13 languages and three audio options. There is also other extras like an introduction by the film maker that runs 20 minutes, documentary footage and an interview with the lead actor. But I digress....I'm certain that the film doesn't really need to be in two parts for any reason other than a technical one... except that in a strange way the break sort of works for the film if you watch it straight through taking only a break to switch discs. Call me crazy but the break is perfectly placed at the mid point to the story. Not only that the film changes from first half to second half. The tone , even though continuous in action, is different as the second disc begins. Its almost as if we are back at the beginning of the film at a peak that slowly slides downward. Time wise the two halves are different with the action taking place over a couple of jumbled days while the second is one continuous series of events over two days.In the end all that matters is the film.And here the film is absolutely great.See it and be moved.----------------------------------- random thoughts In its way its comparable to grave of fireflies The film that many people compare it to, Destiny of a Man, is a relation but not direct ancestor of it simply because the films are very different, Destiny taking place over years in Flashback, Come and See is happening here and now over weeks. They share themes and elements but the thrust and points are different, especially in the end..."
    },
    {
      "username": "LSigno",
      "userUrl": "https://www.imdb.com/user/ur0016134",
      "reviewLink": "https://www.imdb.com/review/rw0233807",
      "warningSpoilers": false,
      "date": "25 June 2001",
      "rate": "10",
      "helpful": "185 out of 227 found this helpful.",
      "title": "Death, destruction and despair",
      "content": "There's not much one can say about this movie, besides \"Be warned, it's going to hurt you - a lot\". The story is simple: Byelorussia in 1943 and it's Hell on the Earth. The Nazis are fighting a no-quarter-given-or-asked war against huge Soviet partisan units, and the population is caught in between (historically the German security forces destroyed hundred of Byelorussian villages murdering most of the population in the effort to \"clear\" the rear of Third Panzer Army). Those who haven't been deported or killed by the Nazis are trying to join the partisans. One of them is Florya, a young boy - and in his quest to \"join the fight\" he get much more he had bargained for. It's a movie about an apocalyptic world (the title is taken from the Book of Revelation, a most of the movie looks like it has been filmed on another planet), but unfortunately it was all-real. The emotional centre of the movie is a lengthy sequence involving the destruction of a village, with all the sickening (but not exploitative) details shown with cold determination. There's no catharsis (this is not Schindler's List!), no hope, no redemption - even the eventual revenge against the village's destroyers become just a sad and murderous business. \"Come And See\" is a difficult, violent and surprisingly poetic movie, compared to which even classics like \"Saving Private Ryan\" (Spielberg payed a homage to this movie on SPR's beginning) or \"The Thin Red Line\" seems just artificial. This is the real thing!"
    },
    {
      "username": "Andrew426",
      "userUrl": "https://www.imdb.com/user/ur126281323",
      "reviewLink": "https://www.imdb.com/review/rw8915773",
      "warningSpoilers": false,
      "date": "8 March 2023",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "A surreal and effective nightmare of an anti-war film",
      "content": "Trust the Russians to make one of the most miserable films ever made! I was told horror stories about Come and See - how it was one of the most harrowing and brutal films ever, how it superseded most horror films, and how it left its actors in a state of trauma after filming. It is no surprise the director retired from filmmaking after this one - there really was nothing left to make. What could you make after? A romcom?Unlike films such as All Quiet on the Western Front, perhaps the most recent example of a grim anti-war film, the horrors of CaS aren't as in your face as the latter. It is a much grimier, slow burner that allows its grim imagery to seep into your skin, exemplified further by the fact that real life consequences came from many scenes. Live rounds were used during filming and the cow we see in the film really was shot to death. Nasty stuff.Apart from a few others, Aleksei Kravchenko may be one of the greatest child actors of the century. His performance trumps most adults of the film industry. We see how the turmoils of war slowly deteriorate this poor child, and I've never seen trauma so effectively depicted visually before. By the end of the film, Fliora looks about 3 decades older, a consequence of all the horrible tribulations he was succumbed to.This film is not a dramatization in any sense, just pure, raw, blunt trauma. There are no heroes, everyone is a monster and everyone suffers. This is NOT a fun watch, but perhaps one that still needs to be seen to really hammer in that basic message that war is hell and nothing more."
    }
  ],
  "errorMessage": ""
}