{
  "imDbId": "tt0053125",
  "title": "North by Northwest",
  "fullTitle": "North by Northwest (1959)",
  "type": "Movie",
  "year": "1959",
  "items": [
    {
      "username": "nycritic",
      "userUrl": "https://www.imdb.com/user/ur0384847",
      "reviewLink": "https://www.imdb.com/review/rw1058631",
      "warningSpoilers": true,
      "date": "11 April 2005",
      "rate": "10",
      "helpful": "184 out of 221 found this helpful.",
      "title": "What an Action Thriller Should Be.",
      "content": "VERTIGO did nothing to advance Hitchcock's career in 1957 when he released it, and it's actually not a shame: the following year he decided to go completely against the slow-moving erotic thriller genre and do something shamelessly commercial, escapist and single-handedly create the spy movie. Ian Fleming, author of the James Bond novels, states he based his character on the physical characteristics and the suave personality of Cary Grant, as an added note. This could well amount to be the first James Bond film -- a dangerous villain complete with a sidekick, an alluring woman with a dubious nature and an enigmatic \"boss,\" a dashing hero, lush locales setting the scene for powerful chases and escalating danger.NORTH BY NORTHWEST has one crucial difference to any James Bond film, though: Alfred Hitchcock. While the Bond films have been seen as quintessential action fluff (although fluff of the better kind until the franchise ran out of gas in the 80s), Hitchcock, always the master of subtext as well as suspense, creates memorable scenes that balance sexual tension, sexual innuendo, comedy, and mounting suspense seamlessly. There is never the feeling of being bored as there is too much going on, especially with the sizzling chemistry of Eva Marie Saint and Cary Grant, by now a Hitchcock veteran. When they're on screen, dialog crackles and so much more is said with so little gesture -- she closes the lid on her Ice Goddess role, but gives it a nice, cheeky, knowing wink. He of course evolves from the sort of man who while looking and being slightly clumsy and under his mother's thumb -- once it becomes clear he's been marked and is a target for a sinister plot that only later becomes clear -- becomes more assertive in taking matters into his own hands. A quintessential Hitchcock Everyman, Grant has his stamp all over his role. No one can imagine anyone else running away from that crop duster in one of the movies many standout sequences, or saying the reassuring last words to Eva Marie Saint as they cuddle together in the train. When one thinks of NORTH BY NORTHWEST, one thinks Cary Grant.Easily one of Hitchcock's best films, made while he was at the peak of his career in the bracket formed with THE MAN WHO KNEW TOO MUCH and MARNIE. Great supporting performances are all over the map, from Jesse Royce Landis as Grant's mother, James Mason as Phillip Vandamm, Martin Landau as Vandamm's protégée who might be a little more than that, and Leo G Carroll as The Professor. Doreen Lang appears early in the movie as Grant's secretary; she would of course be remembered as the woman who shrieks at Tippi Hedren in THE BIRDS and gets slapped by her as the camera holds itself tight on her face."
    },
    {
      "username": "jotix100",
      "userUrl": "https://www.imdb.com/user/ur1406078",
      "reviewLink": "https://www.imdb.com/review/rw1204728",
      "warningSpoilers": false,
      "date": "30 October 2005",
      "rate": "10",
      "helpful": "80 out of 103 found this helpful.",
      "title": "Strangers on a train",
      "content": "Alfred Hitchcock's \"North by Northwest\" is one of the best films in his long and distinguished career. Part of the success of the movie lies in the screen play by Ernest Lehman, one of the best writers of that era. Also, the haunting music by Mr. Hitchcock's usual collaborator, Bernard Hermann, adds texture to what we are seeing. Together with all the above mentioned qualities, \"North by Northwest\" was photographed by Robert Burks and was edited by George Tomasini, both men did outstanding jobs to enhance a film that shows a mature and inspired Alfred Hitchcock.The film works because of the witty dialog Mr. Lehman wrote. This has to be one of the riskiest projects undertaken by Mr. Hitchcock because of the sexiness Eva Kendall exudes throughout the film and the repartee between her and Roger Thornhill. The film mixes adventure and romance that aren't put ons, as one feels what one's watching to be really happening.Much has been said in this forum as to the values of this classic, so we shall only add our pleasure in seeing this masterpiece any time it turns on cable. In fact, the film hasn't dated, the way some others of the same period have. The highlights of the film are the sequences involving the crop duster, the train ride to Chicago where Eve and Roger first meet, the auction, and the Mount Rushmore climax.This is one of the best contributions by Cary Grant to any of his work with the director. Roger Thornhill is one of the best roles Mr. Grant played, during his long career. His chemistry with Eva Marie Saint is perfect. This young actress added class and elegance to the picture. James Mason and Martin Landau played villains convincingly. Jesse Royce Landis, Leo G. Carroll, and the rest of the supporting cast is excellent.\"North by Northwest\" is one of Alfred Hitchcock's best crafted films thanks to the brilliant people that came together to work in it."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0068536",
      "warningSpoilers": false,
      "date": "27 July 2002",
      "rate": "",
      "helpful": "89 out of 119 found this helpful.",
      "title": "Classic thriller - I love it!",
      "content": "Roger Thornhill is an advertising man. However when he is kidnapped it is clear that he has been mistaken for someone else. When he tries to find out what's going he is framed for murder and sets out on a cross country run to survive. Along the way he meets danger, adventure and beauty in the shape of the mysterious Eve Kendall. However when he finds the truth he is drawn towards a final showdown with the dangerous Vandamm.Rightly regarded as a classic and can more than compete with today's thrillers that too often rely on special effects to make up for the lack of genuine suspense. Here the plot requires a great deal of faith, but it is brought off with such style and energy that it is totally absorbing. The action is great and the several main scenes have become part of popular culture and are regularly spoofed on TV etc. The romance works as well and Thornhill and Kendall exchange plenty of good scenes.The dialogue is great and the direction is faultless from Hitchcock. Many thrillers run over 2 hours - but only the good ones can stand up to repeated viewings. Northwest can take back to back viewings it is so good. The plot may have been put together as shooting went (as was the case with at leastone key scene) but it all stands together well. The acting is also perfect, Grant's rebirth as a thriller man is brilliant and is one of Hitchcock's best everyman characters. Marie-Saint is yet another dangerous blonde but is very good. James `The Voice' Mason is excellent, while Landau adds great homosexual subtext to his character. The ever present Leo G Carroll IS Mr Waverly but is still enjoyable and even support roles like Landis as Thornhill's mother is perfection!Over 40 years on this film has barely dated. Hearing the music is enough to make me want to see it again, while the direction, set pieces, dialogue and performances are all pitch perfect. A wonderful thriller for young and old - no sex, no swearing, all thrills."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2078368",
      "warningSpoilers": false,
      "date": "9 June 2009",
      "rate": "9",
      "helpful": "23 out of 29 found this helpful.",
      "title": "Enormously entertaining film from Alfred Hitchcock!",
      "content": "My favourite director, Alfred Hitchcock has directed many classics like Psycho, Rear Window and Vertigo, and I will say that this deserves to be up there among his best. I absolutely loved it! The best aspect of this movie is the always charming Cary Grant in a brooding and entertaining performance as Roger Thornhill, a man wanted for the murder of a diplomat. Solidly supporting him all the way are the lovely Eva Marie Saint as Eve Kendell and oily James Mason as the villainous Vandamme. They are further advantaged by some excellent camera-work and a wonderfully atmospheric music score. The script is focused and suspenseful, and Hitchcock's direction ensures the film rarely slips, even if some of the complicated plot does fly over people's heads. The climax though is simply the icing on the cake. Overall, a hugely enjoyable film, which I will give a 9.5/10. Bethany Cox"
    },
    {
      "username": "bsmith5552",
      "userUrl": "https://www.imdb.com/user/ur1019294",
      "reviewLink": "https://www.imdb.com/review/rw0068456",
      "warningSpoilers": false,
      "date": "20 October 2001",
      "rate": "9",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Superb Hitchcock Thriller!",
      "content": "\"North By Northwest\" is another of Alfred Hitchcock's thrillers where an ordinary man is put into an extraordinary situation. As in most of these movies, the hero has to quickly adapt to his situation or perish. This time it is Cary Grant who is thrust into a world of international intrigue when is mistaken by villain James Mason for an American operative named George Kaplan (the film's \"McGuffan\" by the way). Along the way he is seduced by Mason's mistress (Eva Marie Saint) while being pursued by Mason and his cronies from New York to Chicago to South Dakota and ultimately to Mount Rushmore for the film's climax. \"North By Northwest\" is full of classic Hitchcock moments. First,there is Grant's frustration and fear as he tries to explain to Mason that he is not the person they are seeking. Next, the scene in the cornfield where Grant is isolated and attacked by a plane is pure Hitchcock. Then we have the art auction where he cleverly escapes Mason's henchmen and finally, the finale at Mount Rushmore in a scene reminiscent of a similar one in \"Sabotage\" (1942) (which took place at the top of the Statue of Liberty). The cast, as in most Hitchcock films is excellent. Grant is understandably confused and frightened as the the hero, Eva Marie Saint has never been sexier as the femme fatale, James Mason is suave and sinister as the villain and Martin Landau in an early role, is good as Mason's chief henchman. Hitchcock regular Leo G. Carroll is cold heartedly sinister as the \"professor\". Jesse Royce Landis as Grant's mother (she was about Grant's real age) is wasted and unnecessary to the plot. The only problem that I have with this and other Hitchcock films is his over reliance on back projection and soundstage \"exteriors\". Other than that. \"North By Northwest\" has to be considered as one of Hitchcock's best. Watch for Hitchcock's hilarious cameo appearance at the end of the opening credits."
    },
    {
      "username": "Ben_Cheshire",
      "userUrl": "https://www.imdb.com/user/ur1148823",
      "reviewLink": "https://www.imdb.com/review/rw0068652",
      "warningSpoilers": false,
      "date": "24 July 2004",
      "rate": "8",
      "helpful": "196 out of 272 found this helpful.",
      "title": "I finally get how great it is: Hitch infuses his wrong-man caper with ironic movie language and reality-be-damned escapism and suspense.",
      "content": "Its Hitch's most briskly entertaining movie, and one of his most comic, adventure-caper type movies, largely thanks to the persona of Cary Grant. But its also one of his most suspenseful - in the fact that Grant is being recognised as someone else, and that he may be put in jail for someone else's crime.I've finally come to realise just how great North by Northwest is. The reason you should love Hitchcock is he put entertainment upfront. Hitchcock was not interested in whether this or that would happen in real life: he was interested in what would make the most entertaining scene for the movie. North by Northwest is a peak in this regard. The dialogue and situations intentionally throw reality to the wind - the double-entendre dialogue in the love scenes is not supposed to be the way people talk!If you said to Hitchcock \"as if he'd keep driving\" or \"as if she'd do that\" - he would just laugh at you and say you've missed the point. This is 100% movieland, and once you get used to the fact, and that this is not a fault in the film, but done intentionally, you'll love it. Its expressionistic - everything happens in movie language: the people laughing at Grant in the elevator, the way he keeps driving drunk near the beginning, the way he grabs the knife and everyone stares at him after someone's been stabbed.It flirts with the idea of identity. I thought it was interesting how Grant first is dismissing, then incredulous that people should be calling him by another name; then, as the tries to find out who this guy is, he enters the hotel room of this new identity, then he puts the suit on, and finally he identifies himself as George Kaplan.A succession of fantastic, memorable scenes, a great leading man in Grant, and one of Hermann's essential Hitch scores make for a movie i can put on at any time.10/10"
    },
    {
      "username": "DrLenera",
      "userUrl": "https://www.imdb.com/user/ur2666204",
      "reviewLink": "https://www.imdb.com/review/rw0939668",
      "warningSpoilers": false,
      "date": "30 September 2004",
      "rate": "",
      "helpful": "148 out of 195 found this helpful.",
      "title": "Wonderful comedy thriller, not Hitchcock's best but his most sheerly enjoyable",
      "content": "North By Northwest is not an artistic masterpiece like Rear Window and Vertigo, but it is probably the most purely entertaining picture Hitchcock ever made. It's essentially a rehash of many of his earlier films, with a plot partially derived from The Thirty Nine Steps and the very similar Saboteur, while there are borrowings from Foreign Correspondent and Notorious, among others. However, it is all done with such style and confidence that it doesn't matter if it's essentially just a greatest hits package.Very few other films of this kind attain the near perfect tone of this one, precariously balanced between seriousness and silliness. Sometimes this film manages the very difficult trick of being both suspenseful and comical at the same time, as in the auction house scene, or the wonderful scene in the lift when the hero's mother turns to two heavies in a lift looking menacingly at the hero and says \"you gentlemen are not REALLY trying to kill my son, are you?\".Of course the famous crop dusting plane scene and the Mount Rushmore chase are terrific. The former is really more notable for the amount of time taken to build up to the action than the action itself, while the technical work on the latter still looks pretty good. In a totally different vein is the astonishingly frank seduction sequence on the train. Hitchcock takes his time here as with many of the other scenes, but the film is so crammed with memorable passages that one hardly notices it's 136 mins long.Ernest Lehman's script is full of wonderful lines, many of them delivered so well by chief villain James Mason that at times we almost want to root for him. \"Has any one ever told you tend to overplay your various roles Mr Kaplan....it seems to me you fellows could stand a little less training from the FBI and a little more from the Actor's Studio\". Cary Grant is so smooth one almost forgets he's over 50, and of course there's also Bernard Herrmann's vibrant score.Endlessly enjoyable even with repeated viewings. How many of today's thrillers will be such fun in 25 years time?"
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw2006354",
      "warningSpoilers": false,
      "date": "12 January 2009",
      "rate": "8",
      "helpful": "44 out of 60 found this helpful.",
      "title": "\"That wasn't very sporting, using real bullets.\"",
      "content": "Cary Grant handles the twisted expressions of his face, his astonished look, his impulsive smile with professional self-assurance and charm while taking us right in the middle of confusion on a breathless 2000-mile cross-country chase which has its gripping showdown across the giant faces of the presidents sculptured on Mount Rushmore high above Rapid City, South Dakota Grant plays Roger Thornhill, a stylish publicist, mistaken for a fictitious Federal agent, plunged into a world of crime and intrigue, hunted down by villains who want to eliminate him because he seems to be on their dishonest dealings When questioned by bland Phillip Vandamm (James Mason), Thornhill is unable to convince him that he is a victim of a mistaken identity His three thugs fill him with bourbon, and place him in a stolen car expecting him to have a drunken accident After narrowly escaping death, no one believes his story including, obviously, his skeptical mother (Jessie Royce Landis).In an effort to discover the agent he is being confused with, and using the clues he collected, Thornhill returns to the United Nations Headquarter looking for George Kaplan There, somebody falls into his arms and unthinkingly, Thornhill draws the blade out of the victim's back and is photographed holding the weapon in mid-air And thus became a fugitive from justice, pursued by the cops and had to skip by boarding a train to Chicago While on the run, he is caught by a provocative platinum blonde (Eva Marie Saint), who comes out as a glamorous woman and a delightful charmer James Mason, a polished mastermind spy showed too well to be threatening... His menacing henchman, Martin Landau is also convincingly hurtful...In his fifth Hitchcock picture, Leo G. Carroll is suave and calm as the devoted intelligence chief Directed by a genius behind the camera, \"North By Northwest\" remains a genuinely exciting film for the dangerous world of spies and counterspies"
    },
    {
      "username": "JSanicki",
      "userUrl": "https://www.imdb.com/user/ur2205226",
      "reviewLink": "https://www.imdb.com/review/rw0068604",
      "warningSpoilers": false,
      "date": "3 March 2003",
      "rate": "",
      "helpful": "196 out of 247 found this helpful.",
      "title": "A perfect film for a rainy, cold October day",
      "content": "I saw this film for the first time when I was a freshman in college as part of an english class I took entitled \"writing and the movies\". Little did I realize that I would be seeing a film that would stay with me to this day and in essence become one of my all time favorites. Then, a few years ago, I caught it on the big screen at the Fine Arts theater in downtown Chicago. I remember that it was a rainy, cold October day. Perfect weather for a Hitchcock film I thought to myself.For me, half of the fun of North by Northwest is its incredible story. This film has something for everyone within it: a little comedy, a little romance, great snappy dialogue and more action than any Bruce Willis Die Hard film combined. Hitchcock was a master at this and in North by Northwest he lets his genius shine through totally. It seems to me that whenever I watch it, everyone who made this film from Cary Grant on down had nothing but sheer fun making it. Perhaps my two favorite scenes are the infamous \"crop-duster\" sequence and the last twenty minutes or so at Mount Rushmore. I must give special mention to Ernest Lehman who yet again managed to write a screenplay that totally knocks your socks off. How he came up with the idea, I've not a clue, but what an idea it is. The screenplay itself was nominated for an Academy Award that year, but lost to Pillow Talk. North by Northwest was also nominated for Best Set Decoration and Best Film Editing, but lost to Ben-Hur in both categories.All in all, what a film. If you haven't seein it, do so ASAP. North by Northwest just reinforces my belief that Alfred Hitchcock was one of the greatest directors of all time. Period.My rating: 4 stars"
    },
    {
      "username": "slokes",
      "userUrl": "https://www.imdb.com/user/ur2375356",
      "reviewLink": "https://www.imdb.com/review/rw0068630",
      "warningSpoilers": true,
      "date": "10 November 2003",
      "rate": "8",
      "helpful": "114 out of 170 found this helpful.",
      "title": "Smoke and mirrors, without apologies",
      "content": "The one famous gaffe people point out in this film is when a small boy can be seen plugging his ears just before Eva Marie Saint brings her café conversation with Cary Grant to a sudden end. Another gaffe, just as egregious and apparent but not nearly as commented on, is when Cary and Eva, clutching an incriminating statute, are rock-climbing around a quartet of famous presidential heads until a bad guy suddenly appears and leaps upon him. Whereupon the surprised, backward-falling Cary has the presence of mind to hand the statute to Eva, who takes his from him whilst in mid-scream. Do me a favor and read that last sentence again. What director today would allow such a scene past the editing room?But it just doesn't matter: IMDB voters at this writing have placed the 44-year-old `North By Northwest' ahead of all but 18 movies ever made, including 14 which have nothing to do with Frodo Baggins or Darth Vader. That's pretty damn impressive. What the hell were they thinking? The only Hitchcock movie they rate higher is \"Rear Window;\" I can think of at least seven or eight Hitchcocks I'd rank over \"North By Northwest.\" [None of them are \"Rear Window.\"]The truth is this film is so popular because it is so good. Not great, but very, very good, in a way that anticipates a lot of the direction of mass entertainment to come and thus speaks to people in a way `Vertigo' or `Strangers On A Train' do not. People talk about how forward thinking \"Psycho\" is, and it is, but more directors took note of the just-as-clever-but-more-mainstream approach of \"North By Northwest.\" The last four decade have been chock full of flicks serving up suspense, sex, changing locales, and plot twists that play with viewers' expectations, all the while keeping the laughs coming. It's not like \"North By Northwest\" invented this formula, but it perfected and distilled it into an essence that is imitated, with varying success, to this day.Cary Grant plays slick adman Roger Thornhill, who gets mistaken for a fugitive named Kaplan and finds himself on the run from a slew of bad guys, led by James Mason at his smug and oily peak as Vandamme. Martin Landau makes his first memorable appearance as Mason's nastiest henchman Leonard (1959 was good to him, as \"Plan Nine From Outer Space\" premiered that year as well), suspicious, ruthless, and probably gay. Not that there's anything wrong with that, but it was 1959 and that was a little daring.Daring also is Eva Marie Saint's Eve Kendall, a woman who uses sex, as Thornhill puts it, \"the way some people use a flyswatter.\" Her repartee with Thornhill shows just how erotic two people just talking to each other can be. It also provides further evidence Hitchcock's writers didn't go out on many dates. (Kendall: \"I'm a big girl.\" Thornhill: \"Yeah, and in all the right places.\" And she KISSES him for it!)The film does chug slowly at the outset, building suspense but also bugging you a bit as the plot gears grind while Thornhill is being pushed through his early paces, right until his moment at the UN. About the time we find ourselves with Thornhill in the cornfield, the picture starts to pick up a serious head of steam, and never loses it all the way to the final, famous tunnel shot. Actually, I like the penultimate scene between Grant and Saint, an elegant and witty way of resolving that most tried-and-true device, the cliffhanger.As with most of Hitchcock's 50s fare, elegance is behind much of what makes this movie so great. `North By Northwest' manifests an elegance in dress, decor, language, music, and lighting that represents the best of its era while giving the picture a timeless character all the same. Hitchcock's camera movements are very subtle yet brilliant, as during Mason's entrance and Grant's hide-and-seek game around the train. Everyone has perfect hair, lounges about in gowns and jackets, and you never think it should be otherwise.Grant isn't my favorite actor, but he's smooth enough for the central role when he's not doing that bad Foster Brooks impression behind the wheel of the car. [I docked the movie one point just for that.] His best scene may be at the auction, though he projects real fear in the cornfield. Saint is simply splendid, nailing every line as she walks a tightrope and plays her character's motives close to her décolletage. Hitchcock seemed to lose his ability to direct female actors, and not merely bask in them, with the advent of color, but Saint is one blonde bombshell that gives us a sense of brains and personality behind her mystery.There's logic gaps in this movie, and bad process shots, but it's an amazing ride all the same, more amazing because it's done with smoke and mirrors and without apologies. You ask the questions and figure out the loopholes only after you walk away, because the movie doesn't let you up much while you are watching it. Hitchcock made other, more challenging movies that attested to his rare vision as an artist, but this is maybe his purest exercise in the craft of good filmmaking. That's why `North By Northwest' has remained so high in people's estimations. Whatever the errors, it's hard not feeling good about that."
    },
    {
      "username": "DarthBill",
      "userUrl": "https://www.imdb.com/user/ur2293681",
      "reviewLink": "https://www.imdb.com/review/rw0068644",
      "warningSpoilers": true,
      "date": "4 April 2004",
      "rate": "",
      "helpful": "98 out of 143 found this helpful.",
      "title": "Worth it just to see the the crop duster chase",
      "content": "I can't quite understand how anyone can dislike Alfred Hitchcock's films. Personally, he's one of the few old school talents I find interesting and watchable, even if his work is dated and set in its era (the era when most sets were hopelessly phony). I guess you have to appreciate his themes - dysfunctional relationships between a man and his mother, flawed by essentially innocent men caught up in a web of intrigue, beautiful blonds, comments of authority figures, black humor, etc - to really appreciate Hitchcock.Interestingly, James Stewart was Hitchcock's original choice for the role of Roger Thornhill, the hapless ad man who is mistaken for a spy who doesn't even exist to begin with and is chased half way across the country by villains and authorities for a murder he didn't commit. For one reason or another, Stewart was unavailable and the part went to Cary Grant instead. Grant seems better suited to the character and the situation than Stewart would have been, but I can easily picture Stewart being chased in the cornfield by the crop duster.Like all Hitchcock films, there are hundreds of things that aren't realistic though set in the real world and lots of highly improbable stuff going on everywhere, but if you give it a chance you'll enjoy it and won't care. Don't miss Eva Marie Saint having to dub over a then lewd line about love, a full stomach and sex. The use of a crop duster may not be the most practical way to kill a man, but it's a great visual representation of the great Hitchcockian examination of \"nowhere to run, nowhere to hide\". The music and clinging to Mount Rushmore is also memorable. Did I mention the innuendo?"
    },
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0068454",
      "warningSpoilers": false,
      "date": "21 September 2001",
      "rate": "",
      "helpful": "45 out of 67 found this helpful.",
      "title": "Terrific Entertainment From the Master",
      "content": "With everything you expect from Hitchcock and more, \"North By Northwest\" is terrific entertainment from the master. There are interesting characters, an exciting story with intrigue and suspense, lots of fine photography, and some of Hitchcock's best-known set pieces. It's capped off by a fine Bernard Herrmann score that is almost as good as the one he wrote later for \"Psycho\".Cary Grant may be the ideal Hitchcock actor, and he is a big part of making this such great fun. As one of the man-on-the-run characters that Hitchcock loved to make movies about, Grant is entertaining and believable, maintaining good humor even as he tries to work his way out of a series of desperate situations. The other stars, James Mason and Eva Marie Saint, also are very good, and the supporting roles are all filled by good character actors.The story is one of Hitchcock's most exciting. It's slightly longer than usual, and it occasionally stretches credibility, but it all goes by quickly because there is always something interesting going on, and there is also plenty to look at. Whether using the famous landmarks or using more everyday settings, there is always lots of good detail, and the settings complement the story nicely. At times the plot becomes somewhat fanciful, but probably deliberately so, for it only emphasizes Hitchcock's mastery of technique that he can have his characters do almost anything and make you believe it at the time.With everything that characterizes Hitchcock at his very best, this fully deserves its reputation as one of the finest films by him or any other director. You can watch it several times and still find it just as entertaining."
    },
    {
      "username": "movieman9",
      "userUrl": "https://www.imdb.com/user/ur0012098",
      "reviewLink": "https://www.imdb.com/review/rw0068554",
      "warningSpoilers": false,
      "date": "25 December 2000",
      "rate": "10",
      "helpful": "212 out of 282 found this helpful.",
      "title": "Top-notch suspense /adventure film still looks great after 40 years!",
      "content": "For Christmas this year, I received my first to-own DVD: Hitchcock's classic, NORTH BY NORTHWEST. After over 40 years, this rip-racing adventure-thriller still packs a punch and looks great on widescreen. This movie came along during a renaissance period for the Old Master, between masterpieces like VERTIGO and PSYCHO, but this excursion into the world of suspense is so different from anything else Hitchcock had created up to that point. Never did he challenge our endurance to keep still in our seats for such a long period of time, and yet the film's 135 minutes go by so fast it could only be explained by movie magic itself.Cary Grant is one of those actors that a filmgoer either falls in love with or deeply envies. His debonair manner is displayed to the full in this film, even though the peril that his character goes through would cause any normal dude to break into a maddening sweat. The dialogue Roger Thornhill delivers alongside Eve Kendall (Eva Marie Saint) in this film is sometimes too hilarious to be true, but wouldn't any woman fall for it? (I'm merely guessing here) Ernest Lehman's screenplay is so lighthearted and yet very ominous. With all the traps and pitfalls Grant goes through in this film, you would have to find comedy in it. Grant does and to great appeal. I absolutely love the sequence at the auction when Roger tries to get himself arrested by yelling out flaky bids and accusing the auctioneer of selling junk worth no more than $8. I also admire the scenes with Saint on the train to Chicago; I was tempted to jot down some of his pick-up lines, but then I realized it's just a movie (or is it?)Hitchcock was famous throughout his career of setting up death-defying sequences with major landmarks as backdrops. Here, Mount Rushmore will never be looked at the same again afterwards. We may never enter the United Nations again without peering behind our backs for a notorious knife-thrower. And, I dare say, I will never walk alongside a highway where a cropduster could swoop at any minute. I love the line during the Rushmore incident when Grant says his two ex-wives left him because he lived too dull a life. Go figure!It has been said that Hitchcock's many films each contain a personal side of the director inside them. The archetypes of the Master of Suspense are here amid the chasing and running across the U.S. The mysterious blonde, played to a tee by Eva Marie Saint, is a common fixture of many Hitchcock jaunts. Saint joins Grace Kelly and Tippi Hedren in this feature. The protagonist is again awkward when faced with the opposite sex, but unusually casual when wrapped up in danger. The hero has an attachment to his mother, continually under his nurturing wing. And of course, the macguffin has fun with us again (government secrets my foot!)Whenever I see action-packed epics today like \"The Fugitive\" or the James Bond series, they all seem to quiver in comparison to this film. It amazes me that Hitchcock is able to hold the audience in the palm of his hand throughout the whole length of the journey. We become Grant as he runs away from the police and the secret agents who have chosen him as their dupe. But throughout the squabble, we sense that Grant is getting off on the whole jaunt, just as we want the chase to continue, not looking at our watches for a minute. However, it's fascinating to note that Roger Thornhill is not a born adventurer, nor is he an archeologist with a flair for escaping impossible situations. We are experiencing the Cary Grant in all of us, running away from an enemy we do not know they are or what they want. Is this symbolism of some kind? I say who cares; just watch the film and have fun!"
    },
    {
      "username": "artoffilmorg",
      "userUrl": "https://www.imdb.com/user/ur69035611",
      "reviewLink": "https://www.imdb.com/review/rw4133514",
      "warningSpoilers": false,
      "date": "18 April 2018",
      "rate": "9",
      "helpful": "80 out of 88 found this helpful.",
      "title": "North by Northwest and then some",
      "content": "Hitchcock at his sharpest. Art and commerce in a delicious salad with all the right ingredients. A brisk screenplay by Ernest Lehman a Cary Grant that is just pure delight, Eva Marie Saint fresh out of her Oscar from \"On the Waterfront\" is an icy blonde with a brain. James Mason, the ultimate foreign sinister not to mention Jessie Royce Landis and Hitchcock brings Bernard Herrmann to wrap it all up in one of the most infectious scores imaginable. A real treat."
    },
    {
      "username": "barnabyrudge",
      "userUrl": "https://www.imdb.com/user/ur1609501",
      "reviewLink": "https://www.imdb.com/review/rw0068602",
      "warningSpoilers": false,
      "date": "15 January 2003",
      "rate": "",
      "helpful": "5 out of 5 found this helpful.",
      "title": "One of my absolute favourites!",
      "content": "North by Northwest will need no introduction to most movie-goers. It's a classic, greatly admired by audiences and critics alike. The story about a befuddled ad-executive fleeing from spies and the police (the spies want him dead because he knows of their plot, the police want him captured because they think he's behind a murder) is done at a breakneck pace and deals with Hitchcock's most frequently used theme: an innocent man on the run.Cary Grant is urbane and smooth as the hero. James Mason oozes silky menace as the principal villain (Martin Landau also plays a villain, giving his character a seriously nasty toughness). Eva Marie Saint is simply fabulous as the woman whose loyalties seems torn between good and bad.The set pieces are rightly considered to be moments of cinematic genius. Grant's escape from a crop-duster; the fight atop Mount Rushmore; the auction house bluff; the drunken car journey; the murder at the UN building.... each scene is brilliantly devised by script writer Ernest Lehmann and just as brilliantly filmed by director Hitchcock. Everyone should see this movie... it's a masterpiece."
    },
    {
      "username": "ags123",
      "userUrl": "https://www.imdb.com/user/ur0667846",
      "reviewLink": "https://www.imdb.com/review/rw1862557",
      "warningSpoilers": false,
      "date": "23 April 2008",
      "rate": "10",
      "helpful": "16 out of 19 found this helpful.",
      "title": "A towering achievement.",
      "content": "This is Hitchcock's best film  quite an accomplishment, considering how many great films he created. And after half a century, \"North By Northwest\" holds up beautifully. This film has it all: suspense, glamour, humor, and images that capture the imagination and remain etched in memory. The legendary crop-dusting sequence alone is a master class in the art of pure cinema. Like the rest of the film, it's brilliantly conceived and brilliantly executed. All the elements come together to produce the finest form of entertainment. Bernard Herrmann's frantic fandango captures the complexity and pace of the action. Ernest Lehman's script is full of sophisticated dialogue. Performances are spot on. Has Cary Grant ever been more engaging? Is James Mason the ultimate in charming villains? And Eva Marie Saint's allure is multi-faceted. Movies just don't get better than this."
    },
    {
      "username": "tonypeacock-1",
      "userUrl": "https://www.imdb.com/user/ur5153981",
      "reviewLink": "https://www.imdb.com/review/rw5691920",
      "warningSpoilers": true,
      "date": "30 April 2020",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Hitchcock can do action!",
      "content": "Excellent Alfred Hitchcock film that really is ahead of its time. I say that in several respects which I will allude to.The film from 1959 is about an innocent man (Cary Grant as Roger Thornhill). Thornhill gets mistaken for a U.S. secret agent in a chase across the country that involves scenes of death, amazing action sequences of suspense and the love of an attractive female. I've heard of Cary Grant of course but I admit to never seeing any of his many films. He immediately reminded me of Sir. Roger Moore with his suave demeanour, one liners whilst under pressure and getting the girl.Hitchcock films are of course well known for their technical wizardry. North By Northwest doesn't disappoint in this respect. Simple scenes of cars and the interior of train carriages filmed in the studio look realistic long before CGI ever existed.The film has several dramatic action sequences that wouldn't have looked out of place in a modern spy film. I'm thinking of a chase sequence whilst being followed by an overhead crop duster and scenes in Mount Rushmore. The film has comedic moments intertwined with scenes of murder.Look out for Thornhill acting the fool at an auction. I never expected to be as entertained by such an old film."
    },
    {
      "username": "dtb",
      "userUrl": "https://www.imdb.com/user/ur0292400",
      "reviewLink": "https://www.imdb.com/review/rw0068640",
      "warningSpoilers": false,
      "date": "7 February 2004",
      "rate": "10",
      "helpful": "54 out of 77 found this helpful.",
      "title": "From The Master of Suspense Came the Daddy of the Modern Adventure Thrillers",
      "content": "Many feel this is Alfred Hitchcock's greatest American movie, and I agree! NORTH BY NORTHWEST is the Hitchcock film to end all Hitch films, with all his pet themes covered with maximum wit, panache, and suspense, as well as a romance between Cary Grant and a soignée Eva Marie Saint that's as tender as it is sexy. Grant has never been more engaging and dashing (literally and figuratively :-), though the smoothly villainous James Mason nearly out-suaves him. My husband and I have joked that if Mason had played Thornhill, the film would have been over in mere moments. With all due respect to Grant, if the imperious, unshakably confident Mason asked the Glen Cove police, \"Do you honestly believe that this happened the way you think it did?\" they would immediately reply, \"No, sir, you must be right, you're free to go, sorry we bothered you.\" :-) Also boasts a great early performance by a reptilian young Martin Landau as Mason's possessive henchman, as well as one of Oscar nominee Ernest Lehman's best screenplays (in fact, he borrowed liberally from it for his script for the film version of THE PRIZE starring Paul Newman) and one of Bernard Herrmann's finest scores. Anybody who wants to write or direct a chase thriller should watch NORTH BY NORTHWEST first to see how it's done!"
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8754856",
      "warningSpoilers": false,
      "date": "24 December 2022",
      "rate": "9",
      "helpful": "5 out of 6 found this helpful.",
      "title": "A Hitchcock classic.",
      "content": "A case of mistaken identity for Roger Thornhill, sees him picked up by a dangerous, powerful villain, and later falsely accused of murder.Some films and shows age badly, for all sorts of reasons, plot, acting, production values, not far of seventy years old, Hitchcock's masterpiece North by Northwest holds up as a true classic.It will looks remarkably stylish, features a superb central acting performance, and boasts a plot most writers only dream of creating. Full of twists and turns, Hitchcock spins a terrific web.It's not serious the whole way through, indeed there are a few lighter moments, I particularly loved the scene in the auction room, the look on the auctioneer's face throughout, brilliant.Cary Grant is simply oozing with charisma, loaded with style, he offers real Hollywood Star quality, James Mason and Eva Marie Saint are equally brilliant.A tremendous watch, 9/10."
    },
    {
      "username": "johnny-08",
      "userUrl": "https://www.imdb.com/user/ur14795108",
      "reviewLink": "https://www.imdb.com/review/rw1883530",
      "warningSpoilers": false,
      "date": "30 May 2008",
      "rate": "8",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Great script and Hitchcock's genius direction makes this film interesting even today",
      "content": "Today, when technology is getting advanced by every new day, movie scenes like the one on Mount Rushmore in \"North by Northwest\" looks very funny, but I must admit that this movie is great even from todays perception. One of Alfred Hitchcock's best movies has his favorite actor Cary Grant in it, blonde girl Eva Marie Saint and excellent actors like James Mason & Martin Landau. So to say long story short; I enjoyed in this movie and I'm 'only' 19 years old (this movie was made almost 50 years ago!!!). Why? Because of great scenes coming from genius Alfred Hitchcock, brilliant script that makes this movie a great thriller, with twists, good performances and some comedic parts (coming from Cary Grant and Jessie Royce Landis). So if you have opportunity, watch this movie cause it's a classic."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw2949825",
      "warningSpoilers": false,
      "date": "27 January 2014",
      "rate": "8",
      "helpful": "10 out of 15 found this helpful.",
      "title": "Alfred Hitchcock top-notch thriller/comedy embroils a a business man in killing and espionage",
      "content": "Thrilling flick with funny moments , nice acting , spectacular outdoors and fun dialogue . The tale is ordinary Hitchcock fare that plays and preys the senses , as a hapless New York advertising executive , Roger Thornhill, (Gary Grant got $450,000 -a substantial amount for the time - plus a percentage of the gross profits ; though Yul Brynner and William Holden was suggested to play him) is mistaken for a government agent by a group of foreign spies (James Mason , Martin Landau) and is pursued across the country while he looks for a way to survive . Grant is chased by both : the patrolmen who think he's a killer and a spy ring who think he is a double agent . He is helped by a gorgeous train passenger named Eve Kendall (Eva Marie Saint , though the studio wanted Cyd Charisse or Sophia Loren for the female lead, and she wanted to do it, but contractual problems resulted in her having to turn it down for the part , but Hitchcock insisted upon Eva Marie Saint) .Enjoyable mystery movie involves a bewildered ad-man who hold numerous tricks in order to escape from his captors and being chased cross country . Entertaining suspense movie packs humor , intrigue and ordinary Hitch touches . This agreeable and often hilarious picture from master of suspense has a memorable scene after another and was the only film Alfred Hitchcock made for MGM . Alfred Hitchcock's films have become famous for a number of elements and iconography : vertiginous height , innocent men wrongfully accused , blonde bombshells , voyeurism, long non-dialogue sequences , a matter of mistaken identity etc. This film has these particularities ; furthermore contains a fun intrigue , amusing situations and keeps the action at feverish pitch . Hitch was famous for making his actors follow the script to the word, and in this movie the characters use their dialogue taken from an interesting as well as fun screenplay by Ernest Lehman . Alfred Hitchcock's movies were known for featuring famous landmarks such as Golden Gate Bridge and San Francisco convent in ¨Vertigo¨ and the Statue of Liberty in ¨Sabotage¨ . Here includes Mount Rushmore images and now-legendary scenes such as crop-dusting plane sequences and the train station scene that was shot in New York City's Grand Central Terminal .Alfred Hitchcock couldn't get permission to film inside the UN, so footage was made of the interior of the building using a hidden camera, and the rooms were later recreated on a soundstage . Very good support cast such as James Mason , Martin Landau , Josephine Hutchinson , Les Tremayne as auctioneer and Jessie Royce Landis as mummy , though she was only 7 years older than Cary Grant, who plays her son . Features two actors who would go on to head spy agencies in their own 1960s television series. Edward Platt would star as \"Chief\" in ¨Get Smart¨, and Leo G. Carroll would star in ¨The man from U.N.C.L.E . And of course , Alfred Hitchcock cameo , he arrives at a bus stop during the opening credits but gets there a second too late and the door is closed in his face , he misses the bus. Colorful and glimmer cinematography in Vistavision by Robert Burks , Alfred's ordinary cameraman , showing nice outdoors . Rousing score by Bernard Herrmann , he arranged his whimsical themes from Fandango music. Bernard and Hitch had a long as well as fruitful professional relationship . Rating : 8.5/10 . Essential and indispensable seeing , being perfectly directed by the master himself . Worthwhile watching , one of all-time amusement . Ranked #7 on the American Film Institute's list of the 10 greatest films in the genre \"Mystery\""
    },
    {
      "username": "dweck",
      "userUrl": "https://www.imdb.com/user/ur0174106",
      "reviewLink": "https://www.imdb.com/review/rw0068561",
      "warningSpoilers": true,
      "date": "9 December 1998",
      "rate": "",
      "helpful": "62 out of 85 found this helpful.",
      "title": "My Favorite Hitch",
      "content": "\"North by Northwest\" is my favorite of all Hitchcock films (a close shave with \"Rear Window\"), and it permanently occupies a slot in my Personal Top Ten Films of All Time.Grant is terrific--funny, sexy, angry, confused, exhausted, redeemed. It is a full-bodied performance. And speaking of bodies--Eva Marie Saint is *definitely* an asset here, not just for her looks (there's that cool, blond Hitch femme fatale again) but for showing off her acting chops as well.James Mason is a consumate actor, and Hitch gives him a vehicle to enter one of his finest performances. Martin Landau, too, is appropriately chilling.Favorite scenes? The crop-dusting sequence is certainly a classic. But I love the scenes with Roger and his mother, dickering over his \"drunkenness.\" And the auction is Hitch in his element: the scene plays tense and terse but also funny.I can quibble with this film: The blue-screening looks a bit cheesy nowadays. And the movie opens with a huge plot hole (when the page is searching for George Kaplan and Thornhill grabs his ear for a quick question, Mason et.al. believe Thornhill to be their man, setting off the entire plot. However, shouldn't the page have continued searching the room, calling for Mr. Kaplan? And shouldn't the villains have heard him continue to page, knowing that Thornhill wasn't who they assumed he was? Ahh, but that would blow the whole movie!).This film also contains the best \"naughty joke\" Hitchcock ever devised. The final sequence is Eva Marie Saint and Grant pulling each other into bed. The jump cut is to a train entering a tunnel. You figure it out."
    },
    {
      "username": "randalgraves-26599",
      "userUrl": "https://www.imdb.com/user/ur126945893",
      "reviewLink": "https://www.imdb.com/review/rw6353666",
      "warningSpoilers": false,
      "date": "10 December 2020",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Hitchcock best movie",
      "content": "One of the impressive movies ever made. This film is years ahead in hits film making."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1336901",
      "warningSpoilers": false,
      "date": "9 April 2006",
      "rate": "6",
      "helpful": "44 out of 91 found this helpful.",
      "title": "Okay....But It Seemed A Lot Better When I Was A Kid",
      "content": "When I started collecting videos in earnest (by the thousands), I was excited to get this film. I had such fond remembrances of seeing it on the big screen when I was young teen. I remember being terrified when Cary Grant was being chased by the crop duster and then awed at the end with the climactic scene on Mount Rushmore. I saw it maybe a decade or so later on television and enjoyed it again.Well, seeing the film again five years ago on DVD as a 50-something-year-old turned out to be a major disappointment, mainly because the first hour was so boring. The beginning had scenes that looked too dated and worse, were drawn out too long, such as Grant's drunk scene and the romance between he and Eva Marie Saint.Once Grant goes on the run, the story improves noticeably and mixing in some comedy with the drama was a good move. From that point, it's still the fun film I had remembered but, overall, didn't have the suspense anymore and, to this day, I believe is an overrated Alfred Hitchcock film. The more I see of Hitch's old films, the more disappointed I am, with the exception of Psycho and Rear Window."
    },
    {
      "username": "Hey_Sweden",
      "userUrl": "https://www.imdb.com/user/ur28159509",
      "reviewLink": "https://www.imdb.com/review/rw5905328",
      "warningSpoilers": false,
      "date": "14 July 2020",
      "rate": "9",
      "helpful": "4 out of 5 found this helpful.",
      "title": "\"I don't like the way Teddy Roosevelt's looking at me.\"",
      "content": "Top entertainment from the Master of Suspense, \"North by Northwest\" is one of Hitchs' finest thrillers. Cary Grant, in his final collaboration with Hitch, is aces as a Madison Avenue adman who, by sheer chance, is mistaken as a spy by nefarious types including a debonair James Mason and a creepy Martin Landau. He's also framed for murder, and therefore pursued by the cops, while trying to locate the elusive \"George Kaplan\" who can supposedly help extricate him from the mess. Grant also finds the time to fall in love with a classic elegant blonde Hitchcock leading lady in the form of Eva Marie Saint.Hitch was truly firing on all cylinders here. Assisted by another great score by Bernard Herrmann, his picture begins with typically stylish Saul Bass opening credits. The enticing script is by Ernest Lehman, and for once, it's the kind of scenario where things add up by the time the story finishes. Hitch wastes no time getting the story underway, with a standard little cameo by himself after the opening credits have concluded.Even at two hours and 17 minutes, \"North by Northwest\" never feels as long as it is, due to masterful filmmaking and that twist-laden story. It has the appeal of a scenario wherein an ordinary type of guy ends up way over his head in intrigue. Grant is often scrambling for his life, whether he's pursued by a plane \"crop dusting\", or hanging on by his fingernails from the faces of Mount Rushmore (two very iconic sequences).The cast is wonderful all the way down the line: Mason, Landau, Jessie Royce Landis (playing Grants' mother, despite being just a few years older than him), Leo G. Carroll, Adam Williams, Robert Ellenstein, Edward Platt, Edward Binns, etc. That great English character actor Carroll is a delight as the savvy \"Professor\" who will ultimately have to give Grant some pretty potent exposition. Grant is lots of fun, and Lehman gives him some pretty funny dialogue to savour. Grant also has fine chemistry with Saint, who does come off as aloof at first, but whose stiff-lipped exterior slowly eases.\"North by Northwest\" is a tremendous diversion that continues to hold up well, 61 years later. It caps off the great run that Hitch had during the 1950s, with The Master choosing to follow it with one of his most enduring experiments, the legendary \"Psycho\".Nine out of 10."
    }
  ],
  "errorMessage": ""
}