{
  "imDbId": "tt0053125",
  "title": "North by Northwest",
  "fullTitle": "North by Northwest (1959)",
  "type": "Movie",
  "year": "1959",
  "language": "en",
  "titleInLanguage": "North by Northwest",
  "url": "https://en.wikipedia.org/wiki/North_by_Northwest",
  "plotShort": {
    "plainText": "North by Northwest is a 1959 American spy thriller film, produced and directed by Alfred Hitchcock and starring Cary Grant, Eva Marie Saint and James Mason. The screenplay was by Ernest Lehman, who wanted to write \"the Hitchcock picture to end all Hitchcock pictures\".\r\nNorth by Northwest is a tale of mistaken identity, with an innocent man pursued across the United States by agents of a mysterious organization trying to prevent him from blocking their plan to smuggle microfilm, which contains government secrets, out of the country. This is one of several Hitchcock films that feature a music score by Bernard Herrmann and an opening title sequence by graphic designer Saul Bass, and was the first to feature extended use of kinetic typography in its opening credits.\r\nNorth by Northwest is listed among the canonical Hitchcock films of the 1950s and is often listed among the greatest films of all time. It was selected in 1995 for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". After its first screening, reviewers for The New Yorker and The New York Times immediately hailed it as a masterpiece of comedic, sophisticated self-parody.",
    "html": "<p>North by Northwest is a 1959 American spy thriller film, produced and directed by Alfred Hitchcock and starring Cary Grant, Eva Marie Saint and James Mason. The screenplay was by Ernest Lehman, who wanted to write \"the Hitchcock picture to end all Hitchcock pictures\".</p><p>North by Northwest is a tale of mistaken identity, with an innocent man pursued across the United States by agents of a mysterious organization trying to prevent him from blocking their plan to smuggle microfilm, which contains government secrets, out of the country. This is one of several Hitchcock films that feature a music score by Bernard Herrmann and an opening title sequence by graphic designer Saul Bass, and was the first to feature extended use of kinetic typography in its opening credits.</p><p>North by Northwest is listed among the canonical Hitchcock films of the 1950s and is often listed among the greatest films of all time. It was selected in 1995 for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". After its first screening, reviewers for The New Yorker and The New York Times immediately hailed it as a masterpiece of comedic, sophisticated self-parody.</p>"
  },
  "plotFull": {
    "plainText": "North by Northwest is a 1959 American spy thriller film, produced and directed by Alfred Hitchcock and starring Cary Grant, Eva Marie Saint and James Mason. The screenplay was by Ernest Lehman, who wanted to write \"the Hitchcock picture to end all Hitchcock pictures\".\r\nNorth by Northwest is a tale of mistaken identity, with an innocent man pursued across the United States by agents of a mysterious organization trying to prevent him from blocking their plan to smuggle microfilm, which contains government secrets, out of the country. This is one of several Hitchcock films that feature a music score by Bernard Herrmann and an opening title sequence by graphic designer Saul Bass, and was the first to feature extended use of kinetic typography in its opening credits.\r\nNorth by Northwest is listed among the canonical Hitchcock films of the 1950s and is often listed among the greatest films of all time. It was selected in 1995 for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". After its first screening, reviewers for The New Yorker and The New York Times immediately hailed it as a masterpiece of comedic, sophisticated self-parody.\r\nPlot\r\nIn 1958 New York City, a waiter pages \"George Kaplan\" at the Plaza Hotel's Oak Room restaurant after a pair of thugs presumably requests him to do so. As advertising executive Roger Thornhill summons the same waiter, he is mistaken for Kaplan, kidnapped by the thugs and brought to the estate of Lester Townsend. He is interrogated by spy Phillip Vandamm, a Cold War enemy of the United States, who poses as Townsend to Thornhill. Vandamm arranges Thornhill's death in a staged drunk-driving crash. Thornhill survives, but fails to convince his mother and the police about the happenings, even after revisiting Townsend's estate. During the visit, Thornhill learns Townsend is a United Nations diplomat.\r\nThornhill and his mother go to Kaplan's empty hotel room at the Plaza. After Thornhill answers Kaplan's phone, the thugs, who had called the number from the lobby, begin their pursuit. Thornhill heads to the U.N. General Assembly Building to meet Townsend, who is a different man from Vandamm. One of the pursuing thugs throws a knife, killing Townsend, who collapses in Thornhill's arms. Thornhill is photographed as he grabs the knife, giving the appearance that he is the murderer; he then flees, attempting to find the real Kaplan. An unnamed government intelligence agency realizes that Thornhill has been mistaken for Kaplan, but decides against rescuing him for fear of compromising their operation: Kaplan is a non-existent agent they created to confuse and distract Vandamm.\r\nThornhill boards the 20th Century Limited train to Chicago, where he meets Eve Kendall, who hides him from the police. The two establish a relationship—on Kendall's part because she is secretly working with Vandamm–and she tells Thornhill that she has arranged a meeting with Kaplan at an isolated rural bus stop. Thornhill waits there, but is attacked by a crop duster plane. After trying to hide in a cornfield, he steps in front of a speeding tank truck; it brakes, and the airplane crashes into it, allowing him to escape. Thornhill reaches Kaplan's hotel in Chicago and learns that Kaplan had checked out before the time when Kendall claimed she talked to him. Thornhill goes to her room and confronts her, but she leaves. He tracks her to an art auction, where he finds Vandamm purchasing a Mexican Purépecha statue.\r\nVandamm leaves his thugs to deal with Thornhill; in order to escape, Thornhill disrupts the auction until police are called to remove him. He says he is the fugitive murderer, but they release him to the government agency's chief, \"The Professor\", who reveals that Kaplan was invented to distract Vandamm from the real government agent: Eve Kendall. Thornhill agrees to help maintain her cover. At the Mount Rushmore visitor center, Thornhill—now willingly playing the role of Kaplan—negotiates Vandamm's turnover of Kendall to be arrested. Kendall then shoots Thornhill, seemingly fatally, and flees; it turns out her gun was loaded with blanks. Afterward, the Professor arranges for Thornhill and Kendall to meet. Thornhill learns Kendall must depart on a plane with Vandamm and his henchman Leonard. He tries to dissuade her from going, but is knocked unconscious and locked in a hospital room.\r\nThornhill escapes the Professor's custody and goes to Vandamm's house to rescue Kendall. At the house, Thornhill overhears that the sculpture holds microfilm and that Leonard has discovered the blanks remaining in Kendall's gun. Vandamm indicates that he will kill Kendall by throwing her from the plane. Thornhill manages to warn her with a surreptitious note. Vandamm, Leonard, and Kendall head for the plane. As Vandamm boards, Kendall takes the sculpture and runs to the pursuing Thornhill. They flee to the top of Mount Rushmore. As they climb down the mountain they are pursued by Vandamm's thugs, including Leonard, who is fatally shot by a park ranger. Vandamm is taken into custody by the Professor.\r\nMeanwhile, Kendall is hanging on to the mountain by her fingertips. Thornhill reaches down to pull her up, at which point the scene cuts to him pulling her—now the new Mrs. Thornhill—into an upper berth on a train, which enters a tunnel.\r\nCast\r\nCary Grant as Roger Thornhill\r\nEva Marie Saint as Eve Kendall\r\nJames Mason as Phillip Vandamm\r\nJessie Royce Landis as Clara Thornhill\r\nLeo G. Carroll as The Professor\r\nJosephine Hutchinson as \"Mrs. Townsend\"\r\nPhilip Ober as Lester Townsend\r\nMartin Landau as Leonard\r\nAdam Williams as Valerian\r\nEdward Platt as Victor Larrabee\r\nRobert Ellenstein as Licht\r\nLes Tremayne as Auctioneer\r\nPhilip Coolidge as Dr. Cross\r\nPatrick McVey as Sergeant Flamm\r\nEdward Binns as Captain Junket\r\nKen Lynch as Charlie\r\nUncredited cast\r\nMaudie Prickett as Elsie the Maid\r\nMalcolm Atterbury as Man at the crossroads\r\nTol Avery as State Police Detective\r\nJohn Beradino as Sergeant Emile Klinger\r\nNed Glass as Ticket Seller\r\nDoreen Lang as Maggie, Roger's Secretary\r\nNora Marlowe as Anna, the housekeeper\r\nRalph Reed as Bellboy\r\nOlan Soule as Assistant Auctioneer\r\nFrank Wilcox as Herman Weitner\r\nRobert Shayne as Larry Wade\r\nPatricia Cutts as Hospital Patient\r\nSara Berner as Telephone Operator (voice)\r\nHitchcock's cameo appearances are a signature occurrence in most of his films. In North by Northwest, he is seen getting a bus door slammed in his face, just as his credit is appearing on the screen. There has been some speculation as to whether he made one of his rare second appearances, this time at around the 45-minute mark in drag as a woman in a turquoise dress on the train, but in fact, the woman was played by Jesslyn Fax, who went on to appear in many episodes of Alfred Hitchcock Presents. She had previously appeared in Rear Window.\r\nProduction\r\nWriting\r\nHitchcock often told journalists of an idea that he had about Cary Grant hiding from the villains inside Abraham Lincoln's nose and being given away when he sneezes. He speculated that the film could be called The Man in Lincoln's Nose (Lehman's version is that it was The Man on Lincoln's Nose) or even The Man Who Sneezed in Lincoln's Nose. Hitchcock sat on the idea, waiting for the right screenwriter to develop it. The original traveling salesman character had been suited to James Stewart, but Lehman changed it to a Madison Avenue advertising executive, a position that he had formerly held.\r\nJohn Russell Taylor's 1978 biography Hitch: The Life and Times of Alfred Hitchcock suggests that the story originated after a spell of writer's block during the scripting of another film project:\r\nAlfred Hitchcock had agreed to do a film for MGM and they had chosen an adaptation of the novel The Wreck of the Mary Deare by Hammond Innes. Composer Bernard Herrmann had recommended that Hitchcock work with his friend Ernest Lehman. After a couple of weeks, Lehman offered to quit saying he didn't know what to do with the story. Hitchcock told him they got along great together and they would just write something else. Lehman said that he wanted to make the ultimate Hitchcock film. Hitchcock thought for a moment then said he had always wanted to do a chase across Mount Rushmore. Lehman and Hitchcock spitballed more ideas: a murder at the United Nations Headquarters; a murder at a car plant in Detroit; a final showdown in Alaska. Eventually they settled on the U.N. murder for the opening and the chase across Mount Rushmore for the climax. For the central idea, Hitchcock remembered something an American journalist had told him about spies creating a fake agent as a decoy. Perhaps their hero could be mistaken for this fictitious agent and end up on the run. They bought the idea from the journalist for $10,000.\r\nLehman repeated this story in the documentary Destination Hitchcock: The Making of North by Northwest that accompanied the 2001 DVD release of the film. Screenwriter William Goldman insists in Which Lie Did I Tell? (2000) that it was Lehman who created North by Northwest and that many of Hitchcock's ideas were not used. Hitchcock had the idea of the hero being stranded in the middle of nowhere but suggested that the villains try to kill him with a tornado. \"But they're trying to kill him. How are they going to work up a cyclone?\" Lehman responded. \"I just can't tell you who said what to whom, but somewhere during that afternoon, the cyclone in the sky became the crop-duster plane.\"\r\nIn fact, Hitchcock had been working on the story for nearly nine years prior to meeting Lehman. Otis Guernsey was the American journalist who had the idea which influenced Hitchcock, inspired by a true story during World War II when British Intelligence obtained a dead body, invented a fictitious officer who was carrying secret papers, and arranged for the body and misleading papers to be discovered by the Germans as a disinformation scheme called Operation Mincemeat. Guernsey turned his idea into a story about an American salesman who travels to the Middle East and is mistaken for a fictitious agent, becoming \"saddled with a romantic and dangerous identity\". Guernsey admitted that his treatment was full of \"corn\" and \"lacking logic\", and he urged Hitchcock to do what he liked with the story. Hitchcock bought the 60 pages for $10,000. In an interview in the book Screenwriters on Screenwriting (1995), Lehman stated that he had already written much of the screenplay before coming up with critical elements of the climax. An example of the \"corn\" in the finished screenplay was the scene wherein Roger Thornhill returns to the Townsend estate with the detectives to find everything changed. If Thornhill was indeed a spy, he would have had no reason to return to the estate after his escape the previous night, nor would the criminals be expecting him to return as they obviously did.\r\nThis was the only Hitchcock film released by Metro-Goldwyn-Mayer. Since 1986, it has been owned by Turner Entertainment, as part of the pre-1986 MGM film library that it acquired through temporary ownership of MGM.\r\nProduction costs on North by Northwest were seriously escalated when a delay in filming put Cary Grant into the penalty phase of his contract, resulting in an additional $5,000 per day in fees for him before shooting even began.\r\nCasting\r\nEva Marie Saint's agent had told her that she had received an invitation to a dinner with Alfred Hitchcock and his family, the first time she and Hitchcock met. Days after the dinner, Saint's mother called her and reminded her that Hitchcock loved casting women wearing beige clothing and white gloves. Following her mother's advice, she met with Hitchcock again, wearing white gloves and beige clothing. She credited this for helping her successfully win the role. MGM wanted Cyd Charisse for the role of Eve Kendall. Hitchcock stood by his choice of Saint.\r\nHitchcock attended the Middle of the Night play in order to watch a performance by Edward G. Robinson. After being impressed by the performance of Martin Landau, Hitchcock asked to meet him at MGM. Landau arrived and Hitchcock showed him the entirety of the project, including the storyboards. While they were looking at the project, Hitchcock turned and told Landau, \"You're now Leonard.\"\r\nFilming\r\nAt Hitchcock's insistence, the film was made in Paramount's VistaVision widescreen process; only two VistaVision films were made at MGM, the other being High Society.\r\nThe aircraft flying in the aerial chase scene is a Naval Aircraft Factory N3N Canary, better known as the \"Yellow Peril,\" a World War II Navy primary trainer sometimes converted for crop-dusting. The aircraft that hits the truck and explodes is a wartime Boeing-Stearman Model 75 trainer, and many of these were also used for agricultural purposes until the 1970s. The plane was piloted by Bob Coe, a crop-duster from Wasco, California. Hitchcock placed replicas of square Indiana highway signs in the scene. In 2000, The Guardian ranked the crop-duster scene at No. 29 on their list of \"The top 100 film moments\". The British film magazine Empire ranked it as the \"greatest movie moment\" of all time in its August 2009 issue.\r\nAmong the locations used in the film are:\r\n430 Park Avenue 40°45′38″N 73°58′18″W﻿ / ﻿40.760694°N 73.971680°W﻿ / 40.760694; -73.971680 This is the building used by Saul Bass during the opening credits. The building was constructed in 1916 as a luxury apartment tower called the Avenue Apartments and was designed by the firm Warren and Wetmore. In 1953, the building was stripped of its façade, given a new curtain wall designed by Emery Roth and Sons in the style of Lever House, and converted to offices. Bass's title sequence is based on the geometric structure of the international style.\r\nThis is the building used by Saul Bass during the opening credits. The building was constructed in 1916 as a luxury apartment tower called the Avenue Apartments and was designed by the firm Warren and Wetmore. In 1953, the building was stripped of its façade, given a new curtain wall designed by Emery Roth and Sons in the style of Lever House, and converted to offices. Bass's title sequence is based on the geometric structure of the international style.\r\nCommercial Investment Trust Building (650 Madison Avenue, New York) 40°45′50″N 73°58′17″W﻿ / ﻿40.763965°N 73.971302°W﻿ / 40.763965; -73.971302 This is the location of Roger Thornhill's office, and the building he walks out of in his first appearance in the film. The CIT Building was designed by the firm Harrison and Abramovitz and constructed in 1957.\r\nThis is the location of Roger Thornhill's office, and the building he walks out of in his first appearance in the film. The CIT Building was designed by the firm Harrison and Abramovitz and constructed in 1957.\r\nPlaza Hotel (768 Fifth Avenue, New York) 40°45′53″N 73°58′27″W﻿ / ﻿40.764733°N 73.974241°W﻿ / 40.764733; -73.974241 After taking a cab with his secretary, Thornhill has a drink in the Oak Room of the Plaza Hotel. It is here that he is kidnapped by Vandamm's henchmen. Thornhill later returns to the Plaza, where he breaks into George Kaplan's room. For space reasons, most of the shots in and around the Oak Room were actually done on a set.\r\nAfter taking a cab with his secretary, Thornhill has a drink in the Oak Room of the Plaza Hotel. It is here that he is kidnapped by Vandamm's henchmen. Thornhill later returns to the Plaza, where he breaks into George Kaplan's room. For space reasons, most of the shots in and around the Oak Room were actually done on a set.\r\nOld Westbury Gardens (71 Old Westbury Road, Old Westbury) 40°46′26″N 73°35′42″W﻿ / ﻿40.773822°N 73.594921°W﻿ / 40.773822; -73.594921 Thornhill's kidnappers drive him to Townsend's estate on Long Island. After questioning Thornhill, Vandamm instructs Leonard and his other henchmen to intoxicate Thornhill by force.\r\nThornhill's kidnappers drive him to Townsend's estate on Long Island. After questioning Thornhill, Vandamm instructs Leonard and his other henchmen to intoxicate Thornhill by force.\r\nUnited Nations Headquarters 40°44′57″N 73°58′06″W﻿ / ﻿40.749127°N 73.968327°W﻿ / 40.749127; -73.968327 Following Thornhill's escape from Vandamm's henchmen at the Plaza, he takes a taxi to the United Nations Headquarters to meet Lester Townsend. The U.N. Headquarters buildings were also designed by Harrison and Abramovitz, the architects of Thornhill's office. The scene of Cary Grant going to the United Nations in New York was filmed illicitly because, after reviewing the script, U.N. authorities denied permission to film on or near its property. After two failed attempts to get the required shots, Hitchcock had Grant pull up in a taxicab right outside the General Assembly Building while a hidden camera crew filmed him exiting the vehicle and walking across the plaza.\r\nFollowing Thornhill's escape from Vandamm's henchmen at the Plaza, he takes a taxi to the United Nations Headquarters to meet Lester Townsend. The U.N. Headquarters buildings were also designed by Harrison and Abramovitz, the architects of Thornhill's office. The scene of Cary Grant going to the United Nations in New York was filmed illicitly because, after reviewing the script, U.N. authorities denied permission to film on or near its property. After two failed attempts to get the required shots, Hitchcock had Grant pull up in a taxicab right outside the General Assembly Building while a hidden camera crew filmed him exiting the vehicle and walking across the plaza.\r\nGrand Central Terminal (89 East 42nd Street, New York) 40°45′10″N 73°58′38″W﻿ / ﻿40.752724°N 73.977221°W﻿ / 40.752724; -73.977221 Following the murder of Townsend at the United Nations, Thornhill rushes to Grand Central Terminal, where he sneaks onto the 20th Century Limited en route to Chicago.\r\nFollowing the murder of Townsend at the United Nations, Thornhill rushes to Grand Central Terminal, where he sneaks onto the 20th Century Limited en route to Chicago.\r\nLaSalle Street Station (414 South LaSalle Street, Chicago) 41°52′31″N 87°37′56″W﻿ / ﻿41.875304°N 87.632152°W﻿ / 41.875304; -87.632152 Thornhill and Eve Kendall arrive in Chicago at the LaSalle Street Station. At the station, Kendall gives Thornhill the instructions for his meeting with Kaplan.\r\nThornhill and Eve Kendall arrive in Chicago at the LaSalle Street Station. At the station, Kendall gives Thornhill the instructions for his meeting with Kaplan.\r\nPrairie Stop 35°45′39″N 119°33′42″W﻿ / ﻿35.760814°N 119.561721°W﻿ / 35.760814; -119.561721 The famous \"crop duster scene,\" which in the film takes place in rural Indiana, was in actuality filmed on a highway in central California near the town Wasco. Hitchcock added square signs to the location to replicate those found in Indiana.\r\nThe famous \"crop duster scene,\" which in the film takes place in rural Indiana, was in actuality filmed on a highway in central California near the town Wasco. Hitchcock added square signs to the location to replicate those found in Indiana.\r\nAmbassador East Hotel 41°54′21″N 87°37′42″W﻿ / ﻿41.905856°N 87.628303°W﻿ / 41.905856; -87.628303 Thornhill returns to Chicago in a stolen truck he parks outside the Ambassador East Hotel. The hotel opened in 1926 and was designed by Robert S. DeGolyer and Co. Today, it continues to be operated as a hotel, under the name The Ambassador.\r\nThornhill returns to Chicago in a stolen truck he parks outside the Ambassador East Hotel. The hotel opened in 1926 and was designed by Robert S. DeGolyer and Co. Today, it continues to be operated as a hotel, under the name The Ambassador.\r\nChicago Midway Airport 41°47′18″N 87°44′39″W﻿ / ﻿41.788372°N 87.744211°W﻿ / 41.788372; -87.744211 Following Thornhill's arrest at the auction, he and the Professor travel to Midway Airport, where they board a flight for Rapid City, South Dakota. The terminal seen in the film was built in 1945-46 and was designed by architect Paul Gerhardt Sr. This terminal building was demolished in 2002.\r\nFollowing Thornhill's arrest at the auction, he and the Professor travel to Midway Airport, where they board a flight for Rapid City, South Dakota. The terminal seen in the film was built in 1945-46 and was designed by architect Paul Gerhardt Sr. This terminal building was demolished in 2002.\r\nMemorial View Building, Mount Rushmore 43°52′37″N 103°27′22″W﻿ / ﻿43.877014°N 103.456213°W﻿ / 43.877014; -103.456213 The spurious murder of Roger Thornhill takes place in the Buffalo Room of the Memorial View Building at Mount Rushmore—the one location in the park where Hitchcock was permitted to film. This building was constructed in 1957 as part of the National Park Service's Mission 66 program, and was designed jointly by NPS architect Cecil J. Doty and local architect Harold Spitznagel. The building was demolished in 1994.\r\nThe spurious murder of Roger Thornhill takes place in the Buffalo Room of the Memorial View Building at Mount Rushmore—the one location in the park where Hitchcock was permitted to film. This building was constructed in 1957 as part of the National Park Service's Mission 66 program, and was designed jointly by NPS architect Cecil J. Doty and local architect Harold Spitznagel. The building was demolished in 1994.\r\nPhillip Vandamm House Vandamm's house, set on a cliff atop Mount Rushmore, was not a real structure. Hitchcock asked the set designers to make the house in the style of Frank Lloyd Wright, the most popular architect in America at the time, using the materials, form and interiors associated with him. Set designer Robert F. Boyle planned the house, which featured a cantilevered living room and made extensive use of limestone. Exterior shots were done using matte paintings, while interior shots were filmed using a set built in Culver City, California, where MGM's studios were located.\r\nVandamm's house, set on a cliff atop Mount Rushmore, was not a real structure. Hitchcock asked the set designers to make the house in the style of Frank Lloyd Wright, the most popular architect in America at the time, using the materials, form and interiors associated with him. Set designer Robert F. Boyle planned the house, which featured a cantilevered living room and made extensive use of limestone. Exterior shots were done using matte paintings, while interior shots were filmed using a set built in Culver City, California, where MGM's studios were located.\r\nCostuming\r\nA panel of fashion experts convened by GQ in 2006 said the gray suit worn by Cary Grant throughout almost the entire film was the best suit in film history, and the most influential on men's style, stating that it has since been copied for Tom Cruise's character in Collateral and Ben Affleck's character in Paycheck. This sentiment has been echoed by writer Todd McEwen, who called it \"gorgeous\" and wrote a short story, \"Cary Grant's Suit\", that recounts the film's plot from the viewpoint of the suit. There is some disagreement as to who tailored the suit; according to Vanity Fair magazine, it was Norton & Sons of London, although according to The Independent, it was Quintino of Beverly Hills.\r\nAccording to another article, Grant used his Savile Row tailor, Kilgour French and Stanbury for the suit. There is a label reading “Quintino” on one of the suits in the film, but this is because Quintino made duplicate suits for scenes involving more activity or stunts.\r\nEva Marie Saint's wardrobe for the film was originally entirely chosen by MGM. Hitchcock disliked MGM's selections, and the actress and director went to Bergdorf Goodman in New York to select what she would wear.\r\nEditing and post-production\r\nIn François Truffaut's book-length interview, Hitchcock/Truffaut (1967), Hitchcock said that MGM wanted North by Northwest cut by 15 minutes so the film's length would run under two hours. Hitchcock had his agent check his contract, learned that he had absolute control over the final cut, and refused.\r\nOne of Eva Marie Saint's lines in the dining-car seduction scene was redubbed. She originally said, \"I never make love on an empty stomach\", but it was changed in post-production to \"I never discuss love on an empty stomach\", as the censors considered the original version too risqué.\r\nRelease\r\nThe film opened on July 1, 1959, at the United Artists Theatre in Chicago. It had a seven-week run at Radio City Music Hall in August and September 1959. One trailer for North by Northwest features Hitchcock presenting himself as the owner of Alfred Hitchcock Travel Agency and telling the viewer he has made a motion picture to advertise these wonderful vacation stops.\r\nHome media\r\nNorth by Northwest was released on the Blu-ray Disc format in the United States on November 3, 2009, by Warner Bros. with a 1080p VC-1 encoding. This release is a special 50th-anniversary edition, restored and remastered from original VistaVision elements. A DVD edition was also released.\r\nReception\r\nBox office\r\nIn its opening in Chicago, it grossed $46,000 in its first week and $35,000 the second week. The film grossed $209,000 in its opening week at Radio City Music Hall, setting a record opening week at the theater, as well as its record non-holiday week gross, and went on to gross a record $404,056 in two weeks. Its opening at the Music Hall saw it become the number one film at the US box office, where it remained for its seven weeks at the Music Hall. By the end of August, it had grossed $2,568,000 from 139 engagements.\r\nAccording to MGM records, the film earned theatrical rentals of $5,740,000 in the United States and Canada and $4.1 million elsewhere, resulting in a profit of $837,000.\r\nCritical reception\r\nNorth by Northwest holds a \"Certified Fresh\" 97% rating on the review aggregator Rotten Tomatoes, based on 113 reviews, with an average rating of 9.3/10. The site states the critical consensus as: \"Gripping, suspenseful and visually iconic, this late-period Hitchcock classic laid the groundwork for countless action thrillers to follow.\" On Metacritic, it has a score of 98 out of 100, based on reviews from 16 critics, indicating \"universal acclaim\". In 1998, Time Out conducted a poll, and North by Northwest was voted the 12th-greatest film of all time. The Village Voice ranked North by Northwest at No. 49 in its \"Top 250 Best Films of the Century\" list in 1999, based on a poll of critics. Entertainment Weekly voted it the 44th-greatest film of all time in 1999. The film ranks at No. 98 in Empire's list of the 500 Greatest Films of All Time. The Writers Guild of America ranked the screenplay No. 21 on its list of 101 Greatest Screenplays ever written. It is ranked the 40th-greatest American film by the American Film Institute. The film was voted at No. 28 on the list of \"100 Greatest Films\" by the prominent French magazine Cahiers du cinéma in 2008. In the British Film Institute's 2012 Sight & Sound polls of the greatest films ever made, North by Northwest was ranked 53rd among critics; and in the 2022 polls, the film was ranked 45th among critics. In 2010, The Guardian ranked it as the second-best action and war film of all time. North by Northwest was ranked 13th in BBC's 2015 list of the 100 greatest American films. In 2022, Time Out named North by Northwest the greatest thriller film ever made.\r\nTime called the film \"smoothly troweled and thoroughly entertaining\". A. H. Weiler of The New York Times made it a \"Critic's Pick\" and said it was the \"year's most scenic, intriguing and merriest chase\"; he also complimented the two leads:\r\nCary Grant, a veteran member of the Hitchcock acting varsity, was never more at home than in this role of the advertising-man-on-the-lam. He handles the grimaces, the surprised look, the quick smile, ... and all the derring-do with professional aplomb and grace, In casting Eva Marie Saint as his romantic vis-à-vis, Mr. Hitchcock has plumbed some talents not shown by the actress heretofore. Although she is seemingly a hard, designing type, she also emerges both the sweet heroine and a glamorous charmer.\r\nFilm critic Charles Champlin saw the film as an \"anthology of typical Hitchcockian situations\" and was particularly taken by the scene and suspense in which Grant's character avoids death when attacked by a crop-dusting plane in the cornfields, which he believed was representative of Hitchcock's finest work. Sight & Sound critic Penelope Houston called it \"the purest piece of entertainment filmmaking\".\r\nThe London edition of Time Out, reviewing the film nearly a half-century after its initial release, commented:\r\nFifty years on, you could say that Hitchcock's sleek, wry, paranoid thriller caught the zeitgeist perfectly: Cold War shadiness, secret agents of power, urbane modernism, the ant-like bustle of city life, and a hint of dread behind the sharp suits of affluence. Cary Grant's Roger Thornhill, the film's sharply dressed ad exec who is sucked into a vortex of mistaken identity, certainly wouldn't be out of place in Mad Men. But there's nothing dated about this perfect storm of talent, from Hitchcock and Grant to writer Ernest Lehman (Sweet Smell of Success), co-stars James Mason and Eva Marie Saint, composer Bernard Herrmann and even designer Saul Bass, whose opening-credits sequence still manages to send a shiver down the spine.\r\nAuthor and journalist Nick Clooney praised Lehman's original story and sophisticated dialogue, calling the film \"certainly Alfred Hitchcock's most stylish thriller, if not his best\".\r\nAwards\r\nNorth by Northwest was nominated for three Academy Awards—Best Film Editing (George Tomasini), Best Art Direction – Set Decoration, Color (William A. Horning, Robert F. Boyle, Merrill Pye, Henry Grace and Frank R. McKelvy), and Best Original Screenplay (Ernest Lehman)—at the 32nd Academy Awards ceremony. Two of the three awards went instead to Ben-Hur, and the other went to Pillow Talk. The film—and Lehman specifically—also won a 1960 Edgar Award for Best Motion Picture Screenplay. Hitchcock received his second Silver Shell for Best Director award at the San Sebastián International Film Festival. (He was also awarded the Silver Shell the year before for Vertigo.)\r\nIn 1995, North by Northwest was selected for preservation in the National Film Registry by the United States Library of Congress as being \"culturally, historically, or aesthetically significant.\" In June 2008, the American Film Institute revealed its \"10 Top 10\"—the best 10 films in 10 \"classic\" American film genres—after polling over 1,500 people from the creative community. North by Northwest was acknowledged as the seventh-best film in the mystery genre. It was also listed as No. 40 in AFI's 100 Years...100 Movies, No. 4 in AFI's 100 Years...100 Thrills, and No. 55 in AFI's 100 Years...100 Movies (10th Anniversary Edition).\r\nThemes and motifs\r\nHitchcock planned the film as a change of pace after his dark romantic thriller Vertigo a year earlier. In his book-length interview Hitchcock/Truffaut (1967) with François Truffaut, Hitchcock said that he wanted to do \"something fun, light-hearted, and generally free of the symbolism permeating his other movies.\" Writer Ernest Lehman has also mocked those who look for symbolism in the film. Despite its popular appeal, the film is considered to be a masterpiece for its themes of deception, mistaken identity, and moral relativism in the Cold War era.\r\nThe title North by Northwest is a subject of debate. Many have seen it as having been taken from a line (\"I am but mad north-north-west: when the wind is southerly I know a hawk from a handsaw\") in Hamlet, a work also concerned with the shifty nature of reality. Hitchcock noted, in an interview with Peter Bogdanovich in 1963: \"It's a fantasy. The whole film is epitomized in the title—there is no such thing as north-by-northwest on the compass.\" (\"Northwest by north\", however, is one of 32 points of the compass.) Lehman states that he used a working title for the film of In a Northwesterly Direction because the film's action was to begin in New York and climax in Alaska. Then the head of the story department at MGM suggested North by Northwest, but this was still to be a working title. Other titles were considered, including The Man on Lincoln's Nose, but North by Northwest was kept because, according to Lehman, \"We never did find a title.\" The Northwest Airlines reference in the film plays on the title.\r\nThe film's plot involves a \"MacGuffin\"—a term popularized by Hitchcock—which is a physical object that everyone in the film is chasing, but which has no deep relationship to the plot. Late in North by Northwest, it emerges that the spies are attempting to smuggle microfilm containing government secrets out of the country. They have been trying to kill Thornhill, whom they believe to be the agent on their trail, \"George Kaplan\".\r\nNorth by Northwest has been referred to as \"the first James Bond film\" because of its splashily colorful settings, secret agents, and an elegant, daring, wisecracking leading man opposite a sinister yet strangely charming villain. The crop-duster scene inspired the helicopter chase in From Russia with Love.\r\nThe film's final shot—that of the train speeding into a tunnel during a romantic embrace onboard—is a famous bit of self-conscious Freudian symbolism reflecting Hitchcock's mischievous sense of humor. In the book Hitchcock/Truffaut (pp. 107–108), Hitchcock called it a \"phallic symbol ... probably one of the most impudent shots I ever made\".\r\nInfluences\r\nThe film was very influential on the James Bond movies and subsequent action-thriller films, as well as the TV series The Man from U.N.C.L.E., where Leo G. Carroll played the same sort of role as the head of a top secret intelligence agency. The film's title is reported to have been the influence for the name of the popular annual live-music festival South by Southwest in Austin, Texas, started in 1987, with the name idea coming from Louis Black, editor and co-founder of the local alternative weekly The Austin Chronicle, as a play on the Hitchcock film title.\r\nThe third episode of the Doctor Who serial \"The Deadly Assassin\" (1976) includes an homage to North by Northwest, when the Doctor, who like Hitchcock's hero is falsely accused of a politically motivated murder, is attacked by gunfire from a biplane piloted by one of his enemy's henchmen.\r\nThe 2010 Spanish dark comedy film The Last Circus pays visual homage to the Mount Rushmore scene in its climactic scene atop a controversial Francoist monument.\r\nAdaptations\r\nNorth by Northwest was adapted as a stage play by Carolyn Burns. The adaptation premiered at the Melbourne Theatre Company in 2015.",
    "html": "<p>North by Northwest is a 1959 American spy thriller film, produced and directed by Alfred Hitchcock and starring Cary Grant, Eva Marie Saint and James Mason. The screenplay was by Ernest Lehman, who wanted to write \"the Hitchcock picture to end all Hitchcock pictures\".</p><p>North by Northwest is a tale of mistaken identity, with an innocent man pursued across the United States by agents of a mysterious organization trying to prevent him from blocking their plan to smuggle microfilm, which contains government secrets, out of the country. This is one of several Hitchcock films that feature a music score by Bernard Herrmann and an opening title sequence by graphic designer Saul Bass, and was the first to feature extended use of kinetic typography in its opening credits.</p><p>North by Northwest is listed among the canonical Hitchcock films of the 1950s and is often listed among the greatest films of all time. It was selected in 1995 for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". After its first screening, reviewers for The New Yorker and The New York Times immediately hailed it as a masterpiece of comedic, sophisticated self-parody.</p><br/><h3>Plot</h3><p>In 1958 New York City, a waiter pages \"George Kaplan\" at the Plaza Hotel's Oak Room restaurant after a pair of thugs presumably requests him to do so. As advertising executive Roger Thornhill summons the same waiter, he is mistaken for Kaplan, kidnapped by the thugs and brought to the estate of Lester Townsend. He is interrogated by spy Phillip Vandamm, a Cold War enemy of the United States, who poses as Townsend to Thornhill. Vandamm arranges Thornhill's death in a staged drunk-driving crash. Thornhill survives, but fails to convince his mother and the police about the happenings, even after revisiting Townsend's estate. During the visit, Thornhill learns Townsend is a United Nations diplomat.</p><p>Thornhill and his mother go to Kaplan's empty hotel room at the Plaza. After Thornhill answers Kaplan's phone, the thugs, who had called the number from the lobby, begin their pursuit. Thornhill heads to the U.N. General Assembly Building to meet Townsend, who is a different man from Vandamm. One of the pursuing thugs throws a knife, killing Townsend, who collapses in Thornhill's arms. Thornhill is photographed as he grabs the knife, giving the appearance that he is the murderer; he then flees, attempting to find the real Kaplan. An unnamed government intelligence agency realizes that Thornhill has been mistaken for Kaplan, but decides against rescuing him for fear of compromising their operation: Kaplan is a non-existent agent they created to confuse and distract Vandamm.</p><p>Thornhill boards the 20th Century Limited train to Chicago, where he meets Eve Kendall, who hides him from the police. The two establish a relationship—on Kendall's part because she is secretly working with Vandamm–and she tells Thornhill that she has arranged a meeting with Kaplan at an isolated rural bus stop. Thornhill waits there, but is attacked by a crop duster plane. After trying to hide in a cornfield, he steps in front of a speeding tank truck; it brakes, and the airplane crashes into it, allowing him to escape. Thornhill reaches Kaplan's hotel in Chicago and learns that Kaplan had checked out before the time when Kendall claimed she talked to him. Thornhill goes to her room and confronts her, but she leaves. He tracks her to an art auction, where he finds Vandamm purchasing a Mexican Purépecha statue.</p><p>Vandamm leaves his thugs to deal with Thornhill; in order to escape, Thornhill disrupts the auction until police are called to remove him. He says he is the fugitive murderer, but they release him to the government agency's chief, \"The Professor\", who reveals that Kaplan was invented to distract Vandamm from the real government agent: Eve Kendall. Thornhill agrees to help maintain her cover. At the Mount Rushmore visitor center, Thornhill—now willingly playing the role of Kaplan—negotiates Vandamm's turnover of Kendall to be arrested. Kendall then shoots Thornhill, seemingly fatally, and flees; it turns out her gun was loaded with blanks. Afterward, the Professor arranges for Thornhill and Kendall to meet. Thornhill learns Kendall must depart on a plane with Vandamm and his henchman Leonard. He tries to dissuade her from going, but is knocked unconscious and locked in a hospital room.</p><p>Thornhill escapes the Professor's custody and goes to Vandamm's house to rescue Kendall. At the house, Thornhill overhears that the sculpture holds microfilm and that Leonard has discovered the blanks remaining in Kendall's gun. Vandamm indicates that he will kill Kendall by throwing her from the plane. Thornhill manages to warn her with a surreptitious note. Vandamm, Leonard, and Kendall head for the plane. As Vandamm boards, Kendall takes the sculpture and runs to the pursuing Thornhill. They flee to the top of Mount Rushmore. As they climb down the mountain they are pursued by Vandamm's thugs, including Leonard, who is fatally shot by a park ranger. Vandamm is taken into custody by the Professor.</p><p>Meanwhile, Kendall is hanging on to the mountain by her fingertips. Thornhill reaches down to pull her up, at which point the scene cuts to him pulling her—now the new Mrs. Thornhill—into an upper berth on a train, which enters a tunnel.</p><br/><h3>Cast</h3><ul><li>Cary Grant as Roger Thornhill</li><li>Eva Marie Saint as Eve Kendall</li><li>James Mason as Phillip Vandamm</li><li>Jessie Royce Landis as Clara Thornhill</li><li>Leo G. Carroll as The Professor</li><li>Josephine Hutchinson as \"Mrs. Townsend\"</li><li>Philip Ober as Lester Townsend</li><li>Martin Landau as Leonard</li><li>Adam Williams as Valerian</li><li>Edward Platt as Victor Larrabee</li><li>Robert Ellenstein as Licht</li><li>Les Tremayne as Auctioneer</li><li>Philip Coolidge as Dr. Cross</li><li>Patrick McVey as Sergeant Flamm</li><li>Edward Binns as Captain Junket</li><li>Ken Lynch as Charlie</li></ul><p>Uncredited cast</p><ul><li>Maudie Prickett as Elsie the Maid</li><li>Malcolm Atterbury as Man at the crossroads</li><li>Tol Avery as State Police Detective</li><li>John Beradino as Sergeant Emile Klinger</li><li>Ned Glass as Ticket Seller</li><li>Doreen Lang as Maggie, Roger's Secretary</li><li>Nora Marlowe as Anna, the housekeeper</li><li>Ralph Reed as Bellboy</li><li>Olan Soule as Assistant Auctioneer</li><li>Frank Wilcox as Herman Weitner</li><li>Robert Shayne as Larry Wade</li><li>Patricia Cutts as Hospital Patient</li><li>Sara Berner as Telephone Operator (voice)</li></ul><p>Hitchcock's cameo appearances are a signature occurrence in most of his films. In North by Northwest, he is seen getting a bus door slammed in his face, just as his credit is appearing on the screen. There has been some speculation as to whether he made one of his rare second appearances, this time at around the 45-minute mark in drag as a woman in a turquoise dress on the train, but in fact, the woman was played by Jesslyn Fax, who went on to appear in many episodes of Alfred Hitchcock Presents. She had previously appeared in Rear Window.</p><br/><h3>Production</h3><h4>Writing</h4><p>Hitchcock often told journalists of an idea that he had about Cary Grant hiding from the villains inside Abraham Lincoln's nose and being given away when he sneezes. He speculated that the film could be called The Man in Lincoln's Nose (Lehman's version is that it was The Man on Lincoln's Nose) or even The Man Who Sneezed in Lincoln's Nose. Hitchcock sat on the idea, waiting for the right screenwriter to develop it. The original traveling salesman character had been suited to James Stewart, but Lehman changed it to a Madison Avenue advertising executive, a position that he had formerly held.</p><p>John Russell Taylor's 1978 biography Hitch: The Life and Times of Alfred Hitchcock suggests that the story originated after a spell of writer's block during the scripting of another film project:</p><blockquote>Alfred Hitchcock had agreed to do a film for MGM and they had chosen an adaptation of the novel The Wreck of the Mary Deare by Hammond Innes. Composer Bernard Herrmann had recommended that Hitchcock work with his friend Ernest Lehman. After a couple of weeks, Lehman offered to quit saying he didn't know what to do with the story. Hitchcock told him they got along great together and they would just write something else. Lehman said that he wanted to make the ultimate Hitchcock film. Hitchcock thought for a moment then said he had always wanted to do a chase across Mount Rushmore. Lehman and Hitchcock spitballed more ideas: a murder at the United Nations Headquarters; a murder at a car plant in Detroit; a final showdown in Alaska. Eventually they settled on the U.N. murder for the opening and the chase across Mount Rushmore for the climax. For the central idea, Hitchcock remembered something an American journalist had told him about spies creating a fake agent as a decoy. Perhaps their hero could be mistaken for this fictitious agent and end up on the run. They bought the idea from the journalist for $10,000.</blockquote><p>Lehman repeated this story in the documentary Destination Hitchcock: The Making of North by Northwest that accompanied the 2001 DVD release of the film. Screenwriter William Goldman insists in Which Lie Did I Tell? (2000) that it was Lehman who created North by Northwest and that many of Hitchcock's ideas were not used. Hitchcock had the idea of the hero being stranded in the middle of nowhere but suggested that the villains try to kill him with a tornado. \"But they're trying to kill him. How are they going to work up a cyclone?\" Lehman responded. \"I just can't tell you who said what to whom, but somewhere during that afternoon, the cyclone in the sky became the crop-duster plane.\"</p><p>In fact, Hitchcock had been working on the story for nearly nine years prior to meeting Lehman. Otis Guernsey was the American journalist who had the idea which influenced Hitchcock, inspired by a true story during World War II when British Intelligence obtained a dead body, invented a fictitious officer who was carrying secret papers, and arranged for the body and misleading papers to be discovered by the Germans as a disinformation scheme called Operation Mincemeat. Guernsey turned his idea into a story about an American salesman who travels to the Middle East and is mistaken for a fictitious agent, becoming \"saddled with a romantic and dangerous identity\". Guernsey admitted that his treatment was full of \"corn\" and \"lacking logic\", and he urged Hitchcock to do what he liked with the story. Hitchcock bought the 60 pages for $10,000. In an interview in the book Screenwriters on Screenwriting (1995), Lehman stated that he had already written much of the screenplay before coming up with critical elements of the climax. An example of the \"corn\" in the finished screenplay was the scene wherein Roger Thornhill returns to the Townsend estate with the detectives to find everything changed. If Thornhill was indeed a spy, he would have had no reason to return to the estate after his escape the previous night, nor would the criminals be expecting him to return as they obviously did.</p><p>This was the only Hitchcock film released by Metro-Goldwyn-Mayer. Since 1986, it has been owned by Turner Entertainment, as part of the pre-1986 MGM film library that it acquired through temporary ownership of MGM.</p><p>Production costs on North by Northwest were seriously escalated when a delay in filming put Cary Grant into the penalty phase of his contract, resulting in an additional $5,000 per day in fees for him before shooting even began.</p><h4>Casting</h4><p>Eva Marie Saint's agent had told her that she had received an invitation to a dinner with Alfred Hitchcock and his family, the first time she and Hitchcock met. Days after the dinner, Saint's mother called her and reminded her that Hitchcock loved casting women wearing beige clothing and white gloves. Following her mother's advice, she met with Hitchcock again, wearing white gloves and beige clothing. She credited this for helping her successfully win the role. MGM wanted Cyd Charisse for the role of Eve Kendall. Hitchcock stood by his choice of Saint.</p><p>Hitchcock attended the Middle of the Night play in order to watch a performance by Edward G. Robinson. After being impressed by the performance of Martin Landau, Hitchcock asked to meet him at MGM. Landau arrived and Hitchcock showed him the entirety of the project, including the storyboards. While they were looking at the project, Hitchcock turned and told Landau, \"You're now Leonard.\"</p><h4>Filming</h4><p>At Hitchcock's insistence, the film was made in Paramount's VistaVision widescreen process; only two VistaVision films were made at MGM, the other being High Society.</p><p>The aircraft flying in the aerial chase scene is a Naval Aircraft Factory N3N Canary, better known as the \"Yellow Peril,\" a World War II Navy primary trainer sometimes converted for crop-dusting. The aircraft that hits the truck and explodes is a wartime Boeing-Stearman Model 75 trainer, and many of these were also used for agricultural purposes until the 1970s. The plane was piloted by Bob Coe, a crop-duster from Wasco, California. Hitchcock placed replicas of square Indiana highway signs in the scene. In 2000, The Guardian ranked the crop-duster scene at No. 29 on their list of \"The top 100 film moments\". The British film magazine Empire ranked it as the \"greatest movie moment\" of all time in its August 2009 issue.</p><p>Among the locations used in the film are:</p><ul><li>430 Park Avenue 40°45′38″N 73°58′18″W﻿ / ﻿40.760694°N 73.971680°W﻿ / 40.760694; -73.971680 This is the building used by Saul Bass during the opening credits. The building was constructed in 1916 as a luxury apartment tower called the Avenue Apartments and was designed by the firm Warren and Wetmore. In 1953, the building was stripped of its façade, given a new curtain wall designed by Emery Roth and Sons in the style of Lever House, and converted to offices. Bass's title sequence is based on the geometric structure of the international style.</li><li>This is the building used by Saul Bass during the opening credits. The building was constructed in 1916 as a luxury apartment tower called the Avenue Apartments and was designed by the firm Warren and Wetmore. In 1953, the building was stripped of its façade, given a new curtain wall designed by Emery Roth and Sons in the style of Lever House, and converted to offices. Bass's title sequence is based on the geometric structure of the international style.</li><li>Commercial Investment Trust Building (650 Madison Avenue, New York) 40°45′50″N 73°58′17″W﻿ / ﻿40.763965°N 73.971302°W﻿ / 40.763965; -73.971302 This is the location of Roger Thornhill's office, and the building he walks out of in his first appearance in the film. The CIT Building was designed by the firm Harrison and Abramovitz and constructed in 1957.</li><li>This is the location of Roger Thornhill's office, and the building he walks out of in his first appearance in the film. The CIT Building was designed by the firm Harrison and Abramovitz and constructed in 1957.</li><li>Plaza Hotel (768 Fifth Avenue, New York) 40°45′53″N 73°58′27″W﻿ / ﻿40.764733°N 73.974241°W﻿ / 40.764733; -73.974241 After taking a cab with his secretary, Thornhill has a drink in the Oak Room of the Plaza Hotel. It is here that he is kidnapped by Vandamm's henchmen. Thornhill later returns to the Plaza, where he breaks into George Kaplan's room. For space reasons, most of the shots in and around the Oak Room were actually done on a set.</li><li>After taking a cab with his secretary, Thornhill has a drink in the Oak Room of the Plaza Hotel. It is here that he is kidnapped by Vandamm's henchmen. Thornhill later returns to the Plaza, where he breaks into George Kaplan's room. For space reasons, most of the shots in and around the Oak Room were actually done on a set.</li><li>Old Westbury Gardens (71 Old Westbury Road, Old Westbury) 40°46′26″N 73°35′42″W﻿ / ﻿40.773822°N 73.594921°W﻿ / 40.773822; -73.594921 Thornhill's kidnappers drive him to Townsend's estate on Long Island. After questioning Thornhill, Vandamm instructs Leonard and his other henchmen to intoxicate Thornhill by force.</li><li>Thornhill's kidnappers drive him to Townsend's estate on Long Island. After questioning Thornhill, Vandamm instructs Leonard and his other henchmen to intoxicate Thornhill by force.</li><li>United Nations Headquarters 40°44′57″N 73°58′06″W﻿ / ﻿40.749127°N 73.968327°W﻿ / 40.749127; -73.968327 Following Thornhill's escape from Vandamm's henchmen at the Plaza, he takes a taxi to the United Nations Headquarters to meet Lester Townsend. The U.N. Headquarters buildings were also designed by Harrison and Abramovitz, the architects of Thornhill's office. The scene of Cary Grant going to the United Nations in New York was filmed illicitly because, after reviewing the script, U.N. authorities denied permission to film on or near its property. After two failed attempts to get the required shots, Hitchcock had Grant pull up in a taxicab right outside the General Assembly Building while a hidden camera crew filmed him exiting the vehicle and walking across the plaza.</li><li>Following Thornhill's escape from Vandamm's henchmen at the Plaza, he takes a taxi to the United Nations Headquarters to meet Lester Townsend. The U.N. Headquarters buildings were also designed by Harrison and Abramovitz, the architects of Thornhill's office. The scene of Cary Grant going to the United Nations in New York was filmed illicitly because, after reviewing the script, U.N. authorities denied permission to film on or near its property. After two failed attempts to get the required shots, Hitchcock had Grant pull up in a taxicab right outside the General Assembly Building while a hidden camera crew filmed him exiting the vehicle and walking across the plaza.</li><li>Grand Central Terminal (89 East 42nd Street, New York) 40°45′10″N 73°58′38″W﻿ / ﻿40.752724°N 73.977221°W﻿ / 40.752724; -73.977221 Following the murder of Townsend at the United Nations, Thornhill rushes to Grand Central Terminal, where he sneaks onto the 20th Century Limited en route to Chicago.</li><li>Following the murder of Townsend at the United Nations, Thornhill rushes to Grand Central Terminal, where he sneaks onto the 20th Century Limited en route to Chicago.</li><li>LaSalle Street Station (414 South LaSalle Street, Chicago) 41°52′31″N 87°37′56″W﻿ / ﻿41.875304°N 87.632152°W﻿ / 41.875304; -87.632152 Thornhill and Eve Kendall arrive in Chicago at the LaSalle Street Station. At the station, Kendall gives Thornhill the instructions for his meeting with Kaplan.</li><li>Thornhill and Eve Kendall arrive in Chicago at the LaSalle Street Station. At the station, Kendall gives Thornhill the instructions for his meeting with Kaplan.</li><li>Prairie Stop 35°45′39″N 119°33′42″W﻿ / ﻿35.760814°N 119.561721°W﻿ / 35.760814; -119.561721 The famous \"crop duster scene,\" which in the film takes place in rural Indiana, was in actuality filmed on a highway in central California near the town Wasco. Hitchcock added square signs to the location to replicate those found in Indiana.</li><li>The famous \"crop duster scene,\" which in the film takes place in rural Indiana, was in actuality filmed on a highway in central California near the town Wasco. Hitchcock added square signs to the location to replicate those found in Indiana.</li><li>Ambassador East Hotel 41°54′21″N 87°37′42″W﻿ / ﻿41.905856°N 87.628303°W﻿ / 41.905856; -87.628303 Thornhill returns to Chicago in a stolen truck he parks outside the Ambassador East Hotel. The hotel opened in 1926 and was designed by Robert S. DeGolyer and Co. Today, it continues to be operated as a hotel, under the name The Ambassador.</li><li>Thornhill returns to Chicago in a stolen truck he parks outside the Ambassador East Hotel. The hotel opened in 1926 and was designed by Robert S. DeGolyer and Co. Today, it continues to be operated as a hotel, under the name The Ambassador.</li><li>Chicago Midway Airport 41°47′18″N 87°44′39″W﻿ / ﻿41.788372°N 87.744211°W﻿ / 41.788372; -87.744211 Following Thornhill's arrest at the auction, he and the Professor travel to Midway Airport, where they board a flight for Rapid City, South Dakota. The terminal seen in the film was built in 1945-46 and was designed by architect Paul Gerhardt Sr. This terminal building was demolished in 2002.</li><li>Following Thornhill's arrest at the auction, he and the Professor travel to Midway Airport, where they board a flight for Rapid City, South Dakota. The terminal seen in the film was built in 1945-46 and was designed by architect Paul Gerhardt Sr. This terminal building was demolished in 2002.</li><li>Memorial View Building, Mount Rushmore 43°52′37″N 103°27′22″W﻿ / ﻿43.877014°N 103.456213°W﻿ / 43.877014; -103.456213 The spurious murder of Roger Thornhill takes place in the Buffalo Room of the Memorial View Building at Mount Rushmore—the one location in the park where Hitchcock was permitted to film. This building was constructed in 1957 as part of the National Park Service's Mission 66 program, and was designed jointly by NPS architect Cecil J. Doty and local architect Harold Spitznagel. The building was demolished in 1994.</li><li>The spurious murder of Roger Thornhill takes place in the Buffalo Room of the Memorial View Building at Mount Rushmore—the one location in the park where Hitchcock was permitted to film. This building was constructed in 1957 as part of the National Park Service's Mission 66 program, and was designed jointly by NPS architect Cecil J. Doty and local architect Harold Spitznagel. The building was demolished in 1994.</li><li>Phillip Vandamm House Vandamm's house, set on a cliff atop Mount Rushmore, was not a real structure. Hitchcock asked the set designers to make the house in the style of Frank Lloyd Wright, the most popular architect in America at the time, using the materials, form and interiors associated with him. Set designer Robert F. Boyle planned the house, which featured a cantilevered living room and made extensive use of limestone. Exterior shots were done using matte paintings, while interior shots were filmed using a set built in Culver City, California, where MGM's studios were located.</li><li>Vandamm's house, set on a cliff atop Mount Rushmore, was not a real structure. Hitchcock asked the set designers to make the house in the style of Frank Lloyd Wright, the most popular architect in America at the time, using the materials, form and interiors associated with him. Set designer Robert F. Boyle planned the house, which featured a cantilevered living room and made extensive use of limestone. Exterior shots were done using matte paintings, while interior shots were filmed using a set built in Culver City, California, where MGM's studios were located.</li></ul><h4>Costuming</h4><p>A panel of fashion experts convened by GQ in 2006 said the gray suit worn by Cary Grant throughout almost the entire film was the best suit in film history, and the most influential on men's style, stating that it has since been copied for Tom Cruise's character in Collateral and Ben Affleck's character in Paycheck. This sentiment has been echoed by writer Todd McEwen, who called it \"gorgeous\" and wrote a short story, \"Cary Grant's Suit\", that recounts the film's plot from the viewpoint of the suit. There is some disagreement as to who tailored the suit; according to Vanity Fair magazine, it was Norton & Sons of London, although according to The Independent, it was Quintino of Beverly Hills.</p><p>According to another article, Grant used his Savile Row tailor, Kilgour French and Stanbury for the suit. There is a label reading “Quintino” on one of the suits in the film, but this is because Quintino made duplicate suits for scenes involving more activity or stunts.</p><p>Eva Marie Saint's wardrobe for the film was originally entirely chosen by MGM. Hitchcock disliked MGM's selections, and the actress and director went to Bergdorf Goodman in New York to select what she would wear.</p><h4>Editing and post-production</h4><p>In François Truffaut's book-length interview, Hitchcock/Truffaut (1967), Hitchcock said that MGM wanted North by Northwest cut by 15 minutes so the film's length would run under two hours. Hitchcock had his agent check his contract, learned that he had absolute control over the final cut, and refused.</p><p>One of Eva Marie Saint's lines in the dining-car seduction scene was redubbed. She originally said, \"I never make love on an empty stomach\", but it was changed in post-production to \"I never discuss love on an empty stomach\", as the censors considered the original version too risqué.</p><br/><h3>Release</h3><p>The film opened on July 1, 1959, at the United Artists Theatre in Chicago. It had a seven-week run at Radio City Music Hall in August and September 1959. One trailer for North by Northwest features Hitchcock presenting himself as the owner of Alfred Hitchcock Travel Agency and telling the viewer he has made a motion picture to advertise these wonderful vacation stops.</p><h4>Home media</h4><p>North by Northwest was released on the Blu-ray Disc format in the United States on November 3, 2009, by Warner Bros. with a 1080p VC-1 encoding. This release is a special 50th-anniversary edition, restored and remastered from original VistaVision elements. A DVD edition was also released.</p><br/><h3>Reception</h3><h4>Box office</h4><p>In its opening in Chicago, it grossed $46,000 in its first week and $35,000 the second week. The film grossed $209,000 in its opening week at Radio City Music Hall, setting a record opening week at the theater, as well as its record non-holiday week gross, and went on to gross a record $404,056 in two weeks. Its opening at the Music Hall saw it become the number one film at the US box office, where it remained for its seven weeks at the Music Hall. By the end of August, it had grossed $2,568,000 from 139 engagements.</p><p>According to MGM records, the film earned theatrical rentals of $5,740,000 in the United States and Canada and $4.1 million elsewhere, resulting in a profit of $837,000.</p><h4>Critical reception</h4><p>North by Northwest holds a \"Certified Fresh\" 97% rating on the review aggregator Rotten Tomatoes, based on 113 reviews, with an average rating of 9.3/10. The site states the critical consensus as: \"Gripping, suspenseful and visually iconic, this late-period Hitchcock classic laid the groundwork for countless action thrillers to follow.\" On Metacritic, it has a score of 98 out of 100, based on reviews from 16 critics, indicating \"universal acclaim\". In 1998, Time Out conducted a poll, and North by Northwest was voted the 12th-greatest film of all time. The Village Voice ranked North by Northwest at No. 49 in its \"Top 250 Best Films of the Century\" list in 1999, based on a poll of critics. Entertainment Weekly voted it the 44th-greatest film of all time in 1999. The film ranks at No. 98 in Empire's list of the 500 Greatest Films of All Time. The Writers Guild of America ranked the screenplay No. 21 on its list of 101 Greatest Screenplays ever written. It is ranked the 40th-greatest American film by the American Film Institute. The film was voted at No. 28 on the list of \"100 Greatest Films\" by the prominent French magazine Cahiers du cinéma in 2008. In the British Film Institute's 2012 Sight & Sound polls of the greatest films ever made, North by Northwest was ranked 53rd among critics; and in the 2022 polls, the film was ranked 45th among critics. In 2010, The Guardian ranked it as the second-best action and war film of all time. North by Northwest was ranked 13th in BBC's 2015 list of the 100 greatest American films. In 2022, Time Out named North by Northwest the greatest thriller film ever made.</p><p>Time called the film \"smoothly troweled and thoroughly entertaining\". A. H. Weiler of The New York Times made it a \"Critic's Pick\" and said it was the \"year's most scenic, intriguing and merriest chase\"; he also complimented the two leads:</p><blockquote>Cary Grant, a veteran member of the Hitchcock acting varsity, was never more at home than in this role of the advertising-man-on-the-lam. He handles the grimaces, the surprised look, the quick smile, ... and all the derring-do with professional aplomb and grace, In casting Eva Marie Saint as his romantic vis-à-vis, Mr. Hitchcock has plumbed some talents not shown by the actress heretofore. Although she is seemingly a hard, designing type, she also emerges both the sweet heroine and a glamorous charmer.</blockquote><p>Film critic Charles Champlin saw the film as an \"anthology of typical Hitchcockian situations\" and was particularly taken by the scene and suspense in which Grant's character avoids death when attacked by a crop-dusting plane in the cornfields, which he believed was representative of Hitchcock's finest work. Sight & Sound critic Penelope Houston called it \"the purest piece of entertainment filmmaking\".</p><p>The London edition of Time Out, reviewing the film nearly a half-century after its initial release, commented:</p><blockquote>Fifty years on, you could say that Hitchcock's sleek, wry, paranoid thriller caught the zeitgeist perfectly: Cold War shadiness, secret agents of power, urbane modernism, the ant-like bustle of city life, and a hint of dread behind the sharp suits of affluence. Cary Grant's Roger Thornhill, the film's sharply dressed ad exec who is sucked into a vortex of mistaken identity, certainly wouldn't be out of place in Mad Men. But there's nothing dated about this perfect storm of talent, from Hitchcock and Grant to writer Ernest Lehman (Sweet Smell of Success), co-stars James Mason and Eva Marie Saint, composer Bernard Herrmann and even designer Saul Bass, whose opening-credits sequence still manages to send a shiver down the spine.</blockquote><p>Author and journalist Nick Clooney praised Lehman's original story and sophisticated dialogue, calling the film \"certainly Alfred Hitchcock's most stylish thriller, if not his best\".</p><h4>Awards</h4><p>North by Northwest was nominated for three Academy Awards—Best Film Editing (George Tomasini), Best Art Direction – Set Decoration, Color (William A. Horning, Robert F. Boyle, Merrill Pye, Henry Grace and Frank R. McKelvy), and Best Original Screenplay (Ernest Lehman)—at the 32nd Academy Awards ceremony. Two of the three awards went instead to Ben-Hur, and the other went to Pillow Talk. The film—and Lehman specifically—also won a 1960 Edgar Award for Best Motion Picture Screenplay. Hitchcock received his second Silver Shell for Best Director award at the San Sebastián International Film Festival. (He was also awarded the Silver Shell the year before for Vertigo.)</p><p>In 1995, North by Northwest was selected for preservation in the National Film Registry by the United States Library of Congress as being \"culturally, historically, or aesthetically significant.\" In June 2008, the American Film Institute revealed its \"10 Top 10\"—the best 10 films in 10 \"classic\" American film genres—after polling over 1,500 people from the creative community. North by Northwest was acknowledged as the seventh-best film in the mystery genre. It was also listed as No. 40 in AFI's 100 Years...100 Movies, No. 4 in AFI's 100 Years...100 Thrills, and No. 55 in AFI's 100 Years...100 Movies (10th Anniversary Edition).</p><br/><h3>Themes and motifs</h3><p>Hitchcock planned the film as a change of pace after his dark romantic thriller Vertigo a year earlier. In his book-length interview Hitchcock/Truffaut (1967) with François Truffaut, Hitchcock said that he wanted to do \"something fun, light-hearted, and generally free of the symbolism permeating his other movies.\" Writer Ernest Lehman has also mocked those who look for symbolism in the film. Despite its popular appeal, the film is considered to be a masterpiece for its themes of deception, mistaken identity, and moral relativism in the Cold War era.</p><p>The title North by Northwest is a subject of debate. Many have seen it as having been taken from a line (\"I am but mad north-north-west: when the wind is southerly I know a hawk from a handsaw\") in Hamlet, a work also concerned with the shifty nature of reality. Hitchcock noted, in an interview with Peter Bogdanovich in 1963: \"It's a fantasy. The whole film is epitomized in the title—there is no such thing as north-by-northwest on the compass.\" (\"Northwest by north\", however, is one of 32 points of the compass.) Lehman states that he used a working title for the film of In a Northwesterly Direction because the film's action was to begin in New York and climax in Alaska. Then the head of the story department at MGM suggested North by Northwest, but this was still to be a working title. Other titles were considered, including The Man on Lincoln's Nose, but North by Northwest was kept because, according to Lehman, \"We never did find a title.\" The Northwest Airlines reference in the film plays on the title.</p><p>The film's plot involves a \"MacGuffin\"—a term popularized by Hitchcock—which is a physical object that everyone in the film is chasing, but which has no deep relationship to the plot. Late in North by Northwest, it emerges that the spies are attempting to smuggle microfilm containing government secrets out of the country. They have been trying to kill Thornhill, whom they believe to be the agent on their trail, \"George Kaplan\".</p><p>North by Northwest has been referred to as \"the first James Bond film\" because of its splashily colorful settings, secret agents, and an elegant, daring, wisecracking leading man opposite a sinister yet strangely charming villain. The crop-duster scene inspired the helicopter chase in From Russia with Love.</p><p>The film's final shot—that of the train speeding into a tunnel during a romantic embrace onboard—is a famous bit of self-conscious Freudian symbolism reflecting Hitchcock's mischievous sense of humor. In the book Hitchcock/Truffaut (pp. 107–108), Hitchcock called it a \"phallic symbol ... probably one of the most impudent shots I ever made\".</p><br/><h3>Influences</h3><p>The film was very influential on the James Bond movies and subsequent action-thriller films, as well as the TV series The Man from U.N.C.L.E., where Leo G. Carroll played the same sort of role as the head of a top secret intelligence agency. The film's title is reported to have been the influence for the name of the popular annual live-music festival South by Southwest in Austin, Texas, started in 1987, with the name idea coming from Louis Black, editor and co-founder of the local alternative weekly The Austin Chronicle, as a play on the Hitchcock film title.</p><p>The third episode of the Doctor Who serial \"The Deadly Assassin\" (1976) includes an homage to North by Northwest, when the Doctor, who like Hitchcock's hero is falsely accused of a politically motivated murder, is attacked by gunfire from a biplane piloted by one of his enemy's henchmen.</p><p>The 2010 Spanish dark comedy film The Last Circus pays visual homage to the Mount Rushmore scene in its climactic scene atop a controversial Francoist monument.</p><br/><h3>Adaptations</h3><p>North by Northwest was adapted as a stage play by Carolyn Burns. The adaptation premiered at the Melbourne Theatre Company in 2015.</p><br/>"
  },
  "errorMessage": ""
}