{
  "imDbId": "tt0381681",
  "title": "Before Sunset",
  "fullTitle": "Before Sunset (2004)",
  "type": "Movie",
  "year": "2004",
  "items": [
    {
      "username": "ivko",
      "userUrl": "https://www.imdb.com/user/ur2510120",
      "reviewLink": "https://www.imdb.com/review/rw0977367",
      "warningSpoilers": false,
      "date": "13 December 2004",
      "rate": "10",
      "helpful": "648 out of 706 found this helpful.",
      "title": "The only problem...",
      "content": "...is that it ends. This is a fantastic film. It joins the handful of movies where I think I liked the sequel even more than the original, although I liked 'Before Sunrise' as well. Where Sunrise captured the immediacy and urgency of perfect youthful love, Sunset reflects beautifully on the aftermath of that perfection. I remember a line that says \"nothing that is complete breathes\", and I think that is what we see in this film. A perfect connection with another human is a blessing and a curse; having experienced perfection a part of us stops breathing, unable or unwilling to mar the perfection of that memory.The dialogue is amazing, the acting is spot-on; this is a great film. In some ways it felt more like reading a great novel than watching a movie, in that I really felt like I knew the characters and was sad the movie had to end. Kind of like saying goodbye to an old friend. If you are an action movie kind of person, skip this flick because it will bore you to tears. If, on the other hand, you like good dialogue, well formed characters, and aren't quite jaded enough to have given up completely on the idea of true love, don't miss this film."
    },
    {
      "username": "film-critic",
      "userUrl": "https://www.imdb.com/user/ur1601212",
      "reviewLink": "https://www.imdb.com/review/rw0964926",
      "warningSpoilers": true,
      "date": "20 November 2004",
      "rate": "10",
      "helpful": "308 out of 353 found this helpful.",
      "title": "I'm designed to feel slightly dissatisfied!",
      "content": "I will be the first to announce that I was not a huge fan of the original film. While I thought that it was interesting to see as well as an untapped concept in Hollywood, I felt that the characters were too forced coupled with a very amateurish and repetitive moments. It was an average film that seemed to be lacking bits of the human element. It needed something more. At the time I couldn't put my finger on it, but after seeing Before Sunset, I could see what it was. Maturity. This may sound strange, but I felt that Jesse and Celine were too perfect in the first film. They lacked connectiveness to the average person. I couldn't see myself in this situation. Perhaps if I would have seen the original film in 1995 instead of a couple of years ago, it would have been closer, but I just couldn't capture the moment. In Before Sunset, I feel head over feet for both Jesse and Celine.They seemed to have grown and experienced a life that was all their own. They seemed more passionate, more powerful, and especially more human. From their first meeting in the bookstore until the finale in Celine's apartment, I was fully immersed in their conversation. I wanted to know everything I could about both of them, and I did. I loved hearing about Celine's passion for the environment, and Jesse's distraught marriage. It brought these two characters out of the screen and into our lives. Whether it was a scripted story or if Hawke and Delpy were playing off each other, it worked. I witnessed in this film two people who were made for each other. It was more obvious in this film than in the prior outing.What made this film work on such a higher level than the first were the actors. They have grown and emerged as two important commodities in the Hollywood community. This is probably Hawke's greatest performance in years. His relaxed actions made us feel relaxed around him, yet quietly pushing for him to be closer to Celine. His pushy sexual advances seemed less forced and instead more like honest love. He looked and felt like a man that has been dreaming of this encounter all his life, and it finally happened. You could see the excitement in his eyes to see Delpy again. It was more than just acting, he put so much heart into this performance that it was clearly displayed for all to see. The same goes for Delpy. At the beginning of this film, I didn't like her character. She seemed rough and rigid around the edges, constantly giving off that feeling that she was harboring a secret that she didn't want Hawke to know. As her character grew in this film, I understood why. She had a different life after the encounter than Hawke did. While he still longed for Celine in his heart, he did move on. She longed for Jesse in her heart, and to this day could not find anyone to replace his purity. I loved Celine much more in the sequel because she kept us guessing. Did she remember their night together? Did she really loose her grandmother, or did she just not show up that day in Vienna? Was the song just for Jesse? So many questions left me wanting more and more and more.Finally, I would like to say that Linklater is growing with his films, and this was a crowning achievement for him. He powerfully and delicately built a sequel that was for superior than the original. He continued with a similar format as the first, but gave us stronger characters and another beautiful city. The language in this film is intense. Listen to the words that come from Ethan and Julie, they embody so much of our culture and our lives. There were moments when I felt they were speaking thoughts directly from my mind. Everything in this film was connected and worked to the fullest extent of cinematic possibility.Overall, this was a brilliant film. Linklater captured the essence of these two heart-struck people and proved that it could be filmed. This is one of the ultimate love stories that will remain on your minds far after the film is over. The intimate final lines will continually reverberate as the best ever in a movie. This was a huge step up from the original, and is one of the best films of the year. If you were not a fan of the Before Sunset, I suggest that you check this out. It is a mature film that explores the power of love in a way that no other Hollywood film could. I would not be surprised if we saw the title of this film in the Oscar celebration this year. Check out this film to hear social commentary of our lives, fall in love, and especially to see the beauty of Paris.Grade: ***** out of *****"
    },
    {
      "username": "Superunknovvn",
      "userUrl": "https://www.imdb.com/user/ur1390493",
      "reviewLink": "https://www.imdb.com/review/rw0932941",
      "warningSpoilers": false,
      "date": "19 June 2004",
      "rate": "8",
      "helpful": "181 out of 206 found this helpful.",
      "title": "Linklater, Delpy & Hawke make an impossible sequel work (including minor SPOILERS)",
      "content": "\"Before Sunrise\" was one of the most beautiful independent love stories of the 90's. Part of its appeal came from the open ending. We didn't know how the lives of these two young people would continue and what would become of them. The whole movie was like a snapshot that left the rest to our imagination. A sequel to such a story seemed to be unnecessary, but apparently director Richard Linklater himself couldn't stop thinking about these two intriguing characters and had to envision their lives after this one fateful day in Vienna.Here it is now, the most unlikely sequel I have ever seen, \"Before Sunset\" - made not for money but for pure artistic purpose only. Much of the magic of part one could have been destroyed, but somehow Linklater and his two main actors managed to pull it off. \"Before Sunset\" takes place nine years after Jesse and Celine first met and as soon as the movie starts you feel like you meet old friends you haven't seen in a long time. You know these people and immediately feel at home with them. I was afraid that \"Before Sunset\" might give answers to questions that shouldn't be answered in the first place. If \"Before Sunrise\" was a dream that two young people had, then this movie could only be the rude awakening, the confrontation with reality. And somehow it is just that. It's a bit disillusioning to hear that all did not turn out as well as one might have imagined. We learn that Jesse and Celine are not particularly happy in their lives and that they are not really the romantic persons they used to be nine years ago. The soothing thing to see, however, is that they are still here. They both have passed their 30th birthday, they have jobs and their future is more or less decided, but they're still longing for passion in their lives and as soon as they meet each other, it's there again. They might have given up a lot of their dreams and beliefs but one thing remains true: their feelings for each other. While they're talking it's like they turn back time and become the young, hopeful people they once were again. I'm getting a bit carried away, but that's the beauty of these two movies, \"Sunrise\" and \"Sunset\". The story sucks you in and you're not able to stop thinking about it for a long while.Another thing \"Before Sunset\" did, it made me reflect on my own life. How have I changed in the past nine years? What has become of my dreams? Obviously, I have gotten more cynical, because at times I was irritated by Celine's talk about environmental problems and her emotional outbursts. It took me way longer than last time to \"bond\" with her character this time around.Anyway, the performances by Hawke and Delpy are wonderful once again. Their acting is as natural as can be, and thinking of Hawke's recent divorce in real life you wonder how much of his character in the movie is based on his own personal experiences.Unfortunately, the movie is over way too soon. After about an hour you have already arrived at the final scene - a scene that is just amazing. It makes you hope that somehow everything will work out for Jesse and Celine and that maybe they will stay together this time. As part one, \"Before Sunset\" doesn't have a definite ending, though.It's sure nice to see that apparently Linklater cares about Jesse and Celine as much as I do and made such a good sequel. He could probably even make a third part. \"Before Sunset\" has convinced me that it could work."
    },
    {
      "username": "Chris Knipp",
      "userUrl": "https://www.imdb.com/user/ur1501216",
      "reviewLink": "https://www.imdb.com/review/rw0932989",
      "warningSpoilers": true,
      "date": "30 July 2004",
      "rate": "",
      "helpful": "100 out of 118 found this helpful.",
      "title": "Suave sequel: a new genre is born",
      "content": "\"Before Sunset\" is one of those movies that look superficial, romantic, weepy, crowd-pleasing, but really is original, smart, analytical, and challenging. It stands by itself but is richer seen in relation to \"Before Sunrise,\" made nine years earlier, of which it is the sequel, and besides that it's richer and subtler than the original. The characters and the actors are older, more experienced and more sophisticated. It's got a documentary element, reminiscent of Michael Apted's wonderful \"7 Up,\" \"14 Up,\" series. Julie Delpy and Ethan Hawke, who also stared in \"Before Sunrise,\" don't have to pretend to be nine years older in this sequel; they are. They're only thirty-three now, but Hawke has the ravaged gauntness his breakup with Uma Thurman seems to have imposed on him. Delpy is more mature, less angelic, more businesslike, but still beautiful. \"Before Sunset\" is a leaner film than \"Before Sunrise.\" It's real-time, and without frills. Venues or backgrounds are simpler. Jesse and Céline largely just walk and talk. Hawke and Delpy are more accomplished actors; less self-conscious people. The talk flows more effortlessly. The continuity of the scenes is a seamless tour de fource almost as if this were all a single take like Sokorov's \"Russian Ark.\" There isn't flirting or a developing attraction, a growing physical intimacy, as in \"Before Sunset,\" because Jesse and Céline spend most of the film talking about that earlier meeting and how it has haunted them and dominated their lives. Gradually it comes out (particularly during the car ride that leads to where Céline lives) that her current relationship is limited and his marriage is largely sexless, redeemed only by his adoration of his four-year-old son. She pretends not to remember that they made love that night in Vienna nine years before. Maybe that means their sudden passion never really was consummated, because their affinity wasn't something one night's sex could fulfill. The premise is this: Jesse has published a novel that's a bestseller in the US and he's doing a signing in Paris. (Hawke's real life identity fits here, since he's published several books.) Suddenly as he's coming to the end of his talk, Céline appears outside the window of the bookstore (which is one every American in Paris knows: Shakespeare & Company). He's supposed to go to the airport in a couple of hours, but his bags are packed and a car is ready, and he and Céline agree to go and talk. She leads him to a café called Le Pure. (This is real time, but not real space: the places where they go are far apart.) Then they take a boat ride on the Seine; finally they get in the car and wind up at Céline's apartment which turns out to be a lovely enclave where her neighbors are together outside having a party.A movie in real time consisting mostly of conversation is impossible to summarize: it would take twenty pages. But it does emerge that both still think about each other a lot; that meeting nine years before has remained important. The flame still burns bright. Jesse did go back to Vienna six months later in the station to meet Céline as they'd promised, but her grandmother was buried on that day and she couldn't be there. Later he says that perhaps his dream of romantic love was shattered forever by her failure to appear. They rue the fact that they didn't exchange addresses or phone numbers. There's little touching or kissing but there doesn't have to be. It's obvious that this is a climactic reunion for both of them and the attraction is as strong as ever, probably stronger  except that there are obstacles. They're not young and free any more. They have lives, commitments, involvements. . . What will happen? As the film ends, its obvious Jessie is quite happily going to miss his plane. But while Linklater & Company keep us guessing, the partial answer that comes is quite charming. \"Before Sunset\" is a superb sequel. It's touching but surprisingly unsentimental. And it's as graceful a piece of film-making as you could ever see, with the gracefulness of art that conceals artifice. Richard Linklater is one of the most interesting younger American directors. His work is authentic and personal, but has real range, from the slacker movies through the romantic encounters of Delpy and Hawke and the tight theatrical drama \"Tape\" to the inspired philosophical musings and fresh use of animation of \"Waking Life,\" and Hawke has been involved in four of Linklater's movies. Linklater and Hawke are soulmates and brothers, and Delpy is the other essential collaborator in the \"Sunset\"/\"Sunrise\" sequence, because she too is a writer and wrote her own dialogue and the chemistry between Hawke and Delpy is too obvious to mention. It's obvious also the audience would like another sequel, and so would the actors. It's only a question of when. The inventive Richard Linklater has created a new genre: the real time sequel."
    },
    {
      "username": "Bob Pr.",
      "userUrl": "https://www.imdb.com/user/ur0460091",
      "reviewLink": "https://www.imdb.com/review/rw0933011",
      "warningSpoilers": false,
      "date": "14 August 2004",
      "rate": "10",
      "helpful": "147 out of 171 found this helpful.",
      "title": "Wow! Satisfying at so many levels",
      "content": "I had not seen the prequel to this although my date had and she filled me in on many details. While the experience of this film would be enriched by having seen the preceding film first, it certainly stands satisfactorily alone.In many ways, this reminded me very much of one of my most favorite movies of all time, \"My Dinner with André,\" in which just 2 characters talking comprised the whole movie. In that movie, the friends had been close, drifted apart, and then had a brief reunion at a dinner at which they caught up with what the other had been doing. The two principals, André Gregory and Wallace Shawn, played themselves and each represented one side of a dialectic, say the side of romanticism vs. a conventional reality. \"Before Sunset\" is parallel in many ways.At one level we have a romantic story -- two people who'd briefly been lovers nine years before and lost touch meet again. They spend an afternoon together. Will they try to fulfill what they'd started? At another level, we have the charm of conversation and exploration, of reminiscing, of gradually feeling out and discovery of how much do I have in common with this person now? -- where has this person been? -- what are they capable of now? -- how much freedom of choice do I have, does this other person have -- to make decisions? Etc.While Celine and Jesse have a capacity for relating and talking, they also have somewhat opposite ways of viewing the world and relationships -- Celine is more cynical and reserved; Jesse is more open to settling for the \"not-perfect-but-good-enough.\"There are possibly a few people who have not had the personal experiences that at least somewhat relate to the premise in this film -- a relationship in which one wonders, \"what would have happened if I'd pursued that relation?\" but probably most people have. And the other dilemma, of meeting again that someone but by now being involved in relationships of responsibility -- my family, my children, my present life. What would it do to them if I were to pursue my own happiness at the expense of them? Can I do that? Can I value the chance of my own happiness above theirs? Etc.The film, fortunately, gives us no answers to these essential questions but it does pose them in a way that makes us consider them.Delpy and Hawke are given screenwriter credits and I feel sure that they must've contributed a great deal to the feeling of seamless, natural dialogue.GREAT movie. No movie satisfies everyone, of course, but at the time I wrote this, slightly over 50% of the voters gave it a 10/10. For those of us in that group, it's a great film."
    },
    {
      "username": "preppy-3",
      "userUrl": "https://www.imdb.com/user/ur0463200",
      "reviewLink": "https://www.imdb.com/review/rw0932966",
      "warningSpoilers": false,
      "date": "16 July 2004",
      "rate": "10",
      "helpful": "146 out of 190 found this helpful.",
      "title": "Just great",
      "content": "A sequel to the 1995 film \"Before Sunrise\". Jesse (Ethan Hawke) and Celine (Julie Delpy) meet 9 years after their initial meeting. They've changed--originally they were in their 20s and full of idealism. Now they're in their 30s--and their lives have changed in ways they didn't predict. Like the first movie they walk around Paris this time and talk about love, life, reality, what might have been--and it's all fascinating. Like the first film this is basically a character study and (like the first) just incredible. It's like catching up with old friends after 9 years apart! They've aged a lot--Hawke looks TERRIBLE but Delpy looks OK--and life has thrown both a few hard knocks but hearing how they survived and what they went through is just incredible. This is NOT for everybody (four people walked out when I went to see it) but, for people who can deal with nonstop talk for 80 minutes it is just great. Every single line rings true and is delivered full force by Hawke and Delpy. The acting varies--Hawke is good (but he smiles WAY too much)--Delpy is just superb all the way through. This is easily one of the best films of 2004. Highly recommended."
    },
    {
      "username": "FilmBuff77",
      "userUrl": "https://www.imdb.com/user/ur1215639",
      "reviewLink": "https://www.imdb.com/review/rw0964639",
      "warningSpoilers": true,
      "date": "19 November 2004",
      "rate": "10",
      "helpful": "461 out of 495 found this helpful.",
      "title": "Absolutely fantastic. Easily the best film of the year.",
      "content": "There are four scenes that I will treasure forever:1) The ferry ride, and the subtle ways you can tell they're both heartbroken, lonely, frustrated and angry. The way she discusses the \"little details\" that compose a person, and what she missed most in him. \"Like I remember the way your beard has a bit of red it in, and how the sun was making it glow that...that morning right before you left.\"2) The scene in the van, where they finally unburden themselves. One of the most emotionally raw and honest interplays I've seen on celluloid. The way she reaches out to touch him, but holds back at the last second. Much different in tone from the way Hawke reached out to brush her hair aside in the first film.3) Celine's song. So simple yet so endearing. The way her voice fades to a whisper as she sings, \"My heart will be yours until I die.\"4) The ending, which is in all ways **PERFECT**. The slow fade, the utter charm of her Nina Simone impression, the ambiguity, and the wonderful look in his eyes as his youth, hope and happiness come rushing back to him while watching Celine dancing and singing (foreshadowed in the opening scene). This is, perhaps, one of the ten best endings in the cinema.Hawke and Delpy are sublime, of course. This film requires incredibly subtle acting, and these are Oscar worthy performances that will not be recognized because they are not showy. Much of this film, like life, is acted with the eyes. Witness how Hawke stares at Delpy as she discusses her failed relationships on the ferry, or the sadness and longing in Delpy's eyes as she sings her love song. As in the first film, the chemistry between them is indelible. My candidate for best on-screen couple ever.This film is better than the first, because it provides a more unique perspective. In Sunset, we see the sobering effects of age and disappointment etched in their faces and clouding their lives. There is more at stake here, for they are nine years older, have made their share of mistakes, feel imprisoned by responsibilities, and must confront their shortcomings and problems. It's comforting to believe that hope and love will prevail in their case."
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw1034992",
      "warningSpoilers": true,
      "date": "7 March 2005",
      "rate": "9",
      "helpful": "48 out of 59 found this helpful.",
      "title": "\"I know what you meant for me that day. I just want another try, I just want another night\"",
      "content": "This film is one of my favorites from last year, along with \"Sideways\" and \"Eternal Sunshine of the Spotless Mind\". Is it just a coincidence that three best films of the year all deal with ability to connect with other people, with meeting one's true love and losing it, with memories that will not go away, and with possibilities of second chances?\"Before Sunset\" is one of the best sequels ever made but it stays on its own. It is so perfect, so simple, so sublime, so clever, so romantic, and so moving that it makes me happy to know that the films like that exist and there is hope that as characters get older we may witness their next meeting and conversations.Who would think that watching two people talking may be that fascinating? That's what the power of great dialog does. As much as I loved dialogs in \"Before Sunrise\", in this film they are even better - the characters are older, wiser, more interesting, I'd say. Ten years is a long period in a human life - our characters are still young and attractive but they've gone through losses and changes, disappointments and some sad realizations about life. It is privilege of the young age to hope that \"there'll be many people with whom you'll connect with. Later in life, you realize it only happens a few times.\" If we only knew how to cherish and keep these unique and unforgettable connections. If we only knew that they were unique...Julie Delpy along with Ethan Hawke, contributed to the screenplay; and there is no doubt that their contributions made the characters interacting on the screen absolutely honest and believable.Julie Delpy gives one of the best performances of the year as Celine. She is amazing in showing mystery, charm, disappointments, dreams, and the dark sides of this woman. Her singing and Nina Simone's impersonation in the last scenes of \"Before Sunset\" are among the most charming and seductive ever - oh yes, baby you will miss that plane. 9.5/10"
    },
    {
      "username": "FreddyShoop",
      "userUrl": "https://www.imdb.com/user/ur3929468",
      "reviewLink": "https://www.imdb.com/review/rw0970134",
      "warningSpoilers": false,
      "date": "30 November 2004",
      "rate": "10",
      "helpful": "54 out of 65 found this helpful.",
      "title": "A great movie, and a nice break from most Hollywood trash.",
      "content": "This is simply one of the best movies I've seen, with very few qualifications. Maybe I should say that this is one of the best \"simple\" movies I've seen. Perhaps it is a bit like cooking, use fresh and quality ingredients and you can make something great without a lot of unnecessary stuff. Unfortunately, Hollywood just doesn't seem to have the ambition to make these type of movies anymore.In any event, this is one of the few sequels that matches the intensity and integrity of the original. First, it has many simple, yet stylish and honest shots. Perhaps the Scorcese shot is used too much (i.e. following the actors on a long walk without cutting a la Goodfellas kitchen scene), but I don't think so because it makes sense in the context of the movie. Second, many of the shots have interesting emotive effect. For instance, towards the end of the movie, after these \"lovers\" are fighting the clock (because Ethan Hawke's character needs to catch a flight) and are cruising down the river, they are so engrossed in their conversation and the fact that they are trying to get so much out of the last few minutes they don't notice their ride is coming to an end. However, we the viewer can see what the characters either don't see or don't want to see, that the boat is crossing over the river to its destination and the departure no one wants to deal with. The viewer is given a wonderful sense of dread as the bank approaches in the background, because we know what is going to happen when the ride ends, and like the characters, we don't want it to end either. Even if the film borrows heavily from other great movies (e.g. My Dinner with Andre) it is independent of those influences.Julie Delpy and Ethan Hawke were great per usual. Making the dialogue ring true is difficult, but they pull it off. As before, they completely capture the nature of the intimate and friendly conversational style of friends or lovers that is normally edited out of most movies. When people talk, things are not always sequential or rationale, and unlike most movies this movie doesn't try and correct that. Not for a moment does the audience find themselves thinking that this is some sort of charade and no one would ever talk like that. The dialogue is intelligent and insightful, but that is because the characters are intelligent and have a knack for being brutally honest with their thoughts and feelings.This is movie excellence, and I'm glad some film makers are still trying to make art. Despite the romantic themes this isn't a date flick, so be prepare to deal with the difficult and often unresolved issues of love and relationships that arise."
    },
    {
      "username": "Chrysanthepop",
      "userUrl": "https://www.imdb.com/user/ur3872142",
      "reviewLink": "https://www.imdb.com/review/rw2021470",
      "warningSpoilers": false,
      "date": "11 February 2009",
      "rate": "",
      "helpful": "24 out of 30 found this helpful.",
      "title": "'Baby, you are gonna miss that plane...I know'",
      "content": "Very few films can match up to the original first movies. 'Before Sunset' is one such. This time Linklater has co-written the screenplay with Hawke and Delpy. Jesse and Celine reunite after nine years. Things haven't turned out the way they had expected but here's a chance. 'Before Sunset' follows pretty much the same style as 'Before Sunrise'. This one too is very much a conversational piece. Here the score is used to a minimal. During the end we hear some songs including Julie Delpy's beautiful 'My Waltz'. The cinematography consists of more long shots than in the first movie. The film has a very mature feel to it. Of course Jesse and Celine are a lot more mature today and less idealistic than they were nine years ago. Linklater beautifully captures the love between these two characters as he walks us through the streets of Paris. Here too the dialogues are just as magical as in the first movie except that this time there's a melancholy about the things that could have been, the years that they could have been together. Both Ethan Hawke and Julie Delpy are terrific as ever and they deserve additional praise for the writing and Ms. Delpy for her singing. Overall, 'Before Sunset' has everything that made 'Before Sunrise' a phenomenal movie experience."
    },
    {
      "username": "Pantdino",
      "userUrl": "https://www.imdb.com/user/ur4245653",
      "reviewLink": "https://www.imdb.com/review/rw0977014",
      "warningSpoilers": true,
      "date": "7 December 2004",
      "rate": "",
      "helpful": "97 out of 107 found this helpful.",
      "title": "issues Before Sunset brings up",
      "content": "I suspect that Before Sunset is getting such mixed reviews because it will mean very little to viewers who have not reached the stage of life portrayed in it. To my mind, this is not a romance. Rather, it's a very frank look at how we end up with life partners.For that reason, it is an important film for twentysomethings to see and is a gift to them from Linklater, Hawke, and Delpy. SPOILERS FOLLOW: The death of Celine's grandmother brings up two issues: the role of chance and that of our responsibilities to ourselves. Jesse knows Celine missed their planned meeting in Vienna because her grandmother died. But this does not prevent his pained question on the boat, something to the effect of 'Why weren't you there?' He is referring to rotten luck, the dark side of fate that is capable of robbing us of what we most desire. What were the odds that her grandmother would have died within those few days? Tiny. But it led to them not meeting again.However, Celine still chose to not meet Jesse. Yes, her family may not have understood had she skipped the funeral. But life is for the living, and her grandmother wouldn't have known if she hadn't been there. So Celine must take responsibility for the fact that their lives didn't include each other.Another precious dialog occurs when they discuss why they didn't exchange addresses or phone numbers nine years ago. Celine says it was because they were young and overly optimistic and assumed they'd meet plenty of people with whom they would connect equally well. Are the twentysomethings listening?Celine expresses a problem many face when she explains why she prefers to have a boyfriend who is away much of the time: she feels suffocated when he is around too long. But she has been depressed since reading Jesse's book because she misses the kind of total intimacy they briefly shared and realizes there is no easy solution to this dilemma. One cannot simultaneously be intimate and distant, and all relationships involve finding a compromise.Jesse's marriage is an ordinary one. He married his wife because she was smart, pretty, and pregnant, and marriage is about commitment. But even on his way to the church he was thinking of Celine. Are we being warned of the danger of staying in a mediocre relationship? He says his wife and he are now like coworkers in a preschool, a description that will ring true with many viewers. So is the lesson that you should throw caution to the wind and sacrifice all for someone who thrills your heart for a day? Before Sunset offers no such easy solution, as Jesse and Celine admit they may have discovered they didn't like each other after all. As I see it, the primary role of film is to give voice to emotions and aspects of life we all know to be true but are not acceptable to discuss in polite society. In this regard Before Sunset excels. I can't help but think that when Linklater, Hawke, and Delpy decided to do this brief film it was not about profit at all-they simply had some things they thought people should hear, and this was their gift to the public."
    },
    {
      "username": "its_a_mee_mario",
      "userUrl": "https://www.imdb.com/user/ur4382050",
      "reviewLink": "https://www.imdb.com/review/rw0976233",
      "warningSpoilers": false,
      "date": "11 December 2004",
      "rate": "10",
      "helpful": "328 out of 367 found this helpful.",
      "title": "So Little Time, So Much Love.",
      "content": "Before Sunset is one of those movies, you either love, or you hate.Personally, I loved it.Now, I recommend watching \"Before Sunrise\" first, however it isn't necessary. Before Sunset does a good job of reviewing what had happened, therefore if you decide to watch it Before watching \"Sunrise\" you have nothing to worry about.Some scenes are extremely well done. The characters are picture perfect, and the movie itself, is breathtaking. The aura of the movie is so spectacular, that it will inspire young directors out there, to pick up their video cameras are start filming.An 80 minute movie, about two lovable characters and what they have to say, may sound boring. But the way it's done in Before Sunset, will sweep this impression right off your feet. Julie and Ethan play two of the most honest and true characters I have ever seen, they are known as Jesse and Celine. And while much of the credit must go to the characters themselves, you musn't forget the actor and actress who played them.Julie is perfect as Celine. The young french actress is so natural in front of the camera. Definitely, has potential. Ethan is also very very honest, he seems so comfortable character that that you forget your watching a movie, and not a home-made video.Both play with such honest expression, and such trueness, that they are so natural, Before Sunset becomes no longer a movie. It feels as if you are eavesdropping on two extremely developed people. It's such an intimate environment, that you never want to leave.Before Sunset... 9.901/10*****"
    },
    {
      "username": "johnnyb-16",
      "userUrl": "https://www.imdb.com/user/ur4166431",
      "reviewLink": "https://www.imdb.com/review/rw0954082",
      "warningSpoilers": false,
      "date": "29 October 2004",
      "rate": "10",
      "helpful": "255 out of 280 found this helpful.",
      "title": "How do you make a sequel to \"Before Sunrise\"? This is how.",
      "content": "I'd been longing to see this one as I'd always thought 'Before Sunrise' was one of the most honest, most real films I'd ever seen, but at the same time I held off seeing the sequel from fear of disappointment. For all of you in the same position, fear not ; Linklater, Hawke and Delphy (for it has surely been a joint effort and labour of love for all three) have done us and themselves proud. I've just seen the film and despite being male and 38 I feel like Roberta Flack must have felt when she penned 'Killing me Softly' after hearing Don McLean sing 'Vincent' in concert; this is - once again - just so close to what it's all about. You want technicalities? The acting, superb; Hawke and Delphy slip right back into their characters, their mannerisms, their sometimes gauche repartee, the way they seem to fence around each other, seeming to go in for the kill then feigning, drawing back Exquisite. And then the details, the echoes of the first film in the settings but now with a world-weariness, an autumnal note and yet with still that fundamental freshness and optimism that revives the memories of Sunrise's youthfulness and reminds us, as our heroes discuss, that though time changes people, there remains an unchanging core. Just see it; this is about as good as it gets, folks."
    },
    {
      "username": "The_Void",
      "userUrl": "https://www.imdb.com/user/ur2248099",
      "reviewLink": "https://www.imdb.com/review/rw1018538",
      "warningSpoilers": false,
      "date": "11 February 2005",
      "rate": "10",
      "helpful": "17 out of 23 found this helpful.",
      "title": "A magnificent follow up to a beautiful picture",
      "content": "This follow-up to the cult hit 'Before Sunrise' takes place nine years after the original masterpiece. The wisdom of making a sequel nine years later to a film that doesn't really need a sequel is questionable. Or at least it would be, if this film was anything less than brilliant. While the first film depicted an energetic and youthful romance between two young people; this sequel is a more mature tale, all about reflection. Before Sunset plays out almost as a tribute to the one night that the characters spent together in the first film, and analyses what happened to them after those events. The film takes in themes of missed opportunity and the effect that time has on character. Just like the first film, time is of the essence again and we follow Jesse, now the writer of an international best seller who meets up with Celine again, this time in Paris. The two take to the streets and begin discussing their relationship with each other, with their respective partners and how life has been treating them in the last nine years.The tone of this film is very different to 'Before Sunrise' as the characters are now older and wiser and have lost some of that reckless stupidity that made the first film such a delight to observe. The anecdotes that the characters profess to one another takes a worldlier stance, and this allows the characters to revel in their newfound maturity and also develop even further than they did in the original film. In my opinion, this sequel is not as great as the first film. It comes down to personal preference in the end, but I preferred the higher energy exchanges of Before Sunrise to the more mature reflections in this film. That's not to say that Celine and Jesse have completely matured into well-rounded adults, on the contrary in fact; the immature irresponsibility that the characters once revelled in still remains, and this comes to a head at the film's conclusion.Amazingly enough, in spite of the fact that it's nine years since their first outing as Celine and Jesse; both Ethan Hawke and Julie Deply have managed to step back into their characters, and have once again achieved a glove-like fit. Julie Deply in particular is incredible this time round. There's a scene in the back of a car when she explodes into a mass of insecurity that is one of the most heartfelt showings of releasing pent-up emotions that I've ever seen on screen. Paris provides a new setting for the characters to walk around, and it makes for one that is even better than Vienna was in Before Sunrise. The city is beautiful, that's elementary, but it's the way that Linklater captures the life going on around our characters that really makes it special. While the two talk, people chat away on mobile phones, walk their dogs and drive their cars and the life around the two characters creates a wonderful atmosphere.You really need to see Before Sunrise before seeing this follow up in order to appreciate the tones and the beauty of this picture. Of course, you need to see both films anyway as they're essential viewing; so what are you waiting for?"
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw2759387",
      "warningSpoilers": false,
      "date": "25 February 2013",
      "rate": "",
      "helpful": "12 out of 16 found this helpful.",
      "title": "Manages to Improve on a Very Good First Film",
      "content": "Before Sunset (2004) **** (out of 4) Nine years after the events in BEFORE SUNRISE, Jesse (Ethan Hawke) returns to Paris to do a Q&A for his book, which just happens to talk about that night in Vienna. Celine (Julie Delpy) winds up coming to the event and afterwards they've got a little over a hour to catch up on what's been going on in their lives. BEFORE SUNSET is clearly an improvement over the already very good first film but what makes this one here even more special is that it captures the magic of the first picture while at the same time taking a look at the darker issues in their lives. As with the first film, it's really amazing how director Richard Linklater managed to make this feel like a documentary that you're watching and not once do you see Hawke and Delpy as actors but instead you see them as real people that are simply being filmed by an invisible camera. The film manages to really make you believe that the story is picking up nine years after the previous film and I must say that the explanation for the ending of the first movie is extremely well handled. I'm not going to spoil what happened six months later but it's perfectly handled here. Even the first appearance of Celine is extremely beautiful and perfectly done. I really liked the dialogue here but I also like the fact that it once again comes across so real. I say this because I viewed this at the same age of the characters and I thought their feelings on growing older are so true. Hearing Hawke talk about his son and relationships is just something one can connect with and like the previous film the situations make you feel as if you could be the one doing the talking or at least you know someone like these characters. Once again both Hawke and Delpy are terrific together and really fit back well in their characters. There are more emotional or dramatic moments here and both handle them well. Linklater, who wrote the script with the two stars, keeps the film moving at a great pace and really manages to make one fall for the situation that these two are in."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1620946",
      "warningSpoilers": false,
      "date": "19 March 2007",
      "rate": "10",
      "helpful": "17 out of 25 found this helpful.",
      "title": "what fascinates and interests almost works to annoy the viewer, but Linklater does come closest to Bergman here",
      "content": "Before Sunset provides us not so much a sequel as a continuing development in the lives of these characters, who are starting to embody the neuroses and deeply-held desires that neither want to admit to until it's at the most crucial and tragic of times. Jessie (Ethan Hawke) and Celine (Julie Delpy), who first met on a train in Vienna in 1994, meet again nine years later as Jessie has published a book which is based on that night they had together. He's in Paris, they meet again, and before he has his plane back to the states they talk, and talk, and talk, and unlike in the first film there are no asides. It's just two people who at first talk about concerns that came up for them the first time, if a bit more pragmatic: what it is to have concern over the environment, to live in the USA, to be involved enough in a relationship. There's even a moment of deja-vu where they talk about reincarnation and a respect for faith if not an embracing of it. But then we also get to see something much deeper in each side that Jessie's book and mere re-appearance for Celine brings out a memory that has become hyper-realized, and vice-versa.Like Bergman's films, in particular Scenes From a Marriage (if not as wholly successful because of its short running time here), Linklater provides us with characters who have no problem saying what's on their mind, in the immediate sense anyway. Jessie is even more digging-in with his cynicism and wit, and Celine with her opinions on the world at large, family and on past relationships. But when it comes to getting at their connection, it's very fragile and even unattainable because of each side's own flaws. If the two of them were happy, to be certain, there would be no movie, but it's the characters' connection to that one night in Vienna, and the second meeting that was supposed to take place six months later and never happened, and how it cripples their own romantic lives that becomes very interesting yet shallow at the same time. Perhaps this is the best way to show how smart, functional people become dysfunctional in their respective social stratospheres- Jessie is married and with a kid, but not very happy in it, and Celine is in bad relationship after bad relationship- but the singular, glossy night of years past has become a bitter shrine of sorts amid their respective neuroses.Linklater shares that incredible Bergman quality of cutting past the already sharp intellect to the emotional matter of the parties, even if it doesn't feel totally complete; I want to see how their story might end, however obvious it should and probably would be. One knows this could never work in real life, aside from the practical-side of it all, yet it's this that makes it all the more watchable. This, plus the incredibly natural repore of the actors, as Hawke and Delpy, as to be expected, seem like they aren't even on a script but are being filmed by Linklater on the fly as his camera captures the given-luscious scapes of Paris in afternoon, and the dialog is still as fresh and inviting as ever. If it lacks anything from the first it's an greater sense of the possibility for romance, since this time the sense of romance is entangled in loss and questions that Celine and Jessie want answered, however conscious they want them answered or not. But as with the first one, I still loved being around these two, who can expound a mouthful on a subject that we all might talk about, almost shockingly similar (one bit I liked a lot was Celine's story of going to Poland), and then in a slight cloud of romanticism.It ends ambiguous, maybe too ambiguous, as I found myself saying 'huh, what', but it ties into what Jessie tells the reporters at the press conference early in the film: one may take away something from this tale, or someone else another, but there it is, clear as day. Before Sunset is a straightforward romance, and proud of it, being both straightforward in romantic connection and as sharp as anything you'd never find in your local cineplex. One of Linklater's best."
    },
    {
      "username": "agoodfella",
      "userUrl": "https://www.imdb.com/user/ur1447156",
      "reviewLink": "https://www.imdb.com/review/rw0983226",
      "warningSpoilers": true,
      "date": "22 December 2004",
      "rate": "",
      "helpful": "35 out of 43 found this helpful.",
      "title": "A Beautiful Sunset",
      "content": "The first question I had before seeing Sunset (in fact ever since I heard that Sunset was coming) was: \"Why?\"... Why mess with Sunrise given that it was such a great stand alone film... Would they live up to answering the \"what ifs?\" would the chemistry still be there? etc. etc. ... needless to say, I think the answer is a resounding \"yes\".The film picks up nine years after Jesse (Ethan Hawke) and Celine's (Julie Delpy) magical chance encounter in Vienna. This time around we find them in Paris where Jesse is wrapping up a European roadshow to promote his newly published bestseller about (what else?) that one special night. We find them now older (and Ethan looks a bit more worse for wear than Julie), more experienced, more cynical with hearts that have hardened a bit over time in spite of -- or perhaps due to -- the whimsical possibilities of that fateful night nine years prior.From the outset of the film, the director does a sublime job of drawing the viewer in with long easy takes as Jesse and Celine embark on a stroll from the bookstore to the café - almost seems as if the first exchange is captured by one long uninterrupted take with no cuts (though there are a couple). They ease into their exchange very comfortably. The questions and dialogue have the same, familiar natural feel and tone, and Hawke and Delpy both do an incredible job slipping into their earlier roles - the chemistry has not been lost. The playful sarcasm, the sexual tension, the flirting, the wit, the insecurities. All there.You can sense the longing that Jesse has (has always had) for Celine from the get-go. In fact, my take even from Sunrise was that Jesse's attraction to Celine was always more stronger - almost as if he \"needed\" her. His vulnerability and ability to \"put it all out there\" - things that guys, in general, have such a hard time doing.The film moves on to the boat which echoes the scene from Sunrise where Jesse convinces her to take a ride with him. The journey symbolizes a trip to the past where Celine realizes that Jesse's life isn't the picture perfect life that she imagined (i.e. the successful author, the wife and the kid). She almost seems to want to know  needs to have - the affirmation that Jesse still carries a torch for her, even though she (and the viewer) already should KNOW this - because WE know Jesse and his book about \"that one night\" is a tangible testament to that (this is the one plot element which I found a bit annoying).The car scene is symbolic as well as they are in an enclosed space and need to deal with the things that are bottled up inside - claustrophobic yet no escaping it. They both reveal what they have both always wanted to hear from one another (albeit in different ways and different circumstances), that they have both been truly alone since they last left each other that fateful night in Vienna. The raw emotion, the honesty - incredible moments.The culmination is the walk up the staircase to Celine's apartment, in relative silence, some things are better left unsaid  the choices, the reasoning, left unsaid. And then Celine's song which symbolizes a lot of things and demonstrates how much Jesse has meant to her even though she has a difficult time saying it in words.Nine years later, they have of course grown into full adults with all the superficial trappings that come with that  a career, relationships, etc. But, still, they are both drawn to \"that one fateful night\", and the redemption for both people is that it was just as meaningful to each person as it was for the other, for different reasons and for similar ones. The bittersweet anguish of having those memories and carrying that emotional baggage over that time echoes even deeper in the respective voids in their lives; as Celine puts it: \"memories are a wonderful thing if you don't have to deal with the past\"  almost sums up that anguish. When people are young they worry about not becoming \"someone\" - but as they get older - everyone worries about not being WITH \"someone\".In Sunset, they are both vindicated in realizing that they did not \"waste\" the last nine years living as damaged emotionless zombies - that their chance encounter was a truly magical moment changing both of their lives, that they were both \"incomplete\" without each other (ok, cue the corny music), that they really do \"complete each other\". The true beauty of Sunset is that it allows them to indulge in the luxury of what many people do not get: the opportunity for a second chance, at best, and, at worst, an opportunity for some measure of closure.And so it fittingly ends with the viewer pondering yet again \"what happens now?\" which, in retrospect, is a much more hopeful and infinitely more enviable question to answer than: \"what if?\" In sum, a wonderful film - bravo.***1/2 out of ****"
    },
    {
      "username": "sm22281-1",
      "userUrl": "https://www.imdb.com/user/ur3333968",
      "reviewLink": "https://www.imdb.com/review/rw0933030",
      "warningSpoilers": false,
      "date": "12 September 2004",
      "rate": "10",
      "helpful": "77 out of 99 found this helpful.",
      "title": "Lovely romantic story",
      "content": "I saw this movie with my husband. He is usually a die-hard fan of action thrillers, special effects and horror movies but he allows me to coax him into seeing a really thoughtful movie every once in a while. So this was my choice for the evening. Neither one of us had seen the first movie, \"Before Sunrise\", although I knew of it by reputation. Well, my husband absolutely loved the movie! He sat up and became totally engrossed in the story, frequently patting my hand at intervals as he identified with the the characters in the story. He forgot about the dreadful uncomfortable movie seat. He let up a big sigh of disappointment when the credits came up... Personally, I grew up in Paris, France, I came to the US for graduate studies and I had an environmental protection career for 20 years. So I could strongly identify with Celine, a young woman of French origin with a patina of US graduate schooling and a career in environmental protection work. Her vulnerability shines through her modern chatterbox exterior. The acting is absolutely superb, with the intimate extended conversations drawing us into the characters' lives. Certainly, this movie can stand on its own. For Jesse and Celine, the opportunity to pick up once more their romantic relationship is here! A smart couple would not let the moment pass. I doubt that they would just have a quick passionate affair... I think that the characters already know how lonely their souls can be without true love and commitment and they are emotionally ready to grasp this chance of a lifetime. They have been around long enough to know how rare their type of romantic feeling and connection can be. They will cherish their unique relationship and nurture it forever. My husband and I agreed that the movie could only be watched by couples of \"a certain age\", rather than young couples still searching for life's meaning. Only people who have lived through the throes of searching for a lifelong mate, then living through the disappointments and joys of struggling relationships, can recognize and appreciate what true love is and how important it is to go with one's heart and seize the moment. I am 48 years old and have a wonderful romantic relationship with my husband. We are each other's first and only love. Even so, we have worked very hard to keep our marriage alive and mutually passionate. Over the past 25-30 years, both of us have noticed that satisfying relationships are very difficult once people hit their thirties and forties. We have noticed that many older couples never work out their differences and end up bitter and disappointed with life. Many acquaintances of our generation are divorced or still single, never having experienced the sweetness and stability of a true romantic and committed relationship. Romance can be found all the time, from fleeting moments to short-term relationships. One sees it all over the place nowadays, in TV shows and movies, as well as in most modern relationships. However, I would like to emphasize the lasting contentment that a loving commitment brings to one's soul. This is a rare and unique blessing that is missing from too many relationships nowadays, and I find this immeasurably sad. This is a classic movie (excellent story line and top of the line acting) which goes into my list of top romantic movies of all times."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0985673",
      "warningSpoilers": false,
      "date": "26 December 2004",
      "rate": "",
      "helpful": "41 out of 69 found this helpful.",
      "title": "Reluctance",
      "content": "Finally, Linklater does something with his talent. His strength in the past has been to shape the form of his films to match the subject. At least that's been true when the subject is the tentativeness of existence.He's done well enough in the past, but since his characters were aimless his projects inherited a meaninglessness. Where he tried to impart introspective layers with \"Waking Life,\" those layers were trite threads of fake profundities. Well, never mind. Artists aren't required to be particularly smart  even about who they are and what they do.What is required is the ability to discover and convey something that resonates. Usually in films the resonance is a sort of nervous recognition in the characters and situation. Sometimes, the manner of the film, the nature of the world presented is enough to engage. Such is the value of Kieslowski  and how he managed Delpy.This film tries something different, something commonly attempted and almost never achieved: the direct drama of discovery between two people. This hosts the construction not in any story or setting or even situation, though they are all employed in the service of the goals. Instead, the whole thing revolves around the tentative motions toward intimacy between two people.Why this usually fails is because of the unwieldy mechanics. In order to seem real (most reviewers call this film \"veristic\") the dramatic projection has to be hyperreal, but not so much that it appears artificial. So how do you dramatically amplify lightly probing intimacies? Its all in the most subtle hesitations of the actors, in that range beyond what \"really\" might happen and them forthrightly telling us what's happening.The construction is perfect: all movies are about other movies. In this case, we literally have the last chapter of the romance as a movie with movie values and memories. More, those are romantically captured in a book that one character carries from the previous movie into this one. Thus, all their discussion, all their reluctances are about having the present film approach the previous one.I'm astonished at the perfection of the idea, as astonished as I am about how well the two, especially Delpy, support it. This is delicate stuff.Ted's Evaluation -- 3 of 3: Worth watching."
    },
    {
      "username": "senocardeira",
      "userUrl": "https://www.imdb.com/user/ur3927157",
      "reviewLink": "https://www.imdb.com/review/rw1022757",
      "warningSpoilers": false,
      "date": "17 February 2005",
      "rate": "10",
      "helpful": "133 out of 164 found this helpful.",
      "title": "Pure Delight",
      "content": "Nine years on Celine and Jessie meet in Paris not entirely by destiny or sheer force of circumstance... Nine years ago I loved Before Sunrise so much! And identified with it even though I was far from home not out of choice - and a war of the kind that bothered Celine in Bosnia was going on in my own country... But I was young. I was 24, actually, very romantic and innocent. Now I Know how things work a little better. The world, relationships. But I'm still plunging into causes for their own sake. And I'm still a reasonably normal person. Just like the characters in this film. Paris has never looked simpler in its casual elegance. Dialogue has never seemed more natural. A script never touched real life like this one so effortlessly. I'm in love with these characters - and with the ending... This is how European Cinema used to be - and Hollywood, too for that matter. Naturally real and magical in the details."
    },
    {
      "username": "cricketbat",
      "userUrl": "https://www.imdb.com/user/ur6201371",
      "reviewLink": "https://www.imdb.com/review/rw4379578",
      "warningSpoilers": false,
      "date": "5 October 2018",
      "rate": "4",
      "helpful": "12 out of 17 found this helpful.",
      "title": "I appreciate it, but I don't like it.",
      "content": "I appreciate Before Sunset for what it is -- a sequel made nine years after the original, set nine years after the original, starring the same two actors and following up on the events of the original -- but that does not mean I liked it. The conversations in this film were not as interesting as the first movie, and I did not want the two romantic leads to get together anymore. Yes, it feels very realistic, but who wants to listen to people complain about their life and their marriage for over an hour?"
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw1736712",
      "warningSpoilers": true,
      "date": "26 September 2007",
      "rate": "",
      "helpful": "14 out of 21 found this helpful.",
      "title": "Linklater brings a tired genre to life",
      "content": "This is a review of \"Before Sunrise\", \"Before Sunset\" and \"Before Midnight\", three films by Richard Linklater.Released in 1995, \"Before Sunrise\" finds Ethan Hawke playing Jesse, a young American who's travelling across Europe. On his way to Vienna he meets Celine (Julie Delpy), a young woman on her way to Paris. From the moment out duo lock eyes, they're drawn to each other. They share a meal, savouring the conversation more than the food, and when they arrive in Vienna, Jesse persuades Celine to keep him company wandering the streets. Thus begins an unforgettable screen romance.Like most of Linklater's films, \"Sunrise\" is both dialogue heavy and boils down to a series of discussions or ruminations on life. Our duo talk incessantly, touching upon subjects which range from language and reincarnation to sexuality and religion. Some of it is cringe-worthy, but for the most part Linklater's dialogue rings true. His banter is casual, natural, lacking in artifice, and we at times feel like voyeurs, eavesdropping on the sort of \"unimportant\" dialogue that most films shy away from. But the film is sexy as well. Celine and Jesse crackle with electricity, and Linklater pays great attention to subtle shifts in body language. There's one scene where Jesse restrains himself from brushing away a stray lock of Celine's hair, and another wonderful moment in a music listening booth where our duo nervously avoid eye contact. Elsewhere the film indulges in numerous long takes, Linklater's gliding camera making the most of some gorgeous European locales, as he dips in and out of romantic alcoves and cosy spaces. Linklater's long steadicam takes lend \"Sunrise\" an \"energy\" and intimacy that many of his other films lack.Released in 2004, Linklater's \"Before Sunset\" is a sequel to 1995's \"Sunrise\". Equally good, the film joins Celine and Jesse almost a decade later. Speaking to both the mind and the heart, it finds our duo still obsessed with the night they first met, fell in love, and then somehow forgot to exchange contact details. This time around Jesse is in Paris to promote his new novel (he's now a writer), and it is Celine who tracks him down. Our couple then embark on an 80 minute chat, the fact that Jesse must leave on an afternoon flight tightening like a hang-man's noose around their conversations. The film then ends with a sequence which packs an emotional wallop.Hawke and Delpy so easily re-inhabit these characters, you have to wonder how much they're based on themselves. Simultaneously dopey and intelligent, their conversations cycle through hilarity, pain and misery. On the downside, both characters are obviously the product of an artist; Celine and Jesse are a couple of unashamed hipsters.Once again Linklater utilises long, uninterrupted takes, his gliding camera capturing vast chunks of banter and beautiful Parisian architecture. A few gentle flashbacks give glimpses of the original film, but we don't really need them. This story stands on its own as a second chance to change fate. And as is typical of Linklater, cinema's chief slacker-philosopher (at least since the death of Hal Ashby), Linklater has his film abstract several profound human truths, placing them all in a series of dialogue driven vignettes. In a way, Jesse and Celine become everyone and everything, and at times represent more than themselves.Released in 2013, \"Before Mightnight\" finds Jesse and Celine as a committed couple. It's been eight years since we last saw them, and they now live in Europe with twin girls of their own. Unsurprisingly, the puppy-love of the first two films has given way to middle-aged weariness, parental responsibility, regret and pragmatism. The film is somber, even pessimistic, and Linklater cleverly introduces several other characters who represent life and love at different stages, most notably an elderly writer and a young couple who conjure up images of Jesse and Celine's own romance almost two decades ago. If \"Sunset\" and \"Sunrise\" evoked Eric Rohmer, or Bresson's \"Four Nights of a Dreamer\", \"Midnight\" recalls Abbas Kiarostami and Rossellini's \"Journey to Italy\". Again dialogue heavy, and again reliant on long takes, the film is colder, harder and more caustic than its predecessors. Our couple now view everything with scepticism, and seem to exude a mood of grim acceptance and resignation. Most of the film's conversation revolve around death, career disappointment, transience, the world ending or technology's negative influences; the rants of a dying generation. At one point Celine even paints a dour image of the future, in which society devolves into \"masturbation and death\". In another, Jesse insists that man is \"99 percent automated\" and even goes so far as to denounce the concept of self-hood. Other conversations mock the way men measure accomplishments, and of course male obsessions with the phallus. Elsewhere an elderly man explains that couples are \"never one person, always two\". Unlike its predecessors, \"Midnight's\" sceptical of romance and even soul-mates. After a wholly contrived argument in a hotel room, a forced segment designed to set up another sequel, our duo then seem to patch up their problems, though you nevertheless suspect that this relationship has reached its end. Expect a possible fourth film to be about loneliness or separation.Early in \"Midnight\", Jesse reveals to us characters in his new book. One character lives in an unending, wondrous present (the very behaviour that brought Jesse and Celine together so many years ago), whilst another views all experiences as being \"second hand\". Jesse later talks about being \"lost in perception\" and introduces us to the \"patron saint of eyesight\", moments which exemplify Celie and Jesse's own anxieties. Both fantasise about different, better futures, and both are unsure of their partner's role in this desired world.9/10 – Whilst as good as its predecessor, \"Sunset\" may rub people the wrong way. The idea of successful, self-reflexive, middle class hipsters incessantly yapping, will prove irksome to many."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw1128756",
      "warningSpoilers": false,
      "date": "17 July 2005",
      "rate": "9",
      "helpful": "14 out of 22 found this helpful.",
      "title": "Delightful Sequel of One of the Most Beautiful Romances I Have Ever Seen",
      "content": "In Paris, the American writer Jesse Howard (Ethan Hawk) is in the end of an European tour, promoting his novel about the one night stand he had with a young French woman nine years ago. In the end of the debates in a bookstore, he finds Celine (Julie Delpy) in the audience, who works in an environmental organization, and they leave the place to drink coffee and talk to each other before Jesse goes to the airport. Along the moments together, they realize that they are still in love for each other.\"Before Sunset\" is a delightful sequel of \"Before Sunrise\", which is in my opinion one of the most beautiful romances I have ever seen. The screenplay was written by Ethan Hawk, Julie Delpy and Richard Linklater and it is fantastic, with wonderful dialogs. It is also amazing the natural performances of Ethan Hawk and Julie Delpy, who intensively live the characters of Jesse and Celine. It is impossible not liking this movie! The simple song sang by Julie Delpy is a great complement to this lovely fairy tale. My vote is nine.Title (Brazil): \"Antes do Pôr-do-Sol\" (\"Before Sunset\")"
    },
    {
      "username": "Arcturus1980",
      "userUrl": "https://www.imdb.com/user/ur3860711",
      "reviewLink": "https://www.imdb.com/review/rw2818070",
      "warningSpoilers": true,
      "date": "22 June 2013",
      "rate": "10",
      "helpful": "12 out of 15 found this helpful.",
      "title": "Actual intoxicating perfection",
      "content": "Rarely do I watch Before Sunrise and not Before Sunset immediately afterward. The former insists on the latter. A divine three hours indeed. The original writing team of Richard Linklater and Kim Krizan get the story credit, while Julie Delpy and Ethan Hawke join Linklater for the screenplay credit. Way cool to have actors writing their own sublime dialogue. Funding difficulties forced a minimalism congruous with the naturalism. Done in real time with long continuous shots, there is not a hint of contrivance. I really cannot imagine an improvement of any significance on this superlative film.Before Sunrise ended with Ethan Hawke's Jesse and Julie Delpy's Celine looking forward to their reunion six months later in Vienna. Jesse borrowed $2,000 from his dad to be there, while Celine had to attend her dearly beloved grandmother's funeral that same day. Talk about bad timing, but this was the very grandmother whom Celine visited that summer of '94 and, therefore, without whom they would never have met. Then again, we could say the same for Jesse's ex-girlfriend in Madrid. The absurd interplay of fate and chance intrigues and frustrates. They could have been in different cars on that train from Budapest.The film and trilogy being quintessentially character-driven, Linklater's directorial touch is just right. He begins Before Sunset with a reverse-order montage that beautifully calls to mind that of the first film's ending. Jesse, by this time unhappily married with a 4-year-old son, is in a Parisian bookstore wrapping up a tour for his novel This Time, based on their brief encounter nine years previous. Never connecting with someone so deeply theretofore nor in the intervening nine years, the struggle to remain alive to his experience of their time together compelled him to immortalize that night by sharing with the world the significance of really meeting someone. More than that, he knew it was his best shot at seeing Celine again. Celine, who is working for an environmental organization called Green Cross and in a relationship with an often-away war photojournalist, smiles at a wonder-struck Jesse as he is finishing his talk. So much to say and so little time (just over an hour) before Jesse is to leave for the airport.The years have naturally rendered them more worldly-wise this time around, as is reflected throughout their humorous, incisive dialogue, but having to revert back to a shared sense of hope and meaning is something of a paradox. There is truth to be found in the perceived naiveté of youth. Jesse, emotionally ravaged by their years apart, is torn between an undying love for Celine and the inertia of a loveless marriage, wherefrom his son Hank is the only saving grace. Celine by comparison is more of a closed book: harboring the guilt of missing their rendezvous, she had contentedly resigned herself to a life less delightful, but reading his novel awakened her to how hopelessly starved for meaning and excitement she has since been. Jadedly guarded, she keeps an emotional distance despite the undeniable sparks they again get one on one. How is married Jesse to help her after all? There is a very touching moment on the tourist boat where Celine is at her loquacious best--real salt of the earth stuff--and Jesse, having relived their night together over and over to write his book, is simply compelled to address their preposterous misconnection as the clock ticks away. This leads into ever more personal territory as they exchange sorrowful revelations in a cathartic purge of pent-up grief. Bantering again, Celine hugs him strongly--their first embrace since going their separate ways nine years before--and though playing it cool, she seems to know her waltz (Julie Delpy's wonderful \"A Waltz for a Night\") is about to do the trick. The clock be damned, Jesse selects Nina Simone's \"Just in Time\" to which Celine respectfully impersonates the iconic singer.Before Sunrise ended on a particularly sad note, so the uplifting nature of this subtly executed ending is all the more satisfying."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3528897",
      "warningSpoilers": false,
      "date": "20 August 2016",
      "rate": "8",
      "helpful": "5 out of 7 found this helpful.",
      "title": "sweet return",
      "content": "It's 9 years after the events of 'Before Sunrise'. American Jesse Wallace (Ethan Hawke) is in Paris on a book tour after writing about that night with Céline (Julie Delpy) in Vienna. He's coy to the reporters about that night. Céline shows up and they restart the conversation while he waits for his flight later that night. She reveals that she didn't make their planned meeting due to her grandmother's funeral. He reveals that he did return for the meeting. He's married with a son. She has a photojournalist boyfriend who is away. The conversation fluctuates between breezy and deeper material until personal truths start to be spilled.Richard Linklater has hit on something compelling by returning to the same characters years later. It's casual and improvisational-like. Hawke and Delpy still have the same chemistry but more adult. It's deeper. There is an addition to the material by being a sequel. It's more than repetition. It's a sweet return of old friends."
    }
  ],
  "errorMessage": ""
}