{
  "imDbId": "tt0381681",
  "title": "Before Sunset",
  "fullTitle": "Before Sunset (2004)",
  "type": "Movie",
  "year": "2004",
  "language": "en",
  "titleInLanguage": "Before Sunset",
  "url": "https://en.wikipedia.org/wiki/Before_Sunset",
  "plotShort": {
    "plainText": "Before Sunset is a 2004 American romantic drama film directed by Richard Linklater, who co-wrote the screenplay with Ethan Hawke and Julie Delpy, from a story by Linklater and Kim Krizan. The sequel to Before Sunrise (1995) and the second installment in the Before trilogy, Before Sunset follows Jesse (Hawke) and Céline (Delpy) as they reunite nine years later in Paris.\r\nLinklater, Krizan, Hawke and Delpy began developing a larger budget sequel after the release of Before Sunrise, but failed to secure funding. After a period of independent work, notably inspired by Hawke's divorce from Uma Thurman, the writers came together in 2003 and incorporated elements of their screenplays, as well as scenes written during development of Before Sunrise, to create the film's screenplay. Principal photography took place entirely in Paris, and the film is considered to take place in real time. Delpy also contributed original music to the film's soundtrack.\r\nBefore Sunset premiered at the Berlin International Film Festival on February 10, 2004, and was theatrically released in the United States on July 2, 2004. It grossed $16 million against a $2–2.7 million budget and received widespread critical acclaim, particularly for Linklater's direction, the performances and chemistry of its leads, and its screenplay. It received numerous accolades, being nominated for the Academy Award for Best Adapted Screenplay, and appeared on many publications' lists of the best films of the year, some even calling it one of the best of the decade. It was followed by a third film, Before Midnight, in 2013.",
    "html": "<p>Before Sunset is a 2004 American romantic drama film directed by Richard Linklater, who co-wrote the screenplay with Ethan Hawke and Julie Delpy, from a story by Linklater and Kim Krizan. The sequel to Before Sunrise (1995) and the second installment in the Before trilogy, Before Sunset follows Jesse (Hawke) and Céline (Delpy) as they reunite nine years later in Paris.</p><p>Linklater, Krizan, Hawke and Delpy began developing a larger budget sequel after the release of Before Sunrise, but failed to secure funding. After a period of independent work, notably inspired by Hawke's divorce from Uma Thurman, the writers came together in 2003 and incorporated elements of their screenplays, as well as scenes written during development of Before Sunrise, to create the film's screenplay. Principal photography took place entirely in Paris, and the film is considered to take place in real time. Delpy also contributed original music to the film's soundtrack.</p><p>Before Sunset premiered at the Berlin International Film Festival on February 10, 2004, and was theatrically released in the United States on July 2, 2004. It grossed $16 million against a $2–2.7 million budget and received widespread critical acclaim, particularly for Linklater's direction, the performances and chemistry of its leads, and its screenplay. It received numerous accolades, being nominated for the Academy Award for Best Adapted Screenplay, and appeared on many publications' lists of the best films of the year, some even calling it one of the best of the decade. It was followed by a third film, Before Midnight, in 2013.</p>"
  },
  "plotFull": {
    "plainText": "Before Sunset is a 2004 American romantic drama film directed by Richard Linklater, who co-wrote the screenplay with Ethan Hawke and Julie Delpy, from a story by Linklater and Kim Krizan. The sequel to Before Sunrise (1995) and the second installment in the Before trilogy, Before Sunset follows Jesse (Hawke) and Céline (Delpy) as they reunite nine years later in Paris.\r\nLinklater, Krizan, Hawke and Delpy began developing a larger budget sequel after the release of Before Sunrise, but failed to secure funding. After a period of independent work, notably inspired by Hawke's divorce from Uma Thurman, the writers came together in 2003 and incorporated elements of their screenplays, as well as scenes written during development of Before Sunrise, to create the film's screenplay. Principal photography took place entirely in Paris, and the film is considered to take place in real time. Delpy also contributed original music to the film's soundtrack.\r\nBefore Sunset premiered at the Berlin International Film Festival on February 10, 2004, and was theatrically released in the United States on July 2, 2004. It grossed $16 million against a $2–2.7 million budget and received widespread critical acclaim, particularly for Linklater's direction, the performances and chemistry of its leads, and its screenplay. It received numerous accolades, being nominated for the Academy Award for Best Adapted Screenplay, and appeared on many publications' lists of the best films of the year, some even calling it one of the best of the decade. It was followed by a third film, Before Midnight, in 2013.\r\nPlot\r\nNine years after meeting Céline in Vienna, Jesse has written a bestselling novel, This Time, based on their time together. During a book tour in Europe, he does a reading at Shakespeare and Company, where three journalists interview him: one is convinced the novel's characters meet again, another that they do not, and a third who wants them to but is doubtful that will occur. Céline also attends the reading.\r\nRequired to leave for the airport in an hour, Jesse and Céline use the time to roam Paris. Their conversations soon become deeply personal, and they passionately discuss work, politics and lament their failure to meet again in Vienna or exchange contact details. Céline informs she did not return as her grandmother died, and Jesse claims that he did not return either; after Céline asks him why he did not, he confesses that he did return.\r\nThey reveal how their lives have changed in the nine years apart: Jesse is married and has a son named Hank, while Céline has become an environmental activist and is in a relationship with a photojournalist. They each express dissatisfaction with their lives as they walk around Paris, and their old romantic feelings are slowly rekindled. Jesse says his novel was inspired by the hope of seeing Céline again, and she says that reading it caused painful memories.\r\nCéline and Jesse arrive at her apartment, even after continuous insistence that Jesse should not miss his flight. Jesse persuades her to play a waltz on her guitar, which she wrote about their encounter in Vienna. Jesse plays Nina Simone's \"Just in Time\" on her stereo, which Céline dances to as he watches, the pair acknowledging he will miss his flight.\r\nCast\r\nEthan Hawke as Jesse\r\nJulie Delpy as Céline\r\nVernon Dobtcheff as bookstore manager\r\nLouise Lemoine Torres as journalist #1\r\nRodolphe Pauly as journalist #2\r\nMariane Plasteig as waitress\r\nDiabolo as Philippe\r\nDenis Evrard as boat attendant\r\nAlbert Delpy (Julie Delpy's father) as man at grill\r\nMarie Pillet (Julie Delpy's mother) as woman in courtyard\r\nProduction\r\nAfter the filming of Before Sunrise, Linklater, Krizan, Hawke, and Delpy discussed making a sequel. Linklater considered a version to be filmed in four locations and with a much larger budget. When his proposal did not secure funding, he scaled back the concept of the movie. In a 2010 interview, Hawke said that the four had worked on several potential scripts over the years. As time passed and they did not secure funding, they adapted elements of the earlier scripts for Before Sunrise in their final draft of Before Sunset.\r\nLinklater described the process of completing the final version of the film as:\r\nWe sat in a room and worked together in about a two- or three-day period, worked out a very detailed outline of the whole film in this sort of real-time environment. And then, over the next year or so, we just started e-mailing each other and faxing. I was sort of a conduit – they would send me monologues and dialogues and scenes and ideas, and I was editing, compiling and writing. And that's how we came up with a script.\r\nHawke said, \"It's not like anybody was begging us to make a second film. We obviously did it because we wanted to.\"\r\nThe movie was filmed entirely on location in Paris. It opens inside the Shakespeare and Company bookstore on the Left Bank. Other locations include their walking through the Marais district of the 4th arrondissement, Le Pure Café in the 11th arrondissement, the Promenade Plantée park in the 12th arrondissement, on board a bateau mouche from Quai de la Tournelle to Quai Henri IV, the interior of a taxi, and finally \"Céline's apartment.\" Described in the film as located at 10 rue des Petites-Écuries, it was filmed in Cour de l'Étoile d'Or off rue du Faubourg St-Antoine.\r\nThe movie was filmed in 15 days, on a budget of about US$2–2.7 million. The film is noted for its use of the Steadicam for tracking shots and its use of long takes; the longest of the Steadicam takes lasts about 11 minutes. As the summer was one of the hottest on record, the cast and crew suffered along with the city residents, as temperatures exceeded 100 degrees F (38 °C) for most of the production.\r\nThe film is notable for essentially taking place in real time, i.e. the time elapsed in the story is the run time of the film. In the fast-changing temperate Paris climate, this created challenges for the cinematographer Lee Daniel to match the color and intensity of the skies and ambient light from scene to scene. The scenes were mostly shot in sequence, as they were still developing the screenplay. Producer Anne Walker-McBay worked with less time and less money than she had on Before Sunrise, but still brought the film in on time and on budget. The sequel was released nine years after Before Sunrise, the same amount of time that has lapsed in the plot since the events of the first film.\r\nThe film was released in the wake of Hawke's divorce from Uma Thurman. Some commentators drew parallels between Hawke's personal life and the character of Jesse in the film. Additional comment has noted that both Hawke and Delpy incorporated elements of their own lives into the screenplay. Delpy wrote two of the songs featured in the film, and a third by her was included in the closing credits and movie soundtrack.\r\nRelease\r\nBefore Sunset premiered at the Berlin International Film Festival in February 2004, and received a limited release in the United States on July 2, 2004.\r\nBox office\r\nIn its opening weekend, the film grossed $219,425 in 20 theaters in the United States, averaging $10,971 per theater. During its entire theatrical run, the film grossed $5.8 million in the United States and nearly $16 million worldwide.\r\nCritical reception\r\nOn Rotten Tomatoes Before Sunset holds an approval rating of 94% based on 177 reviews, with an average rating of 8.30/10. The site's critics consensus reads, \"Filled with engaging dialogue, Before Sunset is a witty, poignant romance, with natural chemistry between Hawke and Delpy.\" On Metacritic, the film has a weighted average score of 90 out of 100 based on 39 reviews from mainstream publications, indicating \"universal acclaim\". The film appeared on 28 critics' top 10 lists of the best films of 2004, and took the 27th spot on Metacritic's list of The Best-Reviewed Movies of the Decade (2000–09).\r\nIn comparing this film to its predecessor, American film critic Roger Ebert wrote, \"Before Sunrise was a remarkable celebration of the fascination of good dialogue. But Before Sunset is better, perhaps because the characters are older and wiser, perhaps because they have more to lose (or win), and perhaps because Hawke and Delpy wrote the dialogue themselves.\" In her review for the Los Angeles Times, Manohla Dargis lauded the film as a \"deeper, truer work of art than the first,\" and praised director Linklater for making a film that \"keeps faith with American cinema at its finest.\"\r\nReviewing the acting, Peter Travers of Rolling Stone observed, \"Hawke and Delpy find nuance, art and eroticism in words, spoken and unspoken. The actors shine.\" Philip French of The Observer wrote,\r\nBoth Hawke and Delpy are excellent and their performances have real depth. This time, too, they're doing more than appearing as fictional creations in a Richard Linklater film. They now share the writing credit with him and are clearly putting much of their experiences of the past decade into characters they have possessed and been possessed by.\r\nOn the merits of the script, A. O. Scott of The New York Times noted, it was \"sometimes maddening,\" but \"also enthralling, precisely because of its casual disregard for the usual imperatives of screenwriting.\" He elaborated,\r\nCan't they just say what they mean? Can you? Language, after all, is not just about points and meanings. It is a medium of communication, yes, but also of avoidance, misdirection, self-protection and plain confusion, all of which are among the themes of this movie, which captures a deep truth seldom acknowledged on screen or in books.\r\nIn the United Kingdom, the film was ranked the 110th-greatest movie of all time by a 2008 Empire poll. In 2010, the critics at The Guardian placed Before Sunrise/Before Sunset at number 3 in their list of the best romantic films of all time, and called the ending of Before Sunset \"one of the most tantalising and ingenious endings in all cinema.\"\r\nAs noted by Metacritic, the film appeared on the following critics' top 10 lists of 2004.\r\nAccolades\r\n2004 Boston Society of Film Critics Award – Best Film (2nd Place)\r\n2004 77th Academy Awards – Best Writing (Adapted Screenplay) for Richard Linklater, Julie Delpy, Ethan Hawke and Kim Krizan\r\n2004 Independent Spirit Award – Best Screenplay for Richard Linklater, July Delpy and Ethan Hawke\r\n2005 Writers Guild of America Award – Best Adapted Screenplay for Richard Linklater, Julie Delpy, Ethan Hawke and Kim Krizan\r\n2004 Berlin International Film Festival – Golden Bear\r\n2004 Gotham Awards – Best Film\r\nIn a 2016 BBC poll of 177 critics worldwide, Before Sunset was voted the 73rd best film since 2000. In 2019, The Guardian ranked the film 50th in its 100 best films of the 21st century list.\r\nSequel\r\nLinklater, Hawke, and Delpy all discussed the possibility of a sequel to Before Sunset. Hawke said he wanted to develop the relationship between Jesse and Céline, and said, \"I'll be shocked if we never make another one\".\r\nIn a video interview in November 2011, Hawke said that he, Delpy and Linklater \"have been talking a lot in the last six months... all three of us have been having similar feelings that we're kind of ready to revisit those characters... there's nine years between the first two movies... if we made the film next summer, it would be nine years again, so we started thinking that would be a good thing to do. So we're going to try and write it this year.\" In June 2012, Hawke confirmed that the sequel to Before Sunset would be filmed in summer 2012. In September 2012, it was announced the sequel, titled Before Midnight, had completed filming and would premiere at the Sundance Film Festival in January 2013. The film was released in May to widespread acclaim, and received an Academy Award nomination for Best Adapted Screenplay.",
    "html": "<p>Before Sunset is a 2004 American romantic drama film directed by Richard Linklater, who co-wrote the screenplay with Ethan Hawke and Julie Delpy, from a story by Linklater and Kim Krizan. The sequel to Before Sunrise (1995) and the second installment in the Before trilogy, Before Sunset follows Jesse (Hawke) and Céline (Delpy) as they reunite nine years later in Paris.</p><p>Linklater, Krizan, Hawke and Delpy began developing a larger budget sequel after the release of Before Sunrise, but failed to secure funding. After a period of independent work, notably inspired by Hawke's divorce from Uma Thurman, the writers came together in 2003 and incorporated elements of their screenplays, as well as scenes written during development of Before Sunrise, to create the film's screenplay. Principal photography took place entirely in Paris, and the film is considered to take place in real time. Delpy also contributed original music to the film's soundtrack.</p><p>Before Sunset premiered at the Berlin International Film Festival on February 10, 2004, and was theatrically released in the United States on July 2, 2004. It grossed $16 million against a $2–2.7 million budget and received widespread critical acclaim, particularly for Linklater's direction, the performances and chemistry of its leads, and its screenplay. It received numerous accolades, being nominated for the Academy Award for Best Adapted Screenplay, and appeared on many publications' lists of the best films of the year, some even calling it one of the best of the decade. It was followed by a third film, Before Midnight, in 2013.</p><br/><h3>Plot</h3><p>Nine years after meeting Céline in Vienna, Jesse has written a bestselling novel, This Time, based on their time together. During a book tour in Europe, he does a reading at Shakespeare and Company, where three journalists interview him: one is convinced the novel's characters meet again, another that they do not, and a third who wants them to but is doubtful that will occur. Céline also attends the reading.</p><p>Required to leave for the airport in an hour, Jesse and Céline use the time to roam Paris. Their conversations soon become deeply personal, and they passionately discuss work, politics and lament their failure to meet again in Vienna or exchange contact details. Céline informs she did not return as her grandmother died, and Jesse claims that he did not return either; after Céline asks him why he did not, he confesses that he did return.</p><p>They reveal how their lives have changed in the nine years apart: Jesse is married and has a son named Hank, while Céline has become an environmental activist and is in a relationship with a photojournalist. They each express dissatisfaction with their lives as they walk around Paris, and their old romantic feelings are slowly rekindled. Jesse says his novel was inspired by the hope of seeing Céline again, and she says that reading it caused painful memories.</p><p>Céline and Jesse arrive at her apartment, even after continuous insistence that Jesse should not miss his flight. Jesse persuades her to play a waltz on her guitar, which she wrote about their encounter in Vienna. Jesse plays Nina Simone's \"Just in Time\" on her stereo, which Céline dances to as he watches, the pair acknowledging he will miss his flight.</p><br/><h3>Cast</h3><ul><li>Ethan Hawke as Jesse</li><li>Julie Delpy as Céline</li><li>Vernon Dobtcheff as bookstore manager</li><li>Louise Lemoine Torres as journalist #1</li><li>Rodolphe Pauly as journalist #2</li><li>Mariane Plasteig as waitress</li><li>Diabolo as Philippe</li><li>Denis Evrard as boat attendant</li><li>Albert Delpy (Julie Delpy's father) as man at grill</li><li>Marie Pillet (Julie Delpy's mother) as woman in courtyard</li></ul><br/><h3>Production</h3><p>After the filming of Before Sunrise, Linklater, Krizan, Hawke, and Delpy discussed making a sequel. Linklater considered a version to be filmed in four locations and with a much larger budget. When his proposal did not secure funding, he scaled back the concept of the movie. In a 2010 interview, Hawke said that the four had worked on several potential scripts over the years. As time passed and they did not secure funding, they adapted elements of the earlier scripts for Before Sunrise in their final draft of Before Sunset.</p><p>Linklater described the process of completing the final version of the film as:</p><blockquote>We sat in a room and worked together in about a two- or three-day period, worked out a very detailed outline of the whole film in this sort of real-time environment. And then, over the next year or so, we just started e-mailing each other and faxing. I was sort of a conduit – they would send me monologues and dialogues and scenes and ideas, and I was editing, compiling and writing. And that's how we came up with a script.</blockquote><p>Hawke said, \"It's not like anybody was begging us to make a second film. We obviously did it because we wanted to.\"</p><p>The movie was filmed entirely on location in Paris. It opens inside the Shakespeare and Company bookstore on the Left Bank. Other locations include their walking through the Marais district of the 4th arrondissement, Le Pure Café in the 11th arrondissement, the Promenade Plantée park in the 12th arrondissement, on board a bateau mouche from Quai de la Tournelle to Quai Henri IV, the interior of a taxi, and finally \"Céline's apartment.\" Described in the film as located at 10 rue des Petites-Écuries, it was filmed in Cour de l'Étoile d'Or off rue du Faubourg St-Antoine.</p><p>The movie was filmed in 15 days, on a budget of about US$2–2.7 million. The film is noted for its use of the Steadicam for tracking shots and its use of long takes; the longest of the Steadicam takes lasts about 11 minutes. As the summer was one of the hottest on record, the cast and crew suffered along with the city residents, as temperatures exceeded 100 degrees F (38 °C) for most of the production.</p><p>The film is notable for essentially taking place in real time, i.e. the time elapsed in the story is the run time of the film. In the fast-changing temperate Paris climate, this created challenges for the cinematographer Lee Daniel to match the color and intensity of the skies and ambient light from scene to scene. The scenes were mostly shot in sequence, as they were still developing the screenplay. Producer Anne Walker-McBay worked with less time and less money than she had on Before Sunrise, but still brought the film in on time and on budget. The sequel was released nine years after Before Sunrise, the same amount of time that has lapsed in the plot since the events of the first film.</p><p>The film was released in the wake of Hawke's divorce from Uma Thurman. Some commentators drew parallels between Hawke's personal life and the character of Jesse in the film. Additional comment has noted that both Hawke and Delpy incorporated elements of their own lives into the screenplay. Delpy wrote two of the songs featured in the film, and a third by her was included in the closing credits and movie soundtrack.</p><br/><h3>Release</h3><p>Before Sunset premiered at the Berlin International Film Festival in February 2004, and received a limited release in the United States on July 2, 2004.</p><h4>Box office</h4><p>In its opening weekend, the film grossed $219,425 in 20 theaters in the United States, averaging $10,971 per theater. During its entire theatrical run, the film grossed $5.8 million in the United States and nearly $16 million worldwide.</p><h4>Critical reception</h4><p>On Rotten Tomatoes Before Sunset holds an approval rating of 94% based on 177 reviews, with an average rating of 8.30/10. The site's critics consensus reads, \"Filled with engaging dialogue, Before Sunset is a witty, poignant romance, with natural chemistry between Hawke and Delpy.\" On Metacritic, the film has a weighted average score of 90 out of 100 based on 39 reviews from mainstream publications, indicating \"universal acclaim\". The film appeared on 28 critics' top 10 lists of the best films of 2004, and took the 27th spot on Metacritic's list of The Best-Reviewed Movies of the Decade (2000–09).</p><p>In comparing this film to its predecessor, American film critic Roger Ebert wrote, \"Before Sunrise was a remarkable celebration of the fascination of good dialogue. But Before Sunset is better, perhaps because the characters are older and wiser, perhaps because they have more to lose (or win), and perhaps because Hawke and Delpy wrote the dialogue themselves.\" In her review for the Los Angeles Times, Manohla Dargis lauded the film as a \"deeper, truer work of art than the first,\" and praised director Linklater for making a film that \"keeps faith with American cinema at its finest.\"</p><p>Reviewing the acting, Peter Travers of Rolling Stone observed, \"Hawke and Delpy find nuance, art and eroticism in words, spoken and unspoken. The actors shine.\" Philip French of The Observer wrote,</p><blockquote>Both Hawke and Delpy are excellent and their performances have real depth. This time, too, they're doing more than appearing as fictional creations in a Richard Linklater film. They now share the writing credit with him and are clearly putting much of their experiences of the past decade into characters they have possessed and been possessed by.</blockquote><p>On the merits of the script, A. O. Scott of The New York Times noted, it was \"sometimes maddening,\" but \"also enthralling, precisely because of its casual disregard for the usual imperatives of screenwriting.\" He elaborated,</p><blockquote>Can't they just say what they mean? Can you? Language, after all, is not just about points and meanings. It is a medium of communication, yes, but also of avoidance, misdirection, self-protection and plain confusion, all of which are among the themes of this movie, which captures a deep truth seldom acknowledged on screen or in books.</blockquote><p>In the United Kingdom, the film was ranked the 110th-greatest movie of all time by a 2008 Empire poll. In 2010, the critics at The Guardian placed Before Sunrise/Before Sunset at number 3 in their list of the best romantic films of all time, and called the ending of Before Sunset \"one of the most tantalising and ingenious endings in all cinema.\"</p><p>As noted by Metacritic, the film appeared on the following critics' top 10 lists of 2004.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"width: 50%;text-align: left; vertical-align: top;\"><ul><li>1st – <span>Village Voice Film Poll</span> (94 film critics surveyed)</li><li>1st – Stephanie Zacharek, <i><span>Salon.com</span></i></li><li>1st – Marc Savlov, <i><span class=\"mw-redirect\">Austin Chronicle</span></i></li><li>2nd – <span>David Ansen</span>, <i><span>Newsweek</span></i></li><li>2nd – <span>Mick LaSalle</span>, <i><span>San Francisco Chronicle</span></i></li><li>2nd – Carla Meyer, <i>San Francisco Chronicle</i></li><li>3rd – <span>Ty Burr</span>, <i><span>The Boston Globe</span></i></li><li>3rd – Kimberley Jones, <i>Austin Chronicle</i></li><li>3rd – <span>James Berardinelli</span>, <i><span class=\"mw-redirect\">ReelViews</span></i></li><li>3rd – Charles Taylor, Salon.com</li><li>3rd – Dennis Lim, <i><span class=\"mw-redirect\">Village Voice</span></i></li><li>4th – <span>Manohla Dargis</span>, <i><span>The New York Times</span></i></li><li>4th – <span>Michael Atkinson</span>, <i>Village Voice</i></li><li>4th – <span>Michael Sragow</span>, <i><span>The Baltimore Sun</span></i></li></ul></td><td style=\"width: 50%;text-align: left; vertical-align: top;\"><ul><li>5th – Ruthe Stein, <i>San Francisco Chronicle</i></li><li>6th – Michael Wilmington, <i><span>Chicago Tribune</span></i></li><li>6th – <span>Owen Gleiberman</span>, <i><span>Entertainment Weekly</span></i></li><li>6th – Jack Mathews, <i><span>New York Daily News</span></i></li><li>6th – <span>J. Hoberman</span>, <i>Village Voice</i></li><li>7th – <span>Jonathan Rosenbaum</span>, <i><span>Chicago Reader</span></i></li><li>7th – Lawrence Toppman, <i><span>The Charlotte Observer</span></i></li><li>8th – Scott Foundas, <i><span>LA Weekly</span></i></li><li>9th – Claudia Puig, <i><span>USA Today</span></i></li><li>9th – Marjorie Baumgarten, <i>Austin Chronicle</i></li><li>No order specified – <span>Ella Taylor</span>, <i>LA Weekly</i></li><li>No order specified – Carina Chocano, <i>Los Angeles Times</i></li><li>No order specified – <span>Steven Rea</span>, <i><span>The Philadelphia Inquirer</span></i></li><li>No order specified – <span class=\"mw-redirect\">Shawn Anthony Levy</span>, <i><span class=\"mw-redirect\">Portland Oregonian</span></i></li></ul><p> </p></td></tr></tbody></table><h4>Accolades</h4><ul><li>2004 Boston Society of Film Critics Award – Best Film (2nd Place)</li></ul><ul><li>2004 77th Academy Awards – Best Writing (Adapted Screenplay) for Richard Linklater, Julie Delpy, Ethan Hawke and Kim Krizan</li><li>2004 Independent Spirit Award – Best Screenplay for Richard Linklater, July Delpy and Ethan Hawke</li><li>2005 Writers Guild of America Award – Best Adapted Screenplay for Richard Linklater, Julie Delpy, Ethan Hawke and Kim Krizan</li><li>2004 Berlin International Film Festival – Golden Bear</li><li>2004 Gotham Awards – Best Film</li></ul><p>In a 2016 BBC poll of 177 critics worldwide, Before Sunset was voted the 73rd best film since 2000. In 2019, The Guardian ranked the film 50th in its 100 best films of the 21st century list.</p><br/><h3>Sequel</h3><p>Linklater, Hawke, and Delpy all discussed the possibility of a sequel to Before Sunset. Hawke said he wanted to develop the relationship between Jesse and Céline, and said, \"I'll be shocked if we never make another one\".</p><p>In a video interview in November 2011, Hawke said that he, Delpy and Linklater \"have been talking a lot in the last six months... all three of us have been having similar feelings that we're kind of ready to revisit those characters... there's nine years between the first two movies... if we made the film next summer, it would be nine years again, so we started thinking that would be a good thing to do. So we're going to try and write it this year.\" In June 2012, Hawke confirmed that the sequel to Before Sunset would be filmed in summer 2012. In September 2012, it was announced the sequel, titled Before Midnight, had completed filming and would premiere at the Sundance Film Festival in January 2013. The film was released in May to widespread acclaim, and received an Academy Award nomination for Best Adapted Screenplay.</p><br/>"
  },
  "errorMessage": ""
}