{
  "imDbId": "tt0116282",
  "title": "Fargo",
  "fullTitle": "Fargo (1996)",
  "type": "Movie",
  "year": "1996",
  "language": "en",
  "titleInLanguage": "Fargo (1996 film)",
  "url": "https://en.wikipedia.org/wiki/Fargo_(1996_film)",
  "plotShort": {
    "plainText": "Fargo is a 1996 black comedy crime film written, produced and directed by Joel and Ethan Coen. Frances McDormand stars as Marge Gunderson, a pregnant Minnesota police chief investigating a triple homicide that takes place after a desperate car salesman (William H. Macy) hires two criminals (Steve Buscemi and Peter Stormare) to kidnap his wife in order to extort a hefty ransom from her wealthy father (Harve Presnell). The film was an American–British co-production.\r\nFilmed in the United States during the end of 1995, Fargo premiered at the 1996 Cannes Film Festival, where Joel Coen won the festival's Prix de la mise en scène (Best Director Award) and the film was nominated for the Palme d'Or. The film was both a commercial and critical success, earning particular acclaim for the Coens' direction and script and the performances of McDormand, Macy, and Buscemi. Fargo received seven Oscar nominations at the 69th Academy Awards, including Best Picture, Best Director, and Best Supporting Actor for Macy, winning two: Best Actress for McDormand and Best Original Screenplay for the Coens.\r\nThe film was selected in 2006 for preservation in the United States National Film Registry by the Library of Congress as \"culturally, historically, or aesthetically significant\"—one of only seven films designated in its first year of eligibility. In 1998, the American Film Institute named it one of the 100 greatest American films in history (being the most recent film on the list up to that point) but it was subsequently de-listed in 2007. A Coen-produced FX television series of the same name, inspired by the film and taking place in the same fictional universe, premiered in 2014 and received critical acclaim.",
    "html": "<p>Fargo is a 1996 black comedy crime film written, produced and directed by Joel and Ethan Coen. Frances McDormand stars as Marge Gunderson, a pregnant Minnesota police chief investigating a triple homicide that takes place after a desperate car salesman (William H. Macy) hires two criminals (Steve Buscemi and Peter Stormare) to kidnap his wife in order to extort a hefty ransom from her wealthy father (Harve Presnell). The film was an American–British co-production.</p><p>Filmed in the United States during the end of 1995, Fargo premiered at the 1996 Cannes Film Festival, where Joel Coen won the festival's Prix de la mise en scène (Best Director Award) and the film was nominated for the Palme d'Or. The film was both a commercial and critical success, earning particular acclaim for the Coens' direction and script and the performances of McDormand, Macy, and Buscemi. Fargo received seven Oscar nominations at the 69th Academy Awards, including Best Picture, Best Director, and Best Supporting Actor for Macy, winning two: Best Actress for McDormand and Best Original Screenplay for the Coens.</p><p>The film was selected in 2006 for preservation in the United States National Film Registry by the Library of Congress as \"culturally, historically, or aesthetically significant\"—one of only seven films designated in its first year of eligibility. In 1998, the American Film Institute named it one of the 100 greatest American films in history (being the most recent film on the list up to that point) but it was subsequently de-listed in 2007. A Coen-produced FX television series of the same name, inspired by the film and taking place in the same fictional universe, premiered in 2014 and received critical acclaim.</p>"
  },
  "plotFull": {
    "plainText": "Fargo is a 1996 black comedy crime film written, produced and directed by Joel and Ethan Coen. Frances McDormand stars as Marge Gunderson, a pregnant Minnesota police chief investigating a triple homicide that takes place after a desperate car salesman (William H. Macy) hires two criminals (Steve Buscemi and Peter Stormare) to kidnap his wife in order to extort a hefty ransom from her wealthy father (Harve Presnell). The film was an American–British co-production.\r\nFilmed in the United States during the end of 1995, Fargo premiered at the 1996 Cannes Film Festival, where Joel Coen won the festival's Prix de la mise en scène (Best Director Award) and the film was nominated for the Palme d'Or. The film was both a commercial and critical success, earning particular acclaim for the Coens' direction and script and the performances of McDormand, Macy, and Buscemi. Fargo received seven Oscar nominations at the 69th Academy Awards, including Best Picture, Best Director, and Best Supporting Actor for Macy, winning two: Best Actress for McDormand and Best Original Screenplay for the Coens.\r\nThe film was selected in 2006 for preservation in the United States National Film Registry by the Library of Congress as \"culturally, historically, or aesthetically significant\"—one of only seven films designated in its first year of eligibility. In 1998, the American Film Institute named it one of the 100 greatest American films in history (being the most recent film on the list up to that point) but it was subsequently de-listed in 2007. A Coen-produced FX television series of the same name, inspired by the film and taking place in the same fictional universe, premiered in 2014 and received critical acclaim.\r\nPlot\r\nIn 1987, Jerry Lundegaard, the executive sales manager of a car dealership owned by his father-in-law, Wade Gustafson, is desperate for money. On the advice of mechanic and convicted felon Shep Proudfoot, Jerry travels to Fargo, North Dakota, and hires Carl Showalter and Gaear Grimsrud to kidnap his wife, Jean. He gives them a new Cutlass Ciera and promises them half of the $80,000 ransom he says he intends to extract from Wade. Jerry pitches Wade a lucrative real estate deal and believes Wade has agreed to lend him $750,000 to finance it, so he attempts to call off the kidnapping. Wade and his accountant Stan Grossman inform Jerry that Wade will make the deal himself and pay Jerry only a modest finder's fee. Carl and Gaear kidnap Jean and transport her to a remote cabin in Moose Lake. A state trooper stops them near Brainerd for not displaying temporary registration tags. The trooper rejects Carl's clumsy bribe attempt and hears Jean whimpering in the back seat. Gaear shoots him, then chases down and kills two passers-by who witnessed the scene.\r\nThe following morning, Brainerd police chief Marge Gunderson, who is seven months pregnant, begins investigating. She correctly deduces that the dead trooper was ticketing a car with dealer plates. She later learns that two men driving a dealership vehicle checked into the nearby Blue Ox Motel with two call girls and placed a call to Proudfoot. After questioning the girls, Marge visits Wade's dealership, where Proudfoot feigns ignorance and Jerry insists no cars are missing. While in Minneapolis, Marge reconnects with Mike Yanagita, a high school classmate, who awkwardly tries to romance her before breaking down and saying his wife has died. Jerry tells Wade the kidnappers have demanded $1 million and will deal only through him. In light of the three murders, Carl demands Jerry hand over all of the $80,000 he believes is the entire ransom. Carl is with another call girl in a Minneapolis hotel room when Proudfoot enters and attacks him for bringing Proudfoot to the attention of the police. Carl then calls Jerry and orders him to deliver the ransom immediately. Wade insists on bringing it and meets Carl at a parking garage. He refuses to hand over the money without seeing his daughter, so an enraged Carl shoots him. Wade is armed and fires back, wounding Carl in the jaw. Carl kills Wade and a garage attendant, then drives away with the briefcase containing the ransom.\r\nOn the way to Moose Lake, Carl discovers the briefcase contains $1 million. He removes $80,000 to split with Gaear, then buries the rest in the snow alongside the highway. At the cabin, Carl finds that Gaear killed Jean because she would not be quiet. Carl says they should split up and leave immediately, and they argue over who will keep the Ciera. Carl uses his injury as justification, shouts insults at Gaear, and attempts to take the vehicle. Gaear kills Carl with an axe. Marge learns from a friend that Yanagita lied; he has no wife and is mentally ill. Reflecting on this, Marge returns to Wade's dealership. Jerry nervously insists no cars are missing and promises to double-check his inventory. Marge sees Jerry driving off the lot and calls the state police.\r\nMarge drives to Moose Lake after a local bartender reports having heard a \"funny-looking guy\" brag about killing someone. She drives by the cabin, sees the Ciera, then discovers Gaear feeding Carl's dismembered body into a woodchipper. Gaear attempts to flee, but Marge shoots him in the leg and arrests him. Shortly afterwards, Jerry is arrested at a motel outside Bismarck, North Dakota. Marge's husband, Norm, tells her the Postal Service has selected his painting of a mallard for a three cent postage stamp and complains that his friend's painting won the competition for a twenty-nine cent stamp. Marge reminds him that many people use smaller denomination stamps whenever prices increase and they need to make up the difference between the face value of their old stamps and the new cost of first class postage. Norm is reassured, and the couple happily anticipates the birth of their child.\r\nCast\r\nFrances McDormand as Marge Gunderson\r\nWilliam H. Macy as Jerry Lundegaard\r\nSteve Buscemi as Carl Showalter\r\nHarve Presnell as Wade Gustafson\r\nPeter Stormare as Gaear Grimsrud\r\nKristin Rudrüd as Jean Lundegaard\r\nTony Denman as Scotty Lundegaard\r\nSteve Reevis as Shep Proudfoot\r\nLarry Brandenburg as Stan Grossman\r\nJohn Carroll Lynch as Norm Gunderson\r\nSteve Park as Mike Yanagita\r\nBruce Bohne as Officer Lou Getchell\r\nLarissa Kokernot as Hooker #1\r\nDavid S. Lomax as Man in Hallway\r\nMelissa Peterman as Hooker #2\r\nMichelle Suzanne LeDoux as Victim in Car\r\nBain Boehlke as Mr. Mohra\r\nWarren Keith as Reilly Diefenbach\r\nJames Gaulke as State Trooper\r\nJosé Feliciano as Himself\r\nCliff Rakerd as Officer Olson\r\nGary Houston as Irate Customer\r\nSteve Edelman as Morning Show Host\r\nSally Wingert as Irate Customer's Wife\r\nBruce Campbell (uncredited) as Soap Opera Actor on TV screen\r\nProduction\r\nCasting\r\nThe Coens initially considered William H. Macy for a smaller role, but they were so impressed by his reading that they asked him to come back in and read for the role of Jerry. According to Macy, he was very persistent in getting the role, saying: \"I found out that they were auditioning in New York still, so I got my jolly, jolly Lutheran ass on an airplane and walked in and said, 'I want to read again because I'm scared you're going to screw this up and hire someone else.' I actually said that. You know, you can't play that card too often as an actor. Sometimes it just blows up in your face, but I said, 'Guys, this is my role. I want this.'\" Ethan Coen later remarked, \"I don't think either of us realised what a tough acting challenge we were handing Bill Macy with this part. Jerry's a fascinating mix of the completely ingenuous and the utterly deceitful. Yet he's also guileless; even though he set these horrible events in motion, he's surprised when they go wrong.\"\r\nFrances McDormand learned how to use and fire a gun, spent days talking with a pregnant police officer and developed a backstory for her character along with John Carroll Lynch. After seeing the movie, McDormand noted that much of Marge was modeled on her sister Dorothy who is a Disciples of Christ minister and chaplain.\r\nFilming\r\nFargo was filmed during the winter of 1995, mainly in the Minneapolis-St. Paul area and around Pembina County, North Dakota. Due to unusually low snowfall totals in central and southern Minnesota that winter, scenes requiring snow-covered landscapes had to be shot in northern Minnesota and northeastern North Dakota, though not in or near the actual towns of Fargo and Brainerd.\r\nJerry's initial meeting with Carl and Gaear was shot at a pool hall and bar called The King of Clubs in the northeast section of Minneapolis. It was demolished in 2003, along with most other buildings on that block of Central Avenue, and replaced by low-income housing. Gustafson's auto dealership was actually Wally McCarthy Oldsmobile in Richfield, a southern suburb of Minneapolis. The site is now occupied by Best Buy's national corporate headquarters. The 24-foot Paul Bunyan statue was built for the film (and subsequently dismantled) on Pembina County Highway 1, four miles west of Bathgate, North Dakota, near the Canadian border. The Blue Ox motel/truckstop was Stockmen's Truck Stop in South St. Paul, which is still in business. Ember's, the restaurant where Jerry discusses the ransom drop with Gustafson, was located in St. Louis Park, the Coens' hometown; the building now houses a medical outpatient treatment center.\r\nThe strip club where Marge interviewed the two call girls was two separate locations, it's exterior as the Lakeside Club in Mahtomedi, Minnesota and interior being the Loch Ness Lounge in Houlton, Wisconsin (both locations have since closed). The kidnappers' Moose Lake hideout actually stood on the shore of Square Lake, near May, Minnesota. The cabin was relocated to Barnes, Wisconsin, in 2002. The Edina police station where the interior police headquarters scenes were filmed is still in operation, but has been completely rebuilt. The Carlton Celebrity Room was an actual venue in Bloomington, Minnesota, and José Feliciano did once appear there, but it had been closed for almost ten years when filming began. The Feliciano scene was shot at the Chanhassen Dinner Theatre in Chanhassen, near Minneapolis. The ransom drop was filmed in two adjacent parking garages on South 8th Street in downtown Minneapolis. Scenes in the Lundegaards' kitchen were shot in a private home on Pillsbury Avenue in Minneapolis, and the house where Mr. Mohra described the \"funny looking little guy\" to police is in Hallock, in northwest Minnesota. The motel \"outside of Bismarck\", where the police finally catch up with Jerry, is the Hitching Post Motel in Forest Lake, north of Minneapolis.\r\nWhile none of Fargo was actually filmed in Fargo, the Fargo-Moorhead Convention & Visitors Bureau exhibits original script copies and several props used in the film, including the wood chipper prop. After the movie's release, by some accounts, Brainerd was invaded by shovel-toting moviegoers searching for the buried ransom cash, inspired by the spurious \"based-on-a-true-story\" announcement in the opening credits. In 2001, a Japanese woman named Takako Konishi was found frozen to death near Detroit Lakes, Minnesota. A rumor emerged that she had been searching for the buried money, but her death was actually ruled a suicide.\r\nMusic\r\nAs with all the Coen brothers' films, except O Brother, Where Art Thou? and Inside Llewyn Davis, the score to Fargo is by Carter Burwell. The main musical motif is based on a Norwegian folk song, \"The Lost Sheep\" (Norwegian: Den bortkomne sauen).\r\nOther songs featured in the film include: \"Big City\" by Merle Haggard, heard in the King of Clubs while Jerry meets with Carl and Gaear; \"These Boots Are Made for Walkin'\" by Boy George, which plays in the garage as Shep works, and \"Let's Find Each Other Tonight\", a live nightclub performance by José Feliciano that is viewed by Carl and a female escort at such a far distance without a close-up that the viewer might deem it’s a lip synched stand-in. In the diner, when Jerry is urging Wade not to get police involved in his wife's kidnapping, Chuck Mangione's \"Feels So Good\" can be heard faintly in the background. An instrumental version of \"Do You Know the Way to San Jose\" plays during the scene where Marge and Norm are eating at a buffet. The restaurant scene with Mike Yanagita is accompanied by a piano arrangement of \"Sometimes in Winter\" by Blood, Sweat & Tears. All the songs heard in the film are featured only as background music, usually on a radio, and do not appear on the soundtrack album.\r\nThe soundtrack was released in 1996 on TVT Records, combined with selections from the score to Barton Fink.\r\nClaims of factual basis\r\nThe film opens with the following text:\r\nThis is a true story. The events depicted in this film took place in Minnesota in 1987. At the request of the survivors, the names have been changed. Out of respect for the dead, the rest has been told exactly as it occurred.\r\nHowever, the closing credits bear the standard fictitious persons disclaimer used by works of fiction. Regarding this apparent discrepancy, the Coen brothers claimed that they based their script on an actual criminal event, but wrote a fictional story around it. \"We weren't interested in that kind of fidelity\", said Joel Coen. \"The basic events are the same as in the real case, but the characterizations are fully imagined ... If an audience believes that something's based on a real event, it gives you permission to do things they might otherwise not accept.\"\r\nThe brothers have modified their explanation more than once. In 1996, Joel Coen told a reporter that—contrary to the opening graphic—the actual murders were not committed in Minnesota. Many Minnesotans speculated that the story was inspired by T. Eugene Thompson, a St. Paul attorney who was convicted of hiring a man to murder his wife in 1963, near the Coens' hometown of St. Louis Park; but the Coens claimed that they had never heard of Thompson. After Thompson's death in 2015, Joel Coen changed the explanation again: \" completely made up. Or, as we like to say, the only thing true about it is that it's a story.\"\r\nThe film's special edition DVD contains yet another account, that the film was inspired by the 1986 murder of Helle Crafts, a Danish–American flight attendant from Connecticut at the hands of her husband, Richard, who disposed of her body through a wood chipper.\r\nAccent\r\nThe film's illustrations of \"Minnesota nice\" and distinctive regional accents and expressions made a lasting impression on audiences; years later, locals reported continuing to field tourist requests to say \"Yah, you betcha\", and other tag lines from the movie. Dialect coach Liz Himelstein said that \"the accent was another character\". She coached the cast using audiotapes and field trips. Another dialect coach, Larissa Kokernot (who also played one of the prostitutes), noted that the \"small-town, Minnesota accent is close to the sound of the Nords and the Swedes\", which is \"where the musicality comes from\". She taught McDormand \"Minnesota nice\" and the characteristic head-nodding to show agreement. The strong accent spoken by Macy's and McDormand's characters, which was exaggerated for effect, is less common in the Twin Cities, where over 60% of the state's population lives. The Minneapolis and St. Paul dialect is characterized by the Northern Cities Vowel Shift, which is also found in other places in the Northern United States as far east as Rochester, New York.\r\nRelease\r\nFargo premiered at the 1996 Cannes Film Festival, where it was nominated for the competition's highest honor, the Palme d'Or. Joel Coen won the top directorial award, the Prix de la mise en scène. Subsequent notable screenings included the Pusan International Film Festival in South Korea, the Karlovy Vary International Film Festival in the Czech Republic, and the Naples Film Festival. In 2006, the sixth annual Fargo Film Festival marked Fargo's tenth anniversary by projecting the movie on a gigantic screen mounted on the north side of Fargo's then tallest building, the Radisson Hotel.\r\nReleased theatrically in the United States on March 8, 1996, Fargo launched in 36 theaters, and grossed $1,024,137 in its first week. In the film's third week, Fargo was released in 412 theaters, and accumulated a total box office gross of $5,998,890. Overall it grossed $24,281,860 in the United States and Canada. Internationally, Fargo was released in Canada on April 5, 1996; in the United Kingdom on May 31, 1996 grossing $2.3 million; in Australia on June 6, 1996 grossing $1.5 million; in France on September 4, 1996 grossing $3.9 million; and in Germany on November 14, 1996 grossing $2.4 million. Overall, the film's international gross was an estimated $36 million for a worldwide total of $60.6 million.\r\nReception\r\nOn review aggregator website Rotten Tomatoes, Fargo holds an approval rating of 94% based on 104 reviews, with an average rating of 8.8/10. The site's critical consensus reads: \"Violent, quirky, and darkly funny, Fargo delivers an original crime story and a wonderful performance by McDormand.\" At Metacritic, the film has a weighted average score of 85 out of 100, based on 25 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale.\r\nArnold Wayne Jones, writing for the Dallas Observer, called the film an \"illuminating amalgam of emotion and thought\", praising the directing and writing from the Coen brothers. From Entertainment Weekly, Lisa Schwarzbaum lauded the performance from Frances McDormand and stated that the film was \"dizzily rich, witty, and satisfying\". In The New Yorker, Anthony Lane singled out McDormand for praise: \"Her character—seven months pregnant, polite to a fault, smart yet slow—is only a breath away from caricature, yet McDormand unearths a surprising decency there, and in the process she pretty well rescues the film.\" USA Today journalist Mike Clark also praised the performance of McDormand:\r\nMcDormand's uproariously sly-spry performance connects with Roger Deakins' bleakly beautiful photography to create one of the Coens' most consistently successful outings, albeit one that plays it even closer to the vest than usual. For a current movie that simply effervesces with the macabre, check out The Young Poisoner's Handbook. For a nifty bit of nastiness from two of our most dependably provocative filmmakers, Fargo will fill the bill.\r\nOn the other side of the spectrum, Time magazine film critic Richard Corliss criticized Fargo for its use of Minnesota nice, the accent used in the film. In his review, Corliss stated that \"After some superb mannerist films, the Coens are back in the deadpan realist territory of Blood Simple, but without the cinematic elan.\" (Conversely, Janet Maslin, in The New York Times, deemed Fargo \"much more stylish and entertaining\" than Blood Simple). James Berardinelli, writing for his own website, ReelThoughts, gave the film three stars out of five, stating that it was \"easy to admire what the Coens are trying to do in Fargo, but more difficult to actually like the film.\"\r\nJohn Simon of The National Review wrote \"The Coen brothers' Fargo is their best film so far, which isn't saying very much\". Simon elaborated further that \"Fargo could have been a nice little film noir if they hadn't compounded it with black comedy, absurdism, and folksy farce: Scandinavian–American midwesterners up, or down, to their hickish shenanigans. Some of this surprisingly, works, some of it ranges from the unpalatable to the indigestible\".\r\nGene Siskel and Roger Ebert both ranked Fargo as the best film of 1996, with Ebert later ranking it fourth on his list of the best films of the 1990s. Fargo was added to the National Film Registry by the National Film Preservation Board on December 27, 2006. In 2010, the Independent Film & Television Alliance selected the film as one of its \"30 Most Significant Independent Films\" of the last 30 years. The Writers Guild of America ranked the film's screenplay the 32nd greatest ever.\r\nAccolades\r\nHome media\r\nFargo has been released in several formats: VHS, LaserDisc, DVD, Blu-ray, and iTunes download. The first home video release of the film was on October 1, 1996, on a pan and scan cassette. A collector's edition widescreen VHS was also released and included a snow globe that depicted the woodchipper scene which, when shaken, stirred up both snow and \"blood\". PolyGram Filmed Entertainment released Fargo on DVD on July 8, 1997. In 1999, Metro-Goldwyn-Mayer, who acquired the rights to the film through their purchase of Polygram's pre-March 31, 1996, library, released the film on VHS as part of its \"Contemporary Classics\" series. A \"Special Edition\" DVD was released on September 30, 2003, by MGM Home Entertainment, which featured minor changes to the film, particularly with its subtitles. The opening titles stating \"This is a true story\" have been changed in this edition from the actual titles on the film print to digitally inserted titles. Also, the subtitle preceding Lundegaard's arrest \"Outside of Bismarck, North Dakota\" has been inserted digitally and moved from the bottom of the screen to the top. The special edition of Fargo was repackaged in several Coen brothers box sets and also as a double feature DVD with other MGM releases. A Blu-ray version was released on May 12, 2009, and later in a DVD combo pack in 2010. On April 1, 2014, in commemoration for the 90th anniversary of Metro-Goldwyn-Mayer, the film was remastered in 4K and reissued again on Blu-ray. On May 3, 2017, Shout! Factory announced a 20th anniversary collector's Steelbook edition on Blu-ray, limited to 10,000 copies. The Steelbook was released on August 8, 2017.\r\nTelevision series\r\nIn 1997, a pilot was filmed for an intended television series based on the film. Set in Brainerd shortly after the events of the film, it starred Edie Falco as Marge Gunderson and Bruce Bohne reprising his role as Officer Lou. It was directed by Kathy Bates and featured no involvement from the Coen brothers. The episode aired in 2003 during Trio's Brilliant But Cancelled series of failed TV shows.\r\nA follow-up TV series inspired by the film, with the Coens as executive producers, debuted on FX in April 2014. The first season received acclaim from both critics and audiences. Existing in the same fictional continuity as the film, each season features a different story, cast, and decade-setting. The episode \"Eating the Blame\" reintroduced the buried ransom money for a minor three-episode subplot. Three further seasons have been made thus far; the fourth was released on September 27, 2020.",
    "html": "<p>Fargo is a 1996 black comedy crime film written, produced and directed by Joel and Ethan Coen. Frances McDormand stars as Marge Gunderson, a pregnant Minnesota police chief investigating a triple homicide that takes place after a desperate car salesman (William H. Macy) hires two criminals (Steve Buscemi and Peter Stormare) to kidnap his wife in order to extort a hefty ransom from her wealthy father (Harve Presnell). The film was an American–British co-production.</p><p>Filmed in the United States during the end of 1995, Fargo premiered at the 1996 Cannes Film Festival, where Joel Coen won the festival's Prix de la mise en scène (Best Director Award) and the film was nominated for the Palme d'Or. The film was both a commercial and critical success, earning particular acclaim for the Coens' direction and script and the performances of McDormand, Macy, and Buscemi. Fargo received seven Oscar nominations at the 69th Academy Awards, including Best Picture, Best Director, and Best Supporting Actor for Macy, winning two: Best Actress for McDormand and Best Original Screenplay for the Coens.</p><p>The film was selected in 2006 for preservation in the United States National Film Registry by the Library of Congress as \"culturally, historically, or aesthetically significant\"—one of only seven films designated in its first year of eligibility. In 1998, the American Film Institute named it one of the 100 greatest American films in history (being the most recent film on the list up to that point) but it was subsequently de-listed in 2007. A Coen-produced FX television series of the same name, inspired by the film and taking place in the same fictional universe, premiered in 2014 and received critical acclaim.</p><br/><h3>Plot</h3><p>In 1987, Jerry Lundegaard, the executive sales manager of a car dealership owned by his father-in-law, Wade Gustafson, is desperate for money. On the advice of mechanic and convicted felon Shep Proudfoot, Jerry travels to Fargo, North Dakota, and hires Carl Showalter and Gaear Grimsrud to kidnap his wife, Jean. He gives them a new Cutlass Ciera and promises them half of the $80,000 ransom he says he intends to extract from Wade. Jerry pitches Wade a lucrative real estate deal and believes Wade has agreed to lend him $750,000 to finance it, so he attempts to call off the kidnapping. Wade and his accountant Stan Grossman inform Jerry that Wade will make the deal himself and pay Jerry only a modest finder's fee. Carl and Gaear kidnap Jean and transport her to a remote cabin in Moose Lake. A state trooper stops them near Brainerd for not displaying temporary registration tags. The trooper rejects Carl's clumsy bribe attempt and hears Jean whimpering in the back seat. Gaear shoots him, then chases down and kills two passers-by who witnessed the scene.</p><p>The following morning, Brainerd police chief Marge Gunderson, who is seven months pregnant, begins investigating. She correctly deduces that the dead trooper was ticketing a car with dealer plates. She later learns that two men driving a dealership vehicle checked into the nearby Blue Ox Motel with two call girls and placed a call to Proudfoot. After questioning the girls, Marge visits Wade's dealership, where Proudfoot feigns ignorance and Jerry insists no cars are missing. While in Minneapolis, Marge reconnects with Mike Yanagita, a high school classmate, who awkwardly tries to romance her before breaking down and saying his wife has died. Jerry tells Wade the kidnappers have demanded $1 million and will deal only through him. In light of the three murders, Carl demands Jerry hand over all of the $80,000 he believes is the entire ransom. Carl is with another call girl in a Minneapolis hotel room when Proudfoot enters and attacks him for bringing Proudfoot to the attention of the police. Carl then calls Jerry and orders him to deliver the ransom immediately. Wade insists on bringing it and meets Carl at a parking garage. He refuses to hand over the money without seeing his daughter, so an enraged Carl shoots him. Wade is armed and fires back, wounding Carl in the jaw. Carl kills Wade and a garage attendant, then drives away with the briefcase containing the ransom.</p><p>On the way to Moose Lake, Carl discovers the briefcase contains $1 million. He removes $80,000 to split with Gaear, then buries the rest in the snow alongside the highway. At the cabin, Carl finds that Gaear killed Jean because she would not be quiet. Carl says they should split up and leave immediately, and they argue over who will keep the Ciera. Carl uses his injury as justification, shouts insults at Gaear, and attempts to take the vehicle. Gaear kills Carl with an axe. Marge learns from a friend that Yanagita lied; he has no wife and is mentally ill. Reflecting on this, Marge returns to Wade's dealership. Jerry nervously insists no cars are missing and promises to double-check his inventory. Marge sees Jerry driving off the lot and calls the state police.</p><p>Marge drives to Moose Lake after a local bartender reports having heard a \"funny-looking guy\" brag about killing someone. She drives by the cabin, sees the Ciera, then discovers Gaear feeding Carl's dismembered body into a woodchipper. Gaear attempts to flee, but Marge shoots him in the leg and arrests him. Shortly afterwards, Jerry is arrested at a motel outside Bismarck, North Dakota. Marge's husband, Norm, tells her the Postal Service has selected his painting of a mallard for a three cent postage stamp and complains that his friend's painting won the competition for a twenty-nine cent stamp. Marge reminds him that many people use smaller denomination stamps whenever prices increase and they need to make up the difference between the face value of their old stamps and the new cost of first class postage. Norm is reassured, and the couple happily anticipates the birth of their child.</p><br/><h3>Cast</h3><ul><li>Frances McDormand as Marge Gunderson</li><li>William H. Macy as Jerry Lundegaard</li><li>Steve Buscemi as Carl Showalter</li><li>Harve Presnell as Wade Gustafson</li><li>Peter Stormare as Gaear Grimsrud</li><li>Kristin Rudrüd as Jean Lundegaard</li><li>Tony Denman as Scotty Lundegaard</li><li>Steve Reevis as Shep Proudfoot</li><li>Larry Brandenburg as Stan Grossman</li><li>John Carroll Lynch as Norm Gunderson</li><li>Steve Park as Mike Yanagita</li><li>Bruce Bohne as Officer Lou Getchell</li><li>Larissa Kokernot as Hooker #1</li><li>David S. Lomax as Man in Hallway</li><li>Melissa Peterman as Hooker #2</li><li>Michelle Suzanne LeDoux as Victim in Car</li><li>Bain Boehlke as Mr. Mohra</li><li>Warren Keith as Reilly Diefenbach</li><li>James Gaulke as State Trooper</li><li>José Feliciano as Himself</li><li>Cliff Rakerd as Officer Olson</li><li>Gary Houston as Irate Customer</li><li>Steve Edelman as Morning Show Host</li><li>Sally Wingert as Irate Customer's Wife</li><li>Bruce Campbell (uncredited) as Soap Opera Actor on TV screen</li></ul><br/><h3>Production</h3><h4>Casting</h4><p>The Coens initially considered William H. Macy for a smaller role, but they were so impressed by his reading that they asked him to come back in and read for the role of Jerry. According to Macy, he was very persistent in getting the role, saying: \"I found out that they were auditioning in New York still, so I got my jolly, jolly Lutheran ass on an airplane and walked in and said, 'I want to read again because I'm scared you're going to screw this up and hire someone else.' I actually said that. You know, you can't play that card too often as an actor. Sometimes it just blows up in your face, but I said, 'Guys, this is my role. I want this.'\" Ethan Coen later remarked, \"I don't think either of us realised what a tough acting challenge we were handing Bill Macy with this part. Jerry's a fascinating mix of the completely ingenuous and the utterly deceitful. Yet he's also guileless; even though he set these horrible events in motion, he's surprised when they go wrong.\"</p><p>Frances McDormand learned how to use and fire a gun, spent days talking with a pregnant police officer and developed a backstory for her character along with John Carroll Lynch. After seeing the movie, McDormand noted that much of Marge was modeled on her sister Dorothy who is a Disciples of Christ minister and chaplain.</p><h4>Filming</h4><p>Fargo was filmed during the winter of 1995, mainly in the Minneapolis-St. Paul area and around Pembina County, North Dakota. Due to unusually low snowfall totals in central and southern Minnesota that winter, scenes requiring snow-covered landscapes had to be shot in northern Minnesota and northeastern North Dakota, though not in or near the actual towns of Fargo and Brainerd.</p><p>Jerry's initial meeting with Carl and Gaear was shot at a pool hall and bar called The King of Clubs in the northeast section of Minneapolis. It was demolished in 2003, along with most other buildings on that block of Central Avenue, and replaced by low-income housing. Gustafson's auto dealership was actually Wally McCarthy Oldsmobile in Richfield, a southern suburb of Minneapolis. The site is now occupied by Best Buy's national corporate headquarters. The 24-foot Paul Bunyan statue was built for the film (and subsequently dismantled) on Pembina County Highway 1, four miles west of Bathgate, North Dakota, near the Canadian border. The Blue Ox motel/truckstop was Stockmen's Truck Stop in South St. Paul, which is still in business. Ember's, the restaurant where Jerry discusses the ransom drop with Gustafson, was located in St. Louis Park, the Coens' hometown; the building now houses a medical outpatient treatment center.</p><p>The strip club where Marge interviewed the two call girls was two separate locations, it's exterior as the Lakeside Club in Mahtomedi, Minnesota and interior being the Loch Ness Lounge in Houlton, Wisconsin (both locations have since closed). The kidnappers' Moose Lake hideout actually stood on the shore of Square Lake, near May, Minnesota. The cabin was relocated to Barnes, Wisconsin, in 2002. The Edina police station where the interior police headquarters scenes were filmed is still in operation, but has been completely rebuilt. The Carlton Celebrity Room was an actual venue in Bloomington, Minnesota, and José Feliciano did once appear there, but it had been closed for almost ten years when filming began. The Feliciano scene was shot at the Chanhassen Dinner Theatre in Chanhassen, near Minneapolis. The ransom drop was filmed in two adjacent parking garages on South 8th Street in downtown Minneapolis. Scenes in the Lundegaards' kitchen were shot in a private home on Pillsbury Avenue in Minneapolis, and the house where Mr. Mohra described the \"funny looking little guy\" to police is in Hallock, in northwest Minnesota. The motel \"outside of Bismarck\", where the police finally catch up with Jerry, is the Hitching Post Motel in Forest Lake, north of Minneapolis.</p><p>While none of Fargo was actually filmed in Fargo, the Fargo-Moorhead Convention & Visitors Bureau exhibits original script copies and several props used in the film, including the wood chipper prop. After the movie's release, by some accounts, Brainerd was invaded by shovel-toting moviegoers searching for the buried ransom cash, inspired by the spurious \"based-on-a-true-story\" announcement in the opening credits. In 2001, a Japanese woman named Takako Konishi was found frozen to death near Detroit Lakes, Minnesota. A rumor emerged that she had been searching for the buried money, but her death was actually ruled a suicide.</p><h4>Music</h4><p>As with all the Coen brothers' films, except O Brother, Where Art Thou? and Inside Llewyn Davis, the score to Fargo is by Carter Burwell. The main musical motif is based on a Norwegian folk song, \"The Lost Sheep\" (Norwegian: Den bortkomne sauen).</p><p>Other songs featured in the film include: \"Big City\" by Merle Haggard, heard in the King of Clubs while Jerry meets with Carl and Gaear; \"These Boots Are Made for Walkin'\" by Boy George, which plays in the garage as Shep works, and \"Let's Find Each Other Tonight\", a live nightclub performance by José Feliciano that is viewed by Carl and a female escort at such a far distance without a close-up that the viewer might deem it’s a lip synched stand-in. In the diner, when Jerry is urging Wade not to get police involved in his wife's kidnapping, Chuck Mangione's \"Feels So Good\" can be heard faintly in the background. An instrumental version of \"Do You Know the Way to San Jose\" plays during the scene where Marge and Norm are eating at a buffet. The restaurant scene with Mike Yanagita is accompanied by a piano arrangement of \"Sometimes in Winter\" by Blood, Sweat & Tears. All the songs heard in the film are featured only as background music, usually on a radio, and do not appear on the soundtrack album.</p><p>The soundtrack was released in 1996 on TVT Records, combined with selections from the score to Barton Fink.</p><h4>Claims of factual basis</h4><p>The film opens with the following text:</p><blockquote>This is a true story. The events depicted in this film took place in Minnesota in 1987. At the request of the survivors, the names have been changed. Out of respect for the dead, the rest has been told exactly as it occurred.</blockquote><p>However, the closing credits bear the standard fictitious persons disclaimer used by works of fiction. Regarding this apparent discrepancy, the Coen brothers claimed that they based their script on an actual criminal event, but wrote a fictional story around it. \"We weren't interested in that kind of fidelity\", said Joel Coen. \"The basic events are the same as in the real case, but the characterizations are fully imagined ... If an audience believes that something's based on a real event, it gives you permission to do things they might otherwise not accept.\"</p><p>The brothers have modified their explanation more than once. In 1996, Joel Coen told a reporter that—contrary to the opening graphic—the actual murders were not committed in Minnesota. Many Minnesotans speculated that the story was inspired by T. Eugene Thompson, a St. Paul attorney who was convicted of hiring a man to murder his wife in 1963, near the Coens' hometown of St. Louis Park; but the Coens claimed that they had never heard of Thompson. After Thompson's death in 2015, Joel Coen changed the explanation again: \" completely made up. Or, as we like to say, the only thing true about it is that it's a story.\"</p><p>The film's special edition DVD contains yet another account, that the film was inspired by the 1986 murder of Helle Crafts, a Danish–American flight attendant from Connecticut at the hands of her husband, Richard, who disposed of her body through a wood chipper.</p><h4>Accent</h4><p>The film's illustrations of \"Minnesota nice\" and distinctive regional accents and expressions made a lasting impression on audiences; years later, locals reported continuing to field tourist requests to say \"Yah, you betcha\", and other tag lines from the movie. Dialect coach Liz Himelstein said that \"the accent was another character\". She coached the cast using audiotapes and field trips. Another dialect coach, Larissa Kokernot (who also played one of the prostitutes), noted that the \"small-town, Minnesota accent is close to the sound of the Nords and the Swedes\", which is \"where the musicality comes from\". She taught McDormand \"Minnesota nice\" and the characteristic head-nodding to show agreement. The strong accent spoken by Macy's and McDormand's characters, which was exaggerated for effect, is less common in the Twin Cities, where over 60% of the state's population lives. The Minneapolis and St. Paul dialect is characterized by the Northern Cities Vowel Shift, which is also found in other places in the Northern United States as far east as Rochester, New York.</p><br/><h3>Release</h3><p>Fargo premiered at the 1996 Cannes Film Festival, where it was nominated for the competition's highest honor, the Palme d'Or. Joel Coen won the top directorial award, the Prix de la mise en scène. Subsequent notable screenings included the Pusan International Film Festival in South Korea, the Karlovy Vary International Film Festival in the Czech Republic, and the Naples Film Festival. In 2006, the sixth annual Fargo Film Festival marked Fargo's tenth anniversary by projecting the movie on a gigantic screen mounted on the north side of Fargo's then tallest building, the Radisson Hotel.</p><p>Released theatrically in the United States on March 8, 1996, Fargo launched in 36 theaters, and grossed $1,024,137 in its first week. In the film's third week, Fargo was released in 412 theaters, and accumulated a total box office gross of $5,998,890. Overall it grossed $24,281,860 in the United States and Canada. Internationally, Fargo was released in Canada on April 5, 1996; in the United Kingdom on May 31, 1996 grossing $2.3 million; in Australia on June 6, 1996 grossing $1.5 million; in France on September 4, 1996 grossing $3.9 million; and in Germany on November 14, 1996 grossing $2.4 million. Overall, the film's international gross was an estimated $36 million for a worldwide total of $60.6 million.</p><br/><h3>Reception</h3><p>On review aggregator website Rotten Tomatoes, Fargo holds an approval rating of 94% based on 104 reviews, with an average rating of 8.8/10. The site's critical consensus reads: \"Violent, quirky, and darkly funny, Fargo delivers an original crime story and a wonderful performance by McDormand.\" At Metacritic, the film has a weighted average score of 85 out of 100, based on 25 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale.</p><p>Arnold Wayne Jones, writing for the Dallas Observer, called the film an \"illuminating amalgam of emotion and thought\", praising the directing and writing from the Coen brothers. From Entertainment Weekly, Lisa Schwarzbaum lauded the performance from Frances McDormand and stated that the film was \"dizzily rich, witty, and satisfying\". In The New Yorker, Anthony Lane singled out McDormand for praise: \"Her character—seven months pregnant, polite to a fault, smart yet slow—is only a breath away from caricature, yet McDormand unearths a surprising decency there, and in the process she pretty well rescues the film.\" USA Today journalist Mike Clark also praised the performance of McDormand:</p><blockquote>McDormand's uproariously sly-spry performance connects with Roger Deakins' bleakly beautiful photography to create one of the Coens' most consistently successful outings, albeit one that plays it even closer to the vest than usual. For a current movie that simply effervesces with the macabre, check out The Young Poisoner's Handbook. For a nifty bit of nastiness from two of our most dependably provocative filmmakers, Fargo will fill the bill.</blockquote><p>On the other side of the spectrum, Time magazine film critic Richard Corliss criticized Fargo for its use of Minnesota nice, the accent used in the film. In his review, Corliss stated that \"After some superb mannerist films, the Coens are back in the deadpan realist territory of Blood Simple, but without the cinematic elan.\" (Conversely, Janet Maslin, in The New York Times, deemed Fargo \"much more stylish and entertaining\" than Blood Simple). James Berardinelli, writing for his own website, ReelThoughts, gave the film three stars out of five, stating that it was \"easy to admire what the Coens are trying to do in Fargo, but more difficult to actually like the film.\"</p><p>John Simon of The National Review wrote \"The Coen brothers' Fargo is their best film so far, which isn't saying very much\". Simon elaborated further that \"Fargo could have been a nice little film noir if they hadn't compounded it with black comedy, absurdism, and folksy farce: Scandinavian–American midwesterners up, or down, to their hickish shenanigans. Some of this surprisingly, works, some of it ranges from the unpalatable to the indigestible\".</p><p>Gene Siskel and Roger Ebert both ranked Fargo as the best film of 1996, with Ebert later ranking it fourth on his list of the best films of the 1990s. Fargo was added to the National Film Registry by the National Film Preservation Board on December 27, 2006. In 2010, the Independent Film & Television Alliance selected the film as one of its \"30 Most Significant Independent Films\" of the last 30 years. The Writers Guild of America ranked the film's screenplay the 32nd greatest ever.</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award⁣</th><th>Date of ceremony⁣</th><th>Category⁣</th><th>Recipients⁣</th><th>Result⁣</th><th><abbr title=\"References\">Ref.</abbr>⁣</th></tr><tr><td rowspan=\"7\"><span>Academy Awards</span>⁣</td><td rowspan=\"7\"><span>March 24, 1997</span>⁣</td><td><span>Best Picture</span>⁣</td><td>Ethan Coen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated⁣</td><td rowspan=\"7\">⁣</td></tr><tr><td><span>Best Director</span>⁣</td><td>Joel Coen⁣</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress</span>⁣</td><td><span>Frances McDormand</span>⁣</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won⁣</td></tr><tr><td><span>Best Supporting Actor</span>⁣</td><td><span>William H. Macy</span>⁣</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated⁣</td></tr><tr><td><span>Best Original Screenplay</span>⁣</td><td><span>Joel and Ethan Coen</span>⁣</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won⁣</td></tr><tr><td><span>Best Cinematography</span>⁣</td><td><span>Roger Deakins</span>⁣</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated⁣</td></tr><tr><td><span>Best Film Editing</span>⁣</td><td><span>Roderick Jaynes</span>⁣</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated⁣</td></tr><tr><td rowspan=\"3\"><span>American Film Institute</span></td><td>1998</td><td><span>AFI's 100 Years...100 Movies</span></td><td><i>Fargo</i></td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">#84</div></td><td></td></tr><tr><td>June 13, 2000</td><td><span>AFI's 100 Years...100 Laughs</span></td><td><i>Fargo</i></td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">#93</div></td><td></td></tr><tr><td>June 2003</td><td><span>AFI's 100 Years...100 Heroes &amp; Villains</span></td><td>Marge Gunderson</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">#33 Hero</div></td><td></td></tr><tr><td><span>American Society of Cinematographers</span></td><td>1996</td><td><span>Outstanding Achievement in Cinematography</span></td><td>Roger Deakins</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"6\"><span>BAFTA Film Awards</span></td><td rowspan=\"6\"><span>April 29, 1997</span></td><td><span>Best Direction</span></td><td>Joel Coen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"6\"></td></tr><tr><td><span>Best Film</span></td><td><i>Fargo</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress in a Leading Role</span></td><td>Frances McDormand</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Screenplay</span></td><td>Joel and Ethan Coen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td>Roger Deakins</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Editing</span></td><td>Roderick Jaynes</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Belgian Film Critics Association</span></td><td>1997</td><td><span>Grand Prix</span></td><td><i>Fargo</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"2\"><span>Cannes Film Festival</span></td><td rowspan=\"2\"><span>May 1996</span></td><td><span>Best Director</span></td><td>Joel Coen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Palme d'Or</span></td><td><i>Fargo</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"4\"><span>Golden Globe Awards</span></td><td rowspan=\"4\"><span>January 19, 1997</span></td><td><span>Best Motion Picture – Musical or Comedy</span></td><td><i>Fargo</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\"></td></tr><tr><td><span>Best Director</span></td><td>Joel Coen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress – Motion Picture Comedy or Musical</span></td><td>Frances McDormand</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay</span></td><td>Joel and Ethan Coen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"7\"><span>Golden Satellite Awards</span></td><td rowspan=\"7\"><span>January 15, 1997</span></td><td><span>Best Film</span></td><td><i>Fargo</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"7\"></td></tr><tr><td><span>Best Director</span></td><td>Joel Coen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actress – Drama</span></td><td>Frances McDormand</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor - Drama</span></td><td>William H. Macy</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor – Drama</span></td><td><span>Steve Buscemi</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Editing</span></td><td>Roderick Jaynes</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Screenplay</span></td><td>Joel and Ethan Coen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"6\"><span>Independent Spirit Awards</span></td><td rowspan=\"6\"><span>March 22, 1997</span></td><td><span>Best Film</span></td><td><i>Fargo</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"6\"></td></tr><tr><td><span>Best Director</span></td><td>Joel Coen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Male Lead</span></td><td>William H. Macy</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Female Lead</span></td><td>Frances McDormand</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay</span></td><td>Joel and Ethan Coen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Cinematography</span></td><td>Roger Deakins</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>National Board of Review</span></td><td rowspan=\"2\">1996</td><td><span>Best Director</span></td><td>Joel Coen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Best Actress</span></td><td>Frances McDormand</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>National Film Preservation Board</span></td><td>December 27, 2006</td><td><span>National Film Registry</span></td><td><i>Fargo</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Added</td><td></td></tr><tr><td rowspan=\"2\"><span>New York Film Critics Circle</span></td><td rowspan=\"2\"><span>January 5, 1997</span></td><td><span>Best Film</span></td><td><i>Fargo</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\"></td></tr><tr><td>Best Actress</td><td>Frances McDormand</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>Saturn Awards</span></td><td rowspan=\"3\"><span>July 23, 1997</span></td><td><span>Best Action or Adventure Film</span></td><td><i>Fargo</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"3\"></td></tr><tr><td><span>Best Actress</span></td><td>Frances McDormand</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td>Joel Coen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Screen Actors Guild Awards</span></td><td rowspan=\"2\"><span>February 22, 1997</span></td><td><span>Outstanding Performance by a Female Actor in a Leading Role</span></td><td>Frances McDormand</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\"></td></tr><tr><td><span>Outstanding Performance by a Male Actor in a Supporting Role</span></td><td>William H. Macy</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>March 16, 1997</span></td><td><span>Best Original Screenplay</span></td><td>Joel and Ethan Coen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"4\"><span class=\"mw-redirect\">London Film Critics Circle</span></td><td rowspan=\"4\"><span>March 2, 1997</span></td><td><span class=\"mw-redirect\">Film of the Year</span></td><td><i>Fargo</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span class=\"mw-redirect\">Director of the Year</span></td><td>Joel Coen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Screenwriter of the Year</span></td><td>Joel and Ethan Coen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span class=\"mw-redirect\">Actress of the Year</span></td><td>Frances McDormand</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Bodil Awards</span></td><td>1997</td><td><span>Best American Film</span></td><td>Joel Coen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr></tbody></table><br/><h3>Home media</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>needs additional citations for <span>verification</span></b>.<span class=\"hide-when-compact\"> Please help <span class=\"external text\">improve this article</span> by <span>adding citations to reliable sources</span> in this section. Unsourced material may be challenged and removed.<br><small><span class=\"plainlinks\"><i>Find sources:</i> <span rel=\"nofollow\" class=\"external text\">\"Fargo\" 1996 film</span> – <span rel=\"nofollow\" class=\"external text\">news</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">newspapers</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">books</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">scholar</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">JSTOR</span></span></small></span>  <span class=\"date-container\"><i>(<span class=\"date\">March 2022</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><p>Fargo has been released in several formats: VHS, LaserDisc, DVD, Blu-ray, and iTunes download. The first home video release of the film was on October 1, 1996, on a pan and scan cassette. A collector's edition widescreen VHS was also released and included a snow globe that depicted the woodchipper scene which, when shaken, stirred up both snow and \"blood\". PolyGram Filmed Entertainment released Fargo on DVD on July 8, 1997. In 1999, Metro-Goldwyn-Mayer, who acquired the rights to the film through their purchase of Polygram's pre-March 31, 1996, library, released the film on VHS as part of its \"Contemporary Classics\" series. A \"Special Edition\" DVD was released on September 30, 2003, by MGM Home Entertainment, which featured minor changes to the film, particularly with its subtitles. The opening titles stating \"This is a true story\" have been changed in this edition from the actual titles on the film print to digitally inserted titles. Also, the subtitle preceding Lundegaard's arrest \"Outside of Bismarck, North Dakota\" has been inserted digitally and moved from the bottom of the screen to the top. The special edition of Fargo was repackaged in several Coen brothers box sets and also as a double feature DVD with other MGM releases. A Blu-ray version was released on May 12, 2009, and later in a DVD combo pack in 2010. On April 1, 2014, in commemoration for the 90th anniversary of Metro-Goldwyn-Mayer, the film was remastered in 4K and reissued again on Blu-ray. On May 3, 2017, Shout! Factory announced a 20th anniversary collector's Steelbook edition on Blu-ray, limited to 10,000 copies. The Steelbook was released on August 8, 2017.</p><br/><h3>Television series</h3><p>In 1997, a pilot was filmed for an intended television series based on the film. Set in Brainerd shortly after the events of the film, it starred Edie Falco as Marge Gunderson and Bruce Bohne reprising his role as Officer Lou. It was directed by Kathy Bates and featured no involvement from the Coen brothers. The episode aired in 2003 during Trio's Brilliant But Cancelled series of failed TV shows.</p><p>A follow-up TV series inspired by the film, with the Coens as executive producers, debuted on FX in April 2014. The first season received acclaim from both critics and audiences. Existing in the same fictional continuity as the film, each season features a different story, cast, and decade-setting. The episode \"Eating the Blame\" reintroduced the buried ransom money for a minor three-episode subplot. Three further seasons have been made thus far; the fourth was released on September 27, 2020.</p><br/>"
  },
  "errorMessage": ""
}