{
  "imDbId": "tt0042192",
  "title": "All About Eve",
  "fullTitle": "All About Eve (1950)",
  "type": "Movie",
  "year": "1950",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/great-movie-all-about-eve-1950",
      "rate": "100",
      "content": "The movie's strength and weakness is Anne Baxter, whose Eve lacks the presence to be a plausible rival to Margo, but is convincing as the scheming fan. When Eve understudies for Margo and gets great reviews, Mankiewicz wisely never shows us her performance; better to imagine it, and focus on the girl whose look is a little too intense, whose eyes a little too focused, whose modesty is somehow suspect."
    },
    {
      "publisher": "Empire",
      "author": "David Parkinson",
      "link": "https://www.empireonline.com/movies/reviews/eve-review/",
      "rate": "100",
      "content": "The stinging bon mots occasionally sound handcrafted rather than raspingly spontaneous, but aspiring actress Anne Baxter’s rise to the top over the corpse of her supposed idol, Bette Davis, remains rousing and endlessly amusing."
    },
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://www.nytimes.com/reviews/movies?res=9A0CE1DB1738E73ABC4C52DFB667838B649EDE",
      "rate": "100",
      "content": "Mr. Kaufman and Mr. Hart might even find themselves outclassed by the dazzling and devastating mockery that is brilliantly packed into this film."
    },
    {
      "publisher": "",
      "author": "The Guardian",
      "link": "https://www.theguardian.com/film/2006/mar/31/dvdreviews.drama",
      "rate": "100",
      "content": "If you're not interested in all the backstage tittle-tattle, just settle back and enjoy a film whose script is studded with barbed and quotable bons mots, the finest ever part by suave cad George Sanders and a memorable cameo by Marilyn Monroe as an aspiring starlet (practically everyone was playing variations of themselves)."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/all-about-eve",
      "rate": "100",
      "content": "All About Eve possesses one of the best screenplays ever to grace the silver screen. It also has one of the best performances by an actress in the history of Hollywood features."
    },
    {
      "publisher": "Time Out",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "Set in the Broadway jungle rather than among the ‘sun-burnt eager beavers’ of Hollywood, Joseph L Mankiewicz’s film dissects the narcissism and hypocrisy of the spotlight as sharply as Wilder’s, but pays equal attention to the challenges of enacting womanhood."
    },
    {
      "publisher": "New York Daily News",
      "author": "Kate Cameron",
      "link": "https://www.nydailynews.com/entertainment/oscars/bette-davis-better-eve-article-1.2085273",
      "rate": "100",
      "content": "All About Eve is not only a brilliant and clever portrait of an actress, it is a downright funny film, from its opening scene to the final fadeout."
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/movies/all-about-eve/review/2000106643/",
      "rate": "100",
      "content": "ALL ABOUT EVE is the consummate backstage story, a film that holds a magnifying glass up to theatrical environs and exposes all the egos, tempers, conspiracies and backstage back-biting that make up the world of make-believe on Broadway."
    },
    {
      "publisher": "The New Yorker",
      "author": "Richard Brody",
      "link": "https://www.newyorker.com/culture/richard-brody/movie-week-all-about-eve",
      "rate": "100",
      "content": "All About Eve is one of the greatest movies about theatre—an idea that, in itself, opens an ironic abyss into which Mankiewicz spelunks with an impish, riotous aplomb."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1950/film/reviews/all-about-eve-4-1200416775/",
      "rate": "90",
      "content": "All About Eve has substance in virtually every dramatic and romantic mood, which have been given proper shading and projection by producer Darryl F. Zanuck and Mankiewicz."
    }
  ],
  "errorMessage": ""
}