{
  "imDbId": "tt0042192",
  "title": "All About Eve",
  "fullTitle": "All About Eve (1950)",
  "type": "Movie",
  "year": "1950",
  "items": [
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw1195687",
      "warningSpoilers": false,
      "date": "17 October 2005",
      "rate": "10",
      "helpful": "112 out of 138 found this helpful.",
      "title": "A Magnificent Timeless Tale of Ambition, Manipulation and Betrayal - Certainly One of the Best Classics Ever",
      "content": "The ambitious Eve Harrington (Anne Baxter) gets close to the great and temperamental stage artist Margo Channing (Bette Davis) and her friends Karen Richards (Celeste Holm) and her husband, the play-writer Lloyd Richards (Hugh Marlowe); her boyfriend and director Bill Sampson (Gary Marrow); and the producer Max Fabian (Gregory Ratoff). Everybody, except the cynical critic Addison DeWitt (George Sanders), believe that Eve is only a naive, humble and simple obsessed fan of Margo and they try to help her. However, Eve is indeed a cynical and manipulative snake that uses the lives of Margo and her friends to reach her objectives in the theater business.\"All About Eve\" is a magnificent timeless tale of ambition, manipulation and betrayal, and certainly one of the best classics ever. Everything perfectly works in this movie: the direction is very precise and tight; dialogs are very acid and intelligent; Bette Davis, Anne Baxter, George Sanders and Celeste Holm have awesome performances in very powerful characters; the dramatic story is amazingly good, showing what an evil person can plot to reach fame and success. I believe this movie will always be among my ten favorite movies ever. My vote is ten.Title (Brazil): \"A Malvada\" (\"The Wicked\")"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2076000",
      "warningSpoilers": false,
      "date": "4 June 2009",
      "rate": "10",
      "helpful": "39 out of 46 found this helpful.",
      "title": "Wow, an 11 if possible!",
      "content": "All About Eve is my idea of a perfect film,(and I am 17) beautiful and brooding at the same time. People consider this as one of the finest films ever made, and I cannot disagree. This and Shawshank Redemption are actually films that deserve to be in the top 250. The black and white cinematography is gorgeous, and the script is sharp and focused with great lines such as \"Fasten your seat belts, it's going to be a bumpy night\". The direction is excellent, and this is further advantaged by a terrific cast, a very good subject matter and sumptuous costumes. I couldn't help being captivated by Bette Davis's performance as Margo Channing, her presence in the film is actually the film's main merit. Davis was an incredible actress, and while not exactly pretty compared to Maaureen O'Hara and Rita Hayworth and not very easy to work with at times, she always brought a sense of command to all her roles, especially in this film. I still think that All About Eve is her best film, I honestly do, and she is well supported by a terrific supporting cast with the likes of the idealistic Anne Baxter and the suave George Sanders. All in all, a beautiful film, that is a must-see, if you haven't seen it already. It is quite long, but it is well worth watching for Davis's performance. 10/10 Bethany Cox"
    },
    {
      "username": "JohnHowardReid",
      "userUrl": "https://www.imdb.com/user/ur12596887",
      "reviewLink": "https://www.imdb.com/review/rw3793117",
      "warningSpoilers": true,
      "date": "30 August 2017",
      "rate": "10",
      "helpful": "22 out of 25 found this helpful.",
      "title": "Just Brilliant!",
      "content": "Brilliantly acted and cleverly characterized, with sparkling dialogue that mercilessly parries the gloss from the New York theater world's highly sophisticated veneer, \"All About Eve\" is a scintillating comedy of manners that compels rapt attention for the whole of its 2¼ hours. We like George Sanders, pointing out Gregory Ratoff to his escort, Marilyn Monroe (whom the script describes as \"a member of the Copacabana school of acting\"), with the words: \"There's a real live producer, honey! Go and do yourself some good!\" And the final scene, in which Sanders asks Barbara Bates, \"Do you want some day to have an award like that of your own?\" — \"More than anything else in the world!\" she answers. \"Then you must ask Miss Harrington how to get one\", he replies. \"Miss Harrington knows all about it!\"It is often complained of Mankiewicz's work that it is too stagey and too talkative, that there is not sufficient movement. There is some justice in this charge in the consideration of such films as Five Fingers, The Quiet American, House of Strangers, and Dragonwyck; certainly Mankiewicz's two spectacles, Guys and Dolls and Cleopatra, are much improved by sharp editing. But in his best films, The Late George Apley, A Letter to Three Wives, All About Eve, People Will Talk (which I regard as his masterpiece — it was too off-beat, unfortunately, for contemporary audiences or critics to appreciate), and The Barefoot Contessa, any trace of over- talkativeness is more than offset by the range and variety, the unusualness of the characters. Moreover, it is the characters themselves that determine the plot — not the fate or some external force.Thus, in All About Eve, Margo Channing is the victim of her egocentricity, Sampson the victim of his own cynicism and Richards, the victim of his own ingenuousness. Eve Harrington is cunning and ruthless enough to exploit these traits in her climb to stardom. Besides Mankiewicz's two awards, All About Eve also won statuettes for Best Picture, Best Supporting Actor (George Sanders), Best Costumes and Best Sound Recording. Also, producer Darryl Zanuck won the Thalberg Memorial Award for consistent high-quality production over the previous three years.The film also won the New York Film Critics' Citation for Best Picture, Best Direction and Best Actress (Bette Davis). Actually, I thought that Miss Davis' performance, fine as it was, was overshadowed by Anne Baxter's interpretation of the scheming Eve. To cover with a winning veneer of innocence a character that would not stop at blackmail or adultery to win stardom, cannot have been an easy assignment for a young actress; yet Miss Baxter brought it off flawlessly.OTHER VIEWS: I'd had the general idea for All About Eve in mind for a long time. But I never had a middle, a second act. Then our New York office submitted a short story by Mary Orr called \"The Wisdom of Eve\" — later a radio script — and I had my second act. Incidentally, Zanuck deserves some credit for what happened. He was the only studio head in town with the courage and intelligence to try new things. I don't think I could have made this picture on any other lot but 20th Century- Fox. -- J.L.M."
    },
    {
      "username": "Lechuguilla",
      "userUrl": "https://www.imdb.com/user/ur2420383",
      "reviewLink": "https://www.imdb.com/review/rw2210508",
      "warningSpoilers": false,
      "date": "20 February 2010",
      "rate": "9",
      "helpful": "41 out of 47 found this helpful.",
      "title": "Superb Acting And Dialogue",
      "content": "What a movie! It's the cinematic ideal, the standard by which subsequent films are judged, at least in terms of acting and dialogue. Maybe the camera, which does nothing but sit there as the actors act, could have been made a little less static. But the story screams stage play, which implies lots of talk and not much \"action\". The film doesn't pretend to do all things. But what it does do, it does extremely well.As Margo, Bette Davis gives what I would consider one of the best performances, if not the best performance, in any film I have ever seen. She truly becomes Margo, that \"fixture of the theater\", so beloved yet so insecure. And as Eve, \"the mousy one, with the trench coat and the funny hat\", breathy Anne Baxter proves adept at subtleties that allow her character to change gradually over time.Then there's George Sanders who effortlessly slips into the role of witty, urbane, pompous Addison DeWitt, columnist magnifico, a man whose high opinion of himself allows him to declare to us, as viewers, that he is \"essential to the theater\". Celeste Holm and reliable Thelma Ritter give topnotch performances as well.And the Mankiewicz script, which tells the story of a group of theater people, is heavy on dialogue, but it's totally believable, as characters talk shop and interrelate, by means of suitable verbal conflict and subtle subtext. Even more than that, the dialogue is witty and clever, with tons of theatrical metaphors, like when Bill (Gary Merrill) angrily tells Margo: \"And to intimate anything else doesn't spell jealousy to me, it spells a paranoid insecurity that you should be ashamed of.\" To which Margo just as angrily spits out: \"Cut, print it, what happens in the next reel? Do I get dragged off screaming to the snake pits?\"One of my favorite scenes has several people sitting on a stairway at a party. A curvaceous but bird-brained Miss Casswell (Marilyn Monroe), \"from the Copacabana school of acting\", desires another drink. \"Oh waiter!\", she yells out. Addison schools her: \"That isn't a waiter, my dear; that's a butler.\" To which she fires back: \"Well I can't yell 'Oh butler', can I? Maybe somebody's name is Butler\". Addison then concedes: \"You have a point, an idiotic one, but a point.\"I'm not sure I really like the characters in this film. Generally, they're self-absorbed, vain, haughty, and backbiting. They're not all that likable. And that would be my only serious complaint.Otherwise, \"All About Eve\" is a film that excels at great language and great acting. If ever there was a film that deserves the status of \"classic\", this is surely it."
    },
    {
      "username": "Don-102",
      "userUrl": "https://www.imdb.com/user/ur0187170",
      "reviewLink": "https://www.imdb.com/review/rw0041756",
      "warningSpoilers": false,
      "date": "20 March 1999",
      "rate": "10",
      "helpful": "106 out of 120 found this helpful.",
      "title": "All About Great Writing and Great Acting...",
      "content": "In show business, there is probably an Eve Harrington born every day. Someone who butters up to a performer of note, acting innocently, revealing none of the coldhearted ambition they really have. Anne Baxter plays this type of person to a tee. She looks like a baby-faced fan, but little do we know, there is a fame machine at work in her mind. Bette Davis, as Margo Channing, star of the stage, is a veteran who has seen it all. She is quite the egotist. Margo is a brilliant actress and she knows it. Eve discovers her blind spot and moves in on her like a quiet storm. This is the premise of ALL ABOUT EVE, Joseph L. Mankiewicz's masterpiece of sly wit and subtle manipulation. Mankiewicz also wrote the picture (winner of the Best Picture Oscar of 1950) with such skill, the talented cast need only to memorize the lines and deliver them with the proper technique.The performances are great, regardless, especially by Bette Davis and the always detested George Sanders, one of my favorite actors of the Golden Age of Hollywood. The film is narrated initially by Sanders, who plays a ruthless swine of a theatre critic, then by Celeste Holm, the wife of Eve and Margo's playwrighter, then Bette Davis in the performance of a lifetime. The movie is about 90% dialogue, much like a play. The words are so crisp and sharp, you never sway or lose interest. These characters are just too interesting. Bette Davis has a cavalcade of unforgettable dialogue. \"Fasten your seatbelts. Its going to be a bumpy night!\" This is the one everyone remembers, but I would be remiss to get into any others.The picture runs well over 2 hours, but it doesn't seem like enough. Mankiewicz could've held a seminar of screenwriting by showing this. George Sanders is the only actor of the roster to bring home an Academy Award, and rumor has it Davis and Baxter, who was just 27 at the time, were feuding during much of the shoot and lusted the Oscar. Time has been very good to the film as well. 1950 was a wonderful year for movies and ALL ABOUT EVE's artistic equal that year was the equally well-written SUNSET BOULEVARD, which took us behind the scenes of a tainted Hollywood. EVE takes on theatre and treats Hollywood like an afterthought. There are many references to the film industry, usually involving the scenes with Margo Channing's boyfriend, who is attempting to make a career on the silver screen.The movie is highly unpredictable, especially the last scenes which tie the ideas of the story up. There is an Eve everywhere and each character gets what he or she deserves. Fasten the belts and listen up. This is screenwriting at its finest."
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw7419554",
      "warningSpoilers": false,
      "date": "7 October 2021",
      "rate": "10",
      "helpful": "16 out of 18 found this helpful.",
      "title": "Just a perfect film, and I know nothing about the theater.",
      "content": "And you really don't need to know about the theater, because it is ultimately about the many facets of human nature.I absolutely adore this movie. It helps when I love Bette Davis, but this is something altogether different from your run-of-the-mill drama, much less your typical Bette Davis melodrama. First and foremost, the screenplay is quite simply one of the best ever written alongside Network and a few others. Mankiewicz's tremendous knack for biting language is glorious. He had shown shades of this gift in his screenplay for A Letter to Three Wives the previous year, but this screenplay is something else.A screenplay, nevertheless, can't singlehandedly make a film as brilliant as this. Mankiewicz pairs his writing with superb direction and the performances are splendid. Davis gives almost undoubtedly the best performance of her illustrious career as the aging Margo Channing and Anne Baxter turns in a quite good performance that sneaks up on you before her character, Eve Harrington, falls prey to herself. Celeste Holm is great as the conflicted friend of both Margo and Eve, Karen Richards. Thelma Ritter delivers a funny, yet powerful performance as Birdie, a part that is inconsequential at first glance. My favorite performance, however, is the absolutely magnificent supporting performance given by George Sanders as the cynical, sardonic, conniving journalist Addison DeWitt. His voice is perfect and his cane and cigarette holder are forever etched in my memory. Hugh Marlowe as Lloyd Richards is really a blank, though a better casting choice probably would have resulted in a more complex interpretation of this admittedly bland character.It's rather ironic when Margo confides to Karen that she wants Bill (Gary Merrill) to love her, the woman, not the actress, because the actress will fade with time. Eve worries over the difference in their ages, Eve being eight years older than Bill. Bette Davis and Gary Merrill did get married, and though it lasted longer than Davis' other unions, it ultimately failed. Davis later said that their mistake was that they thought they were marrying the characters in the film, and when the film faded into the past, there was no basis for a relationship."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3286819",
      "warningSpoilers": false,
      "date": "29 July 2015",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "two great performances",
      "content": "In June, actress Eve Harrington (Anne Baxter) is the youngest to win the Sarah Siddons Award. Flash back to October, shy Eve is waiting outside of the theater for Margo Channing (Bette Davis) after her lead performance. The playwright's wife Karen Richards notices her there as always after every performance and invites her backstage. The obsessed fan tells them that she lost her husband in the war. Eve insinuates into Margo's life first by moving in and then becoming her assistant. Slowly, Eve schemes to undermine Margo and take over her place.This is one of Bette Davis' greatest role. She is pitch perfect as the aging star. Then there is Anne Baxter who personifies innocence at the start. It's a bit of a shock to see her spiral in her ambitions. It dawns on the audience that they've been had. These two great performances anchor a compelling story of the rise and fall of stardom."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8903234",
      "warningSpoilers": false,
      "date": "3 March 2023",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Fasten your seatbelts, it's a bumpy night.",
      "content": "Talented, but ageing actress Margot Channing is captivated by young fan Eve, who's devoted fandom and sad back story are enough for Margo to take her to her heart, and her home, a lamb is hiding out in a wolf's clothing, but which one?One of the best movies, from one of the golden eras of movies. All About Eve stands up as one of the greatest movies of all time. It's a fascinating study of manipulation, adoration and desire. It's incredibly clever, so much more is going on than you first think, it's an incredibly deep story.You are almost lulled into a false sense of security, you think all is sweet and calm in the garden, but that unthinkable is actually happening, it just takes a little time to realise it.It's beautifully produced, made back in 1950 it still looks incredible. It's well paced and totally absorbing, you're almost unaware of the running time.Bette Davies so often gave show stealing performances, and this is yet another, she is captivating, however, she is equalled by Ann Baxter, who's quiet, subtle performance is equally powerfulWatch out for a young Marilyn Monroe, who's first scene is jaw dropping, that smile could melt icebergs.Flawless, 10/10."
    },
    {
      "username": "marcosaguado",
      "userUrl": "https://www.imdb.com/user/ur3192976",
      "reviewLink": "https://www.imdb.com/review/rw0041797",
      "warningSpoilers": false,
      "date": "19 March 2004",
      "rate": "10",
      "helpful": "278 out of 341 found this helpful.",
      "title": "A Miracle Of A Movie",
      "content": "What a genius Joseph L Manckiewicz was. A literary script that is totally accessible. A melodrama for the thinking man. A film that is as engrossing and entertaining every time you see it. Bette Davis touches all the raw nerves of her mythological career. Anne Baxter never went this far. Thelma Ritter became a sort of icon. Marilyn Monroe gives us a preview of forthcoming attractions as a graduated from the \"Copacabana\" academy of dramatic arts. Celeste Holm represents us, all of us and George Sanders creates a prototype for a cultured monster that is immediately recognizable. I don't recall another film in which the nature of selfishness is so wittily dissected. A total triumph."
    },
    {
      "username": "Bil-3",
      "userUrl": "https://www.imdb.com/user/ur0316001",
      "reviewLink": "https://www.imdb.com/review/rw0041732",
      "warningSpoilers": false,
      "date": "27 March 2001",
      "rate": "",
      "helpful": "51 out of 60 found this helpful.",
      "title": "***** Perfect!",
      "content": "Here's perfect writing if ever a movie ever had it-where did Joseph L. Mankiewicz come up with these people? Who would have thought he could not only revive Bette Davis' career with her greatest-ever role, but actually make her even more fascinating than she ever was before? Davis plays famous and established actress Margo Channing, a self-centred and tough but vulnerable woman who is purused relentlessly by Eve Harrington (Anne Baxter), a seemingly innocent woman who worships Channing-she even becomes her personal assistant. However, her devotion soon becomes sinister, and Margo lets her friends know, though they just think she's being selfish and unfair. Celeste Holm is excellent as Margo's best friend, who at first is on Eve's side but eventually sees how conniving Eve can be and how ruthless she is in climbing to the top. The party scene early on in the film features some of the film's best lines (`Fasten your seat belts it's going to be a bumpy night!'), though my personal favourite is when Davis tells Baxter to put her award `where you heart should be'; Margo Channing is just about the best female character of the fifties. Features Marilyn Monroe in an early role."
    },
    {
      "username": "gbrumburgh",
      "userUrl": "https://www.imdb.com/user/ur1042377",
      "reviewLink": "https://www.imdb.com/review/rw0041730",
      "warningSpoilers": false,
      "date": "22 February 2001",
      "rate": "10",
      "helpful": "111 out of 134 found this helpful.",
      "title": "A masterpiece of old-style theatre back-stabbing with a cherished, hand-picked cast.",
      "content": "THE definitive saga of backstage brouhaha ever dished out by Hollywood. A triumph of screen-writing, never will one see such ripe, acrid dialogue spewed out like this again -- every indelible scene gloriously stained with classic one-liners. An actress wanna-be looking for her big break carefully worms her way into the glamorous life of a legendary Broadway star, then tries to supplant her privately and professionally.A sterling, incandescent cast provides the fire and music to this concerto of theatre attitude. Bette Davis knew she was handed a dream role when she was cast as Margo Channing, the indomitable diva caught up in the throes of mid-life crisis both on- and off-stage. Not willing at all to deal with it tactfully, she makes life a living hell for anyone within knife-throwing distance. This juicy, once-in-a-lifetime part turned Davis' own flagging middle-aged career back on its feet, especially coming on the heels of one of her biggest \"dumps\" ever, \"Beyond the Forest.\" Remarkable as it may seem, Bette was not the first choice here, replacing an injured Claudette Colbert. With all due respect to Colbert, Bette Davis was BORN to play Margo Channing. A mauling lioness one minute, a coy, declawed pussycat the next, Davis relishes every wickedly bitchy scene she gets to tear into. Yet in her more introspective moments, she evokes real sympathy for Margo (as only a true star can) especially when her character missteps. It's a resounding victory for the Queen Bee in every way, shape and form.Her \"supporting cast\" also manage to create a buzz of excitement. Gary Merrill and Hugh Marlowe, known for their relative blandness, are splendid here in their respective roles as queen bee's lover and playwright. While Merrill's Bill Sampson tames Margo the woman with gutsy directness and virile passion, Marlowe's Lloyd Richards appeases Margo the star with flattery, great dialogue and a calm resolve. Worth watching, then, are their fireworks scenes with Margo when intelligence and restraint no longer work. Debonair George Sanders gives customary snob appeal and dry cynicism to his waspish, ultimately loathsome columnist Addison DeWitt, who swarms around Broadway's elite knowledgeable in the fact his lack of heart and poison pen yield exclusive rights and power. The most sensitive and sensible one in the collective bunch, the one lacking a true stinger, is Karen Richards (played wonderfully by Celeste Holm), Margo's best friend and confidante, who finds herself caught between the queen and a hard place when she accidentally makes a pact with the devil. Thelma Ritter couldn't be overlooked if she tried. An inveterate scene-stealer, she weathers strong competition this time in a movie crammed with clever conversation and pungent zingers. As coarse but well-meaning Birdie Coonan, a brash ex-vaudevillian now the queen's ever-loyal \"drone\", Ritter's character properly handles her boss's antics with amusing grit and backbone. On the periphery of this Broadway beehive is mop-faced Gregory Ratoff as an edgy, gullible, thick-accented producer, Marilyn Monroe as a hopelessly vacuous starlet, and Barbara Bates, as a novice schemer with a very bright future, all making their few scenes count -- especially Bates, who is forever enshrined in the film's stunning final shot.The chief thorn in Margo's (and everybody's) side, and the other real star of this picture, is the queen's titular lady-in-waiting, Eve Harrington. As played by Anne Baxter, this role is probably the most delicate and difficult of all for the weight and believability of this drama falls squarely on her shoulders. Unfairly overlooked all these years by the flashier posturings of Davis, Baxter does a beautiful job of drawing initial pathos then panic as she slowly unveils her own lethal stinger. By film's end, Baxter is directly on par with her scenery-chewing co-star. Killer to killer. Champion to champion.Six Oscars including Best Picture, Best Director (Joseph L. Mankiewicz), Best Screenplay (also Mankiewicz) and Supporting Actor (George Sanders) went to this cinematic bon mot. Had Bette Davis and Anne Baxter not competed as Best Actress (Baxter refused to place herself in the Supporting Actress category), it would have drummed up two more awards to be sure.Developing a faithful cult following over the years, this film deserves to be on everybody's \"top ten\" list."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw8754932",
      "warningSpoilers": false,
      "date": "24 December 2022",
      "rate": "9",
      "helpful": "10 out of 11 found this helpful.",
      "title": "All About Deceive...",
      "content": "Your number one fan, has finally met you, she's made quite a connection, and now you're paired just like a two, organises your affairs, running up and down the stairs, whatever you need doing, that's exactly what she'll do. It's not too long before the sycophant attempts, to take a little piece, of all that she has dreamt, front and centre of the stage, with an audience engaged, all established on embellishing pretence. But there's a price that success usually requires, after someone has initiated fires, your enabler's a tiger, a cunning, devious backbiter, who'll have you dangle from his strings and walk his wires.Timeless and enduring with outstanding performances that to this day still take your breath away."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1434648",
      "warningSpoilers": false,
      "date": "30 July 2006",
      "rate": "10",
      "helpful": "17 out of 23 found this helpful.",
      "title": "Stealing One's Life",
      "content": "This film isn't really ALL About Eve. It's about a young woman's schemes for theatrical success and how she affects all the lives around here.The protagonist is Anne Baxter playing Eve Harrington. Celeste Holm, wife of playwright Hugh Marlowe sees her night after night outside the theater where Bette Davis is starring in her husband's play. Eve tells a sad tale of woe to Bette, Celeste, Hugh, and director Gary Merrill once she's admitted into the star's inner sanctum. The only one who's skeptical is Bette's maid Thelma Ritter. Baxter is admitted into Davis's entourage.Davis, Daxter, Holm, and Ritter all received Academy Award nominations, the first two for Best Actress and the latter two for Best Supporting Actress. The first three already had won awards so more than likely they canceled each other out in the voting. Davis and Baxter lost to Judy Holliday for Born Yesterday and Josephine Hull in Harvey beat out Holm and Ritter. But in many ways these may have been the career roles for all these players. Bette Davis made a comeback with this part of Margo Channing. She had left Warner Brothers the year before after a string of very forgettable post World War II films. Davis really was Margo Channing, a big star who was now getting on in years and refused to realize she could not play leading parts for too much longer. Bette had a whole lot of insight to bring to Margo.Anne Baxter had won a Best Supporting Actress Award for The Razor's Edge. But Eve Harrington is miles apart from the tragic Sophie. Sophie is a decent soul who through a tragic accident that claimed her husband and baby went completely bonkers. Eve is a cold and calculating little minx who sets her sights on stardom and she's not too scrupulous about what she has to do to attain it. Both parts show the depths of this very underrated actress.I've always thought Celeste Holm has always been ignored unfairly when people talk about All About Eve. She and George Sanders narrate the film in different spots because the film is told in flashback as Eve Harrington is being presented the Sarah Siddons Award. It's her perspective from which Eve and the rest of the characters are viewed. She's an essentially decent soul, not as ego driven as the others who make their living in the theater. Her life is in her marriage to Hugh Marlowe and it nearly is wrecked because she took pity on a waif outside a theater. Celeste is living proof of the old adage about no good deed going unpunished.All About Eve got a few awards though including the big one for being The Best Picture of 1950. Joseph Mankiewicz got his second Best Director Oscar, he had won the previous year for A Letter to Three Wives.And 1950 proved to be the high point of George Sanders career as he took home a Best Supporting Actor for that 'fishwife' theatrical columnist Addison DeWitt. He also that year stole Cecil B. DeMille's Samson and Delilah's with his portrayal of the Saran of Geza. In fact the Saran was a BC version of Addison DeWitt.Sanders is the only other person who sees Baxter for what she is besides Thelma Ritter. He turns out to be quite the investigative reporter and his confrontation with Baxter is the climax of the film. He's not a nice man, but that may make him the only one really equipped to deal with Baxter if she becomes successful.All About Eve hasn't aged a bit in 56 years. I'm not sure about not making films like this any more, but they sure don't write them like this. It's one film you dare not put the mute button on or go to the refrigerator because you'll miss some witty gem. They come pretty fast and furious.And yet for all the sophistication of the film, Margo and her circle aren't a bad bunch. Naive yes, when it comes to Eve, but this con woman takes advantage of the fact that people want to believe someone like Baxter when she tells her tale and they have good extincts.Fortunately none of their good deeds are permanently punished."
    },
    {
      "username": "jotix100",
      "userUrl": "https://www.imdb.com/user/ur1406078",
      "reviewLink": "https://www.imdb.com/review/rw0041816",
      "warningSpoilers": false,
      "date": "18 September 2004",
      "rate": "10",
      "helpful": "21 out of 30 found this helpful.",
      "title": "The understudy",
      "content": "Joseph L. Mankiewicz was a genius and this is his masterpiece, without a doubt! Mr. Mankiewicz's timeless tale for this film was something that paralleled the great writing of another author that knew the inside of the human race: Honore de Balzac.In this story about the theater, all the elements come together to weave a perfect movie, one that will endure the passage of time. Mr. Mankiewicz's screen play is about blind ambition and to what extremes does a person goes in order to realize that goal. The writer seems to be telling us that to Eve Harrington, her end justified the means by which she arrived at getting where she got.The cast assembled for the movie was the perfect blend of styles and acting ability. This film is dominated by Eve Harrington, who, Anne Baxter plays to perfection. We first see her as the adoring fan to Margo Channing, the star of the hit play on Broadway. She will do anything to get to where Margo Channing is. In a way, Eve is a user of the worst kind. She used Karen Richards, Margo's best friend in order to get in the theater world where she finally makes a splash.In that theatrical world, we encounter all kinds of sub species that tend to gravitate toward the limelight where others are shining brighter. They will do anything in their power in order to 'belong' to the glamour and all the things that go hand in hand in that circle.Anne Baxter was an amazing Eve Harrington. She was a young actress then, who showed a lot of talent and was perfectly cast for that role. Bette Davis makes Margo Channing come alive. Ms. Davis shows us what is to be at the top of her class and suddenly see her world begin to crumble, which in a way, it's the way of the theater. The theater and the movies are cruel to the stars that dare to age in front of our eyes. There will always be prettier and younger actresses to bask in their moment of glory in front of the adoring public, but watch out, never get old!George Sanders as the bitchy Addison Dewitt, is the maker and breaker of many a career. He has the power to destroy anyone that doesn't play by his rules. Mr. Sanders was excellent by being the cynic in a make believe land. In a way, the writer is telling us that even then, there was something rotten in theater critics that will ruin a play by just disliking it in the press. Celeste Holm is also effective as Karen Richards, a friend indeed, until she is used to give Eve her big break. Thelma Ritter is a delight to watch as Birdie, the wise maid that sees right through a phony when she sees one. Gary Merrill, George Ratoff, Hugh Marlowe and a young and fresh Marilyn Monroe complete the cast.Never before did a movie packed such an impact to reveal so much about the human comedy, as in this one. After all, that comedy, or call it tragedy, has existed since the beginning of time. All this because a brilliant Joseph L. Mankiewicz brought to the screen to dazzle audiences forever."
    },
    {
      "username": "kehoerobert",
      "userUrl": "https://www.imdb.com/user/ur26945651",
      "reviewLink": "https://www.imdb.com/review/rw2457622",
      "warningSpoilers": false,
      "date": "12 July 2011",
      "rate": "10",
      "helpful": "77 out of 85 found this helpful.",
      "title": "Icons On The Verge",
      "content": "As close to perfection as they come. A film than can be viewed again and again without ever getting tired. Bette Davis's Margo Channing is a film icon of major proportions. A point of reference. Her fear of the abyss is as human as it is at the center of this selfish, insecure, sacred cow. She is surrounded by some other sensational women. Thelma Ritter, Celeste Holm, Anne Baxter and in a tiny but telling part, Marilyn Monroe - a graduate from the Copacabana school of dramatic art. Wittily prophetic. George Sanders is another piece of extraordinary casting and writing. \"I'm essential to the theater\" Indeed. And here is a film that has become essential to anyone who loves movies\""
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw3657275",
      "warningSpoilers": false,
      "date": "8 March 2017",
      "rate": "",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Bitterly Funny and Perfectly Acted",
      "content": "All About Eve (1950) **** (out of 4) Broadway star Margo Channing (Bette Davis) invites a woman named Eve (Anne Baxter) into her life because she's an adoring fan but before long the much older Margo begins to fear that the younger woman wants more than friendship. Soon Eve's plans of becoming a star herself come out and she's not going to let anything get into her way.ALL ABOUT EVE was, at the time, the film that captured the most Oscar-nominations with fourteen and it eventually won six including Best Picture and Best Supporting Actor for George Sanders. If you're a fan of movie stars, directors, producers or anyone in that profession then ALL ABOUT EVE is certainly a must see. Sure, perhaps it does run on a bit too long but there's no question that it contains one of the greatest ensemble acting classes that you'll ever see as well as some perfect direction by Joseph L. Mankiewicz and his screenplay is bitterly sharp and funny.So much has been said about this film over the years that I couldn't possibly add anything new. What I really respect about the film is the fact that it really could have gone over-dramatic but instead it plays out like a black comedy where we're dealing with some at times ugly people who get out done by a couple snakes in the grass. The way the mystery of this Eve character plays out is so flawlessly done that it's impossible to hate her because you see her game and her goal. You then start to see that she probably didn't do anything that others wouldn't have done also.Davis gets the majority of the credit in the acting department and there's no doubt that she's perfect and this helped rebuild the second stage of her career. As great as she is I think she sometimes overcrowds what others in the film do. Both Gary Merill and Hugh Marlow are terrific in the role of the supporting men. You've got Marilyn Monroe in an early bit and she's really funny here. Thelma Ritter is always fun to watch. Then you've got the three best performances in the film. Celeste Holm is simply divine on so many levels here as the woman who opens the gate for the snake to come in. Baxter is simply wonderful at playing so many different sides of this character. There are so many adjectives used about her character and the actress really delivers everything you could hope for. Then there's Sanders who is perfectly delightful as the rather crooked writer with his own game to play.ALL ABOUT EVE contains a really terrific script for these great actors to sink their teeth in. The film is brutally honest and funny about stardom and what one will do to capture their glory. The way the film plays out is wonderfully done and there's no doubt that the film deserves its reputation."
    },
    {
      "username": "smartbomb",
      "userUrl": "https://www.imdb.com/user/ur0740404",
      "reviewLink": "https://www.imdb.com/review/rw0041710",
      "warningSpoilers": false,
      "date": "29 August 2000",
      "rate": "9",
      "helpful": "151 out of 190 found this helpful.",
      "title": "Incredible",
      "content": "I had read comments about the quality of the writing in this film but I really had no idea to what extent this would elevate the experience. The fact is, it leaves me with no other choice than to give it a perfect 10. Unless you see this film, I don't think you'll have the necessary frame of reference with which to to base any expectations on. It's an incredibly engrossing, moving and often comedic experience, but time and time again what knocks you over is the absolute finesse with which this script was crafted. The fact that the acting and direction are flawless and surprisingly natural-seeming (most old movies usually seem stiff or people seem to \"act\" too much) only enhances it that much more. With this film, you can really imagine the *people* the actors are portraying.\"All About Eve\" shows some similarity to one of my other favourite 50s films \"A Face in the Crowd\". Both are studies of fame and celebrity. Eve shows how a person will corrupt themselves in order to attain it, whereas A Face's premise is that fame corrupts those who find themselves in the spotlight. Both have themes that are perhaps even more resonant in our celebrity-obsessed culture now than when they were made. Interestingly, Eve predates A Face by several years.And possibly most interesting of all is the honest and often raw way in which women are portrayed, the strength of their character and the power they wield. The male contingent is practically relegated to the back seat. One might be hard pressed to find a movie quite so \"liberated\" today. So what more can I say? If you love movies and you haven't yet seen it, you've suffered long enough; don't wait another day."
    },
    {
      "username": "MOscarbradley",
      "userUrl": "https://www.imdb.com/user/ur1683855",
      "reviewLink": "https://www.imdb.com/review/rw1708338",
      "warningSpoilers": false,
      "date": "8 August 2007",
      "rate": "10",
      "helpful": "14 out of 19 found this helpful.",
      "title": "Possibly the smartest comedy ever to have come out of Hollywood",
      "content": "They say that talk is cheap but you wouldn't believe it listening to the pearls that drip from the mouths of the characters in this, the greatest of all the dialogue-driven comedies to have come out of Hollywood, (at the time it was nominated for a then record 14 Oscar nominations and won 6). It opens with a monologue that introduces all the leading players that is at once literate and cinematic at the same time and you know instantly that his is, above all, a movie to listen to. (What film-buff doesn't quote its screenplay ad-nauseum; gay men, at least according to \"The Boys in the Band\", are said to know the script by heart). And while drag queens the world over have always based their Bette Davis imitations on the character of Margo Channing, (Davis' greatest role and her greatest performance), the film is never merely camp. The acerbic wit that runs through the film always has a ring of truth to it; the characters, overblown as they are, are always recognizably human.The acting alone is to die for. Can you believe that other actresses were once considered for the role of Margo? (Claudette Colbert?). Davis makes it her own not by acting Margo but by being Margo. I can't think of another role more indelibly suited to an actress than this. In a lesser film she might have swamped her co-stars but Mankiewicz, who wrote and directed, gives everyone equal credence.Anne Baxter was never better than as the poisonous Eve; Celeste Holm, wonderful as the clipped, sophisticated Karen; George Sanders oozing epigrams as if from every pore as the screen's most famous critic, Addison DeWitt, (what a name!). These were career-best performances and in smaller parts, Thelma Ritter's cynical, wise-cracking Dresser, Birdie, and Marilyn Monroe's vacuous Miss Caswell, ('a graduate of the Copocobana school of dramatic art'), are just as unforgettable. In the seventies someone had the, not very bright, idea of turning it into a Broadway musical called 'Applause'. While not half-bad you still came away feeling you had seen a karaoke version of \"All About Eve\"."
    },
    {
      "username": "anita_delre",
      "userUrl": "https://www.imdb.com/user/ur6704919",
      "reviewLink": "https://www.imdb.com/review/rw1148259",
      "warningSpoilers": false,
      "date": "11 August 2005",
      "rate": "10",
      "helpful": "65 out of 75 found this helpful.",
      "title": "About EveryMan, About EveryWoman, About EveryLife",
      "content": "You will see yourself in every character in this very intelligent, entrancing movie. Though set in \"the theatre,\" the story could just as easily have been told in a small town, a corporation  even a religious organization. Being set in the \"glamorous\" world of entertainment  its seems all the more timely in these days of fame, fortune and the insufficiency (almost shame) of being ordinary. The theatre setting also underscores the reality that the world is a stage, and all its people, players.So much to study in this movie: the genuine, trusting (and romantic) human; the streetwise, good, hardworking human, who's seen it all and doesn't embrace it; the jaded, heart-hardened, deceitful loser with power, who admires the same and disdains human goodness; the ambitious sociopath who fools so many; the unsuspecting onlookers who see only the façade of success; the inescapable fact that supreme achievement has been had by very low characters; the painful passage of an aging woman into the light of knowing she's loved for being beautiful beyond her appearance, for being HER; the touching portrayal of her lover who remembers his love for her as he passes on a much younger, beautiful, talented actress; the sorrow of a (betraying) friend who discovers the frightened and lonely heart of her successful friend The dialogue is sharp and clever, barked and growled, smarmy and tender A truly human movie about being human. Go  find yourself in everyone!"
    },
    {
      "username": "Tetsel",
      "userUrl": "https://www.imdb.com/user/ur0150770",
      "reviewLink": "https://www.imdb.com/review/rw0041690",
      "warningSpoilers": false,
      "date": "11 December 1998",
      "rate": "",
      "helpful": "117 out of 166 found this helpful.",
      "title": "Fasten your seat belts...",
      "content": "What can you say about a film like this? It has one of the greatest screenplays ever written, fabulous directing, and sensational performances by Anne Baxter, Bette Davis and George Sanders. And on top of it all, it's got Marilyn Monroe! What more could you want?!? It's full of snappy dialogue, great one liners, and a realistic and interesting plot. The epitome of good movie making. Oh, if only today's filmmakers were forced to watch All About Eve before they were allowed to make their own!"
    },
    {
      "username": "nickenchuggets",
      "userUrl": "https://www.imdb.com/user/ur107418055",
      "reviewLink": "https://www.imdb.com/review/rw7109184",
      "warningSpoilers": true,
      "date": "10 July 2021",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "\"You have every reason for happiness\"",
      "content": "When I first discovered this movie, I didn't think I was going to be impressed by it. I thought that a movie with a predominantly female cast would be a recipe for disaster, since there would be no fighting, conflicts, or betrayals. As it turns out though, women are often more cruel and punishing than men when it comes to getting back at their enemies. It seems obvious now that it's a good movie, since it got 14 Oscar nominations, a record at the time, and won 6. It's also the only movie in history to have four actresses nominated for an academy award. With so many awards and positive reviews to its credit, it might seem like a stupid question, but does the movie still hold up? It is a timeless and intriguing story simply because it's very well written. The movie is about a girl named Margo played by Bette Davis. She is widely popular in the world of theatrical performance, but she's looking a little long in the tooth. She worries about how her biological aging will affect her career, and doubts it will be good. One day, Eve Harrington (Anne Baxter) shows up to Margo's dressing room after one of her performances and tells her how big of a fan she is to the point where Margo thinks she is a bit deranged. Even so, Margo plays nice and lets Eve be a \"friend\" of hers, and Eve eventually goes on to perform in a play that Margo was meant to perform in. A critic watching the play is Mr. DeWitt (George Sanders), and he apparently likes it. Eve and DeWitt form an alliance that is somewhat hostile to Margo, and they openly criticize her for turning a blind eye to young and talented actresses like Eve. Later, Eve takes a role in another play after Margo says she doesn't want it. Eve also wants to marry Margo's friend Lloyd because he can ensure Eve stars in good plays. DeWitt later blackmails Eve because he is convinced she is trying to control him, and insists that he's not foolish. He says he knows her real name is not Eve, but Gertrude Slescynski, and was never married. If Eve tries to marry Lloyd, he will let everybody know these things and she will be done for. At the end, the movie returns to where it started; a ceremony where Eve receives an award, and Margo is in attendance. Despite being there, she does not like Eve in the slightest. Shortly after, it turns out that Eve (now a celebrity) has her own adoring and obnoxious fan named Phoebe. I'm guessing that this ending implies that Phoebe is fated to end up the same way as Eve did when she started idolizing Margo. Eve will act coldly towards her and only pretend to like her, but the naive Phoebe will mistake this for genuine interest. Widely considered one of the best movies ever, it's just obvious after watching it why so many people have this opinion regarding this movie. Pretty much all the characters are brilliantly played, and I don't think Bette Davis needs any introduction. Margo is the type of woman that wouldn't look out of place in a noir movie, as she is ruthless, cunning, and dangerous to those that get on her bad side. Anne Baxter plays Eve, the title character for certain, but I would think Margo is the real main character here. Eve's long journey from a generic nobody to a celebrity is caused solely by Margo's influence, and in the end, Eve discovers she might not enjoy being famous after all. George Sanders plays Mr. DeWitt, who is originally shown to be a sympathetic theater critic who is willing to give the inexperienced Eve some praise, but then shows up later to threaten her with confidential information about her life. He's unapologetic and just doesn't care about her feelings, and I think we can all agree the part where he hits Eve in the face definitely wouldn't be allowed today. Although a very minor character, a young Marilyn Monroe even makes an appearance during one of Margo's parties. To summarize, All About Eve is truly one of cinema's all time classics, and its story is an example of how there is no worse feeling than being hated by someone you look up to."
    },
    {
      "username": "richard-1787",
      "userUrl": "https://www.imdb.com/user/ur15780544",
      "reviewLink": "https://www.imdb.com/review/rw3494480",
      "warningSpoilers": false,
      "date": "26 June 2016",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Blood-chillingly brilliant",
      "content": "I do not know of any movie that plumbs the depths of the human heart - or the empty cavity where one should be - to paint a blacker picture of it. Addison de Witt is repeatedly described as a snake, but even he, as he recognizes, is not as ruthless as Eve Harrington. Eve would truly kill her own mother for a good role - and remember the experience so she could play it convincingly on stage. She gives you the willies.Critics have raved about Bette Davis' performance as Margo Channing, and she is certainly wonderful in the part. As, of course, is George Sanders as the evil Addison de Witt.But what makes the movie so captivating through to the end is Anne Baxter. You desperately try to figure out when her Eve Harrington is acting and when she is being sincere. You want to know. But Baxter always leaves you wondering. Is she overacting just a LITTLE too much? Is she sincere? It's an astounding performance.And, of course, the script, which oozes venom, is brilliant. But we only appreciate it because it is delivered by great actors/actresses at the top of their form directed by the author of that script, Joseph L. Mankiewicz.This is a riveting movie. It is brilliantly made. You will enjoy every perfect minute of it.But you will have a hard time trusting even your best friend after you finish watching it."
    },
    {
      "username": "kellielulu",
      "userUrl": "https://www.imdb.com/user/ur87114976",
      "reviewLink": "https://www.imdb.com/review/rw8403103",
      "warningSpoilers": true,
      "date": "5 August 2022",
      "rate": "7",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Mixed review",
      "content": "The good : strong performances by Bette Davis, Celeste Holmes and Thelma Ritter .The bad : Anne Baxter has always seemed affected in her acting and here she seems too phony to fool so many people seasoned in the business for so long. Only Thelma Ritter's Birdie has her pegged from the start. ( Ritter or Holmes were Oscar deserving. I would go with Ritter since she hadn't won and she stands out in the cast here ) A different actress playing Eve might have made it more believable.The ugly: obviously looking at in through the rear view mirror is tricky but the way George Saunders character theater critic Addison DeWitt blackmails Eve makes the skin crawl. Yes Eve was horrible but was she that bad ? Compared with the rest of them? Not so much. She was only mildly a bit worse than most of them and on par with Margo. Addison was the worst. Only Birdie is all that good. The so called scandal is pretty trite even back then and in the entertainment world her scandal from her hometown would blow over by lunch. Her being tied to Addison that way seemed most uncomfortable even frightening.The mixed: the script is sharp with cutting dialogue and observations but the plot is thin and Eve's so called scandal seems pitiful they couldn't come up with something more than an affair with a married boss ? That probably covered most of the people they knew. What if Eve had a child she abandoned? A possible murder suspect? Then your cooking!The questionable: Margo and her fiancé are less than convincing and Margo is going to be less ambitious and satisfied with less star status and more of a homebody?It also runs a bit long for what it is ( over two hours) . Under two hours would have made the story tighter and more interesting . Sharper .Still can't deny it's well made and mostly well acted."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw3275894",
      "warningSpoilers": false,
      "date": "13 July 2015",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Superb drama",
      "content": "Superb drama.The story of a woman, Eve (played by Ann Baxter), who ingratiates herself into the social circles of a famous theatre actress, Margo (played by Bette Davis), and her theatre-centric friends. After a time it starts to look as though Eve's motives and methods aren't as innocent as they seem... A great story of manipulation, social politics and ambition. While you think you can see how everything ends up, how they get there is still very interesting. Plus, there's a twist or two in store...Superb performance by Bette Davis as the curmudgeonly, jaded Margo. While Eve might be the character in the title, Bette Davis gets the most screen time. Just about every line she utters drips with cynicism and is worth a soundbite/videobite. Very quotable.Ann Baxter is great as Eve. Good support from George Sanders, Gary Merrill, Celeste Holm, Hugh Marlowe and Thelma Ritter. Marilyn Monroe also has a minor role.Davis and Baxter got Best Leading Actress Oscar nominations for their performances (losing to Judy Holliday for Born Yesterday). Holm and Ritter got Best Supporting Actress Oscar nominations (losing to Josephine Hull for Harvey).An absolute classic."
    },
    {
      "username": "SameirAli",
      "userUrl": "https://www.imdb.com/user/ur34756529",
      "reviewLink": "https://www.imdb.com/review/rw3631669",
      "warningSpoilers": false,
      "date": "1 February 2017",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Evergreen Eve.",
      "content": "Some films mark milestones in the history. \"All About Eve\" is a combination of rare cases like First ever movie to be nominated for 14 Oscars. Also, it has the highest number of Oscar nominations for the Actress. This makes the movie a must watch for all film lovers.The movie begins with an award ceremony. The winner is Eve Harrington. The flashback goes through some people who are present at the ceremony. Margo Channing is a super star stage artist. One day she gets a fan visit after the show. It was the young Eve. Soon, Eve works for Margo. Eve becomes all in all for Margo. Eve was more of an observer, how Margo walks, talks, eats, sits etc. The movie has a wonderful ending. The cast and crew are perfect. There was a competition of acting. Marilyn Monroe's appearance was interesting. I think this movie was made before she became a great celebrity.A definitely must watch. Highly Recommended.#KiduMovie"
    }
  ],
  "errorMessage": ""
}