{
  "imDbId": "tt0042192",
  "title": "All About Eve",
  "fullTitle": "All About Eve (1950)",
  "type": "Movie",
  "year": "1950",
  "language": "en",
  "titleInLanguage": "All About Eve",
  "url": "https://en.wikipedia.org/wiki/All_About_Eve",
  "plotShort": {
    "plainText": "All About Eve is a 1950 American drama film written and directed by Joseph L. Mankiewicz, and produced by Darryl F. Zanuck. It is based on the 1946 short story \"The Wisdom of Eve\" by Mary Orr, although Orr does not receive a screen credit.\r\nThe film stars Bette Davis as Margo Channing, a highly regarded but aging Broadway star, and Anne Baxter as Eve Harrington, an ambitious young fan who maneuvers herself into Channing's life, ultimately threatening Channing's career and her personal relationships. The film co-stars George Sanders, Celeste Holm, Gary Merrill, and Hugh Marlowe, and features Thelma Ritter, Marilyn Monroe in one of her earliest roles, Gregory Ratoff, Barbara Bates and Walter Hampden.\r\nAll About Eve held its world premiere in New York City on October 13, 1950. Praised by critics at the time of its release, All About Eve received a record 14 Academy Award nominations. and won six, including Best Picture. All About Eve is the only film in Oscar history to receive four female acting nominations (Davis and Baxter as Best Actress, Holm and Ritter as Best Supporting Actress). Widely considered as among the greatest films of all time, in 1990, it became one of 25 films selected for preservation in the United States Library of Congress's National Film Registry, deemed \"culturally, historically, or aesthetically significant\". The film was ranked No. 16 on AFI's 1998 list of the 100 best American films.",
    "html": "<p>All About Eve is a 1950 American drama film written and directed by Joseph L. Mankiewicz, and produced by Darryl F. Zanuck. It is based on the 1946 short story \"The Wisdom of Eve\" by Mary Orr, although Orr does not receive a screen credit.</p><p>The film stars Bette Davis as Margo Channing, a highly regarded but aging Broadway star, and Anne Baxter as Eve Harrington, an ambitious young fan who maneuvers herself into Channing's life, ultimately threatening Channing's career and her personal relationships. The film co-stars George Sanders, Celeste Holm, Gary Merrill, and Hugh Marlowe, and features Thelma Ritter, Marilyn Monroe in one of her earliest roles, Gregory Ratoff, Barbara Bates and Walter Hampden.</p><p>All About Eve held its world premiere in New York City on October 13, 1950. Praised by critics at the time of its release, All About Eve received a record 14 Academy Award nominations. and won six, including Best Picture. All About Eve is the only film in Oscar history to receive four female acting nominations (Davis and Baxter as Best Actress, Holm and Ritter as Best Supporting Actress). Widely considered as among the greatest films of all time, in 1990, it became one of 25 films selected for preservation in the United States Library of Congress's National Film Registry, deemed \"culturally, historically, or aesthetically significant\". The film was ranked No. 16 on AFI's 1998 list of the 100 best American films.</p>"
  },
  "plotFull": {
    "plainText": "All About Eve is a 1950 American drama film written and directed by Joseph L. Mankiewicz, and produced by Darryl F. Zanuck. It is based on the 1946 short story \"The Wisdom of Eve\" by Mary Orr, although Orr does not receive a screen credit.\r\nThe film stars Bette Davis as Margo Channing, a highly regarded but aging Broadway star, and Anne Baxter as Eve Harrington, an ambitious young fan who maneuvers herself into Channing's life, ultimately threatening Channing's career and her personal relationships. The film co-stars George Sanders, Celeste Holm, Gary Merrill, and Hugh Marlowe, and features Thelma Ritter, Marilyn Monroe in one of her earliest roles, Gregory Ratoff, Barbara Bates and Walter Hampden.\r\nAll About Eve held its world premiere in New York City on October 13, 1950. Praised by critics at the time of its release, All About Eve received a record 14 Academy Award nominations. and won six, including Best Picture. All About Eve is the only film in Oscar history to receive four female acting nominations (Davis and Baxter as Best Actress, Holm and Ritter as Best Supporting Actress). Widely considered as among the greatest films of all time, in 1990, it became one of 25 films selected for preservation in the United States Library of Congress's National Film Registry, deemed \"culturally, historically, or aesthetically significant\". The film was ranked No. 16 on AFI's 1998 list of the 100 best American films.\r\nPlot\r\nBroadway star Margo Channing (Bette Davis) recently turned 40 and worries about what advancing age will mean for her career. After a performance of Margo's latest play, Margo's close friend, Karen Richards (Celeste Holm), wife of the play's author Lloyd Richards (Hugh Marlowe), brings besotted fan Eve Harrington (Anne Baxter) backstage to meet Margo. In Margo's dressing room – , Eve tells Karen, Lloyd, and Margo's maid Birdie (Thelma Ritter) – that she followed Margo's last theatrical tour to New York City after seeing her perform in San Francisco. She tells an engrossing story of growing up poor in Wisconsin and losing her young husband, Eddie in the South Pacific during World War II. Margo, moved by Eve's story, takes her into her home as her assistant, upsetting Birdie.\r\nEve quickly manipulates her way into Margo's life, acting as both secretary and adoring fan. She places a long-distance phone call to Margo's boyfriend Bill Sampson (Gary Merrill) when Margo forgets his birthday. Margo grows increasingly distrustful and bitter toward Eve, particularly after catching Eve taking a bow to an empty theater while pretending to wear Margo's costume. Margo asks producer Max Fabian (Gregory Ratoff) to hire Eve at his office, but instead, Eve becomes Margo's understudy without Margo's knowledge.\r\nAs Margo's irritation grows, Karen sympathizes with Eve. Hoping to humble Margo, Karen conspires for her to miss a performance so that Eve can perform. Eve invites the city's theater critics to attend the performance – including the acerbic Addison DeWitt (George Sanders). Eve's performance is a triumph. Later that night, Bill rejects Eve's attempts to seduce him. Instead, Addison takes an interest in Eve. He interviews her for a column, harshly criticizing Margo for resisting younger talent.\r\nMargo and Bill announce their engagement at dinner with Lloyd and Karen. Eve summons Karen to the ladies' room and, after first appearing regretful, delivers an ultimatum: Karen must recommend her to Lloyd to play Cora, the lead role in Lloyd's new play. Otherwise, she will reveal Karen's part in Margo's missed performance. When Karen returns to the table, Margo surprisingly announces that she does not wish to play Cora, saying she is too old for the role.\r\nEve is cast as Cora. Just before the new play's premiere in New Haven, Eve reveals her next plan to Addison: to marry Lloyd, whom she claims loves her, so that he can write plays for her to star in. Angered with Eve's audacity, Addison says he knows her backstory is false; her real name is Gertrude Slescynski, she was never married, and she was paid to leave town over an affair with her married boss. He also says Lloyd would never leave Karen for Eve. Addison then blackmails Eve, saying she now \"belongs\" to him.\r\nMonths later, Eve is a Broadway star headed for Hollywood. While accepting an award at a banquet, she thanks Margo, Bill, Lloyd, and Karen as all four coldly stare back. Eve skips the after-party and returns home where she encounters Phoebe (Barbara Bates), a teenage fan who slipped into her apartment and fell asleep. Phoebe professes her adoration and tries ingratiating herself with Eve, then begins packing her trunk. Eve invites her to stay over rather than take the long subway ride back to Brooklyn. While Eve is resting, Addison brings Eve's award to the door and is greeted by Phoebe, who admits she chose her own name. Addison realizes Phoebe will do to Eve what Eve did to Margo. When she is alone, Phoebe puts on Eve's elegant cloak and poses in front of a floor-length mirror, holding the award and bowing.\r\nCast\r\nBette Davis as Margo Channing\r\nAnne Baxter as Eve Harrington\r\nGeorge Sanders as Addison DeWitt\r\nCeleste Holm as Karen Richards\r\nGary Merrill as Bill Sampson\r\nHugh Marlowe as Lloyd Richards\r\nThelma Ritter as Birdie Coonan\r\nGregory Ratoff as Max Fabian\r\nMarilyn Monroe as Claudia Casswell\r\nBarbara Bates as Phoebe\r\nWalter Hampden as Aged Actor (Sarah Siddons Award presenter)\r\nRandy Stuart as Girl\r\nCraig Hill as Leading Man\r\nLeland Harris as Doorman\r\nBarbara White as Autograph Seeker\r\nEddie Fisher as Stage Manager\r\nWilliam Pullen as Clerk\r\nClaude Stroud as Pianist (at party)\r\nEugene Borden as Frenchman\r\nHelen Mowery as Reporter\r\nSteven Geray as Captain of Waiters\r\nProduction\r\nDevelopment\r\nThe story of All About Eve originated in an anecdote related to Mary Orr by actress Elisabeth Bergner. While performing in The Two Mrs. Carrolls during 1943 and 1944, Bergner allowed a young fan to become part of her household and employed her as an assistant, but later regretted her generosity when the woman attempted to undermine her. Referring to her only as \"the terrible girl\", Bergner related the events to Orr, who used it as the basis for her short story \"The Wisdom of Eve\" (1946). In the story, Orr gives the girl an even more ruthless character and allows her to succeed in stealing the older actress's career and the husband of the unnamed female narrator. Bergner later confirmed the basis of the story in her autobiography Bewundert viel, und viel gescholten (Greatly Admired and Greatly Scolded).\r\nIn 1949, Joseph Mankiewicz was considering a story about an aging actress and, upon reading \"The Wisdom of Eve,\" felt that the conniving girl would be a useful element. He sent a memo to Darryl F. Zanuck saying it \"fits in with an original idea and can be combined. Superb starring role for Susan Hayward.\" Mankiewicz presented a film treatment of the combined stories under the title Best Performance. He changed the main character's name from Margola Cranston to Margo Channing and retained several of Orr's characters – Eve Harrington, Lloyd and Karen Richards and Miss Casswell – while removing Margo's husband completely and replacing him with a new character, Bill Sampson. The intention was to depict Margo in a new relationship and allow Eve to threaten Margo's professional and personal lives. Mankiewicz also added the characters Addison DeWitt, Birdie Coonan, Max Fabian and Phoebe.\r\nZanuck was enthusiastic and provided numerous suggestions for improving the screenplay. In some sections, he felt that Mankiewicz's writing lacked subtlety or provided excessive detail. He suggested diluting Birdie Coonan's mistrust of Eve so the audience would not recognize Eve as a villainess until much later in the story. Zanuck reduced the screenplay by about 50 pages and chose the title All About Eve from the opening scene in which Addison DeWitt says that he will soon tell \"more of Eve ... All about Eve, in fact.\"\r\nCasting\r\nAmong the actresses originally considered to play Margo Channing were Mankiewicz's original inspiration Susan Hayward, who was rejected by Zanuck as \"too young\", Marlene Dietrich, dismissed as \"too German\" and Gertrude Lawrence, who was ruled out when her lawyer insisted that she not have to drink or smoke in the film and that the script would be rewritten to allow her to sing a torch song. Zanuck favored Barbara Stanwyck, but she was not available. Tallulah Bankhead was considered, as was Joan Crawford, who was working on the film The Damned Don't Cry.\r\nThe role went to Claudette Colbert, but she withdrew after an injury shortly before filming began. Mankiewicz briefly considered Ingrid Bergman before offering the role to Bette Davis. Davis, who had recently ended an 18-year association with Warner Bros. after several poorly received films, accepted the role after realizing that the script was among the best that she had ever read. Margo had been originally conceived as genteel and knowingly humorous, but with the casting of Davis, Mankiewicz revised the character to introduce abrasive qualities. Mankiewicz praised Davis for her professionalism and for the caliber of her performance.\r\nAnne Baxter had spent a decade in supporting roles and had won the 1946 Academy Award for Best Supporting Actress for The Razor's Edge. She won the role of Eve after Jeanne Crain, the first choice, became pregnant. Crain was at the height of her popularity and had established a career playing likable heroines; Zanuck believed that she lacked the \"bitch virtuosity\" required by the part and that audiences would not accept her as a deceitful character.\r\nMankiewicz greatly admired Thelma Ritter and wrote the character of Birdie Coonan for her after working with her on A Letter to Three Wives in 1949. As Coonan is the only character immediately suspicious of Eve Harrington, Mankiewicz was confident that Ritter would contribute a shrewd characterization that cast doubt on Eve and provided a counterpoint to the more theatrical personalities of the other characters. Marilyn Monroe, relatively unknown at the time, was cast as Miss Casswell, referred to by DeWitt as a \"graduate of the Copacabana School of Dramatic Art\". Monroe won the part after a lobbying campaign by her agent, despite Zanuck's initial antipathy and belief that she was better suited to comedy. The inexperienced Monroe was cowed by Davis, and it took 11 takes to complete the scene in the theater lobby; when Davis barked at her, Monroe left the set to vomit. Smaller roles were filled by Gregory Ratoff as the producer Max Fabian, Barbara Bates as Phoebe and Walter Hampden as the host of the award ceremony. Hampden was the president of the prestigious Players Club in New York, a club for actors that gives a lifetime achievement award.\r\nReception\r\nBox office\r\nThe film earned $3.1 million in receipts in the United States during its release, more than double its original budget of $1.4 million. To date the film has a cumulative gross of $8.4 million, more than five times its production costs.\r\nCritical response\r\nAll About Eve received overwhelmingly positive reviews from critics upon its release on October 13, 1950, at a New York City premiere. The film's competitor, Sunset Boulevard, released the same year, drew similar praise, and the two were often favorably compared. Film critic Bosley Crowther of The New York Times loved the picture, stating that \"a fine Darryl Zanuck production, excellent music and an air of ultra-class complete this superior satire.\" Variety called it \"a literate, adult film\" with \"exceedingly well-cast performances,\" while Harrison's Reports called it \"a fascinating, continually absorbing story about Broadway theatrical people, given a mature treatment and penetrated with realistic dialogue and flashes of slick, sardonic humor.\" John McCarten of The New Yorker called it \"a thoroughly entertaining movie\".\r\nWriting in 2000, film critic Roger Ebert of the Chicago Sun Times praised the film, saying Bette Davis' character \"veteran actress Margo Channing in All About Eve was her greatest role.\" Boxoffice.com stated that it \"is a classic of the American cinema – to this day the quintessential depiction of ruthless ambition in the entertainment industry, with legendary performances from Bette Davis, Anne Baxter and George Sanders anchoring one of the very best films from one of Hollywood's very best Golden Era filmmakers: Joseph L. Mankiewicz.\"\r\nOn review aggregator website Rotten Tomatoes, All About Eve holds an approval rating of 99% based on 107 reviews, with an average rating of 9.30/10. The site's critics consensus reads: \"Smart, sophisticated, and devastatingly funny, All About Eve is a Hollywood classic that only improves with age.\" Metacritic assigned a weighted average score of 98 out of 100, based on 15 critics, indicating \"universal acclaim\".\r\nThematic content\r\nCritics and academics have delineated various themes in the film. Rebecca Flint Marx, in her Allmovie review, notes the antagonism that existed between Broadway and Hollywood at the time, stating that the \"script summoned into existence a whole array of painfully recognizable theatre types, from the aging, egomaniacal grand dame to the outwardly docile, inwardly scheming ingenue to the powerful critic who reeks of malignant charm.\" Abel Green, writing in Variety said, \"The snide references to picture people, the plug for San Francisco (\"an oasis of civilization in the California desert\") and the like are purposeful and manifest an intelligent reflex from a group of hyper-talented people towards the picture business.\"\r\nRoger Ebert, in his review in The Great Movies, says Eve Harrington is \"a universal type\", and focuses on the aging actress plot line, comparing the film to Sunset Boulevard. Similarly, Marc Lee's 2006 review of the film for The Daily Telegraph describes a subtext \"into the darker corners of show business, exposing its inherent ageism, especially when it comes to female stars.\" Kathleen Woodward's 1999 book, Figuring Age: Women, Bodies, Generations (Theories of Contemporary Culture), also discusses themes that appeared in many of the \"aging actress\" films of the 1950s and 1960s, including All About Eve. She reasons that Margo has three options: \"To continue to work, she can perform the role of a young woman, one she no longer seems that interested in. She can take up the position of the angry bitch, the drama queen who holds court (the deliberate camp that Susan Sontag finds in this film). Or she can accept her culture's gendered discourse of aging which figures her as in her moment of fading. Margo ultimately chooses the latter option, accepting her position as one of loss.\"\r\nAnother important theme of the film, in terms of war politics and sexuality, involves the post-World War II pressure placed upon women to resume \"traditional\" female roles. This is illustrated in the contrast between Margo's mockery of Karen Richards for being a \"happy little housewife\" and her lengthy and inspired monologue, as a reformed woman later, about the virtuousness of marriage, including how a woman is not truly a woman without having a man beside her. This submissive and feminine Margo is contrasted with the theatricality, combativeness, and egotism of the earlier career woman Margo. Margo quips that Eve should place her award \"where her heart should be\", and Eve is shown bereft at the end of the film. At dinner, the two married couples see Eve and Addison in a similarly negative light, with Margo wondering aloud what schemes Eve was constructing in her \"feverish little brain\".\r\nAll About Eve has long been a favored film among gay audiences, likely due to its campy overtones (in part due to the casting of Davis) and its general sophistication. Davis, who long had a strong gay fan base, expressed support for gay men in her 1972 interview with The Advocate.\r\nAwards and honors\r\nLater recognition and rankings\r\nIn 1990, All About Eve was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\" The Academy Film Archive preserved All About Eve in 2000. The film received in 1997 a placement on the Producers Guild of America Hall of Fame. The film also has a 99% rating on Rotten Tomatoes. The film has been selected by the American Film Institute for many of their 100 Years lists.\r\nWhen AFI named Bette Davis #2 on its list of the greatest female American screen legends, All About Eve was the film selected to highlight Davis' legendary career.\r\nThe Writers Guild of America has ranked the film's screenplay as the fifth greatest ever written.\r\nSarah Siddons Award\r\nThe film opens with the image of a fictitious award trophy, described by DeWitt as the \"highest honor our theater knows: the Sarah Siddons Award for Distinguished Achievement.\" The statuette is modeled after the famous painting of Siddons costumed as the tragic Muse by Joshua Reynolds, a copy of which hangs in the entrance of Margo's apartment and often visible during the party scene. In 1952, a small group of distinguished Chicago theater-goers began to give an award with that name, which was sculpted to look like the one used in the film. It has been given annually, with past honorees including Bette Davis and Celeste Holm.\r\nAdaptations\r\nThe first radio adaptation was a one-hour broadcast on Lux Radio Theatre on CBS Radio on October 1, 1951, with Bette Davis, Gary Merrill and Anne Baxter reprising their original roles. Lux Radio Theatre did a follow-up adaptation on November 23, 1954, this time on NBC radio with Ann Blyth and Claire Trevor playing the lead roles, with Trevor replacing Ida Lupino when she became ill and was unable to attend the broadcast.\r\nA radio version of All About Eve starring Tallulah Bankhead as Margo Channing was presented on NBC's The Big Show by the Theatre Guild of the Air on November 16, 1952. Bankhead and many contemporary critics felt that the characterization of Margo Channing was patterned on her, a long-rumored charge denied by both Mankiewicz and Davis, but attested by costume designer Edith Head. Additionally, Bankhead's rivalry with her understudy (Lizabeth Scott) during the production of The Skin of Our Teeth is cited as an alternative hypothesis for the origin of Mary Orr's The Wisdom of Eve, the original short story that formed the basis for the film. Bette Davis played three roles on film that Tallulah Bankhead had originated – Dark Victory, Jezebel and The Little Foxes, much to Bankhead's chagrin. Bankhead and Davis were considered to be somewhat similar in style. Several decades later Davis called Channing \"the essence of a Tallulah Bankhead kind of actress\" in an interview with Barbara Walters. The production is notable in that Mary Orr, of The Wisdom of Eve, played the role of Karen Richards. The cast also featured Alan Hewitt as Addison DeWitt (who narrated), Beatrice Pearson as Eve Harrington, Don Briggs as Lloyd Richards, Kevin McCarthy as Bill Samson, Florence Robinson as Birdie Coonan, and Stefan Schnabel as Max Fabian.\r\nIn 1970, All About Eve was the inspiration for the stage musical Applause, with book by Betty Comden and Adolph Green, lyrics by Lee Adams, and music by Charles Strouse. The original production starred Lauren Bacall as Margo Channing, and it won the Tony Award for Best Musical that season. It ran for four previews and 896 performances at the Palace Theatre on Broadway. After Bacall left the production, she was replaced by Anne Baxter in the role of Margo Channing.\r\nIn 2019, a stage adaptation of All About Eve premiered at the Noël Coward Theatre in London, directed by Ivo van Hove and starring Gillian Anderson as Margo Channing, Julian Ovenden as Bill, and Lily James as Eve Harrington.\r\nIn popular culture\r\nThe plot of the film has been used numerous times, frequently as an outright homage to the film, with one notable example being a 1974 episode of The Mary Tyler Moore Show titled \"A New Sue Ann\". In the episode, the character of Sue Ann Nivens (Betty White), hostess of a popular local cooking show, hires a young, pretty and very eager fan (Linda Kelsey) as her apprentice and assistant, but the neophyte quickly begins to sabotage her mentor, in an attempt to replace her as host of the show. Sue Ann, however, unlike Margo Channing, prevails in the end, countering the young woman's attempts to steal her success and sending her on her way.\r\nThe English rock band All About Eve took their name from the film.\r\nSteven Soderbergh's 2012 film Magic Mike is a loose re-working of the All About Eve plot and includes subtle references in hommage to the original. The lead actor Channing Tatum name checks Bette Davis's character Margo Channing, and instead of Eve, the ambitious young upstart is named Adam, played by Alex Pettyfer. Like Eve, Adam gets his stage debut filling in for an absent star, and his subsequent ruthless rise to glory at the expense of others mirrors that of Eve.\r\nA 2008 episode of The Simpsons titled \"All About Lisa\" is influenced by this film. In the episode, Lisa Simpson becomes Krusty the Clown's assistant, eventually taking his place on television and receiving an entertainment award.\r\nPedro Almodóvar's 1999 Academy Award-winning Spanish-language film Todo sobre mi madre (All About My Mother) has elements similar to those found in All About Eve. The title of the film itself is an homage to the 1950 film. In the first scene, the character of Manuela Echevarria and her son, Esteban, are watching a dubbed version of the film on television when the film is introduced as \"Eve Unveiled\". Esteban comments that the film should be called \"Todo Sobre Eva\" (\"All About Eva\"). Later in the scene, he begins writing about his mother in his notebook and calls the piece \"Todo sobre mi madre\". Additionally, Manuela replaces Nina Cruz as Stella for a night in a production of A Streetcar Named Desire, leading a furious Nina to accuse her of learning the part \"just like Eve Harrington!\"\r\nIn a season 3 episode of Gossip Girl, titled \"Enough About Eve\", Blair Waldorf has a dream where she is Margo Channing.\r\nIn the fifth season of The L Word, a fan becomes Jenny Schecter's assistant while she is directing a movie; later the fan blackmails the movie studio into letting her direct and she proceeds to take over Jenny's life.\r\nIn the second season of Glee, Kurt Hummel calls his fellow glee club member Santana Lopez \"a Latina Eve Harrington\", after learning she is blackmailing a closeted jock into becoming her \"beard\" and running mate for Prom Queen and King.\r\nIn the first season of Will & Grace, Grace becomes dependent on a maid to give her a confidence boost during a design competition. This prompts her drunken assistant Karen to suspect a plot and she confronts the maid, exclaiming \"I've seen All About Eve. Poooor Eve!\"\r\nIn the pilot episode of Political Animals, when Susan suspects Georgia, a fellow reporter, has a crush on her boyfriend and is attempting to outshine her at the newspaper, she says, \"If Eve Harrington were an actual person today, she would look like Georgia. She would bake cupcakes, and she would have a blog.\"\r\nIn the third season of Gilligan's Island, the episode \"All About Eva\" concerns the character of Eva Grubb coming on the island and taking over Ginger's persona, with both roles played by actress Tina Louise.\r\nIn the fifth season of Quantum Leap, the plot of the episode \"Goodbye Norma Jean\" mirrors that of All About Eve. In it, Sam Beckett leaps into Marilyn Monroe's chauffeur and finds himself pitted against an aspiring actress who is trying to steal Monroe's part for the film The Misfits. Sam succeeds in stopping Monroe's rival, and she rightfully takes her place as Clark Gable's leading lady.\r\nIn Alex Holdridge's 2007 film In Search of a Midnight Kiss, Vivian, an amateur actress played by Sara Simmonds, says to Wilson, played by Scoot McNairy: \"I just don't think people out here have the raw ambition that I do.\" And he replies: \"You are a real All About Eve.\"\r\nAll About Steve is a 2009 American comedy film.\r\nA season 6 episode of Designing Women titled, \"All About Odes to Atlanta\", sees Carlene, Mary Jo, and Julia entering a song contest and drawing the attention of a young \"fan\" who seems all too eager to help them, much to Allison's distrust.\r\nThe season 20 episode of Family Guy titled, \"All About Alana\", is a homage to the film and sees Lois Griffin allowing one of her piano students Alana Fitzgerald to move in with the family, who begins slowly taking over Lois' life.\r\nA Season 3 episode of The Dick Van Dyke Show is titled, \"All About Eavesdropping\". It does not follow the plot of All About Eve: rather, the title refers to Rob and Laura accidentally overhearing Jerry and Millie talk about them via the kids' intercom.",
    "html": "<p>All About Eve is a 1950 American drama film written and directed by Joseph L. Mankiewicz, and produced by Darryl F. Zanuck. It is based on the 1946 short story \"The Wisdom of Eve\" by Mary Orr, although Orr does not receive a screen credit.</p><p>The film stars Bette Davis as Margo Channing, a highly regarded but aging Broadway star, and Anne Baxter as Eve Harrington, an ambitious young fan who maneuvers herself into Channing's life, ultimately threatening Channing's career and her personal relationships. The film co-stars George Sanders, Celeste Holm, Gary Merrill, and Hugh Marlowe, and features Thelma Ritter, Marilyn Monroe in one of her earliest roles, Gregory Ratoff, Barbara Bates and Walter Hampden.</p><p>All About Eve held its world premiere in New York City on October 13, 1950. Praised by critics at the time of its release, All About Eve received a record 14 Academy Award nominations. and won six, including Best Picture. All About Eve is the only film in Oscar history to receive four female acting nominations (Davis and Baxter as Best Actress, Holm and Ritter as Best Supporting Actress). Widely considered as among the greatest films of all time, in 1990, it became one of 25 films selected for preservation in the United States Library of Congress's National Film Registry, deemed \"culturally, historically, or aesthetically significant\". The film was ranked No. 16 on AFI's 1998 list of the 100 best American films.</p><br/><h3>Plot</h3><p>Broadway star Margo Channing (Bette Davis) recently turned 40 and worries about what advancing age will mean for her career. After a performance of Margo's latest play, Margo's close friend, Karen Richards (Celeste Holm), wife of the play's author Lloyd Richards (Hugh Marlowe), brings besotted fan Eve Harrington (Anne Baxter) backstage to meet Margo. In Margo's dressing room – , Eve tells Karen, Lloyd, and Margo's maid Birdie (Thelma Ritter) – that she followed Margo's last theatrical tour to New York City after seeing her perform in San Francisco. She tells an engrossing story of growing up poor in Wisconsin and losing her young husband, Eddie in the South Pacific during World War II. Margo, moved by Eve's story, takes her into her home as her assistant, upsetting Birdie.</p><p>Eve quickly manipulates her way into Margo's life, acting as both secretary and adoring fan. She places a long-distance phone call to Margo's boyfriend Bill Sampson (Gary Merrill) when Margo forgets his birthday. Margo grows increasingly distrustful and bitter toward Eve, particularly after catching Eve taking a bow to an empty theater while pretending to wear Margo's costume. Margo asks producer Max Fabian (Gregory Ratoff) to hire Eve at his office, but instead, Eve becomes Margo's understudy without Margo's knowledge.</p><p>As Margo's irritation grows, Karen sympathizes with Eve. Hoping to humble Margo, Karen conspires for her to miss a performance so that Eve can perform. Eve invites the city's theater critics to attend the performance – including the acerbic Addison DeWitt (George Sanders). Eve's performance is a triumph. Later that night, Bill rejects Eve's attempts to seduce him. Instead, Addison takes an interest in Eve. He interviews her for a column, harshly criticizing Margo for resisting younger talent.</p><p>Margo and Bill announce their engagement at dinner with Lloyd and Karen. Eve summons Karen to the ladies' room and, after first appearing regretful, delivers an ultimatum: Karen must recommend her to Lloyd to play Cora, the lead role in Lloyd's new play. Otherwise, she will reveal Karen's part in Margo's missed performance. When Karen returns to the table, Margo surprisingly announces that she does not wish to play Cora, saying she is too old for the role.</p><p>Eve is cast as Cora. Just before the new play's premiere in New Haven, Eve reveals her next plan to Addison: to marry Lloyd, whom she claims loves her, so that he can write plays for her to star in. Angered with Eve's audacity, Addison says he knows her backstory is false; her real name is Gertrude Slescynski, she was never married, and she was paid to leave town over an affair with her married boss. He also says Lloyd would never leave Karen for Eve. Addison then blackmails Eve, saying she now \"belongs\" to him.</p><p>Months later, Eve is a Broadway star headed for Hollywood. While accepting an award at a banquet, she thanks Margo, Bill, Lloyd, and Karen as all four coldly stare back. Eve skips the after-party and returns home where she encounters Phoebe (Barbara Bates), a teenage fan who slipped into her apartment and fell asleep. Phoebe professes her adoration and tries ingratiating herself with Eve, then begins packing her trunk. Eve invites her to stay over rather than take the long subway ride back to Brooklyn. While Eve is resting, Addison brings Eve's award to the door and is greeted by Phoebe, who admits she chose her own name. Addison realizes Phoebe will do to Eve what Eve did to Margo. When she is alone, Phoebe puts on Eve's elegant cloak and poses in front of a floor-length mirror, holding the award and bowing.</p><br/><h3>Cast</h3><ul><li>Bette Davis as Margo Channing</li><li>Anne Baxter as Eve Harrington</li><li>George Sanders as Addison DeWitt</li><li>Celeste Holm as Karen Richards</li><li>Gary Merrill as Bill Sampson</li><li>Hugh Marlowe as Lloyd Richards</li><li>Thelma Ritter as Birdie Coonan</li><li>Gregory Ratoff as Max Fabian</li><li>Marilyn Monroe as Claudia Casswell</li><li>Barbara Bates as Phoebe</li><li>Walter Hampden as Aged Actor (Sarah Siddons Award presenter)</li><li>Randy Stuart as Girl</li><li>Craig Hill as Leading Man</li><li>Leland Harris as Doorman</li><li>Barbara White as Autograph Seeker</li><li>Eddie Fisher as Stage Manager</li><li>William Pullen as Clerk</li><li>Claude Stroud as Pianist (at party)</li><li>Eugene Borden as Frenchman</li><li>Helen Mowery as Reporter</li><li>Steven Geray as Captain of Waiters</li></ul><br/><h3>Production</h3><h4>Development</h4><p>The story of All About Eve originated in an anecdote related to Mary Orr by actress Elisabeth Bergner. While performing in The Two Mrs. Carrolls during 1943 and 1944, Bergner allowed a young fan to become part of her household and employed her as an assistant, but later regretted her generosity when the woman attempted to undermine her. Referring to her only as \"the terrible girl\", Bergner related the events to Orr, who used it as the basis for her short story \"The Wisdom of Eve\" (1946). In the story, Orr gives the girl an even more ruthless character and allows her to succeed in stealing the older actress's career and the husband of the unnamed female narrator. Bergner later confirmed the basis of the story in her autobiography Bewundert viel, und viel gescholten (Greatly Admired and Greatly Scolded).</p><p>In 1949, Joseph Mankiewicz was considering a story about an aging actress and, upon reading \"The Wisdom of Eve,\" felt that the conniving girl would be a useful element. He sent a memo to Darryl F. Zanuck saying it \"fits in with an original idea and can be combined. Superb starring role for Susan Hayward.\" Mankiewicz presented a film treatment of the combined stories under the title Best Performance. He changed the main character's name from Margola Cranston to Margo Channing and retained several of Orr's characters – Eve Harrington, Lloyd and Karen Richards and Miss Casswell – while removing Margo's husband completely and replacing him with a new character, Bill Sampson. The intention was to depict Margo in a new relationship and allow Eve to threaten Margo's professional and personal lives. Mankiewicz also added the characters Addison DeWitt, Birdie Coonan, Max Fabian and Phoebe.</p><p>Zanuck was enthusiastic and provided numerous suggestions for improving the screenplay. In some sections, he felt that Mankiewicz's writing lacked subtlety or provided excessive detail. He suggested diluting Birdie Coonan's mistrust of Eve so the audience would not recognize Eve as a villainess until much later in the story. Zanuck reduced the screenplay by about 50 pages and chose the title All About Eve from the opening scene in which Addison DeWitt says that he will soon tell \"more of Eve ... All about Eve, in fact.\"</p><h4>Casting</h4><p>Among the actresses originally considered to play Margo Channing were Mankiewicz's original inspiration Susan Hayward, who was rejected by Zanuck as \"too young\", Marlene Dietrich, dismissed as \"too German\" and Gertrude Lawrence, who was ruled out when her lawyer insisted that she not have to drink or smoke in the film and that the script would be rewritten to allow her to sing a torch song. Zanuck favored Barbara Stanwyck, but she was not available. Tallulah Bankhead was considered, as was Joan Crawford, who was working on the film The Damned Don't Cry.</p><p>The role went to Claudette Colbert, but she withdrew after an injury shortly before filming began. Mankiewicz briefly considered Ingrid Bergman before offering the role to Bette Davis. Davis, who had recently ended an 18-year association with Warner Bros. after several poorly received films, accepted the role after realizing that the script was among the best that she had ever read. Margo had been originally conceived as genteel and knowingly humorous, but with the casting of Davis, Mankiewicz revised the character to introduce abrasive qualities. Mankiewicz praised Davis for her professionalism and for the caliber of her performance.</p><p>Anne Baxter had spent a decade in supporting roles and had won the 1946 Academy Award for Best Supporting Actress for The Razor's Edge. She won the role of Eve after Jeanne Crain, the first choice, became pregnant. Crain was at the height of her popularity and had established a career playing likable heroines; Zanuck believed that she lacked the \"bitch virtuosity\" required by the part and that audiences would not accept her as a deceitful character.</p><p>Mankiewicz greatly admired Thelma Ritter and wrote the character of Birdie Coonan for her after working with her on A Letter to Three Wives in 1949. As Coonan is the only character immediately suspicious of Eve Harrington, Mankiewicz was confident that Ritter would contribute a shrewd characterization that cast doubt on Eve and provided a counterpoint to the more theatrical personalities of the other characters. Marilyn Monroe, relatively unknown at the time, was cast as Miss Casswell, referred to by DeWitt as a \"graduate of the Copacabana School of Dramatic Art\". Monroe won the part after a lobbying campaign by her agent, despite Zanuck's initial antipathy and belief that she was better suited to comedy. The inexperienced Monroe was cowed by Davis, and it took 11 takes to complete the scene in the theater lobby; when Davis barked at her, Monroe left the set to vomit. Smaller roles were filled by Gregory Ratoff as the producer Max Fabian, Barbara Bates as Phoebe and Walter Hampden as the host of the award ceremony. Hampden was the president of the prestigious Players Club in New York, a club for actors that gives a lifetime achievement award.</p><br/><h3>Reception</h3><h4>Box office</h4><p>The film earned $3.1 million in receipts in the United States during its release, more than double its original budget of $1.4 million. To date the film has a cumulative gross of $8.4 million, more than five times its production costs.</p><h4>Critical response</h4><p>All About Eve received overwhelmingly positive reviews from critics upon its release on October 13, 1950, at a New York City premiere. The film's competitor, Sunset Boulevard, released the same year, drew similar praise, and the two were often favorably compared. Film critic Bosley Crowther of The New York Times loved the picture, stating that \"a fine Darryl Zanuck production, excellent music and an air of ultra-class complete this superior satire.\" Variety called it \"a literate, adult film\" with \"exceedingly well-cast performances,\" while Harrison's Reports called it \"a fascinating, continually absorbing story about Broadway theatrical people, given a mature treatment and penetrated with realistic dialogue and flashes of slick, sardonic humor.\" John McCarten of The New Yorker called it \"a thoroughly entertaining movie\".</p><p>Writing in 2000, film critic Roger Ebert of the Chicago Sun Times praised the film, saying Bette Davis' character \"veteran actress Margo Channing in All About Eve was her greatest role.\" Boxoffice.com stated that it \"is a classic of the American cinema – to this day the quintessential depiction of ruthless ambition in the entertainment industry, with legendary performances from Bette Davis, Anne Baxter and George Sanders anchoring one of the very best films from one of Hollywood's very best Golden Era filmmakers: Joseph L. Mankiewicz.\"</p><p>On review aggregator website Rotten Tomatoes, All About Eve holds an approval rating of 99% based on 107 reviews, with an average rating of 9.30/10. The site's critics consensus reads: \"Smart, sophisticated, and devastatingly funny, All About Eve is a Hollywood classic that only improves with age.\" Metacritic assigned a weighted average score of 98 out of 100, based on 15 critics, indicating \"universal acclaim\".</p><h4>Thematic content</h4><p>Critics and academics have delineated various themes in the film. Rebecca Flint Marx, in her Allmovie review, notes the antagonism that existed between Broadway and Hollywood at the time, stating that the \"script summoned into existence a whole array of painfully recognizable theatre types, from the aging, egomaniacal grand dame to the outwardly docile, inwardly scheming ingenue to the powerful critic who reeks of malignant charm.\" Abel Green, writing in Variety said, \"The snide references to picture people, the plug for San Francisco (\"an oasis of civilization in the California desert\") and the like are purposeful and manifest an intelligent reflex from a group of hyper-talented people towards the picture business.\"</p><p>Roger Ebert, in his review in The Great Movies, says Eve Harrington is \"a universal type\", and focuses on the aging actress plot line, comparing the film to Sunset Boulevard. Similarly, Marc Lee's 2006 review of the film for The Daily Telegraph describes a subtext \"into the darker corners of show business, exposing its inherent ageism, especially when it comes to female stars.\" Kathleen Woodward's 1999 book, Figuring Age: Women, Bodies, Generations (Theories of Contemporary Culture), also discusses themes that appeared in many of the \"aging actress\" films of the 1950s and 1960s, including All About Eve. She reasons that Margo has three options: \"To continue to work, she can perform the role of a young woman, one she no longer seems that interested in. She can take up the position of the angry bitch, the drama queen who holds court (the deliberate camp that Susan Sontag finds in this film). Or she can accept her culture's gendered discourse of aging which figures her as in her moment of fading. Margo ultimately chooses the latter option, accepting her position as one of loss.\"</p><p>Another important theme of the film, in terms of war politics and sexuality, involves the post-World War II pressure placed upon women to resume \"traditional\" female roles. This is illustrated in the contrast between Margo's mockery of Karen Richards for being a \"happy little housewife\" and her lengthy and inspired monologue, as a reformed woman later, about the virtuousness of marriage, including how a woman is not truly a woman without having a man beside her. This submissive and feminine Margo is contrasted with the theatricality, combativeness, and egotism of the earlier career woman Margo. Margo quips that Eve should place her award \"where her heart should be\", and Eve is shown bereft at the end of the film. At dinner, the two married couples see Eve and Addison in a similarly negative light, with Margo wondering aloud what schemes Eve was constructing in her \"feverish little brain\".</p><p>All About Eve has long been a favored film among gay audiences, likely due to its campy overtones (in part due to the casting of Davis) and its general sophistication. Davis, who long had a strong gay fan base, expressed support for gay men in her 1972 interview with The Advocate.</p><h4>Awards and honors</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th></tr><tr><td rowspan=\"14\"><span>Academy Awards</span></td><td><span>Best Motion Picture</span></td><td><span>Darryl F. Zanuck</span> (for <span>20th Century Fox</span>)</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td><span>Joseph L. Mankiewicz</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Best Actress</span></td><td><span>Anne Baxter</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Bette Davis</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>George Sanders</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Best Supporting Actress</span></td><td><span>Celeste Holm</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Thelma Ritter</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay</span></td><td>Joseph L. Mankiewicz</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Art Direction-Set Decoration – Black-and-White</span></td><td>Art Direction: <span>Lyle R. Wheeler</span> and <span>George Davis</span>; <br> Set Decoration: <span>Thomas Little</span> and <span>Walter M. Scott</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography – Black-and-White</span></td><td><span>Milton R. Krasner</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Costume Design – Black and White</span></td><td><span>Edith Head</span> and <span>Charles LeMaire</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Barbara McLean</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Scoring of a Dramatic or Comedy Picture</span></td><td><span class=\"mw-redirect\">Alfred Newman</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound Recording</span></td><td><span>Thomas T. Moulton</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Bodil Awards</span></td><td><span>Best American Film</span></td><td>Joseph L. Mankiewicz</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>British Academy Film Awards</span></td><td colspan=\"2\"><span>Best Film from any Source</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Cahiers du Cinéma</span></td><td><span>Best Film</span></td><td rowspan=\"3\">Joseph L. Mankiewicz</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">5th Place</td></tr><tr><td rowspan=\"3\"><span>Cannes Film Festival</span></td><td><span>Grand Prix</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Special Jury Prize</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Best Actress</span></td><td>Bette Davis</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td>Joseph L. Mankiewicz</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Dorian Awards</span></td><td colspan=\"2\">Timeless Award</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"6\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Motion Picture – Drama</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress in a Motion Picture – Drama</span></td><td>Bette Davis</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor – Motion Picture</span></td><td>George Sanders</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actress – Motion Picture</span></td><td>Thelma Ritter</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director – Motion Picture</span></td><td rowspan=\"3\">Joseph L. Mankiewicz</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay – Motion Picture</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Kinema Junpo Awards</span></td><td>Best Foreign Language Film</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Nastro d'Argento</span></td><td>Best Foreign Actress</td><td>Bette Davis</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Board of Review Awards</span></td><td colspan=\"2\"><span>Top Ten Films</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Film Preservation Board</span></td><td colspan=\"2\"><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td></tr><tr><td rowspan=\"3\"><span>New York Film Critics Circle Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Joseph L. Mankiewicz</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actress</span></td><td>Bette Davis</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td></tr><tr><td rowspan=\"2\"><span>Picturegoer Awards</span></td><td rowspan=\"2\">Best Actress</td><td>Anne Baxter</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Bette Davis</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Producers Guild of America Awards</span></td><td colspan=\"2\">PGA Hall of Fame – Motion Pictures</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Writers Guild of America Awards</span></td><td><span>Best Written American Comedy</span></td><td rowspan=\"2\">Joseph L. Mankiewicz</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Written American Drama</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><h4>Later recognition and rankings</h4><p>In 1990, All About Eve was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\" The Academy Film Archive preserved All About Eve in 2000. The film received in 1997 a placement on the Producers Guild of America Hall of Fame. The film also has a 99% rating on Rotten Tomatoes. The film has been selected by the American Film Institute for many of their 100 Years lists.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Category</th><th>Nominee</th><th>Rank</th></tr><tr><td>1998</td><td><span>AFI's 100 Years...100 Movies</span></td><td><i>All About Eve</i></td><td style=\"text-align:center;\">16</td></tr><tr><td>2003</td><td><span class=\"mw-redirect\">AFI's 100 Years...100 Heroes and Villains</span></td><td>Eve Harrington (Villain)</td><td style=\"text-align:center;\">23</td></tr><tr><td>2005</td><td><span>AFI's 100 Years...100 Movie Quotes</span></td><td>\"Fasten your seatbelts. It's going to be a bumpy night.\"</td><td style=\"text-align:center;\">9</td></tr><tr><td>2007</td><td><span>AFI's 100 Years...100 Movies (10th Anniversary Edition)</span></td><td><i>All About Eve</i></td><td style=\"text-align:center;\">28</td></tr></tbody></table><p>When AFI named Bette Davis #2 on its list of the greatest female American screen legends, All About Eve was the film selected to highlight Davis' legendary career.</p><p>The Writers Guild of America has ranked the film's screenplay as the fifth greatest ever written.</p><h4>Sarah Siddons Award</h4><p>The film opens with the image of a fictitious award trophy, described by DeWitt as the \"highest honor our theater knows: the Sarah Siddons Award for Distinguished Achievement.\" The statuette is modeled after the famous painting of Siddons costumed as the tragic Muse by Joshua Reynolds, a copy of which hangs in the entrance of Margo's apartment and often visible during the party scene. In 1952, a small group of distinguished Chicago theater-goers began to give an award with that name, which was sculpted to look like the one used in the film. It has been given annually, with past honorees including Bette Davis and Celeste Holm.</p><br/><h3>Adaptations</h3><p>The first radio adaptation was a one-hour broadcast on Lux Radio Theatre on CBS Radio on October 1, 1951, with Bette Davis, Gary Merrill and Anne Baxter reprising their original roles. Lux Radio Theatre did a follow-up adaptation on November 23, 1954, this time on NBC radio with Ann Blyth and Claire Trevor playing the lead roles, with Trevor replacing Ida Lupino when she became ill and was unable to attend the broadcast.</p><p>A radio version of All About Eve starring Tallulah Bankhead as Margo Channing was presented on NBC's The Big Show by the Theatre Guild of the Air on November 16, 1952. Bankhead and many contemporary critics felt that the characterization of Margo Channing was patterned on her, a long-rumored charge denied by both Mankiewicz and Davis, but attested by costume designer Edith Head. Additionally, Bankhead's rivalry with her understudy (Lizabeth Scott) during the production of The Skin of Our Teeth is cited as an alternative hypothesis for the origin of Mary Orr's The Wisdom of Eve, the original short story that formed the basis for the film. Bette Davis played three roles on film that Tallulah Bankhead had originated – Dark Victory, Jezebel and The Little Foxes, much to Bankhead's chagrin. Bankhead and Davis were considered to be somewhat similar in style. Several decades later Davis called Channing \"the essence of a Tallulah Bankhead kind of actress\" in an interview with Barbara Walters. The production is notable in that Mary Orr, of The Wisdom of Eve, played the role of Karen Richards. The cast also featured Alan Hewitt as Addison DeWitt (who narrated), Beatrice Pearson as Eve Harrington, Don Briggs as Lloyd Richards, Kevin McCarthy as Bill Samson, Florence Robinson as Birdie Coonan, and Stefan Schnabel as Max Fabian.</p><p>In 1970, All About Eve was the inspiration for the stage musical Applause, with book by Betty Comden and Adolph Green, lyrics by Lee Adams, and music by Charles Strouse. The original production starred Lauren Bacall as Margo Channing, and it won the Tony Award for Best Musical that season. It ran for four previews and 896 performances at the Palace Theatre on Broadway. After Bacall left the production, she was replaced by Anne Baxter in the role of Margo Channing.</p><p>In 2019, a stage adaptation of All About Eve premiered at the Noël Coward Theatre in London, directed by Ivo van Hove and starring Gillian Anderson as Margo Channing, Julian Ovenden as Bill, and Lily James as Eve Harrington.</p><br/><h3>In popular culture</h3><ul><li>The plot of the film has been used numerous times, frequently as an outright homage to the film, with one notable example being a 1974 episode of The Mary Tyler Moore Show titled \"A New Sue Ann\". In the episode, the character of Sue Ann Nivens (Betty White), hostess of a popular local cooking show, hires a young, pretty and very eager fan (Linda Kelsey) as her apprentice and assistant, but the neophyte quickly begins to sabotage her mentor, in an attempt to replace her as host of the show. Sue Ann, however, unlike Margo Channing, prevails in the end, countering the young woman's attempts to steal her success and sending her on her way.</li><li>The English rock band All About Eve took their name from the film.</li><li>Steven Soderbergh's 2012 film Magic Mike is a loose re-working of the All About Eve plot and includes subtle references in hommage to the original. The lead actor Channing Tatum name checks Bette Davis's character Margo Channing, and instead of Eve, the ambitious young upstart is named Adam, played by Alex Pettyfer. Like Eve, Adam gets his stage debut filling in for an absent star, and his subsequent ruthless rise to glory at the expense of others mirrors that of Eve.</li><li>A 2008 episode of The Simpsons titled \"All About Lisa\" is influenced by this film. In the episode, Lisa Simpson becomes Krusty the Clown's assistant, eventually taking his place on television and receiving an entertainment award.</li><li>Pedro Almodóvar's 1999 Academy Award-winning Spanish-language film Todo sobre mi madre (All About My Mother) has elements similar to those found in All About Eve. The title of the film itself is an homage to the 1950 film. In the first scene, the character of Manuela Echevarria and her son, Esteban, are watching a dubbed version of the film on television when the film is introduced as \"Eve Unveiled\". Esteban comments that the film should be called \"Todo Sobre Eva\" (\"All About Eva\"). Later in the scene, he begins writing about his mother in his notebook and calls the piece \"Todo sobre mi madre\". Additionally, Manuela replaces Nina Cruz as Stella for a night in a production of A Streetcar Named Desire, leading a furious Nina to accuse her of learning the part \"just like Eve Harrington!\"</li><li>In a season 3 episode of Gossip Girl, titled \"Enough About Eve\", Blair Waldorf has a dream where she is Margo Channing.</li><li>In the fifth season of The L Word, a fan becomes Jenny Schecter's assistant while she is directing a movie; later the fan blackmails the movie studio into letting her direct and she proceeds to take over Jenny's life.</li><li>In the second season of Glee, Kurt Hummel calls his fellow glee club member Santana Lopez \"a Latina Eve Harrington\", after learning she is blackmailing a closeted jock into becoming her \"beard\" and running mate for Prom Queen and King.</li><li>In the first season of Will & Grace, Grace becomes dependent on a maid to give her a confidence boost during a design competition. This prompts her drunken assistant Karen to suspect a plot and she confronts the maid, exclaiming \"I've seen All About Eve. Poooor Eve!\"</li><li>In the pilot episode of Political Animals, when Susan suspects Georgia, a fellow reporter, has a crush on her boyfriend and is attempting to outshine her at the newspaper, she says, \"If Eve Harrington were an actual person today, she would look like Georgia. She would bake cupcakes, and she would have a blog.\"</li><li>In the third season of Gilligan's Island, the episode \"All About Eva\" concerns the character of Eva Grubb coming on the island and taking over Ginger's persona, with both roles played by actress Tina Louise.</li><li>In the fifth season of Quantum Leap, the plot of the episode \"Goodbye Norma Jean\" mirrors that of All About Eve. In it, Sam Beckett leaps into Marilyn Monroe's chauffeur and finds himself pitted against an aspiring actress who is trying to steal Monroe's part for the film The Misfits. Sam succeeds in stopping Monroe's rival, and she rightfully takes her place as Clark Gable's leading lady.</li><li>In Alex Holdridge's 2007 film In Search of a Midnight Kiss, Vivian, an amateur actress played by Sara Simmonds, says to Wilson, played by Scoot McNairy: \"I just don't think people out here have the raw ambition that I do.\" And he replies: \"You are a real All About Eve.\"</li><li>All About Steve is a 2009 American comedy film.</li><li>A season 6 episode of Designing Women titled, \"All About Odes to Atlanta\", sees Carlene, Mary Jo, and Julia entering a song contest and drawing the attention of a young \"fan\" who seems all too eager to help them, much to Allison's distrust.</li><li>The season 20 episode of Family Guy titled, \"All About Alana\", is a homage to the film and sees Lois Griffin allowing one of her piano students Alana Fitzgerald to move in with the family, who begins slowly taking over Lois' life.</li><li>A Season 3 episode of The Dick Van Dyke Show is titled, \"All About Eavesdropping\". It does not follow the plot of All About Eve: rather, the title refers to Rob and Laura accidentally overhearing Jerry and Millie talk about them via the kids' intercom.</li></ul><br/>"
  },
  "errorMessage": ""
}