{
  "imDbId": "tt0019254",
  "title": "The Passion of Joan of Arc",
  "fullTitle": "The Passion of Joan of Arc (1928)",
  "type": "Movie",
  "year": "1928",
  "items": [
    {
      "publisher": "",
      "author": "BBC",
      "link": "https://www.bbc.co.uk/films/2003/06/23/la_passion_joan_arc_1927_review.shtml",
      "rate": "100",
      "content": "A stark and intense film, Jeanne d'Arc is renowned for its sparse shooting style - which focuses in on Falconetti's face with such relentless fascination that everything else (sets, props, secondary characters) disappear from view."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/great-movie-the-passion-of-joan-of-arc-1928",
      "rate": "100",
      "content": "To modern audiences, raised on films where emotion is conveyed by dialogue and action more than by faces, a film like The Passion of Joan of Arc is an unsettling experience--so intimate we fear we will discover more secrets than we desire."
    },
    {
      "publisher": "",
      "author": "The Guardian",
      "link": "https://www.theguardian.com/film/2019/feb/10/european-film-must-see-25-movies",
      "rate": "100",
      "content": "The last silent film by Danish master Carl Theodor Dreyer, it largely eschewed traditional master shots for a dazzling range of expressive, character-probing close-ups: no historical biopic has ever felt quite so unnervingly intimate."
    },
    {
      "publisher": "The A.V. Club",
      "author": "Keith Phipps",
      "link": "https://www.avclub.com/the-passion-of-joan-of-arc-dvd-1798195528",
      "rate": "100",
      "content": "Danish director Carl Dreyer's 1928 film The Passion Of Joan Of Arc is one of the indisputable masterpieces of the silent era."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "100",
      "content": "Dreyer’s radical approach to constructing space and the slow intensity of his mobile style make this “difficult” in the sense that, like all the greatest films, it reinvents the world from the ground up. It’s also painful in a way that all Dreyer’s tragedies are, but it will continue to live long after most commercial movies have vanished from memory."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "https://www.csmonitor.com/1999/1112/p15s2.html",
      "rate": "100",
      "content": "The chief reason for its legendary reputation is the brilliant match between its timeless historical subject - the trial that required Joan to defend her faith before skeptical representatives of church and state - and Dreyer's decision to film it primarily in relentless close-ups, using the sharply etched faces of his performers to suggest the invisible spiritual struggles going on beneath the drama's human dimensions."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Eric Henderson",
      "link": "",
      "rate": "100",
      "content": "The Passion of Joan of Arc remains the moment that [Dreyer] guided his medium to new heights, and also crafted a work that would endure outside of any specific context."
    },
    {
      "publisher": "",
      "author": "The New York Times",
      "link": "https://www.nytimes.com/1929/03/31/archives/poignant-french-film-maria-falconetti-gives-unequaled-performance-a.html?rref=collection%2Fcollection%2Fmovie-guide",
      "rate": "90",
      "content": "FRANCE can well be proud of that great picture, The Passion of Jeanne d'Arc, for while Carl Dreyer, a Dane, is responsible for the conspicuously fine and imaginative use of the camera, it is the gifted performance of Maria Falconetti as the Maid of Orleans that rises above everything in this artistic achievement."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/passion-of-joan-of-arc-the",
      "rate": "88",
      "content": "It is among the most powerful early arguments in favor of a minimalist approach to filmmaking and champions the effectiveness of the close-up when used properly. It's hard to imagine anyone today arguing its place in the pantheon of Silent Olympians."
    },
    {
      "publisher": "",
      "author": "The Telegraph",
      "link": "https://www.telegraph.co.uk/culture/film/8546261/The-Passion-of-Joan-of-Arc-The-Dome-Brighton-review.html",
      "rate": "80",
      "content": "In the hands of the great Danish director Carl Theodor Dreyer it becomes a potent saga of battered faith, vicious bullying and personal torment."
    }
  ],
  "errorMessage": ""
}