{
  "imDbId": "tt0019254",
  "title": "The Passion of Joan of Arc",
  "fullTitle": "The Passion of Joan of Arc (1928)",
  "type": "Movie",
  "year": "1928",
  "language": "en",
  "titleInLanguage": "The Passion of Joan of Arc",
  "url": "https://en.wikipedia.org/wiki/The_Passion_of_Joan_of_Arc",
  "plotShort": {
    "plainText": "The Passion of Joan of Arc (French: La Passion de Jeanne d'Arc) is a 1928 French silent historical film based on the actual record of the trial of Joan of Arc. The film was directed by Carl Theodor Dreyer and stars Renée Jeanne Falconetti as Joan. It is widely regarded as a landmark of cinema, especially for its production, Dreyer's direction and Falconetti's performance, which is often listed as one of the finest in cinema history. The film summarizes the time that Joan of Arc was a captive of England, depicting her trial and execution.\r\nDanish director Dreyer was invited to make a film in France by the Société Générale des Films and chose to make a film about Joan of Arc due to her renewed popularity in France. Dreyer spent over a year researching Joan of Arc and the transcripts of her trial before writing the script. Dreyer cast stage actress Falconetti as Joan in her only major film role. Falconetti's performance and devotion to the role during filming have become legendary among film scholars.\r\nThe film was shot on one huge concrete set modeled on medieval architecture in order to realistically portray the Rouen prison. The film is known for its cinematography and use of close-ups. Dreyer did not allow the actors to wear make-up and used lighting designs that made the actors look more grotesque. Prior to its release, the film was controversial due to French nationalists' skepticism about whether a Dane could direct a film about one of France's most revered historical icons. Dreyer's final version of the film was cut down due to pressure from the Archbishop of Paris and government censors. For several decades, it was released and viewed in various re-edited versions that attempted to restore Dreyer's final cut. In 1981, a print of Dreyer's final cut was discovered in Dikemark Hospital, a mental institution just outside Oslo, Norway, and re-released.\r\nDespite the objections and cutting of the film by clerical and government authorities, it was a major critical success when first released and has consistently been considered one of the greatest films ever made. It has been praised and referenced by many film directors and musicians. In 1958, the film was voted number 4 on the prestigious Brussels 12 list at the 1958 World Expo.",
    "html": "<p>The Passion of Joan of Arc (French: La Passion de Jeanne d'Arc) is a 1928 French silent historical film based on the actual record of the trial of Joan of Arc. The film was directed by Carl Theodor Dreyer and stars Renée Jeanne Falconetti as Joan. It is widely regarded as a landmark of cinema, especially for its production, Dreyer's direction and Falconetti's performance, which is often listed as one of the finest in cinema history. The film summarizes the time that Joan of Arc was a captive of England, depicting her trial and execution.</p><p>Danish director Dreyer was invited to make a film in France by the Société Générale des Films and chose to make a film about Joan of Arc due to her renewed popularity in France. Dreyer spent over a year researching Joan of Arc and the transcripts of her trial before writing the script. Dreyer cast stage actress Falconetti as Joan in her only major film role. Falconetti's performance and devotion to the role during filming have become legendary among film scholars.</p><p>The film was shot on one huge concrete set modeled on medieval architecture in order to realistically portray the Rouen prison. The film is known for its cinematography and use of close-ups. Dreyer did not allow the actors to wear make-up and used lighting designs that made the actors look more grotesque. Prior to its release, the film was controversial due to French nationalists' skepticism about whether a Dane could direct a film about one of France's most revered historical icons. Dreyer's final version of the film was cut down due to pressure from the Archbishop of Paris and government censors. For several decades, it was released and viewed in various re-edited versions that attempted to restore Dreyer's final cut. In 1981, a print of Dreyer's final cut was discovered in Dikemark Hospital, a mental institution just outside Oslo, Norway, and re-released.</p><p>Despite the objections and cutting of the film by clerical and government authorities, it was a major critical success when first released and has consistently been considered one of the greatest films ever made. It has been praised and referenced by many film directors and musicians. In 1958, the film was voted number 4 on the prestigious Brussels 12 list at the 1958 World Expo.</p>"
  },
  "plotFull": {
    "plainText": "The Passion of Joan of Arc (French: La Passion de Jeanne d'Arc) is a 1928 French silent historical film based on the actual record of the trial of Joan of Arc. The film was directed by Carl Theodor Dreyer and stars Renée Jeanne Falconetti as Joan. It is widely regarded as a landmark of cinema, especially for its production, Dreyer's direction and Falconetti's performance, which is often listed as one of the finest in cinema history. The film summarizes the time that Joan of Arc was a captive of England, depicting her trial and execution.\r\nDanish director Dreyer was invited to make a film in France by the Société Générale des Films and chose to make a film about Joan of Arc due to her renewed popularity in France. Dreyer spent over a year researching Joan of Arc and the transcripts of her trial before writing the script. Dreyer cast stage actress Falconetti as Joan in her only major film role. Falconetti's performance and devotion to the role during filming have become legendary among film scholars.\r\nThe film was shot on one huge concrete set modeled on medieval architecture in order to realistically portray the Rouen prison. The film is known for its cinematography and use of close-ups. Dreyer did not allow the actors to wear make-up and used lighting designs that made the actors look more grotesque. Prior to its release, the film was controversial due to French nationalists' skepticism about whether a Dane could direct a film about one of France's most revered historical icons. Dreyer's final version of the film was cut down due to pressure from the Archbishop of Paris and government censors. For several decades, it was released and viewed in various re-edited versions that attempted to restore Dreyer's final cut. In 1981, a print of Dreyer's final cut was discovered in Dikemark Hospital, a mental institution just outside Oslo, Norway, and re-released.\r\nDespite the objections and cutting of the film by clerical and government authorities, it was a major critical success when first released and has consistently been considered one of the greatest films ever made. It has been praised and referenced by many film directors and musicians. In 1958, the film was voted number 4 on the prestigious Brussels 12 list at the 1958 World Expo.\r\nPlot\r\nAfter having led the French in numerous battles against the English during the Hundred Years' War, Joan of Arc is captured near Compiegne and eventually brought to Rouen to stand trial for heresy by French clergymen loyal to the English.\r\nOn 30 May 1431, Joan is interrogated by the French clerical court. Her judges, who are on the side of the Burgundian-English coalition and against the King of France, try to make her say something that will discredit her claim or shake her belief that she has been given a mission by God to drive the English from France, but she remains steadfast. One or two of them, believing that she is indeed a saint, support her.\r\nThe authorities then resort to deception. A priest reads a false letter in the prison to the illiterate Joan, supposedly from King Charles VII of France, telling her to trust in the bearer. When that too fails, Joan is taken to view the torture chamber, but the sight, though it causes her to faint, does not intimidate her.\r\nWhen she is threatened with burning at the stake, Joan finally breaks and allows a priest to guide her hand in signing a confession. However, the judge then condemns her to life imprisonment. After the jailer shaves her head, she realises that she has been unfaithful to God. She demands that the judges return and she recants her confession.\r\nAs more and more around her begin to recognise her true faith and calling, she is permitted a final communion mass. She is then dressed in sackcloth and taken to the place of execution. She helps the executioner tie her bonds. The crowds gather and the fire is lit.\r\nAs the flames rise, the women weep and a man cries out, \"vous avez brûlé une sainte\" (\"you have burned a saint\"). The troops prepare for a riot. As the flames consume Joan, the troops and crowd clash and people are killed. A subtitle states that the flames protect her soul as it rises to Heaven.\r\nCast\r\nMain characters\r\nJudges\r\nProduction\r\nBackground and writing\r\nAfter the success of Master of the House in Denmark, Dreyer was invited to make a film in France by the Société Gėnėrale des Films, and proposed a film about Marie Antoinette, Catherine de Medici or Joan of Arc. He claimed that the final decision on the film's subject was determined by drawing matches. Joan of Arc was in the news after World War I, having been canonized as a saint by the Roman Catholic Church in 1920, and named one of the patron saints of France. Dreyer spent over a year and a half researching Joan, the script based on the original transcripts of her trial, condensing 29 interrogations over the course of 18 months into one day. The rights to Joseph Delteil's 1925 anti-conformist book on Joan were bought for the production. Nothing from Delteil's book was used in the film; however, he was credited as a source. In an essay for the Danish Film Institute, Dreyer stated what he sought to achieve: \"I wanted to interpret a hymn to the triumph of the soul over life.\"\r\nCasting\r\nJoan of Arc was Renée Jeanne Falconetti's second and last film role. Although she always preferred the art of theater to cinema and said she never understood the positive reaction to the film's acting, Falconetti's performance achieved iconic status in film history almost immediately. Dreyer had gone to see Falconetti backstage at a performance of Victor Margueritte's La Garçonne, a comedic play in which she was appearing. He was initially unimpressed, but upon seeing her a second time the day after, Dreyer said he \"felt there was something in her which could be brought out; something she could give, something, therefore, I could take. For behind the make-up, behind the pose and that ravishing modern appearance, there was something. There was a soul behind that facade.\" Dreyer asked her to do some screen tests the next day, but without any make-up. During the tests, he \"found in her face exactly what I wanted for Joan: a country girl, very sincere, but also a woman of suffering.\" Dreyer then told Falconetti about the film and her role in great detail. She agreed to star in the film, secretly hoping that she would not have to cut her hair or forgo make-up.\r\nJean Renoir praised her performance and said \"That shaven head was and remains the abstraction of the whole epic of Joan of Arc.\" She was famously treated harshly by Dreyer, who had a reputation for being a tyrannical director. Dreyer would always clear the set whenever Falconetti needed to act in a particularly emotional or important scene, allowing her to focus without any distractions. Dreyer often had difficulties explaining himself to Falconetti and was known to turn bright red and begin stammering when passionately directing her. Dreyer had stated that a director \"must be careful never to force his own interpretation on an actor, because an actor cannot create truth and pure emotions on command. One cannot push feelings out. They have to arise from themselves, and it is the director's and actor's work in unison to bring them to that point.\" Later in post-production, Falconetti was the only cast member to watch the rushes and the film's editing. According to critic Roger Ebert:\r\nFor Falconetti, the performance was an ordeal. Legends from the set tell of Dreyer forcing her to kneel painfully on stone and then wipe all expression from her face—so that the viewer would read suppressed or inner pain. He filmed the same shots again and again, hoping that in the editing room he could find exactly the right nuance in her facial expression.\r\nAmong the other cast members was French playwright Antonin Artaud as the monk Massieu. Artaud later stated that the film was meant to \"reveal Joan as the victim of one of the most terrible of all perversions: the perversion of a divine principle in its passage through the minds of men, whether they be Church, Government or what you will.\"\r\nCinematography\r\nThe camerawork of The Passion of Joan of Arc was highly unconventional in its radical emphasis on the actors' facial features. Dreyer shot much of the film in close-up, stating \"There were questions, there were answers- very short, very crisp...Each question, each answer, quite naturally called for a close-up...In addition, the result of the close-ups was that the spectator was as shocked as Joan was, receiving the questions, tortured by them.\" Dreyer also did not allow his actors to wear makeup, the better to tell the story through their expressions—this choice was made possible through use of the recently developed panchromatic film, which recorded skin tones in a naturalistic manner.\r\nDreyer often shot the priests and Joan's other interrogators in high contrast lighting, but then shot Joan in soft, even lighting. Rudolph Maté's high-contrast cinematography also allowed unappealing details in people's faces, such as warts and lumps, to be fully visible. In addition, Dreyer employed many low-angle shots of Joan's persecutors so that they would appear more monstrous and intimidating; in the effort to do this, several holes were dug on the set for the camera to film from the appropriate angle, causing the crew to nickname him \"Carl Gruyére\". Dreyer also shot the film \"from the first to the last scene...in the right order.\"\r\nArt direction\r\nThe film had one of the most expensive sets ever built for a European film up to that time. Upon being given a budget of seven million francs, Dreyer constructed an enormous octagonal concrete set to depict Rouen Castle. Production designers Hermann Warm and Jean Hugo were inspired by medieval miniatures for their designs, adding unnatural angles and perspectives to add to Joan's emotional state of mind. They also relied on medieval manuscripts with accurate architectural drawings, such as John Mandeville's Livre de Merveilles. The huge set was built as one complete, interconnecting structure instead of in separate locations. The castle had towers in all four corners with concrete walls running along the sides. Each wall was 10 centimeters thick so that they could support the weight of actors, technicians and equipment. A functional drawbridge was also built into one of the walls. Inside the walls were small houses, the courtyard where the burning took place and a cathedral. The entire set was painted pink so that it would appear grey in the black and white film and contrast against the white sky above it.\r\nRegardless of the detail put into the set, only segments of it are ever visible in the film, which later angered the film's producers since so much money was spent on the set. Dreyer later expressed, however, that the scope of the set heightened the abilities of the actors and actresses to give convincing performances. Hermann Warm's original models for the film's set are currently stored at the Danish Film Institute Archives.\r\nRelease and different versions\r\nThe Passion of Joan of Arc debuted on 21 April 1928 at the Palads Teatret cinema in Copenhagen. After a few private screenings, it finally premiered in Paris on 25 October 1928 at the Cinema Marivaux. The film's release was delayed due to the persistent efforts of many French nationalists – who objected to the fact that Dreyer was neither Catholic nor French, and to the then-rumored casting of Lillian Gish as Joan. As early as January 1927, Jean-Jose Frappa said that \"whatever the talent of the director (and he has it)...he cannot give us a Joan of Arc in the true French tradition. And the American 'star'...cannot be our Joan, wholesome, lively, shining with purity, faith, courage and patriotism. To let this be made in France would be a scandalous abdication of responsibility.\" Before its French premiere, several cuts were made by order of the Archbishop of Paris and by government censors. Dreyer was angered by these cuts, as he had no control over them. Later that year on 6 December, a fire at UFA studios in Berlin destroyed the film's original negative; only a few copies of Dreyer's original cut of the film existed. Dreyer was able to patch together a new version of the original cut using alternate and initially unused takes. This version was also destroyed in a 1929 lab fire. Over the next four decades, it became difficult to find copies of Dreyer's second version, and copies of the original were thought to be even scarcer.\r\nIt was re-released in 1933 in a 61-minute cut which included a new narration by radio star David Ross, but no intertitles. In 1951, Joseph-Marie Lo Duca found a copy of the negative of Dreyer's second version in the Gaumont Studios vaults. Lo Duca then made several significant changes, including the addition of a Baroque score and the replacing of many intertitles with subtitles. For many years, Lo Duca's version was the only one available. Dreyer himself objected to this cut, however.\r\nThe next version of the film was produced by Arnie Krogh of the Danish Film Institute. Krogh cut together scenes and sequences from several different available prints to attempt to create a cut that was as true to Dreyer's original vision as possible.\r\nRediscovery of original version\r\nThe original version was lost for decades after a fire destroyed the master negative and only variations of Dreyer's second version were available. In 1981, an employee of the Dikemark Hospital mental institution in Asker found several film canisters in a janitor's closet that were labeled as being The Passion of Joan of Arc. The canisters were sent to the Norwegian Film Institute where they were first stored for three years until finally being examined. It was then discovered that they were Dreyer's original cut prior to government or church censorship. There were never any records of the film being shipped to Asker, but film historians believe that the then director of the institution may have requested a special copy since he was a friend of Dreyer's and also a published historian, and an expert on stigmata. The Catholic Church had condemned Dreyer's depiction of Joan's stigmata.\r\nReception\r\nOn its initial release, the film was a critical success and immediately called a masterpiece. However, it was a huge financial flop and caused the Société Générale to cancel its contract with Dreyer after the failure of this film and of Abel Gance's Napoléon. Dreyer angrily accused the Société Générale of mutilating the film so as to avoid offending Catholic viewers and sued them for breach of contract. The lawsuit went on until the fall of 1931, during which time Dreyer was unable to make another film. It was banned in Britain for its portrayal of crude English soldiers who mock and torment Joan in scenes that mirror biblical accounts of Christ's mocking at the hands of Roman soldiers. The Archbishop of Paris was also critical, demanding changes be made.\r\nThe New York Times' film reviewer Mordaunt Hall raved:\r\nas a film work of art this takes precedence over anything that has so far been produced. It makes worthy pictures of the past look like tinsel shams. It fills one with such intense admiration that other pictures appear but trivial in comparison.\r\nOf the star, he wrote \"it is the gifted performance of Maria Falconetti as the Maid of Orleans that rises above everything in this artistic achievement.\"\r\nHowever Variety gave the film a negative review on its initial release, calling it \"a deadly tiresome picture.\" In 1929, The National Board of Review named the film one of the best foreign films of the year.\r\nLegacy\r\nThe film and Falconetti's performance have continued to be praised by critics. Pauline Kael wrote that Falconetti's portrayal \"may be the finest performance ever recorded on film.\" Roger Ebert praised the film and said that \"You cannot know the history of silent film unless you know the face of Renée Maria Falconetti.\" Jean Sémolué called it \"a film of confrontation\" and Paul Schrader has praised \"the architecture of Joan's world, which literally conspires against her; like the faces of her inquisitors, the halls, doorways, furniture are on the offensive, striking, swooping at her with oblique angles, attacking her with hard-edged chunks of black and white.\" Jonathan Rosenbaum wrote that \"Dreyer's radical approach to constructing space and the slow intensity of his mobile style make this “difficult” in the sense that, like all the greatest films, it reinvents the world from the ground up.\"\r\nSome critics have found faults in the film, and Paul Rotha called it \"one of the most remarkable productions ever realized in the history and development of cinema, but it was not a full exposition of real filmic properties\". Tom Milne stated that \"somehow the style Dreyer found for the film seems irremediably false. Instead of flowing naturally from his chosen materials...it seems imposed upon them...Throughout the film there is a constant stylistic uncertainty, an impurity, which jars heavily today,\" but added that \"Jeanne d'Arc has a majestic power which steamrollers its way through all its faults and excesses.\" On Rotten Tomatoes, the film holds a \"Certified Fresh\" rating of 98% based on 59 reviews, with an average rating of 9.10/10. The website's consensus reads, \"The Passion of Joan of Arc is must-see cinema for Renée Maria Falconetti's incredible performance alone -- and an all-time classic for innumerable other reasons.\"\r\nThe Village Voice ranked it the eighth greatest film of the 20th century in a 2000 poll of critics. In January 2002, the film was voted at No. 69 on the list of the Top 100 Essential Films of All Time by the National Society of Film Critics. The film was voted at No. 64 on the list of \"100 Greatest Films\" by the prominent French magazine Cahiers du cinéma in 2008. The Passion of Joan of Arc has appeared on Sight & Sound magazine's top ten films poll five times: as number seven in 1952 and 1972, as number ten (Critic's List) and six (Director's List) in 1992 and as number nine in 2012 (Critic's List). It ranked thirty-seventh on the Director's List in 2012 and was listed by such filmmakers as Manoel de Oliveira, Atom Egoyan, Tsai Ming-Liang, Walter Salles, Béla Tarr, Michael Mann, who called it \"Human experience conveyed purely from the visualisation of the human face: no one else has composed and realised human beings quite like Dreyer in The Passion of Joan of Arc\", and Kutlug Ataman, who said the film \"taught me film could be just poetry and timeless.\" In 2010, The Guardian ranked the film 22nd in its list of 25 greatest arthouse films. In 2010, the Toronto International Film Festival released its \"Essential 100\" list of films, which merged one list of the 100 greatest films of all time as determined by an expert panel of TIFF curators with another list determined by TIFF stakeholders. The Passion of Joan of Arc was ranked as the most influential film of all time. Her performance was ranked 26th in Premiere Magazine's 100 Greatest Performances of All Time, the highest of any silent performance on the list. In 2018 the film ranked 23rd on the BBC's list of the 100 greatest foreign-language films, as voted on by 209 film critics from 43 countries.\r\nScenes from the film appear in Jean-Luc Godard's Vivre sa Vie (1962), in which the protagonist Nana sees the film at a cinema and identifies with Joan. In Henry & June, Henry Miller is shown watching the last scenes of the film and in voice-over narrates a letter to Anaïs Nin comparing her to Joan and himself to the \"mad monk\" character played by Antonin Artaud.\r\nMusic\r\nScores of Dreyer's lifetime\r\nDifferent scores were used for the two premieres of the Passion of Joan of Arc in Copenhagen and Paris. The music of the Paris version, for orchestra and singers, has survived and has been revived. It was composed by Leo Pouget and Victor Alix, who as well as being film composers, both wrote operettas; Pouget was coming to the end of his career, whereas Alix was regarded by Le Ménestrel as becoming an established composer. Their score for the Passion of Joan of Arc has been seen in recent years as having some limitations, but seems to have been regarded as acceptable at the time.\r\nIn the 1920s, film music was normally played live in the theatre. However, some of the Pouget/Alix score was recorded. In 1929, selections were released in 78 format in a performance by \"l'orchestre symphonique du Lutetia Wagram\" (the Lutetia Wagram being a large Parisian cinema of the time, since demolished).\r\nDreyer also heard the soundtrack of Joseph-Marie Lo Duca's version of the film which came out in the 1950s. It featured Bach, Albinoni and Vivaldi: Dreyer disapproved; he appears not to have encountered a score which he considered definitive.\r\nMusical accompaniment since 1968\r\nSince Dreyer's death and the rediscovery of the original print, numerous composers have provided music for the film.\r\nIn 1982 (and on multiple occasions thereafter), silent film pianist and historian Martin M. Marks created and performed a piano score consisting of Medieval and Renaissance chants and keyboard pieces, intermixed with his own original themes, for screenings of the restored film at the Harvard Film Archive (in Cambridge, Massachusetts), as well as in other venues.\r\nIn 1983, the Danish composer and conductor Ole Schmidt composed a score, which was premiered in Los Angeles in 1983 and released on CD by Dacapo Music in 1999\r\nIn 1988, the Dutch composer Jo van den Booren wrote a modern score for symphony orchestra.\r\nIn 1994, composer Richard Einhorn wrote an oratorio based on the film titled Voices of Light. This piece is available as an optional accompaniment on the Criterion Collection's DVD release.\r\nOn 27 August 1995, Nick Cave and the Dirty Three played a live soundtrack to the film at the National Film Theatre in London.\r\nIn 1999, American singer/songwriter Cat Power provided musical accompaniment at several screenings of the film in the U.S.\r\nIn 2003, American guitarist Rob Byrd performed a live score to the film at the Burning Man Festival in Nevada's Black Rock Desert. Subsequent live score performances took place in May 2004 at the Red Tail Loft in Boston, April 2008 at Monkeytown in Brooklyn, November 2010 at the Lyndsay Chapel in Cambridge, Massachusetts, 5 December 2015 at Amoskeag Studios in Manchester, New Hampshire, and on 12 April 2016 at the Walpole Public Library in Walpole, Massachusetts.\r\nIn 2003, Norwegian electronic music act Ugress released a limited edition CD titled La Passion De Jeanne D'Arc: Soundtrack to a Silent Movie.\r\nOn 16 April 2008, neo-classical/martial electronica group In The Nursery premiered a soundtrack for the film at Sheffield Cathedral.\r\nDanish composer Jesper Kyd was commissioned by Danish Film Festival founders Christian Ditlev Bruun and Lene Pels Jorgensen to provide a new score for the Danish Film Festival: Los Angeles.\r\nIn 2009, the Estonian composer Tõnu Kõrvits wrote a score for small orchestra (for L´Ensemble De Basse-Normandie 2009/10 concert season) for this film.\r\nIn 2009, the Lithuanian composer Bronius Kutavičius wrote a score for chamber orchestra (for St. Christopher Chamber Orchestra), performed during the Scanorama European Film Forum in Vilnius.\r\nIn 2010, American electronic/chamber composer/arranger George Sarah provided an original score along with a string quartet and choir featuring members of the LA Master Chorale at a screening of the film in Los Angeles.\r\nIn 2010, Canadian composer Stefan Smulovitz wrote a score for string quartet, brass, percussion, pipe organ, and solo voice, which premiered at the PuSh International Performing Arts Festival in Vancouver, BC.\r\nOn 7 May 2010, a score by Adrian Utley and Will Gregory premièred at the Colston Hall in Bristol. It was a collaboration between Utley, Gregory, the Colston Hall and the Watershed Media Centre.\r\nOn 14 April 2011, indie rock outfit Joan of Arc accompanied this film at Chicago International Movies & Music Fest (CIMM Fest).\r\nIn 2013 Roger Eno provided a live accompaniment in Oxford.\r\nOn 30 May 2013, soloists of the RIAS Kammerchor and the Sheridan Ensemble premiered a version by Australian pianist and composer Philip Mayers in Berlin, Germany, in which motets of Josquin Desprez were interlaced with original music by Philip Mayers. The juxtaposition of music from a few decades after the martyrdom of Jeanne d'Arc and music of the 21st century, played on flute, cello and vibraphone & percussion, sets this version apart from many other scores.\r\nBy the end of September 2014, Matthew Jones (violin) and Jonathan Slaatto (cello) from Danish Ensemble MidtVest, in collaboration with silent film pianist Ronen Thalmay and oboist Henrik Goldschmidt, accompanied this film by the means of free improvisation. Performances were held in Copenhagen (23 September), Sdr. Felding (26 September), Holstebro (27 September), and Århus (29 September).\r\nOn 9 January 2015, Australian post rock band hazards of swimming naked performed an original score accompaniment to a sold out screening of the film at the Queensland Gallery of Modern Art as part of the Cinematheque's \"Myth's and Legends\" programme.\r\nIn 2015, Donald Greig of the Orlando Consort, a British early music group of unaccompanied singers, designed a score consisting of music from the time of Joan of Arc. The Orlando Consort made a tour with the film. The music selected was mainly by French composers and little known to modern audiences outside the world of early music, an exception being the Agincourt Carol. The lyrics had relevance to the film and included Christine de Pizan's Ditié de Jehanne d’Arc, an elegiac poem written during Joan's lifetime.\r\nIn 2016, Spanish silent film band Caspervek Trio premiered an original score accompaniment. Performances were held in Conde Duque (Madrid) and Vigo.\r\nOn 29 September 2017, Julia Holter performed a world premiere of her scoring of the film in downtown Los Angeles at the Fig at Seventh.\r\nOn 12 May 2018, the Cantilena Chamber Choir and orchestra performed the original Pouget/Alix 1928 score with a showing of the complete film at Trinity Church in Lenox, Massachusetts.\r\nOn 21 October 2018, UK-based duo Marisa and Dan Cornford together with the Cantorum Choir gave the premiere of music by Marisa Cornford at St. Paul's Church, Wooburn. A second performance was given at Hughenden on 1 May 2019. They played live to picture using electric viola, bass recorder, snare and keyboard with various Logic sounds. Joining them in both was singer Ella Thornton-Wood.\r\nOn 25 May 2019, Gene Pritsker and Franz Hackl performed the world premiere of Pritsker's score for Dreyer's Passion of Joan of Arc as an accompaniment for a screening of the film on a four-story, IMAX-sized screen. The premiere took place at the GE Theatre at Proctors in Schenectady, New York.\r\nOn 9 June 2019, the Berklee Silent Film Orchestra accompanied a showing of Passion of Joan of Arc with a modern operatic score, composed by students enrolled in Berklee's film scoring program, at the Cabot Street Theatre in Beverly, Massachusetts.\r\nOn 31 October 2019, the Los Angeles-based Morii String Quartet performed an original score co-composed by members of the quartet, which featured microtonality, improvisation, and experimental renditions of early music, in the Bijou Theater at the California Institute of the Arts.\r\nOn 23 November 2022, a new score by US Composer Julia Holter, commissioned by Opera North Projects, was premiered at Huddersfield Town Hall as part of the Huddersfield Contemporary Music Festival (hcmf//).",
    "html": "<p>The Passion of Joan of Arc (French: La Passion de Jeanne d'Arc) is a 1928 French silent historical film based on the actual record of the trial of Joan of Arc. The film was directed by Carl Theodor Dreyer and stars Renée Jeanne Falconetti as Joan. It is widely regarded as a landmark of cinema, especially for its production, Dreyer's direction and Falconetti's performance, which is often listed as one of the finest in cinema history. The film summarizes the time that Joan of Arc was a captive of England, depicting her trial and execution.</p><p>Danish director Dreyer was invited to make a film in France by the Société Générale des Films and chose to make a film about Joan of Arc due to her renewed popularity in France. Dreyer spent over a year researching Joan of Arc and the transcripts of her trial before writing the script. Dreyer cast stage actress Falconetti as Joan in her only major film role. Falconetti's performance and devotion to the role during filming have become legendary among film scholars.</p><p>The film was shot on one huge concrete set modeled on medieval architecture in order to realistically portray the Rouen prison. The film is known for its cinematography and use of close-ups. Dreyer did not allow the actors to wear make-up and used lighting designs that made the actors look more grotesque. Prior to its release, the film was controversial due to French nationalists' skepticism about whether a Dane could direct a film about one of France's most revered historical icons. Dreyer's final version of the film was cut down due to pressure from the Archbishop of Paris and government censors. For several decades, it was released and viewed in various re-edited versions that attempted to restore Dreyer's final cut. In 1981, a print of Dreyer's final cut was discovered in Dikemark Hospital, a mental institution just outside Oslo, Norway, and re-released.</p><p>Despite the objections and cutting of the film by clerical and government authorities, it was a major critical success when first released and has consistently been considered one of the greatest films ever made. It has been praised and referenced by many film directors and musicians. In 1958, the film was voted number 4 on the prestigious Brussels 12 list at the 1958 World Expo.</p><br/><h3>Plot</h3><p>After having led the French in numerous battles against the English during the Hundred Years' War, Joan of Arc is captured near Compiegne and eventually brought to Rouen to stand trial for heresy by French clergymen loyal to the English.</p><p>On 30 May 1431, Joan is interrogated by the French clerical court. Her judges, who are on the side of the Burgundian-English coalition and against the King of France, try to make her say something that will discredit her claim or shake her belief that she has been given a mission by God to drive the English from France, but she remains steadfast. One or two of them, believing that she is indeed a saint, support her.</p><p>The authorities then resort to deception. A priest reads a false letter in the prison to the illiterate Joan, supposedly from King Charles VII of France, telling her to trust in the bearer. When that too fails, Joan is taken to view the torture chamber, but the sight, though it causes her to faint, does not intimidate her.</p><p>When she is threatened with burning at the stake, Joan finally breaks and allows a priest to guide her hand in signing a confession. However, the judge then condemns her to life imprisonment. After the jailer shaves her head, she realises that she has been unfaithful to God. She demands that the judges return and she recants her confession.</p><p>As more and more around her begin to recognise her true faith and calling, she is permitted a final communion mass. She is then dressed in sackcloth and taken to the place of execution. She helps the executioner tie her bonds. The crowds gather and the fire is lit.</p><p>As the flames rise, the women weep and a man cries out, \"vous avez brûlé une sainte\" (\"you have burned a saint\"). The troops prepare for a riot. As the flames consume Joan, the troops and crowd clash and people are killed. A subtitle states that the flames protect her soul as it rises to Heaven.</p><br/><h3>Cast</h3><h4>Main characters</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"text-align: left; vertical-align: top;\"><ul><li><span>Renée Jeanne Falconetti</span> as <span>Joan of Arc</span> (Jeanne d'Arc)</li><li><span>Eugène Silvain</span> as <span>Évêque</span> <span>Pierre Cauchon</span></li><li><span>André Berley</span> as Jean d'Estivet, the prosecutor</li><li><span>Maurice Schutz</span> as Nicolas Loyseleur, a <span class=\"mw-redirect\">canon</span></li><li><span>Antonin Artaud</span> as Jean Massieu, the Dean of Rouen</li></ul></td><td style=\"text-align: left; vertical-align: top;\"><ul><li>Gilbert Dalleu as Jean Lemaitre, the Vice-Inquisitor</li><li><span>Jean d'Yd</span> as Nicolas de Houppeville</li><li>Louis Ravet as Jean Beaupère (as Ravet)</li><li>Camille Bardou as Lord Warwick, the English captain in Rouen</li></ul><p> </p></td></tr></tbody></table><h4>Judges</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"text-align: left; vertical-align: top;\"><ul><li><span>Michel Simon</span></li><li>Paul Fromet</li><li>Armand Lurville</li><li>Jacques Arnna</li><li><span>Alexandre Mihalesco</span></li></ul></td><td style=\"text-align: left; vertical-align: top;\"><ul><li>Raymond Narlay</li><li>Henry Maillard</li><li><span>Léon Larive</span></li><li>Henry Gaultier</li><li>Paul Jorge</li></ul><p> </p></td></tr></tbody></table><br/><h3>Production</h3><h4>Background and writing</h4><p>After the success of Master of the House in Denmark, Dreyer was invited to make a film in France by the Société Gėnėrale des Films, and proposed a film about Marie Antoinette, Catherine de Medici or Joan of Arc. He claimed that the final decision on the film's subject was determined by drawing matches. Joan of Arc was in the news after World War I, having been canonized as a saint by the Roman Catholic Church in 1920, and named one of the patron saints of France. Dreyer spent over a year and a half researching Joan, the script based on the original transcripts of her trial, condensing 29 interrogations over the course of 18 months into one day. The rights to Joseph Delteil's 1925 anti-conformist book on Joan were bought for the production. Nothing from Delteil's book was used in the film; however, he was credited as a source. In an essay for the Danish Film Institute, Dreyer stated what he sought to achieve: \"I wanted to interpret a hymn to the triumph of the soul over life.\"</p><h4>Casting</h4><p>Joan of Arc was Renée Jeanne Falconetti's second and last film role. Although she always preferred the art of theater to cinema and said she never understood the positive reaction to the film's acting, Falconetti's performance achieved iconic status in film history almost immediately. Dreyer had gone to see Falconetti backstage at a performance of Victor Margueritte's La Garçonne, a comedic play in which she was appearing. He was initially unimpressed, but upon seeing her a second time the day after, Dreyer said he \"felt there was something in her which could be brought out; something she could give, something, therefore, I could take. For behind the make-up, behind the pose and that ravishing modern appearance, there was something. There was a soul behind that facade.\" Dreyer asked her to do some screen tests the next day, but without any make-up. During the tests, he \"found in her face exactly what I wanted for Joan: a country girl, very sincere, but also a woman of suffering.\" Dreyer then told Falconetti about the film and her role in great detail. She agreed to star in the film, secretly hoping that she would not have to cut her hair or forgo make-up.</p><p>Jean Renoir praised her performance and said \"That shaven head was and remains the abstraction of the whole epic of Joan of Arc.\" She was famously treated harshly by Dreyer, who had a reputation for being a tyrannical director. Dreyer would always clear the set whenever Falconetti needed to act in a particularly emotional or important scene, allowing her to focus without any distractions. Dreyer often had difficulties explaining himself to Falconetti and was known to turn bright red and begin stammering when passionately directing her. Dreyer had stated that a director \"must be careful never to force his own interpretation on an actor, because an actor cannot create truth and pure emotions on command. One cannot push feelings out. They have to arise from themselves, and it is the director's and actor's work in unison to bring them to that point.\" Later in post-production, Falconetti was the only cast member to watch the rushes and the film's editing. According to critic Roger Ebert:</p><blockquote>For Falconetti, the performance was an ordeal. Legends from the set tell of Dreyer forcing her to kneel painfully on stone and then wipe all expression from her face—so that the viewer would read suppressed or inner pain. He filmed the same shots again and again, hoping that in the editing room he could find exactly the right nuance in her facial expression.</blockquote><p>Among the other cast members was French playwright Antonin Artaud as the monk Massieu. Artaud later stated that the film was meant to \"reveal Joan as the victim of one of the most terrible of all perversions: the perversion of a divine principle in its passage through the minds of men, whether they be Church, Government or what you will.\"</p><h4>Cinematography</h4><p>The camerawork of The Passion of Joan of Arc was highly unconventional in its radical emphasis on the actors' facial features. Dreyer shot much of the film in close-up, stating \"There were questions, there were answers- very short, very crisp...Each question, each answer, quite naturally called for a close-up...In addition, the result of the close-ups was that the spectator was as shocked as Joan was, receiving the questions, tortured by them.\" Dreyer also did not allow his actors to wear makeup, the better to tell the story through their expressions—this choice was made possible through use of the recently developed panchromatic film, which recorded skin tones in a naturalistic manner.</p><p>Dreyer often shot the priests and Joan's other interrogators in high contrast lighting, but then shot Joan in soft, even lighting. Rudolph Maté's high-contrast cinematography also allowed unappealing details in people's faces, such as warts and lumps, to be fully visible. In addition, Dreyer employed many low-angle shots of Joan's persecutors so that they would appear more monstrous and intimidating; in the effort to do this, several holes were dug on the set for the camera to film from the appropriate angle, causing the crew to nickname him \"Carl Gruyére\". Dreyer also shot the film \"from the first to the last scene...in the right order.\"</p><h4>Art direction</h4><p>The film had one of the most expensive sets ever built for a European film up to that time. Upon being given a budget of seven million francs, Dreyer constructed an enormous octagonal concrete set to depict Rouen Castle. Production designers Hermann Warm and Jean Hugo were inspired by medieval miniatures for their designs, adding unnatural angles and perspectives to add to Joan's emotional state of mind. They also relied on medieval manuscripts with accurate architectural drawings, such as John Mandeville's Livre de Merveilles. The huge set was built as one complete, interconnecting structure instead of in separate locations. The castle had towers in all four corners with concrete walls running along the sides. Each wall was 10 centimeters thick so that they could support the weight of actors, technicians and equipment. A functional drawbridge was also built into one of the walls. Inside the walls were small houses, the courtyard where the burning took place and a cathedral. The entire set was painted pink so that it would appear grey in the black and white film and contrast against the white sky above it.</p><p>Regardless of the detail put into the set, only segments of it are ever visible in the film, which later angered the film's producers since so much money was spent on the set. Dreyer later expressed, however, that the scope of the set heightened the abilities of the actors and actresses to give convincing performances. Hermann Warm's original models for the film's set are currently stored at the Danish Film Institute Archives.</p><br/><h3>Release and different versions</h3><p>The Passion of Joan of Arc debuted on 21 April 1928 at the Palads Teatret cinema in Copenhagen. After a few private screenings, it finally premiered in Paris on 25 October 1928 at the Cinema Marivaux. The film's release was delayed due to the persistent efforts of many French nationalists – who objected to the fact that Dreyer was neither Catholic nor French, and to the then-rumored casting of Lillian Gish as Joan. As early as January 1927, Jean-Jose Frappa said that \"whatever the talent of the director (and he has it)...he cannot give us a Joan of Arc in the true French tradition. And the American 'star'...cannot be our Joan, wholesome, lively, shining with purity, faith, courage and patriotism. To let this be made in France would be a scandalous abdication of responsibility.\" Before its French premiere, several cuts were made by order of the Archbishop of Paris and by government censors. Dreyer was angered by these cuts, as he had no control over them. Later that year on 6 December, a fire at UFA studios in Berlin destroyed the film's original negative; only a few copies of Dreyer's original cut of the film existed. Dreyer was able to patch together a new version of the original cut using alternate and initially unused takes. This version was also destroyed in a 1929 lab fire. Over the next four decades, it became difficult to find copies of Dreyer's second version, and copies of the original were thought to be even scarcer.</p><p>It was re-released in 1933 in a 61-minute cut which included a new narration by radio star David Ross, but no intertitles. In 1951, Joseph-Marie Lo Duca found a copy of the negative of Dreyer's second version in the Gaumont Studios vaults. Lo Duca then made several significant changes, including the addition of a Baroque score and the replacing of many intertitles with subtitles. For many years, Lo Duca's version was the only one available. Dreyer himself objected to this cut, however.</p><p>The next version of the film was produced by Arnie Krogh of the Danish Film Institute. Krogh cut together scenes and sequences from several different available prints to attempt to create a cut that was as true to Dreyer's original vision as possible.</p><h4>Rediscovery of original version</h4><p>The original version was lost for decades after a fire destroyed the master negative and only variations of Dreyer's second version were available. In 1981, an employee of the Dikemark Hospital mental institution in Asker found several film canisters in a janitor's closet that were labeled as being The Passion of Joan of Arc. The canisters were sent to the Norwegian Film Institute where they were first stored for three years until finally being examined. It was then discovered that they were Dreyer's original cut prior to government or church censorship. There were never any records of the film being shipped to Asker, but film historians believe that the then director of the institution may have requested a special copy since he was a friend of Dreyer's and also a published historian, and an expert on stigmata. The Catholic Church had condemned Dreyer's depiction of Joan's stigmata.</p><br/><h3>Reception</h3><p>On its initial release, the film was a critical success and immediately called a masterpiece. However, it was a huge financial flop and caused the Société Générale to cancel its contract with Dreyer after the failure of this film and of Abel Gance's Napoléon. Dreyer angrily accused the Société Générale of mutilating the film so as to avoid offending Catholic viewers and sued them for breach of contract. The lawsuit went on until the fall of 1931, during which time Dreyer was unable to make another film. It was banned in Britain for its portrayal of crude English soldiers who mock and torment Joan in scenes that mirror biblical accounts of Christ's mocking at the hands of Roman soldiers. The Archbishop of Paris was also critical, demanding changes be made.</p><p>The New York Times' film reviewer Mordaunt Hall raved:</p><blockquote>as a film work of art this takes precedence over anything that has so far been produced. It makes worthy pictures of the past look like tinsel shams. It fills one with such intense admiration that other pictures appear but trivial in comparison.</blockquote><p>Of the star, he wrote \"it is the gifted performance of Maria Falconetti as the Maid of Orleans that rises above everything in this artistic achievement.\"</p><p>However Variety gave the film a negative review on its initial release, calling it \"a deadly tiresome picture.\" In 1929, The National Board of Review named the film one of the best foreign films of the year.</p><br/><h3>Legacy</h3><p>The film and Falconetti's performance have continued to be praised by critics. Pauline Kael wrote that Falconetti's portrayal \"may be the finest performance ever recorded on film.\" Roger Ebert praised the film and said that \"You cannot know the history of silent film unless you know the face of Renée Maria Falconetti.\" Jean Sémolué called it \"a film of confrontation\" and Paul Schrader has praised \"the architecture of Joan's world, which literally conspires against her; like the faces of her inquisitors, the halls, doorways, furniture are on the offensive, striking, swooping at her with oblique angles, attacking her with hard-edged chunks of black and white.\" Jonathan Rosenbaum wrote that \"Dreyer's radical approach to constructing space and the slow intensity of his mobile style make this “difficult” in the sense that, like all the greatest films, it reinvents the world from the ground up.\"</p><p>Some critics have found faults in the film, and Paul Rotha called it \"one of the most remarkable productions ever realized in the history and development of cinema, but it was not a full exposition of real filmic properties\". Tom Milne stated that \"somehow the style Dreyer found for the film seems irremediably false. Instead of flowing naturally from his chosen materials...it seems imposed upon them...Throughout the film there is a constant stylistic uncertainty, an impurity, which jars heavily today,\" but added that \"Jeanne d'Arc has a majestic power which steamrollers its way through all its faults and excesses.\" On Rotten Tomatoes, the film holds a \"Certified Fresh\" rating of 98% based on 59 reviews, with an average rating of 9.10/10. The website's consensus reads, \"The Passion of Joan of Arc is must-see cinema for Renée Maria Falconetti's incredible performance alone -- and an all-time classic for innumerable other reasons.\"</p><p>The Village Voice ranked it the eighth greatest film of the 20th century in a 2000 poll of critics. In January 2002, the film was voted at No. 69 on the list of the Top 100 Essential Films of All Time by the National Society of Film Critics. The film was voted at No. 64 on the list of \"100 Greatest Films\" by the prominent French magazine Cahiers du cinéma in 2008. The Passion of Joan of Arc has appeared on Sight & Sound magazine's top ten films poll five times: as number seven in 1952 and 1972, as number ten (Critic's List) and six (Director's List) in 1992 and as number nine in 2012 (Critic's List). It ranked thirty-seventh on the Director's List in 2012 and was listed by such filmmakers as Manoel de Oliveira, Atom Egoyan, Tsai Ming-Liang, Walter Salles, Béla Tarr, Michael Mann, who called it \"Human experience conveyed purely from the visualisation of the human face: no one else has composed and realised human beings quite like Dreyer in The Passion of Joan of Arc\", and Kutlug Ataman, who said the film \"taught me film could be just poetry and timeless.\" In 2010, The Guardian ranked the film 22nd in its list of 25 greatest arthouse films. In 2010, the Toronto International Film Festival released its \"Essential 100\" list of films, which merged one list of the 100 greatest films of all time as determined by an expert panel of TIFF curators with another list determined by TIFF stakeholders. The Passion of Joan of Arc was ranked as the most influential film of all time. Her performance was ranked 26th in Premiere Magazine's 100 Greatest Performances of All Time, the highest of any silent performance on the list. In 2018 the film ranked 23rd on the BBC's list of the 100 greatest foreign-language films, as voted on by 209 film critics from 43 countries.</p><p>Scenes from the film appear in Jean-Luc Godard's Vivre sa Vie (1962), in which the protagonist Nana sees the film at a cinema and identifies with Joan. In Henry & June, Henry Miller is shown watching the last scenes of the film and in voice-over narrates a letter to Anaïs Nin comparing her to Joan and himself to the \"mad monk\" character played by Antonin Artaud.</p><h4>Music</h4><h4>Scores of Dreyer's lifetime</h4><p>Different scores were used for the two premieres of the Passion of Joan of Arc in Copenhagen and Paris. The music of the Paris version, for orchestra and singers, has survived and has been revived. It was composed by Leo Pouget and Victor Alix, who as well as being film composers, both wrote operettas; Pouget was coming to the end of his career, whereas Alix was regarded by Le Ménestrel as becoming an established composer. Their score for the Passion of Joan of Arc has been seen in recent years as having some limitations, but seems to have been regarded as acceptable at the time.</p><p>In the 1920s, film music was normally played live in the theatre. However, some of the Pouget/Alix score was recorded. In 1929, selections were released in 78 format in a performance by \"l'orchestre symphonique du Lutetia Wagram\" (the Lutetia Wagram being a large Parisian cinema of the time, since demolished).</p><p>Dreyer also heard the soundtrack of Joseph-Marie Lo Duca's version of the film which came out in the 1950s. It featured Bach, Albinoni and Vivaldi: Dreyer disapproved; he appears not to have encountered a score which he considered definitive.</p><h4>Musical accompaniment since 1968</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This article contains a <b><span>list of miscellaneous information</span>.</b><span class=\"hide-when-compact\"> Please <span>relocate</span> any relevant information into other sections or articles.</span>  <span class=\"date-container\"><i>(<span class=\"date\">June 2017</span>)</i></span></div></td></tr></tbody></table><p>Since Dreyer's death and the rediscovery of the original print, numerous composers have provided music for the film.</p><ul><li>In 1982 (and on multiple occasions thereafter), silent film pianist and historian Martin M. Marks created and performed a piano score consisting of Medieval and Renaissance chants and keyboard pieces, intermixed with his own original themes, for screenings of the restored film at the Harvard Film Archive (in Cambridge, Massachusetts), as well as in other venues.</li><li>In 1983, the Danish composer and conductor Ole Schmidt composed a score, which was premiered in Los Angeles in 1983 and released on CD by Dacapo Music in 1999</li><li>In 1988, the Dutch composer Jo van den Booren wrote a modern score for symphony orchestra.</li><li>In 1994, composer Richard Einhorn wrote an oratorio based on the film titled Voices of Light. This piece is available as an optional accompaniment on the Criterion Collection's DVD release.</li><li>On 27 August 1995, Nick Cave and the Dirty Three played a live soundtrack to the film at the National Film Theatre in London.</li><li>In 1999, American singer/songwriter Cat Power provided musical accompaniment at several screenings of the film in the U.S.</li><li>In 2003, American guitarist Rob Byrd performed a live score to the film at the Burning Man Festival in Nevada's Black Rock Desert. Subsequent live score performances took place in May 2004 at the Red Tail Loft in Boston, April 2008 at Monkeytown in Brooklyn, November 2010 at the Lyndsay Chapel in Cambridge, Massachusetts, 5 December 2015 at Amoskeag Studios in Manchester, New Hampshire, and on 12 April 2016 at the Walpole Public Library in Walpole, Massachusetts.</li><li>In 2003, Norwegian electronic music act Ugress released a limited edition CD titled La Passion De Jeanne D'Arc: Soundtrack to a Silent Movie.</li><li>On 16 April 2008, neo-classical/martial electronica group In The Nursery premiered a soundtrack for the film at Sheffield Cathedral.</li><li>Danish composer Jesper Kyd was commissioned by Danish Film Festival founders Christian Ditlev Bruun and Lene Pels Jorgensen to provide a new score for the Danish Film Festival: Los Angeles.</li><li>In 2009, the Estonian composer Tõnu Kõrvits wrote a score for small orchestra (for L´Ensemble De Basse-Normandie 2009/10 concert season) for this film.</li><li>In 2009, the Lithuanian composer Bronius Kutavičius wrote a score for chamber orchestra (for St. Christopher Chamber Orchestra), performed during the Scanorama European Film Forum in Vilnius.</li><li>In 2010, American electronic/chamber composer/arranger George Sarah provided an original score along with a string quartet and choir featuring members of the LA Master Chorale at a screening of the film in Los Angeles.</li><li>In 2010, Canadian composer Stefan Smulovitz wrote a score for string quartet, brass, percussion, pipe organ, and solo voice, which premiered at the PuSh International Performing Arts Festival in Vancouver, BC.</li><li>On 7 May 2010, a score by Adrian Utley and Will Gregory premièred at the Colston Hall in Bristol. It was a collaboration between Utley, Gregory, the Colston Hall and the Watershed Media Centre.</li><li>On 14 April 2011, indie rock outfit Joan of Arc accompanied this film at Chicago International Movies & Music Fest (CIMM Fest).</li><li>In 2013 Roger Eno provided a live accompaniment in Oxford.</li><li>On 30 May 2013, soloists of the RIAS Kammerchor and the Sheridan Ensemble premiered a version by Australian pianist and composer Philip Mayers in Berlin, Germany, in which motets of Josquin Desprez were interlaced with original music by Philip Mayers. The juxtaposition of music from a few decades after the martyrdom of Jeanne d'Arc and music of the 21st century, played on flute, cello and vibraphone & percussion, sets this version apart from many other scores.</li><li>By the end of September 2014, Matthew Jones (violin) and Jonathan Slaatto (cello) from Danish Ensemble MidtVest, in collaboration with silent film pianist Ronen Thalmay and oboist Henrik Goldschmidt, accompanied this film by the means of free improvisation. Performances were held in Copenhagen (23 September), Sdr. Felding (26 September), Holstebro (27 September), and Århus (29 September).</li><li>On 9 January 2015, Australian post rock band hazards of swimming naked performed an original score accompaniment to a sold out screening of the film at the Queensland Gallery of Modern Art as part of the Cinematheque's \"Myth's and Legends\" programme.</li><li>In 2015, Donald Greig of the Orlando Consort, a British early music group of unaccompanied singers, designed a score consisting of music from the time of Joan of Arc. The Orlando Consort made a tour with the film. The music selected was mainly by French composers and little known to modern audiences outside the world of early music, an exception being the Agincourt Carol. The lyrics had relevance to the film and included Christine de Pizan's Ditié de Jehanne d’Arc, an elegiac poem written during Joan's lifetime.</li><li>In 2016, Spanish silent film band Caspervek Trio premiered an original score accompaniment. Performances were held in Conde Duque (Madrid) and Vigo.</li><li>On 29 September 2017, Julia Holter performed a world premiere of her scoring of the film in downtown Los Angeles at the Fig at Seventh.</li><li>On 12 May 2018, the Cantilena Chamber Choir and orchestra performed the original Pouget/Alix 1928 score with a showing of the complete film at Trinity Church in Lenox, Massachusetts.</li><li>On 21 October 2018, UK-based duo Marisa and Dan Cornford together with the Cantorum Choir gave the premiere of music by Marisa Cornford at St. Paul's Church, Wooburn. A second performance was given at Hughenden on 1 May 2019. They played live to picture using electric viola, bass recorder, snare and keyboard with various Logic sounds. Joining them in both was singer Ella Thornton-Wood.</li><li>On 25 May 2019, Gene Pritsker and Franz Hackl performed the world premiere of Pritsker's score for Dreyer's Passion of Joan of Arc as an accompaniment for a screening of the film on a four-story, IMAX-sized screen. The premiere took place at the GE Theatre at Proctors in Schenectady, New York.</li><li>On 9 June 2019, the Berklee Silent Film Orchestra accompanied a showing of Passion of Joan of Arc with a modern operatic score, composed by students enrolled in Berklee's film scoring program, at the Cabot Street Theatre in Beverly, Massachusetts.</li><li>On 31 October 2019, the Los Angeles-based Morii String Quartet performed an original score co-composed by members of the quartet, which featured microtonality, improvisation, and experimental renditions of early music, in the Bijou Theater at the California Institute of the Arts.</li><li>On 23 November 2022, a new score by US Composer Julia Holter, commissioned by Opera North Projects, was premiered at Huddersfield Town Hall as part of the Huddersfield Contemporary Music Festival (hcmf//).</li></ul><br/>"
  },
  "errorMessage": ""
}