{
  "imDbId": "tt0112573",
  "title": "Braveheart",
  "fullTitle": "Braveheart (1995)",
  "type": "Movie",
  "year": "1995",
  "language": "en",
  "titleInLanguage": "Braveheart",
  "url": "https://en.wikipedia.org/wiki/Braveheart",
  "plotShort": {
    "plainText": "Braveheart is a 1995 American epic historical drama film directed by, produced by, and starring Mel Gibson. Gibson portrays Sir William Wallace, a late-13th century Scottish warrior who led the Scots in the First War of Scottish Independence against King Edward I of England. The film also stars Sophie Marceau, Patrick McGoohan and Catherine McCormack. The story is inspired by Blind Harry's 15th century epic poem The Actes and Deidis of the Illustre and Vallyeant Campioun Schir William Wallace and was adapted for the screen by Randall Wallace.\r\nDevelopment on the film initially started at Metro-Goldwyn-Mayer (MGM) when producer Alan Ladd Jr. picked up the project from Wallace, but when MGM was going through new management, Ladd left the studio and took the project with him. Despite initially declining, Gibson eventually decided to direct the film, as well as star as Wallace. Braveheart was filmed in Scotland and Ireland from June to October 1994 with a budget around $65–70 million. The film, which was produced by Gibson's Icon Productions and The Ladd Company, was distributed by Paramount Pictures in North America and by 20th Century Fox internationally.\r\nReleased on May 24, 1995, Braveheart was praised for its action, drama, and romance, though it was criticized for being historically inaccurate. Nonetheless, the film was successful both critically and commercially. A legacy sequel, Robert the Bruce, was released on June 28, 2019, with Angus Macfadyen reprising his role.",
    "html": "<p>Braveheart is a 1995 American epic historical drama film directed by, produced by, and starring Mel Gibson. Gibson portrays Sir William Wallace, a late-13th century Scottish warrior who led the Scots in the First War of Scottish Independence against King Edward I of England. The film also stars Sophie Marceau, Patrick McGoohan and Catherine McCormack. The story is inspired by Blind Harry's 15th century epic poem The Actes and Deidis of the Illustre and Vallyeant Campioun Schir William Wallace and was adapted for the screen by Randall Wallace.</p><p>Development on the film initially started at Metro-Goldwyn-Mayer (MGM) when producer Alan Ladd Jr. picked up the project from Wallace, but when MGM was going through new management, Ladd left the studio and took the project with him. Despite initially declining, Gibson eventually decided to direct the film, as well as star as Wallace. Braveheart was filmed in Scotland and Ireland from June to October 1994 with a budget around $65–70 million. The film, which was produced by Gibson's Icon Productions and The Ladd Company, was distributed by Paramount Pictures in North America and by 20th Century Fox internationally.</p><p>Released on May 24, 1995, Braveheart was praised for its action, drama, and romance, though it was criticized for being historically inaccurate. Nonetheless, the film was successful both critically and commercially. A legacy sequel, Robert the Bruce, was released on June 28, 2019, with Angus Macfadyen reprising his role.</p>"
  },
  "plotFull": {
    "plainText": "Braveheart is a 1995 American epic historical drama film directed by, produced by, and starring Mel Gibson. Gibson portrays Sir William Wallace, a late-13th century Scottish warrior who led the Scots in the First War of Scottish Independence against King Edward I of England. The film also stars Sophie Marceau, Patrick McGoohan and Catherine McCormack. The story is inspired by Blind Harry's 15th century epic poem The Actes and Deidis of the Illustre and Vallyeant Campioun Schir William Wallace and was adapted for the screen by Randall Wallace.\r\nDevelopment on the film initially started at Metro-Goldwyn-Mayer (MGM) when producer Alan Ladd Jr. picked up the project from Wallace, but when MGM was going through new management, Ladd left the studio and took the project with him. Despite initially declining, Gibson eventually decided to direct the film, as well as star as Wallace. Braveheart was filmed in Scotland and Ireland from June to October 1994 with a budget around $65–70 million. The film, which was produced by Gibson's Icon Productions and The Ladd Company, was distributed by Paramount Pictures in North America and by 20th Century Fox internationally.\r\nReleased on May 24, 1995, Braveheart was praised for its action, drama, and romance, though it was criticized for being historically inaccurate. Nonetheless, the film was successful both critically and commercially. A legacy sequel, Robert the Bruce, was released on June 28, 2019, with Angus Macfadyen reprising his role.\r\nPlot\r\nIn 1280, King Edward \"Longshanks\" invades and conquers Scotland following the death of the Scots king Alexander III, who left no heir to the throne. Young William Wallace witnesses Longshanks's execution of several Scottish nobles, suffers the deaths of his father and brother fighting against the English, and is taken abroad on a pilgrimage throughout Europe by his paternal uncle Argyle, who has Wallace educated.\r\nYears later, Longshanks grants his noblemen land and privileges in Scotland, including jus primae noctis. Meanwhile, a grown Wallace returns to Scotland and falls in love with his childhood friend Murron MacClannough, and the two marry in secret. Wallace rescues Murron from being raped by English soldiers, but as Wallace fights off the soldiers, Murron is captured and publicly executed. In retribution, Wallace leads his clan to fight the English garrison in his hometown and sends the surviving garrison back to England with a message of rebellion for Longshanks.\r\nLongshanks orders his son Prince Edward to stop Wallace by any means necessary while he visits the French King to secure England's alliance with France. Alongside his friend Hamish, Wallace rebels against the English, and as his legend spreads, hundreds of Scots from the surrounding clans join him. Wallace leads his army to victory at the Battle of Stirling Bridge, where he decapitates the English commander Cheltham, and sacks York after Prince Edward fails to send reinforcements there, killing Longshanks's nephew whose severed head is sent to the king. Wallace seeks the assistance of Robert the Bruce, the son of nobleman Robert the Elder, a contender for the Scottish crown. Robert is dominated by his leper father, who wishes to secure the Scottish throne for his son by submitting to the English. Worried by the threat of the rebellion, Longshanks sends his son's wife Isabella of France to try to negotiate with Wallace as a distraction for the landing of another invasion force in Scotland.\r\nAfter meeting him in person, Isabella becomes enamored with Wallace. She warns him of the coming invasion, and Wallace implores the Scottish nobility to take immediate action to counter the threat and take back their country, asking Robert the Bruce to lead. Leading the English army himself, Longshanks confronts the Scots at Falkirk. During the battle, Scottish noblemen Mornay and Lochlan, having been bribed by Longshanks, withdraw their men, resulting in Wallace's army being routed and the death of Hamish's father, Campbell. Wallace is further betrayed when he discovers Robert the Bruce was fighting alongside Longshanks; after the battle, seeing the damage he helped due to his countrymen, Robert reprimands his father and vows never to be on the wrong side again.\r\nWallace kills Lochlan and Mornay for their betrayal and wages a guerrilla war against the English, assisted by Isabella, with whom he eventually has an affair. Robert sets up a meeting with Wallace in Edinburgh, but Robert's father conspires with other nobles to capture and hand over Wallace to the English. Learning of his treachery, Robert disowns and banishes his father. Isabella exacts revenge on the now terminally ill Longshanks, who can no longer speak, by telling him that his bloodline will be destroyed upon his death as she is pregnant with Wallace's child and will ensure that Prince Edward spends as short a time as possible on the throne before Wallace's child replaces him.\r\nIn London, Wallace is brought before an English magistrate, tried for high treason, and condemned to public torture and beheading. Even whilst being disemboweled alive, Wallace refuses to submit to the king. The watching crowd, deeply moved by the Scotsman's valor, begin crying for mercy on Wallace's behalf. The magistrate offers him one final chance, asking him only to utter the word, \"Mercy\", and be granted a quick death. Wallace instead shouts, \"Freedom!\", and his cry rings through the square, the dying Longshanks hearing it. Before being beheaded, Wallace sees a vision of Murron in the crowd, smiling at him.\r\nIn 1314, Robert, now Scotland's king, leads a Scottish army before a ceremonial line of English troops on the fields of Bannockburn, where he is supposed to formally accept English rule. Instead, he invokes Wallace's memory, imploring his men to fight with him as they did with Wallace. Hamish throws Wallace's sword point-down in front of the English army, and he and the Scots chant Wallace's name as Robert leads them into battle against the English, winning the Scots their freedom.\r\nCast\r\nMel Gibson as William Wallace James Robinson as young William Wallace\r\nJames Robinson as young William Wallace\r\nSophie Marceau as Princess Isabella of France\r\nAngus Macfadyen as Robert the Bruce\r\nPatrick McGoohan as King Edward \"Longshanks\"\r\nCatherine McCormack as Murron MacClannough Mhairi Calvey as young Murron MacClannough\r\nMhairi Calvey as young Murron MacClannough\r\nBrendan Gleeson as Hamish Andrew Weir as young Hamish\r\nAndrew Weir as young Hamish\r\nPeter Hanly as Prince Edward\r\nJames Cosmo as Campbell\r\nDavid O'Hara as Stephen of Ireland\r\nIan Bannen as Bruce's father\r\nSeán McGinley as MacClannough\r\nBrian Cox as Argyle Wallace\r\nSean Lawlor as Malcolm Wallace\r\nSandy Nelson as John Wallace\r\nStephen Billington as Phillip\r\nJohn Kavanagh as Craig\r\nAlun Armstrong as Mornay\r\nJohn Murtagh as Lochlan\r\nTommy Flanagan as Morrison\r\nDonal Gibson as Stewart\r\nJeanne Marine as Nicolette\r\nMichael Byrne as Smythe\r\nMalcolm Tierney as Magistrate\r\nBernard Horsfall as Balliol\r\nPeter Mullan as Veteran\r\nGerard McSorley as Cheltham\r\nRichard Leaf as Governor of York\r\nMark Lees as Old Crippled Scotsman\r\nTam White as MacGregor\r\nJimmy Chisholm as Faudron\r\nDavid Gant as the Royal Magistrate\r\nProduction\r\nProducer Alan Ladd Jr. initially had the project at MGM-Pathé Communications when he picked up the script from Wallace. When MGM was going through new management in 1993, Ladd left the studio and took some of its top properties, including Braveheart. Gibson came across the script and even though he liked it, he initially passed on it. However, the thought of it kept coming back to him, and he ultimately decided to take on the project. Terry Gilliam was offered to direct the film, but he declined. Gibson was initially interested in directing only and considered Brad Pitt in the role of Sir William Wallace, but Gibson reluctantly agreed to play Wallace as well. Gibson also considered Jason Patric for William Wallace. Sean Connery was approached to play King Edward, but he declined due to other commitments. Gibson said that Connery's pronunciation of \"Goulash\" helped him for the scottish accent for the film.\r\nGibson and his production company, Icon Productions, had difficulty raising enough money for the film. Warner Bros. was willing to fund the project on the condition that Gibson sign for another Lethal Weapon sequel, which he refused. Gibson eventually gained enough financing for the film, with Paramount Pictures financing a third of the budget in exchange for North American distribution rights to the film, and 20th Century Fox putting up two-thirds of the budget in exchange for international distribution rights.\r\nPrincipal photography on the film began on June 6, 1994. While the crew spent three weeks shooting on location in Scotland, the major battle scenes were shot in Ireland using members of the Irish Army Reserve as extras. To lower costs, Gibson had the same extras, up to 1,600 in some scenes, portray both armies. The reservists had been given permission to grow beards and swapped their military uniforms for medieval garb. Principal photography ended on October 28, 1994. The film was shot in the anamorphic format with Panavision C- and E-Series lenses.\r\nGibson had to tone down the film's battle scenes to avoid an NC-17 rating from the MPAA; the final version was rated R for \"brutal medieval warfare\". Gibson and editor Steven Rosenblum initially had a film at 195 minutes, but Sherry Lansing, who was the head of Paramount at the time, requested Gibson and Rosenblum to cut the film down to 177 minutes. According to Gibson in a 2016 interview with Collider, there is a four-hour version of the film, and he would be interested in reassembling it if both Paramount and Fox are interested.\r\nSoundtrack\r\nThe score was composed and conducted by James Horner and performed by the London Symphony Orchestra. It is Horner's second of three collaborations with Mel Gibson as director. The score has gone on to be one of the most commercially successful soundtracks of all time. It received considerable acclaim from film critics and audiences and was nominated for a number of awards, including the Academy Award, Saturn Award, BAFTA Award, and Golden Globe Award.\r\nRelease and reception\r\nBraveheart premiered at the Seattle International Film Festival on May 18, 1995, and received its wide release in U.S. cinemas six days later.\r\nBox office\r\nOn its opening weekend, Braveheart grossed $9,938,276 in the United States and $75.6 million in its box office run in the U.S. and Canada. Worldwide, the film grossed $210,409,945 and was the thirteenth-highest-grossing film of 1995.\r\nCritical response\r\nOn Rotten Tomatoes the film has an approval rating of 75% and an average score of 7.20/10 based on 125 reviews. The site's consensus states: \"Distractingly violent and historically dodgy, Mel Gibson's Braveheart justifies its epic length by delivering enough sweeping action, drama, and romance to match its ambition.\" On Metacritic the film has a score of 68 out of 100 based on 20 critic reviews, indicating \"generally favorable reviews\". Audiences surveyed by CinemaScore gave the film a grade A- on scale of A to F.\r\nCaryn James of The New York Times praised the film, calling it \"one of the most spectacular entertainments in years.\" Roger Ebert gave the film three and a half out of four stars, calling it \"An action epic with the spirit of the Hollywood swordplay classics and the grungy ferocity of The Road Warrior.\" In a positive review, Gene Siskel wrote that \"in addition to staging battle scenes well, Gibson also manages to recreate the filth and mood of 700 years ago.\" Peter Travers of Rolling Stone felt that \"though the film dawdles a bit with the shimmery, dappled love stuff involving Wallace with a Scottish peasant and a French princess, the action will pin you to your seat.\" The depiction of the Battle of Stirling Bridge was listed by CNN as one of the best battles in cinema history.\r\nNot all reviews were positive, Richard Schickel of Time magazine argued that \"everybody knows that a non-blubbering clause is standard in all movie stars' contracts. Too bad there isn't one banning self-indulgence when they direct.\" Peter Stack of San Francisco Chronicle felt \"at times the film seems an obsessive ode to Mel Gibson machismo.\" In a 2005 poll by British film magazine Empire, Braveheart was No. 1 on their list of \"The Top 10 Worst Pictures to Win Best Picture Oscar\". Empire readers had previously voted Braveheart the best film of 1995.\r\nEffect on tourism\r\nThe European premiere was on September 3, 1995, in Stirling.\r\nIn 1996, the year after the film was released, the annual three-day \"Braveheart Conference\" at Stirling Castle attracted fans of Braveheart, increasing the conference's attendance to 167,000 from 66,000 in the previous year. In the following year, research on visitors to the Stirling area indicated that 55% of the visitors had seen Braveheart. Of visitors from outside Scotland, 15% of those who saw Braveheart said it influenced their decision to visit the country. Of all visitors who saw Braveheart, 39% said the film influenced in part their decision to visit Stirling, and 19% said the film was one of the main reasons for their visit. In the same year, a tourism report said that the \"Braveheart effect\" earned Scotland £7 million to £15 million in tourist revenue, and the report led to various national organizations encouraging international film productions to take place in Scotland.\r\nThe film generated huge interest in Scotland and in Scottish history, not only around the world, but also in Scotland itself. At a Braveheart Convention in 1997, held in Stirling the day after the Scottish Devolution vote and attended by 200 delegates from around the world, Braveheart author Randall Wallace, Seoras Wallace of the Wallace Clan, Scottish historian David Ross and Bláithín FitzGerald from Ireland gave lectures on various aspects of the film. Several of the actors also attended including James Robinson (Young William), Andrew Weir (Young Hamish), Julie Austin (the young bride) and Mhairi Calvey (Young Murron).\r\nAwards and honors\r\nBraveheart was nominated for many awards during the 1995 awards season, though it was not viewed by many as a major contender such as Apollo 13, Il Postino: The Postman, Leaving Las Vegas, Sense and Sensibility, and The Usual Suspects. It wasn't until after the film won the Golden Globe Award for Best Director at the 53rd Golden Globe Awards that it was viewed as a serious Oscar contender.\r\nWhen the nominations were announced for the 68th Academy Awards, Braveheart received ten Academy Award nominations, and a month later, won five including Best Picture, Best Director for Gibson, Best Cinematography, Best Sound Effects Editing, and Best Makeup. Braveheart became the ninth film to win Best Picture with no acting nominations and is one of only four films to win Best Picture without being nominated for the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture, the others being The Shape of Water in 2017, Green Book in 2018, and Nomadland in 2020.\r\nThe film also won the Writers Guild of America Award for Best Original Screenplay. In 2010, the Independent Film & Television Alliance selected the film as one of the 30 Most Significant Independent Films of the last 30 years\r\nAFI's 100 Years ... 100 Movies – Nominated\r\nAFI's 100 Years ... 100 Thrills – No. 91\r\nAFI's 100 Years...100 Heroes & Villains: William Wallace – Nominated Hero\r\nWilliam Wallace – Nominated Hero\r\nAFI's 100 Years ... 100 Movie Quotes: \"They may take away our lives, but they'll never take our freedom!\" – Nominated\r\n\"They may take away our lives, but they'll never take our freedom!\" – Nominated\r\nAFI's 100 Years of Film Scores – Nominated\r\nAFI's 100 Years...100 Cheers – No. 62\r\nAFI's 100 Years ... 100 Movies (10th Anniversary Edition) – Nominated\r\nAFI's 10 Top 10 – Nominated Epic Film\r\nCultural effects and accusations of Anglophobia\r\nLin Anderson, author of Braveheart: From Hollywood To Holyrood, credits the film with playing a significant role in affecting the Scottish political landscape in the mid-to-late 1990s. Peter Jackson cited Braveheart as influence in making the Lord of the Rings film trilogy.\r\nSections of the English media accused the film of harbouring Anti-English sentiment. The Economist called it \"xenophobic\", and John Sutherland writing in The Guardian stated that: \"Braveheart gave full rein to a toxic Anglophobia\". In The Times, Colin McArthur said \"the political effects are truly pernicious. It's a xenophobic film.\" Ian Burrell of The Independent has said, \"The Braveheart phenomenon, a Hollywood-inspired rise in Scottish nationalism, has been linked to a rise in anti-English prejudice\".\r\nWallace Monument\r\nIn 1997, a 12-foot (3.7 m), 13-tonne (13-long-ton; 14-short-ton) sandstone statue depicting Mel Gibson as William Wallace in Braveheart was placed in the car park of the Wallace Monument near Stirling, Scotland. The statue, which was the work of Tom Church, a monumental mason from Brechin, included the word 'Braveheart' on Wallace's shield. The installation became the cause of much controversy; one local resident stated that it was wrong to \"desecrate the main memorial to Wallace with a lump of crap\".\r\nIn 1998, someone wielding a hammer vandalized the statue's face. After repairs were made, the statue was encased in a cage every night to prevent further vandalism. This only incited more calls for the statue to be removed, as it then appeared that the Gibson/Wallace figure was imprisoned. The statue was described as \"among the most loathed pieces of public art in Scotland\". In 2008, the statue was returned to its sculptor to make room for a new visitor centre being built at the foot of the Wallace Monument.\r\nHistorical inaccuracy\r\nRandall Wallace, who wrote the screenplay, has acknowledged Blind Harry's 15th-century epic poem The Acts and Deeds of Sir William Wallace, Knight of Elderslie as a major inspiration for the film. In defending his script, Randall Wallace has said, \"Is Blind Harry true? I don't know. I know that it spoke to my heart and that's what matters to me, that it spoke to my heart.\" Blind Harry's poem is not regarded as historically accurate, and although some incidents in the film that are not historically accurate are taken from Blind Harry (e.g. the hanging of Scottish nobles at the start), there are large parts that are based neither on history nor Blind Harry (e.g. Wallace's affair with Princess Isabella).\r\nElizabeth Ewan describes Braveheart as a film that \"almost totally sacrifices historical accuracy for epic adventure\". It has been described as one of the most historically inaccurate modern films. Sharon Krossa noted that the film contains numerous historical inaccuracies, beginning with the wearing of belted plaid by Wallace and his men. In that period \"no Scots wore belted plaids (let alone kilts of any kind).\" Moreover, when Highlanders finally did begin wearing the belted plaid, it was not \"in the rather bizarre style depicted in the film\". She compares the inaccuracy to \"a film about Colonial America showing the colonial men wearing 20th century business suits, but with the jackets worn back-to-front instead of the right way around.\" In a previous essay about the film, she wrote, \"The events aren't accurate, the dates aren't accurate, the characters aren't accurate, the names aren't accurate, the clothes aren't accurate—in short, just about nothing is accurate.\" The belted plaid (feileadh mór léine) was not introduced until the 16th century. Peter Traquair has referred to Wallace's \"farcical representation as a wild and hairy highlander painted with woad (1,000 years too late) running amok in a tartan kilt (500 years too early).\" Caroline White of The Times described the film as being made up of a \"litany of fibs.\" Irish historian Seán Duffy remarked that \"the battle of Stirling Bridge could have done with a bridge.\"\r\nIn 2009, the film was second on a list of \"most historically inaccurate movies\" in The Times. In the humorous non-fictional historiography An Utterly Impartial History of Britain (2007), author John O'Farrell claims that Braveheart could not have been more historically inaccurate, even if a Plasticine dog had been inserted in the film and the title changed to \"William Wallace and Gromit\".\r\nIn the DVD audio commentary of Braveheart, Mel Gibson acknowledges the historical inaccuracies but defends his choices as director, noting that the way events were portrayed in the film was much more \"cinematically compelling\" than the historical fact or conventional mythos.\r\nJus primae noctis\r\nEdward Longshanks is shown invoking Jus primae noctis in the film, allowing the lord of a medieval estate to take the virginity of his serfs' maiden daughters on their wedding nights. Critical medieval scholarship regards this supposed right as a myth: \"the simple reason why we are dealing with a myth here rests in the surprising fact that practically all writers who make any such claims have never been able or willing to cite any trustworthy source, if they have any.\"\r\nOccupation and independence\r\nThe film suggests Scotland had been under English occupation for some time, at least during Wallace's childhood, and in the run-up to the Battle of Falkirk Wallace says to the younger Bruce, \"e'll have what none of us have ever had before, a country of our own.\" In fact, Scotland had been invaded by England only the year before Wallace's rebellion; prior to the death of King Alexander III it had been a fully separate kingdom.\r\nPortrayal of William Wallace\r\nAs John Shelton Lawrence and Robert Jewett writes, \"Because Wallace is one of Scotland's most important national heroes and because he lived in the very distant past, much that is believed about him is probably the stuff of legend. But there is a factual strand that historians agree to\", summarized from Scots scholar Matt Ewart:\r\nWallace was born into the gentry of Scotland; his father lived until he was 18, his mother until his 24th year; he killed the sheriff of Lanark when he was 27, apparently after the murder of his wife; he led a group of commoners against the English in a very successful battle at Stirling in 1297, temporarily receiving appointment as guardian; Wallace's reputation as a military leader was ruined in the same year of 1297, leading to his resignation as guardian; he spent several years of exile in France before being captured by the English at Glasgow, this resulting in his trial for treason and his cruel execution.\r\nA. E. Christa Canitz writes about the historical William Wallace further: \" was a younger son of the Scottish gentry, usually accompanied by his own chaplain, well-educated, and eventually, having been appointed Guardian of the Kingdom of Scotland, engaged in diplomatic correspondence with the Hanseatic cities of Lübeck and Hamburg\". She finds that in Braveheart, \"any hint of his descent from the lowland gentry (i.e., the lesser nobility) is erased, and he is presented as an economically and politically marginalized Highlander and 'a farmer'—as one with the common peasant, and with a strong spiritual connection to the land which he is destined to liberate.\"\r\nColin McArthur writes that Braveheart \"constructs Wallace as a kind of modern, nationalist guerrilla leader in a period half a millennium before the appearance of nationalism on the historical stage as a concept under which disparate classes and interests might be mobilised within a nation state.\" Writing about Braveheart's \"omissions of verified historical facts\", McArthur notes that Wallace made \"overtures to Edward I seeking less severe treatment after his defeat at Falkirk\", as well as \"the well-documented fact of Wallace's having resorted to conscription and his willingness to hang those who refused to serve.\" Canitz posits that depicting \"such lack of class solidarity\" as the conscriptions and related hangings \"would contaminate the movie's image of Wallace as the morally irreproachable primus inter pares among his peasant fighters.\"\r\nPortrayal of Isabella of France\r\nIsabella of France is shown having an affair with Wallace after the Battle of Falkirk. She later tells Edward I she is pregnant, implying that her son, Edward III, was a product of the affair. In reality, Isabella was around three years old and living in France at the time of the Battle of Falkirk, was not married to Edward II until he was already king, and Edward III was born seven years after Wallace died. The breakdown of the couple's relationship over his liaisons, and the menacing suggestion to a dying Longshanks that she would overthrow and destroy Edward II mirror and foreshadow actual facts; although not until 1326, over 20 years after Wallace's death, Isabella, her son Edward, and her lover Roger Mortimer would invade England to depose - and later murder - Edward II.\r\nPortrayal of Robert the Bruce\r\nRobert the Bruce did change sides between the Scots loyalists and the English more than once in the earlier stages of the Wars of Scottish Independence, but he probably did not fight on the English side at the Battle of Falkirk (although this claim does appear in a few medieval sources). Later, the Battle of Bannockburn was not a spontaneous battle; he had already been fighting a guerrilla campaign against the English for eight years. His title before becoming king was Earl of Carrick, not Earl of Bruce. Bruce's father is portrayed as an infirm leper, although it was Bruce himself who allegedly suffered from leprosy in later life. The actual Bruce's machinations around Wallace, rather than the meek idealist in the film, suggests the father-son relationship represent different aspects of the historical Bruce's character. In the film, Bruce's father betrays Wallace to his son's disgust, acknowledging it as the price of his crown, although in real life Wallace was betrayed by the nobleman John de Menteith and delivered to the English.\r\nPortrayal of Longshanks and Prince Edward\r\nThe actual Edward I was ruthless and temperamental, but the film exaggerates his negative aspects for effect. Edward enjoyed poetry and harp music, was a devoted and loving husband to his wife Eleanor of Castile, and as a religious man, he gave generously to charity. The film's scene where he scoffs cynically at Isabella for distributing gold to the poor after Wallace refuses it as a bribe would have been unlikely. Furthermore, Edward died on campaign two years after Wallace's execution, not in bed at his home.\r\nThe depiction of the future Edward II as an effeminate homosexual drew accusations of homophobia against Gibson.\r\nWe cut a scene out, unfortunately ... where you really got to know that character and to understand his plight and his pain ... But it just stopped the film in the first act so much that you thought, 'When's this story going to start?'\r\nGibson defended his depiction of Prince Edward as weak and ineffectual, saying:\r\nI'm just trying to respond to history. You can cite other examples—Alexander the Great, for example, who conquered the entire world, was also a homosexual. But this story isn't about Alexander the Great. It's about Edward II.\r\nIn response to Longshanks's murder of the Prince's male lover Phillip, Gibson replied: \"The fact that King Edward throws this character out a window has nothing to do with him being gay ... He's terrible to his son, to everybody.\" Gibson asserted that the reason Longshanks kills his son's lover is that the king is a \"psychopath\".\r\nWallace's military campaign\r\n\"MacGregors from the next glen\" joining Wallace shortly after the action at Lanark is dubious, since it is questionable whether Clan Gregor existed at that stage, and when they did emerge their traditional home was Glen Orchy, some distance from Lanark.\r\nWallace did win an important victory at the Battle of Stirling Bridge, but the version in Braveheart is highly inaccurate, as it was filmed without a bridge (and without Andrew Moray, joint commander of the Scots army, who was fatally injured in the battle). Later, Wallace did carry out a large-scale raid into the north of England, but he did not get as far south as York, nor did he kill Longshanks's nephew.\r\nThe \"Irish conscripts\" at the Battle of Falkirk are unhistorical; there were no Irish troops at Falkirk (although many of the English army were, in fact, Welsh).\r\nThe two-handed long swords used by Gibson in the film were not in wide use in the period. A one-handed sword and shield would have been more accurate.\r\nThe depiction of English cavalry and infantry soldiers using uniform dress and armor is historically inaccurate. In the feudal armies of the late 13th and early 14th century, cavalry would have been made up of nobility and knights all in their self-purchased armour and displaying their coats of arms on surcoats and shields. The armour depicted in the film, small metal plates sewn on a fabric, did not exist and would have been ineffective since it could have been easily pierced by swords, spears, arrows etc. Indeed, a knight of that time period would have worn mail chausses to protect his legs, a mail hauberk over a patted gambeson to protect his upper body and arms, as well as a mail coif and a great helm to protect his head. Another layer of protection, the coat-of-plates, would have been worn over the hauberk, but under the surcoat. Infantry would have looked very diverse, using any kind of armor they could obtain and afford.\r\nThe Scottish fighters would have been dressed and armed in the same way as their English opponents. Kilts appeared only in the 16th century, two centuries after the events in the film. However, the cavalry charge depicted at the Battle of Stirling Bridge (which did not actually take place at this battle) is a rare correct cinematic depiction of knights charging their enemies with laid-in lances rather than drawn swords.\r\nHome media\r\nBraveheart was released on DVD on August 29, 2000. It was released on Blu-ray as part of the Paramount Sapphire Series on September 1, 2009. It was released on 4K UHD Blu-ray as part of the 4K upgrade of the Paramount Sapphire Series on May 15, 2018.\r\nSequel\r\nA sequel, titled Robert the Bruce, was released in 2019. The film continues directly on from Braveheart and follows the widow Moira, portrayed by Anna Hutchison, and her family (portrayed by Gabriel Bateman and Talitha Bateman), who save Robert the Bruce, with Angus Macfadyen reprising his role from Braveheart.\r\nThe cast includes Jared Harris, Patrick Fugit, Zach McGowan, Emma Kenney, Diarmaid Murtagh, Seoras Wallace, Shane Coffey, Kevin McNally, and Melora Walters. Richard Gray directed the film, with Macfadyen and Eric Belgau writing the script. Helmer Gray, Macfadyen, Hutchison, Kim Barnard, Nick Farnell, Cameron Nuggent, and Andrew Curry produced the film.\r\nFilming took place in 2019 and was completed with a limited cinematic release the same year.",
    "html": "<p>Braveheart is a 1995 American epic historical drama film directed by, produced by, and starring Mel Gibson. Gibson portrays Sir William Wallace, a late-13th century Scottish warrior who led the Scots in the First War of Scottish Independence against King Edward I of England. The film also stars Sophie Marceau, Patrick McGoohan and Catherine McCormack. The story is inspired by Blind Harry's 15th century epic poem The Actes and Deidis of the Illustre and Vallyeant Campioun Schir William Wallace and was adapted for the screen by Randall Wallace.</p><p>Development on the film initially started at Metro-Goldwyn-Mayer (MGM) when producer Alan Ladd Jr. picked up the project from Wallace, but when MGM was going through new management, Ladd left the studio and took the project with him. Despite initially declining, Gibson eventually decided to direct the film, as well as star as Wallace. Braveheart was filmed in Scotland and Ireland from June to October 1994 with a budget around $65–70 million. The film, which was produced by Gibson's Icon Productions and The Ladd Company, was distributed by Paramount Pictures in North America and by 20th Century Fox internationally.</p><p>Released on May 24, 1995, Braveheart was praised for its action, drama, and romance, though it was criticized for being historically inaccurate. Nonetheless, the film was successful both critically and commercially. A legacy sequel, Robert the Bruce, was released on June 28, 2019, with Angus Macfadyen reprising his role.</p><br/><h3>Plot</h3><p>In 1280, King Edward \"Longshanks\" invades and conquers Scotland following the death of the Scots king Alexander III, who left no heir to the throne. Young William Wallace witnesses Longshanks's execution of several Scottish nobles, suffers the deaths of his father and brother fighting against the English, and is taken abroad on a pilgrimage throughout Europe by his paternal uncle Argyle, who has Wallace educated.</p><p>Years later, Longshanks grants his noblemen land and privileges in Scotland, including jus primae noctis. Meanwhile, a grown Wallace returns to Scotland and falls in love with his childhood friend Murron MacClannough, and the two marry in secret. Wallace rescues Murron from being raped by English soldiers, but as Wallace fights off the soldiers, Murron is captured and publicly executed. In retribution, Wallace leads his clan to fight the English garrison in his hometown and sends the surviving garrison back to England with a message of rebellion for Longshanks.</p><p>Longshanks orders his son Prince Edward to stop Wallace by any means necessary while he visits the French King to secure England's alliance with France. Alongside his friend Hamish, Wallace rebels against the English, and as his legend spreads, hundreds of Scots from the surrounding clans join him. Wallace leads his army to victory at the Battle of Stirling Bridge, where he decapitates the English commander Cheltham, and sacks York after Prince Edward fails to send reinforcements there, killing Longshanks's nephew whose severed head is sent to the king. Wallace seeks the assistance of Robert the Bruce, the son of nobleman Robert the Elder, a contender for the Scottish crown. Robert is dominated by his leper father, who wishes to secure the Scottish throne for his son by submitting to the English. Worried by the threat of the rebellion, Longshanks sends his son's wife Isabella of France to try to negotiate with Wallace as a distraction for the landing of another invasion force in Scotland.</p><p>After meeting him in person, Isabella becomes enamored with Wallace. She warns him of the coming invasion, and Wallace implores the Scottish nobility to take immediate action to counter the threat and take back their country, asking Robert the Bruce to lead. Leading the English army himself, Longshanks confronts the Scots at Falkirk. During the battle, Scottish noblemen Mornay and Lochlan, having been bribed by Longshanks, withdraw their men, resulting in Wallace's army being routed and the death of Hamish's father, Campbell. Wallace is further betrayed when he discovers Robert the Bruce was fighting alongside Longshanks; after the battle, seeing the damage he helped due to his countrymen, Robert reprimands his father and vows never to be on the wrong side again.</p><p>Wallace kills Lochlan and Mornay for their betrayal and wages a guerrilla war against the English, assisted by Isabella, with whom he eventually has an affair. Robert sets up a meeting with Wallace in Edinburgh, but Robert's father conspires with other nobles to capture and hand over Wallace to the English. Learning of his treachery, Robert disowns and banishes his father. Isabella exacts revenge on the now terminally ill Longshanks, who can no longer speak, by telling him that his bloodline will be destroyed upon his death as she is pregnant with Wallace's child and will ensure that Prince Edward spends as short a time as possible on the throne before Wallace's child replaces him.</p><p>In London, Wallace is brought before an English magistrate, tried for high treason, and condemned to public torture and beheading. Even whilst being disemboweled alive, Wallace refuses to submit to the king. The watching crowd, deeply moved by the Scotsman's valor, begin crying for mercy on Wallace's behalf. The magistrate offers him one final chance, asking him only to utter the word, \"Mercy\", and be granted a quick death. Wallace instead shouts, \"Freedom!\", and his cry rings through the square, the dying Longshanks hearing it. Before being beheaded, Wallace sees a vision of Murron in the crowd, smiling at him.</p><p>In 1314, Robert, now Scotland's king, leads a Scottish army before a ceremonial line of English troops on the fields of Bannockburn, where he is supposed to formally accept English rule. Instead, he invokes Wallace's memory, imploring his men to fight with him as they did with Wallace. Hamish throws Wallace's sword point-down in front of the English army, and he and the Scots chant Wallace's name as Robert leads them into battle against the English, winning the Scots their freedom.</p><br/><h3>Cast</h3><ul><li>Mel Gibson as William Wallace James Robinson as young William Wallace</li><li>James Robinson as young William Wallace</li><li>Sophie Marceau as Princess Isabella of France</li><li>Angus Macfadyen as Robert the Bruce</li><li>Patrick McGoohan as King Edward \"Longshanks\"</li><li>Catherine McCormack as Murron MacClannough Mhairi Calvey as young Murron MacClannough</li><li>Mhairi Calvey as young Murron MacClannough</li><li>Brendan Gleeson as Hamish Andrew Weir as young Hamish</li><li>Andrew Weir as young Hamish</li><li>Peter Hanly as Prince Edward</li><li>James Cosmo as Campbell</li><li>David O'Hara as Stephen of Ireland</li><li>Ian Bannen as Bruce's father</li><li>Seán McGinley as MacClannough</li><li>Brian Cox as Argyle Wallace</li><li>Sean Lawlor as Malcolm Wallace</li><li>Sandy Nelson as John Wallace</li><li>Stephen Billington as Phillip</li><li>John Kavanagh as Craig</li><li>Alun Armstrong as Mornay</li><li>John Murtagh as Lochlan</li><li>Tommy Flanagan as Morrison</li><li>Donal Gibson as Stewart</li><li>Jeanne Marine as Nicolette</li><li>Michael Byrne as Smythe</li><li>Malcolm Tierney as Magistrate</li><li>Bernard Horsfall as Balliol</li><li>Peter Mullan as Veteran</li><li>Gerard McSorley as Cheltham</li><li>Richard Leaf as Governor of York</li><li>Mark Lees as Old Crippled Scotsman</li><li>Tam White as MacGregor</li><li>Jimmy Chisholm as Faudron</li><li>David Gant as the Royal Magistrate</li></ul><br/><h3>Production</h3><p>Producer Alan Ladd Jr. initially had the project at MGM-Pathé Communications when he picked up the script from Wallace. When MGM was going through new management in 1993, Ladd left the studio and took some of its top properties, including Braveheart. Gibson came across the script and even though he liked it, he initially passed on it. However, the thought of it kept coming back to him, and he ultimately decided to take on the project. Terry Gilliam was offered to direct the film, but he declined. Gibson was initially interested in directing only and considered Brad Pitt in the role of Sir William Wallace, but Gibson reluctantly agreed to play Wallace as well. Gibson also considered Jason Patric for William Wallace. Sean Connery was approached to play King Edward, but he declined due to other commitments. Gibson said that Connery's pronunciation of \"Goulash\" helped him for the scottish accent for the film.</p><p>Gibson and his production company, Icon Productions, had difficulty raising enough money for the film. Warner Bros. was willing to fund the project on the condition that Gibson sign for another Lethal Weapon sequel, which he refused. Gibson eventually gained enough financing for the film, with Paramount Pictures financing a third of the budget in exchange for North American distribution rights to the film, and 20th Century Fox putting up two-thirds of the budget in exchange for international distribution rights.</p><p>Principal photography on the film began on June 6, 1994. While the crew spent three weeks shooting on location in Scotland, the major battle scenes were shot in Ireland using members of the Irish Army Reserve as extras. To lower costs, Gibson had the same extras, up to 1,600 in some scenes, portray both armies. The reservists had been given permission to grow beards and swapped their military uniforms for medieval garb. Principal photography ended on October 28, 1994. The film was shot in the anamorphic format with Panavision C- and E-Series lenses.</p><p>Gibson had to tone down the film's battle scenes to avoid an NC-17 rating from the MPAA; the final version was rated R for \"brutal medieval warfare\". Gibson and editor Steven Rosenblum initially had a film at 195 minutes, but Sherry Lansing, who was the head of Paramount at the time, requested Gibson and Rosenblum to cut the film down to 177 minutes. According to Gibson in a 2016 interview with Collider, there is a four-hour version of the film, and he would be interested in reassembling it if both Paramount and Fox are interested.</p><br/><h3>Soundtrack</h3><p>The score was composed and conducted by James Horner and performed by the London Symphony Orchestra. It is Horner's second of three collaborations with Mel Gibson as director. The score has gone on to be one of the most commercially successful soundtracks of all time. It received considerable acclaim from film critics and audiences and was nominated for a number of awards, including the Academy Award, Saturn Award, BAFTA Award, and Golden Globe Award.</p><br/><h3>Release and reception</h3><p>Braveheart premiered at the Seattle International Film Festival on May 18, 1995, and received its wide release in U.S. cinemas six days later.</p><h4>Box office</h4><p>On its opening weekend, Braveheart grossed $9,938,276 in the United States and $75.6 million in its box office run in the U.S. and Canada. Worldwide, the film grossed $210,409,945 and was the thirteenth-highest-grossing film of 1995.</p><h4>Critical response</h4><p>On Rotten Tomatoes the film has an approval rating of 75% and an average score of 7.20/10 based on 125 reviews. The site's consensus states: \"Distractingly violent and historically dodgy, Mel Gibson's Braveheart justifies its epic length by delivering enough sweeping action, drama, and romance to match its ambition.\" On Metacritic the film has a score of 68 out of 100 based on 20 critic reviews, indicating \"generally favorable reviews\". Audiences surveyed by CinemaScore gave the film a grade A- on scale of A to F.</p><p>Caryn James of The New York Times praised the film, calling it \"one of the most spectacular entertainments in years.\" Roger Ebert gave the film three and a half out of four stars, calling it \"An action epic with the spirit of the Hollywood swordplay classics and the grungy ferocity of The Road Warrior.\" In a positive review, Gene Siskel wrote that \"in addition to staging battle scenes well, Gibson also manages to recreate the filth and mood of 700 years ago.\" Peter Travers of Rolling Stone felt that \"though the film dawdles a bit with the shimmery, dappled love stuff involving Wallace with a Scottish peasant and a French princess, the action will pin you to your seat.\" The depiction of the Battle of Stirling Bridge was listed by CNN as one of the best battles in cinema history.</p><p>Not all reviews were positive, Richard Schickel of Time magazine argued that \"everybody knows that a non-blubbering clause is standard in all movie stars' contracts. Too bad there isn't one banning self-indulgence when they direct.\" Peter Stack of San Francisco Chronicle felt \"at times the film seems an obsessive ode to Mel Gibson machismo.\" In a 2005 poll by British film magazine Empire, Braveheart was No. 1 on their list of \"The Top 10 Worst Pictures to Win Best Picture Oscar\". Empire readers had previously voted Braveheart the best film of 1995.</p><h4>Effect on tourism</h4><p>The European premiere was on September 3, 1995, in Stirling.</p><p>In 1996, the year after the film was released, the annual three-day \"Braveheart Conference\" at Stirling Castle attracted fans of Braveheart, increasing the conference's attendance to 167,000 from 66,000 in the previous year. In the following year, research on visitors to the Stirling area indicated that 55% of the visitors had seen Braveheart. Of visitors from outside Scotland, 15% of those who saw Braveheart said it influenced their decision to visit the country. Of all visitors who saw Braveheart, 39% said the film influenced in part their decision to visit Stirling, and 19% said the film was one of the main reasons for their visit. In the same year, a tourism report said that the \"Braveheart effect\" earned Scotland £7 million to £15 million in tourist revenue, and the report led to various national organizations encouraging international film productions to take place in Scotland.</p><p>The film generated huge interest in Scotland and in Scottish history, not only around the world, but also in Scotland itself. At a Braveheart Convention in 1997, held in Stirling the day after the Scottish Devolution vote and attended by 200 delegates from around the world, Braveheart author Randall Wallace, Seoras Wallace of the Wallace Clan, Scottish historian David Ross and Bláithín FitzGerald from Ireland gave lectures on various aspects of the film. Several of the actors also attended including James Robinson (Young William), Andrew Weir (Young Hamish), Julie Austin (the young bride) and Mhairi Calvey (Young Murron).</p><h4>Awards and honors</h4><p>Braveheart was nominated for many awards during the 1995 awards season, though it was not viewed by many as a major contender such as Apollo 13, Il Postino: The Postman, Leaving Las Vegas, Sense and Sensibility, and The Usual Suspects. It wasn't until after the film won the Golden Globe Award for Best Director at the 53rd Golden Globe Awards that it was viewed as a serious Oscar contender.</p><p>When the nominations were announced for the 68th Academy Awards, Braveheart received ten Academy Award nominations, and a month later, won five including Best Picture, Best Director for Gibson, Best Cinematography, Best Sound Effects Editing, and Best Makeup. Braveheart became the ninth film to win Best Picture with no acting nominations and is one of only four films to win Best Picture without being nominated for the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture, the others being The Shape of Water in 2017, Green Book in 2018, and Nomadland in 2020.</p><p>The film also won the Writers Guild of America Award for Best Original Screenplay. In 2010, the Independent Film & Television Alliance selected the film as one of the 30 Most Significant Independent Films of the last 30 years</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Recipient(s)</th><th>Result</th></tr><tr><td rowspan=\"5\">20/20 Awards</td><td>Best Cinematography</td><td><span>John Toll</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Costume Design</td><td><span>Charles Knode</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Makeup</td><td><span>Peter Frampton</span>, <span>Paul Pattison</span> and <span>Lois Burwell</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Original Score</td><td><span>James Horner</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td colspan=\"2\">Best Sound</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"10\"><span>Academy Awards</span></td><td><span>Best Picture</span></td><td><span>Mel Gibson</span>, <span>Bruce Davey</span> and <span>Alan Ladd Jr.</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Mel Gibson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay – Written Directly for the Screen</span></td><td><span>Randall Wallace</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td>John Toll</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Costume Design</span></td><td>Charles Knode</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Steven Rosenblum</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Makeup</span></td><td>Peter Frampton, Paul Pattison and Lois Burwell</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Original Dramatic Score</span></td><td>James Horner</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound</span></td><td><span>Andy Nelson</span>, <span>Scott Millan</span>, <span>Anna Behlmer</span> and <span>Brian Simmons</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Sound Effects Editing</span></td><td><span>Lon Bender</span> and <span>Per Hallberg</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>American Cinema Editors Awards</span></td><td><span>Best Edited Feature Film</span></td><td>Steven Rosenblum</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>American Cinema Foundation Awards</td><td colspan=\"2\">Feature Film</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>American Society of Cinematographers Awards</span></td><td><span>Outstanding Achievement in Cinematography in Theatrical Releases</span></td><td>John Toll</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"10\">Awards Circuit Community Awards</td><td>Best Director</td><td>Mel Gibson</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Original Screenplay</td><td>Randall Wallace</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Art Direction</td><td><span>Thomas E. Sanders</span> and <span>Peter Howitt</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Cinematography</td><td>John Toll</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Costume Design</td><td>Charles Knode</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Film Editing</td><td>Steven Rosenblum</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Makeup &amp; Hairstyling</td><td>Peter Frampton, Paul Pattison and Lois Burwell</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Original Score</td><td>James Horner</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td colspan=\"2\">Best Sound</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td colspan=\"2\">Best Stunt Ensemble</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"7\"><span>British Academy Film Awards</span></td><td><span>Best Direction</span></td><td>Mel Gibson</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td>John Toll</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Costume Design</span></td><td>Charles Knode</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Film Music</span></td><td>James Horner</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Makeup</span></td><td>Peter Frampton, Paul Pattison and Lois Burwell</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Production Design</span></td><td>Thomas E. Sanders</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound</span></td><td>Andy Nelson, Scott Millan, Anna Behlmer and Brian Simmons</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Camerimage</span></td><td>Golden Frog</td><td>John Toll</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Cinema Audio Society Awards</span></td><td><span>Outstanding Achievement in Sound Mixing for Motion Pictures</span></td><td>Andy Nelson, Scott Millan, Anna Behlmer and Brian Simmons</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Cinema Writers Circle Awards</span></td><td>Best Foreign Film</td><td rowspan=\"2\">Mel Gibson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Critics' Choice Awards</span></td><td><span>Best Director</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Dallas-Fort Worth Film Critics Association Awards</span></td><td colspan=\"2\"><span>Best Picture</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td>John Toll</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td>Mel Gibson</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Empire Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Flaiano Prizes</span></td><td>Best Foreign Actress</td><td><span>Catherine McCormack</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Motion Picture – Drama</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director – Motion Picture</span></td><td>Mel Gibson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay – Motion Picture</span></td><td>Randall Wallace</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Score – Motion Picture</span></td><td>James Horner</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Golden Reel Awards</span></td><td><span>Best Sound Editing – Dialogue</span></td><td>Mark LaPointe</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Sound Editing – Sound Effects</span></td><td>Lon Bender and Per Hallberg</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>International Film Music Critics Association Awards</span></td><td><span>Best Archival Release of an Existing Score – Re-Release or Re-Recording</span></td><td>James Horner, Dan Goldwasser, Mike Matessino, Jim Titus and Jeff Bond</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Jupiter Awards</span></td><td>Best International Director</td><td>Mel Gibson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Movieguide Awards</span></td><td colspan=\"2\">Best Movie for Mature Audiences</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span>MTV Movie Awards</span></td><td colspan=\"2\"><span class=\"mw-redirect\">Best Movie</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Male Performance</span></td><td rowspan=\"2\">Mel Gibson</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Most Desirable Male</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Action Sequence</span></td><td>Battle of Stirling</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>National Board of Review Awards</span></td><td colspan=\"2\"><span>Top Ten Films</span></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">9th Place</td></tr><tr><td>Special Filmmaking Achievement</td><td>Mel Gibson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Publicists Guild of America Awards</td><td colspan=\"2\">Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>Saturn Awards</span></td><td colspan=\"2\"><span>Best Action/Adventure Film</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Costume Design</span></td><td>Charles Knode</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Music</span></td><td>James Horner</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Southeastern Film Critics Association Awards</td><td colspan=\"2\">Best Picture</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">2nd Place</td></tr><tr><td><span>Turkish Film Critics Association Awards</span></td><td colspan=\"2\">Best Foreign Film</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">3rd Place</td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Best Screenplay – Written Directly for the Screenplay</span></td><td>Randall Wallace</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><ul><li>AFI's 100 Years ... 100 Movies – Nominated</li><li>AFI's 100 Years ... 100 Thrills – No. 91</li><li>AFI's 100 Years...100 Heroes & Villains: William Wallace – Nominated Hero</li><li>William Wallace – Nominated Hero</li><li>AFI's 100 Years ... 100 Movie Quotes: \"They may take away our lives, but they'll never take our freedom!\" – Nominated</li><li>\"They may take away our lives, but they'll never take our freedom!\" – Nominated</li><li>AFI's 100 Years of Film Scores – Nominated</li><li>AFI's 100 Years...100 Cheers – No. 62</li><li>AFI's 100 Years ... 100 Movies (10th Anniversary Edition) – Nominated</li><li>AFI's 10 Top 10 – Nominated Epic Film</li></ul><h4>Cultural effects and accusations of Anglophobia</h4><p>Lin Anderson, author of Braveheart: From Hollywood To Holyrood, credits the film with playing a significant role in affecting the Scottish political landscape in the mid-to-late 1990s. Peter Jackson cited Braveheart as influence in making the Lord of the Rings film trilogy.</p><p>Sections of the English media accused the film of harbouring Anti-English sentiment. The Economist called it \"xenophobic\", and John Sutherland writing in The Guardian stated that: \"Braveheart gave full rein to a toxic Anglophobia\". In The Times, Colin McArthur said \"the political effects are truly pernicious. It's a xenophobic film.\" Ian Burrell of The Independent has said, \"The Braveheart phenomenon, a Hollywood-inspired rise in Scottish nationalism, has been linked to a rise in anti-English prejudice\".</p><h4>Wallace Monument</h4><p>In 1997, a 12-foot (3.7 m), 13-tonne (13-long-ton; 14-short-ton) sandstone statue depicting Mel Gibson as William Wallace in Braveheart was placed in the car park of the Wallace Monument near Stirling, Scotland. The statue, which was the work of Tom Church, a monumental mason from Brechin, included the word 'Braveheart' on Wallace's shield. The installation became the cause of much controversy; one local resident stated that it was wrong to \"desecrate the main memorial to Wallace with a lump of crap\".</p><p>In 1998, someone wielding a hammer vandalized the statue's face. After repairs were made, the statue was encased in a cage every night to prevent further vandalism. This only incited more calls for the statue to be removed, as it then appeared that the Gibson/Wallace figure was imprisoned. The statue was described as \"among the most loathed pieces of public art in Scotland\". In 2008, the statue was returned to its sculptor to make room for a new visitor centre being built at the foot of the Wallace Monument.</p><br/><h3>Historical inaccuracy</h3><p>Randall Wallace, who wrote the screenplay, has acknowledged Blind Harry's 15th-century epic poem The Acts and Deeds of Sir William Wallace, Knight of Elderslie as a major inspiration for the film. In defending his script, Randall Wallace has said, \"Is Blind Harry true? I don't know. I know that it spoke to my heart and that's what matters to me, that it spoke to my heart.\" Blind Harry's poem is not regarded as historically accurate, and although some incidents in the film that are not historically accurate are taken from Blind Harry (e.g. the hanging of Scottish nobles at the start), there are large parts that are based neither on history nor Blind Harry (e.g. Wallace's affair with Princess Isabella).</p><p>Elizabeth Ewan describes Braveheart as a film that \"almost totally sacrifices historical accuracy for epic adventure\". It has been described as one of the most historically inaccurate modern films. Sharon Krossa noted that the film contains numerous historical inaccuracies, beginning with the wearing of belted plaid by Wallace and his men. In that period \"no Scots wore belted plaids (let alone kilts of any kind).\" Moreover, when Highlanders finally did begin wearing the belted plaid, it was not \"in the rather bizarre style depicted in the film\". She compares the inaccuracy to \"a film about Colonial America showing the colonial men wearing 20th century business suits, but with the jackets worn back-to-front instead of the right way around.\" In a previous essay about the film, she wrote, \"The events aren't accurate, the dates aren't accurate, the characters aren't accurate, the names aren't accurate, the clothes aren't accurate—in short, just about nothing is accurate.\" The belted plaid (feileadh mór léine) was not introduced until the 16th century. Peter Traquair has referred to Wallace's \"farcical representation as a wild and hairy highlander painted with woad (1,000 years too late) running amok in a tartan kilt (500 years too early).\" Caroline White of The Times described the film as being made up of a \"litany of fibs.\" Irish historian Seán Duffy remarked that \"the battle of Stirling Bridge could have done with a bridge.\"</p><p>In 2009, the film was second on a list of \"most historically inaccurate movies\" in The Times. In the humorous non-fictional historiography An Utterly Impartial History of Britain (2007), author John O'Farrell claims that Braveheart could not have been more historically inaccurate, even if a Plasticine dog had been inserted in the film and the title changed to \"William Wallace and Gromit\".</p><p>In the DVD audio commentary of Braveheart, Mel Gibson acknowledges the historical inaccuracies but defends his choices as director, noting that the way events were portrayed in the film was much more \"cinematically compelling\" than the historical fact or conventional mythos.</p><h4>Jus primae noctis</h4><p>Edward Longshanks is shown invoking Jus primae noctis in the film, allowing the lord of a medieval estate to take the virginity of his serfs' maiden daughters on their wedding nights. Critical medieval scholarship regards this supposed right as a myth: \"the simple reason why we are dealing with a myth here rests in the surprising fact that practically all writers who make any such claims have never been able or willing to cite any trustworthy source, if they have any.\"</p><h4>Occupation and independence</h4><p>The film suggests Scotland had been under English occupation for some time, at least during Wallace's childhood, and in the run-up to the Battle of Falkirk Wallace says to the younger Bruce, \"e'll have what none of us have ever had before, a country of our own.\" In fact, Scotland had been invaded by England only the year before Wallace's rebellion; prior to the death of King Alexander III it had been a fully separate kingdom.</p><h4>Portrayal of William Wallace</h4><p>As John Shelton Lawrence and Robert Jewett writes, \"Because Wallace is one of Scotland's most important national heroes and because he lived in the very distant past, much that is believed about him is probably the stuff of legend. But there is a factual strand that historians agree to\", summarized from Scots scholar Matt Ewart:</p><blockquote>Wallace was born into the gentry of Scotland; his father lived until he was 18, his mother until his 24th year; he killed the sheriff of Lanark when he was 27, apparently after the murder of his wife; he led a group of commoners against the English in a very successful battle at Stirling in 1297, temporarily receiving appointment as guardian; Wallace's reputation as a military leader was ruined in the same year of 1297, leading to his resignation as guardian; he spent several years of exile in France before being captured by the English at Glasgow, this resulting in his trial for treason and his cruel execution.</blockquote><p>A. E. Christa Canitz writes about the historical William Wallace further: \" was a younger son of the Scottish gentry, usually accompanied by his own chaplain, well-educated, and eventually, having been appointed Guardian of the Kingdom of Scotland, engaged in diplomatic correspondence with the Hanseatic cities of Lübeck and Hamburg\". She finds that in Braveheart, \"any hint of his descent from the lowland gentry (i.e., the lesser nobility) is erased, and he is presented as an economically and politically marginalized Highlander and 'a farmer'—as one with the common peasant, and with a strong spiritual connection to the land which he is destined to liberate.\"</p><p>Colin McArthur writes that Braveheart \"constructs Wallace as a kind of modern, nationalist guerrilla leader in a period half a millennium before the appearance of nationalism on the historical stage as a concept under which disparate classes and interests might be mobilised within a nation state.\" Writing about Braveheart's \"omissions of verified historical facts\", McArthur notes that Wallace made \"overtures to Edward I seeking less severe treatment after his defeat at Falkirk\", as well as \"the well-documented fact of Wallace's having resorted to conscription and his willingness to hang those who refused to serve.\" Canitz posits that depicting \"such lack of class solidarity\" as the conscriptions and related hangings \"would contaminate the movie's image of Wallace as the morally irreproachable primus inter pares among his peasant fighters.\"</p><h4>Portrayal of Isabella of France</h4><p>Isabella of France is shown having an affair with Wallace after the Battle of Falkirk. She later tells Edward I she is pregnant, implying that her son, Edward III, was a product of the affair. In reality, Isabella was around three years old and living in France at the time of the Battle of Falkirk, was not married to Edward II until he was already king, and Edward III was born seven years after Wallace died. The breakdown of the couple's relationship over his liaisons, and the menacing suggestion to a dying Longshanks that she would overthrow and destroy Edward II mirror and foreshadow actual facts; although not until 1326, over 20 years after Wallace's death, Isabella, her son Edward, and her lover Roger Mortimer would invade England to depose - and later murder - Edward II.</p><h4>Portrayal of Robert the Bruce</h4><p>Robert the Bruce did change sides between the Scots loyalists and the English more than once in the earlier stages of the Wars of Scottish Independence, but he probably did not fight on the English side at the Battle of Falkirk (although this claim does appear in a few medieval sources). Later, the Battle of Bannockburn was not a spontaneous battle; he had already been fighting a guerrilla campaign against the English for eight years. His title before becoming king was Earl of Carrick, not Earl of Bruce. Bruce's father is portrayed as an infirm leper, although it was Bruce himself who allegedly suffered from leprosy in later life. The actual Bruce's machinations around Wallace, rather than the meek idealist in the film, suggests the father-son relationship represent different aspects of the historical Bruce's character. In the film, Bruce's father betrays Wallace to his son's disgust, acknowledging it as the price of his crown, although in real life Wallace was betrayed by the nobleman John de Menteith and delivered to the English.</p><h4>Portrayal of Longshanks and Prince Edward</h4><p>The actual Edward I was ruthless and temperamental, but the film exaggerates his negative aspects for effect. Edward enjoyed poetry and harp music, was a devoted and loving husband to his wife Eleanor of Castile, and as a religious man, he gave generously to charity. The film's scene where he scoffs cynically at Isabella for distributing gold to the poor after Wallace refuses it as a bribe would have been unlikely. Furthermore, Edward died on campaign two years after Wallace's execution, not in bed at his home.</p><p>The depiction of the future Edward II as an effeminate homosexual drew accusations of homophobia against Gibson.</p><blockquote>We cut a scene out, unfortunately ... where you really got to know that character and to understand his plight and his pain ... But it just stopped the film in the first act so much that you thought, 'When's this story going to start?'</blockquote><p>Gibson defended his depiction of Prince Edward as weak and ineffectual, saying:</p><blockquote>I'm just trying to respond to history. You can cite other examples—Alexander the Great, for example, who conquered the entire world, was also a homosexual. But this story isn't about Alexander the Great. It's about Edward II.</blockquote><p>In response to Longshanks's murder of the Prince's male lover Phillip, Gibson replied: \"The fact that King Edward throws this character out a window has nothing to do with him being gay ... He's terrible to his son, to everybody.\" Gibson asserted that the reason Longshanks kills his son's lover is that the king is a \"psychopath\".</p><h4>Wallace's military campaign</h4><p>\"MacGregors from the next glen\" joining Wallace shortly after the action at Lanark is dubious, since it is questionable whether Clan Gregor existed at that stage, and when they did emerge their traditional home was Glen Orchy, some distance from Lanark.</p><p>Wallace did win an important victory at the Battle of Stirling Bridge, but the version in Braveheart is highly inaccurate, as it was filmed without a bridge (and without Andrew Moray, joint commander of the Scots army, who was fatally injured in the battle). Later, Wallace did carry out a large-scale raid into the north of England, but he did not get as far south as York, nor did he kill Longshanks's nephew.</p><p>The \"Irish conscripts\" at the Battle of Falkirk are unhistorical; there were no Irish troops at Falkirk (although many of the English army were, in fact, Welsh).</p><p>The two-handed long swords used by Gibson in the film were not in wide use in the period. A one-handed sword and shield would have been more accurate.</p><p>The depiction of English cavalry and infantry soldiers using uniform dress and armor is historically inaccurate. In the feudal armies of the late 13th and early 14th century, cavalry would have been made up of nobility and knights all in their self-purchased armour and displaying their coats of arms on surcoats and shields. The armour depicted in the film, small metal plates sewn on a fabric, did not exist and would have been ineffective since it could have been easily pierced by swords, spears, arrows etc. Indeed, a knight of that time period would have worn mail chausses to protect his legs, a mail hauberk over a patted gambeson to protect his upper body and arms, as well as a mail coif and a great helm to protect his head. Another layer of protection, the coat-of-plates, would have been worn over the hauberk, but under the surcoat. Infantry would have looked very diverse, using any kind of armor they could obtain and afford.</p><p>The Scottish fighters would have been dressed and armed in the same way as their English opponents. Kilts appeared only in the 16th century, two centuries after the events in the film. However, the cavalry charge depicted at the Battle of Stirling Bridge (which did not actually take place at this battle) is a rare correct cinematic depiction of knights charging their enemies with laid-in lances rather than drawn swords.</p><br/><h3>Home media</h3><p>Braveheart was released on DVD on August 29, 2000. It was released on Blu-ray as part of the Paramount Sapphire Series on September 1, 2009. It was released on 4K UHD Blu-ray as part of the 4K upgrade of the Paramount Sapphire Series on May 15, 2018.</p><br/><h3>Sequel</h3><p>A sequel, titled Robert the Bruce, was released in 2019. The film continues directly on from Braveheart and follows the widow Moira, portrayed by Anna Hutchison, and her family (portrayed by Gabriel Bateman and Talitha Bateman), who save Robert the Bruce, with Angus Macfadyen reprising his role from Braveheart.</p><p>The cast includes Jared Harris, Patrick Fugit, Zach McGowan, Emma Kenney, Diarmaid Murtagh, Seoras Wallace, Shane Coffey, Kevin McNally, and Melora Walters. Richard Gray directed the film, with Macfadyen and Eric Belgau writing the script. Helmer Gray, Macfadyen, Hutchison, Kim Barnard, Nick Farnell, Cameron Nuggent, and Andrew Curry produced the film.</p><p>Filming took place in 2019 and was completed with a limited cinematic release the same year.</p><br/>"
  },
  "errorMessage": ""
}