{
  "imDbId": "tt0088247",
  "title": "The Terminator",
  "fullTitle": "The Terminator (1984)",
  "type": "Movie",
  "year": "1984",
  "items": [
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0216010",
      "warningSpoilers": false,
      "date": "4 August 2002",
      "rate": "10",
      "helpful": "332 out of 407 found this helpful.",
      "title": "This is the movie that made a big break through for sci-fi movies!!!!",
      "content": "The Terminator is one of those films that no matter if you've seen it or not, you've heard of it, heck you know at least one or two lines without seeing it! This is the movie that blasted then new comer's Arnold Schwartzeneggerr's career, made James Cameron a name in Hollywood, and gave new meaning to a possible dark future that gave us nightmares. I remember the first time I saw this movie, I was just 8 years old and my dad of course walks in saying to cover my eyes at every \"bad\" scene with violence or nudity, needless to say about 70% of the movie he covered my eyes. Finally I got to see it with my mom and I was in love, this wasn't just an action movie, though it is one of the best, it had a story. To think this was all based upon just a quick nightmare that James Cameron had, he didn't have much money, but he had a good script, a great crew on his side to make one of cinema's greatest movies of all time.Two men appear in Los Angeles in separate locations, manifesting in sudden, blinding flash-storms of electricity. One is heavily muscular; the other man, slim and wiry. The mysterious muscular man obtains weapons and begins hunting down all women named \"Sarah Connor\", using a phone book to track his targets. He successfully kills the first two of the three listed women. When he attempts to kill the last Sarah Connor, he is stopped by the other man, Kyle Reese who has been sent back in time to protect her. While hiding in a parking garage, Reese explains that the man hunting Sarah is actually a cyborg assassin called a \"Terminator\", built by Skynet, an artificial intelligence network created by Cyberdyne Systems. In the near future, Reese explains, Skynet gained self-awareness, initiated a global takeover of military hardware, and launched a nuclear war against humanity. Skynet ordered that a scant number of humans were to be kept alive in order to be used as slave labor. John Connor, Sarah's son, rallied the few remaining humans and led a resistance movement against the machines. After a grinding campaign, the human resistance was on the verge of victory; in a last-ditch effort, Skynet sent the Terminator back in time to kill Sarah before John was born, preventing the resistance from ever being founded and allowing the machines to win by default. Reese volunteered to follow the Terminator back in time to protect Sarah; after his use of the time transportation equipment, it was to be destroyed by the resistance in order to prevent further Terminators from going back in time. The Terminator feels no pain, has no emotions, and will stop at nothing to accomplish its mission.The Terminator is personally one of my favorite movies of all time, I think because this movie really is something special. Yeah, the effects are very 80's, but for the time and even to this day, I think the special effects are much better than the CGI crud we get in today's cinema. This has everything: action, romance, horror, sci-fi, and even some dark humor. The reason why Arnold's \"I'll be back\" is so famous is not just because of his accent, but because you knew that something bad was coming. Kyle Reese's \"Come with me if you want to live\" is classic as well. If you haven't seen The Terminator, I highly recommend this movie, it's an incredible one that is sure to deliver entertainment to the fullest. This is one of the greatest movies of all time and I'm sure that you will not be disappointed, if you are, get a CAT scan.10/10"
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0215918",
      "warningSpoilers": true,
      "date": "5 June 2003",
      "rate": "10",
      "helpful": "304 out of 376 found this helpful.",
      "title": "The best of the best in its genre...",
      "content": "Rarely has a film so frightened an audience as \"The Terminator.\" After its release in 1984, the extremely low-budget sci-fi actioner broke box office records, and gave audiences something more to fear. Through the years, there have been stories of nature's beasts, of creatures from another world, and so on and so forth. \"Jaws\" was terrifying because it seemed so possible. And if \"Jaws\" is terrifying, \"The Terminator\" is horrific. The realization of this hit-man machine dawned on everyone watching the film. In a time of exceeding technology, how long will it be before man is overtaken by the very things he created? And that is what is particularly scary about a film like \"The Terminator.\" In \"The Terminator,\" Arnold plays a cyborg, Cyberdyne system model 101, a T800, whatever that means. He has been sent back in time to assassinate the soon-to-be-mother of the future world leader, John Connor (who battles the machines in the future and leads an uprising). If Connor is killed, then there will be no one to oppose the machines of the future, and they will triumph. This would be pretty bad. So the future John Connor has sent a protector back in time, to help save his mother. Kyle Reese (Michael Biehn) tells Sarah Connor (Linda Hamilton) about the machine that is trying to kill her. \"It can't be bargained with, it can't feel pain or mercy, and it will stop at absolutely nothing until you are dead!\" Talk about a bad day.The Terminator hunts them down time after time, including the famous police station scene, where Arnie says, \"I'll be back,\" and returns moments later, crashing through the wall in a car. He then takes on a whole squad of cops, but don't worry, Sarah and Reese escape slightly unscathed.There are countless classic scenes in \"The Terminator.\" You will see them spoofed your entire life. From the image of the Terminator, to the lines they speak, to the scenes they act out. Everything is spoofed. And the film is worthy of its fame.On the special edition \"T2\" DVD (the second one), there is an on-set documentary for the making of the \"Terminator 2\" 3-D ride at Universal Studios. As the camera moves around, it shows Cameron detailing what he wants in this scene. Some guy suggests something else, and Cameron gets a tone. \"No, no, that won't work. You do it like this - we come off here, he walks around...\" etc. The point is, he's a perfectionist, and a demanding director. Some directors are a bit too easy, and don't really care where their films are going. But James Cameron seems to have a clear vision of what he wants, and he goes around making sure it gets done exactly the way he wants it to be done. And it shows in his work. It's hard to find any mistakes in a James Cameron film. And it's even harder to find plot holes.Some people say \"Terminator 2 - Judgment Day\" is better than the original. It's hard to choose, because the two films are very different. I view \"The Terminator\" as more of a deep, intellectually-consuming, dark thriller. I view \"Judgment Day\" as an action film, with a more or less recycled plot. (The plot is still good, but it's still the same, too.) It's hard to choose a favorite because they are so different. On \"T2\" the budget is ten times larger, probably even more than that. But if you want a horror/thriller, \"The Terminator\" is better for you. If you want special-effects and a really fun time, see \"T2.\" They're both excellent films.\"The Terminator\" is a great movie. It is one of my favorites; it is terrifying, horrifying, and 100 % entertaining. And unlike a lot of other cheap actioners out there, \"The Terminator\" has some thought put into its plot, and that is what separates it from the rest of its kind."
    },
    {
      "username": "baumer",
      "userUrl": "https://www.imdb.com/user/ur0355122",
      "reviewLink": "https://www.imdb.com/review/rw0215922",
      "warningSpoilers": false,
      "date": "15 July 1999",
      "rate": "10",
      "helpful": "305 out of 377 found this helpful.",
      "title": "Nice night for a walk.",
      "content": "Is there a better person to play a cyborg than Arnold? For this movie he was a massively built oak tree of a man. His strange accent makes for a perfect callous robotic sounding killing machine. It's almost like his voice is a computer read out ( which I guess it is in one sense ). Terminator is one of those films that started something huge. People didn't realize it at the time, but the careers of Arnold, Cameron and perhaps even guys like Micahel Biehn, Lance Henriksen and even Bill Paxton were substantially started because of this film. And Cameron must have liked working with them so much that he gave all of them substantial roles in his next film ( Aliens ).As we all know what the story is, I'll just tell you a bit about what is so fascinating about it. First I have to mention Michael Biehn. He has the real starring role. He is the character that has to explain everything to the audience. He has to explain this complicated story so that we know what is happening and why. It is not an easy job to do something like that and still come off looking all right. But Biehn is simply awesome in this film. A microcosm of his performance can be seen when Sara bites him. Biehn ( Kyle Reese ) replies \" Terminator's don't feel pain. I do. Don't do that again. \" That is such a great line delivered with the perfect expression, the perfect tone and the perfect timing. Biehn is perfect for the role.This is also the first film that I saw as a youngster that ever warned me of the dangers of nuclear war and of the rapid advancements of machinery. Perhaps I was too young and naive to fully understand all that James Cameron was trying to say, but now that I am older, I can honestly say that the two Terminators are perfect anti nuke films. And they are so passionate with what they have to say. I like it when a film has something to say. I enjoy being entertained in the process but if you can manage both then you have a masterpiece. This is a masterpiece.Finally. there are two other reasons to enjoy this film. One, this is the first film where \"I'll be back\" was spoken. Now it is part of Arnolds vernacular. Secondly, Bill Paxton is in it. And he adds spark to any film that he's in. Especially here, as the idiot punk leader that really gets the hell beat out of him, he has some great lines.A great film."
    },
    {
      "username": "ivo-cobra8",
      "userUrl": "https://www.imdb.com/user/ur15140057",
      "reviewLink": "https://www.imdb.com/review/rw4024180",
      "warningSpoilers": false,
      "date": "5 January 2018",
      "rate": "10",
      "helpful": "139 out of 170 found this helpful.",
      "title": "Schwarzenegger's my personal favorite best action classic masterpiece of all time",
      "content": "The Terminator (1984) is a masterpiece, the best sci-fi action classics horror movie that started all the Terminator movies. This is Schwarzenegger's best movie and my personal favorite action film. I love this film to death it is my childhood film I grew up with it. Arnold Schwarzenegger was The Terminator T-800 Model 101 indestructible killing machine cyborg. This movie is brilliant, it has brilliant story, brilliant plot, excellent additional cast, brilliant director and writers, good special effects, it is mixed with sci-fi, action and horror. This movie deals with the war that was set in the future but the battle will be fought in the present. It deals with paradox travel trough time.\"It can't be bargained with. It can't be reasoned with. It doesn't feel pity, or remorse, or fear. And it absolutely will not stop... ever, until you are dead! \"This is the perfect action film of all time and still even today over 30 years it is a cult classic. The plot and the script provides excellent dialogues. Why it is brilliant? Imagine someone did something in the future and didn't know about it and becomes a primal target for extermination from a killer cyborg from the future now in the present. That is brilliant and excellent idea and story.Two naked men appear in different locations in los Angeles trough flash blue light and electricity they were both set in time from the year 2029 to the present year 1984. One is a human the other is an indestructible cyborg reprogramed to find and kill Sarah Connor (Linda Hamilton) the woman whose unborn son will become humanity's only hope in the future war against the machines. The other men is a human being a soldier from the future who has to find Sarah Connor and protect her at all cost. That's the basically plot for this film.James Cameron writes and directs this film with his than wife Gale Anne Hurd who also produced this film and they both does that brilliantly. The script with the story provides a perfect action entertainment trough whole film.Brad Fiedel does a wonderful music theme for The Terminator character and action sequences, car chases and does a drama in which Sarah and Kyle have sex together in the motel room. That's how John was later in the sequel born. Great music score for the film. I love the soundtracks from this film: Photoplay and Burnin' in the Third Degree by Tryanglz.Arnold Schwarzenegger was at the top of his career. This movie bring his career at top of the action stars. Arnold is excellent and he performs excellent and acts brilliant as The Terminator. At one time his agent pursued Schwarzenegger to play the action hero, but Schwarzenegger wasn't interested to be an action hero he was interested to be The Terminator and he played brilliantly well and believable enough. Before Sarah Connor was a tough bad-ass gun guerilla squad in the sequels, here she was a scared victim. A beautiful young woman who was a waitress at the diner and was just a human being leaving a teenage normal life in Los Angeles. Linda Hamilton is the only Sarah Connor no else can replace her. She is beautiful and smart and it is my favorite Linda Hamilton movie. She acts very realistic, brilliant and perfectly as the scared victim. Linda Hamilton is the best of the film.Michael Biehn is the only Sgt. Kyle Reese no one else is or can replace him. He is excellent and brilliant I still prefer Corporal Dwayne Hicks but Kyle Reese is my favorite character from Michael Biehn he is a perfect action hero. I love Kyle Reese because he doesn't kill any human being. Lance Henriksen from Aliens and Hard Target is in here and he plays Detective Hal Vukovich and he is very good and realistic as the detective.Paul Winfield is Lieutenant Ed Traxler first he doesn't believe Kyle Reese story but later he witness it him self. I wish there wouldn't be deleted scene in which Kyle and Sarah finds Traxler dying and he gives Kyle a gun. This movie has ton's of action: You see a lot of automatic weapons, shotguns and handguns used in this film and they are used well. You have a car chase between The Terminator and Kyle Reese with Sarah and both men are shooting at each other. Terminator has a stolen Police car and Kyle fires his shotgun and hits twice the Terminator once in the eye. The Terminator than crashes with the car in the wall. In the next scene you see Terminator's eye bloody. You have a great car chase by the end of the film Terminator with truck tries to kill Sarah but Kyle put's a pipe bomb in the truck and you see a huge explosion the truck explodes great special effect. Terminator shoot's with an IMI Uzi in Tech Noir night club. Killing bunch of people in which Kyle stops him with a shotgun. Terminator crash with the car in the police station and kills almost 19 cops.When we see The Terminator been all burned out without flesh with only been endoskeleton covered with steel with his red eyes glowing that is scary when he chases Sarah is scary when I was 6 years old I screamed when I saw that skeleton cyborg attacking Kyle and Sarah. The Terminator is a 1984 American science-fiction action film directed by James Cameron.10/10 Bad-Ass Seal Of Approval The Terminator is a masterpiece a science fiction action horror film, a film I love to death and it is my personal favorite Schwarzenegger film. This is Schwarzenegger's best film with Predator and Terminator 2: Judgment Day I highly recommend those three films."
    },
    {
      "username": "axlrhodes",
      "userUrl": "https://www.imdb.com/user/ur9150302",
      "reviewLink": "https://www.imdb.com/review/rw2376729",
      "warningSpoilers": false,
      "date": "28 January 2011",
      "rate": "10",
      "helpful": "57 out of 65 found this helpful.",
      "title": "The Terminator has heart. Cameron might be well advised,less is more.",
      "content": "Many people look back at the films of James Cameron and suggest that the smaller, the budget, the tighter the limitations, the better the end product. Films like Avatar, Titanic and True Lies had huge budgets and drew in even bigger box office but many still yearn for the Cameron that gave us The Terminator and Aliens which were huge movies but packed a far bigger punch artistically. My feelings all these years on are that Cameron has earned the right to make those huge movies but i have to admit to preferring his earlier body of work. The Terminator is a nightmarish, time travelling science fiction film told at a breakneck pace and delivered with confidence and style. The film has a very gritty, underground look to it and does a great job of telling its story amid the frenetic action. There is also a huge slice of horror and suspense thrown in, an impression that has diminished in the years since it's release due to inferior sequels. Viewed as a standalone piece however, The Terminator is fine piece of work from a director with a very clear vision.Everyone knows that The Terminator is the film that gave us Arnold Schwarzenegger but when i look back at the film, it has heart and its the Michael Biehn character, Kyle Reese, that provides it Artistically speaking,Cameron might be well advised that less is more."
    },
    {
      "username": "Old Joe",
      "userUrl": "https://www.imdb.com/user/ur0849886",
      "reviewLink": "https://www.imdb.com/review/rw0215879",
      "warningSpoilers": false,
      "date": "10 February 2002",
      "rate": "",
      "helpful": "126 out of 153 found this helpful.",
      "title": "Arnie is cool as the bad guy, in this classic 80's action film!",
      "content": "It was funny to read that this film nearly avoided coming to our screens. With many number of studios rejecting the script and story, Terminator was nearly terminated before getting of the ground. However, one company, ORION pictures, the last resort for this movie, loved the premise of a robot running around as a man, trying to kill the mother of the savior of planet earth. Thank goodness they saw that it was a good script, because it become one of the great films of the 1980's.In 2029, giant super computers dominate the planet, hell bent on exterminating the human race! And to destroy man's future by changing the past they send an indestructible cyborg  a terminator  back in time to kill Sarah Connor, the woman who's unborn son will become mankind's only hope. Can Sarah protect herself from this unstoppable menace to save the life of her unborn child? Or will the human race be extinguished by one mean hunk of mutant metal?Well this film is a real blast. The cast is extraordinary. This is probably Arnold Schwarzenegger's most popular role. I cannot see why it isn't. He was great as the Cyborg that was walking around, as a killing machine. His facial expressions are sketched in my memory for life. I love the scene where see a close of his face in the police car, it was brilliant. Schwarzenegger, originally a body builder, he has had a wonderful career in the movie industry. His other great films include Predator, End Of Days, Total Recall, Eraser and was impressive in his role as Mr. Freeze in Batman and Robin. His career was on hold for sometime a while back, due to injury, but he is back and I hope we get to see more of his acting talents.Then you have the others in the cast. The other stand out in this film for me is Linda Hamilton. She was suited perfectly to the role of the feeble Sarah Connor, who is going to be the mother of the child who is going to save the world. Hamilton has had a mixed career, with her filmography including the enjoyable Dante's Peak. The good guy in Terminator was Michael Biehn, who played out the role of Sarah Connor's protector, Reese Kyle. He was very good in his role. His other movies include Aliens, The Rock, Crash and an uncredited role in the great musical, Grease. The director of Terminator, namely James Cameron, did a great job with this film. Considering he thought up the idea from a sick bed, had it rejected that many times, it is a great credit to him. Most directors would have given up on it, but he stuck with it till he got to our screens. Thank goodness he did. The story of the Terminator is an interesting one. It has a very biblical feel to it. One man sent to help save the world, with the initials J.C., fascinated me immensely. Cameron and Co writer Gale Anne Hurd did a fantastic script for this film. There are some unbelievable scenes in this movie. None more so then the vision we see of the metal Cyborg walking from the truck fire. The vision we see from this scene is one of the main reasons why we have the Terminator. James Cameron explained that he wanted a scene in a movie that has a machine walking from a fire in menacing fashion. He got this spot on, if you ask me. Then there are some other great scenes such as the tense stand offs that the evil cyborg has with all the humans he comes into contact with, including the first confrontation with Sarah, in addition to the meeting he has with Reese. I also enjoyed the scene where he goes through the police station. Of course this scene has one of Hollywood's most famous lines in it, that of Arnie's 'I'll be back', a classic. The final confrontation between Sarah and the Cyborg is another tension filled scene of this great movie.So, what more can I say about this movie? It is simply brilliant. I have asked many people their opinion on this film. One such response about it was, that is too 'eightish', and that comment is fair enough. If you have the chance, grab a copy of Terminator on DVD, as it is a great 2 disc set. I must admit the first time I saw it, I did not appreciate Terminator like I do now. Perhaps I found it a tad violent, but that is to be expected of a film that is called Terminator. This movie was a great success and deserved to be with all the great work that was put into it. However more was to come, a film that was to become one of the greatest sequels in movie history. Arnie was to deliver on his promise of 'I'll be back'!Rating: 4.5 stars or 9/10"
    },
    {
      "username": "SmileysWorld",
      "userUrl": "https://www.imdb.com/user/ur1350313",
      "reviewLink": "https://www.imdb.com/review/rw0215887",
      "warningSpoilers": false,
      "date": "26 February 2002",
      "rate": "9",
      "helpful": "101 out of 131 found this helpful.",
      "title": "One of Arnold's best",
      "content": "There are actors,and there are movie stars.Arnold Schwarzenegger is without question a movie star,because every time he is on screen, he is,well,Arnold.There is a different Arnold in this film,and this is what I like about it.He,for once,is playing the villain,and to perfection,I might add.He makes for one of the best screen villains ever in cinema history.It's a pity that his \"good guy\" image won't allow him to play the bad seed more often,but that's Hollywood, I guess.Aside from the thrilling sequel,this is perhaps Arnold's best work."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2877986",
      "warningSpoilers": false,
      "date": "29 September 2013",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Intense powerful iconic",
      "content": "In the future, the world has been taken over by SkyNet, a computer AI that achieves sentient and launches a global nuclear holocaust, in a bid to wipe out humanity. One man John Conner leads the human resistance. They are on the verge of destroying SkyNet when it sends a Terminator (Arnold Schwarzenegger) back in time to the present day to kill John Conner's mother. Connor sends soldier Kyle Reese (Michael Biehn) to save his mother Sarah Connor (Linda Hamilton) from the killer machine.This is director James Cameron's first at bat, and he hits it out of the park. It is near perfection that started a franchise. First the story is perfectly constructed. All those hours of writing and rewriting during his deliveries really helped. Second the choice of Schwarzenegger is inspired. He is the perfect terminator. Third the intensity doesn't relent. It is a sci-fi horror that doesn't let go. It has the production of a much bigger action movie. It is a signpost for a genre, for a cultural touchstone, and for an era. It transcends being simply a movie."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw0216073",
      "warningSpoilers": true,
      "date": "27 July 2003",
      "rate": "9",
      "helpful": "74 out of 98 found this helpful.",
      "title": "One of the most breathtaking modern action science fiction films...",
      "content": "In one of the most intelligent and unhesitating science fiction films of the 1950s, Robert Wise equipped \"The Day the Earth Stood Still\" with technical marvels, chief among them the huge robot Gortthe prototype, Michael Rennie suggests, for a global police force... Similar mechanical giants have been lumbering out of space-ships ever since...In \"Devil Girl from Mars,\" the giant refrigerator robot Chai hunts for virile Scotsmen and find John Laurie, while in 'Target Earth,' the Venusian robots imitate Gort in projecting rays from their heads but take the idea a step further and make the rays lethal... In Stanley Kubrick's 'mythological documentary,' HAL 9000 computer is the most human character in the movie... But in James Cameron's breakthrough feature, there is, indeed, 'a storm coming in.' His 'Terminator' is a systematic metal, 'surrounded by living tissue,' an invulnerable cyborg, part man, part machine, with whom 'it can't be bargained with, it can't be reasoned with.' The film opens with two naked men appearing in two different parts of Los Angeles' darkened streets... One is tall and powerfully built, the other is compact and muscular... Both men seek the same person, a small and delicate blond woman by the name of Sarah Connor...Arnold Schwarzenegger is terrifying as the 'killer cyborg' who 'looks like Death rendered in steel.' He has searched the phone book and brutally shot to death other unfortunate women who bear the same name... He is sent back from the future to present-day (1984) to kill the mother of an unborn enemy... Schwarzenegger moves with inhuman speed bounding like a panther, scanning methodically with dominated blue eyes his surroundings, and in a perfect simulation of voice, he is on the track of his victim... He examines his weapons with precise movements, drives expressionlessly, and kills without pity, or remorse, or fear... It is a role that suits his talent perfectly... Michael Biehn seems scared by traumas of others wars... His face outlines a long burn scar... He tries to stop Schwarzenegger's attempts to be carried out... He is sinister in his long coat... His whole life has been combat... He identifies himself as Reese, a soldier from the future, assigned to protect Sarah at all costs... For him it is an honor, a chance to meet the legend... We feel his pain and anguish when he said: 'That terminator is out there. And it absolutely will not stop, ever, until you are dead!' Linda Hamilton is quiet convincing as the strong innocent prey, targeted for termination, momentarily disoriented, vaguely disturbed... She feels a blind panic boiling up within her, a lightning blot of terror greater than she could ever imagine... She is in a daze, paralyzed, shivering silently, uncontrollably... Her fragile personality disguises a hidden force she did't know she had...Cameron makes a successful move behind the lens in one of the most breathtaking modern action science fiction films..."
    },
    {
      "username": "Movie Nuttball",
      "userUrl": "https://www.imdb.com/user/ur1132073",
      "reviewLink": "https://www.imdb.com/review/rw0216098",
      "warningSpoilers": true,
      "date": "23 November 2003",
      "rate": "10",
      "helpful": "33 out of 42 found this helpful.",
      "title": "The Terminator is one of the greatest films ever!",
      "content": "This is one of the great movies of the 80s in MY collection that I think about all the time.This is the one that started it all! Arnold is excellent in it! Linda Hamilton was great! Michael Biehn was very good as the good guy! Paul Winfield was good! Lance Hendrickson played a different character! In their short roles Bill Paxton and Brian Thompson were cool! Look for Dick Miller! The acting by the cast is very good! The action scenes are very exciting with lots of gun fire and the special effects are awesome! The music is great! Out of the three Terminator films it is hard to decide which is the best but this one is damn good! In fact its one of the best movies ever! I strongly recommend anyone who loves Arnold and the other cast members I mentioned and especially if you love action, sci-fi, or even horror movies to not rent but buy this classic! I recommend The Terminator!Movie Nuttball's NOTES:There is one scene that I really like in the Terminator! It is when Sarah Connor is at the dance club. What I love about it is the song and the excellent slow motion camera. Its when Sarah drops something, she goes to pick it up and while she is bending over The Terminator comes walking through the dance floor! Its a classic moment!Bill Paxton has been a part of three huge franchises! Being The Terminator as The Punk Leader, Aliens as Pvt. W. Hudson, and Predator 2 as Jerry Lambert! Lance Hendrickson has had a similar way of being in epics like Paxton being in The Terminator as Detective Vukovich, in Aliens as Bishop, Alien 3 as Bishop II, and as Charles Weyland in the upcoming 2004 movie Alien vs. Predator! Hendrickson, believe it or not was the original choice to play The Terminator! It is so amazing about this!By Paxton and Hendrickson being in these films and that Alien Vs. Predator is finally going to invade the theaters in 2004 could it be that this has happened for a reason? The reason possibly being this: In the great Dark Horse comic books there are many editions of Alien Vs. Predator and a edition of Alien vs. Predator vs. The Terminator! What I am saying is could this mean that Alien vs. Predator vs. The Terminator will be made into a huge motion picture or a Alien vs. The Terminator or even a Predator vs. The Terminator movie in the future? Its just a thought but what if? I am sure some writers and/or directors have talked about these subjects! I am also sure big fans of these films and of The Terminator would love to watch these icons battle it out!"
    },
    {
      "username": "gigan-92",
      "userUrl": "https://www.imdb.com/user/ur20916867",
      "reviewLink": "https://www.imdb.com/review/rw2363639",
      "warningSpoilers": true,
      "date": "3 January 2011",
      "rate": "10",
      "helpful": "20 out of 23 found this helpful.",
      "title": "Bold, Gritty, and Realistic",
      "content": "The 1984 classic, an astounding production. One of Cameron's early works, and yet one of his best. The ultimate thing that puts this film on a whole another level above so many other flops is the awesome blend of realism and atmosphere. When I first saw it as a kid, it just felt so real to me. And now, ten years later,t that feeling hasn't left me. Using his camera in a way only he can do, Cameron instills a sense of dread in every scene, something good old Arnold did quite well.Michael Biehn and Linda Hamilton also did extraordinarily so, just putting the right amount of emotional touches to their performances. Its an involving film throughout that never fails to hit hard, even in light of some terrible and CGI loaded sequels. And who could forget the score, which only added to the already excellent tension. My favorite scene? No doubt, in a disturbing way, the scene where the T-101 is repairing itself, and the lighting is just so perfect gives off a feeling of absolute fear. Or perhaps the scene in the club where Reese first engages the Terminator, either way ingenious and unforgettable moments in film history.A classic in every way."
    },
    {
      "username": "FrankBooth_DeLarge",
      "userUrl": "https://www.imdb.com/user/ur4111911",
      "reviewLink": "https://www.imdb.com/review/rw1009854",
      "warningSpoilers": false,
      "date": "30 January 2005",
      "rate": "10",
      "helpful": "122 out of 152 found this helpful.",
      "title": "An excellent film, highly original",
      "content": "Terminator is an extremely low budget movie. In fact, just about everything used in it didn't cost much at all, but it is a very effective movie. Back in the '70's and 80's, movies could be very low budget, but still be great(think of John Carpenter's Halloween).The Terminator is a story about how nuclear war causes the end to mankind and the end result could be the start of an even greater tragedy than the war its self. The entire message of The Terminator is an anti nuclear war message.Many people think that a few parts in the beginning of the movie are just some random things thrown in. I can understand why, but these seemingly random scenes actually do have a lot to do with the story.Arnold does a great job as the cyborg who is programmed to kill without mercy or remorse. For those who don't know, this is the movie where the line \"I'll be back\" was spoken. The other actors do a good job in this. Linda Hamilton made a great choice doing this movie and she really improved her career through it(the movie she made before this was the horrible Children Of The Corn).This is better than Terminator 2(which is still great by the way), because this movie has more of a story and is more involved. I would recommend watching this movie at any time, it is very well paced and never gets boring, and if you have the time, watch T2 right after this."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3578425",
      "warningSpoilers": true,
      "date": "11 November 2016",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "A beloved favourite of mine",
      "content": "Widely regarded as something of a classic in the realms of science fiction and action films, I think that this film is an underrated horror film and may be in fact one of the most frightening films I have ever seen, due to the fact that I had a fascination for it as a child. Director James Cameron, better known to modern audiences for his bloated epic TITANIC, truly succeeded in creating a classic film, one which I would watch many times over his later, waterlogged dreck. THE TERMINATOR was a hugely popular hit and created a new movie monster, the big, silent, hulking figure of Arnold Schwarzenegger in what I believe to be his best role as an unstoppable killer. The fact that the monster is human - and thus able to hide amid fellow humans - is relatively original (depends on who you speak to, but acknowledgement definitely goes to Harlan Ellison) and his sheer indestructibility is really awe-inspiring.All of the different factors work in this film. The score is unforgettable, a thumping, deadly beat which turns up whenever the Terminator is on screen, and it sends chills down your spine (much like the music for THE OMEN). The film portrays Los Angeles as a dark, dirty, bleak city to live in and the film reflects this. It has a gritty feeling much like the earlier classic The Texas Chain Saw Massacre and the little touches, such as the Terminator's infra red vision, are chilling.The actors in this film all give brilliant portrayals and are totally realistic, many of them have since gone on to greater things. Schwarzenegger emerged as an action movie star after this film put him on the map and has since become phenomenally successful, with a string of hits in his belt. Biehn has also kept in the movie business but hasn't found many hits like this one, apart from Cameron's 1986 smash, ALIENS. Hamilton has also gone on to bigger-budgeted things like DANTE'S PEAK and her portrayal of Connor as an unsuspecting woman caught up in the violence is a performance which brings real depth to the character. She turned this around in the sequel where Connor became a lean, lithe killer out for survival. Paul Winfield is great as the hard but kind cop, and Lance Henricksen, who was originally considered for the role of the Terminator, makes the best of his small role. Earl Boen is also memorable as the laconic psychiatrist. Roger Corman regular Dick Miller puts in a welcome cameo appearance as the ill-fated gun store owner, while Bill Paxton and Brian Thompson appear in early roles in their careers.This film is also surprisingly gory for a mainstream movie. One scene, in which the Terminator rips out his own eye, parallels the ultra-violence popular in Fulci movies. People are repeatedly and violently shot and mutilated. To keep things moving along there is a ton of action in the film, with hundreds of bullets flying everywhere and numerous car chases. The only spot where things let up is near the end where Reese and Sarah hide out in first a tunnel and then a motel. This section of the film tends to veer into mild tedium and is the only part where Cameron could have done better.The film has many classic, totally brilliant moments. One of these is the Tech Noir scene, which builds up suspense carefully before exploding into violent carnage. It's a nightmarish and completely effective moment, with the music slowing down, people dancing in slow motion. Another scene is the one where the police station is single-handedly destroyed by the Terminator, this shows how unstoppable he is and is again very violent and effective. The final future 'dream' sequence in which the dying, diseased survivors are killed by another machine is also brutally effective and very moving. Other memorable moments are the scene where the metal Terminator rises from the flames, which is almost Biblical, and the entire fight in the factory, which is basic human vs. machine action, where the Terminator keeps coming back time after time before being finally crushed to death.Cameron returned with a successful sequel in 1991, TERMINATOR 2: JUDGMENT DAY. The film contained then state of the art CGI effects in the \"morphing\" T-100 terminator, and signalled the return of Schwarzenegger and Hamilton (and also Reese in the Director's Cut). Although the film contained a lot of action and violence, it was not as effective and horrifying as it was basically a string of action scenes one after the other, and more designed to show off special effects work instead of telling a story. However the sequel is still hugely enjoyable and well worth seeing if you liked this one.Overall, THE TERMINATOR is a true classic in the realms of killer robot movies, the best one ever made in my opinion. It also clearly shows how science fiction and horror can be mingled together to form a pleasing whole. An excellent film for those of us who like action as well as horror, it's got everything you could ever want: time travel, gun battles, car chases, fights, gore, explosions, fire, melodrama, romance, an excellent score, and true gut wrenching horror. Excellently fantastic!"
    },
    {
      "username": "Aidan McGuinness",
      "userUrl": "https://www.imdb.com/user/ur0839067",
      "reviewLink": "https://www.imdb.com/review/rw0216000",
      "warningSpoilers": false,
      "date": "24 June 2002",
      "rate": "",
      "helpful": "149 out of 192 found this helpful.",
      "title": "Compelling science fiction",
      "content": "For the gift of `Aliens' and `The Terminator' I am willing to forgive Cameron's `Titanic'. The key plot concept is beautifully simple - machines take over the earth in the future. Machines are eventually over thrown by one man. Machines travel back in time to kill man's mother, thus preventing him being born and stopping their own defeat. One human also travels back to stop the machines from killing his leader's mother.`The Terminator' is a classic good versus evil struggle, with little in the way of greys clouding the issue. The terminator is an unstoppable brutal remorseless killer, and it perfectly suits Arnold Schwarzenegger's limited acting abilities. His few lines, including the infamous `I'll be back' are all well judged and timed, and give a great feeling of precision and inhumanity to his character. Coupled with his chiselled features, he's the best choice for the role. Michael Biehn is playing a character type that he'd reprise two years later in Cameron's `Aliens' - the human tough guy: he's got the fight, but still the ability to love and care for people. His features are well chosen for this and although his delivery of lines is hardly exceptional - they tend to come out in the same tone of voice - he's able to carry his part. Linda Hamilton is the woman-thrown-into-chaos, somewhat reminiscent of Sigourney Weaver's Ripley character in `Alien', although Hamilton doesn't have Weaver's strength of presence. All the actors are, for an action science fiction, above average and so never distract.It's the script, with Cameron's force behind it that lifts the movie from mediocrity. Yes, there's a certain amount of corniness - the `we loved a life time' element for example - but the movie has a real sense of conviction present. The movie believes in itself and, through its passion, will make you believe too. There's a general sense of darkness in the movie - rarely do we see daylight, and, when we do, it's often the soft light of dawn. There's a nice sense of tension in the action scenes, helped not only by Cameron's camera work but also by an excellent electronic score (including a fantastic brooding credit sequence). Sure some of the SFX look clunky in these days of `Attack of the Clones' and `The Fellowship of the Ring', but they still work. There's a certain sense of inevitability, intertwined with hope, permeating the picture that creates a mood I particularly enjoyed and that's harder to find in the current crop of science fiction movies.`The Terminator' is not a perfect picture. The movie lags in some parts, and the romance element is fairly contrived. Despite all that the movie brims with energy and promise, a script that mostly delivers, characters you can enjoy, and the ultimate Arnie role. Well worth catching. 8/10."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw8404307",
      "warningSpoilers": false,
      "date": "5 August 2022",
      "rate": "8",
      "helpful": "13 out of 15 found this helpful.",
      "title": "Persistence Personified 1...",
      "content": "You can run, but you can't hide, your existence amplified, where you go, it will go too, sensors focused just on you, nothing can get in its way, you can shoot, or burn, or pray, as sure as day will follow night, the binaries, will take a bite.An ontological, paradoxical and dystopian forecast of a future world that probably won't have time travel, but may well see machines used to ill affect - we are, after all, our own worst enemies.An outstanding piece of film making that perpetually stands the test of time."
    },
    {
      "username": "PeachHamBeach",
      "userUrl": "https://www.imdb.com/user/ur0417992",
      "reviewLink": "https://www.imdb.com/review/rw0216044",
      "warningSpoilers": false,
      "date": "19 April 2003",
      "rate": "10",
      "helpful": "65 out of 84 found this helpful.",
      "title": "Review of the Special Edition DVD",
      "content": "I've reviewed this classic movie before, but now I'm gonna review the DVD. To start, I must say that although they had their rationale for deleting the \"terminated\" scenes, as they were called, I think they definitely should have left that one scene in where Sarah Connor calls her mom and tells her to hide in the cabin, and where she finds the listing of Cyberdyne Corp. in the phone book. This scene established Sarah as one who is willing to try to take matters into her hands to stop a nuclear war and a horrible future. She talks to Reese about getting rid of Cyberdyne and they get into an arguement about whether or not that is a mission objective and Reese ends up chasing Sarah into a wooded area. I think the beauty of the woods, flowers and waterfalls was important too, because Reese starts crying and saying how all of this is destroyed, and the future is nothing but blackened, charred ruins littered with the skulls of attempted human genocide. What a terrific, powerful scene. I adore Michael Biehn, and I didn't realize what a great actor (and crier) he is!!! Maybe the other \"terminated\" scenes were okay to delete, although they were all delightful. The one where Sarah practices her \"wholesome waitress\" routine was cute. The one where she talks about Disneyland and hot dogs might have seemed silly, but it really brought home how foreign our world is to Reese, as did the crying scene. The tickling scene might have seemed silly to the editor, but I thought it really made a point: after all the violence and bleakness Reese lived through, to be with the woman he's always loved and idolized, to lay in a cozy warm bed with her experiencing the simple joys of life for the first time (I still wonder if Sarah devirginized him, since he said he'd \"never\" had any special someone in his life) seemed to bring everything into perspective. The scene where you discover that the factory was Cyberdyne Systems was important too, but I'll let these scenes slide. I really think they should consider releasing a TERMINATOR with the scene in the wooded area included. Nevertheless, I still consider this film as one of my favorite sci-fi films, and my favorite James Cameron film. I still admire who he infuses humanity with action and adrenaline, and the missing scenes were wonderful."
    },
    {
      "username": "DaRick89",
      "userUrl": "https://www.imdb.com/user/ur8819596",
      "reviewLink": "https://www.imdb.com/review/rw1272538",
      "warningSpoilers": false,
      "date": "22 January 2006",
      "rate": "10",
      "helpful": "121 out of 147 found this helpful.",
      "title": "The wonderful action movie which started a wonderful action saga",
      "content": "The Terminator is one of the best action movies of all time in my opinion. It doesn't set a single foot wrong and it also kicked off a wonderful saga. Without this, there would be no Terminator 2. Think about that. As such, this movie is fondly remembered by many people and it has been the subject of many quotes and spoofs over the years. Why doesn't it set a foot wrong? It is thrilling, almost always entertaining and filled with insane explosions, which more or less makes a good action movie. But 'The Terminator' stands head and shoulders above the rest of it's genre, because of it's well thought-out plot, splendid acting and an eerily memorable music score which gives you a reason to watch the credits at the end.Now to analysing why the plot is so well-thought out. Well, for one thing, the concept of preventing or setting in stone the future by going back in time was one which wasn't really explored in those days. By exploring it, the Terminator was offering something different, something which has inspired films such as Back to the Future (read the plot synopsis for that film, there are a few similarities). The notion of the final battle of a future war being fought in 'our present', not in the future, between one member of opposing sides, in this case a man and a machine, is also an intriguing one and sets the stage for an exciting battle royale.I'll run down the plot while I'm here. Sarah Connor, a young woman in her 20's, is the protagonist of the film and our two from the future, Kyle Reese and the Terminator, revolve around her. Reese, who is a battle-hardened soldier who has led a hard life in the wasteland which is the future, must protect Sarah, while the Terminator, an unstoppable cyborg, must kill her, in order to kill her unborn son, the leader of the future resistance.All of this leads to some thrilling action scenes and insane explosions, topped off by music scores which add to the tension and excitement. The movie purrs into action quickly, but really kicks off at a disco, where Reese and the Terminator have a shootout, resulting in a city-wide drive-by chase involving the police which doesn't really let up until Reese and Sarah are arrested. During the lull in the chase scene, Reese tells Sarah about himself, the Terminator and their general predicament, which is fairly realistic. The next action scene is the infamous police station massacre which everyone seems to talk about whenever they discuss this movie. I can understand why, too. The Terminator pretty much kills every cop in his path with the greatest of ease, either with the AK-47, his shotgun, or both. He also ends up cutting the power and setting the station on fire, again adding to the tension and excitement. The last action scene which, like the one in T2, is a chase which leads to a final showdown in a building. It is a slight letdown, but it is still an intense scene. I will refrain from spoiling the ending, as this is too good a movie to be spoiled.All of the acting fits the bill perfectly. As in T2, there is not a single bad performance to be found. Michael Biehn delivers a remarkably intense performance as Kyle Reese, acting like a typical human would in his situation. He displays his range of emotions at the right times, from passionate to worried to unyielding. It is a wonder that his only other major movie is 'Aliens' and that he is starring in stuff like 'Clockstoppers' these days. Linda Hamilton again does well as Sarah Connor, displaying an innocent woman who shows over the course of the film why she is John Connor's mother, displaying previously unheralded steel at the crunch. The support cast isn't too bad either (Dr. Silberman makes his first appearance). But again, the best performance in the film belongs to the bad guy, in this case, Arnold Schwarzenegger. He acts like a killing machine should; incredibly cold, sterile, soulless and unyielding. His facial expression never changes throughout the film and his physical appearance makes him slightly more imposing and intimidating than the Liquid Terminator. He also commences his famous one-liners which have been the subject of many a spoof, including (no, especially) \"I'll be back.\" This is undoubtedly his best performance, even though it is not his only good one.I will compliment all involved on making a movie which still manages to look good despite having a low budget. I've seen pretty bad-looking movies with fairly high budgets (read: Scooby-Doo), but never good-looking movies with low budgets.In the end, The Terminator is a masterful action movie which laid the groundwork for the equally brilliant Terminator 2. If you asked me whether I preferred The Terminator or T2, I would say T2 because I am more familiar with it, otherwise, these two would be on a level footing. If you haven't seen this movie and are an action movie fan, then see it immediately. You won't be disappointed. Trust me.5/5 stars"
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6419213",
      "warningSpoilers": false,
      "date": "29 December 2020",
      "rate": "9",
      "helpful": "18 out of 21 found this helpful.",
      "title": "The terminator",
      "content": "A very great action movie, despite the presence of some shots of boredom in the film, but it did not significantly affect my experience with the film, the Terminator was terrifying in the film, his role was played with all the ingenuity of the actor Arnold Schwarzenegger I cannot imagine another actor representing the character, Sarah and Kyle's relationship was not very interesting The soundtrack in the movie was great, especially the one with, the Terminator, the storyline of the action movie was very good, the film really enthused me for the other parts."
    },
    {
      "username": "invisibleunicornninja",
      "userUrl": "https://www.imdb.com/user/ur85371862",
      "reviewLink": "https://www.imdb.com/review/rw4093933",
      "warningSpoilers": false,
      "date": "16 March 2018",
      "rate": "8",
      "helpful": "28 out of 36 found this helpful.",
      "title": "Old, but still good.",
      "content": "This movie is a solid action movie. Not all of the dialogue is great and some of the effects are a bit dated - but this movie is still effective. The acting is great. The plot is great. This movie is well-shot and worth watching. I can't really come up with many things that are bad about it that don't have to do with it being old. This is just a fun movie with good action, time travel, and robots. I'd definitely recommend this movie. Its worth watching if you're looking for a good time."
    },
    {
      "username": "springsunnywinter",
      "userUrl": "https://www.imdb.com/user/ur10583368",
      "reviewLink": "https://www.imdb.com/review/rw1716332",
      "warningSpoilers": true,
      "date": "21 August 2007",
      "rate": "10",
      "helpful": "30 out of 37 found this helpful.",
      "title": "The best of the best movies ever on the planet, galaxy & the entire universe",
      "content": "The Terminator simply has to be my number 1 favourite movie of all time. When the first time I saw the film I fell in love with it about 15 years ago. The truly original idea of the story-line is amazing about a cyborg is sent from the future on a deadly mission. He has to kill Sarah Connor, a young woman whose life will have a great significance in years to come. Sarah has only one protector - Kyle Reese - also sent from the future. The Terminator uses his exceptional intelligence and strength to find Sarah. The movie was emotionally & psychologically thrilling and made so dark & sinister that give the tensive mood for the film. A well made for 80's film and I was surprised when I heard that it made with a budget of $6.4 million because it looks more expensive e.g. the nuclear war in Los Angeles 2029. I loved every second of it and the best scenes are:1. When the terminator killed Ginger & her boyfriend.2. Shootout at the nightclub (A classic scene in film history).3. Self surgery on his wrist & eye.4. Shootout at the police station.5. When the terminator was driving the lorry.6. When he unexpectedly rose from the fire as an endoskeleton after that it was a nail biting experience to the end.The line \"I'll be back\" is simply the best quote for any film because the audience never expected his position of coming back. Although it is on the IMDb top 250 but it should have been No 1 top place because I have never seen a better movie than this. I've seen it about 100 times and I'm still not fed up. The Terminator gave me the passion about films and my verdict is 1000, 000/10. It's nearly about 25 years old and people still watch it. The 80's was the best decade for movies e.g. An American Werewolf in London, Gremlins, A Nightmare in Elm Street & Predator, the list is endless. Anyway no matter whatever happens there will never be a better film than The Terminator."
    },
    {
      "username": "slokes",
      "userUrl": "https://www.imdb.com/user/ur2375356",
      "reviewLink": "https://www.imdb.com/review/rw3282615",
      "warningSpoilers": false,
      "date": "22 July 2015",
      "rate": "9",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Lethally Efficient Entertainment Machine",
      "content": "The police psychologist interviewing Kyle Reese says it just right at one point: \"I could make a career out of this guy!\" Make that two careers, that of action hero Arnold Schwarzenegger and blockbuster filmmaker James Cameron.Sarah Connor (Linda Hamilton) is a struggling waitress who has just been stood up for a date. Another date is en route; unfortunately for her it's the proverbial date from hell. He may look like a studly Austrian-American bodybuilder, but he's really a hyperalloy metal chassis wrapped in human tissue sent from the future to kill her before she can give birth to the hope of mankind's survival. Can Kyle (Michael Biehn) save her before Arnold does his job?The title character is really a thing of beauty. As Kyle explains: \"It can't be bargained with. It can't be reasoned with. It doesn't feel pity or remorse or fear. And it absolutely will not stop. Ever! Until you are dead.\"So what you have is \"Jaws\" for a new decade. And there can be no doubt what that decade is. From the Walkman worn by Sarah's roommate to the trendy neon sportswear on display at the \"Technoir\" nightclub, this is a 1980s movie through and through. And other than some clunky miniatures work set in the world Kyle came from, there's nothing wrong with that.The film has a lot more going for it. From start to stop this is, like \"Jaws,\" a pop-action spectacular that never stops. Even the lengthy time-travel exposition scenes are suspenseful, because you are always alert for what might come through the door in the next second. Schwarzenegger makes his most lasting impression in an atypical bad- guy role, while Hamilton convinces with her ruffled beauty and sudden bursts of heroism. Biehn may do the best job, his face suggesting the anguish of his character's plight as well as his somewhat crazy hope for the future personified in Sarah.Cameron and producer Gale Anne Hurd fashioned a clever script with many brilliant touches that reward re-viewings. There's a scene between Kyle and Sarah that brings \"Terminator's\" greatness into focus for me. He's telling her of this photograph he has been holding of her, and spent many terrible nights staring at, wondering what she was thinking. Later, Cameron has a scene where we get to see what Sarah was thinking, and it's a doozy!Then there's the police vehicle the Terminator rides around in trying to get his mark. The slogan on the side of the car reads: \"Dedicated To Serve.\" Perfect!Is the Terminator supposed to be from THE future, or just \"one possible future\"? Like Sarah says, a guy could go crazy thinking about this. Or at least have to wait until the next sequel. Hollywood can beat good ideas to death, but this film proves it will take a lot indeed to kill the Terminator."
    },
    {
      "username": "behamut",
      "userUrl": "https://www.imdb.com/user/ur0115655",
      "reviewLink": "https://www.imdb.com/review/rw0215812",
      "warningSpoilers": false,
      "date": "22 September 1998",
      "rate": "10",
      "helpful": "20 out of 22 found this helpful.",
      "title": "Awesome",
      "content": "The Terminator, created after another one of James Cameron's reaccuring dreams (Abyss was another one.) A true beginning in sci-fi movies. As Schwarzenegger said to his friend when he was picked to play the part as the Terminator, \"they want me to play as some robot from the future in this weird sci-fi movie.\" His friend said, \"take it.\" Schwarzenegger is perfect as the Terminator, merciless, no fear, no love, no pity, no remorse, no emotions. None could have pulled it off as well as he did. Even his eyes showed no emotion with still showing true evil. Michael Beign is just the opposite. A man sent from the future to stop this machine. He plays his part as perfect as Schwarzenegger plays his. A perfect cast of characters for an all star movie! Plenty of action, story line, plot, character interaction, love story, and romance. Everything is tied into this movie that possibly could be, making it a 3 star movie. Only drawback is it's a little dragged out at parts and gets slightly boring from time to time but it's so minor that one would have to think about it to care. A truly awesome movie."
    },
    {
      "username": "PhilipJames1980",
      "userUrl": "https://www.imdb.com/user/ur1413169",
      "reviewLink": "https://www.imdb.com/review/rw1028511",
      "warningSpoilers": true,
      "date": "25 February 2005",
      "rate": "9",
      "helpful": "37 out of 43 found this helpful.",
      "title": "The ultimate blend of Orwell and action",
      "content": "Even in this post-Matrix era, this movie is still the ultimate blend of Orwell and action. If the definition of a classic is a movie that's often imitated but never equaled, then The Terminator is definitely a classic, because the increasing redundancy of its sequels and imitations merely demonstrates how good the original is.I wasn't fortunate enough to see this movie in the year of its release, the year predicted by Orwell's classic novel as a time when technology would be used to enslave people, but I did see it in about 1992, when the blockbuster success of the first sequel made me curious to watch the first film. At that time I preferred the second Terminator movie for being technically superior, but after all these years I now prefer the first film's raw intensity and kinetic energy.The Terminator was of course the breakthrough movie for James Cameron, and even after Aliens and Titanic it's still arguably his best-directed film. I challenge anybody to watch this movie and point out one single shot that needs improvement, because the direction of this movie is so fluid and precise that I can't think of one moment in the whole 100-minute running time that I would want to change.Cameron was and of course still is a notorious perfectionist who's very difficult to work with, but his perfectionism really paid off with this movie because it can be watched again and again without losing its entertainment value. He's a master of the small touch, as when the cop at the desk is filling out his paperwork with a small pencil and pauses in mid-sentence to look up and see the headlights coming towards him through the doors.Cameron also co-wrote the story, so this movie meant even more to him personally than merely a directing triumph. Supposedly he drew his inspiration from a nightmare in which he was being chased by a humanoid with one glowing red eye, and indeed the whole film has the urgent, oppressive atmosphere and calm logic characteristic of a nightmare. But of course he was probably also remembering subconsciously a couple episodes of The Outer Limits that he saw as a kid, which explains why he had to acknowledge the writer Ellison in the credits.Besides Cameron, this movie really belongs to the three lead actors. Arnold of course gives the performance of his career in this movie, but then so do Linda and Michael. Arnold's physical presence and harsh accent have never been put to better use in a movie, while Linda never had another role that required her to run through such a full range of emotions--sweetness and vulnerability, toughness and despair, etc.Michael has always been a B actor, but since The Terminator is essentially a B movie he fits in perfectly. His performance proves that an action hero is much more compelling when he's vulnerable not only to physical pain but emotional difficulties, to which his big, haunted eyes are put to good use. Watch him in this movie, as a man thrown out of his time but with a mission, and you'll see a perfect match of actor and character.In a typical action film, the amount of violence and bloodshed in The Terminator would be excessive, but in a movie about an unstoppable killing machine the envelope can be pushed. In one of the more memorable set-pieces, the Terminator takes on an entire police station full of thirty cops, and although I didn't exactly count them the viewer gets the sense of watching every single cop being gunned down.Ordinarily I wouldn't describe such a scene of slaughter as \"cool,\" and yet there is some-thing undeniably cool about Arnold, with his sunglasses and leather jacket, going through the station with a shotgun and assault rifle and taking on everybody. Arnold's charisma helps the audience stomach the cold-blooded determination of the Terminator, but also the character's single-mindedness invites admiration: even as we're appalled by all the killing, we have to admit he does it rather well.This movie has more than enough gunfire, explosions and stunt-work (including some especially good stunt driving) to work purely as an action picture, but it's the film's anti-technology paranoia that makes it more than just an exciting ride. Notice, for example, the subtle role that Sarah's answering machine plays in the story: the cops can't get into touch with her because of it, while the message she leaves on it brings the Terminator right to her.In one memorable shot, the tracks of a construction crane become those of a killing machine in the future, crushing an endless row of skulls, which you can interpret any number of ways (is it a crack against urban renewal?). Also note that the criminal psychologist is enslaved by his beeper, and that even in the post-apocalyptic future in which machines have destroyed the world children still huddle around a television set in a desperate effort to be entertained.Some viewers may be turned off by this movie's preaching, but one quality that distinguishes The Terminator from its countless imitations is the strength of its convictions. Too many science-fiction/action movies fail under the weight of their own camp, but The Terminator is an exception because it actually has the nerve to take itself seriously. The bickering between seasoned cops Paul and Lance provides some levity, but at no point does the film make fun of itself.The only reason I'm not giving this movie a perfect 10 is because it is, after all, The Terminator, and not Casablanca. If people still remember it in forty years, then I'll give it a 10."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3307067",
      "warningSpoilers": false,
      "date": "29 August 2015",
      "rate": "10",
      "helpful": "17 out of 24 found this helpful.",
      "title": "One of the greats of the action genre, and just a great film overall",
      "content": "Have not always been a big fan of action films, after seeing my fair share poorly made, dull and predictable, sloppily written and badly acted ones that delivers just as little on the action (the worst of Steven Seagal being prime examples. The Terminator however is like Die Hard, a thrilling well-made film that succeeds as an action film and a film in general, and treats its audience and genre with respect. It is also one of director James Cameron's best films along with Terminator 2 and Aliens.The Terminator looks great still, sure the special effects have not held up as well as the rest of the film but they are not that bad. The film is beautifully and slickly photographed and the sets and lighting are so imaginative and wonderfully nightmarish that one really does get sucked and immersed into its world., and filled with sharp details. Cameron's direction is superb, some of the best of his whole career. The music score is hauntingly eerie and its synthesised sound doesn't date the film at all, instead adding hugely to the atmosphere. The script (including the famous 'I'll be back') is snappy and smart with plenty of wittily written lines, the story is incredibly engrossing and exciting to the maximum with plenty of suspense and fun.Action fans are guaranteed too to be thrilled by the action here, being both dynamic and thrilling, the climax really does jangle the nerves. Michael Biehn and especially Linda Hamilton shine in their roles, and Arnold Schwarzenegger has never been more perfectly cast as his most iconic character to date. All in all, a brilliant film and one of the greats of the action genre. 10/10 Bethany Cox"
    },
    {
      "username": "Cinemaniac1984",
      "userUrl": "https://www.imdb.com/user/ur1444027",
      "reviewLink": "https://www.imdb.com/review/rw3154530",
      "warningSpoilers": false,
      "date": "3 January 2015",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Where the legend began...",
      "content": "Who would have thought a low budget science fiction movie aptly named The Terminator would become a successful movie as well as start the meteoric rise of Arnold Schwarzenegger as a legend in cinema, introduce director James Cameron to Hollywood as a force to be reckoned with, give a new meaning to audiences with the immortal line \"I'll be back\", spawn a large fan base, and then witness the birth of a big-budget saga with an even bigger sequel in 1991 that outdoes the first movie with Terminator 2: Judgement Day and then continue on with Terminator 3: Rise of the Machines in 2003, Terminator Salvation in 2009, and Terminator Genisys in 2015 as well as a short lived TV series Terminator: The Sarah Connor Chronicles.Arnold Schwarzenegger introduces us to his now iconic role as The Terminator, a cyborg disguised as a human being. The Terminator has been sent back in time from 2029 to Los Angeles in 1984 to terminate Sarah Connor in order to prevent the birth of her unborn child, John Connor, who would go on to lead the human resistance to victory against Skynet and the machines in the future following a nuclear war which almost wiped out most of the human race. Arnold Schwarzenegger, in a rare role as a villain, is perfect as the Terminator, a killing machine who is programmed to kill without any pity, remorse or fear in his single minded quest to terminate Sarah Connor.Linda Hamilton in an early role introduces us to Sarah Connor, a timid and mousy waitress who's life will be changed forever upon the discovery her unborn son, John Connor, will become the future leader of the human resistance. She still does not believe that such an event will happen with the nuclear war and the rise of the machines, until her encounter with the Terminator and thus begins her quest to stay alive for the sake of her unborn son and to survive this real life nightmare.Michael Biehn in one of his early roles plays Kyle Reese, a young, battle-hardened, and world-weary soldier who volunteered to be sent back in time from 2029 to 1984 by John Connor to protect his mother at all costs from the Terminator. Once Reese rescues Sarah, he warns her about the impending doom of the human race from the nuclear war and her future significance carried by her and her unborn son.Keep an eye out for Bill Paxton in an early role as a street punk.Though The Terminator is now 30 years old, it still stands the test of time as a positive influence on all science fiction and action movies since. Exciting, high energy action sequences which turns downtown Los Angeles into an urban battleground and leads to an even bigger chase to a climatic showdown keeps the dynamic tension in The Terminator very tight and does not let the audience go for one moment.Taut and kinetic direction with a sharp eye for attention to detail from James Cameron keeps The Terminator as a gritty, clever, breathtaking, exciting and thrilling movie from beginning to end.Definitely one of the greatest science fiction movies of all time.10/10."
    }
  ],
  "errorMessage": ""
}