{
  "imDbId": "tt0097576",
  "title": "Indiana Jones and the Last Crusade",
  "fullTitle": "Indiana Jones and the Last Crusade (1989)",
  "type": "Movie",
  "year": "1989",
  "items": [
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw8212285",
      "warningSpoilers": false,
      "date": "6 June 2022",
      "rate": "9",
      "helpful": "26 out of 27 found this helpful.",
      "title": "Perpetually Entertaining...",
      "content": "An army of fascists seek to plunder, an artefact so precious it's a wonder, an archaeologist will resist, using whips and guns and fist, in a treasure of a film, packed with adventure.There are puzzles to be solved and riddles broken, the dialogue's a joy, beautifully spoken, action packed from start to end, returns a massive dividend, engaging all the way, and thought provoking."
    },
    {
      "username": "ivo-cobra8",
      "userUrl": "https://www.imdb.com/user/ur15140057",
      "reviewLink": "https://www.imdb.com/review/rw3336467",
      "warningSpoilers": false,
      "date": "16 October 2015",
      "rate": "10",
      "helpful": "145 out of 166 found this helpful.",
      "title": "The third entry in the installment is one of the best Indiana Jones series.",
      "content": "Indiana Jones and the Last Crusade (1989) is an Action Classic adventure better film than Temple of Doom , is still the best follow up in the trilogy and clever. It is also the greatest sequel of all time. It is one of my personal favorite adventure movies of all time. I love this movie to death. I loved it as a child and I still love it. After the dark middle chapter it was time for Indy to return to form and more lighthearted fair. Indiana Jones and the Last Crusade was the answer. Not to mention that bringing in Bond aka Sean Connery as Indy's dad was perfect casting. Connery adds his own whit & charm along with Indy's usual counterparts who where missed in The Temple of Doom. Last Crusade also bookends the trilogy well since the artifact he is after is related to God. While \"Indiana Jones and the Last Crusade\" isn't by any means what I would consider a stellar film, it was still an enjoyable and memorable theatrical experience, and in my opinion, easily ranks as the best sequel in the series. For all its faults and shortcomings (perhaps most of all, River Phoenix' laughably terrible haircut as the young Indy), the film succeeds in hitting the key notes at the proper moments, thus drumming up enough of the right combination of story and thematic elements, action and humor to make it worthwhile. Nevertheless, the bottom line is that it still pales in comparison to the level of across-the-board excellence that was achieved in the original 1981 movie. Still though, fans of this one will definitely want to pick up this excellent release, of which, throughout the entire presentation, I only came across a handful of things I thought could possibly be improved upon technically.This is probably the best installment of the Indiana Jones series. Raiders is a spectacular introduction to Dr. Jones and his style, Temple of Doom is an awesome Action, Adventure flick! Last Crusade rights the ship again with a go-for-broke production. Everything about it is huge- Jones is saving the planet from the Nazis for the second time. The budget was in place and off went Spielberg to make an epic, successfully. The film is bookended by two of the best things to appear in any of Spielberg's output: A young Indiana \"beginning\" his archaeological career, losing his treasure- just like the opening of Raiders- and being told by the man in his trademark hat \"You lost today kid, but that doesn't mean you have to like it.\" and at the end, riding off into the sunset, literally. Such a conclusion could be seen as contrived but it works so well here. Indiana Jones and the Last Crusade has lots of hand-to-hand combat, action-filled chases, and gun fights. Main characters are in near-constant peril, and one is shot point blank and almost bleeds to death. Minor characters are killed in somewhat gruesome ways, including beheading; a bad guy meets his end in a fairly disturbing scene. There's a bit of kissing/banter, and it's implied that two men have slept with the same woman. Language is mild, and there's ultimately a strong message about the importance of the father-son relationship.Indiana Jones and the Last Crusade is a 1989 American adventure film directed by Steven Spielberg, from a story co-written by executive producer George Lucas. It is the third installment in the Indiana Jones franchise. A cult film, still one of my favorite films in the series and the last good Indiana Jones movie we didn't need another sequel after third release. There's nothing more exciting than trying to keep up with the Joneses in Indiana Jones and the Last Crusade. Indy's Nazi enemies are back and have kidnapped his father, Professor Henry Jones Sr. (Sean Connery), in their effort to locate the sacred Holy Grail. Following a trail from America to Venice to the deserts of the Middle East, it's up to Indy (Harrison Ford) to save his father, save the Grail and save the day in this non-stop, action-packed adventure the whole family will treasure.The chemistry between Sean Connery and Harrison Ford makes this movie a stand out from the rest of the series. The story of their father and son relationship wrapped in the search for the holy grail is what makes this spectacular Indy movie, a more meaningful adventure. 10/10 Bad Ass Seal Of Approval"
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0271516",
      "warningSpoilers": false,
      "date": "23 November 2003",
      "rate": "10",
      "helpful": "305 out of 397 found this helpful.",
      "title": "The best of the Indiana Jones trilogy",
      "content": "Indiana Jones, the man, the legend, the whip. Everyone I know has seen at least one of the Indiana Jones movies and usually Raiders of the Lost Ark is their favorite. Now I loved Raiders of the Lost Ark, I also really loved Temple of Doom even though it gets a lot of hate for it's darkness. But The Last Crusade is my favorite of the trilogy and the strongest in my opinion. For goodness's sake we have Sean Connery as Indiana's father, how could we get any better than that? I love his way of saying \"Junior!\", always gets me in a good chuckle. Harrison Ford still has that same Indy charm that swoons the ladies, the adventure that captivates the guys and takes us on an incredible journey that we'll never forget.In 1938, Indiana finally recovers the Cross and donates it to his friend Marcus Brody's museum. Indiana is later taken to the residence of wealthy businessman Walter Donovan, who informs him that his father has vanished while searching for the Holy Grail, leaving behind partial directions from an incomplete stone tablet along with his diary containing his life's work on the Grail. Indiana and Marcus travel to Venice to investigate Henry's disappearance, meeting up with his colleague Elsa Schneider. Discovering catacombs beneath the library where Henry was last seen, Indiana and Elsa find the tomb of Sir Richard, a knight of the First Crusade who is buried with a complete version of the tablet. Indiana finds his father, only to be betrayed by Elsa, who reveals that she and Donovan are working with the Nazis to find the Grail. The Nazis steal the Grail diary and capture Marcus in Iskenderun, where he was sent with pages from the diary to seek the protection of Sallah. The Joneses manage to escape the castle and follow the Nazis to Berlin, where they recover the diary from Elsa. The Joneses, Marcus and Sallah arrive to find that the Nazis are unable to pass through three \"trials\" of God. After Indy's father gets shot, he doesn't have much of a choice as to pass the trials and choose the correct cup to save his father's life.Indiana Jones and the Last Crusade is one of my favorite movies of all time, it's just a flawless movie that will always be timeless. My future kids will watch these movies, they're just a lot of fun. Who said archeology can't be fun? This also has one of the most exciting chase scenes of all time, Indiana is trying to rescue his father and a friend from a Nazi tank and he is on a horse, a brutal fight ensues and was just so exciting to watch. I've watched this movie since I was a little girl and I still watch it with pleasure today, even with my friends we love watching Indiana and his adventures. They're an absolute blast and if you haven't seen Indiana Jones and the Last Crusade, please take the first opportunity you have to watch it, it's a great movie.10/10"
    },
    {
      "username": "Li-1",
      "userUrl": "https://www.imdb.com/user/ur1830094",
      "reviewLink": "https://www.imdb.com/review/rw0271511",
      "warningSpoilers": false,
      "date": "2 November 2003",
      "rate": "",
      "helpful": "279 out of 338 found this helpful.",
      "title": "The Last Crusade is the best of the Indy trilogy.",
      "content": "Rating: **** out of ****My opinion of Indiana Jones and the Last Crusade could be deemed slightly biased. It is the first film I ever saw in theaters and it's also the first movie I purchased on video. I even own the same, worn-down, beat-up copy (and look upon it even more fondly than the widescreen edition, for sentimental reasons, of course) (but nothing beats the pristine quality DVD). I think it's fair to say it's this movie that cemented my love of cinema, the high regard I hold for great escapism, which is sorely lacking from today's cinema; movies that should be fun now drag or bludgeon themselves with relentlessly awful scripts or MTV-style direction that turns relatively simple scenes into chaotic blurs. The Last Crusade may only be thirteen years old, but I think I can safely say they don't make them like they used to.The film stars, of course, Harrison Ford as Indy Jones, the archaeologist/adventurer who's on yet another quest, this time to find his father, who'd been searching for the Holy Grail. Said Dad is played by none other than Sean Connery, whose highly charismatic performance is quick to place this film, acting-wise, above the others in the trilogy by giving Ford a genuine acting equal (let me put it this way, he's only half a notch below Harrison Ford/Indy in charisma and appeal if that tells you anything). The rest of the film focuses on this ongoing journey between father and son (eventually joined along by Sallah and Marcus Brody), complete with amazing action and stunt sequences, clever humor, and nasty (but fun) surprises.The script, by Jeffrey Boam, takes a few cues from Raiders of the Lost Ark, but actually improves upon that story by paying more attention to characterization. The delightful opening scene (all three movies really open with a bang, don't they?); which details how young Indy got his scar, whip, hat, and fear of snakes; makes for a better prequel than Temple of Doom (and any of The Adventure of Young Indiana Jones, for that matter).The story is engrossing because there's a lot of fun clues offered towards the location of the Grail and, thus, there's a lot of engaging little discoveries (love the \"X marks the spot\" scene). I'm quite certain, like with Raiders of the Lost Ark, the plot has a few holes, but they're fairly hard to notice, and I've seen this movie quite a few times, but maybe it's just my enjoyment of the film clouding that up. Either way, it speaks volumes in favor of Spielberg's direction and the performances.Given that action and adventure is the series' selling point, you can expect the thrills and wondrous delight of discovery delivered in spades. The action scenes are terrific (and matched well with John Williams' rousing, memorable score, also the best of the trilogy), the best being a fantastic ten-minute chase sequence on board (and in) a tank, possibly the best action sequence of Spielberg's career. I also loved the motorcycle chase and the Zeppelin setpiece, where the heroes go about dispatching of two enemy fighters in unexpected, but quite hilarious, fashion. The climax, complete with frightening booby traps, is a suspenseful venture into the unknown.The Last Crusade is far more humor-oriented than its predecessors, but part of the movie's effectiveness is that it's able to deliver belly laughs without defusing the tension during the action sequences. Some of the jokes are just brilliant, including one with Indy armed with a Luger in confrontation with a trio of Nazis on board a tank that's even funnier than the swordsman scene in Raiders (well, to me, at least).The supporting cast is all-around superb; John Rhys-Davies is back as Sallah, wonderful as ever and displaying a bit more enthusiasm searching for the Grail than he did digging up the Ark of the Covenant. The late Denholm Elliot also returns as Marcus Brody, the most lovable goof of a museum curator. Alison Doody is interesting as Elsa, the blonde historian whom Indy falls for; a twist involving her character and her actions towards the climax make her not as one-dimensional as she may initially appear. Julian Glover is the best of the main Indy villains, he's far more menacing than Paul Freeman's Belloq and less over-the-top but equally enjoyable as Amrish Pruri's Mola Ram. I also enjoyed Michael Byrne's performance as the Jones hating Colonel Vogel, who relishes in torturing Indy and his father. When it comes to pure delightfully nasty villainy, Byrne is even more fun to watch than Glover.Harrison Ford delivers his best Indy performance (maybe even his best performance, period) in this particular adventure. With the addition of Connery as his father, it reveals a personal side to Indy we haven't seen before. It's his rapport with Connery that separates this film from the rest of the genre. They craft an uncannily touching, funny, and genuine bond. That, coupled with the superb action and thrills, solidifies The Last Crusade as the pinnacle of high adventure summer entertainment."
    },
    {
      "username": "Mister-6",
      "userUrl": "https://www.imdb.com/user/ur0097585",
      "reviewLink": "https://www.imdb.com/review/rw0271387",
      "warningSpoilers": false,
      "date": "19 August 1999",
      "rate": "10",
      "helpful": "160 out of 198 found this helpful.",
      "title": "You call this archaeology? Sure do!",
      "content": "One thing you gotta say for this series: it isn't boring.And \"Last Crusade\" has enough thrills, chills and spills to fill up a few dozen old Saturday afternoon serials. Right down the line, everything about this film is superb. Ford and Connery do the father and son routine superbly. Rhys-Davies returns as Sallah, as does Elliott who plays Brody with as much befuddlement as Connery does his role. And who can blame him? And the FX: there's so many you lose count. But don't bother, just sit back, relax and get swept up in the moment. You can't help yourself but to get into this \"Crusade\".Ten stars. A classic Ford with a bright Sean."
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw2048444",
      "warningSpoilers": false,
      "date": "6 April 2009",
      "rate": "9",
      "helpful": "43 out of 56 found this helpful.",
      "title": "Raiders Of The Last Crusade.",
      "content": "Indiana Jones teams up with his father to try and locate the Holy Grail. Something that the Nazis are again particularly interested in themselves.We didn't know it at the time, but every Indiana Jones fan on the planet presumed that The Last Crusade was to be the final film to feature the intrepid archaeologist. As it turned out, another film would surface in 2008, but casting that aside (as many would like to do), Last Crusade should, and is, judged as the trilogy closer it was meant to be.In 1988 Steven Spielberg was deep into bringing Rain Man to fruition, all thoughts of Indiana Jones had gone by the wayside with the harshly judged part two, Temple Of Doom. In stepped George Lucas to politely remind Spielberg that they had an agreement to make another Indiana Jones picture, Spielberg no doubt obliged and humble, passed on his Rain Man work to Barry Levinson who promptly bagged himself an Oscar for the film. It can be guessed that Spielberg was probably grouchy around this period, but he needn't have worried, because The Last Crusade provided a much needed hit for not only himself (post Empire Of The Sun), but also Lucas (Willow) and Harrison Ford (Frantic).I mention the run up to this picture because it explains a lot on why the film is pretty much a retread of Raiders Of The Lost Ark, something that some detractors find unforgivable. Yet Last Crusade is still an immensely enjoyable adventure picture, with Spielberg proving that he was still capable of a popcorn bonanza. Using the Raiders formula and moving away from the dark flourishes of Temple Of Doom, Last Crusade is actually the simplest film of the three, but still it manages, courtesy of a sparkling casting decision, to become the most entertaining of the original trilogy. Is it better than Raiders? Of course not, but it positively rips along with sparky dialogue and an agenda of cliffhanging suspense like the adventure films of yore.In comes Sean Connery as Dr Jones Senior, and its the picture's trump card, because the magnificent interplay and obvious rapport with Ford (cool as a cucumber) is there for all to see. It's this what drives the film on through the more mundane and picture filler sequences, showcasing two top wily professionals with care and consideration to their craft. The casting of Alison Doody as the main female is a poor one, and one only has to look at her subsequent career post Crusade to see she wasn't up to the task here. Bonus comes in the form of the River Phoenix prologue, Phoenix as the young Indiana paves the way for the jaunty path that Crusade takes, whilst simultaneously giving us a nice little back story from which to launch the adventure.Made for $48 million, the film went on to gross $474,171,806 Worldwide, now that's a lot of people who evidently were happy with Raiders Of The Lost Ark 2! And I gleefully count myself amongst that number. 9/10"
    },
    {
      "username": "ReelCheese",
      "userUrl": "https://www.imdb.com/user/ur3924830",
      "reviewLink": "https://www.imdb.com/review/rw1365256",
      "warningSpoilers": false,
      "date": "11 May 2006",
      "rate": "10",
      "helpful": "109 out of 133 found this helpful.",
      "title": "Top-Notch Entertainment",
      "content": "Everything clicks in this action-packed cliffhanger. In his third (and what for years what thought to be his last) adventure, Indy is on the hunt for that ultimate treasure, the Holy Grail. Along the way he must contend with Nazis, a secret brotherhood and, of course, snakes. Sean Connery is a wonderful addition as Indy's father, and the chemistry between he and star Harrison Ford may just be one of the best in film history. The movie is a true rarity in that its attempts to outdo each preceding chase sequence succeed. Though children might have trouble interpreting the plot, this crusade is one people of all ages will enjoy."
    },
    {
      "username": "jhaggardjr",
      "userUrl": "https://www.imdb.com/user/ur0671107",
      "reviewLink": "https://www.imdb.com/review/rw0271350",
      "warningSpoilers": false,
      "date": "24 March 2002",
      "rate": "10",
      "helpful": "52 out of 66 found this helpful.",
      "title": "Outstanding finale (or is it the finale?)",
      "content": "\"Indiana Jones and the Last Crusade\" was supposed to be the final movie in the \"Indiana Jones\" series. At least that's what director Steven Spielberg and producer George Lucas said at the time this film hit theaters. But now they've said there will be a fourth \"Indiana Jones\" film. I really don't know if that's a good idea, because the \"Last Crusade\" was a fitting end to a great movie series. Harrison Ford returns for his third go around as swashbuckling hero Indiana Jones, this time accompanied by Sean Connery as Indy's father, Dr. Henry Jones. These two actors work beautifully together as they fight off the Nazis in search for the Holy Grail. Two actors from \"Raiders of the Lost Ark\" reprise their roles to great effect in \"Last Crusade\": Denholm Elliott as Marcus Brody and John Rhys-Davies as Sallah. Alison Doody is the heroine (good or bad?); Julian Glover is the villain; River Phoenix portrays a young Indy at the beginning to see how this character really got his start. \"Indiana Jones and the Last Crusade\" not only has great characters, it also has a decent story (taking place in 1938), plus exciting action scenes and special effects. It's better than the second film \"Temple of Doom\" and comes very close to topping the first film \"Raiders\". The \"Indiana Jones\" series should stay right where it is with the \"Last Crusade\" as the finale. Unless Spielberg, Lucas, and Ford can prove us wrong and make a really good fourth film in the series, we shall see. I loved all three movies in the \"Indiana Jones\" series. If the fourth film does gets made, I hope it'll be equally as good as the first three.**** (out of four)"
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5530141",
      "warningSpoilers": false,
      "date": "6 March 2020",
      "rate": "",
      "helpful": "27 out of 34 found this helpful.",
      "title": "Indiana Jones",
      "content": "So how do you return a franchise to it's successful past? Apparently bring back most of the cast from the first movie and the Nazis but add Sean Connery. This movie is as good if not even just a little bit better than the original. The interaction between Ford and Connery is amazing and makes for an enjoyable film. The action and story in this is great. This time (back to looking for Christian artifacts) Indy is out to find his father who went missing while looking for the Holy Grail."
    },
    {
      "username": "BigHardcoreRed",
      "userUrl": "https://www.imdb.com/user/ur0762960",
      "reviewLink": "https://www.imdb.com/review/rw1062902",
      "warningSpoilers": false,
      "date": "18 April 2005",
      "rate": "",
      "helpful": "155 out of 206 found this helpful.",
      "title": "Probably The Best Movie Of The Trilogy.",
      "content": "Indiana Jones And The Last Crusade was, in my opinion, the best movie of the Indiana Jones trilogy. This movie featured the same type of humor we have become accustomed to from Jones, as well as another beautiful woman (also probably the best Indy girl) and lots of great action scenes! This movie starts off with a teenage Indy (River Phoenix) which gives us a look at an event that molds his life and character as well as his relationship with his father, Henry (Sean Connery). We also learn he is a \"Junior\" and that he hates to be called that.Back as an adult, Indy's father is kidnapped and he must set out to find him. His only clues are his father's diary notes, which were mysteriously sent to him earlier that day. They lead him to Italy, where he meets the gorgeous blonde, Dr. Elsa Schneider (Alison Doody), who becomes an integral part of this story.Once again, the grown up Indy (Harrison Ford) does battle with the Nazis. Apparently, Adolf Hitler is after the Holy Grail, which contains the blood of Christ. So Indiana and his father team up to get there first. Along the way, there is a great action scene where Jones fights a few Nazis on board a moving tank.Overall, as I mentioned earlier, I believe this to be the best Indiana Jones movie of the three. This action movie was good long before movie studios learned to make the great CGI and special effects. It's effects were pretty good anyways but back in 1989, things just did not look as good as they can make them today. Still, highly recommended and worth your time. 9.5/10"
    },
    {
      "username": "gottogorunning",
      "userUrl": "https://www.imdb.com/user/ur6664971",
      "reviewLink": "https://www.imdb.com/review/rw1148955",
      "warningSpoilers": false,
      "date": "13 August 2005",
      "rate": "9",
      "helpful": "74 out of 97 found this helpful.",
      "title": "Movie Magic!",
      "content": "When the two greatest filmmakers in the world teamed up to create the best action movie of all time - Raiders of the Lost Ark, it seemed unlikely that they could duplicate their divinely-inspired work. After a miss with the entertaining yet forgettable Indiana Jones and the Temple of Doom, Indiana Jones and the Last Crusade comes pretty close to doing just that.Film history's most profitable star Harrison Ford returns to his signature role in a performance that speaks for itself, and benefits greatly from a gallery of memorable supporting characters. That includes Sean Connery, the grandest of all modern action day movie heroes (and appropriately cast, as the spiritual father of the character is James Bond). Connery plays against that, in a performance that is different than anything he has ever done, and it works. Even so, Denholm Elliott can't seem to help stealing every scene he's in as Marcus Brody, a lifelong friend of the Jones family.This movie stands by itself in the way it deals with spirituality, and is thick with religious themes throughout, without preaching to you. This is a very difficult balance to achieve in any film, and that alone makes the film stand out as brilliant. It is more abundant with humor than the previous two films, without the characters falling into irritating self-parody. Being a sequel, this is a difficult balance to achieve as well. (Look at action sequels such as Lethal Weapon 4).This film stands among the greatest action adventures of all time. I don't know anyone who hasn't seen it, but if you haven't, don't walk to see it. Run."
    },
    {
      "username": "thesar-2",
      "userUrl": "https://www.imdb.com/user/ur17825945",
      "reviewLink": "https://www.imdb.com/review/rw2412387",
      "warningSpoilers": true,
      "date": "11 April 2011",
      "rate": "10",
      "helpful": "13 out of 19 found this helpful.",
      "title": "X Marked This Spot and masterfully",
      "content": "By the time of this writing, Blockbuster Inc. stores probably have all but vanished. Each with a sign that indicates that it's \"just this store\" that's closing. Sad, but that's how the story goes. Remember the Beta Video stores?When I was a kid, and we got our very first VCR – man, that was like the invention of television for those around my age – and I was able to save up enough money to buy two previously viewed movies. And get this: I had to actually pre-order previously viewed VCR tapes and they were incredibly $19.95 apiece!No matter; I really wanted both Lethal Weapon 2 and Indiana Jones and the Last Crusade. And bad.They were like gold for me. And they, along with a birthday gift of the original Batman, certainly earned their weight. I must've watched those three – my only movies – fifty times each.So, you can see: I am very familiar with Indiana Jones and the Last Crusade. Every inch, score number and frame. I love this movie.Later, I would contest and readily agree, Raiders of the Lost Ark is both a masterpiece and better film, but that doesn't deter on how much FUN this third installment is. And I'm not even mentioning the dreadful part two: Indiana Jones and the Temple of Doom. In my mind, there's only Indy 1 and 3. You can even forget the (yawn) Young Indiana Jones (so-called) Adventures.Everything worked in this movie: suburb acting, hilarious and fun dialogue – mostly from the chemistry (or banter) of the two Jones's, extreme adventure, exciting action, fantastic characters, nostalgia – for fans of Raiders and great twists. And one of the best aspects is also a spoiler, – sorry, but if you haven't seen this 22-year-old epic, that's your fault – it has one of the best endings in the history of cinema: they actually ride off into the sunset. Brilliant and beautiful ending to the series!** - that is until they ruined it with the overkill: Indiana Jones and the Kingdom of the Crystal Skull. Best advice? Think of this as the actual LAST adventure and forget that wretched sequel.Heck, I can't really pinpoint many, if any, faults or flaws in Last Crusade. Pooossssibly, the over-long opening segment with the original \"Young Indiana\" played by the late and great River Phoenix? Even that was entertaining, fun and had an awesome score track. So, technically, it's not a setback, but perhaps needed a little more editing.Indiana Jones (Harrison Ford) is overwhelmed at school, but is more so when his father, Henry Jones, Sr. (Sean Connery – in, Literally one of his best on-screen performances) is listed as missing. Indy is tempted with the prospect of finding the mystical Holy Grail, even though he, himself, doesn't believe it. He does set off on a mission to find his father, but we all know, he'd equally like to find this \"Lost Cup of Jesus Christ.\"He meets up with (what I grew up referring to as \"the blonde\") the beautiful and seductive dame Dr. Elsa Schneider (Alison Doody) and they quest to find daddy Jones and ward off Nazis. Not so much a spoiler, but he does rescue Henry Jones, Sr. and the race for the Grail is on between the Jones's and the Nazis.I left out a lot, but that's the basic, BASIC, premise. Seriously, if you have not seen this, or have even, see it (again, if you have) and learn to enjoy the film that frankly defines adventure. And a movie that captures the heart of the original, the atmosphere of the serials of before most of our times and how movies were really made: pre-CGI.On a related note: while some people are anti-3D, I am boarder-line anti-CGI. Sure it's a cheaper way of filmmaking, but I feel it's just that: cheap. Rarely will it be believable in my sight, for the most part it's all-but a cartoon and extremely laughable. That said, it can work sometimes. The recent 2010 Alice in Wonderland film is a perfect example of how it can really work and impress me. But, 80% of the time, it's just plain corny, distracting and again, CHEAP. My favorite action/adventures films are how they used to be made: with both inventiveness and heart. Like this one. Heck, I'll take a blue/green screen any day over a computer telling me what's \"real\" looking.But, I digress. I hesitate in calling this a masterpiece (in filmmaking, at least) but in my mind it is. And seeing that this is an opinion piece, I will go on record: it doesn't get much better than this.I remember some of the promotional shots on the late night shows from Harrison Ford, et al, that casually admitted Temple of Doom was a disaster – I AGREE – and this was a make-up movie. It sure the heck was! This was thee number one redemption movie of all time.Note to Hollywood: continue the redemption. Make movies like this, verses the CGI-laced, no-script films of the last decade or so. Remember what it's like to have this much fun in the movie going experience. I remember. I recall 1989 when this was released as my all-time favorite year in films released. Too bad, they haven't come close to '89 in 22 years.And Hollywood won't listen. I ask that you do. Support and watch movies like Indiana Jones and the Last Crusade. Remember what it was like to have fun in the theatre, what it was like when real special-effect crews did real work on the fields and not in the office and remember what it was like to be a kid again. See this movie!"
    },
    {
      "username": "JamesHitchcock",
      "userUrl": "https://www.imdb.com/user/ur2955724",
      "reviewLink": "https://www.imdb.com/review/rw2380293",
      "warningSpoilers": false,
      "date": "4 February 2011",
      "rate": "7",
      "helpful": "19 out of 30 found this helpful.",
      "title": "Indiana Jones and the Welcome Return to Form",
      "content": "\"Indiana Jones and the Last Crusade\" was the third and final instalment in the original Indiana Jones trilogy. Whereas \"Indiana Jones and the Temple of Doom\" was a prequel to \"Raiders of the Lost Ark\", \"Last Crusade\" is a true sequel. Apart from an opening scene relating an adventure of the teenage Indy as a Boy Scout in 1912, the action takes place in 1938, two years after \"Raiders\". (In this opening scene we learn how the hero got his nickname; Indiana is not, as I had always assumed, his home state, but a name borrowed from his pet dog).Whereas \"Raiders\" was a great commercial and critical success, \"Temple of Doom\" received considerable criticism, both on account of its dark, gloomy atmosphere and its racist treatment of Indian characters. Steven Spielberg, therefore, was determined to make the third film lighter in tone, closer in spirit to \"Raiders\". Once again the villains are the Nazis, once again the plot involves the search for a legendary relic with mystical powers (in this case the Holy Grail which caused such excitement among King Arthur and the Knights of the Round Table) and once again much of the action takes place in the Middle East. (This must be the only Hollywood film ever to be set- ostensibly- in the short-lived Republic of Hatay, formerly part of French Syria and today part of southern Turkey, which enjoyed a brief independence for several months in 1938/9. Most of the \"Hatay\" scenes, however, were shot in Spain, with the ruins of Petra, actually in Jordan, standing in for the temple in which the Grail is housed).The film also introduces us to Indy's father, Henry Jones, Sr. The James Bond films were undoubtedly one of the inspirations for this franchise, and it was possibly in their homage that Sean Connery was cast as the elder Jones, even though he is only twelve years older than Harrison Ford. (That speedboat chase along the Venetian canals also seems to be homage to Bond). Like his son, Henry senior is an academic archaeologist and has gone missing while seeking the Holy Grail. Indy believes that his father is in danger and sets out to find him, a quest that will take him to Venice, Germany and ultimately Hatay. The main female character is Henry's colleague, Dr. Elsa Schneider, a glamorous Austrian blonde whose loyalties are ambiguous.There is more stress on character development here than in other episodes of the franchise, with emphasis being placed on the father-son relationship. The film is not just about the search for the physical Holy Grail. Even in the Arthurian legend the Grail was as much a symbol as a physical object, and today the phrase \"holy grail\" is used metaphorically for anything which is desirable and much sought-after. The film is also about Indiana's search for his lost father and their efforts to re-establish a relationship which in the past has often been strained- the story's metaphorical Holy Grail. Ford and Connery are both good at bringing out this aspect of the story. There are also good contributions from Denholm Elliott as Indiana's bumbling colleague Marcus Brody and Alison Doody as the treacherous, seductively sinister Elsa.After the awful \"Temple of Doom\", \"Last Crusade\" represents a welcome return to form, both for Spielberg and for Ford, who seemed ill at ease in the earlier film but here is back to his old ebullient self. The film contains a better balance of suspense and humour than did its predecessor, much of the humour being at the expense of the hapless Marcus. There are some excellent action scenes, such as the train sequence in the opening scene, the escape from the Zeppelin and the tank chase though the desert. \"Last Crusade\" is a very enjoyable adventure film in the same tradition as \"Raiders\". 7/10"
    },
    {
      "username": "JayWolfgramm",
      "userUrl": "https://www.imdb.com/user/ur40795830",
      "reviewLink": "https://www.imdb.com/review/rw8525025",
      "warningSpoilers": false,
      "date": "8 September 2022",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Greatest Adventure Movie of All Time",
      "content": "\"Last Crusade\" is always a joy to watch. At 2hr 7 mins the time just flies by, there is never a dull moment. There is a great variety of action, they manage to fit in horseback, train, car, airplane, boat, motorcycle and tank action scenes. All of these scenes are done at the very top of their class.All the main cast work off of each other perfectly, and there is fantastic chemistry between Sean Connery and Harrison Ford as the father/son duo at the core of this film. The real predecessor to Indiana Jones is James Bond, so it makes sense that Sean Connery would play the father of Indiana Jones. But beyond stunt casting, Sean Connery's Henry Jones is a delight, and is memorable in every scene he is in.This film also blends together action and comedy perfectly. It never clashes with the tone and always allows the serious moments to sink in. But when they do a joke, it is legitimately a very funny joke.And how I can go without mentioning the music? John Williams delivers some of the best music of his career in this entry. The music compliments what is going on on screen so well, you could picture the scenes in your mind just through listening through the soundtrack.Where some may prefer \"Raiders of the Lost Arc\" for its originality and grit, I prefer \"Last Crusade\" for its refining and perfecting everything the series had set up. The ending of this film is also just more satisfying and exciting than the ending of \"Raiders\". The Holy Grail is the best maguffin of the series, and possibly of all time. There is something inherently legendary about people questing to find the Holy Grail.If you haven't seen this film: WATCH IT. If you have seen this film a dozen times already: go ahead and watch it again. It is always entertaining, exciting and illuminating. What a great way to END a great trilogy."
    },
    {
      "username": "gab-14712",
      "userUrl": "https://www.imdb.com/user/ur61859192",
      "reviewLink": "https://www.imdb.com/review/rw7642861",
      "warningSpoilers": false,
      "date": "14 December 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "The Original Trilogy Ends With a Bang!",
      "content": "To put it simply, I loved Indiana Jones and the Last Crusade. After the darker Temple of Doom, Steven Spielberg wanted to bring back the lightheartedness that made Raiders of the Lost Ark such an endearing classic. He succeeded and nearly even topped the first film in sheer joy and adventure. Might as well call the two adventures even in my book. The film has amazing set pieces (the rat scene in Venice among others). What I really liked the most? The introduction of Dr. Henry Jones, Indiana's father, played beautifully by Sean Connery. Through most of the film, Harrison Ford and Connery have such a strong rapport together and their arcs intersected in the best possible way. Indiana Jones beating up Nazi thugs in Raiders was a treat. Why not have him do it again, so Nazis are our main villains once again. For a brief moment, Indiana comes face-to-face with Adolf Hitler in such a chilling sequence at a book-burning rally. Finally, I loved how they chase after the Holy Grail. As someone fascinated by this type of history (The Crusades, Holy Grail, etc), another reason is given to me to be hooked into the story. Kudos to Steven Spielberg to directing one of the best trilogies of all time (although there is obviously now a fourth). If there was no fourth film, the ending is poignant and a perfect sendoff for our hero.After the relatively mixed reaction of The Temple of Doom, Spielberg set out to make a trilogy capper that captured the spirit and tone of the original. Spielberg and producer George Lucas had some bizarre ideas such as using the Monkey King, ghosts, the Fountain of Youth, and a cannibalistic African tribe amongst other ideas. Thankfully, they ended up using more straightforward ideas such as reintroducing the Nazis and bringing Indy's father into the fold. Jeffrey Boam is the main credited screenwriter although there have been various drafts from writers such as Chris Columbus. Boam gave more credibility to the father-son story by having them lose the grail mid-film. I also liked the idea of young Indy to start the film. River Phoenix was an excellent choice to play the fedora-wearing hero in his youth. This father-son relationship is the heart of the story. Spielberg, Boam, Connery, and Ford did everything to make it work. We should also thank Connery for his suggestions because he is the one who suggest ideas for his character that stuck. As an actor who studied history, it was essentially a requirement if they wanted his services. To keep the tone they were aiming for, Spielberg brought back the bumbling Marcus Brody and Indy's sidekick, Sallah.Like the other two films, there are incredible action sequences, and the production design is fantastic. There is no scene that can top the boulder sequence from Raiders, but it does come awfully close. Even though there are no underground tombs in Venice, I actually thought there were for a second. The boat chase on the Grand Canal is fun. The rat scene made me jump. I do not mind snakes unlike Indy but rats...ughhhh! The movie boosted tourism for some places. What is known as \"The Treasury\" located in Jordan (where the Grail was housed) became a new spot for tourists. The beginning sequence was filmed in one of my favorite National Parks, Arches National Park. Also, the castle sequence with Indy and his father is another highlight. In addition to great production design and special effects, John Williams crafted another beautiful score. Hearing that theme always get me.It is 1939, and Indiana Jones (Harrison Ford) is back in action. The famed archaeologist is given a diary that holds clues and maps to the whereabouts of the famed Holy Grail from his father, Dr. Henry Jones (Sean Connery) who made a living studying the mysteries of the Grail. Indy learns from a private collector Walter Donovan (Julian Glover) that the search for the Grail disappeared along with Indy's father. Indiana and his friend Brody (Denholm Elliot) travel to Italy to find Indy's father. Once that happens, now it is a race to find the Grail before the Nazis do. If the Nazis find it, they will use its power for complete world domination. With the help of Sallah (John Rhys-Davies) and Elsa (Alison Doody), an Austrian art professor, Indy and his father must race to find the Grail with what limited clues they possess.Harrison Ford is fantastic as always. He continues his wisecracking ways...but changes his personality around his father. We even learn his real name! He has fantastic chemistry with Sean Connery who is bloody brilliant here. The Connery/Ford combo is one of my favorite father/son combos in film history. As for Alison Doody, she makes for a fine heroine. Even if she does not quite live up to Karen Allen. Better than Kate Capshaw, though. If there is a minor complaint, that would be it. Julian Glover has always been great as the villain, so does it surprise that he is great here? It is also great to have Denholm Elliot and John Rhys-Davies back in the fold.Indiana Jones and the Last Crusade was so much fun. It has a fun, adventurous spirit just like Raiders of the Lost Ark. If this would have been the finale, it would have been the perfect end. Riding off into the sunset. The action, special effects, and production design are all stunning. I am glad they brought back Nazis because that Hitler sequence was so chilling. And who doesn't like the Nazis getting their butts kicked. Spielberg has always been the king of movie magic. The Last Crusade is just one of those examples.My Grade: A+"
    },
    {
      "username": "CuriosityKilledShawn",
      "userUrl": "https://www.imdb.com/user/ur0102816",
      "reviewLink": "https://www.imdb.com/review/rw2800255",
      "warningSpoilers": false,
      "date": "20 May 2013",
      "rate": "7",
      "helpful": "10 out of 14 found this helpful.",
      "title": "It should have remained the last",
      "content": "Summer 1989. I was 8 years old. I only managed 2 movies that summer, one being Ghostbusters 2 (which blew my eager young mind at the time) and Last Crusade (which also blew my mind). I don't think I could have asked for two bigger blockbusters to choose from. Having been a rabid child fan of Raiders and Temple of Doom all things Indy were fresh in my mind and even as an 8-year-old I truly 'got' Last Crusade.Set 2 years after Raiders, and 3 years after Temple of Doom, Last Crusade opens with a flashback to Indy's youth and an aggravating cameo by River Phoenix in the role. His anachronistic hair, androgynous physiognomy, and that fact that he looks absolutely nothing like Harrison Ford take me out of the film every time, and spoils the long opening scene for me. The opening does nothing apart from establish all of Indy's trademarks (the hat, the whip, the scar, the fear of snakes), which he apparently all got within five minutes. Luckily the film soon jumps forward to 1938 and the opening quickly is forgotten about as shady antique collector Walter Donovan encourages Indy to go after the Holy Grail.With Der Fuhrer also after the sacred chalice Indy must once again face off against the despicable Nazis, rescue his bumbling father (Sean Connery, having the time of his life), and keep one step ahead of Donovan with Sallah and Brody tagging along.There is loads of inventive, exciting action in many exotic, breath-taking locations and all of it is immaculately photographed by Douglas Slocombe in lovely anamorphic Panavision. Even with today's many advancements in movie camera technology you'll rarely see a film as beautifully photographed as this. All very high-key, mind you, the polar opposite of the dark, subterranean Temple of Doom.Now, herein lies my only gripe with Last Crusade (other than River Phoenix) is the fact that it's just too light-hearted. Spielberg expressed regret over the fact that he made Temple of Doom very dark and mean-spirited (which I don't agree with as it is my personal favorite) so he compensated by making Last Crusade more cheerful and bright. It's not an annoying shift in tone, but it could have been balanced out with a bit more blood and gore.Last Crusade makes the perfect end to the real Indiana Jones trilogy. Spielberg really should have left it as our hero, his dad, and his two sidekicks rode off into the sunset. How can you top that? How can you come back from that? But 19 years later he tarnished many reputations and spoiled many memories with the deeply, DEEPLY misjudged Kingdom of the Crystal Skull.It was an amazing film to see as a child, and it's a shame that kids these days are not exposed to anything as good. If you can turn a blind eye to River Phoenix you will surely have a great time with Last Crusade. It's not the Snake Car on the train he ought to worry about, it's the Viper Room on Sunset Boulevard."
    },
    {
      "username": "anselmdaniel",
      "userUrl": "https://www.imdb.com/user/ur85351024",
      "reviewLink": "https://www.imdb.com/review/rw8415799",
      "warningSpoilers": true,
      "date": "8 August 2022",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Fantastic third entry",
      "content": "This review contains spoilers.Indiana Jones and the Last Crusade is the third installment in the Indiana Jones franchise. The movie takes place after Raiders of the Lost Ark and concerns Indiana Jones as he looks for the holy grail.Indiana Jones and the Last Crusade is a fantastic third entry into the Indiana Jones trilogy. The third entry combines action, adventure, and surprisingly comedy in one tight and focused movie. Much of the comedy is owed to Sean Connery playing Indiana Jones' father. This entry is as good if not better than Raiders of the Lost Ark. It is entirely understandable to see why some audiences may prefer Indiana Jones and the Last Crusade over Raiders of the Lost Ark. This is a movie that edges more towards comedic action-adventure.Indiana Jones and the Last Crusade does not skimp on the action scenes. This is a movie that took the phenomenal white knuckle action in the previous two movies to different settings. The action set pieces in this movie are absolutely sublime in their execution. It is as if the earlier entries in the franchise were more for the experience in setting up what the audience would like in this movie. The action setup combined to form a blend of busting comedy and intense action that is a wonder to behold.The villains share the same problem as in Raiders of the Lost Ark. The villains are not all that threatening to Indiana Jones and are able to be overcome easily. This acto of being overcome is more bearable than in Raiders of the Lost Ark or Temple of Doom as it is more comical. The comedy from Indiana Jones overcoming the antagonistic political party is phenomenal. A lot of this is owed to Sean Connery's performance as Indiana Jones' father. He comes up with many unique solutions in their predicaments that work in their favor. It was hilarious watching Sean Connery overcome the evil villains through trickery. Sean Connery is a gem in this movie.I highly recommend \"Indiana Jones and the Last Crusade\" directed by Steven Spielberg.Grade: A."
    },
    {
      "username": "blanche-2",
      "userUrl": "https://www.imdb.com/user/ur0342623",
      "reviewLink": "https://www.imdb.com/review/rw2359337",
      "warningSpoilers": false,
      "date": "27 December 2010",
      "rate": "9",
      "helpful": "6 out of 8 found this helpful.",
      "title": "loads of fun",
      "content": "\"Indiana Jones and the Last Crusade\" was made in 1989 and bristles with excitement, humor, suspense, special effects and, as a real plus, character development. In the beginning we get to see young Indy (River Phoenix) and where he got his fear of snakes, etc., and we meet his father, Henry Jones (Sean Connery), a brilliant professor.In this story, Indiana Jones (Harrison Ford) leaves his teaching job to again save the world from the Nazis. They have kidnapped Indy's father for his diary. The Nazis seek nothing less than the Holy Grail, for which Henry Jones has maps and notations in his diary which can lead to it. The Holy Grail here is a chalice used by Jesus at the Last Supper, received by Joseph of Arimathea and said to possess miraculous powers. Joseph used the Grail to catch Christ's blood while interring him. It's up to Indy to free his father.Directed by Steven Spielberg, Indiana Jones and the Last Crusade takes the audience on a thrilling journey to Venice, Austria, Germany and remote locations. The film never lets up its fast pace and around every corner, there's a special effect, or funny dialogue, or a brilliant escape.The great cast also includes Julian Glover, John Rhys-Davies, Denholm Elliott, and Alison Doody."
    },
    {
      "username": "Nwoakes",
      "userUrl": "https://www.imdb.com/user/ur53005392",
      "reviewLink": "https://www.imdb.com/review/rw4434308",
      "warningSpoilers": true,
      "date": "2 November 2018",
      "rate": "10",
      "helpful": "28 out of 34 found this helpful.",
      "title": "Timeless, Priceless",
      "content": "It's a perfect action-adventure, with elements of fantasy. The best part is the coming together of Sean Connery and Harrison Ford. One is a field agent and the other is strictly an academician.Some films are timeless. This is one of them. No modern adventure film comes close to this."
    },
    {
      "username": "sauravjoshi85",
      "userUrl": "https://www.imdb.com/user/ur47100167",
      "reviewLink": "https://www.imdb.com/review/rw8818151",
      "warningSpoilers": false,
      "date": "22 January 2023",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "The finest and the best among all the Indy films. A must watch!!",
      "content": "Indiana Jones and the Last Crusade is an action-adventure film directed by Steven Spielberg. The film stars Harrison Ford, Late Sean Connery, Alison Doody, Late Denholm Elliott, Julian Glover, Late River Phoenix, and John Rhys-Davies.When Indiana Jones, an archaeologist, learns that his father, Dr Henry Jones, has disappeared while looking for the Holy Grail, he embarks on a journey to get to him before the Nazis.This film is probably the best film in the Indy series and for me this is undoubtedly the best film of the series. The film is very satisfying and rewarding action film and almost ticks all the boxes of how to make an action thriller film.The plot of the film is superb and the execution is mind blowing, the film will keep you intact with it's gripping climax and superb music.Acting was the strongest pillar of the film and the addition of Sean Connery in the cast works perfectly for the film.Screenplay of the film is also good with a great climax and superb end. This is the best film of The Indy Trilogy and a must watch."
    },
    {
      "username": "ED122304_TGG",
      "userUrl": "https://www.imdb.com/user/ur87747099",
      "reviewLink": "https://www.imdb.com/review/rw4438165",
      "warningSpoilers": false,
      "date": "4 November 2018",
      "rate": "10",
      "helpful": "23 out of 30 found this helpful.",
      "title": "A classic",
      "content": "This was an amazing movie, my personal favorite in the Indy series. Has good plot, a lot of humor, and some emotion too. not to mention plot twists"
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw1187107",
      "warningSpoilers": false,
      "date": "5 October 2005",
      "rate": "8",
      "helpful": "9 out of 14 found this helpful.",
      "title": "Third part of Indiana Jones series with agreeable and sympathetic interpretation by Sean Connery",
      "content": "The 1930s archaeologist and adventurer Indiana Jones (Harrison Ford) , a larger that life hero , with its battered hat and whip wielding will confront evil Nazis for the obtaining the Holy Grail . This time he makes couple with his daddy (Sean Connery) along with a beautiful woman (Alison Doody) and friends (Denholm Elliott and John Rhys Davies) . Brave and daredevil Indiana Jones risks his life facing off villains , taking on armoured tanks , warplane , cliffs and several dangers and adventures.Dr.Indiana executes feats of derring-do in various exotic countries . It's the finale part of adventures trilogy (along with : Raiders of the lost ark and Temple of Doom ) going on the way of the 30s classic films and the Comic-books language .The picture blends comedy , adventures , action , rip-roaring , Cliff-hunger , tongue-in-cheek and being extremely entertaining and fun . Harrison Ford plays magnificently as the valiant and impulsive archaeologist turned into an action man .F or comic relief in charge of continued jokes about the relationship between Indy and his dad .The picture has great loads of action , special effects abundant and habitual and impressive John Williams musical score .The movie has a spectacular intervening period when Indiana is fighting against a tank that will have you on the edge of your seat , but the action never lets up. In this flick appears River Phoenix as an adolescent Indiana in a spectacular and frenetic beginning. The film is followed by the TV series ,also produced by George Lucas : ¨The young Indiana Jones¨ with Sean Patrick Flannery. The motion picture was splendidly directed by Steven Spielberg , being his favorite of the \"Indiana Jones\" films , and it is on record as saying he directed the pic for two reasons: To fulfill a three-picture obligation he had made with George Lucas, and, and to atone for the criticism that he received for the previous installment, Indiana Jones and the temple of Doom (1984). It obtained some Academy Awards, secondary Oscars for editing and sound effects, very well deserved although I miss didn't achieve more. The movie will appeal to Indiana saga fans as well as the neophyte who didn't have seen the previous episodes .It's indispensable and essential watching . Rating : excellent , above average and well worth seeing. It's a winner for Harrison Ford fans."
    },
    {
      "username": "CoopertheBeagle",
      "userUrl": "https://www.imdb.com/user/ur152388340",
      "reviewLink": "https://www.imdb.com/review/rw8097019",
      "warningSpoilers": false,
      "date": "28 April 2022",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "absolute classic",
      "content": "Sean Connery, harrison ford, and the rest of the cast in Great performances, with action sequences, big ethical dilemmas and religious themes, comedy, family dynamics explored, what more could you ask for?"
    },
    {
      "username": "dbdumonteil",
      "userUrl": "https://www.imdb.com/user/ur1219578",
      "reviewLink": "https://www.imdb.com/review/rw0271489",
      "warningSpoilers": false,
      "date": "7 May 2003",
      "rate": "8",
      "helpful": "36 out of 72 found this helpful.",
      "title": "the best Indiana Jones movie ever?",
      "content": "The third and the best of the adventures of Indiana Jones. In this new film, the famous archeologist is searching for a mythical object: \"the Graal\". This is the glass in which the Christ would have drank during the last meal with his apostles. His father assists him in his investigations because he's got precious information about the Graal. So, a long trip begins and will lead our two heroes from Venice to the Middle East in passing by Berlin. You can guess it, this trip has got its rough patches (otherwise the movie would appear devoid of interest). Indeed, the Nazis wish to discover the Graal too because it would make them powerful even dangerous.Steven Spielberg designed his movie like a fascinating treasure hunt and he had the good idea by bringing Sean Connery. Thanks to his presence, the movie's got a certain humor (perhaps a little too convenient but the result works) and allows to lighten the movie.\"Indiana Jones and the last crusade\" is also a good surprise because it wipes out the unhappy memory of the previous movie: \"Indiana Jones and the temple of doom\". I found it too horrendous, bloody and even annoying due to Kate Capshaw. Here, to film Indiana Jones' incredible adventures, Spielberg adopted a dramatic and especially efficient film-making. He also avoids all that could make the movie fall in the faults quoted in the second movie. Moreover, there aren't any injury times, the rhythm is skilfully sustained (particularly during the pursuits) and it's better this way because the result is very convincing. Obviously, the movie doesn't go without a few unlikelinesses.Spielberg also brilliantly used the good old recipes for the adventure film: weird and exotic sceneries, the struggle between good and evil, the magic object that possesses supernatural powers etc...The only criticism I have to make of Spielberg is that the screenplay is perhaps well boosted but it doesn't also succeed in hiding a certain manicheism: the Nazis wish to get rid of Jones and his father and to discover the Graal would help them to satisfy their strength.An adventure movie entertaining enough to sustain the interest and rather well performed. Let's add the imposing music (as usual) composed by John Williams."
    },
    {
      "username": "Special-K88",
      "userUrl": "https://www.imdb.com/user/ur1596208",
      "reviewLink": "https://www.imdb.com/review/rw0271357",
      "warningSpoilers": false,
      "date": "17 April 2002",
      "rate": "",
      "helpful": "30 out of 57 found this helpful.",
      "title": "familiar formula redeemed by great casting",
      "content": "An ideal action-comedy/adventure if there ever was one; in this entertaining third installment archaeologist Ford must travel to Italy in 1938 to try and rescue his estranged father. However, the rescue mission soon turns into a historic quest as he seeks out the Holy Grail, once again finds himself battling Hitler's Nazis, and again encounters dangerous perils every step of the way. Follows basically the same formula as Raiders of the Lost Ark, but Connery is an added bonus as Ford's father and the two make a perfect duo. A good blend of elements as the film provides lots of exciting, cliffhanger action scenes/stunts, memorable lines, and genuine humor, but the relationship between the two leads is what really gives it stability. Lots of fun. ***½"
    }
  ],
  "errorMessage": ""
}