{
  "imDbId": "tt0044741",
  "title": "Ikiru",
  "fullTitle": "Ikiru (1952)",
  "type": "Movie",
  "year": "1952",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/great-movie-ikiru-1952",
      "rate": "100",
      "content": "Over the years I have seen \"Ikiru\" every five years or so, and each time it has moved me, and made me think."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Mark Chalon Smith",
      "link": "https://www.latimes.com/archives/la-xpm-1992-10-13-ca-28-story.html",
      "rate": "100",
      "content": "Like “Stray Dog” and “Drunken Angel,” it illuminates a reeling society while telling a story of deep human emotion."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/ikiru",
      "rate": "100",
      "content": "A thoughtful, existential meditation about the meaning of life and what constitutes a life well-lived, Ikiru is almost guaranteed to prod the viewer to examine his or her own mortality and ponder how, in the end, the scales will tip."
    },
    {
      "publisher": "LarsenOnFilm",
      "author": "Josh Larsen",
      "link": "http://www.larsenonfilm.com/ikiru",
      "rate": "100",
      "content": "The genius of Akira Kurosawa’s Ikiru is the way this deeply sentimental film continually deflates sentimentality."
    },
    {
      "publisher": "",
      "author": "Total Film",
      "link": "https://www.gamesradar.com/ikiru-review/",
      "rate": "100",
      "content": "This is the flip side to his samurai films, an introspective, naturalistic contemporary drama combining progressive social criticism with a universal humanist message."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1951/film/reviews/ikiru-1200417247/",
      "rate": "90",
      "content": "Kurosawa performs a tour-de-force in keeping a dramatic thread throughout and avoiding the mawkish. It is technically excellent with a telling Occidental-type musical score."
    },
    {
      "publisher": "Time Out",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "Kurosawa’s eclectic style is a delight: his striking, varied compositions reflecting the old man’s journey from darkness to some kind of light right until the moving finale."
    },
    {
      "publisher": "New York Daily News",
      "author": "",
      "link": "",
      "rate": "75",
      "content": "Akira Kurosawa's talent for analysis, interpretation and projection is again apparent in \"To Live.\" [30 Jan 1960, p.22]"
    },
    {
      "publisher": "Slant Magazine",
      "author": "Clayton Dillard",
      "link": "",
      "rate": "75",
      "content": "Ikiru wows for its complicated interrogation (and innovation) of subjective, cinematic experiences of time and memory, but lulls in its commemoration of a wealthy, privileged man who finally decides to care after it’s absolutely confirmed he has no time left to live."
    },
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://www.nytimes.com/1960/01/30/archives/screen-drama-imported-from-japanikiru-has-premiere-at-the-little.html",
      "rate": "70",
      "content": "If it weren't so confused in its story-telling, it would be one of the major postwar films from Japan. As it stands, it is a strangely fascinating and affecting film, up to a point—that being the point where it consigns its aged hero to the great beyond."
    }
  ],
  "errorMessage": ""
}