{
  "imDbId": "tt0044741",
  "title": "Ikiru",
  "fullTitle": "Ikiru (1952)",
  "type": "Movie",
  "year": "1952",
  "items": [
    {
      "username": "OttoVonB",
      "userUrl": "https://www.imdb.com/user/ur1559834",
      "reviewLink": "https://www.imdb.com/review/rw0047035",
      "warningSpoilers": false,
      "date": "11 January 2003",
      "rate": "10",
      "helpful": "203 out of 222 found this helpful.",
      "title": "\"Only when he learned he would die did he start to live!\"",
      "content": "Ikiru (\"to live\")is a Kurosawa film devoid of samurai or Toshiro Mifune. It is an oddity in his canon, neither an adaptation, nor an epic, or even a detective story. Instead, it is the simple and touching story of the last months of the life of a man, Watanabbe, public official, who decides to give a meaning to his life by transcending the obtuse and stiff mind of government bureaucracy to get a small public children's park built. As a parable for the soulless workings of modern bureaucracy, the goal is set pretty high, and Kurosawa goes even further, giving this story a lot of character, frequent humor, life and, most of all, heart. And going beyond the strengths of the direction and script, is the central performance by Takashi Shimura (later Kambei in Seven Samurai). Shimura gives his character such a transparently good heart and such great pain that every second of Watanabe's plight and struggle tugs at your heart, not in an overwhelmingly sentimental manner, but in one than feels honest and pure. If even many hardened souls will be drawn to tears, it is not for pity, but, admirably, because of envy for Watanabe's beautiful human dignity in the end, and for a film to have such power is beyond pure accomplishment, as the need to see this and, more importantly, feel it, goes beyond pure necessity..."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0047044",
      "warningSpoilers": false,
      "date": "19 May 2004",
      "rate": "10",
      "helpful": "97 out of 116 found this helpful.",
      "title": "a cinematic experience that's a near-nexus of existentialism- life, living, dying, death, and can be done while alive- remarkable",
      "content": "Akira Kurosawa knew how to get in touch with human nature through his art. With his visual expressiveness and storytelling, he could pierce through his subjects, even in his big and occasionally comical samurai films, and find the elemental things do work. What he probably learned off of Rashomon probably helped out with Ikiru (To Live), a story of an old man who finds out he will die within a year, as both stories deal with perceptions of the significance of a life spent and a life wasted. Though that was to a different degree in Rashomon, with Ikiru Kurosawa expands into full-on existentialism. The old man Kanji Watanabe (in a wholly believable and often heart-breaking performance by Takashi Shimura) knows his life hasn't amounted to much as a (chief) clerk for the city. He knows he hasn't had a great kinship with his son. He's accepting his fate with a heavy soul. One of the tenets of existentialism is that there's free-will, and the responsibility to accept what is done with one's life. Kurosawa might've (as I speculate, I don't entirely know) caught onto this for his lead, and it works, especially with the little details.Such little details, unforgettable ones, have been expounded upon by other reviewers and critics, such as the drunken, sullen singing of \"Life is short, fall in love my maiden\" in the bar. A scene like that almost speaks for itself and yet it's also subtle. But one scene that had me was one not too many talk about. It's when Watanabe is in the Deputy Mayor's office, asking for permission so that a park can be built. At first the Mayor ignores him, but then Watanabe begs, but not in a way that manipulates the audience for sympathy with the old man. The mayor must be sensing something in his eyes, desperate and weak, however determined, and it's something that probably most of the audience can identify with as well, even if they don't entirely identify with the character.But aside from the emotional impact Ikiru can have on a viewer, composition-wise (with the help of Asakazu Nakai, wonderful cinematographer on less than a dozen Kurosawa films) and editing-wise the film is ahead of its time and another example of Kurosawa's intuitive eye. There are some to-tomy shots sometimes (which could be called typical via master Ozu or other), but everything appears so precise on a first viewing, so descriptive. I think I almost can't go into all of them without a repeat viewing, but there were two that are still fresh in me. The first was right as Watanabe was about to sing in the bar, and there were these bead-strings looming in front of the camera. Perhaps mysterious, but definitely evocative. The other was when Watanabe and one of the other clerks are on a bridge during a dark part of the day. Both characters are in silhouette, and Watanabe gives an indication to the character that he will die soon. But for me, I wasn't even paying a terrible amount of attention to the words. The way the two are lit as they are, with the light in the background and darkness in the foreground, it could maybe give an indication of what Kurosawa's trying to say: we're all not in the light of life, but it doesn't have to be an entire down-ward spiral if the will is good. Whether you're into philosophy (ies) or not, Ikiru won't disappoint newcomers to Kurosawa via his action pictures. A+"
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw2139951",
      "warningSpoilers": false,
      "date": "12 October 2009",
      "rate": "9",
      "helpful": "18 out of 20 found this helpful.",
      "title": "The Older You Get, the More It Means",
      "content": "I too have seen all the Samurai films. It was gratifying to watch this tender little film. How would we act if we knew when the end was coming? There are so many terrifying and tender moments in this film. The scenes with the young office mate went from charming to cold-- we knew there was no more than companionship, but she can't really even give him that anymore. The scene when he is about to tell his son about his condition and the young man goes off on a rant about how embarrassingly his father has been acting actually brought me to tears. Of course, it's the price he pays for his cold distance all those years. Then there's the whole bureaucratic nightmare of the office. Even at the wake they don't want to give credit. All the buck passers want a share of his legacy. Maybe families who are living on the edge should watch this movie. Even after more than 50 years, it wears extremely well."
    },
    {
      "username": "The_Void",
      "userUrl": "https://www.imdb.com/user/ur2248099",
      "reviewLink": "https://www.imdb.com/review/rw0979541",
      "warningSpoilers": false,
      "date": "16 December 2004",
      "rate": "8",
      "helpful": "83 out of 105 found this helpful.",
      "title": "Complex and thought-provoking masterpiece",
      "content": "Ikiru is a film about life. Constantly complex and thought-provoking, although simple at the same time; it tells a story about life's limits, how we perceive life and the fact that life is short and not to be wasted. Our hero is Kanji Watanabe, the most unlikely 'hero' of all time. He works in a dreary city office, where nothing happens and it's all very meaningless. Watanabe is particularly boring, which has lead to him being nicknamed 'The Mummy' by a fellow worker. He later learns that he is dying from stomach cancer and that he only has six months to live. But Watanabe has been dead for thirty years, and now that he's learned that his life has a limit; it's time for Watanabe to escape his dreary life and finally start living. What follows is probably the most thoughtful analysis of life ever filmed.Ikiru marks a departure for Akira Kurosawa, a man better known for his samurai films, but it's a welcome departure in my opinion. Kurosawa constantly refers to Watanabe as 'our hero' throughout the film, and at first this struck me as rather odd because, as I've mentioned, he's probably the least likely hero that Kurosawa has ever directed; but that's just it! This man is not a superhero samurai, but rather an ordinary guy that decides he doesn't want to be useless anymore. That's why he's 'our hero'. Kurosawa makes us feel for the character every moment he's on screen - we're sorry that he's wasted his life, and we're sorry that his wasted life is about to be cruelly cut short. However, despite the bleak and miserable facade that this movie gives out, there is a distinct beauty about it that shines through. The beauty emits from the way that Watanabe tries to redeem his life; because we feel for him and are with him every step of the way, it's easy to see why Watanabe acts in the way he does. Ikiru is a psychologically beautiful film.It could be said that the fantastic first hour and a half is let down by a more politically based final third - and this is true. The movie needs it's final third in order to finish telling the story, but it really doesn't work as well as the earlier parts did. However, Kurosawa still delights us with some brilliant imagery and the shot of Watanabe on a swing is the most poetically brilliant thing that Kurosawa ever filmed. Together with the music and the rest of the film that you've seen so far; that picture that Kurosawa gives us is as moving as it is brilliant."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw3631715",
      "warningSpoilers": true,
      "date": "2 February 2017",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "death exposes life and bureaucracy, showing why Kurosawa was one of the greatest",
      "content": "Any film buff is bound to have heard of Akira Kurosawa, and likely knows his most famous movies (\"Rashomon\", \"Seven Samurai\", etc). But there's a lesser known one that's just as good. 1952's \"Ikiru\" focuses on the approaching death of government bureaucrat Kanji Watanabe, and how it turns into a quest for his life's meaning. After an introduction in which the protagonist's cancer gets addressed - complete with an X ray of it - we see a sequence where several people try to bring attention to a cesspool that they want cleared, but the sheer level of bureaucracy prevents any action (and Japan is supposed to be the most well run country in the world). But probably the most important scene is at the Watanabe's wake. The attendees are supposed to praise him, but one person addresses an unpleasant topic and gets chastised by his peers. Even as these men vow to live their lives with the same dedication that the deceased did, it's clear that the bureaucracy will continue to plague their lives.While an obvious indictment of bureaucracy, the movie also addresses the issue of life and death. Can a person truly live if his job dominates his life? Watanabe sings \"Gondola no Uta\", which references life's brevity. His singing expresses loss. Indeed, Watanabe doesn't have much of a relationship with his son, meaning that the children have faltered in their duty to take care of their parents. All in all, the movie offers a more cynical take on post-war Japan than we're used to. Once again, Kurosawa turned out a masterpiece. I recommend it."
    },
    {
      "username": "Serge_Zehnder",
      "userUrl": "https://www.imdb.com/user/ur0121776",
      "reviewLink": "https://www.imdb.com/review/rw0047045",
      "warningSpoilers": false,
      "date": "11 June 2004",
      "rate": "10",
      "helpful": "138 out of 158 found this helpful.",
      "title": "To Live in Death",
      "content": "Probably one of the most difficult aspects a film like \"Ikiru\" has to overcome is the very rough march of time. To actually find someone these days, let's say a crowd of regular movie-goers to sit down and watch a film about an old Japanese man dying of cancer would be too much to ask.Long held shots, hardly uplifting subject, to westerners very foreign. An array of reasons not to see it. And yet, once you actually start getting into the picture it doesn't let you go. Which is why it may be rightfully considered to be a classic.Of all of Kurosawa's films this is probably the one movie that works perfectly on a universal level. Because at its core it is about one of the most basic desires of human existence...namely to be able to look back on your life and say \"It was worth it.\"In its starch and unforgiving black-and-white form the movie records the time of one man's life in such a beautiful and yes, colorful way, that by the time the final moments of the film play out, it will be very hard for anybody not to be touched. A glorious moment in 20th century cinema, that will hopefully be preserved for decades to come."
    },
    {
      "username": "will_butler",
      "userUrl": "https://www.imdb.com/user/ur1144899",
      "reviewLink": "https://www.imdb.com/review/rw0047032",
      "warningSpoilers": false,
      "date": "21 October 2002",
      "rate": "10",
      "helpful": "144 out of 166 found this helpful.",
      "title": "The most moving and human film I have ever seen.",
      "content": "I can safely say that I have seen no finer film than Kurosawa's true masterpiece, Ikiru. The story of a dying petty bureaucrat in 1950's Japan, Ikiru is as uncompromisingly honest and beautiful a film as has ever been made on the subject of life. Kurosawa elevates a story that could have been simple melodrama to the level of masterwork with a genuine love of his characters, and with an incredible technical direction. The film's structure accentuates and deepens its many, many lessons on life, and the performances, including a heartbreakingly earnest turn by Shimura are all flawless.In short, Ikiru is easily one of the greatest works committed to film, and no discerning film aficionado should avoid experiencing it. Had Kurosawa directed only this film, it would still be enough to include him in the pantheon of the greatest storytellers who ever lived. Fortunately for us, it is simply the pinnacle of a staggeringly amazing career. It is the absolute definition of a 10/10 film."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2628879",
      "warningSpoilers": false,
      "date": "17 June 2012",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Kurasawa's most moving film",
      "content": "As a great fan of Akira Kurasawa, Ikiru is not just Kurasawa's most moving film it is one of his very finest alongside Seven Samurai and Ran. It is as always beautifully made, sumptuous in look and the cinematography simple yet interesting. Kurasawa's direction is at its most delicate, making a story that could easily be mawkish and manipulative into a genuinely moving, powerful and quite inspiring one instead, and making us also care every step of the way for the dignified central character of Watanabe. Together with a hypnotic score, a thought-provoking script and a powerful, yet in a discreet and heart-wrenching way, lead performance from Takeshi Shimura, and you have a fantastic film.Overall, I can't praise Ikiru enough. Any complaints of how the final third is not as good as the rest of the movie is valid but I didn't care so much after being moved and inspired so much by the film. 10/10 Bethany Cox"
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw3608385",
      "warningSpoilers": false,
      "date": "29 December 2016",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Truly a masterpiece",
      "content": "Kanji Watanabe is a civil servant. He has worked in the same department for 30 years. His life is pretty boring and monotonous, though he once used to have passion and drive. Then one day he discovers that he has stomach cancer and has less than a year to live. After the initial depression he sets about living for the first time in over 20 years. Then he realises that his limited time left is not just for living life to the full but to leave something meaningful behind...Written and directed by the legendary Akira Kurosawa, this is his magnum opus. Yes, Seven Samurai, Rashomon or Yojimbo might be more popular or more critically acclaimed but this, for me, is his greatest work.Incredibly profound and thought-provoking, examining life and living it plus death and what you leave behind. Also takes a dig at politicians and the wastefulness of the civil service.Very engaging too: characters are well-formed and develop throughout the movie. Moreover we empathise with Watanabe and his issues, issues which are relatable.Highly emotional towards the end too, as we see the impact he has made.A timeless classic."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1115399",
      "warningSpoilers": true,
      "date": "30 June 2005",
      "rate": "9",
      "helpful": "11 out of 15 found this helpful.",
      "title": "An incredibly well-written and acted story about the meaning of life",
      "content": "The main character, so ably played in this movie, is an older bureaucrat whose life has little, if any, significance. After 30 years on the job, he has little to show for himself. This becomes very apparent once he finds out that he is dying from stomach cancer and has only months to live.Now, so far, this does NOT sound like a movie most people would want to see. However, instead of dwelling on death and the meaningless of life, Kurasawa goes beyond that. Much of the movie actually focuses on this man trying to find meaning in his life and ultimately deciding to devote his final days to fighting for the creation of a park in some godforsaken part of Tokyo. Despite a general atmosphere of apathy, he ultimately succeeds in getting the park created.About 2/3 of the way through the picture, the man dies. I thought the movie was over, but then it cuts to a scene at his funeral. A group of bureaucrats and the deputy mayor attend, but few others. What happens next is important, as the movie becomes very philosophical and those in attendance begin to ponder his life and their own as well.In many ways, this movie is both uplifting and cynical. I won't say much more but encourage you to see it for itself. I will say, though, that unlike Bergman's films (which often have talked about death or mental illness), Ikiru is unusual in that it seeks meaning and goes beyond \"life is meaningless and then you die\"."
    },
    {
      "username": "PureCinema",
      "userUrl": "https://www.imdb.com/user/ur0092583",
      "reviewLink": "https://www.imdb.com/review/rw0047021",
      "warningSpoilers": true,
      "date": "26 December 1998",
      "rate": "10",
      "helpful": "68 out of 86 found this helpful.",
      "title": "Not just a film, but an incredible learning experience",
      "content": "A quiet, but very moving film. Kanji Watanabe (Takashi Shimura) is a clerk who has been living a dull, unsatisfying life working in the government's offices who is diagnosed with cancer and is given one year to live. He tries to enjoy his days by picking up a former co-worker (Miki Odagiri) and taking her out on the town. She finally convinces him that this is not the way to spend the rest of his life. He soon realizes that he has a strong desire to do something with his life so that it will not have been a total waste. Therefore he begins to work in cooperation with the people... accomplishing something that nobody in the office had the nerve to do before.I consider Ikiru to be Kurosawa's first truly excellent film. The story moves along very low-key and we gradually realize the power and emotion that is in this great film. Roger Ebert said of Ikiru that it is one of the few films that can actually change the way you look at life after watching it."
    },
    {
      "username": "wobelix",
      "userUrl": "https://www.imdb.com/user/ur1219929",
      "reviewLink": "https://www.imdb.com/review/rw0047048",
      "warningSpoilers": false,
      "date": "29 August 2004",
      "rate": "10",
      "helpful": "64 out of 85 found this helpful.",
      "title": "Kurosawa is Kafka going Kawabata...",
      "content": "Being one of the Founding Fathers of Cinema, Kurosawa shines to all directions. In his diverse oeuvre it is hard, if not impossible, to find a weak work.Ikiru is the most humane film of this grand Humanist. Kurosawa's story telling skills are sublime, and he has surpassed himself with this movie.The slow pace and ditto camera movements (except in the night with 'Mephistofeles' where all is logically much more frantic) enhances the story superbly. What a pity some of the nowadays public can't find the tranquility and maybe serenity to watch a gorgeous film like that. That part of the movie lovers will miss a brilliant film, that would have lingered in the mind forever..."
    },
    {
      "username": "Brave Sir Robin",
      "userUrl": "https://www.imdb.com/user/ur1451145",
      "reviewLink": "https://www.imdb.com/review/rw0987831",
      "warningSpoilers": false,
      "date": "29 December 2004",
      "rate": "10",
      "helpful": "137 out of 177 found this helpful.",
      "title": "Simply Brilliant - Kurosawa's Greatest",
      "content": "Kanji Watanabi is a quiet, melancholy man who has spent all his life behind his office desk doing sweet eff-all. When he is diagnosed with stomach cancer he realizes that he has been petty much dead his whole life, and searches desperately for away to live again.This is Akira Kurosawa's masterpiece, yes, even better than Rashomon and The Seven Samauri. It is a perfect true story of everybody's life- how we don't even realize we have it until we know it will be over in a short while. Watanabi's quest for self-discovery is one of the greatest from any motion picture ever made. The all-too-true paradox is one to end all paradoxes- that Watanabi is dead, and had been all his life, until he realized he was sick, which is when he began living for the first time. Takashi Shimura, the actor best known for his role as the wise, bald-headed Samauri in The Seven Samauri, and the professor out of the early Godzilla films, plays Watanabi perfectly- in my mind, it's one of the greatest film performances of all time. Not everyone will love this movie. It was made a long time ago, the main character is an old fogey, it has subtitles, and it's pretty long. Many people today, especially young kids, would find it boring. Well, let 'em. There's no need to worry about them, they'll always have Pirates of the Carribbean, they'll always have The Matrix. Leave Ikiru and films like it to the true lovers of cinema."
    },
    {
      "username": "Raff-3",
      "userUrl": "https://www.imdb.com/user/ur0184179",
      "reviewLink": "https://www.imdb.com/review/rw0047012",
      "warningSpoilers": false,
      "date": "18 December 1998",
      "rate": "",
      "helpful": "76 out of 88 found this helpful.",
      "title": "Beautiful & touching, also very clever",
      "content": "This film touched me in a way no other film has. Filmed in black and white and gorgeous, both in the visuals and in how the story unfolds. Behold the clever manner of gradually unfolding the story as people jog each other's memories at his funeral (an obligation for them, that gradually turns into a real eulogy). Everything is told in flashbacks: the mourners' memories unfold naturally, as people remember what the man did and struggle to comprehend why.This film I would nominate for the golden five of the century!I first saw it in 1956 or so at a small theater in downtown Chicago. A second viewing, years later, confirmed my initial pleasure!"
    },
    {
      "username": "tomgillespie2002",
      "userUrl": "https://www.imdb.com/user/ur3741220",
      "reviewLink": "https://www.imdb.com/review/rw2935624",
      "warningSpoilers": false,
      "date": "5 January 2014",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Kurosawa's greatest achievement",
      "content": "As difficult as some Japanese films can be, Akira Kurosawa was always welcomed by Western audiences due to the director's embracing of the cinematic, as opposed to, say, the static, conversation-heavy work of Yasujiro Ozu. Still known primarily for his samurai action films and his film noir homages, Kurosawa's movies were action-packed and grandiose, shot beautifully through a lens that brings to mind the great American westerns or the shadowy mise-en-scene of Orson Welles, making them almost Western in tone. Ikiru, one of Kurosawa's most spiritual and tonally dark films, took a few years to make it across Pacific Ocean, and it's not hard to see why. Although, in my opinion, this is probably Kurosawa's greatest achievement, the subject matter is sobering, it's satire alarming and it's story-telling techniques unconventional.The film opens with an X-ray of our protagonist, Watanabe (Takashi Shimura). The narrator tells us he has stomach cancer, but he does not yet know this, and so we join him, reluctantly, as he goes about stamping his papers in his stagnating job as a bureaucrat. Quiet and eternally hunched, Watanabe is an introverted man, spending little of what he earns to the frustration of his selfish son. When he learns that he has only about a year to live, Watanabe goes through the familiar stages of acceptance as he drinks, parties, fails to turn up for work, becomes involved with a much younger woman and angers his family. But he soon turns his attention to building a children's playground, a project he has seen passed around by the many pencil-pushers in the various departments within the council he works for, which has frustrated the residents of the decaying area.It's with this shift of focus that comes the true masterstroke of Ikiru. Up to this point, we have been with Watanabe every step of the way, but suddenly, as the narrator informs us, he's dead. We no longer get the first-person perspective, but the third-person perspective, as various colleagues and political players gather for Watanabe's funeral. The film becomes less a human drama, and more of a social-political statement, as the other dead-eyed civil servant's in his office slowly come to realise the greatness of the man. The deputy mayor is there, claiming Watanabe's work was within the confines of his job and proving the bureaucratic machine works. This, of course, is simple electioneering, but the others reminisce and the truth begins to slowly reveal itself in the final months of Watanabe's life.A lot of the film relies on the performance of Shimura, a long-time collaborator with Kurosawa. He is utterly magnetic here, remaining a hushed presence and developing his persona into a weapon to ensure his work gets done before he bites the bullet. In a heart-breaking moment, he croaks a quiet song in a packed bar for it to fall silent. The young hipsters slowly move away, while Watanabe's companion, a booze-addled writer, looks emotional. Kurosawa, only 40 at the time, was also making a comment on the post-war social outcasting of the elderly, embodied in the aforementioned bar scene and in Watanabe's success and money-drive son. Ikiru is many things, but it's the humanity of the story that will linger on in your mind after the credits have rolled, and it ends with one of the finest closing shots in history.www.the-wrath-of-blog.blogspot.com"
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw1184272",
      "warningSpoilers": false,
      "date": "1 October 2005",
      "rate": "9",
      "helpful": "11 out of 16 found this helpful.",
      "title": "Never is too Late to Live, Watch the Sunset and Plant a Seed of Love",
      "content": "In a Post-War Tokyo, when the bureaucratic chief of department of the City Hall Kanji Watanabe (Takashi Shimura) finds that he has a terminal cancer, he decides to intensively live his last months of life. While dying, he finds the meaning of life, and fights for the construction of a playground in a poor zone of the city and the legacy of his existence.\"Ikiru\" is another beautiful movie of Master Akira Kurosawa. The story is very touching and shows the lifestyle of Japan in the 50's. The performance of Takashi Shimura is amazing and heartbreaking, in the role of a man that finds that he spent his life for nothing: his son, motive of his sacrifice, does not care for him and his unproductive job does nothing but useless paperwork and a pejorative nickname of \"Mummy\". In the end, a wonderful message that never is too late to live, watch the sunset and plant a seed of love. My vote is nine.Title (Brazil): \"Viver\" (\"To Live\")"
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw1167628",
      "warningSpoilers": false,
      "date": "7 September 2005",
      "rate": "10",
      "helpful": "15 out of 21 found this helpful.",
      "title": "\"I am not angry with anyone, I have no time for that\"",
      "content": "There are good, very good, and even great movies. But among them there are just a few that go beyond great. They belong to the league of their own. Akira Kurosawa's \"Ikiru\" (To Live), 1952, is one of them. The film of rare humanity, profoundly moving and often funny \"Ikiru\" tells the story of a dying man's last crusade that turned out to be his triumph, the best thing he had ever done in his life; something he will be remembered for. The film reveals both absurdity of life and the ability of man to find meaning in it through selfless action.Two years before he played the tough lead in \"Seven Samurai\", Takashi Shimara gave even finer performance in a very different role as a government bureaucrat Kanji Watanabe who seemed to lead a life of quiet desperation at his job and at home. Then, he learns that he has terminal cancer and faced with the fact of death, he first tries to take from life as much as possible and spends the half of his savings on gambling, drinking and women. It leads him nowhere and gradually he determines to achieve one good thing before he dies, and settles on converting a junkyard into a playground for children. Rather than make a feel good movie with co-workers helping Kanji Watanabe in his quest and his family around him at his last moment, Kurosawa portrays him as a lonely crusader. No one can understand why this park is so important to him. The answer is very simple, he does not have time and he wants to live to see the park open. His family and co-workers don't even know how ill he is, and that makes some scenes even more powerful and poignant. His words, \"I am not angry with anyone, I have no time for that\", the look at his face when asked by a mafia member if he did not care for his life - these scenes are heartbreaking. The film has many quiet but compelling moments like these.For me, watching \"Ikiru\" was as close to earth shattering experience as it goes. I think it is one of very few films that could really change one's life. I could not help comparing it to \"Cries and Whispers\" - how devastated I was by the theme of inevitable death, how ugly it is, and how helpless we all are while facing it. \"Ikiru\" is about a dying man, too, but how hopeful and life affirming it is. The film did not tell or teach me something I had not known before but it confirmed once more that it is never too late to do something even if you have only few months to live."
    },
    {
      "username": "bretttaylor-04022",
      "userUrl": "https://www.imdb.com/user/ur77212199",
      "reviewLink": "https://www.imdb.com/review/rw8150496",
      "warningSpoilers": true,
      "date": "17 May 2022",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Life is brief",
      "content": "Wow this has made me question my own life. Am I living my life to the full? Is reviewing films at 2am in the Morning on IMDB n the hope of getting two people to find my review helpful a waste of time?Bureaucracy is the enemy here. This passing around responsibility and never actually getting anything done.Great leading performance and also a great look at what everyday life was like in early 50s Japan."
    },
    {
      "username": "Butch-Higgins",
      "userUrl": "https://www.imdb.com/user/ur2336703",
      "reviewLink": "https://www.imdb.com/review/rw0047040",
      "warningSpoilers": false,
      "date": "16 October 2003",
      "rate": "",
      "helpful": "58 out of 76 found this helpful.",
      "title": "A cinematic tour de force",
      "content": "\"Ikiru\" is supposedly one of Steven Spielberg's favourite films, and one can see the influence it's had on him not only in the sentimentality and the ultimate \"feelgood factor\" (which may be a little too extreme for some viewers, although the script never condescends), but visually, especially in the virtuoso sequence in which a reprobate leads our hero, a respectable and dull civil servant, on a whirlwind tour of Tokyo's frenzied nightlife - a masterpiece of camera placement and editing. With images throughout that will stay with you for a long time, and a terrific supporting performance by Miki Odagiri as a vivacious young \"office lady\", \"Ikiru\" is still an absolute knockout more than 50 years on."
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw1194644",
      "warningSpoilers": false,
      "date": "16 October 2005",
      "rate": "10",
      "helpful": "7 out of 10 found this helpful.",
      "title": "The affirmation of life through the exploration of death. A powerful film.",
      "content": "\"Ikiru\" is a film that expresses itself through two separate parts. The first half is the exploration of a bitter man's death and the second half is an affirmation of life provided through the awareness of mortality, recalled by those whom he knew best.Kanji Watanabe (Takashi Shimura) is the protagonist of the story, a bureaucrat whose job provides him with little more than paper-shuffling and pen-pushing.The movie opens with an x-ray of Watanabe's stomach and the cancer that thrives within it. His doctor tells him he will die soon.Throughout the first half of the film, Watanabe stumbles about helplessly, remembering his life and trying to figure out what has come of it. He lives with his son, whose resentment for his own father has peaked over the years.Watanabe realizes no one in his life actually knows or loves him. He walks about in a permanent stupor of self-loathing. He embarks on a friendship with a younger female co-worker, but even she soon hates him and thinks he is \"creepy.\" Towards the end of the film, Watanabe finally dies and the second half is the recounting of his final days by co-workers. We realize Watanabe's life changed drastically towards the end and he dedicated his final days to the construction of a playground for children.The Criterion DVD is excellent, and inside is an essay written by a Kurosawa biographer. He notes that the film is a study of existentialism and mirrors a few themes from Orson Welles' \"Citizen Kane,\" which is true - I was very much reminded of Welles' film at certain moments throughout \"Ikiru.\" Both films offer solid examinations of life and death and what propels the man stuck in between - in both cases the cruelties of life broke apart the men, leaving hollow shells where souls once existed. In Watanabe's case, his seeking of his own soul finally brings him to a state of contentment and inner satisfaction - his death is, at the beginning of the film, a lingering doom; and at the end a peaceful pact.This movie can change the way you look at life if you open your eyes. Kurosawa might have made better films but \"Ikiru\" is his most emotionally resonant and powerful that I've seen."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw2294150",
      "warningSpoilers": false,
      "date": "11 August 2010",
      "rate": "10",
      "helpful": "5 out of 7 found this helpful.",
      "title": "A true masterpiece",
      "content": "Still let me begin with maybe one of the things that seem to work the least. The ending or should I say \"the endings\". I'm not going to spoil the ending of course, but if you thought Lord of the Rings (3) had too many endings, you could be excused feeling the same (or worse) with Ikiru here.But if you really think about it, even this minor flaw is necessary in the eyes of Kurusawa and therefor as he deemed it rounded up the story, agree with him or not, but it does take the movie to another level. If you are willing to go there and still have the strength to go there, you will be rewarded.But then again, the whole movie is a great experience. And while in other hands this could have become a very muddled affair, trying to push on the morals. A true masterpiece."
    },
    {
      "username": "Polaris_DiB",
      "userUrl": "https://www.imdb.com/user/ur5232724",
      "reviewLink": "https://www.imdb.com/review/rw1622037",
      "warningSpoilers": true,
      "date": "21 March 2007",
      "rate": "10",
      "helpful": "6 out of 8 found this helpful.",
      "title": "3 approaches",
      "content": "This movie can almost be considered three different movies, as each act contains its own very different approach to the drama of a bureaucrat affected with a lethal cancer and a sudden need for life.The first part is the most self-consciously cinematic, containing the most amounts of wipes, fades, dissolves, flash-backs, and even voice-over of the entire production. Akira Kurosawa backs up the introduction of a lifeless person with stunning set design and deep focus throughout, but these features in conjunction with the cinematic processes described provide a rich and layered detailing of something that normally would be very tedious to watch. This, then, is when Watanabe is still alive. However, he lives while he's dead.The second part, or middle act, is after he discovers his illness and learns that there's no hope for his life nor comfort from his family. 3's appear throughout this work (and Kurosawa was always fond of triangles), and this fateful number appears in the different ways Watanabe attempts to find \"life\"... first is the attempt to live it up in a disturbingly entrapped and claustrophobic Westernized style life (the bitter imagery in conjunction with the bureaucratic theme makes this movie a rather vehement protest against Westernization in Japan). Unfufilled by that, he then attempts to live vicariously through an energetic ex-coworker. After that relationship turns sour, he takes her advice to try to \"make something\" for the world. This part of the movie is the most directly narrative. The film-making is a little more reserved, and it is used transparently to detail the slowly ailing life and the obsession for hope the character has. This is his mis-guided struggle for life, but also contains a scene wherein he is pretty much \"born again\" (the characters in the background singing the happy birthday song don't know it's for him).The third part is a narrative-within-a-narrative, as all of the characters from earlier in the film (save the energetic young woman and the Mephistopheles-like poet) come to reminisce about Watanabe, and in the process begin to understand how much he was actually able to do. Now the story is being told from a completely different perspective, Watanabe isn't even there, and yet... now he's finally alive, as his legacy and his presence is respected by everyone (either immediately or gradually). The narrative-within-a-narrative approach helps to put the audience in the place of the bureaucrats who try to take credit for Watanabe's success. After they promise themselves to become better people and save the world (don't we all after narratives like this?), they soon get sucked back into their real lives, showing that it is not one's intentions, but one's actions that truly define what it is \"to live.\" As usual, Kurosawa shows his skills of consummate artistry, but this time he shows an acute structural approach that transcends narrative to create a rather poignant and undidactic theme. And best of all, he never falls into sentimentality.--PolarisDiB"
    },
    {
      "username": "danstephan3000",
      "userUrl": "https://www.imdb.com/user/ur3954222",
      "reviewLink": "https://www.imdb.com/review/rw0047049",
      "warningSpoilers": true,
      "date": "14 September 2004",
      "rate": "10",
      "helpful": "20 out of 26 found this helpful.",
      "title": "Coming Alive",
      "content": "'Ikuru' (Japanese for 'To Live') was one of Kurosawa's personal favorites. Prominent film critics worldwide put it, along with \"Seven Samurai\" and \"Rashomon\", on their lists of the best films ever made by anyone. When first shown in the USA during the 1950's , all three quickly earned widespread critical acclaim and strong patronage. USA film enthusiasts by then had clearly grown weary of the tired formulas followed by Hollywood studios in the timid post-war years. They welcomed the more thoughtful and challenging films from Kurosawa and from other acclaimed film directors in Japan (Ozu and Misoguchi), Italy (Rosselini, De Sica), France (Troufault, Bresson), and England (Lean). All of these great film directors were also able to hold and move their audiences while developing somber themes. 'Ikuru', however, is even more deeply philosophical than any other film that I recall by asking what is needed for us 'to live' well.Takashi Shimura gives an absolutely convincing performance of a tired old man, numb and alone. After learning he has terminal cancer, he learns that dissipation offers no solution. Then he clings to a cute, vivacious girl, taking her to shops and restaurants. She wearies of his dreary, cringing manner but agrees to have one more dinner together. In the powerful climactic scene at the restaurant, he learns why she is happy in her new job packaging toys. 'I feel all the babies in Japan are my friends!!' This gives him an idea. He, too, can do something to help children. 'There's still time!!', he cries, and runs off while she stares in bewilderment. He keeps moving quickly towards his cheerful new life. Shimura reminded me of Albert Camus' essay 'The Myth of Sisyphus.' Sisyphus plods off to yet another day of struggle but has won over the gods, after all, because he is aware of his quest. 'We must imagine Sisyphus happy,' urges Camus. We must also feel the same for the old man in Ikuru when we see how he is reborn and truly alive for the first time."
    },
    {
      "username": "treywillwest",
      "userUrl": "https://www.imdb.com/user/ur27345788",
      "reviewLink": "https://www.imdb.com/review/rw6889472",
      "warningSpoilers": false,
      "date": "8 May 2021",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "nope",
      "content": "This justly celebrated work is often considered uncharacteristic of its auteur. I've heard it said that it more resembles an Ozu, than a Kurosawa film. I would argue that the only way in which it is un-Kurosawaian is in its subject matter, and even in this respect only superficially so.It has become a cliche to say that of the three classic auteurs of Japanese cinema (Kurosawa, Ozu, Mizoguchi) that Ozu was the most \"Japanese\" where as Kurosawa was the most \"western\". The latter claim strikes me as undeniable. Kurosawa's indebtedness to John Ford is frequently apparent. While it does so in an exceptionally powerful manner, \"Ikiru\" treats it's subject in a way that is more characteristic of Hollywood than of Ozuian cinema.Were one to read a simple synopsis of the plot of \"Ikiru\", a bureaucrat in 1950s Tokyo discovers he is dying of stomach cancer, one would not be blamed for imagining the film as uncharacteristic of its director. It in no way deals with violence as do almost all of Kurosawa's period pieces and noirs. However, like Kurosawa's work in general, it approaches its seemingly simple story as a grandiose conflict in which the protagonist overcomes an obstacle to his goal. Indeed, without intending to give too much away, I think it is fair to call the film's protagonist a \"hero\" by the end. The film is unquestionably powerful and moving, profound even, but it achieves its effect by way of the emotionally manipulative machinations of western melodrama. Ozu's work, which often examines the everyday grievances of death and loss, does so with a stoically detached manner that makes his work, in my opinion, deeper than that of Kurosawa.There is another way in which \"Ikiru\" is distinctly Kurosawaian, and that is one which is most particular to the director. As in \"Rashoman\" Kurosawa is boldly experimental in his manipulation of narrative time. Yet even this strikes me as very western. The non-linear telling of the story highlights the emotional impact of certain scenes in a way that is very operatic in a western sense. As I watched \"Ikiru\" it struck me that Kurosawa might be the single most important influence on the work of Quentin Tarantino."
    },
    {
      "username": "PedroPires90",
      "userUrl": "https://www.imdb.com/user/ur26163020",
      "reviewLink": "https://www.imdb.com/review/rw8660555",
      "warningSpoilers": false,
      "date": "7 November 2022",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Masterpiece",
      "content": "For many it was with Seven Samurai, for others with Rashomon (which I also love), but the Kurosawa I was looking for I found in Ikiru.It's hard to explain everything the movie represents because so many people tend to only focus on the main themes of the movie - death, wasted time, regret, legacy, the search for something that inspires us - that they forget so much about what the film also has to say about family, rumors, and about not being seen by those around us, even if it is our own son. There is so much that we take for granted in our lives - including our parents - that we can never show how we really feel about everything we encounter in this life. And when we decide to change because of a certain event and then everything remains the same? It takes a lot of strength and courage to change anything.It is here that Ikiru surprised me with all the critics of society, public institutions, and politics. Kurosawa was much more incisive than I expected in that regard, doing it right from the opening scene and carrying those themes with him all the way to the final scene.The performances are always at a very high level, with Takashi Shimura being the highlight with a role that touches us at various levels, not only because we feel his pain, but also because it inspires us the most so we don't waste our whole life as he did. Miki Odagiri as Toyo is also fascinating, and I'm just sad she didn't show up in the third act.Technically, there are beautiful shots at any given time, and of course, when the swing scene arrives, our hearts drop to our feet. Excellent soundtrack and cinematography too.I don't say this often, but this film is, without a doubt, a masterpiece."
    }
  ],
  "errorMessage": ""
}