{
  "imDbId": "tt0044741",
  "title": "Ikiru",
  "fullTitle": "Ikiru (1952)",
  "type": "Movie",
  "year": "1952",
  "language": "en",
  "titleInLanguage": "Ikiru",
  "url": "https://en.wikipedia.org/wiki/Ikiru",
  "plotShort": {
    "plainText": "Ikiru (生きる, \"To Live\") is a 1952 Japanese drama film directed and co-written (with Shinobu Hashimoto and Hideo Oguni) by Akira Kurosawa. The film examines the struggles of a terminally ill Tokyo bureaucrat (played by Takashi Shimura) and his final quest for meaning. The screenplay was partly inspired by Leo Tolstoy's 1886 novella The Death of Ivan Ilyich.\r\nThe major themes of the film include learning how to live, the inefficiency of bureaucracy, and decaying family life in Japan, which have been the subject of analysis by academics and critics. Ikiru has received widespread critical acclaim, and won awards for Best Film at the Kinema Junpo and Mainichi Film Awards. It was remade as a television film in 2007, and adapted into English as Living in 2022.",
    "html": "<p>Ikiru (生きる, \"To Live\") is a 1952 Japanese drama film directed and co-written (with Shinobu Hashimoto and Hideo Oguni) by Akira Kurosawa. The film examines the struggles of a terminally ill Tokyo bureaucrat (played by Takashi Shimura) and his final quest for meaning. The screenplay was partly inspired by Leo Tolstoy's 1886 novella The Death of Ivan Ilyich.</p><p>The major themes of the film include learning how to live, the inefficiency of bureaucracy, and decaying family life in Japan, which have been the subject of analysis by academics and critics. Ikiru has received widespread critical acclaim, and won awards for Best Film at the Kinema Junpo and Mainichi Film Awards. It was remade as a television film in 2007, and adapted into English as Living in 2022.</p>"
  },
  "plotFull": {
    "plainText": "Ikiru (生きる, \"To Live\") is a 1952 Japanese drama film directed and co-written (with Shinobu Hashimoto and Hideo Oguni) by Akira Kurosawa. The film examines the struggles of a terminally ill Tokyo bureaucrat (played by Takashi Shimura) and his final quest for meaning. The screenplay was partly inspired by Leo Tolstoy's 1886 novella The Death of Ivan Ilyich.\r\nThe major themes of the film include learning how to live, the inefficiency of bureaucracy, and decaying family life in Japan, which have been the subject of analysis by academics and critics. Ikiru has received widespread critical acclaim, and won awards for Best Film at the Kinema Junpo and Mainichi Film Awards. It was remade as a television film in 2007, and adapted into English as Living in 2022.\r\nPlot\r\nKanji Watanabe has worked in the same monotonous, bureaucratic position for 30 years, and he is near his retirement. His wife is dead, and his son, Mitsuo, and daughter-in-law, who live with him, seem to care mainly about Watanabe's pension and their future inheritance. At work, he's a party to constant bureaucratic inaction. In one case, a group of parents seemingly endlessly are referred to one department after another when they want a cesspool cleared and replaced by a playground. After learning he has stomach cancer and less than a year to live, Watanabe attempts to come to terms with his impending death. He plans to tell his son about the cancer, but decides against it when his son does not pay attention to him. He then tries to find escape in the pleasures of Tokyo's nightlife, guided by an eccentric novelist whom he has just met. In a nightclub, Watanabe requests a song from the piano player, and sings \"Gondola no Uta\" with great sadness. His singing greatly affects those watching him. After one night submerged in the nightlife, he realizes this is not the solution.\r\nThe following day, Watanabe encounters Toyo, a young female subordinate, who needs his signature on her resignation. He takes comfort in observing her joyous love of life and enthusiasm, and he tries to spend as much time as possible with her. She eventually becomes suspicious of his intentions and grows weary of him. After convincing her to join him for the last time, he becomes opens and asks for the secret to her love of life. She says that she does not know but that she found happiness in her new job making toys, which makes her feel like she is playing with all the children of Japan. Inspired by her, Watanabe realizes that it is not too late for him to do something significant. Like Toyo, he wants to make something, but he is unsure what he can do within the city bureaucracy until he remembers the lobbying for a playground. He surprises everyone by returning to work after a long absence, and he begins pushing for a playground despite concerns that he is intruding on the jurisdiction of other departments.\r\nWatanabe dies, and at his wake, his former co-workers gather, after the opening of the playground, to figure out what caused such a dramatic change in his behavior. His transformation from listless bureaucrat to passionate advocate puzzles them. As the co-workers drink, they slowly realize that Watanabe must have known he was dying, even when his son denies this truth, as he was unaware of his father's condition. They also hear from a witness that, in the last few moments in Watanabe's life, he sat on the swing at the park he built. As the snow fell, he sang \"Gondola no Uta\". The bureaucrats vow to live their lives with the same dedication and passion as he did, but back at work, they lack the courage of their newfound conviction.\r\nCast\r\nTakashi Shimura as Kanji Watanabe\r\nShinichi Himori as Kimura\r\nHaruo Tanaka as Sakai\r\nMinoru Chiaki as Noguchi\r\nBokuzen Hidari as Ohara\r\nMiki Odagiri as Toyo Odagiri, employee\r\nKamatari Fujiwara as Sub-Section Chief Ōno\r\nNobuo Nakamura as Deputy Mayor\r\nYūnosuke Itō as Novelist\r\nMinosuke Yamada as Subordinate Clerk Saito\r\nMakoto Kobori as Kiichi Watanabe, Kanji's Brother\r\nNobuo Kaneko as Mitsuo Watanabe, Kanji's son\r\nAtsushi Watanabe as Patient\r\nNoriko Honma as Housewife\r\nThemes\r\nLiving\r\nDeath is a major theme in the film, which leads to the protagonist Watanabe's quest to find the meaning of life. Initially, Watanabe looks to nightclubs and women to live life to the fullest, but winds up singing the 1915 song \"Gondola no Uta\" as an expression of loss. Professor Alexander Sesonske writes that in the nightclub scene, Watanabe realizes that \"pleasure is not life\" and that a goal gives him new happiness, with the song \"Happy Birthday to You\" symbolizing his rebirth. Because Toyo is young, she has the best insight as to how to live, and she is presented as the \"unlikely savior\" in Watanabe's \"redemption.\"\r\nAuthor Donald Richie wrote that the title of the film, meaning simply \"to live,\" could signify that \"existence is enough.\" However, Watanabe finds existence is painful, and he takes this idea as inspiration, wanting to ensure his life has not been futile. The justification of his life, found in his park, is how Watanabe discovered how \"to live.\" In the end, Watanabe now sings \"Gondola no Uta\" with great contentment.\r\nBureaucracy\r\nIkiru is also an \"indictment of Japanese bureaucracy.\" In Japan after World War II, it was expected that the sararīman (salary man) would work predictably in accordance with an organization's rules. The scene where the mothers first visit the city office requesting a playground shows \"unconcern\" in the bureaucrats, who send the visitors on a \"farcical runaround,\" then ask them for a written request, with paperwork in the film as symbols of \"meaningless activity.\" However, Watanabe uses the bureaucracy to forge his legacy, and apparently he is not disturbed when the bureaucracy quickly forgets he drove the project to build the playground.\r\nJapanese health care is depicted as overly bureaucratic in the film when Watanabe visits a clinic in a \"poignant\" scene. The doctor is portrayed as paternalistic, and Watanabe does not stand up to his authority.\r\nFamily life\r\nAuthor Timothy Iles writes that, as with Yasujirō Ozu's 1953 film Tokyo Story, Ikiru may hold a negative view about the state of family life in modern Japan. Watanabe has lived with his son for years, but they have fallen out of any true relationship. His son Mitsuo sees Watanabe as a bother and regards him as only an obstacle to his obtaining the money from Watanabe's will. The children fall short of their responsibility to respect their parents.\r\nUrbanization may be a reason for negative changes in Japanese society, but a reason for Watanabe and Mitsuo's drift is Watanabe's preoccupation with work. Another reason is Watanabe's not being with Mitsuo during a medical treatment when the boy was 10, which fits a pattern in Kurosawa's films of sons being overly harsh to their fathers.\r\nProduction\r\nThe film marked the first collaboration between director Akira Kurosawa and screenwriter Hideo Oguni. According to Oguni, the genesis of the film was Kurosawa's desire to make a film about a man who knows he is going to die and who wants a reason to live for a short time. Oguni was an experienced writer and was offered ¥500,000, and co-writer Shinobu Hashimoto was offered ¥150,000. Initially, Kurosawa told Hashimoto that a man who was set to die in 75 days had to be the theme and that the character's career was less important, with the director saying criminal, homeless man or government minister would be acceptable.\r\nThe screenwriters consulted Leo Tolstoy's novella The Death of Ivan Ilyich, and Oguni envisioned placing Watanabe's death halfway through the film. Kurosawa dictated the scene where Watanabe is on the swing and mentioned the beginning lyrics of \"Gondola no Uta.\" Because none of the men were familiar with the song, they consulted their eldest receptionist on the rest of the lyrics and the song title.\r\nKurosawa renamed the draft The Life of Kanji Watanabe to Ikiru, which Hashimoto found pretentious, but Oguni supported. The screenplay was completed on 5 February 1952.\r\nRelease\r\nIn Japan, Toho released the film on 9 October 1952. The film was screened in the 1954 Berlin International Film Festival.\r\nIn the United States, the film was shown for a short time in California in 1956 under the title Doomed. It opened as Ikiru in New York City on 29 January 1960. The film poster featured the stripper seen briefly in the film rather than Watanabe.\r\nReception\r\nCritical reception\r\nThe film won critical approval upon its release. Bosley Crowther, writing for The New York Times, called it \"a strangely fascinating and affecting film, up to a point—that being the point where it consigns its aged hero to the great beyond,\" which he deemed \"anticlimactic.\" Crowther praised Shimura, writing he \"measures up through his performance in this picture with the top film actors anywhere,\" and complimented Miki Odagiri, Nobuo Kaneko and Yunosuke Ito. Variety staff called the film \"a tour-de-force...keeping a dramatic thread throughout and avoiding the mawkish.\"\r\nRoger Ebert added it to his list of Great Movies in 1996, stating \"Over the years I have seen Ikiru every five years or so, and each time it has moved me, and made me think. And the older I get, the less Watanabe seems like a pathetic old man, and the more he seems like every one of us.\" In his Great Movies review of Seven Samurai, Ebert called it Kurosawa's greatest film. In 2008, Wally Hammond of Time Out praised Ikiru as \"one of the triumphs of humanist cinema.\" That year, The New Yorker's Michael Sragow described it as a \"masterwork,\" noting Kurosawa was usually associated more with his action films. The scene featuring Watanabe on the swing in the playground he built has been described as \"iconic.\" Writer Pico Iyer has commented on the film's depiction of the postwar Japanese healthcare system, and historian David Conrad has remarked on its portrayal of Japanese governance at the moment Japan regained its sovereignty after a 7-year American occupation.\r\nIn 1972, Sight & Sound critics poll named Ikiru the 12th greatest film of all time. In 1999, The Village Voice ranked the film at number 212 in its list of the top 250 Best Films of the Century, based on a poll of critics. Empire magazine ranked Ikiru 459th on its 2008 list of the 500 greatest movies of all time, and 44th on its 2010 list of \"The 100 Best Films Of World Cinema.\" In 2009, the film was voted at No. 13 on the list of \"The Greatest Japanese Films of All Time\" by Japanese film magazine Kinema Junpo. In 2010 Ikiru was included on Time's All-Time 100 best movies list. In 2012 the film ranked 127th and 132nd on critic's and director's poll respectively in Sight & Sound Top 250 Films list. Martin Scorsese included it on a list of \"39 Essential Foreign Films for a Young Filmmaker.\" The film was included in BBC's 2018 list of The 100 greatest foreign language films. Conversely, in 2016 The Daily Telegraph named it one of the 10 most overrated films. The film has a 98% positive rating on Rotten Tomatoes, based on 44 reviews, with a weighted average of 8.76/10. The site's consensus reads: \"Ikiru is a well-acted and deeply moving humanist tale about a man facing his own mortality, one of legendary director Akira Kurosawa's most intimate films\".\r\nAccolades\r\nThe film competed for the Golden Bear at the 4th Berlin International Film Festival in 1954.\r\nLegacy\r\nKurosawa believed William Shakespeare's play Macbeth could serve as a cautionary tale complementing Ikiru, thus directing his 1957 film Throne of Blood. Ikiru was remade as a Japanese television film that debuted on TV Asahi on 9 September 2007, the day after a remake of Kurosawa's High and Low. The Ikiru remake stars kabuki actor Matsumoto Kōshirō IX.\r\nAnand, a 1971 Indian-Hindi film, was inspired by Ikiru. In 2003, DreamWorks attempted to make a U.S. remake, which would star Tom Hanks in the lead role, and it talked to Richard Price about adapting the screenplay. Jim Sheridan agreed to direct the film in 2004, though it has not been produced.\r\nA British remake titled Living, adapted by Kazuo Ishiguro, directed by Oliver Hermanus, and starring Bill Nighy, was released in 2022.",
    "html": "<p>Ikiru (生きる, \"To Live\") is a 1952 Japanese drama film directed and co-written (with Shinobu Hashimoto and Hideo Oguni) by Akira Kurosawa. The film examines the struggles of a terminally ill Tokyo bureaucrat (played by Takashi Shimura) and his final quest for meaning. The screenplay was partly inspired by Leo Tolstoy's 1886 novella The Death of Ivan Ilyich.</p><p>The major themes of the film include learning how to live, the inefficiency of bureaucracy, and decaying family life in Japan, which have been the subject of analysis by academics and critics. Ikiru has received widespread critical acclaim, and won awards for Best Film at the Kinema Junpo and Mainichi Film Awards. It was remade as a television film in 2007, and adapted into English as Living in 2022.</p><br/><h3>Plot</h3><p>Kanji Watanabe has worked in the same monotonous, bureaucratic position for 30 years, and he is near his retirement. His wife is dead, and his son, Mitsuo, and daughter-in-law, who live with him, seem to care mainly about Watanabe's pension and their future inheritance. At work, he's a party to constant bureaucratic inaction. In one case, a group of parents seemingly endlessly are referred to one department after another when they want a cesspool cleared and replaced by a playground. After learning he has stomach cancer and less than a year to live, Watanabe attempts to come to terms with his impending death. He plans to tell his son about the cancer, but decides against it when his son does not pay attention to him. He then tries to find escape in the pleasures of Tokyo's nightlife, guided by an eccentric novelist whom he has just met. In a nightclub, Watanabe requests a song from the piano player, and sings \"Gondola no Uta\" with great sadness. His singing greatly affects those watching him. After one night submerged in the nightlife, he realizes this is not the solution.</p><p>The following day, Watanabe encounters Toyo, a young female subordinate, who needs his signature on her resignation. He takes comfort in observing her joyous love of life and enthusiasm, and he tries to spend as much time as possible with her. She eventually becomes suspicious of his intentions and grows weary of him. After convincing her to join him for the last time, he becomes opens and asks for the secret to her love of life. She says that she does not know but that she found happiness in her new job making toys, which makes her feel like she is playing with all the children of Japan. Inspired by her, Watanabe realizes that it is not too late for him to do something significant. Like Toyo, he wants to make something, but he is unsure what he can do within the city bureaucracy until he remembers the lobbying for a playground. He surprises everyone by returning to work after a long absence, and he begins pushing for a playground despite concerns that he is intruding on the jurisdiction of other departments.</p><p>Watanabe dies, and at his wake, his former co-workers gather, after the opening of the playground, to figure out what caused such a dramatic change in his behavior. His transformation from listless bureaucrat to passionate advocate puzzles them. As the co-workers drink, they slowly realize that Watanabe must have known he was dying, even when his son denies this truth, as he was unaware of his father's condition. They also hear from a witness that, in the last few moments in Watanabe's life, he sat on the swing at the park he built. As the snow fell, he sang \"Gondola no Uta\". The bureaucrats vow to live their lives with the same dedication and passion as he did, but back at work, they lack the courage of their newfound conviction.</p><br/><h3>Cast</h3><ul><li>Takashi Shimura as Kanji Watanabe</li><li>Shinichi Himori as Kimura</li><li>Haruo Tanaka as Sakai</li><li>Minoru Chiaki as Noguchi</li><li>Bokuzen Hidari as Ohara</li><li>Miki Odagiri as Toyo Odagiri, employee</li><li>Kamatari Fujiwara as Sub-Section Chief Ōno</li><li>Nobuo Nakamura as Deputy Mayor</li><li>Yūnosuke Itō as Novelist</li><li>Minosuke Yamada as Subordinate Clerk Saito</li><li>Makoto Kobori as Kiichi Watanabe, Kanji's Brother</li><li>Nobuo Kaneko as Mitsuo Watanabe, Kanji's son</li><li>Atsushi Watanabe as Patient</li><li>Noriko Honma as Housewife</li></ul><br/><h3>Themes</h3><h4>Living</h4><p>Death is a major theme in the film, which leads to the protagonist Watanabe's quest to find the meaning of life. Initially, Watanabe looks to nightclubs and women to live life to the fullest, but winds up singing the 1915 song \"Gondola no Uta\" as an expression of loss. Professor Alexander Sesonske writes that in the nightclub scene, Watanabe realizes that \"pleasure is not life\" and that a goal gives him new happiness, with the song \"Happy Birthday to You\" symbolizing his rebirth. Because Toyo is young, she has the best insight as to how to live, and she is presented as the \"unlikely savior\" in Watanabe's \"redemption.\"</p><p>Author Donald Richie wrote that the title of the film, meaning simply \"to live,\" could signify that \"existence is enough.\" However, Watanabe finds existence is painful, and he takes this idea as inspiration, wanting to ensure his life has not been futile. The justification of his life, found in his park, is how Watanabe discovered how \"to live.\" In the end, Watanabe now sings \"Gondola no Uta\" with great contentment.</p><h4>Bureaucracy</h4><p>Ikiru is also an \"indictment of Japanese bureaucracy.\" In Japan after World War II, it was expected that the sararīman (salary man) would work predictably in accordance with an organization's rules. The scene where the mothers first visit the city office requesting a playground shows \"unconcern\" in the bureaucrats, who send the visitors on a \"farcical runaround,\" then ask them for a written request, with paperwork in the film as symbols of \"meaningless activity.\" However, Watanabe uses the bureaucracy to forge his legacy, and apparently he is not disturbed when the bureaucracy quickly forgets he drove the project to build the playground.</p><p>Japanese health care is depicted as overly bureaucratic in the film when Watanabe visits a clinic in a \"poignant\" scene. The doctor is portrayed as paternalistic, and Watanabe does not stand up to his authority.</p><h4>Family life</h4><p>Author Timothy Iles writes that, as with Yasujirō Ozu's 1953 film Tokyo Story, Ikiru may hold a negative view about the state of family life in modern Japan. Watanabe has lived with his son for years, but they have fallen out of any true relationship. His son Mitsuo sees Watanabe as a bother and regards him as only an obstacle to his obtaining the money from Watanabe's will. The children fall short of their responsibility to respect their parents.</p><p>Urbanization may be a reason for negative changes in Japanese society, but a reason for Watanabe and Mitsuo's drift is Watanabe's preoccupation with work. Another reason is Watanabe's not being with Mitsuo during a medical treatment when the boy was 10, which fits a pattern in Kurosawa's films of sons being overly harsh to their fathers.</p><br/><h3>Production</h3><p>The film marked the first collaboration between director Akira Kurosawa and screenwriter Hideo Oguni. According to Oguni, the genesis of the film was Kurosawa's desire to make a film about a man who knows he is going to die and who wants a reason to live for a short time. Oguni was an experienced writer and was offered ¥500,000, and co-writer Shinobu Hashimoto was offered ¥150,000. Initially, Kurosawa told Hashimoto that a man who was set to die in 75 days had to be the theme and that the character's career was less important, with the director saying criminal, homeless man or government minister would be acceptable.</p><p>The screenwriters consulted Leo Tolstoy's novella The Death of Ivan Ilyich, and Oguni envisioned placing Watanabe's death halfway through the film. Kurosawa dictated the scene where Watanabe is on the swing and mentioned the beginning lyrics of \"Gondola no Uta.\" Because none of the men were familiar with the song, they consulted their eldest receptionist on the rest of the lyrics and the song title.</p><p>Kurosawa renamed the draft The Life of Kanji Watanabe to Ikiru, which Hashimoto found pretentious, but Oguni supported. The screenplay was completed on 5 February 1952.</p><br/><h3>Release</h3><p>In Japan, Toho released the film on 9 October 1952. The film was screened in the 1954 Berlin International Film Festival.</p><p>In the United States, the film was shown for a short time in California in 1956 under the title Doomed. It opened as Ikiru in New York City on 29 January 1960. The film poster featured the stripper seen briefly in the film rather than Watanabe.</p><br/><h3>Reception</h3><h4>Critical reception</h4><p>The film won critical approval upon its release. Bosley Crowther, writing for The New York Times, called it \"a strangely fascinating and affecting film, up to a point—that being the point where it consigns its aged hero to the great beyond,\" which he deemed \"anticlimactic.\" Crowther praised Shimura, writing he \"measures up through his performance in this picture with the top film actors anywhere,\" and complimented Miki Odagiri, Nobuo Kaneko and Yunosuke Ito. Variety staff called the film \"a tour-de-force...keeping a dramatic thread throughout and avoiding the mawkish.\"</p><p>Roger Ebert added it to his list of Great Movies in 1996, stating \"Over the years I have seen Ikiru every five years or so, and each time it has moved me, and made me think. And the older I get, the less Watanabe seems like a pathetic old man, and the more he seems like every one of us.\" In his Great Movies review of Seven Samurai, Ebert called it Kurosawa's greatest film. In 2008, Wally Hammond of Time Out praised Ikiru as \"one of the triumphs of humanist cinema.\" That year, The New Yorker's Michael Sragow described it as a \"masterwork,\" noting Kurosawa was usually associated more with his action films. The scene featuring Watanabe on the swing in the playground he built has been described as \"iconic.\" Writer Pico Iyer has commented on the film's depiction of the postwar Japanese healthcare system, and historian David Conrad has remarked on its portrayal of Japanese governance at the moment Japan regained its sovereignty after a 7-year American occupation.</p><p>In 1972, Sight & Sound critics poll named Ikiru the 12th greatest film of all time. In 1999, The Village Voice ranked the film at number 212 in its list of the top 250 Best Films of the Century, based on a poll of critics. Empire magazine ranked Ikiru 459th on its 2008 list of the 500 greatest movies of all time, and 44th on its 2010 list of \"The 100 Best Films Of World Cinema.\" In 2009, the film was voted at No. 13 on the list of \"The Greatest Japanese Films of All Time\" by Japanese film magazine Kinema Junpo. In 2010 Ikiru was included on Time's All-Time 100 best movies list. In 2012 the film ranked 127th and 132nd on critic's and director's poll respectively in Sight & Sound Top 250 Films list. Martin Scorsese included it on a list of \"39 Essential Foreign Films for a Young Filmmaker.\" The film was included in BBC's 2018 list of The 100 greatest foreign language films. Conversely, in 2016 The Daily Telegraph named it one of the 10 most overrated films. The film has a 98% positive rating on Rotten Tomatoes, based on 44 reviews, with a weighted average of 8.76/10. The site's consensus reads: \"Ikiru is a well-acted and deeply moving humanist tale about a man facing his own mortality, one of legendary director Akira Kurosawa's most intimate films\".</p><h4>Accolades</h4><p>The film competed for the Golden Bear at the 4th Berlin International Film Festival in 1954.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Award</th><th scope=\"col\">Date of ceremony</th><th scope=\"col\">Category</th><th scope=\"col\">Recipient(s)</th><th scope=\"col\">Result</th><th scope=\"col\" class=\"unsortable\"><abbr title=\"Reference(s)\">Ref(s)</abbr></th></tr><tr><th scope=\"row\"><span>BAFTA Awards</span></th><td><span>1960</span></td><td>Best Foreign Actor</td><td><span>Takashi Shimura</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"1\"></td></tr><tr><th scope=\"row\"><span>Berlin International Film Festival</span></th><td><span>18–29 June 1954</span></td><td>Special Prize of the Senate of Berlin</td><td rowspan=\"3\"><span>Akira Kurosawa</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"1\"></td></tr><tr><th scope=\"row\"><span>Kinema Junpo Awards</span></th><td>1953</td><td><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"1\"></td></tr><tr><th scope=\"row\" rowspan=\"3\"><span>Mainichi Film Awards</span></th><td rowspan=\"3\">1953</td><td><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"3\"></td></tr><tr><td><span>Best Screenplay</span></td><td>Akira Kurosawa, <span>Shinobu Hashimoto</span> and <span>Hideo Oguni</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Sound Recording</span></td><td><span>Fumio Yanoguchi</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\"><span>Ministry of Education</span></th><td>1953</td><td>Minister of Education Award</td><th></th><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"1\"></td></tr></tbody></table><br/><h3>Legacy</h3><p>Kurosawa believed William Shakespeare's play Macbeth could serve as a cautionary tale complementing Ikiru, thus directing his 1957 film Throne of Blood. Ikiru was remade as a Japanese television film that debuted on TV Asahi on 9 September 2007, the day after a remake of Kurosawa's High and Low. The Ikiru remake stars kabuki actor Matsumoto Kōshirō IX.</p><p>Anand, a 1971 Indian-Hindi film, was inspired by Ikiru. In 2003, DreamWorks attempted to make a U.S. remake, which would star Tom Hanks in the lead role, and it talked to Richard Price about adapting the screenplay. Jim Sheridan agreed to direct the film in 2004, though it has not been produced.</p><p>A British remake titled Living, adapted by Kazuo Ishiguro, directed by Oliver Hermanus, and starring Bill Nighy, was released in 2022.</p><br/>"
  },
  "errorMessage": ""
}