{
  "imDbId": "tt0048473",
  "title": "Pather Panchali",
  "fullTitle": "Pather Panchali (1955)",
  "type": "Movie",
  "year": "1955",
  "language": "en",
  "titleInLanguage": "The Apu Trilogy",
  "url": "https://en.wikipedia.org/wiki/The_Apu_Trilogy",
  "plotShort": {
    "plainText": "The Apu Trilogy comprises three Indian Bengali-language drama films directed by Satyajit Ray: Pather Panchali (1955), Aparajito (1956) and The World of Apu (1959). The original music for the films was composed by Ravi Shankar.\r\nThe films are based on two Bengali novels written by Bibhutibhushan Bandopadhyay: Pather Panchali (1929) and Aparajito (1932). The three films went on to win many national and international awards, including three National Film Awards and seven awards from the Cannes, Berlin and Venice Film Festivals. The films were produced on a shoestring budget (Pather Panchali had a budget of roughly ₹ 150,000 ($45,300—equivalent to $458,200 in 2021) using an amateur cast and crew.",
    "html": "<p>The Apu Trilogy comprises three Indian Bengali-language drama films directed by Satyajit Ray: Pather Panchali (1955), Aparajito (1956) and The World of Apu (1959). The original music for the films was composed by Ravi Shankar.</p><p>The films are based on two Bengali novels written by Bibhutibhushan Bandopadhyay: Pather Panchali (1929) and Aparajito (1932). The three films went on to win many national and international awards, including three National Film Awards and seven awards from the Cannes, Berlin and Venice Film Festivals. The films were produced on a shoestring budget (Pather Panchali had a budget of roughly ₹ 150,000 ($45,300—equivalent to $458,200 in 2021) using an amateur cast and crew.</p>"
  },
  "plotFull": {
    "plainText": "The Apu Trilogy comprises three Indian Bengali-language drama films directed by Satyajit Ray: Pather Panchali (1955), Aparajito (1956) and The World of Apu (1959). The original music for the films was composed by Ravi Shankar.\r\nThe films are based on two Bengali novels written by Bibhutibhushan Bandopadhyay: Pather Panchali (1929) and Aparajito (1932). The three films went on to win many national and international awards, including three National Film Awards and seven awards from the Cannes, Berlin and Venice Film Festivals. The films were produced on a shoestring budget (Pather Panchali had a budget of roughly ₹ 150,000 ($45,300—equivalent to $458,200 in 2021) using an amateur cast and crew.\r\nPlot summaries\r\nThe three films comprise a \"coming of age\" narrative in the vein of a bildungsroman; they describe the childhood, education and early maturity of a young Bengali named Apu (Apurba Kumar Roy) in the early part of the 20th century.\r\nPather Panchali (English, \"Song of the Little Road\") Apu's early experiences in rural Bengal as the son of a poor but high caste family are presented. Apu's father Harihar, a Brahmin, has difficulty in supporting his family. After the death of Apu's sister, Durga, the family moves to the holy city of Benares.\r\nAparajito (English, \"The Unvanquished\") The family's finances are still precarious. After his father dies there, Apu and his mother Sarbajaya come back to a village in Bengal. Despite unrelenting poverty, Apu manages to get formal schooling and turns out to be a brilliant student. He moves to Calcutta to pursue his education. He slowly distanced himself from his rural roots and his mother who was not keeping well at the time. In the process the growing Apu comes into conflict with his mother. Later he is informed that, when his mother dies too, he has to learn to live alone.\r\nApur Sansar (English, \"The World of Apu\") Attempting to become a writer, Apu unexpectedly finds himself pressured to marry a girl whose mother rejected her mentally ill bridegroom on the day of their wedding. Their blossoming marriage ends in her death in childbirth, after which the despairing Apu abandons his child, but eventually returns to accept his responsibilities.\r\nProduction\r\nIn 1950, Ray had decided that Pather Panchali, the classic coming of age story (bildungsroman) of Bengali literature, published in 1928 by Bibhutibhusan Bandopadhyay, would be the subject matter for his first film. This semi-autobiographical novel describes the growing up of Apu, a small boy in a Bengal village. He went ahead with the film after meeting Jean Renoir during filming of The River (1951) and after watching the Italian neorealist film Bicycle Thieves (1948) while he was in London. Besides the influence of European cinema and Bengali literature, Ray is also indebted to the Indian theatrical tradition, particularly the rasa theory of classical Sanskrit drama. The complicated doctrine of rasa centers predominantly on feelings experienced not only by the characters but also conveyed in a certain artistic way to the spectator. The duality of rasa representation shows in The Apu Trilogy.\r\nRay gathered an inexperienced crew, although both his cameraman Subrata Mitra and art director Bansi Chandragupta went on to achieve great acclaim. The cast consisted of mostly amateur artists. Shooting started in late 1952, using Ray's personal savings. He had hoped that once the initial shots had been completed, he would be able to obtain funds to support the project, but such funding was not forthcoming. Pather Panchali was shot over the unusually long period of three years, because shooting was possible only from time to time, when Ray or production manager Anil Chowdhury could arrange further money. With a loan from the West Bengal government, the film was finally completed and released in 1955 to great critical and popular success, sweeping up numerous prizes and having long runs in both India and abroad. During the making of the film, Ray refused funding from sources who demanded a change in script or the supervision of the producer, and he ignored advice from the government (which finally funded the film anyway) to incorporate a happy ending in having Apu's family join a \"development project\". Even greater help than Renoir's encouragement occurred when Ray showed a sequence to John Huston who was in India scouting locations for The Man Who Would Be King. The sequence is the remarkable vision Apu and his sister have of the train running through the countryside. It was the only sequence Ray had filmed due to his small budget. Huston praised Ray to Monroe Wheeler at the New York Museum of Modern Art, saying that a major talent was on the horizon. In India, the reaction to the film was enthusiastic; The Times of India wrote that \"it is absurd to compare it with any other Indian cinema. Pather Panchali is pure cinema\". In the United Kingdom, Lindsay Anderson wrote a glowing review of the film. However, the reaction was not uniformly positive. After watching the film, François Truffaut is reported to have said, \"I don't want to see a movie of peasants eating with their hands\". Bosley Crowther, then the most influential critic of The New York Times, wrote a mixed review of the film that its distributor Ed Harrison thought would kill off the film when it got released in the United States, but it enjoyed an exceptionally long run.\r\nRay's international career started in earnest after the success of his next film, Aparajito (The Unvanquished). This film shows the eternal struggle between the ambitions of Apu as a young man and the mother who loves him. Some critics, notably Mrinal Sen and Ritwik Ghatak, rank it even higher than the first film. Aparajito won the Golden Lion at the Venice Film Festival. The film is also notable for its application of bounce lighting to recreate the effect of daylight on sets with the use of large scale diffusers, pioneered by the cinematographer Subrata Mitra.\r\nRay had not thought about a trilogy while making Aparajito, and it occurred to him only after being asked about the idea in Venice. The final installation of the series, Apur Sansar (The World of Apu), was made in 1959. A number of critics find this to be the supreme achievement of the trilogy (Robin Wood, Aparna Sen). Ray introduced two of his favourite actors, Soumitra Chatterjee and Sharmila Tagore, in this film. The film finds Apu living in a nondescript Kolkata house in near-poverty. He becomes involved in an unusual marriage with Aparna, the scenes of their life together forming \"one of the cinema's classic affirmative depiction of married life\", but tragedy ensues. After Apur Sansar was harshly criticised by a Bengali critic, Ray wrote an article defending it—a rare event in Ray's filmmaking career (the other major instance involved the film Charulata, Ray's personal favourite). His success had little influence on his personal life in the years to come. Ray continued to live with his mother, uncle and other members of his extended family in a rented house.\r\nCast and characters\r\nCritical reception\r\nThis trilogy is considered by critics around the globe to rank among the greatest achievements of Indian film, and it is established as one of the most historically important cinematic debuts. Pather Panchali won at least thirteen international prizes (including Best Human Document at the 1956 Cannes Film Festival), followed by eleven international prizes for Aparajito (including the Golden Lion at the Venice Film Festival) and numerous other awards for Apur Sansar (including the Sutherland Trophy at the London Film Festival). When Ray made Pather Panchali, he worked with a cast and crew most of whom had never been previously involved in film. Ray himself at the time of directing Pather Panchali had primarily worked in the advertising industry, although he had served as assistant director on Jean Renoir's 1951 film The River. From this foundation, Ray went on to create other highly acclaimed films, like Charulata, Mahanagar, and Aranyer Din Ratri, and his international success energised other Bengal filmmakers like Mrinal Sen and Ritwik Ghatak.\r\nThis extract from Youth, by South African author J. M. Coetzee, talks of the music in the Apu trilogy, which is based on Indian classical music:\r\nAt the Everyman Cinema there is a season of Satyajit Ray. He watches the Apu trilogy on successive nights in a state of rapt absorption. In Apu's bitter, trapped mother, his engaging, feckless father he recognizes, with a pang of guilt, his own parents. But it is the music above all that grips him, dizzyingly complex interplays between drums and stringed instruments, long arias on the flute whose scale or mode – he does not know enough about music theory to be sure which – catches at his heart, sending him into a mood of sensual melancholy that lasts long after the film has ended.\r\nOn Rotten Tomatoes, Pather Panchali has a 97% fresh rating based on an aggregate of 38 reviews and in 2009 was included in its list of top 100 foreign films. Aparajito has a 94% fresh rating based on an aggregate of 16 reviews, and Apur Sansar (The World of Apu) has a 100% fresh rating based on an aggregate of 22 reviews. This makes The Apu Trilogy one of the highest-rated film trilogies of all time (97%, 94%, 100%), along with the Toy Story trilogy (100%, 100%, 99%), The Lord of the Rings trilogy (91%, 96%, 93%), the original Star Wars trilogy (94%, 97%, 83%), and the Before trilogy (100%, 95%, 98%).\r\nFilm critic Roger Ebert, when including the films in his Great Movies list, wrote about the trilogy:\r\nThe great, sad, gentle sweep of \"The Apu Trilogy\" remains in the mind of the moviegoer as a promise of what film can be. Standing above fashion, it creates a world so convincing that it becomes, for a time, another life we might have lived.\r\nTheme\r\nAndre Robinson, in his book Satyajit Ray: The Inner Eye, comments that the three films differ in their predominant moods, and he compares the trilogy to the development of an Indian classical raga.\r\nLegacy\r\nSight & Sound, the British Film Institute's film magazine, listed Pather Panchali several times in its Critics' Poll of all-time greatest films, in 1962 (ranked #11), 1982 (ranked #79), 1992 (ranked #6), 2002 (ranked #22), 2012 (ranked #42) and 2022 (ranked #35). The World of Apu appeared in 1982, ranked at #42. In the 1992 edition, both Aparajito and The World of Apu were tied at #127, while The Apu Trilogy was ranked separately at #88. In a combined list of Sight & Sound critics' and directors' poll results in 2002, Pather Panchali was ranked at No. 28, The World of Apu at No. 93 and Aparajito at #160. If the votes are combined, then The Apu Trilogy as a whole would be ranked at No. 14 in 1982, No. 4 in 1992 and No. 14 in 2002. In director's poll of Greatest films of all time by Sight & Sound magazine Pather Panchali ranked 48th in 2012 and 22nd in 2022.\r\nIn 1988, John Kobal's poll of critics and filmmakers ranked The Apu Trilogy at No. 35 on their list of Top 100 Movies. In 1998, the Asian film magazine Cinemaya's critics' poll of all-time greatest films ranked The Apu Trilogy at No. 7 on the list, while Pather Panchali alone was ranked at No. 2 on the same list. If the votes are combined, then The Apu Trilogy would be ranked at #1. In 1999, The Village Voice ranked Pather Panchali at No. 12 (tied with The Godfather) in its top 250 \"Best Films of the Century\" list, based on a poll of critics, while The Apu Trilogy was ranked separately at No. 54 in the same poll. If the votes are combined, The Apu Trilogy would be ranked at #5. In 2000, an audience poll of best Asian films conducted by MovieMail ranked The Apu Trilogy at No. 2 on the list. In January 2002, the trilogy as a whole was voted at No. 70 on the list of the \"Top 100 Essential Films of All Time\" by the National Society of Film Critics. In 2021 the trilogy was ranked at No. 65 on Time Out magazine's list of The 100 best movies of all time. The Independent ranked The Apu Trilogy at No. 4 on its list of \"10 greatest movie trilogies of all time\".\r\nPather Panchali was included in various other all-time greatest film lists, including Time Out magazine's \"Centenary Top One Hundred Films\" in 1995, the San Francisco Chronicle's \"Hot 100 Films From the Past\" in 1997, the Rolling Stone \"100 Maverick Movies of the Last 100 Years\" in 1999, and the British Film Institute's Top Fifty \"Must See\" Children's Films in 2005. Akira Kurosawa ranked Pather Panchali at No. 37 on his Top 100 favourite films of all time list. In 1996, The World of Apu was included in Movieline Magazine's \"100 Greatest Foreign Films\". In 2002, Pather Panchali and The World of Apu featured in \"The New York Times Guide to the Best 1,000 Movies Ever Made\". The Apu Trilogy as a whole was included in film critic Roger Ebert's list of The Great Movies in 2001 and in Time magazine's All-Time 100 best movies list in 2005. It was also ranked No. 17 in Empire magazine's \"The 100 Best Films of World Cinema\" in 2010. The original trilogy has been reconstructed via the Harvard Film archive & Criterion and was shown in Kendall Square, Cambridge, MA the 1st week of July 2015.\r\nApur Panchali is a Bengali film based on Subir Banerjee's life, who played child Apu in the first installment of Apu Trilogy. Director Kaushik Ganguly won the award of best director for Apur Panchali in the 44th International Film Festival of India (IFFI) in November 2013. The director mentioned in an interview that he found similarities between certain parts of the life of Subir Banerjee and the iconic character Apu. In the film actor Parambrata Chatterjee portrays a younger Subir Banerjee, while Ardhendu Bannerjee plays the role of the aged Banerjee.\r\nInfluence\r\nAccording to Michael Sragow of The Atlantic Monthly in 1994:\r\nIn the four decades since Ray's debut as a writer-director—with the first Apu movie, Pather Panchali (1955)—his influence has been felt both in the type of work other directors attempt and in the means they employ to execute it. The youthful coming-of-age dramas that have flooded art houses since the mid-fifties owe a tremendous debt to the Apu trilogy, which Terrence Rafferty has rightly called \"cinema's purest Bildungsroman\". In baggy-pants homage to Ray, American TV's cartoon-burlesque Bildungsroman, The Simpsons—which could be called \"The Education of Bart Simpson\"—contains an Indian convenience-store owner named Apu.\r\nAcross the world, filmmakers such as Martin Scorsese, James Ivory, Abbas Kiarostami, Elia Kazan, Carlos Saura, Isao Takahata, Barry Jenkins, Philip Kaufman, Wes Anderson and Danny Boyle have been influenced by The Apu Trilogy, with many others such as Akira Kurosawa praising the work. Filmmaker Martin Scorsese when talking about The Apu Trilogy remarked \"without a doubt, in films the line between poetry and cinema, dissolved\". In Gregory Nava's 1995 film My Family, the final scene is duplicated from the final scene of Apur Sansar. Similar influences and references to the trilogy can be found, for example, in recent works such as Sacred Evil, Paul Auster's 2008 novel Man in the Dark, the Elements trilogy of Deepa Mehta and even in films of Jean-Luc Godard. The technique of bounce lighting pioneered by Subrata Mitra, to recreate the effect of daylight on sets, has also had a profound influence on the development of cinematography. Ravi Shankar's soundtracks to the films were also a major influence on The Beatles, specifically George Harrison.\r\nAwards and nominations\r\nNational awards\r\nWinner – 1955 – President's Gold & Silver Medals (New Delhi) – Pather Panchali (Song of the Little Road)\r\nWinner – 1959 – President's Gold Medal (New Delhi) – Apur Sansar (The World of Apu)\r\nWinner – 1956 – Best Film – Pather Panchali (Song of the Little Road)\r\nWinner – 1956 – Best Feature Film in Bengali – Pather Panchali (Song of the Little Road)\r\nWinner – 1960 – Best Film – Apur Sansar (The World of Apu)\r\nInternational film festivals\r\nWinner – 1956 – Best Human Document – Pather Panchali (Song of the Little Road)\r\nWinner – 1956 – OCIC Award (Special Mention) – Pather Panchali (Song of the Little Road)\r\nNominated – 1956 – Golden Palm for Best Film – Pather Panchali (Song of the Little Road)\r\nWinner – 1957 – Golden Lion of St. Mark for Best Film – Aparajito (The Unvanquished)\r\nWinner – 1957 – Cinema Nuovo Award – Aparajito (The Unvanquished)\r\nWinner – 1957 – Critics Award – Aparajito (The Unvanquished)\r\nWinner – 1957 – Selznick Golden Laurel for Best Film – Pather Panchali (Song of the Little Road)\r\nWinner – 1960 – Selznick Golden Laurel for Best Film – Aparajito (The Unvanquished)\r\nWinner – 1957 – FIPRESCI Award – Aparajito (The Unvanquished)\r\nWinner – 1960 – Sutherland Trophy for Best Original And Imaginative Film – Apur Sansar (The World of Apu)\r\nWinner – 1980 – Wington Award – Apu Trilogy (for each film)\r\nWinner – 1956 – Diploma of Merit – Pather Panchali (Song of the Little Road)\r\nWinner – 1960 – Diploma of Merit – Apur Sansar (The World of Apu)\r\nWinner – 1957 – Golden Gate for Best Picture – Pather Panchali (Song of the Little Road)\r\nWinner – 1957 – Golden Gate for Best Director – Pather Panchali (Song of the Little Road) – Satyajit Ray\r\nWinner – 1958 – Golden Gate for Best Picture – Aparajito (The Unvanquished)\r\nWinner – 1958 – Golden Gate for Best Director – Aparajito (The Unvanquished) – Satyajit Ray\r\nWinner – 1958 – International Critics' Award – Aparajito (The Unvanquished)\r\nWinner – 1958 – Best Film – Pather Panchali (Song of the Little Road)\r\nWinner – 1959 – Best Foreign Film – Pather Panchali (Song of the Little Road)\r\nWinner – 1958 – Critics' Award for Best Film – Pather Panchali (Song of the Little Road)\r\nOther international awards\r\nWinner – 1958 – Best Foreign Film – Pather Panchali (Song of the Little Road)\r\nWinner – 1960 – Best Foreign Film – Apur Sansar (The World of Apu)\r\nWinner – 1967 – Best Foreign Film – Pather Panchali (Song of the Little Road)\r\nWinner – 1967 – Best Non-European Film – Aparajito (The Unvanquished)\r\nWinner – 1969 – Best Non-European Film – Pather Panchali (Song of the Little Road)\r\nNominated – 1958 – BAFTA Award for Best Film – Pather Panchali (Song of the Little Road)\r\nNominated – 1959 – BAFTA Award for Best Film – Aparajito (The Unvanquished)\r\nNominated – 1959 – BAFTA Award for Best Foreign Actress – Aparajito (The Unvanquished) – Karuna Banerjee\r\nNominated – 1962 – BAFTA Award for Best Film – Apur Sansar (The World of Apu)\r\nWinner – 1956 Golden Carbao (Manila) – Pather Panchali (Song of the Little Road)\r\nWinner – 1956 Vatican Award (Rome) – Pather Panchali (Song of the Little Road)\r\nWinner – 1958–1959 Golden Laurel for Best Foreign Film (United States) – Aparajito (The Unvanquished)",
    "html": "<p>The Apu Trilogy comprises three Indian Bengali-language drama films directed by Satyajit Ray: Pather Panchali (1955), Aparajito (1956) and The World of Apu (1959). The original music for the films was composed by Ravi Shankar.</p><p>The films are based on two Bengali novels written by Bibhutibhushan Bandopadhyay: Pather Panchali (1929) and Aparajito (1932). The three films went on to win many national and international awards, including three National Film Awards and seven awards from the Cannes, Berlin and Venice Film Festivals. The films were produced on a shoestring budget (Pather Panchali had a budget of roughly ₹ 150,000 ($45,300—equivalent to $458,200 in 2021) using an amateur cast and crew.</p><br/><h3>Plot summaries</h3><p>The three films comprise a \"coming of age\" narrative in the vein of a bildungsroman; they describe the childhood, education and early maturity of a young Bengali named Apu (Apurba Kumar Roy) in the early part of the 20th century.</p><p>Pather Panchali (English, \"Song of the Little Road\") Apu's early experiences in rural Bengal as the son of a poor but high caste family are presented. Apu's father Harihar, a Brahmin, has difficulty in supporting his family. After the death of Apu's sister, Durga, the family moves to the holy city of Benares.</p><p>Aparajito (English, \"The Unvanquished\") The family's finances are still precarious. After his father dies there, Apu and his mother Sarbajaya come back to a village in Bengal. Despite unrelenting poverty, Apu manages to get formal schooling and turns out to be a brilliant student. He moves to Calcutta to pursue his education. He slowly distanced himself from his rural roots and his mother who was not keeping well at the time. In the process the growing Apu comes into conflict with his mother. Later he is informed that, when his mother dies too, he has to learn to live alone.</p><p>Apur Sansar (English, \"The World of Apu\") Attempting to become a writer, Apu unexpectedly finds himself pressured to marry a girl whose mother rejected her mentally ill bridegroom on the day of their wedding. Their blossoming marriage ends in her death in childbirth, after which the despairing Apu abandons his child, but eventually returns to accept his responsibilities.</p><br/><h3>Production</h3><p>In 1950, Ray had decided that Pather Panchali, the classic coming of age story (bildungsroman) of Bengali literature, published in 1928 by Bibhutibhusan Bandopadhyay, would be the subject matter for his first film. This semi-autobiographical novel describes the growing up of Apu, a small boy in a Bengal village. He went ahead with the film after meeting Jean Renoir during filming of The River (1951) and after watching the Italian neorealist film Bicycle Thieves (1948) while he was in London. Besides the influence of European cinema and Bengali literature, Ray is also indebted to the Indian theatrical tradition, particularly the rasa theory of classical Sanskrit drama. The complicated doctrine of rasa centers predominantly on feelings experienced not only by the characters but also conveyed in a certain artistic way to the spectator. The duality of rasa representation shows in The Apu Trilogy.</p><p>Ray gathered an inexperienced crew, although both his cameraman Subrata Mitra and art director Bansi Chandragupta went on to achieve great acclaim. The cast consisted of mostly amateur artists. Shooting started in late 1952, using Ray's personal savings. He had hoped that once the initial shots had been completed, he would be able to obtain funds to support the project, but such funding was not forthcoming. Pather Panchali was shot over the unusually long period of three years, because shooting was possible only from time to time, when Ray or production manager Anil Chowdhury could arrange further money. With a loan from the West Bengal government, the film was finally completed and released in 1955 to great critical and popular success, sweeping up numerous prizes and having long runs in both India and abroad. During the making of the film, Ray refused funding from sources who demanded a change in script or the supervision of the producer, and he ignored advice from the government (which finally funded the film anyway) to incorporate a happy ending in having Apu's family join a \"development project\". Even greater help than Renoir's encouragement occurred when Ray showed a sequence to John Huston who was in India scouting locations for The Man Who Would Be King. The sequence is the remarkable vision Apu and his sister have of the train running through the countryside. It was the only sequence Ray had filmed due to his small budget. Huston praised Ray to Monroe Wheeler at the New York Museum of Modern Art, saying that a major talent was on the horizon. In India, the reaction to the film was enthusiastic; The Times of India wrote that \"it is absurd to compare it with any other Indian cinema. Pather Panchali is pure cinema\". In the United Kingdom, Lindsay Anderson wrote a glowing review of the film. However, the reaction was not uniformly positive. After watching the film, François Truffaut is reported to have said, \"I don't want to see a movie of peasants eating with their hands\". Bosley Crowther, then the most influential critic of The New York Times, wrote a mixed review of the film that its distributor Ed Harrison thought would kill off the film when it got released in the United States, but it enjoyed an exceptionally long run.</p><p>Ray's international career started in earnest after the success of his next film, Aparajito (The Unvanquished). This film shows the eternal struggle between the ambitions of Apu as a young man and the mother who loves him. Some critics, notably Mrinal Sen and Ritwik Ghatak, rank it even higher than the first film. Aparajito won the Golden Lion at the Venice Film Festival. The film is also notable for its application of bounce lighting to recreate the effect of daylight on sets with the use of large scale diffusers, pioneered by the cinematographer Subrata Mitra.</p><p>Ray had not thought about a trilogy while making Aparajito, and it occurred to him only after being asked about the idea in Venice. The final installation of the series, Apur Sansar (The World of Apu), was made in 1959. A number of critics find this to be the supreme achievement of the trilogy (Robin Wood, Aparna Sen). Ray introduced two of his favourite actors, Soumitra Chatterjee and Sharmila Tagore, in this film. The film finds Apu living in a nondescript Kolkata house in near-poverty. He becomes involved in an unusual marriage with Aparna, the scenes of their life together forming \"one of the cinema's classic affirmative depiction of married life\", but tragedy ensues. After Apur Sansar was harshly criticised by a Bengali critic, Ray wrote an article defending it—a rare event in Ray's filmmaking career (the other major instance involved the film Charulata, Ray's personal favourite). His success had little influence on his personal life in the years to come. Ray continued to live with his mother, uncle and other members of his extended family in a rented house.</p><br/><h3>Cast and characters</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th rowspan=\"2\">Character</th><th colspan=\"3\">Film</th></tr><tr><th><i><span>Pather Panchali</span></i> <br>(1955)</th><th><i><span>Aparajito</span></i> <br>(1956)</th><th><i><span>The World of Apu</span></i> <br>(1959)</th></tr><tr><th>Apurba \"Apu\" Roy</th><td><span>Subir Banerjee</span></td><td>Pinaki Sen Gupta <small> (boy) </small> <br> Smaran Ghosal <small>(adolescent)</small></td><td><span>Soumitra Chatterjee</span></td></tr><tr><th>Durga Roy</th><td>Runki Banerjee <small> (child) </small> <br> Uma Dasgupta <small>(teenager)</small></td><td colspan=\"2\" style=\"background:#d3d3d3;\"></td></tr><tr><th>Harihar Roy</th><td colspan=\"2\"><span>Kanu Banerjee</span></td><td style=\"background:#d3d3d3;\"></td></tr><tr><th>Sarbajaya Roy</th><td colspan=\"2\"><span>Karuna Banerjee</span></td><td style=\"background:#d3d3d3;\"></td></tr><tr><th>Indir Thakrun</th><td><span>Chunibala Devi</span></td><td colspan=\"2\" style=\"background:#d3d3d3;\"></td></tr><tr><th>Prasanna</th><td><span>Tulsi Chakraborty</span></td><td colspan=\"2\" style=\"background:#d3d3d3;\"></td></tr><tr><th>Bhabataran</th><td style=\"background:#d3d3d3;\"></td><td>Ramani Ranjan Sen</td><td style=\"background:#d3d3d3;\"></td></tr><tr><th>Nanda Babu</th><td style=\"background:#d3d3d3;\"></td><td>Charu Prakash Ghosh</td><td style=\"background:#d3d3d3;\"></td></tr><tr><th>Headmaster</th><td style=\"background:#d3d3d3;\"></td><td>Subodh Ganguly</td><td style=\"background:#d3d3d3;\"></td></tr><tr><th>Aparna</th><td colspan=\"2\" style=\"background:#d3d3d3;\"></td><td><span>Sharmila Tagore</span></td></tr><tr><th>Kajal</th><td colspan=\"2\" style=\"background:#d3d3d3;\"></td><td>Alok Chakravarty</td></tr><tr><th>Pulu</th><td colspan=\"2\" style=\"background:#d3d3d3;\"></td><td>Swapan Mukherjee</td></tr><tr><th>Pulu's wife</th><td colspan=\"2\" style=\"background:#d3d3d3;\"></td><td>Sefalika Devi</td></tr><tr><th>Sasinarayan</th><td colspan=\"2\" style=\"background:#d3d3d3;\"></td><td>Dhiresh Majumdar</td></tr><tr><th>The Landlord</th><td colspan=\"2\" style=\"background:#d3d3d3;\"></td><td>Dhiren Ghosh</td></tr></tbody></table><br/><h3>Critical reception</h3><p>This trilogy is considered by critics around the globe to rank among the greatest achievements of Indian film, and it is established as one of the most historically important cinematic debuts. Pather Panchali won at least thirteen international prizes (including Best Human Document at the 1956 Cannes Film Festival), followed by eleven international prizes for Aparajito (including the Golden Lion at the Venice Film Festival) and numerous other awards for Apur Sansar (including the Sutherland Trophy at the London Film Festival). When Ray made Pather Panchali, he worked with a cast and crew most of whom had never been previously involved in film. Ray himself at the time of directing Pather Panchali had primarily worked in the advertising industry, although he had served as assistant director on Jean Renoir's 1951 film The River. From this foundation, Ray went on to create other highly acclaimed films, like Charulata, Mahanagar, and Aranyer Din Ratri, and his international success energised other Bengal filmmakers like Mrinal Sen and Ritwik Ghatak.</p><p>This extract from Youth, by South African author J. M. Coetzee, talks of the music in the Apu trilogy, which is based on Indian classical music:</p><blockquote>At the Everyman Cinema there is a season of Satyajit Ray. He watches the Apu trilogy on successive nights in a state of rapt absorption. In Apu's bitter, trapped mother, his engaging, feckless father he recognizes, with a pang of guilt, his own parents. But it is the music above all that grips him, dizzyingly complex interplays between drums and stringed instruments, long arias on the flute whose scale or mode – he does not know enough about music theory to be sure which – catches at his heart, sending him into a mood of sensual melancholy that lasts long after the film has ended.</blockquote><p>On Rotten Tomatoes, Pather Panchali has a 97% fresh rating based on an aggregate of 38 reviews and in 2009 was included in its list of top 100 foreign films. Aparajito has a 94% fresh rating based on an aggregate of 16 reviews, and Apur Sansar (The World of Apu) has a 100% fresh rating based on an aggregate of 22 reviews. This makes The Apu Trilogy one of the highest-rated film trilogies of all time (97%, 94%, 100%), along with the Toy Story trilogy (100%, 100%, 99%), The Lord of the Rings trilogy (91%, 96%, 93%), the original Star Wars trilogy (94%, 97%, 83%), and the Before trilogy (100%, 95%, 98%).</p><p>Film critic Roger Ebert, when including the films in his Great Movies list, wrote about the trilogy:</p><blockquote>The great, sad, gentle sweep of \"The Apu Trilogy\" remains in the mind of the moviegoer as a promise of what film can be. Standing above fashion, it creates a world so convincing that it becomes, for a time, another life we might have lived.</blockquote><br/><h3>Theme</h3><p>Andre Robinson, in his book Satyajit Ray: The Inner Eye, comments that the three films differ in their predominant moods, and he compares the trilogy to the development of an Indian classical raga.</p><br/><h3>Legacy</h3><p>Sight & Sound, the British Film Institute's film magazine, listed Pather Panchali several times in its Critics' Poll of all-time greatest films, in 1962 (ranked #11), 1982 (ranked #79), 1992 (ranked #6), 2002 (ranked #22), 2012 (ranked #42) and 2022 (ranked #35). The World of Apu appeared in 1982, ranked at #42. In the 1992 edition, both Aparajito and The World of Apu were tied at #127, while The Apu Trilogy was ranked separately at #88. In a combined list of Sight & Sound critics' and directors' poll results in 2002, Pather Panchali was ranked at No. 28, The World of Apu at No. 93 and Aparajito at #160. If the votes are combined, then The Apu Trilogy as a whole would be ranked at No. 14 in 1982, No. 4 in 1992 and No. 14 in 2002. In director's poll of Greatest films of all time by Sight & Sound magazine Pather Panchali ranked 48th in 2012 and 22nd in 2022.</p><p>In 1988, John Kobal's poll of critics and filmmakers ranked The Apu Trilogy at No. 35 on their list of Top 100 Movies. In 1998, the Asian film magazine Cinemaya's critics' poll of all-time greatest films ranked The Apu Trilogy at No. 7 on the list, while Pather Panchali alone was ranked at No. 2 on the same list. If the votes are combined, then The Apu Trilogy would be ranked at #1. In 1999, The Village Voice ranked Pather Panchali at No. 12 (tied with The Godfather) in its top 250 \"Best Films of the Century\" list, based on a poll of critics, while The Apu Trilogy was ranked separately at No. 54 in the same poll. If the votes are combined, The Apu Trilogy would be ranked at #5. In 2000, an audience poll of best Asian films conducted by MovieMail ranked The Apu Trilogy at No. 2 on the list. In January 2002, the trilogy as a whole was voted at No. 70 on the list of the \"Top 100 Essential Films of All Time\" by the National Society of Film Critics. In 2021 the trilogy was ranked at No. 65 on Time Out magazine's list of The 100 best movies of all time. The Independent ranked The Apu Trilogy at No. 4 on its list of \"10 greatest movie trilogies of all time\".</p><p>Pather Panchali was included in various other all-time greatest film lists, including Time Out magazine's \"Centenary Top One Hundred Films\" in 1995, the San Francisco Chronicle's \"Hot 100 Films From the Past\" in 1997, the Rolling Stone \"100 Maverick Movies of the Last 100 Years\" in 1999, and the British Film Institute's Top Fifty \"Must See\" Children's Films in 2005. Akira Kurosawa ranked Pather Panchali at No. 37 on his Top 100 favourite films of all time list. In 1996, The World of Apu was included in Movieline Magazine's \"100 Greatest Foreign Films\". In 2002, Pather Panchali and The World of Apu featured in \"The New York Times Guide to the Best 1,000 Movies Ever Made\". The Apu Trilogy as a whole was included in film critic Roger Ebert's list of The Great Movies in 2001 and in Time magazine's All-Time 100 best movies list in 2005. It was also ranked No. 17 in Empire magazine's \"The 100 Best Films of World Cinema\" in 2010. The original trilogy has been reconstructed via the Harvard Film archive & Criterion and was shown in Kendall Square, Cambridge, MA the 1st week of July 2015.</p><p>Apur Panchali is a Bengali film based on Subir Banerjee's life, who played child Apu in the first installment of Apu Trilogy. Director Kaushik Ganguly won the award of best director for Apur Panchali in the 44th International Film Festival of India (IFFI) in November 2013. The director mentioned in an interview that he found similarities between certain parts of the life of Subir Banerjee and the iconic character Apu. In the film actor Parambrata Chatterjee portrays a younger Subir Banerjee, while Ardhendu Bannerjee plays the role of the aged Banerjee.</p><h4>Influence</h4><p>According to Michael Sragow of The Atlantic Monthly in 1994:</p><blockquote>In the four decades since Ray's debut as a writer-director—with the first Apu movie, Pather Panchali (1955)—his influence has been felt both in the type of work other directors attempt and in the means they employ to execute it. The youthful coming-of-age dramas that have flooded art houses since the mid-fifties owe a tremendous debt to the Apu trilogy, which Terrence Rafferty has rightly called \"cinema's purest Bildungsroman\". In baggy-pants homage to Ray, American TV's cartoon-burlesque Bildungsroman, The Simpsons—which could be called \"The Education of Bart Simpson\"—contains an Indian convenience-store owner named Apu.</blockquote><p>Across the world, filmmakers such as Martin Scorsese, James Ivory, Abbas Kiarostami, Elia Kazan, Carlos Saura, Isao Takahata, Barry Jenkins, Philip Kaufman, Wes Anderson and Danny Boyle have been influenced by The Apu Trilogy, with many others such as Akira Kurosawa praising the work. Filmmaker Martin Scorsese when talking about The Apu Trilogy remarked \"without a doubt, in films the line between poetry and cinema, dissolved\". In Gregory Nava's 1995 film My Family, the final scene is duplicated from the final scene of Apur Sansar. Similar influences and references to the trilogy can be found, for example, in recent works such as Sacred Evil, Paul Auster's 2008 novel Man in the Dark, the Elements trilogy of Deepa Mehta and even in films of Jean-Luc Godard. The technique of bounce lighting pioneered by Subrata Mitra, to recreate the effect of daylight on sets, has also had a profound influence on the development of cinematography. Ravi Shankar's soundtracks to the films were also a major influence on The Beatles, specifically George Harrison.</p><br/><h3>Awards and nominations</h3><h4>National awards</h4><ul><li>Winner – 1955 – President's Gold & Silver Medals (New Delhi) – Pather Panchali (Song of the Little Road)</li><li>Winner – 1959 – President's Gold Medal (New Delhi) – Apur Sansar (The World of Apu)</li></ul><ul><li>Winner – 1956 – Best Film – Pather Panchali (Song of the Little Road)</li><li>Winner – 1956 – Best Feature Film in Bengali – Pather Panchali (Song of the Little Road)</li><li>Winner – 1960 – Best Film – Apur Sansar (The World of Apu)</li></ul><h4>International film festivals</h4><ul><li>Winner – 1956 – Best Human Document – Pather Panchali (Song of the Little Road)</li><li>Winner – 1956 – OCIC Award (Special Mention) – Pather Panchali (Song of the Little Road)</li><li>Nominated – 1956 – Golden Palm for Best Film – Pather Panchali (Song of the Little Road)</li></ul><ul><li>Winner – 1957 – Golden Lion of St. Mark for Best Film – Aparajito (The Unvanquished)</li><li>Winner – 1957 – Cinema Nuovo Award – Aparajito (The Unvanquished)</li><li>Winner – 1957 – Critics Award – Aparajito (The Unvanquished)</li></ul><ul><li>Winner – 1957 – Selznick Golden Laurel for Best Film – Pather Panchali (Song of the Little Road)</li><li>Winner – 1960 – Selznick Golden Laurel for Best Film – Aparajito (The Unvanquished)</li></ul><ul><li>Winner – 1957 – FIPRESCI Award – Aparajito (The Unvanquished)</li><li>Winner – 1960 – Sutherland Trophy for Best Original And Imaginative Film – Apur Sansar (The World of Apu)</li><li>Winner – 1980 – Wington Award – Apu Trilogy (for each film)</li></ul><ul><li>Winner – 1956 – Diploma of Merit – Pather Panchali (Song of the Little Road)</li><li>Winner – 1960 – Diploma of Merit – Apur Sansar (The World of Apu)</li></ul><ul><li>Winner – 1957 – Golden Gate for Best Picture – Pather Panchali (Song of the Little Road)</li><li>Winner – 1957 – Golden Gate for Best Director – Pather Panchali (Song of the Little Road) – Satyajit Ray</li><li>Winner – 1958 – Golden Gate for Best Picture – Aparajito (The Unvanquished)</li><li>Winner – 1958 – Golden Gate for Best Director – Aparajito (The Unvanquished) – Satyajit Ray</li><li>Winner – 1958 – International Critics' Award – Aparajito (The Unvanquished)</li></ul><ul><li>Winner – 1958 – Best Film – Pather Panchali (Song of the Little Road)</li></ul><ul><li>Winner – 1959 – Best Foreign Film – Pather Panchali (Song of the Little Road)</li></ul><ul><li>Winner – 1958 – Critics' Award for Best Film – Pather Panchali (Song of the Little Road)</li></ul><h4>Other international awards</h4><ul><li>Winner – 1958 – Best Foreign Film – Pather Panchali (Song of the Little Road)</li><li>Winner – 1960 – Best Foreign Film – Apur Sansar (The World of Apu)</li></ul><ul><li>Winner – 1967 – Best Foreign Film – Pather Panchali (Song of the Little Road)</li></ul><ul><li>Winner – 1967 – Best Non-European Film – Aparajito (The Unvanquished)</li><li>Winner – 1969 – Best Non-European Film – Pather Panchali (Song of the Little Road)</li></ul><ul><li>Nominated – 1958 – BAFTA Award for Best Film – Pather Panchali (Song of the Little Road)</li><li>Nominated – 1959 – BAFTA Award for Best Film – Aparajito (The Unvanquished)</li><li>Nominated – 1959 – BAFTA Award for Best Foreign Actress – Aparajito (The Unvanquished) – Karuna Banerjee</li><li>Nominated – 1962 – BAFTA Award for Best Film – Apur Sansar (The World of Apu)</li></ul><ul><li>Winner – 1956 Golden Carbao (Manila) – Pather Panchali (Song of the Little Road)</li><li>Winner – 1956 Vatican Award (Rome) – Pather Panchali (Song of the Little Road)</li><li>Winner – 1958–1959 Golden Laurel for Best Foreign Film (United States) – Aparajito (The Unvanquished)</li></ul><br/>"
  },
  "errorMessage": ""
}