{
  "imDbId": "tt4729430",
  "title": "Klaus",
  "fullTitle": "Klaus (2019)",
  "type": "Movie",
  "year": "2019",
  "items": [
    {
      "publisher": "Slant Magazine",
      "author": "Steven Scaife",
      "link": "",
      "rate": "75",
      "content": "Sergio Pablos’s film is essentially a metaphor for its own unique and refreshing mode of expression."
    },
    {
      "publisher": "RogerEbert.com",
      "author": "Matt Zoller Seitz",
      "link": "https://www.rogerebert.com/reviews/klaus-movie-review-2019",
      "rate": "75",
      "content": "The goofy and charming Klaus probably plays better if you don't know going in that it's a Santa Claus origin story."
    },
    {
      "publisher": "TheWrap",
      "author": "Alonso Duralde",
      "link": "https://www.thewrap.com/klaus-film-review-animated-santa-claus-netflix/",
      "rate": "70",
      "content": "It’s far more successful with holiday magic than it is with character-based comedy, but that’s not enough of a flaw to keep young audiences (and their parents) from potentially turning this feature into a cherished annual tradition."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "John DeFore",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/klaus-review-1251929/",
      "rate": "70",
      "content": "Sergio Pablos' Klaus invents its own unexpected and very enjoyable origin story for the big guy who gives out toys every Christmas eve. Shaking off most Yuletide cliches in favor of a from-scratch story about how even dubiously-motivated generosity can lead to joy, it contains echoes of other seasonal favorites (especially, in a topsy-turvy way, Dr. Seuss' Grinch) while standing completely on its own."
    },
    {
      "publisher": "The New York Times",
      "author": "Glenn Kenny",
      "link": "https://www.nytimes.com/2019/11/07/movies/klaus-review.html",
      "rate": "70",
      "content": "It all moves along so amiably, and offers such consistently delightful visuals, that the conventional plot points, up to and including an inevitable “but I can explain” bit, are entirely digestible."
    },
    {
      "publisher": "Movie Nation",
      "author": "Roger Moore",
      "link": "https://rogersmovienation.com/2019/11/15/netflixable-klaus-gets-netflix-into-the-holiday-animation-business-with-style/",
      "rate": "63",
      "content": "It’s not remotely as polished as the earlier contenders in the field, but “Klaus” is good enough to have earned a theatrical release, on a par with MGM’s “The Addams Family,” in any event."
    },
    {
      "publisher": "The Guardian",
      "author": "Mike McCahill",
      "link": "https://www.theguardian.com/film/2019/nov/06/klaus-review-netflix-family-animation",
      "rate": "60",
      "content": "Solid first and third acts can’t disguise a so-so middle section stuffed with conventional story beats."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Robert Abele",
      "link": "https://www.latimes.com/entertainment-arts/movies/story/2019-11-06/klaus-netflix-animated-santa",
      "rate": "60",
      "content": "As admirable as it is that “Klaus” in the overall isn’t a sugar-rush cartoon fix of wisecracks and mayhem, it’s also too lazily reliant on insults and insolence as its go-to mode for comedy. But what does work is the snowy, hilly luster of this bygone-era fairy tale environment, and the seasonal soul the filmmakers have tucked inside their invented history about children’s yearly haul."
    },
    {
      "publisher": "IndieWire",
      "author": "David Ehrlich",
      "link": "https://www.indiewire.com/criticism/movies/klaus-review-netflix-1202190368/",
      "rate": "58",
      "content": "None of the characters in Klaus are as delightful as they are well-drawn, and Pablos’ film never earns the holiday spirit it tries to manufacture down the home stretch. But there’s no denying that the future of “traditional” animation looks a little brighter than it did yesterday, and that’s reason enough to celebrate."
    },
    {
      "publisher": "Variety",
      "author": "Peter Debruge",
      "link": "https://variety.com/2019/film/reviews/klaus-review-1203392809/",
      "rate": "50",
      "content": "What goodwill the movie does inspire owes more to the splendid visual world than to anything the story supplies."
    }
  ],
  "errorMessage": ""
}