{
  "imDbId": "tt4729430",
  "title": "Klaus",
  "fullTitle": "Klaus (2019)",
  "type": "Movie",
  "year": "2019",
  "items": [
    {
      "username": "cricketbat",
      "userUrl": "https://www.imdb.com/user/ur6201371",
      "reviewLink": "https://www.imdb.com/review/rw5341855",
      "warningSpoilers": false,
      "date": "22 December 2019",
      "rate": "8",
      "helpful": "33 out of 33 found this helpful.",
      "title": "In a sea of generic Christmas movies, Klaus stands out",
      "content": "Klaus is an amusing new twist on a very old story. It's a heart-warming tale with an uplifting message about kindness, featuring beautifully unique animation, interesting characters, and a clever plot. In the sea of generic Christmas movies that get churned out each holiday season, Klaus stands out because it tried something different and it succeeded."
    },
    {
      "username": "Joejoesan",
      "userUrl": "https://www.imdb.com/user/ur0499651",
      "reviewLink": "https://www.imdb.com/review/rw5256642",
      "warningSpoilers": true,
      "date": "14 November 2019",
      "rate": "9",
      "helpful": "417 out of 441 found this helpful.",
      "title": "Wow, we finally have a new Christmas classic",
      "content": "Okay, when it comes to Christmas movies to me there was only one: It's a wonderful life by Frank Capra. The Bishop's Wife and Love Actually are also very good but they don't have the same magic. This year I can finally add a new classic: Klaus. It's a funny and surprising tale of how the real Santa Claus was born. I love the story and especially the look of this movie is amazing. Klaus is hand drawn animation but thanks to computers it has astonishing lit scenes. That makes the journey extra special.The story is about this lazy and clumpsy guy, Jesper, who is the only son of the director of a Mail School. His father wants to teach him a lesson and sends him to this little snowy place called Smeerensburg. Only if he succeeds in delivering 6000 letters in a year he's allowed to come back and continue his luxery life. Of course Jesper obeys: he doesn't have a choice. But when he arrives at Smeerensburg he discovers that his mission is an almost imposible one. Two rival families are at constant war with each other and will never send each other letters. But when Jesper visits his last hope, this hermit called Klaus, something magical happens. By accident this mourning figure receives a letter from a child and wants to return this nice gesture by giving the boy a present. Suddenly all the childeren of the village want to send letters...Why does Santa always say \"Ho! Ho! Ho!?\". How did he get his reindeers? Does he really have a naughty book? Why does he travel on a sleigh? All those questions will be answered in this great tale of one man, Jesper, changing the fate of a town that once only knew anger and never friendship. The end of Klaus is actually quite moving.Forget The Polar Express or all the Christmas Carols. Klaus is the real deal! Go see it on Netflix!9/10"
    },
    {
      "username": "andymhancock",
      "userUrl": "https://www.imdb.com/user/ur53096283",
      "reviewLink": "https://www.imdb.com/review/rw5261806",
      "warningSpoilers": false,
      "date": "16 November 2019",
      "rate": "10",
      "helpful": "124 out of 130 found this helpful.",
      "title": "Never thought I'd give a \"sappy\" cartoon a 10, but what a surprise",
      "content": "Sure, sappiness is cute, and fun to indulge in. I thought I'd seen it all. But what sappiness was in the movie well used. The main thrust was not sappy. It was a well told story, with the proper nuances in the animation and the vocalization. I consider this movie to be for adults. You will thoroughly enjoy it."
    },
    {
      "username": "CubsandCulture",
      "userUrl": "https://www.imdb.com/user/ur83822756",
      "reviewLink": "https://www.imdb.com/review/rw5310907",
      "warningSpoilers": false,
      "date": "9 December 2019",
      "rate": "10",
      "helpful": "36 out of 37 found this helpful.",
      "title": "My Christmas watchlist just got a little longer",
      "content": "Everything about this droll take on the Santa myth is inspired. JK SImmons as the title character, the animation style, the way in which the various elements of the mythos come together organically and so forth all just fit. Even the final moment of magical realism is just right. It all adds up to a heart warming tale of Christmas.I will be watching this each year for awhile."
    },
    {
      "username": "morrison-dylan-fan",
      "userUrl": "https://www.imdb.com/user/ur5424352",
      "reviewLink": "https://www.imdb.com/review/rw6417304",
      "warningSpoilers": true,
      "date": "28 December 2020",
      "rate": "10",
      "helpful": "19 out of 19 found this helpful.",
      "title": "Claus.",
      "content": "Whilst I was vaguely aware of the title from seeing it mentioned at the Oscar's, I became aware of Klaus from seeing a large number of fellow reviewers highly praising the film this year,which led to me meeting Klaus.View on the film:Revealing later that he had wanted to do a traditionally animated feature film, but he wanted to see how the animation would have evolved without the switch to computer-generated animation, the 20 years spent working in various other animation departments, leads to co-writer/ (with Jim Mahoney & Zach Lewis) and co-director (with Carlos Martinez Lopez )Sergio Pablos make a chart-topping Christmas number one directing debut.Developing the project for over a decade, Pablos and Lopez ultra-stylised use of volumetric lighting and texturing, (first time to be used in hand-drawn animation) gives the animation a dazzling depth of field appearance, with the detailed, expressive hand-drawn character animation seamlessly blending in with the thick texturing given to the background and buildings drawing a pop-up book elegance.Later revealed by Sergio Pablos that he had improvised 40% of the dialogue,Jason Schwartzman gives a fantastic turn as Jesper,thanks to Schwartzman voicing his distinctive kookiness with a growing can-do confidence,whilst J.K. Simmons brings a merry, towering warmth in his merry performance of Klaus.Simply having a wonderful Christmas time in a miserable town, the writers gloriously take the characteristics of Santa (such as flying reindeer)and turn them inside out with hilarious sight gags that soar with excellent drama from Jesper bonding with the locals,and Klaus coming out from the wilderness, to discover the true meaning of Christmas."
    },
    {
      "username": "kaleem_091983",
      "userUrl": "https://www.imdb.com/user/ur22709105",
      "reviewLink": "https://www.imdb.com/review/rw5279892",
      "warningSpoilers": false,
      "date": "25 November 2019",
      "rate": "10",
      "helpful": "210 out of 222 found this helpful.",
      "title": "I am not crying, you are crying.",
      "content": "I haven't felt this good after watching a movie. I feel good about myself. I am not kidding, I actually cried during and after the credit rolled. Thank you Netflix."
    },
    {
      "username": "mmehedihopuu",
      "userUrl": "https://www.imdb.com/user/ur107279729",
      "reviewLink": "https://www.imdb.com/review/rw5262953",
      "warningSpoilers": false,
      "date": "17 November 2019",
      "rate": "10",
      "helpful": "463 out of 486 found this helpful.",
      "title": "Haven't cried after watching an animated movie in so long.",
      "content": "One of the sweetest, emotional and best Animated film of the year. Netflix please keep bringing us movies with great script such as this."
    },
    {
      "username": "tarapov-92-654064",
      "userUrl": "https://www.imdb.com/user/ur26758871",
      "reviewLink": "https://www.imdb.com/review/rw5262509",
      "warningSpoilers": false,
      "date": "17 November 2019",
      "rate": "8",
      "helpful": "280 out of 300 found this helpful.",
      "title": "Watch and learn, Disney",
      "content": "Very solid original story, awesome visual style and great writing. All it takes. On the contrary, reinventing 30 year old cartoons and doubling down on puritan stuff does not help.This film deserves broader recognition - best Christmas catroon in a long long time"
    },
    {
      "username": "keikoyoshikawa",
      "userUrl": "https://www.imdb.com/user/ur109186594",
      "reviewLink": "https://www.imdb.com/review/rw5263342",
      "warningSpoilers": false,
      "date": "17 November 2019",
      "rate": "9",
      "helpful": "135 out of 154 found this helpful.",
      "title": "Anti-Postmodern Santa Claus",
      "content": "If postmodernism is defined as a rejection of morality and human nature, then this animated story is a repudiation of that rejection, but done in a refreshingly adult and not too overly sentimental way.Thankfully, there are none of the usual Hollywood tropes; rather, the characters and situation are very grounded despite having elements of the fantastical and surrealism mixed in. It is not even Disney-esque, which is also a very good good thing.That this \"Santa Claus\" is not the only main character is moreover a good choice by the writers. By doing so, the story is able to focus on how a mythical character could conceivably come to be - and that makes for a very interesting and entertaining premise.Everything about this animated story is well done: The animation is crisp and detailed; the dialogues are convincing and at times humorous; the music fits, is modern, and used judiciously.Young children will not probably understand the deeper meanings, but everyone else will."
    },
    {
      "username": "edicionccq",
      "userUrl": "https://www.imdb.com/user/ur109023433",
      "reviewLink": "https://www.imdb.com/review/rw5276573",
      "warningSpoilers": false,
      "date": "23 November 2019",
      "rate": "10",
      "helpful": "44 out of 49 found this helpful.",
      "title": "KLAUS: The Netflix Classic for Christmas.",
      "content": "I typically wouldn't mention a movie as a classic except for the two first films of Shrek. But Klaus it's amazing.Allow me to explain myself.There are so many reasons why Klaus remains as a classic.FIRST of all and the most visible one:THE ANIMATION. I'm not an animator but I love animation so I can tell when something is beautifully animated. Klaus isn't animated by computer, is hand-drawn animation which involves so much more work and it's worthy at the end because the result is so delightful. The colors, the details, the characters, the locations and every particular aspect are properly drawn, so you feel so good watching it.SECOND: You need more than looks to produce a classic and this film has a pretty good STORY. The plot is simple, a post man is sent to the unhappiest place in the world to deliver 6,000 letters, but in this place nobody delivers letters. Simple, the way that this plot seeks his way to include the origin story of Santa Claus it's amazing. Every twist is graceful and the ending is satisfactory.THIRD: animation and story are reached because of THE CHARACTERS: Every single and unique character has their own storyline developed satisfactorily.From beginning to end, the film is perfection for the Christmas holiday."
    },
    {
      "username": "gauravleoheart",
      "userUrl": "https://www.imdb.com/user/ur20660927",
      "reviewLink": "https://www.imdb.com/review/rw5261220",
      "warningSpoilers": false,
      "date": "16 November 2019",
      "rate": "10",
      "helpful": "76 out of 83 found this helpful.",
      "title": "Best christmas movie ever",
      "content": "Yes i said it. That is a big statement to back up but i believe that this movie covers anything christmas is all about. Not just that, it is really one of the best Santa Klaus story ever if not the one.Solitude, selfishness, hatred -- All these attributes have to stand this christmas movie and bow down to the love, warmth, kindness this story brings.Thank you for making this one and reminding us all what great animated stories are about."
    },
    {
      "username": "c-bevan",
      "userUrl": "https://www.imdb.com/user/ur65918341",
      "reviewLink": "https://www.imdb.com/review/rw5259233",
      "warningSpoilers": false,
      "date": "15 November 2019",
      "rate": "10",
      "helpful": "223 out of 239 found this helpful.",
      "title": "Well done.",
      "content": "For my first holiday movie of the season this is a must see. Well written and beautifully done, also absolutely hilarious yet so heartwarming."
    },
    {
      "username": "evilmonkey226",
      "userUrl": "https://www.imdb.com/user/ur13982391",
      "reviewLink": "https://www.imdb.com/review/rw5260240",
      "warningSpoilers": false,
      "date": "16 November 2019",
      "rate": "10",
      "helpful": "661 out of 687 found this helpful.",
      "title": "It's one of the best Christmas movies I've ever seen!",
      "content": "At first I thought it would be dumb, but omg it was AMAZING! The story was awesome (I won't give any spoilers) and there were parts that made me laugh so hard and parts that made me cry. I don't usually cry during movies, but I'm sitting here writing this review with tears in my eyes. I think it is going to become a new movie to watch every Christmas with my family!"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw5606531",
      "warningSpoilers": false,
      "date": "4 April 2020",
      "rate": "8",
      "helpful": "8 out of 8 found this helpful.",
      "title": "great Christmas movie",
      "content": "Jesper (Jason Schwartzman) is a spoiled young man who fails at his job which was given by his Postmaster General father. As a disappointment to his father, the father sends him to the kingdom's far north island and offers him a deal to come back to the comforts of home after 6000 letters. The locals have ongoing feuds and generally express themselves in person rather than in letters. With a desperate need for any letters at all, he goes to the far end of the island where he finds an old reclusive toymaker named Klaus.Animator Sergio Pablos tries his hand in filmmaking and hits the first pitch out of the park. It's a solid origin story for Santa. It's not necessarily an original idea but this original version is executed very well. It has a great theme that fits perfectly with Christmas. It is emotionally satisfying and it has the potential to becoming a Christmas classic."
    },
    {
      "username": "caroline_schmid",
      "userUrl": "https://www.imdb.com/user/ur109653408",
      "reviewLink": "https://www.imdb.com/review/rw5258956",
      "warningSpoilers": false,
      "date": "15 November 2019",
      "rate": "9",
      "helpful": "118 out of 130 found this helpful.",
      "title": "Rare christmas story",
      "content": "A truly heartwarming story. About how little kindnesses can make life more beautiful, children's laughter can warm the heart and Christmas can actually be a beautiful contemplative time.A truly beautiful Christmas story is told here with humour and love for detail. For young and old. I could watch the film again tight now.. :)"
    },
    {
      "username": "alijajarnstal",
      "userUrl": "https://www.imdb.com/user/ur85800251",
      "reviewLink": "https://www.imdb.com/review/rw5259461",
      "warningSpoilers": false,
      "date": "15 November 2019",
      "rate": "10",
      "helpful": "97 out of 108 found this helpful.",
      "title": "WONDERFUL MOVIE",
      "content": "It is just a perfect christmas movie. Amazing animation mixed with joy and emotions. Highly recommended if you are looking for some extra happiness and to hop into christmas spirit..Happy holidays in advance."
    },
    {
      "username": "aidanratesmovies",
      "userUrl": "https://www.imdb.com/user/ur48282208",
      "reviewLink": "https://www.imdb.com/review/rw5263827",
      "warningSpoilers": false,
      "date": "17 November 2019",
      "rate": "10",
      "helpful": "23 out of 27 found this helpful.",
      "title": "An Absolute Delight",
      "content": "Fun-spirited and an absolute delight, Klaus just may be not only the best christmas movie of the year, but also of the decade. Fit with beautiful animation, wonderful voice work, and a charming sense of direction, Klaus aims to please and does so almost irresistibly. The film, at its worst, may seem a bit formulaic, but is plenty full of many surprises without that will make you not want to look away from the screen. The film is also cleverly funny, with humor on par with that of The Emperor's New Groove and another Christmas classic of the decade, Arthur Christmas. What's so remarkable about the film however, is that, besides its ownership under Netflix, it simply isn't owned by a huge animation company. It feels small, and looks underwhelming, and like a gift of the same nature, is an absolute delight once you find what is all truly inside. My Rating: 9.75/10"
    },
    {
      "username": "dermotprendergast",
      "userUrl": "https://www.imdb.com/user/ur106606096",
      "reviewLink": "https://www.imdb.com/review/rw5261506",
      "warningSpoilers": false,
      "date": "16 November 2019",
      "rate": "10",
      "helpful": "112 out of 120 found this helpful.",
      "title": "Beautiful",
      "content": "Just watched with my kids. Absolutely loved every minute of it. A beautiful family movie that is sure to become a Christmas classic."
    },
    {
      "username": "arcticerika",
      "userUrl": "https://www.imdb.com/user/ur69637528",
      "reviewLink": "https://www.imdb.com/review/rw5264292",
      "warningSpoilers": false,
      "date": "17 November 2019",
      "rate": "10",
      "helpful": "286 out of 296 found this helpful.",
      "title": "Wholesome and Original",
      "content": "Klaus was a heartwarming animation with a very unique take on the \"Christmas origin\". I originally put it on as background noise for folding laundry but caught myself sitting on the bed for the entirety of the movie. The animation was really well done and the characters were memorable. I loved the similarities with Tim Burton films. It's nice to have a different Christmas film but that has the spirit nevertheless. One of the best Christmas animations in awhile. Great film!"
    },
    {
      "username": "pere_tech",
      "userUrl": "https://www.imdb.com/user/ur22729146",
      "reviewLink": "https://www.imdb.com/review/rw5259596",
      "warningSpoilers": false,
      "date": "16 November 2019",
      "rate": "10",
      "helpful": "94 out of 102 found this helpful.",
      "title": "Such a good film!!",
      "content": "Wasn't sure what to expect but completely exceeded all my expectations. Funny, smart and with heart. The animation and production quality is fantastic. Has that classic 2D animation aesthetic combined with 3D. Feast for the eyes, mind and heart. Great film, thanks for the little Christmas gift. 😁"
    },
    {
      "username": "lrczlnsk",
      "userUrl": "https://www.imdb.com/user/ur60377358",
      "reviewLink": "https://www.imdb.com/review/rw5258630",
      "warningSpoilers": false,
      "date": "15 November 2019",
      "rate": "9",
      "helpful": "116 out of 132 found this helpful.",
      "title": "An earnest, charming fairytale",
      "content": "This is what this film feels like: sitting around a fire and being engrossed in a story that someone remembers from long ago. Is the plot very original? Maybe not, but it is well paced and has some surprises along the way that make Klaus special. Here, we have a sincere, funny and engaging film, that doesn't rely on ironic jokes to tie in the adults, or on the integration of modern technology to hold the kids' interest. It just tells a story.The story is about a spoiled young man who is sent into the little backwater village of Smeerensburg to take over the post office. Jesper has to deliver 6000 letters by the end of a year or he'll be cut off by his wealthy father. After he meets the reclusive toymaker Klaus, Jesper starts to plot his way out of Smeerensburg by roping in the kids of the village. Along the way he makes some friends, changes some lives and, well, grows up.This is, in a way, Jesper's coming of age story, even though he is a fully grown man to begin with. But this is also Klaus' growing old story. I found this apect very touching - the old and widowed hermit finds a new purpose in his life and gets to be happy for a few years yet. You do not see that sort of plotline in animated movies very often. The subplot of the warring clans of Smeerensburg was hilarious and reminded me a little of Asterix and Obelix.Apart from the old school, but very well executed plot, it is worthwhile to talk about Klaus' technical realization. Firstly, the animation is gorgeous. The lighting is magnificent. The look is excellent. This film looks exactly as lovingly detailed as a Christmas movie should. The handdrawn animation is very effective - it gives the film a very soft and almost canvas-like feeling, while still making good use of the smooth and fast execution that CGI affords.Klaus isn't dunked in polished, on-the-nose effects, but is, you might say, warmly covered in a carefully crafted blanket of twinkling forest lights and harsh mountain snows and accompanied by a little, gruff town of crooked and funny looking houses and crooked and funny-looking people. In Klaus, we do not encounter a string of slightly altered clones, that all have the same body type and facial features (looking at you Disney) but a jumbled ensemble of big and round, tall and bent, young and middle aged and old characters, who all look and act differently from each other.The only criticism I can honestly think of is that Klaus lacks a little on female representation. Its central female characters, Ava and Márgu, felt a little sidelined to me, especially given the fact that theirs could have been the better story, if told accordingly. But given the fact that I still loved it, I can't really hold this against Klaus.So, just in time for Christmas, Klaus is a thoroughly enjoyable treat of a movie that I will probably recommend excessively over the next few weeks."
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5460137",
      "warningSpoilers": false,
      "date": "5 February 2020",
      "rate": "",
      "helpful": "25 out of 31 found this helpful.",
      "title": "Klaus",
      "content": "We really missed the classic animation! Thanks to Netflix for its return. Klaus is an amazing cartoon that creates a festive atmosphere. The ending can really bring to tears."
    },
    {
      "username": "magdalena_",
      "userUrl": "https://www.imdb.com/user/ur110013908",
      "reviewLink": "https://www.imdb.com/review/rw5259068",
      "warningSpoilers": false,
      "date": "15 November 2019",
      "rate": "10",
      "helpful": "230 out of 245 found this helpful.",
      "title": "A New Christmas Classic",
      "content": "What a joy to watch! I absolutely loved this hand-drawn animated film, the story kept me entertained from start to finish and I'm very glad that Netflix is giving this art form a platform on its streaming service."
    },
    {
      "username": "doomedmac",
      "userUrl": "https://www.imdb.com/user/ur111092901",
      "reviewLink": "https://www.imdb.com/review/rw5731240",
      "warningSpoilers": false,
      "date": "12 May 2020",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Absolutely beautiful; a new Christmas classic",
      "content": "This film is absolutely amazing. It may be predictable, but it has more heart than most of the movies I've seen. This is a new Christmas classic."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw5533859",
      "warningSpoilers": false,
      "date": "7 March 2020",
      "rate": "8",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Klaus begins",
      "content": "As another reviewer stated this was a nice surprise! I did not expect it to be as good as it was. I thought it'd be just another animated movie, light fun and all. But it really has quite some heart to it. And it's an origin story as well. Many little things that work quite well. Be it the opposing groups, that have more in common that one may think. Or the adults versus kids/younger ones theme that runs through the whole thing.The animation may be a point of criticism for some, but overall that is nice too. Not to mention the voice talent recruited. While you may know where this will eventually be heading, the beginning at least may surprise you. In a positive way - as is the rest of the movie"
    }
  ],
  "errorMessage": ""
}