{
  "imDbId": "tt4729430",
  "title": "Klaus",
  "fullTitle": "Klaus (2019)",
  "type": "Movie",
  "year": "2019",
  "language": "en",
  "titleInLanguage": "Klaus (film)",
  "url": "https://en.wikipedia.org/wiki/Klaus_(film)",
  "plotShort": {
    "plainText": "Klaus is a 2019 Spanish-American animated Christmas adventure comedy film written and directed by Sergio Pablos in his directorial debut, produced by his company Sergio Pablos Animation Studios and distributed by Netflix. Co-written by Zach Lewis and Jim Mahoney, and co-directed by Carlos Martinez Lopez, the traditionally animated film stars the voices of Jason Schwartzman, J.K. Simmons, Rashida Jones, Will Sasso, Neda Margrethe Labba, Sergio Pablos (in a dual role), Norm Macdonald (in his final film role released in his lifetime), and Joan Cusack. Serving as an alternate origin story of Santa Claus independent from the historical Saint Nicholas of Myra and using a fictional 19th-century setting, the plot revolves around a postman stationed in an island town to the Far North who befriends a reclusive toymaker (Klaus).\r\nKlaus was released on 8 November 2019 and received critical acclaim for its animation, story, emotional depth, humour, narrative and vocal performances. It won seven awards at the 47th Annie Awards, including Best Animated Feature, and also won Best Animated Film at the 73rd British Academy Film Awards. The film was also nominated at the 92nd Academy Awards for Best Animated Feature, making it the first animated film from Netflix to be nominated for an Academy Award, as well as the first animated film from a streaming service to be nominated, alongside I Lost My Body (also Netflix), but lost to Toy Story 4, which also starred Cusack.",
    "html": "<p>Klaus is a 2019 Spanish-American animated Christmas adventure comedy film written and directed by Sergio Pablos in his directorial debut, produced by his company Sergio Pablos Animation Studios and distributed by Netflix. Co-written by Zach Lewis and Jim Mahoney, and co-directed by Carlos Martinez Lopez, the traditionally animated film stars the voices of Jason Schwartzman, J.K. Simmons, Rashida Jones, Will Sasso, Neda Margrethe Labba, Sergio Pablos (in a dual role), Norm Macdonald (in his final film role released in his lifetime), and Joan Cusack. Serving as an alternate origin story of Santa Claus independent from the historical Saint Nicholas of Myra and using a fictional 19th-century setting, the plot revolves around a postman stationed in an island town to the Far North who befriends a reclusive toymaker (Klaus).</p><p>Klaus was released on 8 November 2019 and received critical acclaim for its animation, story, emotional depth, humour, narrative and vocal performances. It won seven awards at the 47th Annie Awards, including Best Animated Feature, and also won Best Animated Film at the 73rd British Academy Film Awards. The film was also nominated at the 92nd Academy Awards for Best Animated Feature, making it the first animated film from Netflix to be nominated for an Academy Award, as well as the first animated film from a streaming service to be nominated, alongside I Lost My Body (also Netflix), but lost to Toy Story 4, which also starred Cusack.</p>"
  },
  "plotFull": {
    "plainText": "Klaus is a 2019 Spanish-American animated Christmas adventure comedy film written and directed by Sergio Pablos in his directorial debut, produced by his company Sergio Pablos Animation Studios and distributed by Netflix. Co-written by Zach Lewis and Jim Mahoney, and co-directed by Carlos Martinez Lopez, the traditionally animated film stars the voices of Jason Schwartzman, J.K. Simmons, Rashida Jones, Will Sasso, Neda Margrethe Labba, Sergio Pablos (in a dual role), Norm Macdonald (in his final film role released in his lifetime), and Joan Cusack. Serving as an alternate origin story of Santa Claus independent from the historical Saint Nicholas of Myra and using a fictional 19th-century setting, the plot revolves around a postman stationed in an island town to the Far North who befriends a reclusive toymaker (Klaus).\r\nKlaus was released on 8 November 2019 and received critical acclaim for its animation, story, emotional depth, humour, narrative and vocal performances. It won seven awards at the 47th Annie Awards, including Best Animated Feature, and also won Best Animated Film at the 73rd British Academy Film Awards. The film was also nominated at the 92nd Academy Awards for Best Animated Feature, making it the first animated film from Netflix to be nominated for an Academy Award, as well as the first animated film from a streaming service to be nominated, alongside I Lost My Body (also Netflix), but lost to Toy Story 4, which also starred Cusack.\r\nPlot\r\nIn 19th-century Norway, the Royal Postmaster General enrolls Jesper Johansen, his lazy, spoiled, self-centered son into a postman training academy hoping that it will reform him. Jesper deliberately underperforms, forcing his father to finally send him to the distant, northern island town of Smeerensburg with the task of posting 6,000 letters within a year. If Jesper fails, he will be cut off from the family's fortune.\r\nTwo familial clans—the Ellingboes and the Krums—comprise nearly all of Smeerensburg's populace and are perpetually feuding, spending more time hating each other than writing letters.\r\nWhile desperately searching for people to post letters to, Jesper finds an isolated house far outside the town. There, he discovers a tall reclusive woodsman named Klaus, who has a house filled with handmade toys. Terrified by Klaus' imposing appearance, Jesper flees, leaving behind a drawing he had found from one of Smeerensburg’s Krum children. Klaus forces Jesper to bring him to the house depicted in the drawing and then secretly delivers a toy to the boy inside, cheering him up.\r\nWord of this event spreads to other children and they go to Jesper the next day, each believing they will receive a toy if they send Klaus a letter. Jesper capitalizes on the idea and asks Klaus if he can donate his toys; Klaus agrees provided they operate at night and Jesper continues to deliver the toys in secret. The Krum boy's toy leads him to play with an Ellingboe girl, much to their clans’ outrage. Family elders Tammy Krum and Aksel Ellingboe soon find out it was Jesper and Klaus who delivered him the toy. Soon, more children begin writing letters to Klaus. When Jesper tells them Klaus only gives toys to good children and knows whenever any child misbehaves, the acts of kindness they perform gradually inspire the rest of the townsfolk to end their ancient dispute, and bitter teacher-turned-fishmonger Alva reopens her school to help children learn to read and write so they can send letters.\r\nEventually, Jesper and Klaus begin running out of toys. With Jesper's deadline approaching, he tries persuading Klaus to make more toys in time for Christmas. Klaus initially refuses, but then works with Jesper to build a sled for Márgu, a small girl living in an isolated settlement with her people. Klaus tells Jesper about his wife Lydia and explains he had made the toys to give to the children the couple hoped to have but could not conceive, and Lydia died from an illness. Realizing their work is spreading joy to the children, Klaus agrees to the Christmas plan with Márgu and the rest of her people arriving to help. As the town and his relationship with Alva flourish, Jesper finds himself wanting to stay in Smeerensburg.\r\nMeanwhile, family elders Aksel Ellingboe and Tammy Krum form a temporary truce, wanting to stop Jesper and Klaus so that the families can resume their traditional feud. Together, they post enough letters to meet well over Jesper's target and let his father know of this achievement. Jesper’s father arrives on Christmas Eve to congratulate his son, inadvertently revealing to Jesper's friends the selfish motives behind his deeds. Just before they leave town, Jesper's father notices his son's remorse, and after a private talk, he allows Jesper to stay. Jesper tries to stop the elders and their angry mob from destroying the Christmas toys but apparently fails. However, Alva had already been informed of the plot by the town's children, and had replaced the toys with decoys, aided by Klaus. During the chase for the toys, Mr. Ellingboe's daughter Magdalone and Mrs. Krum's son Olaf also fall in love.\r\nJesper is redeemed and Smeerensburg becomes a happy town, with the family elders being forced to end the feud due to the marriage of their children. Jesper marries Alva and raises two children. He and Klaus continue to deliver presents in Smeerensburg and beyond for eleven years. Then, on the twelfth year, Klaus follows a wisp of wind up a sunny hill and disappears, saying he is joining his departed wife. But although he is gone, Klaus lives on in Christmas stories, and so every subsequent Christmas Eve, Jesper still waits for Klaus, who returns every year to deliver toys across the world.\r\nVoice cast\r\nJason Schwartzman as Jesper Johansen, a postman who befriends Klaus and helps bring much-needed happiness to Smeerensburg while getting accustomed to a life outside of his comfort zone.\r\nJ. K. Simmons as Klaus (Santa Claus), an initially-reclusive large woodworker who makes toys. Simmons also provides the uncredited voice of the Drill Sarge, the assistant head of the Johansen family's postal department who works under the Royal Postmaster General.\r\nSimmons also provides the uncredited voice of the Drill Sarge, the assistant head of the Johansen family's postal department who works under the Royal Postmaster General.\r\nRashida Jones as Alva, a teacher turned fishmonger who becomes Jesper's love interest.\r\nWill Sasso as Mr. Aksel Ellingboe, the Ellingboe Clan patriarch carrying on an ancient feud of his clan with the Krums.\r\nNeda Margrethe Labba as Márgu, a young Sámi girl who becomes well acquainted with Jesper, despite their language barrier.\r\nSergio Pablos as: Olaf Krum, Mrs. Krum's imposing son who does not speak, but communicates using inhuman sounds. Pumpkin Ellingboe, Mr. Ellingboe's pampered and imposing daughter whose only word is \"mine\", except when she says \"Right\" when Mr. Aksel Ellingboe plots to have Jesper and Klaus eliminated.\r\nOlaf Krum, Mrs. Krum's imposing son who does not speak, but communicates using inhuman sounds.\r\nPumpkin Ellingboe, Mr. Ellingboe's pampered and imposing daughter whose only word is \"mine\", except when she says \"Right\" when Mr. Aksel Ellingboe plots to have Jesper and Klaus eliminated.\r\nNorm Macdonald as Mogens, the sarcastic ferryman of Smeerensburg who enjoys humor that comes at others' expense.\r\nJoan Cusack as Mrs. Tammy Krum, the Krum Clan matriarch carrying on an ancient feud of her clan with the Ellingboes.\r\nReiulf Aleksandersen and Sara Margrethe Oksal as adult Sami voices.\r\nSam McMurray as The Postmaster General (uncredited), Jesper's father and the headmaster of The Royal Post Academy who sends Jesper to Smeerensburg.\r\nAdditional children voices provided by Evan Agos, Sky Alexis, Jaeden Bettencourt, Teddy Blum, Mila Brener, Sydney Brower, Finn Carr, Kendall Joy Hall, Hayley Hermida, Lexie Holland, Brooke Huckeba, Matthew McCann, Tucker Meek, Leo Miller, Joaquin Obradors, Víctor Pablos, Lucian Perez, Bailey Rae Fenderson, Maximus Riegel, Emma Shannon, Ayden Soria, Sunday Sturz, Hudson West, Gordon Wilcox, Emma Yarovinskiy, and Julian Zane.\r\nAdditional adult voices provided by Brad Abrell, Catherine Cavadini, Bill Chott, Daniel Crook, Brian Finney, Stephen Hughes, Neil Kaplan, Sam McMurray, Amanda Philipson, Alyson Reed, Dee Dee Rescher, Dwight Schultz, Lloyd Sherr, Helen Slayton-Hughes, and Travis Willingham.\r\nProduction\r\nAfter setting up his own animation studio in Madrid, Spain, director Sergio Pablos, who had worked on Disney Renaissance films such as The Hunchback of Notre Dame, Hercules, and Tarzan, decided to develop a new traditionally-animated feature film. Pablos wanted to explore how the medium would have evolved had western animation film studios not switched to producing mostly computer animated films since the 1990s. For the film's look, the studio sought to overcome some of the technical limitations that traditional animation had, focusing on organic and volumetric lighting and texturing to give the film a unique look, while maintaining a hand-crafted feel. Proprietary tools from Les films du Poisson Rouge, a French company in Angoulême, were used to allow the team to produce a variety of visual development styles, with the aim of getting away from the standardized style of \"characters looking like stickers put on painted backgrounds.\" Fellow Disney animator James Baxter, known for Beauty and the Beast, also worked on the film.\r\nThe first teaser for the project was released in April 2012; at the time, the studio was seeking investment, co-production, and distribution partners. It was shopped around to various studios, but most studios rejected the movie viewing it as \"too risky.\" In November 2017, Netflix announced that they had acquired the global rights to Klaus; at the same time, the casting of Schwartzman, Jones, Simmons, and Cusack was announced along with a Christmas 2019 release date. In March 2019, it was reported that Netflix was planning an Oscar-qualifying run for Klaus in theaters, and it was listed as one of ten films Netflix was negotiating with chains to give limited releases prior to their online debuts that August. The film's release date was announced, alongside the debut of an official trailer, on 7 October.\r\nThe film is dedicated to animator and scene checker Mary Lescher who died on 2 June 2019 of cancer. She had worked on Klaus, as well as other animated features such as Beauty and the Beast and The Lion King. Pablos said Smeerensburg is a deliberate misspelling of Smeerenburg, a former Dutch and Norwegian whaling station in the Arctic archipelago of Svalbard.\r\nRelease\r\nKlaus was released theatrically in select theaters on 8 November 2019, and was released digitally through Netflix on 15 November. It is the first original animated feature film to appear on Netflix. In January 2020, Netflix reported the film was watched by 40 million members over its first four weeks of release.\r\nReception\r\nCritical response\r\nOn review aggregation website Rotten Tomatoes, the film has an approval rating of 95% based on 76 reviews with an average rating of 7.6/10. The critical consensus reads \"Beautiful hand-drawn animation and a humorous, heartwarming narrative make Klaus an instant candidate for holiday classic status.\" On Metacritic the film has a weighted average score of 65 out of 100, based on 13 critics, indicating \"generally favorable reviews\".\r\nJohn DeFore of The Hollywood Reporter gave the film a positive review, writing: \"Sergio Pablos' Klaus invents its own unexpected and very enjoyable origin story for the big guy who gives out toys every Christmas eve. Shaking off most Yuletide cliches in favor of a from-scratch story about how even dubiously-motivated generosity can lead to joy, it contains echoes of other seasonal favorites (especially, in a topsy-turvy way, Dr. Seuss' Grinch) while standing completely on its own.\" Peter Debruge of Variety gave the film a mixed review, calling the film over-complicated and saying: \"What goodwill the movie does inspire owes more to the splendid visual world than to anything the story supplies.\"\r\nAccording to data provided by Netflix to Reuters, the film racked up nearly 30 million views worldwide in its first month. The film beat Toy Story 4 for best Animated Film of 2019 on Animation Magazine.\r\nAccolades\r\nSoundtrack\r\n\"Invisible\" by Zara Larsson and \"How You Like Me Now?\" by The Heavy are featured in the film. The song \"High Hopes\" by Panic! at the Disco is featured in the trailer.",
    "html": "<p>Klaus is a 2019 Spanish-American animated Christmas adventure comedy film written and directed by Sergio Pablos in his directorial debut, produced by his company Sergio Pablos Animation Studios and distributed by Netflix. Co-written by Zach Lewis and Jim Mahoney, and co-directed by Carlos Martinez Lopez, the traditionally animated film stars the voices of Jason Schwartzman, J.K. Simmons, Rashida Jones, Will Sasso, Neda Margrethe Labba, Sergio Pablos (in a dual role), Norm Macdonald (in his final film role released in his lifetime), and Joan Cusack. Serving as an alternate origin story of Santa Claus independent from the historical Saint Nicholas of Myra and using a fictional 19th-century setting, the plot revolves around a postman stationed in an island town to the Far North who befriends a reclusive toymaker (Klaus).</p><p>Klaus was released on 8 November 2019 and received critical acclaim for its animation, story, emotional depth, humour, narrative and vocal performances. It won seven awards at the 47th Annie Awards, including Best Animated Feature, and also won Best Animated Film at the 73rd British Academy Film Awards. The film was also nominated at the 92nd Academy Awards for Best Animated Feature, making it the first animated film from Netflix to be nominated for an Academy Award, as well as the first animated film from a streaming service to be nominated, alongside I Lost My Body (also Netflix), but lost to Toy Story 4, which also starred Cusack.</p><br/><h3>Plot</h3><p>In 19th-century Norway, the Royal Postmaster General enrolls Jesper Johansen, his lazy, spoiled, self-centered son into a postman training academy hoping that it will reform him. Jesper deliberately underperforms, forcing his father to finally send him to the distant, northern island town of Smeerensburg with the task of posting 6,000 letters within a year. If Jesper fails, he will be cut off from the family's fortune.</p><p>Two familial clans—the Ellingboes and the Krums—comprise nearly all of Smeerensburg's populace and are perpetually feuding, spending more time hating each other than writing letters.</p><p>While desperately searching for people to post letters to, Jesper finds an isolated house far outside the town. There, he discovers a tall reclusive woodsman named Klaus, who has a house filled with handmade toys. Terrified by Klaus' imposing appearance, Jesper flees, leaving behind a drawing he had found from one of Smeerensburg’s Krum children. Klaus forces Jesper to bring him to the house depicted in the drawing and then secretly delivers a toy to the boy inside, cheering him up.</p><p>Word of this event spreads to other children and they go to Jesper the next day, each believing they will receive a toy if they send Klaus a letter. Jesper capitalizes on the idea and asks Klaus if he can donate his toys; Klaus agrees provided they operate at night and Jesper continues to deliver the toys in secret. The Krum boy's toy leads him to play with an Ellingboe girl, much to their clans’ outrage. Family elders Tammy Krum and Aksel Ellingboe soon find out it was Jesper and Klaus who delivered him the toy. Soon, more children begin writing letters to Klaus. When Jesper tells them Klaus only gives toys to good children and knows whenever any child misbehaves, the acts of kindness they perform gradually inspire the rest of the townsfolk to end their ancient dispute, and bitter teacher-turned-fishmonger Alva reopens her school to help children learn to read and write so they can send letters.</p><p>Eventually, Jesper and Klaus begin running out of toys. With Jesper's deadline approaching, he tries persuading Klaus to make more toys in time for Christmas. Klaus initially refuses, but then works with Jesper to build a sled for Márgu, a small girl living in an isolated settlement with her people. Klaus tells Jesper about his wife Lydia and explains he had made the toys to give to the children the couple hoped to have but could not conceive, and Lydia died from an illness. Realizing their work is spreading joy to the children, Klaus agrees to the Christmas plan with Márgu and the rest of her people arriving to help. As the town and his relationship with Alva flourish, Jesper finds himself wanting to stay in Smeerensburg.</p><p>Meanwhile, family elders Aksel Ellingboe and Tammy Krum form a temporary truce, wanting to stop Jesper and Klaus so that the families can resume their traditional feud. Together, they post enough letters to meet well over Jesper's target and let his father know of this achievement. Jesper’s father arrives on Christmas Eve to congratulate his son, inadvertently revealing to Jesper's friends the selfish motives behind his deeds. Just before they leave town, Jesper's father notices his son's remorse, and after a private talk, he allows Jesper to stay. Jesper tries to stop the elders and their angry mob from destroying the Christmas toys but apparently fails. However, Alva had already been informed of the plot by the town's children, and had replaced the toys with decoys, aided by Klaus. During the chase for the toys, Mr. Ellingboe's daughter Magdalone and Mrs. Krum's son Olaf also fall in love.</p><p>Jesper is redeemed and Smeerensburg becomes a happy town, with the family elders being forced to end the feud due to the marriage of their children. Jesper marries Alva and raises two children. He and Klaus continue to deliver presents in Smeerensburg and beyond for eleven years. Then, on the twelfth year, Klaus follows a wisp of wind up a sunny hill and disappears, saying he is joining his departed wife. But although he is gone, Klaus lives on in Christmas stories, and so every subsequent Christmas Eve, Jesper still waits for Klaus, who returns every year to deliver toys across the world.</p><br/><h3>Voice cast</h3><ul><li>Jason Schwartzman as Jesper Johansen, a postman who befriends Klaus and helps bring much-needed happiness to Smeerensburg while getting accustomed to a life outside of his comfort zone.</li><li>J. K. Simmons as Klaus (Santa Claus), an initially-reclusive large woodworker who makes toys. Simmons also provides the uncredited voice of the Drill Sarge, the assistant head of the Johansen family's postal department who works under the Royal Postmaster General.</li><li>Simmons also provides the uncredited voice of the Drill Sarge, the assistant head of the Johansen family's postal department who works under the Royal Postmaster General.</li><li>Rashida Jones as Alva, a teacher turned fishmonger who becomes Jesper's love interest.</li><li>Will Sasso as Mr. Aksel Ellingboe, the Ellingboe Clan patriarch carrying on an ancient feud of his clan with the Krums.</li><li>Neda Margrethe Labba as Márgu, a young Sámi girl who becomes well acquainted with Jesper, despite their language barrier.</li><li>Sergio Pablos as: Olaf Krum, Mrs. Krum's imposing son who does not speak, but communicates using inhuman sounds. Pumpkin Ellingboe, Mr. Ellingboe's pampered and imposing daughter whose only word is \"mine\", except when she says \"Right\" when Mr. Aksel Ellingboe plots to have Jesper and Klaus eliminated.</li><li>Olaf Krum, Mrs. Krum's imposing son who does not speak, but communicates using inhuman sounds.</li><li>Pumpkin Ellingboe, Mr. Ellingboe's pampered and imposing daughter whose only word is \"mine\", except when she says \"Right\" when Mr. Aksel Ellingboe plots to have Jesper and Klaus eliminated.</li><li>Norm Macdonald as Mogens, the sarcastic ferryman of Smeerensburg who enjoys humor that comes at others' expense.</li><li>Joan Cusack as Mrs. Tammy Krum, the Krum Clan matriarch carrying on an ancient feud of her clan with the Ellingboes.</li><li>Reiulf Aleksandersen and Sara Margrethe Oksal as adult Sami voices.</li><li>Sam McMurray as The Postmaster General (uncredited), Jesper's father and the headmaster of The Royal Post Academy who sends Jesper to Smeerensburg.</li></ul><p>Additional children voices provided by Evan Agos, Sky Alexis, Jaeden Bettencourt, Teddy Blum, Mila Brener, Sydney Brower, Finn Carr, Kendall Joy Hall, Hayley Hermida, Lexie Holland, Brooke Huckeba, Matthew McCann, Tucker Meek, Leo Miller, Joaquin Obradors, Víctor Pablos, Lucian Perez, Bailey Rae Fenderson, Maximus Riegel, Emma Shannon, Ayden Soria, Sunday Sturz, Hudson West, Gordon Wilcox, Emma Yarovinskiy, and Julian Zane.</p><p>Additional adult voices provided by Brad Abrell, Catherine Cavadini, Bill Chott, Daniel Crook, Brian Finney, Stephen Hughes, Neil Kaplan, Sam McMurray, Amanda Philipson, Alyson Reed, Dee Dee Rescher, Dwight Schultz, Lloyd Sherr, Helen Slayton-Hughes, and Travis Willingham.</p><br/><h3>Production</h3><p>After setting up his own animation studio in Madrid, Spain, director Sergio Pablos, who had worked on Disney Renaissance films such as The Hunchback of Notre Dame, Hercules, and Tarzan, decided to develop a new traditionally-animated feature film. Pablos wanted to explore how the medium would have evolved had western animation film studios not switched to producing mostly computer animated films since the 1990s. For the film's look, the studio sought to overcome some of the technical limitations that traditional animation had, focusing on organic and volumetric lighting and texturing to give the film a unique look, while maintaining a hand-crafted feel. Proprietary tools from Les films du Poisson Rouge, a French company in Angoulême, were used to allow the team to produce a variety of visual development styles, with the aim of getting away from the standardized style of \"characters looking like stickers put on painted backgrounds.\" Fellow Disney animator James Baxter, known for Beauty and the Beast, also worked on the film.</p><p>The first teaser for the project was released in April 2012; at the time, the studio was seeking investment, co-production, and distribution partners. It was shopped around to various studios, but most studios rejected the movie viewing it as \"too risky.\" In November 2017, Netflix announced that they had acquired the global rights to Klaus; at the same time, the casting of Schwartzman, Jones, Simmons, and Cusack was announced along with a Christmas 2019 release date. In March 2019, it was reported that Netflix was planning an Oscar-qualifying run for Klaus in theaters, and it was listed as one of ten films Netflix was negotiating with chains to give limited releases prior to their online debuts that August. The film's release date was announced, alongside the debut of an official trailer, on 7 October.</p><p>The film is dedicated to animator and scene checker Mary Lescher who died on 2 June 2019 of cancer. She had worked on Klaus, as well as other animated features such as Beauty and the Beast and The Lion King. Pablos said Smeerensburg is a deliberate misspelling of Smeerenburg, a former Dutch and Norwegian whaling station in the Arctic archipelago of Svalbard.</p><br/><h3>Release</h3><p>Klaus was released theatrically in select theaters on 8 November 2019, and was released digitally through Netflix on 15 November. It is the first original animated feature film to appear on Netflix. In January 2020, Netflix reported the film was watched by 40 million members over its first four weeks of release.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>On review aggregation website Rotten Tomatoes, the film has an approval rating of 95% based on 76 reviews with an average rating of 7.6/10. The critical consensus reads \"Beautiful hand-drawn animation and a humorous, heartwarming narrative make Klaus an instant candidate for holiday classic status.\" On Metacritic the film has a weighted average score of 65 out of 100, based on 13 critics, indicating \"generally favorable reviews\".</p><p>John DeFore of The Hollywood Reporter gave the film a positive review, writing: \"Sergio Pablos' Klaus invents its own unexpected and very enjoyable origin story for the big guy who gives out toys every Christmas eve. Shaking off most Yuletide cliches in favor of a from-scratch story about how even dubiously-motivated generosity can lead to joy, it contains echoes of other seasonal favorites (especially, in a topsy-turvy way, Dr. Seuss' Grinch) while standing completely on its own.\" Peter Debruge of Variety gave the film a mixed review, calling the film over-complicated and saying: \"What goodwill the movie does inspire owes more to the splendid visual world than to anything the story supplies.\"</p><p>According to data provided by Netflix to Reuters, the film racked up nearly 30 million views worldwide in its first month. The film beat Toy Story 4 for best Animated Film of 2019 on Animation Magazine.</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>List of awards and nominations</caption><tbody><tr><th>Award</th><th>Date of ceremony</th><th>Category</th><th>Recipient(s)</th><th>Result</th><th><abbr title=\"References\">Ref.</abbr></th></tr><tr><td><span>Academy Awards</span></td><td><span>9 February 2020</span></td><td><span>Best Animated Feature</span></td><td><span>Sergio Pablos</span>, Jinko Gotoh and Marisa Román</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>British Academy Film Awards</span></td><td><span>2 February 2020</span></td><td><span>Best Animated Film</span></td><td>Sergio Pablos and Jinko Gotoh</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Alliance of Women Film Journalists</span></td><td>10 January 2020</td><td>Best Animated Feature</td><td><i>Klaus</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"7\"><span>Annie Awards</span></td><td rowspan=\"7\"><span>25 January 2020</span></td><td><span>Best Animated Feature</span></td><td>Jinko Gotoh, Sergio Pablos, Marisa Román, Matthew Teevan, Mercedes Gamero, Mikel Lejarza Ortiz and Gustavo Ferrada</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"7\"></td></tr><tr><td><span class=\"mw-redirect\">Best Character Animation in a Feature Film</span></td><td>Sergio Martins (animation supervisor)<p><small>for \"Alva\"</small></p></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Best Character Design in a Feature Film</span></td><td>Torsten Schrank</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Best Directing in a Feature Film</span></td><td><span>Sergio Pablos</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Best Production Design in a Feature Film</span></td><td>Szymon Biernacki, Marcin Jakubowski</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Best Storyboarding in a Feature Film</span></td><td>Sergio Pablos</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Editorial in a Feature Film</td><td>Pablo García Revert</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Austin Film Critics Association Awards</span></td><td>6 January 2020</td><td>Best Animated Feature</td><td rowspan=\"3\"><i>Klaus</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>Detroit Film Critics Society Awards</span></td><td>9 December 2019</td><td>Best Animated Feature</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"2\"><span>Goya Awards</span></td><td rowspan=\"2\"><span>25 January 2020</span></td><td><span>Best Animated Feature</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>Best Original Song</td><td rowspan=\"2\">\"<span>Invisible</span>\"<p><small>Jussi Ilmari Karvinen, <span>Caroline Pennell</span>, <span>Justin Tranter</span> (songwriters)</small></p></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">St. Louis Film Critics Association Awards</span></td><td>15 December 2019</td><td>Best Animated Feature</td><td style=\"background: #DFF; vertical-align: middle; text-align: center;\" class=\"table-cast\">Runner-up <small>(tied w/ <span>Frozen II</span>)</small></td><td></td></tr><tr><td rowspan=\"2\"><span>Visual Effects Society</span></td><td rowspan=\"2\"><span>29 January 2020</span></td><td><span>Outstanding Visual Effects<wbr> in an Animated Feature</span></td><td>Sergio Pablos, Matthew Teevan, Marcin Jakubowski and Szymon Biernacki</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td>Outstanding Animated Character<wbr> in an Animated Feature</td><td>Yoshimishi Tamura, Alfredo Cassano, Maxime Delalande and <span>Jason Schwartzman</span><p><small>for \"Jesper\"</small></p></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Washington D.C. Film Critics Association Awards</span></td><td>8 December 2019</td><td>Best Animated Feature</td><td><i>Klaus</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>European Film Awards</span></td><td><span>12 December 2020</span></td><td>Best Feature Film</td><td><i>Klaus</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span class=\"extiw\">Quirino Award</span></td><td>27 June 2020</td><td>Best Ibero-American Animation Feature Film</td><td><i>Klaus</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>British Academy Children's Awards</span></td><td><span>27 November 2022</span></td><td><span>Best Feature Film</span></td><td>Tomm Moore, Ross Stewart and Paul Young</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr></tbody></table><br/><h3>Soundtrack</h3><p>\"Invisible\" by Zara Larsson and \"How You Like Me Now?\" by The Heavy are featured in the film. The song \"High Hopes\" by Panic! at the Disco is featured in the trailer.</p><br/>"
  },
  "errorMessage": ""
}