{
  "imDbId": "tt0117951",
  "title": "Trainspotting",
  "fullTitle": "Trainspotting (1996)",
  "type": "Movie",
  "year": "1996",
  "items": [
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw5261062",
      "warningSpoilers": false,
      "date": "16 November 2019",
      "rate": "9",
      "helpful": "110 out of 116 found this helpful.",
      "title": "Now I See Why",
      "content": "I'm an old guy. I'm also a movie fan with an open mind. This is one of those films that is often referred to by critics as being very important. When I read the description of it, my first reactions was to totally avoid it. But it has in it some really great actors and I've been taken with the guy from Elementary. Well, was I surprised. While it was hard to watch as these young men dropped into the depths of addiction, I began to be fascinated by them. They were individuals who had aspirations and lives; they were good and bad. But were continually brought down by their mistakes. Those who say this glorifies drugs have totally missed the point."
    },
    {
      "username": "Prismark10",
      "userUrl": "https://www.imdb.com/user/ur4569900",
      "reviewLink": "https://www.imdb.com/review/rw3602356",
      "warningSpoilers": false,
      "date": "19 December 2016",
      "rate": "8",
      "helpful": "29 out of 32 found this helpful.",
      "title": "Choose life",
      "content": "Trainspotting is a magnetic, exhilarating, repulsive film based in a seedy underbelly of Edinburgh. Thieves, drug addicts and a violent type of underclass live in doss houses with babies crawling round innocently unaware of the dangers they face.Renton (Ewan McGregor) is a heroin addict living day to day, stealing and looking for that hit. It is an empty life and he realises he needs to kick the habit but each time he tries to get off heroin something drags him back.Renton experiences the high side of heroin but he knows the low side is too high a price to pay. His friends and associates are making it difficult for him to stay clean.Director Danny Boyle infused the film with a kinetic energy helped by its soundtrack. It is trippy, disjointed, hip even amoral in places. Despite its cool reputation it shows the ugliness of addiction. Especially with the character of Tommy who is a fitness fanatic and clean but turns to drugs when his girlfriend leaves him and he dies a horrible death.Like the movie A Clockwork Orange the film is driven by the narration of its central character which keeps the story together and brings out the dark humour.I only saw the film for the first time twenty years after its cinema release and was impressed how well it has stood up to the test of time."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0398029",
      "warningSpoilers": false,
      "date": "20 January 2004",
      "rate": "",
      "helpful": "249 out of 310 found this helpful.",
      "title": "Hilarious, imaginative and very anti-drugs",
      "content": "Renton is a heroin addict. He is one of a group of friends who live their lives day to day and hit to hit. When he tries to kick the habit he manages it for a while but eventually falls back into his old way. Meanwhile his friends are as messed up as he is, whether it be Spud's pathetic addiction, Begbie's violent rages or the fact that he is sleeping with a girl who still goes to school.When it came out this film was very hyped, the poster became a must-have on every student's bedroom wall and the media went nuts over it's supposed glamorisation of drug use. The plot is very difficult to summarise, as it doesn't really have a narrative flow other than the very disjointed experience of Renton. However it manages to be very funny and imaginative all the way, using many different tricks and touches to be funny. The dialogue is very well written and I must admit I found it a lot funnier than the last few comedies I watched.The media may have condemned this film as promoting drug use, but I can only imagine that they watched a different film from me. Sure, the film shows drugs as being fun and enjoyable but, like Renton says, `why else would we do it?' However the film clearly shows a massive downside where people's lives are destroyed, people OD and lives go day to day just trying to get high. True, it does show this downside in a stylish and funny way but there is no question that the film is promoting drug use in any sense.Too often I see films that are style over substance; Trainspotting gets it just perfect, stylish but not at the expense of dialogue, character or film. It is helped by a great cast. McGregor jumped to stardom off the back of this role and he deserved it. He keeps his character both likeable but repulsive at the same time and carries the film with surprising ease. The support cast is excellent, even if they lack the same good character of Renton. Whether it is the comic Bremner, the violent Carlyle or the tragic McKidd. While not all their characters are well developed, they do all give good accounts of themselves, whether it is comic or showing the effects of heroin on their lives.Overall this is a great film that is refreshing to see now without all the `cult student cool' hype or media feeding frenzy over it's supposed pro-drug approach. It is stylish, funny, depressing and downright sobering."
    },
    {
      "username": "ametaphysicalshark",
      "userUrl": "https://www.imdb.com/user/ur11842025",
      "reviewLink": "https://www.imdb.com/review/rw1838512",
      "warningSpoilers": false,
      "date": "12 March 2008",
      "rate": "",
      "helpful": "116 out of 140 found this helpful.",
      "title": "A triumphant masterpiece",
      "content": "Danny Boyle's \"Trainspotting\" is a film in which everything goes the right way. Few films are fortunate to 'be' at the right time and right place and take the world by storm as \"Trainspotting\" did, but the ultimate proof of this film's greatness is that if you watched it alone or with a large group of people, in 2008 or in 1996, it has the same effect- absolute power. This film is nothing more- or less- than one of the most effective and perfect artistic works ever committed to celluloid.The film follows the lives of a group of drug attics in Scotland in the late 1980's but is constructed less as a conventional narrative and more as a series of vignettes connected by characters and set to the film's dazzling soundtrack (the fact that I mention the scenes being 'set' to the soundtrack is proof of its importance in this particular film). Almost every scene is as powerful as the next, with three montages in particular being possibly the definitive examples of how to do a memorable cinematic montage.Pop culture has been kind to \"Trainspotting\", remembering it as a unique and great film, especially in Britain. I certainly do not disagree with this consensus, but I feel the film has been hurt by familiarity, with even television series like \"Family Guy\" parodying the film's well-known scenes (and badly). This doesn't mean that the film's popularity is being hurt, but that it doesn't feel as fresh and original to people now as it did back in 1996. This is hardly the thing the film's reputation suffers most from however, with the significantly large number of people who claim the film supports and promotes drug use. I have to ask, and forgive my rudeness, how stupid can you possibly be? No, drug addicts in this film are not vilified, but they are consistently shown in a brutally realistic and horrifically tragic context, and just because the film doesn't go out of its way to emotionally manipulate you into completely hating its characters doesn't mean that it promotes drug use, it means that it's a knowing film careful enough not to become a sappy, melodramatic Hollywood product. The acting is phenomenal, the music is terrific, the film is a pitch-perfect example of energizing editing and brilliant use of montage, and its script is one of the best ever written, alternately hilarious, horrifying, tragic, and benefiting from a rare level of depth and resonance. A British classic is what Trainspotting is recognized as, and a British classic is what it is. 10/10"
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw4190632",
      "warningSpoilers": false,
      "date": "4 June 2018",
      "rate": "10",
      "helpful": "117 out of 138 found this helpful.",
      "title": "One Of THE Defining Movies Of The 90s And A Milestone For British Cinema",
      "content": "I remember what a raw shock of creative energy this film was when it came out, and I still marvel at what an imaginative way the director found to tell this crazy, immoral tale. The superb cinematography; the amazing cast of young actors (who have all gone on to become hugely successful in film and tv since); the iconic soundtrack: it all just fits together perfectly. 'Trainspotting' is as hilarious as it is deeply disturbing, but most importantly (and unlike many other films concerned with addiction) it's one hell of an entertaining flick and doesn't drag for a second.We all know drugs are bad. The problem is, they can also be fun - at least at the beginning, which is one of the reasons people are drawn to them. 'Trainspotting' is the first movie I remember watching that actually conveyed that seductive quality of drugs and managed to honestly portray the reckless, hedonistic lifestyle a part of my generation - the so called \"Generation X\" - fell victim to. It's an amazing achievement, in every regard; not only does it manage to be true to its serious subject matter without resorting to moralizing, it's also masterclass filmmaking and a milestone of British Cinema. 10 stars out of 10.Favorite films: IMDb.com/list/mkjOKvqlSBs/Favorite TV-Shows reviewed: imdb.com/list/ls075552387/Lesser-Known Masterpieces: imdb.com/list/ls070242495/Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/"
    },
    {
      "username": "RobertF87",
      "userUrl": "https://www.imdb.com/user/ur2531610",
      "reviewLink": "https://www.imdb.com/review/rw0398034",
      "warningSpoilers": false,
      "date": "28 February 2004",
      "rate": "",
      "helpful": "294 out of 363 found this helpful.",
      "title": "The Greatest British Movie of All Time",
      "content": "This film became almost a cultural phenomenon as soon as it was released in Britain in February 1996.Adapted from the first (and best) book by Irvine Welsh, the film shows the lives of a group of Edinburgh heroin addicts.The film is a black comedy, at times hilarious, tragic, surreal, brutal and uplifting. The film is full of memorable moments such as the chase down Edinburgh's Princes Street which opens the film (I happened to be there when they were filming that scene) and Ewan McGregor diving down the \"Worst Toilet in Scotland\" headfirst.The film doesn't condemn drug addicts, but it is probably more effective then any amount of preachy moralising as it depicts the devastating consequences that can happen to drug users. The film is well acted by a cast who have (mostly) become pretty famous since. Especially memorable is Robert Carlyle as the violent Begbie.I have seen this film many times. It is an instant classic. Go check it out."
    },
    {
      "username": "MichaelMargetis",
      "userUrl": "https://www.imdb.com/user/ur5077160",
      "reviewLink": "https://www.imdb.com/review/rw1070065",
      "warningSpoilers": true,
      "date": "29 April 2005",
      "rate": "10",
      "helpful": "60 out of 77 found this helpful.",
      "title": "The Wild & Crazy Indie Smash Hit that Started My Love For Independent Film",
      "content": "#1 BEST FILM OF 1996 Young filmmaker Danny Boyle's film adaptation of Irvine Welsh's incredible novel, about a band of social misfits that just so happen to be sleazy heroin junkies, is the movie that got me hooked on independent flicks. One late Friday night I was cruising through the movie channels on Satellite and I stumbled upon a channel called IFC (Independent Film Channel). On it there was this film 'Trainspotting'. I watched it and immediately fell in love with it. I never really saw anything quite like it, it was stylish, cool, depressing, dark and disturbing all at the same time. After this I got hooked on IFC channel, and if it wasn't for the smash U.K. hit 'Trainspotting', I might have never watched an independent film.Following the novel surprisingly closely, 'Trainspotting' revolves around a band of friends. Most are heroin junkies, one is an alcoholic psycho and the other is actually a good guy. These friends play soccer together and hang out all the time. They are led by Mark Renton (played by Ewan McGregor - Star Wars, Moulin Rouge) the central character and narrator of this macabre yet intriguing tale. We watch him as he tries to get off heroin and how this effects his friends -- Spud (Ewen Bremner - Snatch., The Acid House) a silly, naive, never-hurt-a-fly kind of heroin addict who serves as the film's oaf; Sick Boy (Jonny Lee Miller - Dracula 2000, Hackers) a selfish, sneaky and manipulative heroin junkie obsessed with James Bond who Renton secretly despises; Tommy (Kevin McKidd - The Acid House) the only honest friend of Renton's who is drug and alcohol free; and Francis Begbie (Robert Carlyle - The Full Monty, Riff Raff) a deranged, alcoholic violent madman with a mean temper and a large knife. The story follows Renton's struggle to get off drugs and start a life while interacting with his friends and eventually arranging a drug deal with them at the end to strike it rich.'Trainspotting' is a nearly perfect picture with extraordinary acting, directing and writing. The performances are nothing short of first-rate in 'Trainspotting'. Ewan McGregor gives perhaps his finest and most unfairly ignored screen performances as our hero and struggling heroin junkie. He plays the role with such authenticity and passion for the craft of acting you'd never think he wasn't a heroin junkie in real life. Ewen Bremner is funny as the film's idiot, but Jonny Lee Miller surprisingly gives an outstanding performance as Renton's slippery so-called friend. Kevin McKidd is good as Tommy and Kelly MacDonald does a fine job with her acting debut as Renton's underage lay who becomes kind of like a mentor to him as the film progresses. One of the absolute finest performances in this movie is by Robert Carlyle, most known as a British acting coach. It's hard to explain why he's so wonderful, but I'll try. He plays the bad guy in a way that it makes you uncomfortable and scared watching him. That takes talent and it's not easy to do for any actor. Danny Boyle provides us with breathtaking camera work and has some Tarantino-ish qualities, that makes him one of the most talented filmmakers working in the independent film industry. There is a scene in which the main character, Renton, is going through withdrawal and he has a hallucination of a friend's deceased infant child crawls up on his bedroom wall and spins his head all the way around in a kind of Linda Blair Exorcist style. It's a freaky scene but it's also a carefully layered and admirable scene that proves Danny Boyle's directing talents to be most impressive. John Hodge (who writes most of Boyle's films) does a phenomenal job capturing the material from Welsh's groundbreaking and provocative novel that should have won him the Oscar in the 1997 Academy Award ceremony. The cinematography is consistently amazing but the film editing is a tad choppy. But, that's not really something to get bent out of shape about, because the rest of the film is always engrossing especially the magnificent and extensive soundtrack including music from Blur, Lou Reed and Iggy Pop.All in all, 'Trainspotting' is an astounding indie achievement from British filmmaker Danny Boyle who also did the highly successful indie romp 'Shallow Grave' starring Ewan McGregor and the major flop 'The Beach' starring Leonardo DiCaprio and Robert Carlyle. If you've never seen 'Trainspotting' and have a very strong stomach and an urge to see something peculiar yet brilliant, be sure to rent it your next stop at the videostore. If you've seen it and liked it enough to purchase it, be sure to get the the 2-disc special edition DVD with some excellent extras including full-length audio commentary with some insightful information. 'Trainspotting' is the film that started my love with indie cinema. Be sure you don't miss it. Grade: AMADE MY TOP 300 LIST AT #27"
    },
    {
      "username": "gcd70",
      "userUrl": "https://www.imdb.com/user/ur13887584",
      "reviewLink": "https://www.imdb.com/review/rw1845909",
      "warningSpoilers": true,
      "date": "25 March 2008",
      "rate": "7",
      "helpful": "11 out of 12 found this helpful.",
      "title": "In your face cinema",
      "content": "Amazingly in your face cinema from director Danny Boyle and writer John Hodge. Adapted form Irvine Welsh's novel, this is the story of four desperate heroine addicts who chose hard drugs rather than life. Instead of the drudgery of the every day, they prefer the ecstatic rush of the heroine hit.Audiences will have to ride through the early scenes that may put you off public toilets (among other things) for life. If you are even the least bit queasy, then \"Trainspotting\" is one film you should avoid. Containing much 'toilet' humour and graphic drug use scenes, this is not cinema for the faint hearted.Once you've adapted to Boyle's full on style (which contains some violence too), then you can really start to appreciate the sharp, incisive script from John Hodge, with its clever, biting humour which forces you to laugh at a way of life that is as close to rock bottom as you can get. Boyle and Hodge have given their film a unique Scottish feel, and the culture and psyche of Edinburgh's down and out comes through brilliantly.Of course there is the question of whether this flick glorifies drug addiction. Some aspects of the abuse of heroine are conveyed as a fantastic rush and a great escape, generally though the addicts are shown to be no-hopers headed for nothing but death and destruction.The other immensely enjoyable aspect of \"Trainspotting\" is the fantastic cast. Ewan McGregor heads up the young thesps as \"Mark Renton\", the central figure in the story and the only guy we really hold out any hope for. Backing him up is Ewen Bremner as \"Spud\", the nervous young lad whose fetish for \"speed\" makes him very excitable. Jonny Lee Miller is \"Sick Boy\", another rather twisted individual whom we find has a heart beneath his deceptive, tough exterior. But the real psycho is Begbie (Robert Carlyle), a guy who wouldn't touch hard drugs and believes that those who use them are soft in the head. His violent temper and passion for brawling make him a distinctly unlikeable chap. Then there's Tommy (Kevin McKidd), straight guy and fitness freak who enjoys taping erotic encounters with long term love Liz. Finally there is young Diane, a feisty femme who proves a handful, and a surprise, for young Renton. All performances from this collective band are strong, with McGregor the shining beacon at the top.Brian Tufano delivers some confronting cinematography, Masahiro Hirakubo supplies the sharp editing and the soundtrack contains a fresh collection of trendy tunes.Tuesday, July 2, 1996 - Hoyts Cinema Centre MelbourneSeeing Danny Boyle's \"Trainspotting\" for a second time really helps clarify what the movie is about, and that is what a dreadful life one can have if one chooses a drug of addiction such as heroin. On the other hand, if one chooses life, it can be a very intoxicating drug, as young Renton finally discovers.Standouts are still Boyle's in your face direction which leaves no aspect of the destitution of drug abuse untouched, and the performances from Ewan McGregor, Ewen Bremner, Jonny Lee Miller, Kevin McKidd, Robert Caarlyle and Kelly McDonald which bring to life the vivid characters who live this sorry existence.A groovy soundtrack accompanies Boyle's innovative film.Monday, April 7, 1997 - Hoyts Croydon"
    },
    {
      "username": "Barky44",
      "userUrl": "https://www.imdb.com/user/ur2976262",
      "reviewLink": "https://www.imdb.com/review/rw1046957",
      "warningSpoilers": false,
      "date": "26 March 2005",
      "rate": "8",
      "helpful": "28 out of 33 found this helpful.",
      "title": "What a horrible movie! Two thumbs up!",
      "content": "Trainspotting is the story of a humor, violence, goofiness, abuse, friendship and sadness in heroin-addicted Scotland.It's a really vulgar film, with lots of disgusting scatological humor, pointless violence, and the pain of a life on heroin.But it's very well done, with a snappy, realistic script, lots of genuinely funny moments, some truly moving and sad scenes about this horrible existence, and, in the end, many important things to say.I ended up liking this movie, even with the harshness of some of the scenes. I don't know if I necessarily need to see it again, but it's worth seeing once.8 out of 10.Barky"
    },
    {
      "username": "Sergeant_Tibbs",
      "userUrl": "https://www.imdb.com/user/ur11148131",
      "reviewLink": "https://www.imdb.com/review/rw1721380",
      "warningSpoilers": false,
      "date": "30 August 2007",
      "rate": "9",
      "helpful": "121 out of 171 found this helpful.",
      "title": "Take the best orgasm you've ever had multiply it by a thousand and you're still nowhere near \"Trainspotting.\"",
      "content": "In 1996 John Hodge took Irvine Welsh's novel \"Trainspotting\" and with the help of Danny Boyle's direction created one of the most influential, modern cult classics Britain has to offer. Commonly ranked among the greatest films of the 90s; \"Trainspotting\" delivers satisfactory viewing every single time. The essential drug film.The term \"trainspotting\" in this case, is not the non-drug based hobby, but has two meanings for this film. A) The act of \"trainspotting\" is UK slang for trying to find a vein to intravenously inject drugs. And B) A joke not featured in the film, but two of the characters go to a disused train station to buy drugs and say they are going \"trainspotting\".Ewan McGregor stars as Mark Renton, a performance that put him on the map, a man who spends; or wastes, most of his time taking drugs with his friends in one of their apartments. Until he decides to finally pack it in and go cold turkey. We see the highs and lows of the drugs as Renton attempts to build a new life. He battles the strain and the influences of his mates; including Sick Boy (Johnny Lee Miller) a man who stops at nothing to take all, Spud (Ewen Bremner) a fast-paced anxious performance and Francis Begbie (Robert Carylye) a frighteningly intense character who is possibly my favourite of all-time; and Renton's sex life.Vibrant colour is used to exaggerate the actions to intensify the imagery on screen. This also makes it stand out from other films creating a massive impact on the viewer. Unforgettable. The soundtrack consists of the pop culture the characters themselves love and some regularly featured in real life at the time. The film captures the era perfectly.Danny Boyle's stylish direction is what mainly is so appealing about the film. Delivering an expertly structured adrenalin rush. The daring topic of the film was well perceived by critics and audiences to claim universal praise. But, they were still unsure if it was supporting drugs or an anti-drug film. In a way it is both.We are guided through the film with Renton's narration, making it an extremely watchable viewing, one irresistible to want to experience several times. A hilarious triumph. This is movie-making at its most exhilarating.9/10"
    },
    {
      "username": "lucidshard",
      "userUrl": "https://www.imdb.com/user/ur3641122",
      "reviewLink": "https://www.imdb.com/review/rw0975722",
      "warningSpoilers": false,
      "date": "10 December 2004",
      "rate": "10",
      "helpful": "429 out of 490 found this helpful.",
      "title": "Sublimely excellent",
      "content": "After reading some of the reviews that trash this film I had to speak up.This film is gritty and dirty. There is content which is not pleasant, swearing and violence amounts other things. What else would you expect a film about drug addiction to be about? Well more than that actually, it about choices and what you Choose! Never at any point did this film make drugs look at all appealing to me in any way, I never did understand why so many people thought that it did. At no point did it ever say \"Look at this, its cool.\" For those who think the level of swearing in this film is too much then they clearly haven't spent any time with working class people in Britain, not just Scotland. I being one of them can say its fairly accurate in that account.That being said, those things do not take anything away from the film, the quality of plot and story, or the acting which is Stunning! Robert Carlise as Begbe was excellent, and Ewan MacGregor shined. Also the character Spud was worth a mention he really was quite good.This film is in my Opinion a work of Genius, that represents the book accurately."
    },
    {
      "username": "omophagia-2",
      "userUrl": "https://www.imdb.com/user/ur0600342",
      "reviewLink": "https://www.imdb.com/review/rw0397941",
      "warningSpoilers": false,
      "date": "25 March 2000",
      "rate": "10",
      "helpful": "388 out of 464 found this helpful.",
      "title": "One of the best films of the 1990s.",
      "content": "In the aftermath of _Pulp Fiction_, much of the filmmaking of the 1990s thrived upon attempts to appear \"edgy\" within the constructs of independent films, or merely to provide empty shock value cliches. And no film ever came close to the sheer cleverness of Tarantino's masterpiece._Trainspotting_, however, somehow manages to take the excesses of the mid-90s and rise far, far above the cinematic cliches that it easily could have become. A film that tackles any hot-button social issue can, and usually does, simply become a didactic propaganda piece. Thankfully, _Trainspotting_ is vastly more intelligent in its edginess and its shock.In order to appreciate _Trainspotting_ fully, the viewer must abandon any preconceptions about what defines truly great cinema, because this film defies convention at nearly every turn. And with the rapid pace of its plot, that's quite a bit of ground to cover.Though a great deal of the picture's brilliance is derived from director Danny Boyle's consistent rejection of typical cinematic techniques, the most satisfying and _best_ aspect of _Trainspotting_ is that Boyle creates a film that is neither pro-drug or anti-drug. Instead, he maintains a rare objectivity throughout the film, depicting this fascinating array of complex, beautifully acted characters with an honesty that it seldom captured on film. And, given the life that each character lives, it's nearly incomprehensible that a director would refrain from influencing the viewer's impressions in any way, yet that's exactly what Boyle does.The dialogue-- or at least what portions of the brogue-drenched dialogue American viewers will be able to comprehend-- is alternately hilarious, raw, and brutal. And Ewan McGregor, Jonny Lee Miller, and Robert Carlyle bring a remarkable compassion and depth to their portrayals of characters that could have easily lapsed into cliche.Despite its sheer brilliance, _Trainspotting_ is not a film that's easy to watch. The viewer is bombarded with images that transcend visceral discomfort in their horror-- this movie contains two of the most graphic, horrifying scenes I've ever encountered. But, amazingly, none of these elements is used merely for shock value. Though the viewer will be mortified by some of the things that happen onscreen-- the well-documented dive into Scotland's most vile public toilet, for example-- these scenes all make _perfect sense_ within the context of a masterfully told story.In order to notice all of the subtlety that also exists in _Trainspotting_, repeat viewings are necessary, primarily to reduce some of the most powerful shocks ever-so-slightly, though their effects are never lost entirely. Some of the images will likely haunt even the most cynical, jaded viewer for weeks.RATING: 10 out of 10. Never patronizing and completely unpretentious, _Trainspotting_ is one of the most daring, unconventional films ever made. It inspires a level of discomfort rivaled by very few movies, because, even at its most graphic, Boyle never insults the viewer with mere shock tactics. Brilliantly acted, directed, and written, with a truly rare objectivity that allows each viewer to interpret its story on his/her own terms."
    },
    {
      "username": "briancham1994",
      "userUrl": "https://www.imdb.com/user/ur5788055",
      "reviewLink": "https://www.imdb.com/review/rw6692519",
      "warningSpoilers": false,
      "date": "14 March 2021",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Gritty portrayal of urban poverty",
      "content": "This film is dark but also has a deep sense of realism. The subject matter of this film invites comparisons to Requiem for a Dream (2000). Relatively speaking, Trainspotting has more nuanced characters who seem to have more control over their lives and have more of an active choice in every situation, whereas Requiem for a Dream has characters driven by false hope and losing control over their lives entirely. The endings are still quite tragic in both cases though, as drug addiction ultimately has no winners. This film shows a wider view of the characters' lives and their hobbies, crimes, interactions and quirks, along with the environment around them. It's depressing as you'd expect, but has more of an ethnographic, \"chummy\" feeling compared to the hard-hitting rollercoaster ride that is Requiem for a Dream."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3162371",
      "warningSpoilers": false,
      "date": "14 January 2015",
      "rate": "9",
      "helpful": "14 out of 20 found this helpful.",
      "title": "unique wild ride",
      "content": "Four Edinburgh friends Mark Renton (Ewan McGregor), Daniel \"Spud\" Murphy (Ewen Bremner), Simon \"Sick Boy\" Williamson (Jonny Lee Miller), and psychopath Francis Begbie (Robert Carlyle) are into the low life heroin addicted junkie world. Renton tries to quit with a couple of final rectal suppositories. He steals clean-cut friend Tommy MacKenzie (Kevin McKidd)'s sex tape with his girlfriend. He chases after Diane Coulston (Kelly Macdonald) from the club but he finds out that she's underage after sleeping with her. The guys go back to doing heroin. Even Tommy starts doing it after dumped by his girlfriend for losing the sex tape.Director Danny Boyle gives a flashy, densely-packed, dark and hilarious vision of the drug life. It is disturbing and funny, sometimes at the same time. It doesn't promote drug use despite some criticism to that fact. The grim and ugliness should dissuade people from using. It is a wild ride and something unique."
    },
    {
      "username": "Sean-M",
      "userUrl": "https://www.imdb.com/user/ur2001725",
      "reviewLink": "https://www.imdb.com/review/rw0397988",
      "warningSpoilers": false,
      "date": "6 March 2003",
      "rate": "",
      "helpful": "124 out of 160 found this helpful.",
      "title": "Superb",
      "content": "An extremely competent look at the Scottish drug-Scene, Trainspotting is a perfect example of the potential of the UK industry to tell a story of tragedy, horror and hope in a manner that the American industry has yet to do without drifting into tired Cliche. While the manner and style of delivery are extremely funny and at times appear almost unreal, the fact remains that these characters are real. The clearly psychotic and alcoholic Begbie, played by Robert Carlyle is a supporting role that is actually of immense value to the film. Here we have character who I've met, you've met and we've all met. A man with very little to lose absorbed in a sea of alcohol and prone to violence. I choose him as example because he isnt even involved in the drug-scene in which the main characters are central. In fact his opposition is somewhat humorous when we consider his own vices make him argueably worse off and the incidences of violence he becomes involved inare most definitely black humour. Considering what is actually happening isnt funny, watching it play out, aside from one major incident, is extremely funny. And that is the tone of the film throughout, as characters continually talk nonsence and sail through the lives they have chosen, making very little progress, but instead drifting downwards until an opportunity presents itself to change their ways, where upon Renton, Ewan McGregor, must make a choice between his own life or his friends. McGregor himself is excellent in the film that made him, as is Jonny Lee Miller, who surprised me in this film by having a more thought-provoking character than the script and time strictly allowed considering his relatively minimal place in the main storyline. Ewen Bremner provided some excellent and often well-needed comic relief and Carlyle as I mentioned, was outstanding. This film is both real and unreal, taking the Humour of \"Human Traffic\" and the somber tone of \"My name is Joe\" and blending them together to create an unforgettable experience vividly accompanied by strains of \"Perfect day\" and other cultural and nostalgic sounds, particularly of the place and period. Trainspotting has been accused of glamourising drug-use but I firmly believe anyone who takes this view hasnt watched it properly. The fun is equally, if not more so, matched by some nasty images and for the time it was released, provided what was a very necessary look at the growing drug industry, the loss it creates and the hope that can arise. Superb."
    },
    {
      "username": "gamerz-18042",
      "userUrl": "https://www.imdb.com/user/ur90237288",
      "reviewLink": "https://www.imdb.com/review/rw5852279",
      "warningSpoilers": false,
      "date": "25 June 2020",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Love it. Grim, realistic, a classic.",
      "content": "This film defines an era in the UK, a grim reality on the fringes of society.It's delightful script, story telling, cast, and visuals take us back to that feeling of being in the 90s.Along with a banging sound track, and a perfect ending, Danny Boyle is possibly the greatest director to emerge from the UK.Steve Irwing adaption was great, for that I chose life and chose 10."
    },
    {
      "username": "bretttaylor-04022",
      "userUrl": "https://www.imdb.com/user/ur77212199",
      "reviewLink": "https://www.imdb.com/review/rw8348357",
      "warningSpoilers": true,
      "date": "18 July 2022",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "One of the best and most iconic British films ever made. To 1996 what Star Wars is to 1977.",
      "content": "Every single moment is legendary. The soundtrack is incredible. The humour is so dark it becomes light.Great characters. Great visually looking movie. Breathtaking pacing, a lot happens in the 94 minute runtime. The most realistic and relatable film about drug addiction ever made."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw2677760",
      "warningSpoilers": true,
      "date": "23 September 2012",
      "rate": "7",
      "helpful": "5 out of 6 found this helpful.",
      "title": "\"I'm cleaning up and I'm moving on.\"",
      "content": "Where the glamorization of drugs comes in for some reviewers I just don't get. The early scene when Renton (Ewan McGregor) dives into the 'worst toilet in Scotland' makes drug users look like the vilest and lowest form of life on the planet, and his circle of friends a caricature of all the worst examples of humanity going. You look around and see the stark, disgusting flats they inhabit and there's no way anyone would want to emulate that kind of life. Unless you're a junkie I guess, and then it doesn't matter because the next hit is the only thing that does. I won't go to a lot of pains to review this film because for me it's a one off, something worth seeing as an insight into how low a person can get before figuring out that there's no solace in a needle, only a relentless slide to doom and destruction. Even Renton's ambiguous 'good deed' theft of the drug deal money at the finale left me convinced that in a sequel, he's going to be mainlining all over again."
    },
    {
      "username": "runamokprods",
      "userUrl": "https://www.imdb.com/user/ur6981752",
      "reviewLink": "https://www.imdb.com/review/rw2858105",
      "warningSpoilers": true,
      "date": "25 August 2013",
      "rate": "10",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Brilliant, and I find new details on every viewing",
      "content": "Wildly inventive, extremely funny (often sickly, disturbingly so), filmed with an insane sense of energy and pace, and an eye for truly inventive surreal images, and a soundtrack full of great songs that all fit perfectly. Not to mention a bevy of superb, brave performances. This study of 4 young mates in Scotland, 3 drug addicts, and one addicted to violence reminds me in some ways of Paul Thomas Anderson's \"Boogie Nights\". Both take us behind the scenes of dark, dysfunctional works (drugs, porn), but do so with a sense of humor and humanity that transcends clichés and makes us relate to these characters as human beings, not just porn stars or drug addicts. These are both films full of ideas about choices and morality, without ever feeling moralistic or judgmental, and both use their central world as metaphors for the bigger worlds around them. You might escape porn, or drugs, but you can't escape the forces that push people into them,(spoiler ahead!) Indeed I'm surprised to read so many reviews claiming Trainspotting's ending is optimistic. Yes Renton is walking away from drugs, but he's also stabbing his mates in the back, and joining a world that's just as obsessive about money, success, drink, sex, material things, as an addict is about drugs. To me, that's what the whole, chillingly ironic 'choose life' monologue that bookends the film is all about. Really 'choosing life' is about a lot more than just saying 'no' to drugs. Not to mention the title 'Trainspotting' which refers to the innocent, but still obsessive, humanity-disconnected hobby of noting down types and times of trains that go by. Perhaps a slower death than drugs, but a turning away from living life just the same."
    },
    {
      "username": "lastliberal",
      "userUrl": "https://www.imdb.com/user/ur2171244",
      "reviewLink": "https://www.imdb.com/review/rw1784444",
      "warningSpoilers": false,
      "date": "22 December 2007",
      "rate": "8",
      "helpful": "11 out of 17 found this helpful.",
      "title": "With God's help I'll conquer this terrible affliction.",
      "content": "The last time I remember seeing someone going through withdrawal was Frank Sinatra in The Man With the Golden Arm: \"You mean just stop? Cold turkey? You don't understand! The pain...\" Renton (Ewan McGregor) was a little more expressive: \"I don't feel the sickness yet, but it's in the post. That's for sure. I'm in the junkie limbo at the moment. Too ill to sleep. Too tired to stay awake, but the sickness is on its way. Sweat, chills, nausea. Pain and craving. A need like nothing else I've ever known will soon take hold of me. It's on its way.\" The truth about drugs and the awful toll it take is clearly shown here. The most awful moment come after the baby dies and the mother is quick to \"relieve her pain.\" The most disgusting moment was the toilet: an apt illustration of just what you will do for drugs. The amorality of sex with a schoolgirl is also apropos.This film is funny at times, but certainly there was no glamor. It was just some sick people with their lives going in circles.John Hodge's screenplay was magnificent. Danny Boyle's (Shallow Grave, 28 Days Later...) direction was super. Along with McGregor, the performances of Robert Carlyle (The Full Monty, Human Trafficking) and Kelly Macdonald (What's her connection to Sinatra?) were impressive."
    },
    {
      "username": "irocz78",
      "userUrl": "https://www.imdb.com/user/ur2083721",
      "reviewLink": "https://www.imdb.com/review/rw0398016",
      "warningSpoilers": true,
      "date": "13 November 2003",
      "rate": "",
      "helpful": "23 out of 28 found this helpful.",
      "title": "Brilliantly written and played, incredible dialogue, not for morons",
      "content": "There's a good reason why the imdb recommendations guide, which lists movies that those who liked Trainspotting should also like, lists some of the greatest, most critically acclaimed movies ever made. It's because this is one of them, and rightfully so. It won critical acclaim across the globe for its gritty portrayal of the unfortunate existence of a hapless group of losers and drug addicts, living the low life in Edinburgh, Scotland.It is a dialogue driven movie, though, so if you don't get the lines, and don't understand the humor, which is very dry at times, and never comes in the form of a 'joke', you'll unknowingly call this movie \"slow\" or \"depressing\" or \"bad.\" In a delightfully madcap exchange when Renton announces he's through with heroin, the lines \"...he's lacking in moral fiber\" \"He knows a lot about Sean Connery.\" \"Thats hardly a substitute!\" sums up the writing quite well. It only works in the context of the scene itself, but the way it's played and the scene it's set in make it beyond hilarious.It's one of the most powerfully written and played movies I've ever seen. Renton (Ewan McGregor), the main character, undergoes pseudo metamorphases to illustrate his own attempts at regaining his sanity. His friends, who enter the movie with static roles, illustrate their own inability to change by remaining undeveloped, only sinking deeper into their self-created abysses.Tommy (Kevin McKidd), who falls victim to heroin addiction and dies from it after entering the movie as the epitome of clean, healthy living, undergoes a downward spiral which we flash into occasionally to see how he's being rapidly destroyed by drugs about which he professed \"I'm an adult, I can find out for myself.\"Though Renton's character is the only one which is fully explored, all of Renton's \"so called friends\" are cleanly written, well summarized, and do their part to create the air of hostility and pressure which Renton faces in his battle to rid himself of heroin.Begbie, played with powerful energy by Robert Carlyle, adds much needed comic relief with his hilarious and sometimes disturbing violent outbursts, while exposing the ironic nature of his legal addiction to alcohol when played in the background of a heroin movie.Diane, his love interest, simply adds to the pressure of life, using him for sex and echoing the chorus from his non-drug user friends and family members that he's destroying his life, \"poisoning [his] body with that sh!te.\"It gets depressing at times, as it should, to properly illustrate the horror and depravity that comes with the lifestyle. The \"carpet\" scene couldn't have been more brilliantly imagined to portray the feeling of emptiness and detachment as Renton nears death from an overdose.Overall, it gets a 10. This movie can't lose when played to an audience with the intelligence, wit, and sense of humor to understand it."
    },
    {
      "username": "rooee",
      "userUrl": "https://www.imdb.com/user/ur17067687",
      "reviewLink": "https://www.imdb.com/review/rw2234924",
      "warningSpoilers": false,
      "date": "12 April 2010",
      "rate": "9",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Choose the best British film of the nineties",
      "content": "Director Danny Boyle and screenwriter John Hodge's 1996 adaptation of Irvine Welsh's 1993 debut novel was so central to young British culture at that time that it was always in danger of being forgotten as a mere curio of a bygone Britpop era. Thankfully, good comedy leads a long life, especially the black stuff. In the meanest, wittiest way, Trainspotting said \"bollocks\" to Britpop - in fact, it said \"bollocks\" to every fad and fashion going - and so it became immortal.Welsh's novel is, like many of his works, essentially a series of short stories bound together by a group of amiable, self-centred protagonists who share a common interest in the procurement of a life-affirming experience - in this case heroin. Unfilmable as such, Boyle and Hodge do an astonishing job of wrapping up a majority of the best Edinburgh tales in a tight 90-minute narrative. The misadventures of Renton (Ewan McGregor), Spud (Ewen Bremner) et al is alluring because their lust for life eclipses their need for skag - the physical enjoyment is never denied, and yet neither is our heroes' desire to see above and beyond the depravity and the mundanity. The film-makers are not simply allowing us to relate to these emaciated thieves - they are necessarily ensuring it.The casting is spot-on. McGregor puts in a signature performance as the amiable Mark Renton; Bremner brings the sensitive Spud hilariously to life; Robert Carlyle is unforgettable as the monstrous Francis Begbie - a man I fear we have all met and to whose jokes we have all felt obliged to laugh. Johnny Lee Miller, Kevin McKidd, and feature débutant Kelly Macdonald support superbly.What's the point of it all? you might ask. To say its simply about capturing a moment in British pop culture would be to deny the quality of its storytelling. Trainspotting is more than a zeitgeist because, for all its swagger and the brilliance of its soundtrack, it possesses an intricate, multi-taloned narrative navigated by 3D characters, more than one of whom finds his way to an uplifting and hopeful conclusion. Trainspotting is vital."
    },
    {
      "username": "laurenjfree",
      "userUrl": "https://www.imdb.com/user/ur106568204",
      "reviewLink": "https://www.imdb.com/review/rw6698022",
      "warningSpoilers": false,
      "date": "15 March 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Completely Ludicrous and Entirely Mesmerizing",
      "content": "This film is a lot of things, but mostly it's honest. Trainspotting covers the the tremendous highs and cruel lows of addiction.Beautiful, raw and often frightening visuals, dialogue that makes you think and a story that keeps you engaged. It is immaculately directed by the only person who can pull off a movie as unconventional as this, Danny Boyle. Not all of his films are perfect, but they contain an unparalleled approach to storytelling.Every scene is so meticulously thought out while also preserving Trainspotting's messy atmosphere. Saying I was glued to my screen would be an understatement."
    },
    {
      "username": "azathothpwiggins",
      "userUrl": "https://www.imdb.com/user/ur25105932",
      "reviewLink": "https://www.imdb.com/review/rw7583356",
      "warningSpoilers": false,
      "date": "25 November 2021",
      "rate": "",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Down, Down, Down We Go...",
      "content": "TRAINSPOTTING is the story of a group of friends in Scotland, their dealings with heroin addiction, and the chaotic hell it causes. There are several instances of these characters plunging headlong into the depths of drug-induced degradation, up to and including the infamous \"baby incident\".In spite of this, it must be pointed out that this film is also wickedly funny. The incredibly nasty \"public toilet scene\" is priceless!If you've ever struggled, or have known someone who has struggled with addiction, then this will ring true.Ewan McGregor's Renton is the most accessible character, making him a moral center of sorts. Robert Carlyle's Begbie is the terrifying, opposite end of the spectrum. Everyone else falls somewhere in between these two.With this effort, Director Danny Boyle pulls no punches, authentically bringing Welsh's uncompromising book to the screen..."
    },
    {
      "username": "filipemanuelneto",
      "userUrl": "https://www.imdb.com/user/ur53053227",
      "reviewLink": "https://www.imdb.com/review/rw5116997",
      "warningSpoilers": false,
      "date": "13 September 2019",
      "rate": "8",
      "helpful": "2 out of 2 found this helpful.",
      "title": "A badly appreciated and misunderstood movie that uses wry humor to convey a serious and dramatic message against drug use.",
      "content": "I confess that I began to see this movie with little expectation about it. I knew it was one of the most acclaimed movies in cinema for many. Even so, I was not enthusiastic about it. And I ended up enjoying the style of the movie.The script follows the marginal trajectory of a group of young people from the Scottish suburbs. Everyone, in one way or another, is linked to heavy drug use and crime. And everyone, one way or another, pays for it. Thought of as a light film, it is more serious than it looks and addresses strong themes in an innovative and intelligent way. Contrary to popular belief, the film is not a comedy at all, nor is it a favorable view of the drug world. Quite the opposite. The movie is much more serious, there are truly tragic moments (such as the dying baby, almost symbolizing all innocents, suffering and indirect victims of the drug, by the hands of those who get involved and addicted to the drug) and a clear anti-drug message. drugs by showing how each young person suffers the consequences: years in prison, death ... Although drug use is clearly shown to be recreational in the movie, and the characters take pleasure in the drugs, the movie also shows how their lives (and those of people who love them) are ruined by addiction.The characters are complex and intense. Each has its own characteristics and psychological profile. The dialogues are excellent and the use of a Scottish accent carried by Scottish actors gives it some authenticity and originality. Ewan McGregor got his springboard here for well-deserved stardom, and he might not have been the renowned actor he is today if he had not participated in this movie. With a controversial and unpleasant character, he is the star of the movie. Along with him, a number of actors who each had their own opportunity and talent to shine: Ewen Bremner, Robert Carlyle, Kevin McKidd, Kelly Macdonald, Jonny Lee Miller ... there's room for each to stand out at the right times, and I believe that their careers have taken full advantage of this.Technically, the movie is flawless. Without ever taking the focus off the storytelling or exaggerating putting style ahead of content, the film features groundbreaking features in photography, film angles and soundtrack, considered by many to be one of the most interesting in contemporary cinema with tracks. by Iggy Pop, Lou Reed, New Order and other rock names."
    }
  ],
  "errorMessage": ""
}