{
  "imDbId": "tt0080684",
  "title": "Star Wars: Episode V - The Empire Strikes Back",
  "fullTitle": "Star Wars: Episode V - The Empire Strikes Back (1980)",
  "type": "Movie",
  "year": "1980",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "The best of three Star Wars films, and the most thought-provoking. After the space opera cheerfulness of the original film, this one plunges into darkness and even despair, and surrenders more completely to the underlying mystery of the story. It is because of the emotions stirred in Empire that the entire series takes on a mythic quality that resonates back to the first and ahead to the third. This is the heart."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "100",
      "content": "The storyline is more interesting and ambitious, the characters -- little more than appealing types in the original -- are allowed to grow and develop, the special effects are more mature, and the tone is deliciously dark and downbeat. [Special Edition]"
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Peter Stack",
      "link": "",
      "rate": "100",
      "content": "The balance between action and mysticism in The Empire Strikes Back provides fascinating energy. It's as if the kids are given one set of delights, the bravado of battles and elaborate warships zooming through exotic space, and adults are given another, a layered explanation of what it all means in the grand scheme of things. [Special Edition]"
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Gene Siskel",
      "link": "",
      "rate": "100",
      "content": "It balances bloodshed with charm, spectacle with childlike glee. It's a near flawless movie of its kind."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "",
      "rate": "100",
      "content": "Technical virtuosity and entertainment ingenuity."
    },
    {
      "publisher": "Film Threat",
      "author": "Chris Gore",
      "link": "",
      "rate": "90",
      "content": "It was incredible to see what is arguably the best of the Star Wars films, on the big screen again. However, I do not believe that any of the minor changes make the film any better. [Special Edition]"
    },
    {
      "publisher": "San Francisco Examiner",
      "author": "",
      "link": "",
      "rate": "88",
      "content": "This is the bluest film you'll ever see. The haunting color resounds throughout Empire like a sustained, melancholy chord...Empire is essential viewing for lovers of science fiction. [Special Edition]"
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/?MI=38989",
      "rate": "80",
      "content": "A darker, richer, and more elaborate film than the original; it suffers most from being just what it is: a middle chapter with no real ending. [Special Edition]"
    },
    {
      "publisher": "The New York Times",
      "author": "Vincent Canby",
      "link": "https://archive.nytimes.com/www.nytimes.com/library/film/061580empire.html",
      "rate": "50",
      "content": "The Empire Strikes Back is not a truly terrible movie. It's a nice movie. It's not, by any means, as nice as \"Star Wars.\" It's not as fresh and funny and surprising and witty, but it is nice and inoffensive and, in a way that no one associated with it need be ashamed of, it's also silly."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "40",
      "content": "Mainly it's marking time: the characters take a definite backseat to the special effects, and much of the action seems gratuitous, leading nowhere."
    }
  ],
  "errorMessage": ""
}