{
  "imDbId": "tt0075148",
  "title": "Rocky",
  "fullTitle": "Rocky (1976)",
  "type": "Movie",
  "year": "1976",
  "items": [
    {
      "publisher": "",
      "author": "The Hollywood Reporter",
      "link": "https://www.hollywoodreporter.com/news/general-news/rocky-original-1976-movie-review-843549/",
      "rate": "100",
      "content": "On paper, neither character may seem terribly appealing, but on the screen they steal your heart away, but completely...Not only did that last reel include some of the most wildly exciting fight footage ever put on the screen, but it also provided an emotionally gratifying capstone to a picture that is truly an ode to the human spirit."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/rocky-1976",
      "rate": "100",
      "content": "By now, everyone knows who wins, but the scenes before the fight set us up for it so completely, so emotionally, that when it's over we've had it. We're drained."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/rocky",
      "rate": "88",
      "content": "The basic storyline has been done to death over the years; this is still one of the most effective and successful applications of the formula."
    },
    {
      "publisher": "New York Daily News",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "Stallone is totally engaging Rocky playing him with a mixture of boyish intensity, lusty sensuality and cheerful innocence. And Shire is equally appealing, slowly blossoming into a vibrant young woman, and Burt Young seethes with anger as her embittered brother."
    },
    {
      "publisher": "Empire",
      "author": "Adam Smith",
      "link": "https://www.empireonline.com/movies/reviews/rocky-review/",
      "rate": "80",
      "content": "This is really Sly's movie as he slugs his way through a heartfelt performance and delivers some cracking punches, both literally and emotionally."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Gene Siskel",
      "link": "https://www.chicagotribune.com/news/ct-xpm-1999-10-15-9910200025-story.html",
      "rate": "75",
      "content": "A great movie? Hardly. Stallone as the next Brando? You've got to be kidding. A nice little fantasy picture? Maybe. That's the hype and reality of Rocky, the flatout schmaltzy saga of a Philadelphia club boxer who, on New Year's Day of our Bicentennial Year, gets a chance to fight for the heavyweight championship of the world. . . ."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "60",
      "content": "I wanted to like it more than I did, but it'll do."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1976/film/reviews/rocky-1200423805/",
      "rate": "60",
      "content": "While art by definition must trigger certain emotional responses, occasionally there’s too-obvious a feeling of really being manipulated and stroked. Fact that Rocky gets his big chance from cynical schemers–with a black public hero as the instigator–rests uneasily at moments. Then there are occasional flashes that the film may be patronizing the lower end of the blue-collar mentality, as much if not more than the characters who keep putting Rocky down on the screen. However, Avildsen is noted for creating such ambiguities."
    },
    {
      "publisher": "Time",
      "author": "Richard Schickel",
      "link": "https://content.time.com/time/subscriber/article/0,33009,918549,00.html",
      "rate": "50",
      "content": "The story is achingly familiar, and though Stallone has a certain power, he is certainly not the subtlest actor to crawl out from under Marlon's overcoat. But the picture goes most wrong in the conceit it employs to lift Rocky out of the clubs and into the big arena for his title challenge."
    },
    {
      "publisher": "The New York Times",
      "author": "Vincent Canby",
      "link": "https://www.nytimes.com/reviews/movies?res=9B02E4DE123EE334BC4A51DFB767838D669EDE",
      "rate": "40",
      "content": "The problem, I think, comes back to Mr. Stallone. Throughout the movie we are asked to believe that his Rocky is compassionate, interesting, even heroic, though the character we see is simply an unconvincing actor imitating a lug."
    }
  ],
  "errorMessage": ""
}