{
  "imDbId": "tt0075148",
  "title": "Rocky",
  "fullTitle": "Rocky (1976)",
  "type": "Movie",
  "year": "1976",
  "items": [
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw2184417",
      "warningSpoilers": true,
      "date": "2 January 2010",
      "rate": "10",
      "helpful": "24 out of 24 found this helpful.",
      "title": "\"He doesn't know it's a show. He thinks it's a damn fight!\"",
      "content": "One gains a certain degree of perspective with the passage of time, and one of the things I like to do is watch a movie that I saw upon it's original release and compare my feelings for it now to those I experienced back in the day. I thought \"Rocky\" was a great and inspiring movie back in 1976, and with only the slightest bit of hesitation, I think it delivers the same feelings today. I throw in that slight hesitation part because over the years, the sports underdog theme has been worked to death in cinema. But the thing about \"Rocky\" is that it's not so much a film about boxing as it is a film about life in general. A direction-less man with no goals suddenly finds the gold ring handed to him on a platter. Not that there isn't a whole lot of work involved to make that dream come true, but one has to recognize opportunity in the first place. I read with some amusement the negative reviews of the picture on this board and have to wonder how many of the nay-sayers consider themselves so intellectually superior that they trash the film for that simple lack of recognition. Because criticizing Rocky Balboa for talking like he had a mouth full of marbles is missing the point. He talked like that because he was a street punk working as an enforcer for a local mob boss, and the people he dealt with on a daily basis weren't exactly magna cum laude types. Nor was he going up against members of mensa whenever he climbed through the ring ropes at a local boxing joint.To prove he's not just another bum from the neighborhood, all Rocky wants to do, as he confesses to Adrian (Talia Shire) in that touching apartment scene, is go the distance with the champ. He doesn't have to knock him out, doesn't even have to win, just go the distance. You know, I still have to remind myself at times as I reflect on the picture that Rocky really didn't win the match. But he comes out a winner in the truest sense of the word, and that message blurs out the ring announcer's call of a split decision in favor of Apollo Creed. If there was no \"Rocky II\", (or III or IV or V), I wonder how many of the movie's fans would have been settled with the idea that Rocky Balboa actually became the world champion that day."
    },
    {
      "username": "BA_Harrison",
      "userUrl": "https://www.imdb.com/user/ur0945066",
      "reviewLink": "https://www.imdb.com/review/rw3421077",
      "warningSpoilers": false,
      "date": "24 February 2016",
      "rate": "10",
      "helpful": "26 out of 27 found this helpful.",
      "title": "Yo!",
      "content": "Rocky Balboa (Sylvester Stallone) is a struggling Italian/American boxer who also earns cash collecting debts for shady Philadelphian 'businessman' Gazzo (Joe Spinell). When heavyweight boxing champion Apollo Creed (Carl Weathers) finds himself without an opponent for his upcoming match, he offers the unknown fighter a chance at the title as a gimmick, but doesn't count on Rocky's determination to go the distance.I watched Martin Scorsese's Raging Bull not that long ago, an excellent film, but something of a downer—a gritty study of a not very nice character whose horrible personality and poor choices see him winding up losing everything. Rocky, on the other hand, is a real feel-good film about a guy on the skids who is given a once-in-a lifetime opportunity to make something of himself. It's an uplifting Cinderella story, a classic underdog tale that leaves the viewer with a big smile on their face, which is why I prefer it slightly over Scorsese's film.Rocky also has a great story behind the making of the film which mirrors that of its main character: star Stallone went from an almost broke struggling actor to Hollywood mega-star by not only writing the script for Rocky, but also insisting that he play the title role. The rest, as they say, is history.Those only familiar with Stallone's later action hero work will be surprised at how good an actor he is in his breakthrough role, tackling the drama just as well as the boxing: Rocky's burgeoning romance with shy pet store clerk Adrian (Talia Shire), his friendship with her brother Paulie (Burt Young), and his strained relationship with trainer Mickey (Burgess Meredith) are all handled superbly.Director John G. Avildsen also manages all aspects of his film with aplomb, with the final fight between Rocky and Apollo being the absolute showstopper, a gruelling battle of wills, both combatants pushed to their limits. Add a rousing score from Bill Conti and what you have is an unmissable, uplifting classic of the '70s.9.5 out of 10, rounded up to 10 for IMDb."
    },
    {
      "username": "utgard14",
      "userUrl": "https://www.imdb.com/user/ur1896124",
      "reviewLink": "https://www.imdb.com/review/rw3271695",
      "warningSpoilers": false,
      "date": "6 July 2015",
      "rate": "10",
      "helpful": "15 out of 15 found this helpful.",
      "title": "\"I ain't no bum, Mick. I ain't no bum.\"",
      "content": "A first-rate film that's about as close to perfect as any movie about boxing (or any other sport) that I've ever seen. The plot is very simple -- small-time boxer Rocky Balboa (Sylvester Stallone) is given a chance to fight the heavyweight champion Apollo Creed (Carl Weathers). It sounds no different than a ton of old movies about the sport. But this film proves that it's not always how fresh or unique the story is but how well it's crafted. Rocky is a masterpiece of filmmaking with dynamite acting from Sylvester Stallone, Burgess Meredith, Talia Shire, Burt Young, and Carl Weathers. Many classic scenes, lines, characters. Bill Conti's score is one of the all-time greats. It was nominated for nine Oscars, winning three including Best Picture. It was director John G. Avildsen's best film and many would argue it is Stallone's best as well. Certainly his best screenplay. The fight choreography is terrific. Followed by a string of enjoyable sequels but they were just solid entertainment. This one is very entertaining but it is also something much more than that. It's one of those movies that becomes part of culture in a big way where everybody recognizes something from the film even if they've never seen it."
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0149655",
      "warningSpoilers": false,
      "date": "5 May 2003",
      "rate": "10",
      "helpful": "244 out of 296 found this helpful.",
      "title": "The Raging Bull Named Rocky...",
      "content": "\"Rocky\" is about a man. It is the story of a man who exceeds past all normal expectations and makes the most out of what he is doing. What is he doing? Boxing. Why? As Rocky says in the film, \"You have to be a moron to want to box.\"Rocky is played by Sylvester Stallone, whose only other film before \"Rocky\" was \"Weekend at Kitty and Stud's,\" and, as you can probably guess by the title, it was an X-rated movie. But Stallone gives just about the best performance of his career here. Before he started getting into recycled action movies and unfunny comedies, the man had talent, as seen shining through in \"Rocky.\" Somewhere along the way he lost that talent, but it's pretty evident that he had it at one time.Stallone wrote the script, which is about a down-on-his-luck Philadelphia man named Rocky Balboa. Rocky is your average tough-guy you see walking down the street, but this film takes a closer look INTO the guy walking past you, and not AT the guy walking past you.He lives in a beat-up, old apartment, infested with roaches, and he barely makes enough money to support himself. His job? Rocky retrieves money for loan sharks. His real job, however, is to break the loaners' thumbs if they don't pay up. He's a muscle man.After he returns from his \"job\" every day, he takes time to do what he has been doing for the past six years, which is boxing. Then, after that, he takes a trip to the local pet store to see the love of his life, Adrian, who works there. He constantly tries to impress her and talk to her, but she is shy and literally does not talk much throughout the entire film.But things change for Rocky after heavyweight champion Apollo Creed (Carl Weathers) decides that he wants to make a big performance on the 4th of July. He wants to appear nice by letting a regular Joe Schmoe fight him in the ring. All for show, of course. As he is looking through a book of local boxers, he points his finger at the letters THE Italian STALLION, a.k.a. Rocky. He says that fighting an Italian is perfect. \"An Italian found America,\" Creed says. If he fights an Italian-American on the 4th of July, it will be symbolic and will also make Creed look good.But Rocky doesn't realize this is all for show. When he receives word that Apollo Creed wishes to fight him in the ring, Rocky begins to train long and hard with Burgess Meredith, which results in the famous scene where Rocky runs up an entry of stairs in Philly with the music \"Gonna Fly Now\" playing in the background. This scene is spoofed by films world-wide, and it's one of the cornerstones in film history. You will see it all the time. It's just one of those film moments that are marked down in history.The most entertaining thing about \"Rocky\" is how innocent Sylvester Stallone comes across in his role as Rocky. You feel for him when he is trying to impress Adrian and she shrugs him off. The scene where her brother invites Rocky over, and Rocky keeps saying, \"Are you sure she knows I'm coming?\" is a sign of how the guy has been put down. And then when she comes over to his apartment, he acts nice and talks to her. He's not trying any moves on her. He just enjoys being with her. Rocky is a bit of an idiot, as he himself admits, but he's a sweet idiot.And the end, when Rocky fights Apollo Creed, is amazing. A nobody who actually stands a chance against the heavyweight champion of the world. Creed and Rocky are being battered by each other. Creed goes into the opposite corner as Rocky, and one of Creed's managers says, \"This guy thinks this thing is for real -- knock him out!\" You feel sorry for Rocky there, because he is giving the fight all he's got, when it was just a publicity stunt from the beginning, but he didn't even realize it.Things like that are what make \"Rocky\" what it has become over the years. It is a great film, and it has many classic moments that you will see spoofed in films all the time. You should probably see it just for that fact.But the truth is, if you take away all the underlying intricacies, \"Rocky\" is just the story of a simple guy who gets a chance to do something amazing, and he gives it all he's got. I think we've all gone through something like that before, and if so, you will be able to identify with \"Rocky\" all the more."
    },
    {
      "username": "ivo-cobra8",
      "userUrl": "https://www.imdb.com/user/ur15140057",
      "reviewLink": "https://www.imdb.com/review/rw3348388",
      "warningSpoilers": true,
      "date": "3 November 2015",
      "rate": "10",
      "helpful": "46 out of 51 found this helpful.",
      "title": "A classic! the best and the original movie of all time - Rocky !",
      "content": "Rocky (1976) It is still today one of the best action, sport, drama and a cult classic low budget films ever made in history. It is an underdog story telling about a men and his struggle in his life. Sure, I know that without it, there'd be no sequels for a ranking, but compared to III, although this Best Picture of 1976 was great, it just dragged a bit for me. I'm no brainless action-goer, mind you. I love real human drama portrayed on screen. I've got to say though, at times, you feel like you're watching a documentary on a real man's life. It's that much realistic. This to me is a no brainier. You get introduced to an insecure Rocky who works for the mob as a collector, but has too big of a heart to go around hurting people in an awesome heartfelt movie. Adrian and Rock meet, You get introduced to the lovable A-hole Pauly. Introduced to Creed. Introduced to Mick. And BUTKUS! And Rock goes the distance with Creed! This movie has a Heart . As a kid Rocky III was my favorite best movie ,but this one is my second best movie. YO ADRIAN I DID IT!!!It is my first best favorite film in the series and I just love this film to death. It has a message and it is portraying a real human drama. Rocky is a movie that everyone can relate to. One of my favorite Stallone roles, there is nobody else who could play Rocky better than him, it's too bad that he didn't win Oscar because i honestly think that he deserved it. But at least movie won the best picture of the year award. Maybe Rocky didn't win the fight in the movie, but Stallone did win his \"fight\" in real life. Rocky, a poor guy that just barley manages to get by, just wants to fight. However, everyone including his trainer has given up on him. Rocky also wants to go on a date with Adrian, a very shy girl who works at the local pet store, Adrian, however, is too shy to even say anything to anyone. Meanwhile, Apollo Creed (the heavy-weight champion of boxing) learns that his boxing partner has been injured and can't fight. Apollo tries all the other potential boxing partners, but every one of them refuse. Apollo decides to give an unknown boxer a chance to fight him for the title, with the intentions of just giving him five minutes of fame then knocking him out. Apollo picks Rocky. This is the Rocky's only shot at the big time and chance he will never get it back.Rocky Balboa is a struggling boxer trying to make the big time, working as a debt collector for a pittance. When heavyweight champion Apollo Creed visits Philadelphia, his managers want to set up an exhibition match between Creed and a struggling boxer, touting the fight as a chance for a \"nobody\" to become a \"somebody\". The match is supposed to be easily won by Creed, but someone forgot to tell Rocky, who sees this as his only shot at the big time. Sylvester Stallone, himself a virtual unknown, managed to sell his Rocky script (one of 35 that he'd written over the years) on the proviso that he be given the starring role. Since the film was to be made on a shoestring and marketed on a low-level basis, the risk factor to United Artists was small. For Stallone, this was a make-or-break opportunity - just like Rocky's million-to-one shot with Apollo Creed. Costing under a million dollars, Rocky managed to register with audiences everywhere, earning back 60 times its cost. The film won several Academy Awards, including Best Picture.The original Rocky film is one of the greatest epic action sport drama film in the history! It contains action, humor, romance, and an uplifting message. The screenplay is great, and features some truly touching moments. There is also some great camera work, thanks to the new Steadicam. It's a shame Stallone's later career and all the Rocky sequels have lessened this film in the eyes of many. This film is truly a classic and deserves to be seen at least once by everyone.Rocky is a 1976 American sports drama film directed by John G. Avildsen and both written by and starring Sylvester Stallone.10/10 Grade: Bad Ass Seal Of Approval Studio: Chartoff-Winkler Productions, United Artists Starring: Sylvester Stallone, Talia Shire, Burt Young, Carl Weathers, Burgess Meredith Director: John G. Avildsen Producers: Irwin Winkler, Robert Chartoff Screenplay: Sylvester Stallone Rated: PG Running Time: 1 Hr. 59 Mins. Budget: $960.000 Box Office: $117.235.247."
    },
    {
      "username": "zkonedog",
      "userUrl": "https://www.imdb.com/user/ur7826013",
      "reviewLink": "https://www.imdb.com/review/rw6313735",
      "warningSpoilers": false,
      "date": "27 November 2020",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "Everything About This Film Is Iconic--And Inspirational",
      "content": "Every once in awhile, a movie comes along that sort of breaks the mold. By almost all accounts, \"Rocky\" never should have even been made, much less developed into a cultural phenomenon. Fortunately, the stars aligned in just the right places to produce what is truly one of the most iconic, inspirational films of all time.For a very basic overview, \"Rocky\" tells the story of titular character Rocky Balboa (Sylvester Stallone), a Philadelphia \"leg breaker\" who is a street enforcer for loan shark Gazzo (Joe Spinell) and does a little boxing on the side. Rocky eeks out a meager existence and tries to romance shy pet store worker Adrian (Talia Shire) in his spare time. When boxing champion Apollo Creed (Carl Weathers) has a fighter cancel on him, however, the champ gives Rocky (\"The Italian Stallion\") a million-to-one shot on American's bi-centennial. With this tremendous opportunity staring him in the face, Rocky falls in with trainer Mickey (Burgess Meredith) and resolves to give it his best shot.There is almost no question that \"Rocky\" is one of the most inspirational films ever made. Rocky represents everyone who \"never had a prime\" but is given a shot at one. Does he (and, by extension, we) take it, or let it slip away? That is the crux upon which the entire film is based. Much of this inspiration comes from Stallone, who drew upon many of his own experiences to craft such a true-to-life, yet engaging narrative. It is often tough to tell where \"Rocky ends and Sly begins\", so to speak, as their stories are so intertwined. Art imitating life in the best way imaginable.Every time I watch \"Rocky\", I'm amazed by just how iconic many of its central tenets have become. For example:-Stallone's verbal and visual foibles produced a character that will live on long after I (or my children, or theirs) will. -Shire is the epitome of the unassuming, shy woman who gains her own strength--finally standing up to brother Paulie (Burt Young)--through Rocky but also provides him the same in return. -The archetype of the crusty old boxing trainer? Practically invented by Meredith's \"Mick\". -Bill Conti's simple piano melodies and bombastic brass fanfares compose one of the best original scores ever heard. -Even the location--Philly--seems like a character. Whereas Rocky gained strength from his roots, now that city draws much of its own identity from the character.Upon a recent re-watch, I was also struck by how little boxing actually resides within the film. The big Creed fight only takes about 10-15 minutes of screen time. No, \"Rocky\" is all about the character development and journey. Scenes of him ice skating with Adrian, punching the raw meat, jogging through Philly, or contemplating his big opportunity are what steal the show here.All in all, everything just comes together in \"Rocky\" to create a movie that will last through the ages. Despite being a low-budget project that Stallone had to mortgage his future to get made, then threaten to pull out entirely if not cast in the lead role, the end product was legendary. It spawned five direct sequels and two more spinoff \"Creed\" films, all entertaining in their own rights, but there is simply something special about this 1976 original."
    },
    {
      "username": "JFHunt",
      "userUrl": "https://www.imdb.com/user/ur4157754",
      "reviewLink": "https://www.imdb.com/review/rw0980325",
      "warningSpoilers": false,
      "date": "17 December 2004",
      "rate": "10",
      "helpful": "536 out of 587 found this helpful.",
      "title": "\"But it's Thanksgiving. Yeah to you, but to me it's Thursday.\"",
      "content": "It's hard to explain what this movie means to me. Words could never. I remember when I was a kid, I never liked the first Rocky, was too obsessed with III and IV. It happened when I was 11 and I went to see V in the theater. I never been to a movie like that before. People were screaming and cheering. Shook the whole damn place. They were dancing in the isle's and celebrating. It was then I realized the true power of Stallone's vision. The realization that only the original would ever really matter.Rocky to me is so many things. I had to beg my girlfriend to see it. She said she doesn't like boxing. I almost dumped her right there. If she wasn't so hot, I probably would have. I was crushed that someone could think that this movie is about boxing. To me it was never that. It's about a guy, much like you or me, who's down on his luck and everyday feels like Sunday. He's pushing 30, single and broke. I'm sad to say that at this moment it almost reminds me of myself. Every minute more another reason. It's hard to pick my favorite scenes from the movie. I love the chemistry between Rocky and Adrian (Shire). When he's talking to door and she finally comes out and then stops to look in the mirror. It's a thing of beauty. Or when Mickey (Meredith) goes over to Stallones apartment. Rocky gets upset and punches his shitty wall, then goes to hide in the bathroom. The look on Stallone's face when he comes out to find Mickey still there is priceless. I heard it wasn't in the script or directed, just happened. But the one that does it for me is when he comes home in the opening scene after the chapel fight. He turns on his record player and goes for a beer, but it's empty, like everything else in his life. Talks to the turtles and his fish, why because the Rock is lonely. Goes to the mirror and practices a joke for his love. Looks at a picture of himself and realizes he's wasting his life. It's more than beautiful or real.It's safe to say that I have seen the original more than 100 times. I still feel all the emotion. I love this movie more than any other film. I hope one day, with God's help, to show it to my kids and have them feel the same way. I think if I ever got the chance to meet Stallone, I'd want to thank him. Tell him how he changed my life. But in reality, he probably wouldn't care. Because, \"I'm at least half a bum.\""
    },
    {
      "username": "BandSAboutMovies",
      "userUrl": "https://www.imdb.com/user/ur69172350",
      "reviewLink": "https://www.imdb.com/review/rw5053584",
      "warningSpoilers": true,
      "date": "11 August 2019",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "A perfect movie",
      "content": "Sylvester Stallone wrote the screenplay for Rocky in three and a half days after watching Chuck Wepner take world champion Muhammad Ali to 15 rounds, a feat that no one saw coming. Stallone was also inspired by two boxers named Rocky - Marciano and Graziano, as well as Joe Frazier.United Artists liked the script as a vehicle for someone like Robert Redford, Ryan O'Neal, Burt Reynolds or James Caan. But Stallone demanded to play the main character himself. This was a smart gambit, as he knew that producers Irwin Winkler and Robert Chartoff's contract allowed them to greenlight any project with a small enough budget (the final cost was about $1,075,000, with $100,000 spent on producers' fees and $4.2 million on advertising costs).To be fair, it was an audacious gambit. Stallone had $106 in the bank, no car, and was trying to sell his dog because he couldn't afford to feed it. Instead of the $350,000 he could have made just for writing Rocky, Stallone wrote without a free and acted for scale. Don't feel bad for Stallone's dog - he ended up playing Butkus in the movie.The other two main characters - Apollo Creed and Adrian Pennino - were difficult to cast, with boxer Ken Norton and Carrie Snodgress (The Fury, Trick or Treats) originally picked for those roles. Finally, Carl Weathers and Talia Shire (the sister of Francis Ford Coppola, mother of Jason Schwartzman and aunt of Nicholas Cage) were picked.As well as having to pay off Wepner for basically taking his life story, Stallone also took the cattle punching scenes and running up the steps of the Philadelphia Museum of Art directly from Joe Frazier. Luckily, the story was continually worked on throughout filming, as originally, Rocky threw the fight so he wouldn't have to be part of the scummy world of boxing and Mickey was also incredibly racist.The movie begins with Apollo Creed announcing a big fight in Philadelphia to celebrate the Bicentennial. Trust me, that holiday was the biggest thing ever back in 1976. He gets some bad news - his opponent is injured and he can't find another boxer who can draw. So he decides to give a local journeyman a chance - Rocky Balboa.Rocky's never boxed on this level before. He has semi-pro matches in small gyms and churches when he's not working as a collector for loan shark Gazzo (Joe Spinell, who was a close friend of Stallone until the filming of Nighthawks; he was also Sage Stallone's godfather; you may know him better from roles in movies like Maniac and Starcrash).Rocky meets with promoter George Jergens (Thayer David, Dark Shadows) thinking that he's just going to be a sparring partner for Creed, but then learns that he'll be paid $150,000. Soon, he's finally caught the eye of former boxer Mickey Goldmill (Burgess Meredith, who is astounding in this film), a man who ignored him for years.Rocky also falls for Adrian, which means he has to deal with her brother Paulie (Burt Young). Adrian fills the gaps for Rocky, becoming the only person that he can confess that the things people say about him actually hurt and that he doesn't feel that he has any chance to win. He just wants to go the distance to prove people wrong.On New Year's Day, the fight happens. Rocky comes out in an ill-fitting robe with a meat packing logo on the back. Creed is dressed as Uncle Sam and continually makes light of Rocky before he's knocked down in the first round, the first time that's ever happened.The fight is sheer brutality - Rocky needs an eyelid cut open just to see and Apollo has his ribs broken - but the end is indecisive. Creed is obviously the better boxer, but Rocky has more heart. As the final bell rings, Creed tells him there won't be a rematch and Rocky agrees that he didn't want one.The result of the fight - a 8:7, 7:8, 9:6 split decision - doesn't even matter. All Rocky wants is to see Adrian and tell her that he loves her. He's achieved his dream and become a winner, even if he didn't really win. Instead, he's achieved so much more just by being who he truly is.The iconic scenes where Rocky jogs through Philadelphia were shot guerrilla-style, which means no permits, equipment or paid extras. In fact, the scene where the grocer throws him an orange was completely improvised. The man had no idea that there was actually a movie being filmed.Rocky was only the third film shot with the Steadicam (the other two are Bound for Glory and Marathon Man), which was integral when it came to capturing the aforementioned jogging scenes. In fact, the Philadelphia Art Museum steps came from the test footage Steadicam inventor Garrett Brown shot of his girlfriend running those steps to wow filmmakers. Director John G. Avildsen, who was prepping storyboards for the film, saw the footage and knew it would work.Stallone and Avildsen disagreed on many parts of the film and nearly came to blows over the film's ending. Stallone thought Creed had to be the clear winner of the fight to prove that a victory for Rocky doesn't necessarily have to be in the ring, but Avildsen cut the conclusion to make it more ambiguous. They did agree to reshoot the ending so that Adrian came back into focus with her showing up to watch the final round of the fight. This ended up solving their issues with the final scene, as Stallone got his upbeat ending without really needing to decide who won the match.Rocky was a major part of my childhood. I grew up in a town split between Eastern European and Italian families, where there's still plenty of anti-Italian racism even to this day. Having an Italian hero who wasn't a mobster meant a lot to me, particularly because Rocky was from my home state and not somewhere far away. As I've grown older, the story of a man who looks back on his life and sees the time he's wasted means more and more to me. So I get something new from this film every single time that I see it. It's pretty amazing that this character has survived eight movie appearances, changing to reflect his age and the time when those new films are made."
    },
    {
      "username": "rbverhoef",
      "userUrl": "https://www.imdb.com/user/ur0312444",
      "reviewLink": "https://www.imdb.com/review/rw1023146",
      "warningSpoilers": false,
      "date": "18 February 2005",
      "rate": "9",
      "helpful": "101 out of 131 found this helpful.",
      "title": "A great Sylvester Stallone film",
      "content": "If you think Sylvester Stallone has made nothing but stinkers you just have to see 'Rocky'. This is a brilliant film, based on Stallone's own screenplay, where he plays a complex character in such a terrific way it is not strange people thought this was going to be a great actor. Compare it to another great film about a boxer, 'Raging Bull', and 'Rocky' will be better at some points. It goes without saying that it's quite an achievement.The story is about Rocky Balboa (Stallone), a boxer who once had a glorious future, but now fights for little money in gyms. Then, out of the blue, he gets the chance to fight the heavyweight champ Apollo (Carl Weathers), a stunt from his side. Although Rocky seems to have no chance he starts his training to make the best of it, although at first he is too proud to accept any help. The scene where he finally accepts the help from his old trainer Mickey (Burgess Meredith) is one of the best scenes in the film. Rocky also starts dating the very shy girl Adrian (Talia Shire), sister of his friend Paulie (Burt Young).'Rocky' is a terrific film in every aspect. The acting is what amazed me the most. Stallone gives such an impressive performance it is very hard to believe he is also the star of films like 'Over the Top', 'Stop! Or My Mom Will Shoot' and 'Judge Dredd', and from the other 'Rocky'-films for that matter. Not only Stallone is impressive, Shire, Young and Meredith find perfect notes for their characters as well. Every little thing that happens seems natural through their acting and of course Stallone's screenplay does a great job here. Director John G. Avildsen serves this material the way he should. Of course he is no Martin Scorsese, 'Raging Bull' stays the better directed film, but he knows how to tell this story.I do not like boxing very much, so a boxing-film is not something I would enjoy. But this is not a boxing-film, it is a film about a boxer. It tells about a character who happens to be a boxer running for a title. This is probably one of the points where the other four 'Rocky'-films fail and where films like this one and 'Raging Bull' and Clint Eastwood's 'Million Dollar Baby' succeed."
    },
    {
      "username": "marcin_kukuczka",
      "userUrl": "https://www.imdb.com/user/ur3233848",
      "reviewLink": "https://www.imdb.com/review/rw5738684",
      "warningSpoilers": false,
      "date": "15 May 2020",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "The older it gets, the better it is... Wonderful Movie!",
      "content": "It seems that those movie productions that had to fight the big fight with the expectations, somehow, turned out to be timeless, not only for the fans of the genre but for the general audiences as well. That is, undeniably, the case with ROCKY not yet directed by Sylvester Stallone but by late John G Avildsen (who comes back with the direction of ROCKY V in 1990). ROCKY, after all these years and a lot of sequels made after, including the recent CREED films, proves to be one of the very best films about sport, a sportsman and, most importantly, a personality - formerly 'nobody' rising to the top-notch fame and popularity.Not being a particular fan of boxing, I am not trying to review this film as an expert relating to some details about it. Indeed, there have been plenty of such reviews before me who praise the way the fight is being filmed here. When I recently re-watched it with my wife, I rather wanted to see it in a fresh way, without all this background knowledge and unnecessary facts what happened later. Just see Rocky as a young man, seemingly 'nobody' an underdog with no perspectives, who lives in a poor district of Philadelphia, in an almost obscure flat (he says that 'his whole place stinks') and yet, is offered a chance of a lifetime - possibility to fight the big fight with the heavy weight champion, Apollo Creed. ROCKY is unique in that determination and the strength he finds within himself because...Sylvester Stallone portrays a man with whom he somehow identifies (that was also the moment in his career - taking a chance that appears once in a lifetime). He has true, genuine motives. His personal motives are powerfully depicted in several scenes, particularly the unforgettable relation with Mickey (played by legendary Burgess Meredith). In the scene of Mick's first visit to Rocky's stinking place, the young boxer opens up his inner self and amidst the rage of his soul, the pain of his mind, he meets a true friend who does not turn his back to him but helps him out and motivates. Mickey understands because he was a boxer himself, he did have his prime and he knows what it is to 'eat lightin' and crap thunder.' Rocky and Mick's relationship is the essence of a tutor and a student, the essence of a good coach who knows the tough rules that are inspiring, astounding, demanding - yet never imposed. This is the power that Rocky finds in himself thanks to Mick who is there to fan the flame of the desire to face the challenge. And he does that truly effectively proving that he 'ain't no bum.' Sometimes, when you watch their scenes, you just seem to forget it is played. It seems so real. Both actors feel their roles tremendously.Sylvester Stallone, apart from the tough world of boxing, apart from being the \"Italian Stallion\" he called himself, portrays a truly gentle guy. That is, in a way, something we like about Rocky most. It is not a typical 'macho' pretending to have no feelings. But where can you find this truth about the man if not when facing a woman. ROCKY combines this subtlety with timidness in the scenes with Adrian (played by Talia Shire already known at the time for her supporting role in GODFATHER). Thanks to Paulie (Burt Young) who supplies Rocky with the meat for the boxing sack and the woman for loving, they go for the first date. I loved the scene he takes her to the ice rink. Mind you that this scene somehow forgets about the tough world that is in the background and is a true depiction of some genuine, pure male-female fascination. The two alone on the ice rink resemble a couple alone in the world, just for themselves. Each of their movement, each of the word they say to each other (Rocky appears to be far more talkative) is here to stay in your memory. The moment he takes her glasses off and their first kiss (which was, for Stallone pretty challenging because Talia Shire was having a flu when she was playing the scene), her visit to his flat (at first so shy and hesitating, yet she made up her mind and entered the flat giving him the credit...as he later remembers in ROCKY BALBOA), these are the moments that you really feel as a viewer. As a matter of fact, her style, her clothes indicate this inexperience and that aspect of her personality is something that Rocky is taken with. Their love grows in the following parts, indeed, but it is here when their scenes are unforgettable. Two people outside of the world that imposes certain manners and conventions: \"But it's Thanksgiving. Yeah to you, but to me it's Thursday.\"Sylvester Stallone, though he is not the director of this film, proves to know the psychological mechanisms that are behind the wings of the boxing rink. Imagine that Apollo Creed (played by Carl Weathers who, recently in an interview, still remembers this role as one of his key roles of the career) the master is to fight with some 'underdog' who trains on meat and dares say: \"I will fight the big fight\" This is the pride of a champion that is put to test, this is the situation when truly much is at stake. It is good to remember one scene here when Creed talks on TV and says to sportsmen seemingly discouraging simple people from sport: \"be a thinker not a stinker.\" This fear of losing wide acclaim is even more visible in ROCKY II but here, the idea behind it all is not merely a sort of 'rematch' but a guy - a 'nobody' daring fight with the widely acclaimed master that Apollo is. Very well played by Mr Weathers and their fight at the end of the movie is something that you can watch in slow motion even admiring every camera shot, every emotion evoked, dwelling in the spirit of competition, yes, but foremost courage.It would be unfair to review ROCKY and not to mention a word about the very location of the story, the city of Philadelphia. It is no coincidence that Stallone chose this place as the setting of the story: those streets where he is running, those steps that he climbs while training early in the morning, the very background of rising from the bottom. The train that he hears in his small flat, the singing and street parties that he passes (Frank Stallone among the people), the character of Marie whom Rocky discourages from smoking and the kids that leave school and run with Rocky (yes, that is the second part but Philadelphia plays its role in all parts, in particular ROCKY BALBOA where sentiment is combined with the change and new reality).ROCKY is a lovely film with lovely music. The soundtrack is something that can be listened to for hours all over again being a source of inspiration for training, a source of finding this 'power of spirit' from within yourself, it is relaxing and extremely memorable by itself but also fits best to the scenes. Bill Conti did a terrific job here. The theme song \"Gonna Fly Now\" and \"You Take My Heart Away\" simply have a tremendous impact on the emotions of viewers.ROCKY is a rather simple story about a simple guy who trains in a simple way and falls in love with a simple woman. Yet, perhaps that is why it is so extraordinary that may prove to stand aside the masterpieces of cinema and dare equal them."
    },
    {
      "username": "Uriah43",
      "userUrl": "https://www.imdb.com/user/ur36357573",
      "reviewLink": "https://www.imdb.com/review/rw3379781",
      "warningSpoilers": false,
      "date": "24 December 2015",
      "rate": "8",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Intense Action and Drama",
      "content": "\"Rocky Balboa\" (Sylvester Stallone) is a boxer who struggles just trying to make ends meets in the city of Philadelphia. Although he certainly isn't the brightest person around he has a big heart and does the best that he can. Yet even then he realizes that he is going nowhere fast. Then one day he gets a call from a man who wants to schedule a fight between him and the undisputed Heavyweight Champion of the World who goes by the name \"Apollo Creed\" (Carl Weathers). At first Rocky refuses because he doesn't believe he is in the same class as the World Champion and doesn't deserve the honor. However, he eventually comes around and gets more serious about his training. But even then he has grave doubts about his chances. Now rather than reveal any more I will just say that this was a very good movie which really highlights the importance of never giving up and always trying to do your best in spite of the odds. Admittedly, the first hour or so is quite slow but during this time it provides the character development necessary for the intense action and drama in the second hour. This is especially true for Talia Shire (as Rocky's girlfriend \"Adrian\") and the aforementioned Sylvester Stallone. At any rate, I thoroughly enjoyed this film and recommend it to those who might be interested in a movie of this type."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2774915",
      "warningSpoilers": false,
      "date": "30 March 2013",
      "rate": "10",
      "helpful": "21 out of 26 found this helpful.",
      "title": "The film cost a million and grossed over 100,000,000 domestically.....'nuff said.",
      "content": "I am not a huge boxing film fan. Well, that's not exactly true. I am not a fan of films that glamorize boxing. Movies like \"The Harder They Fall\", \"Requiem For a Heavyweight\" and \"Champion\" and \"The Set-Up\" are all wonderful films about the brutality and vicious nature of the 'sport' and are great indictments about what a terrible thing boxing is--and I heartily recommend them. However, \"Rocky\" is a rare film that glamorizes boxing (for the most part) and manages to deliver a film that you can't help but admire. Think about it. It was a small film, costing only about a million, and earned TONS of money and won the Best Picture Oscar!! No matter what you think of the later Rocky Films (as they got progressively worse) or the other films of Sylvester Stallone, you cannot take anything away from this tremendous achievement. It is a great film and it's amazing that it was made by folks who no one really heard about up until then. Plus, when you read about how quickly Stallone penned the script, you can't help but admire it. A terrific film."
    },
    {
      "username": "mm-39",
      "userUrl": "https://www.imdb.com/user/ur0453228",
      "reviewLink": "https://www.imdb.com/review/rw0149580",
      "warningSpoilers": false,
      "date": "9 April 2001",
      "rate": "9",
      "helpful": "93 out of 129 found this helpful.",
      "title": "Stalone's best",
      "content": "As much as the media mocks Stallone, he won best picture for this film. He will never top this film, which made him a icon. It's a story about a down on his luck loan collector/ boxers who gets a one time shot at the heavy weight championship, because of a late pull out by a contender, and the champ does not want to lose his money on the deal. There is romance between Rocky and his new girl friend who lives just as hard of a life as Rocky, and together they make life livable. The rest of the cast is other down and outers who give the viewer a feeling of hopelessness until Rocky gets his chance. This film is touching, and unforgettable."
    },
    {
      "username": "colm-hearne365",
      "userUrl": "https://www.imdb.com/user/ur22074254",
      "reviewLink": "https://www.imdb.com/review/rw3513849",
      "warningSpoilers": false,
      "date": "28 July 2016",
      "rate": "8",
      "helpful": "14 out of 14 found this helpful.",
      "title": "Rocky through the ages",
      "content": "For this review, I'd like to go through all the Rocky movies (including the most recent Creed) and talk about their good points and their bad points. Rocky - The first one is obviously a classic and the best out of the series and made people like Sylvester Stallone a superstar. It takes a simple but touching story of the underdog boxer and rise to have a chance to be a champion. Rocky II - I felt was kind of the same story and was a little cheesy but it still carried the spirit of the original.Rocky III - Like the second one, was cheesy but it was entertaining. But I like how Rocky was doing more boxing and had more drama and Mr. T was a good villain even though he talked too much. Also it featured a great song, \"Eye of the Tiger\".Rocky IV - Again like the two other sequels, cheesy but still entertaining and it had another great song \"No Easy Way Out\". Rocky V - I know this one disappointed a lot of fans but I thought it was okay but I can understand why people didn't like it but I don't think it deserves to be hated.Rocky Balboa - Was redeeming and I like how it has a lot of references to the first Rocky. Creed - Finally, this one was another great comeback for Stallone as Rocky and gave Michael B. Jordan his big break as well. But you can't beat the original because it's the first and a classic, like I said before. But I'm still looking forward to the sequel to Creed next year."
    },
    {
      "username": "forsaken999",
      "userUrl": "https://www.imdb.com/user/ur0518520",
      "reviewLink": "https://www.imdb.com/review/rw0149549",
      "warningSpoilers": false,
      "date": "14 May 2000",
      "rate": "10",
      "helpful": "108 out of 119 found this helpful.",
      "title": "NOT A BOXING MOVIE!",
      "content": "The first common misconception about Rocky, and something that's almost inevitable when you put a half-naked Stallone with boxing gloves on the cover is that it's a fighting movie. In that time it would fall into a category including Jean-Claude Van Damme and Jackie Chan. Now don't get me wrong, I like both of these actors a lot, they're among my favorites, but Rocky is not just another cheap movie about a man who like to win a fight or tournament because he deserves it (Bloodsport, Quest). Instead of a fighting movie we should say that it is a movie about a fighter. That changes the context altogether, it means that sure he has fighting on his mind but has other personal issues that are demonstrated throughout the movie. In fact in the whole movie there are two fight scenes (at the beginning and at the end) which together add up to about 15 minutes. The rest is the portrayal of a man who has never had it easy in his life but nonetheless keeps his heart. That is to say that he keeps his moral and ethics, just keeps on trying no matter the hardships. A MAN WITH A DREAM... an un-realizable dream to be frank. But in the end, a lot, even most, of our dreams are un-realizable... but we try anyway. The difference here is that this man is given a shot at his dream, a \"one-in-a-million shot\". It's something that we all would like so we can relate and CAN'T HELP but cheer for him at the end of the movie.The largest portion, in minutes, of the movie is actually devoted to the love theme between Rocky and Adrien. So that should maybe make this a \"love story\" movie instead of fighting movie. Adrien is another of his dreams, slightly more attainable which is why he devotes more of his time everyday to trying to attain it (her). She won't open up to anybody but in the end, with a certain amount of tenacity on the part of Stallone, she can't help but fall for the heart deep inside the rough exterior.Another theme here is that of fraternity between Rocky and Mickey, his trainer/manager. In fact THE MOST TOUCHING SCENE in the whole movie in my opinion is one of about 15 to 20 seconds long and without any words. It's when Mickey goes to see Rocky at his home the first time to see if he can manage him. Rocky gets angry with him but keeps it to himself until Mickey leaves, at which point Rocky takes it out on the door jam and yells at Mickey who can still hear him outside. Rocky's life is being turned upside down by this whole \"fighting Creed\" business and although it is his dream, he doesn't know how to deal with it and is scared to get mangled in the ring, knowing he's not of the same caliber as the champ. The touching scene is when he realizes that he has yelled at an old man. His heart takes him out into the street after Mickey, he joins him and shakes his hand. The beginning of an enduring friendship which will ultimately lead to tears in a later film (Rocky 3 and 5).This movie simply seeps with \"classic\", and by the end you know you have just seen a movie of courage, of the portrayal of \"the indominable spirit of man\" (Rocky 3). No matter the difficulties, Rocky's heart takes him through it all. It doesn't fit the mold of today's classics (like Private Ryan) with melodrama and grandiose scenery, just a simple movie, with simple qualities but very large meaning intricately woven into the fabric of the film itself by Stallone and the director John G. Avildson, with the musical overtones of Bill Conti. A classic from a different age, and the mold of a lot of movies to follow."
    },
    {
      "username": "TheSixthChild",
      "userUrl": "https://www.imdb.com/user/ur2949714",
      "reviewLink": "https://www.imdb.com/review/rw0149681",
      "warningSpoilers": false,
      "date": "28 December 2003",
      "rate": "10",
      "helpful": "203 out of 231 found this helpful.",
      "title": "His whole life was a million-to-one shot...",
      "content": "When I was a kid there were only three major things in my life: food, wrestling and `Rocky'. My brother and I followed the numerous Rocky Balboa struggles religiously, and even today, there is no exception. Although the latest efforts of Stallone have been pitiful, the movie that made his career is the 1977 Academy Award Winner for Best Picture, `Rocky'. On top of that, `Rocky' also earned two more Academy Awards for Best Film-Editing and Best Director (John G. Avildsen).This movie is unlike any other ever put on film. It's films like this that remind us of the beauty that is going to the cinema, and if only I was around during that year when such films as `Close Encounters of the Third Kind', `Jaws', `Saturday Night Fever' and `Network' were all playing in cinemas. The storyline takes place in Philadelphia, where Rocky Balboa (Sylvester Stallone) struggles to make a living as both a small-time boxer, and the brawn of a loan shark. Until one day, a sudden opportunity is handed to Rocky to compete for the World Heavy-Weight Title against the champion, Apollo Creed (Carl Weathers), a charismatic and flamboyant fighter labelled as `The King of Sting' and `The Master Of Disaster'. Attracted to Rocky's reputation as \"The Italian Stallion\", a match between Creed and the unknown boxer is set, which is subsequently advertised as a fight where a \"nobody\" can become a \"somebody\". Mickey (Burgess Meredith), is the owner of the gym where Rocky trains and later becomes Rocky's manager. Mickey is passionate about the world of boxing, and believes that Rocky has the potential to go the distance, instead of being `a cheap second rate loan-shark'. However, the central character in Rocky's life is Adrian (Talia Shire), a shy pet-store clerk, who acts awkwardly when Rocky even breathes in her direction. However, these almost completely distant outcasts are strangely drawn to each other. While one `didn't have much of a brain', the other `didn't have much of a body', so they worked on their opposites, only to end up together. The legend of this film when it was first released in the mid-70's was: `His whole life was a-million-to-one shot', but what Stallone did was prove to the world that `Rocky' is one-in-a-million.Seeing `Rocky' is both a cinematic experience and a religious experience. When first released, the film appealed to the widest audience, and all felt the emotion and intense passion which passed from the film, to them. The film's possession of realistic acting, superb dialogue and the most phenomenal music score by Bill Conti to date, indeed transformed the face of cinema. Stallone's wholesome performance of his own screenplay is electrifying as the film celebrates of the underdog battling to beat the odds. Fans of cinema aren't manipulated into thinking that the inevitable will happen as it does in every other tedious hero drama.Over 25 years on, `Rocky' still manages to let the audience's emotions explode; Rocky's blossoming relationship with Adrian, the seedy worlds of Mickey and Adrian's alcoholic brother, Paulie (Burt Young), and the affirmation of Rocky's inability to overcome Creed. And who could forget the excruciatingly compelling Balboa / Creed confrontation? Rocky's determination overturns the boxing fraternity, and supplies cinemaphiles with one of the greatest moments in cinematic history, as a body of spectators both on-screen and off applaud and chant for Rocky in unison. The following four Rocky sequels attempted to deliver the same magic as the original, however failed to convey it's message. `Rocky' illustrates how life itself is stifling and perplexing, but sometimes when you lose your way as well as your original intentions, you may just find something better.Simply put, if anyone has a free Friday / Saturday night, this is the film to go out and borrow from the local video store. It's unbelievable that this film was only voted in at #78 on the AFI Top 100 films of all time, and worse yet, was voted in at the SECOND best sports film of all time (the first went to `Hoosiers', starring Gene Hackman). C'mon people, be you black or white or brown or any other skin colour we have yet to discover, get out there and be inspired by Stallone's masterpiece, `Rocky'."
    },
    {
      "username": "marcrice",
      "userUrl": "https://www.imdb.com/user/ur66069983",
      "reviewLink": "https://www.imdb.com/review/rw3439530",
      "warningSpoilers": false,
      "date": "26 March 2016",
      "rate": "10",
      "helpful": "21 out of 21 found this helpful.",
      "title": "Great movie, great soundtrack a classic",
      "content": "What can you say about a this movie that has not been said already? It is my all time favorite movie series ever and I could watch every movies back to back time and time again. I have owned this movie series on Video, DVD, Blu-ray and owned just about every version going.The main story is about one mans struggles to overcome the odds life has stacked against him but it is also a love story. There are real touches of greatness such as Burgess Meredith as Mickey as veteran boxer who does not want to train Rocky as he sees him as a washed out bum until he is offered a shot at the big time. Then seeing his relationship with Rocky grow. The acting is superb and the music still pumps my blood to this day. This may have been the movie to invent the training montage which is now a must in any movie about sports or fighting. Stallone's performance is phenomenal as the film celebrates the underdog battling to beat the odds and it is still amazing almost 40 years after release."
    },
    {
      "username": "morrison-dylan-fan",
      "userUrl": "https://www.imdb.com/user/ur5424352",
      "reviewLink": "https://www.imdb.com/review/rw5544203",
      "warningSpoilers": true,
      "date": "11 March 2020",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Tribute to Guy Morgan:Rocky (1976)",
      "content": "In the last few weeks,I've been thinking about all the incredible films family friend Guy Morgan introduced to me,before he suddenly passed away at age 46 on March 11, 2019 of a brain aneurysm. One running joke we used to have was Guy saying \"Oh you watch all those French films,but you've not seen Rocky!\" On the first anniversary,I marked it by finally stepping into the ring.View on the film:Never having seen a boxing match or boxing film before entering a ring he would return to for the later underdog Sports title The Karate Kid (1984), director John G. Avildsen & his regular cinematographer James Crabe land killer combos, from the left hand long takes hitting a gritty indie atmosphere strike, by the wide-shots being held on Rocky building mutual respect between himself and trainer Mickey,and rolling to the cute awkward romance with Adrian. Backed by a hero pose score from Bill Conti, Avildsen pairs the indie left hits with killer knockout right hand thrills, rolling with the punches in early use of Stedicam breathing in the Philadelphia air, and handing out body blows in tightly held panning hits across the in-ring action.Famously writing the first draft in 3 days whilst penniless, the screenplay by Sylvester Stallone strongly leans towards the autobiographical, but refreshingly avoids tipping into indulgence, thanks to the working class sincerity Sly holds Rocky in, capturing a warm roughness in his clashes with trainer Mickey and the slow-burn romance of Adrian. Working up from his roots, Sly punches up with delightful wish fulfillment of local hero Rocky grabbing the chance to enter the spotlight against mega-star Creed.Having the flu whilst filming,Talia Shire wonderfully works this into her performance as Adrian,with Shire concerned she might give Sly her flu, leading to sweet nervous excitement over falling in love with Rocky. On one side having Burgess Meredith barking orders as Mickey,and on the other having Carl Weathers's slick cool Creed, Sly gives a excellent performance, pulling at the determined underdog heart of Rocky."
    },
    {
      "username": "dk777",
      "userUrl": "https://www.imdb.com/user/ur80922659",
      "reviewLink": "https://www.imdb.com/review/rw6288567",
      "warningSpoilers": false,
      "date": "20 November 2020",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Rocky",
      "content": "The story of a man who fights for himself and his self respect.Sylvester Stallone embodied Rocky with heart and soul, making him one of the most brilliant movie characters ever. The whole cast is great, the characters are interesting and layered, and the music is simply brilliant.Rocky is basically a drama, and the characters are human and realistic, we can identify with them and relive their emotions with them. This is exactly the power of this film, and what is especially impressive are the small subtle details, some of which are improvised and maybe that is why they turned out to be so impressive.The supporting characters are fascinating, especially Paulie, who was brilliantly portrayed by Burt Young. Talia Shire, Carl Weathers and Burgess Meredith are impressive in their roles, they are convincing and make the film absolutely great.Rarely can we see a complete film like this with mesmerizing characters that enchant us every time we see them on screen.There are no villains here, just a tale about the human spirit and his ability to overcome all odds.A truly uplifting and powerful film."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw3602979",
      "warningSpoilers": false,
      "date": "20 December 2016",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "What's Not to Like",
      "content": "Rocky is the consummate boxing movie. But it's also the story of a man who had pretty much wasted his life. Sylvester Stallone's boxer has thick head and a good heart. He depends on other to kind of look out for him. Unfortunately, he has worked with crooks because it's the only living he knows. He does hard manual labor. He likes to box and because he is intense, he catches the eye of the world champion. He gets a gig as a sparring partner and eventually a fight with the champ, Apollo Creed. Of course, it's a circus. Because Rocky is not bright, Creed is able to abuse him emotionally. Rocky is a bruiser, taking as many hits as he gives. Not a good way to have a future. There are subplots, involving MIck (Burgess Meredith) and Pauley (who is disrespectful of his sister Adrian) and then there is the romance developing between Rocky and Adrian. What happens is that Creed thinks Rocky is a joke while Rocky begins to train seriously for the first time in his life. What eventually happens is one of the best choreographed fights in all of cinematic history. A masterful movie."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1520837",
      "warningSpoilers": false,
      "date": "14 November 2006",
      "rate": "8",
      "helpful": "17 out of 23 found this helpful.",
      "title": "The Rocky Movie With Character Studies",
      "content": "After not seeing this film since it had come out in the theaters in 1976, I was almost shocked at how little action this movie had compared to what you see today....or in the Rocky sequels, for that matter. It's okay. It was needed to give us character studies of the main players: Rocky, his wife, his brother, his manager, etc., people we would see in subsequent films. Also, the fight scenes in those sequels went on too long, anyway. Frankly, I've enjoyed all the Rocky movies, beginning with this one.In this film, the romance between \"Rocky Balboa\" (Sylvester Stallone) and \"Adrian\" (Talia Shire) was a major subplot to the boxing saga. It reminded me a bit of the '50s film with Paul Newman, \"Somebody Up There Likes Me.\" If you enjoyed this movie, check that classic film out.The DVD transfer is excellent, especially considering the movie is 30 years old."
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6419182",
      "warningSpoilers": false,
      "date": "29 December 2020",
      "rate": "8",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Rocky",
      "content": "Excellent movie The movie story was not great. I experienced moments of boredom in the first half of the movie. Sylvester Stallon's performance in the film was excellent. The last fight in the film was great. I was very excited as I watched the last fight. The film affected all the sports films after it had a positive effect."
    },
    {
      "username": "b_u_n_44",
      "userUrl": "https://www.imdb.com/user/ur0954043",
      "reviewLink": "https://www.imdb.com/review/rw0149517",
      "warningSpoilers": false,
      "date": "4 March 2002",
      "rate": "10",
      "helpful": "29 out of 32 found this helpful.",
      "title": "The fact that Rocky isn't on the top 250 is kinda sad.",
      "content": "Rocky is one of two great boxing movies. Only Raging Bull challenges Rocky as the greatest boxing movie of all time. Not only is there great action inside the ring, the story and drama outside the ring makes for a movie worth watching over and over again. There is no doubt in my mind it should be at least in the top 25."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw2099411",
      "warningSpoilers": false,
      "date": "21 July 2009",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Underdog",
      "content": "The making of the movie, seems to mirror the movie itself. As much as Sylvester Stallone struggled to make the movie, as much is his character Rocky in a struggle in life. And that's what makes the movie so great. The boxing reflects the life of it's characters. And Sly believed in this movie, which is why he wanted to star in it too. His choices were right.Beginning from the script, to the actors he chose, to the music (I'm only going to say stairwell, because who ever saw the movie, can't deny the power of that scene ... and the music that played an integral part for it to work). Everything fits like a glove ... (no) pun intended.And while it seems so simple, it actually isn't. Ask \"Ali\" (the movie) or \"Cinderella Man\". Both with big star players, both \"Box movies\", but both didn't succeed (at least commercially). There aren't many great movies about boxing, but this is definitely one of them (like the entirely different \"Raging Bull\")."
    },
    {
      "username": "Obi-Wan Wilson",
      "userUrl": "https://www.imdb.com/user/ur1757242",
      "reviewLink": "https://www.imdb.com/review/rw0149646",
      "warningSpoilers": false,
      "date": "26 February 2003",
      "rate": "10",
      "helpful": "250 out of 301 found this helpful.",
      "title": "One of the greatest movies of all time.",
      "content": "I don't remember exactly when I first saw this film, but for a long time I thought that the second of the series was my favorite. Well, I recently bought the DVD box-set and after I watched the first movie again I knew that it was definitely the best in the series, and also one of the best movies ever made. Rocky is very much more than just a boxing movie. It's a movie about the unbreakable human spirit, determination, and the will to \"go the distance.\" Rocky(Sylvester Stallone) is a second rate club-fighter and a debt collector for a loan shark(Joe Spinnell). He becomes involved with a shy girl working in a petshop named Adrian(Talia Shire), and also becomes friends with her brother Paulie(Burt Young). Rocky's life really isn't anything of interest - until the World Heavyweight Champion Apollo Creed(Carl Weathers) gives him an unexpected shot at the title. An old boxer-turned-trainer named Mick(Burgess Meredith) offers to be Rocky's manager. Although the whole film is outstanding, what follows are some of the greatest and most memorable movie moments of all time. Rocky striving to go the distance in the training scene, the final fight, and the closing moments of the film are so emotional and inspiring that they perfectly demonstrate the human spirit and can bring out the will to win in anybody. Add to this an excellent music score and you have a classic and unforgettable movie. Without a doubt deserved the Best Picture award in 1976. Exceptional performances by all the cast members, notably Burgess Meredith and Sylvester Stallone. **** out of ****"
    }
  ],
  "errorMessage": ""
}