{
  "imDbId": "tt0107290",
  "title": "Jurassic Park",
  "fullTitle": "Jurassic Park (1993)",
  "type": "Movie",
  "year": "1993",
  "items": [
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "",
      "rate": "91",
      "content": "As a flight of fantasy, Jurassic Park lacks the emotional unity of Spielberg's classics (\"Jaws,\" \"Close Encounters,\" \"E.T.\"), yet it has enough of his innocent, playful virtuosity to send you out of the theater grinning with delight."
    },
    {
      "publisher": "Time",
      "author": "Richard Corliss",
      "link": "",
      "rate": "90",
      "content": "For dinosaurs to rule the earth again, the monsters needed majesty as well as menace. And Spielberg got it all right. [14 June 1993, p.69]"
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "75",
      "content": "The movie delivers all too well on its promise to show us dinosaurs. We see them early and often, and they are indeed a triumph of special effects artistry, but the movie is lacking other qualities that it needs even more, such as a sense of awe and wonderment, and strong human story values."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "",
      "rate": "75",
      "content": "There's only one kind of movie that Spielberg has truly mastered: the kind that looks like a wide-screen video game complete with loony plot twists and mind-bending special effects. And that's Jurassic Park down to its bones. [11 June 1993, Arts, p.12]"
    },
    {
      "publisher": "The New York Times",
      "author": "Elvis Mitchell",
      "link": "",
      "rate": "70",
      "content": "It becomes less crisp on screen than it was on the page, with much of the enjoyable jargon either mumbled confusingly or otherwise thrown away. [11 June 1993, p.C1]"
    },
    {
      "publisher": "Variety",
      "author": "",
      "link": "",
      "rate": "70",
      "content": "Spielberg's scary and horrific thriller may be one-dimensional and even clunky in story and characterization, but definitely delivers where it counts, in excitement, suspense and the stupendous realization of giant reptiles."
    },
    {
      "publisher": "The New Republic",
      "author": "Stanley Kauffmann",
      "link": "",
      "rate": "60",
      "content": "The results make poor old King Kong look like something from a Macy's Thanksgiving Day parade. Such is progress. [12 July 1993, p.26]"
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Kenneth Turan",
      "link": "",
      "rate": "50",
      "content": "All the imagination and effort (including 18 months of pre-production) that went into making the dinosaurs state-of-the-art exciting apparently left no time to make the people similarly believable or involving. In fact, when the big guys leave the screen, you'll be tempted to leave the theater with them. [11 June 1993, Calendar, p.F-1]"
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "40",
      "content": "There's more soul to be found in any Kong close-up than in this film's overplayed reactions, which are used to instruct us what we should be feeling at any given moment. This is never boring, but I can't recall another Spielberg film that left me with a more hollow feeling."
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Jay Scott",
      "link": "",
      "rate": "25",
      "content": "Perfectly passable kiddie escapism. It has a thrill or two, and a chill or three, but it has no poetry, little sense of wonder, no resonant subtext (Jungian or otherwise), no art... When it's over, it's gone. Extinct."
    }
  ],
  "errorMessage": ""
}