{
  "imDbId": "tt0107290",
  "title": "Jurassic Park",
  "fullTitle": "Jurassic Park (1993)",
  "type": "Movie",
  "year": "1993",
  "items": [
    {
      "username": "Pjtaylor-96-138044",
      "userUrl": "https://www.imdb.com/user/ur26820801",
      "reviewLink": "https://www.imdb.com/review/rw4198042",
      "warningSpoilers": false,
      "date": "10 June 2018",
      "rate": "10",
      "helpful": "38 out of 40 found this helpful.",
      "title": "A rare breed of film seldom seen anymore: a true masterpiece.",
      "content": "'Jurassic Park (1993)' is a landmark achievement, in as many ways as possible. While some of the exclusively digital dinosaurs don't hold up quite as well as the rest (despite having been only relatively recently surpassed by their peers - depending on budgetary constraints, of course), there are times when the superb CG almost seamlessly blends with possibly the best practical effects I've ever seen to create phenomenally believable, groundbreaking special-effects that truly are, still to this day, some of the best of their kind. Seriously, both the Raptor rigs and, specifically, the to-scale T-Rex are nothing short of breathtaking. They work so well not only due to the flick's fantastic technical prowess but also thanks to its beautiful blending of its core techniques (those created by clay and those by computer), its legitimate reactions from the compelling characters and its uncanny ability to put the audience right in the middle of it all, making you feel genuine wonder, fear, suspense and elation as if you're really sat alongside these long-extinct creatures. It's difficult to stress just how important the characters are in making it all so utterly believable, as well as so utterly captivating. Each of them feel like fleshed-out people, written to perfection by screenwriters who know how to get information across to the audience in a very organic way. It's almost as entertaining watching these people just converse with one another, discussing the morals of bringing extinct creatures back from the dead, as it is seeing them navigate the survival situation in which they are inevitably placed. It is only because we care so much about all the core players that the suspense sequences work so well, that we are kept on the edge of our seat every time a dinosaur lurks around the corner and that we grip our chairs when they leap for their prey. These scenes are some of the best in cinema, perfectly constructed with restraint and splendour. It's also difficult to describe how affecting even the simple moments can be, the moments in which we are asked to sit back and stare at the mere sight of a dinosaur. These should have dampened with time and yet they haven't, still eliciting the awe they did when they first hit the big-screen. They emulate the imagined magic of seeing one of these animals in real life for the first time. Running underneath all of this are some compelling themes that eagerly invite analysis, with the central debate being a tough and intriguing one. The picture is simply one of the most engaging I've ever seen, one that puts an ear-to-ear smile on your face just because it's so utterly amazing. It balances all of its core tenants impeccably, being a proper 'summer blockbuster' that's incredibly intelligent as well, to the point that every second is just supreme entertainment. It can make you lean forward in your seat or well-up with awe and, in general, have a blast from beginning to end. The movie is, without a doubt, a true masterpiece. 10/10"
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0324227",
      "warningSpoilers": true,
      "date": "18 November 2003",
      "rate": "9",
      "helpful": "77 out of 91 found this helpful.",
      "title": "A time when I thought dinosaurs were real",
      "content": "My first epic movie to see on the big screen was Jurassic Park. I was only 8 years old and I had no idea what I was in for when I watched this movie. I was terrified but so enchanted by this world. Steven Spielberg brought back the dinosaur genre, a genre that was only used with caveman movies. Not to mention did it with incredible special effects. I remember seeing this movie for the first time and asked my mom if the dinosaurs were real or if they made giant robots. Those dinosaurs not only looked real but were absolutely terrifying. But what an adventure we took with Jurassic Park, the land where anything could happen with a crazy billionaire and upset employees who pretty much destroy the world for a nickel. One of the most memorable movies of all time that still holds up to this day, Jurassic Park is a film not to be missed.Billionaire John Hammond, has recently created Jurassic Park: a theme park populated with dinosaurs cloned from the DNA extracted from insects preserved in prehistoric amber. After a park worker is attacked by a dinosaur, Hammond's investors, demand that experts visit the park and verify that it is safe. Gennaro invites Dr. Ian Malcolm, a mathematician, while Hammond invites paleontologist Dr. Alan Grant and paleobotanist Dr. Ellie Sattler. They are joined on the island by Hammond's two grandchildren Tim and Lex. Hammond asks Malcolm, Grant, and Sattler what their thoughts are about having recreated dinosaur species. The group sets off to explore the park. The head computer programmer, Dennis Nedry, is secretly in the employ of one of InGen's corporate rivals, and has been paid to steal fertilized dinosaur embryos. During his theft, Nedry deactivates the park's security system, allowing him access to the embryo storage. The group is now parked in front of the T-Rex's cage and now they are fighting for their lives in Jurassic Park.I think one of the most memorable scenes is definitely the raptors chasing the children in the kitchen. What a tense scene that made you hold your breath the whole way through. You have to love Jeff Goldblum in this movie, when he tries to \"save\" the children from the T-Rex and instead pretty much gets his butt kicked, he gets saved later and as they are chased in the car by the T-Rex the only thing he can say as this giant monster is catching up faster and faster with each footstep, he says \"must go faster\" so calmly, how funny! But there is a moment that scares me more than the dinosaurs that I'm surprised no one noticed in the editing room, the granddaughter is scared to death screaming at Sam Neill that the lawyer left them and he replies with a dark look \"that's not what I'm going to do\". I responded that with \"I have much darker plans for you\", I mean his look was just so creepy! I digress, Jurassic Park is still a very fun movie that is the ultimate adventure. It's timeless and I can't wait to show my kids one day, what a great movie with wonderful effects and a wonderful cast and crew.9/10"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2796152",
      "warningSpoilers": false,
      "date": "11 May 2013",
      "rate": "9",
      "helpful": "43 out of 50 found this helpful.",
      "title": "With a bazillion other reviews, I'll keep this short.",
      "content": "By now there are nearly a thousand (not really a bazillion) reviews for this Steven Spielberg film. So, in the case of mega-hits where there is a strong consensus that the movie is exceptional (and I don't disagree), what more is there to say?! Apart from a few characters who seemed a bit one-dimensional (which is a minor problem in an action film) and the unwritten Spielberg rule that kids cannot die (taking away much of the suspense), the film is amazing. While the CGI isn't quite as beautiful as what we can do today, it STILL looks awesome. With only a few exceptions, the dinosaurs LOOK real! And, the music from John Williams is, as expected, very good. Overall, a highly entertaining film which will no doubt please everyone except for the impossible to please."
    },
    {
      "username": "FrankBooth_DeLarge",
      "userUrl": "https://www.imdb.com/user/ur4111911",
      "reviewLink": "https://www.imdb.com/review/rw1165979",
      "warningSpoilers": false,
      "date": "5 September 2005",
      "rate": "10",
      "helpful": "407 out of 465 found this helpful.",
      "title": "A Groundbreaking, Heart Stomping, Dino Sized film",
      "content": "In the year 1993, Hollywood saw something unlike anything else, the film Jurassic Park. Never before 1993 had dinosaurs been so breathtaking and realistic on the silver screen.The plot is very original. A group of scientists cloned dinosaurs, and are about to open an amusement park where people can see the dinosaurs. The creator John Hammond(Richard Attenborough) invites a group of people, along with his grandchildren, to see the dinos and enjoy a relaxing time at the park. Could anything go wrong, at the time it doesn't seem like it, but something else is going on. Employee Dennis Nedry is planning to steal dinosaur embryos. In order to do this, he causes a security breakdown so he can get the embryos and escape. He isn't the only one that can escape, as hungry dinos also escape. After this, everyone on the island is in danger, and loose dinosaurs are everywhere. That is where the fun in Jurassic Park comes in.This is an underrated movie according to the IMDb ratings. It isn't even in the top 250. Today, people don't appreciate it as much, mainly due to the fact that other movies like it have been made. Growing up in the 90's, this was one of my favorite movies. As a kid, I only watched it to see the dinosaurs, as I didn't understand a whole lot of it. Today, I realize how great the plotting and suspense are.This spawned two sequels. The second one wasn't bad, but the third wasn't very good. I would recommend seeing the second after this, but the third is passable.The story is great, how at first we see how the magic was created, and then later we see the magic turn into a disaster, in which everyone's life is at stake.The special effects are still good today, but they were revolutionary for back in 1993. The acting is good, and the ensemble cast is great. All of the action sequences are perfectly executed, creating plenty of suspense and tension.Younger kids may get scared by this, as I remember a lot of young kids being scared by it in 1993. If kids aren't scared by dinosaurs, they will probably enjoy the movie.I highly recommend Jurassic Park. It is quite underrated in my opinion, it deserves more credit than it gets.Watch this at all costs if you have somehow missed it and see what everyone was amazed about back in 1993.Enjoy"
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8833031",
      "warningSpoilers": false,
      "date": "28 January 2023",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "Life finds a way.",
      "content": "Dinosaur DNA is discovered, and geneticists manage to bring the extinct species back to life,at Jurassic Park, however the peace and tranquility is broken when the power fails.Jurassic Park is one of those films I grew up with, and have loved since the day I first saw it. I would imagine this is one of those films you'll remember seeing for the first time, I think I went about three times, then subsequently picked up the DVD, then the blu ray, it's a film I watch pretty frequently.It has never lost its magic, it's an imaginative, action packed blockbuster, it has never lost any of its shine, even some of the atrocious follow ups have never managed to tarnish it.It spends the first hour building up, introducing the characters, the beasts, then it kicks into top gear, it really is edge of the seat viewing.The action sequences are still incredible, and will still entertain audiences young and old. It isn't just all about the special effects, which are of course excellent, it is incredibly well acted, Neill, Durn and Goldblum are all on point, especially when you imagine how much green screen acting they'd have done. Dickie Attenborough, I could watch him in anything.Jurassic Park was, and always will be, a wonderful, action packed family blockbuster.10/10."
    },
    {
      "username": "PedroPires90",
      "userUrl": "https://www.imdb.com/user/ur26163020",
      "reviewLink": "https://www.imdb.com/review/rw8213178",
      "warningSpoilers": false,
      "date": "7 June 2022",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "Perfect",
      "content": "This film alone justifies the entire existence of cinema. Magical.Spielberg is alive and directing. John Williams is alive. I only ask a single thing: just one more creature blockbuster. Please."
    },
    {
      "username": "josiahliljequist",
      "userUrl": "https://www.imdb.com/user/ur61114145",
      "reviewLink": "https://www.imdb.com/review/rw4929076",
      "warningSpoilers": false,
      "date": "11 June 2019",
      "rate": "10",
      "helpful": "85 out of 90 found this helpful.",
      "title": "The Movie to define a Generation.",
      "content": "If you were born in the 90s or before, you had a connection with people...you absolutely loved this movie, and it made a mark on you. I think most people remember when they saw this movie first, because it was that awe inspiring of an experience. I remember that it was the first pg-13 movie I was allowed to watch, and what a way to start my grown up movie experience!!! Everything in this movie screams adventure, from the opening scene where the jungle leaves rustle, the shot of mysterious sparkling amber, to the landing of the helicopter on a remote rainforest island, the movie sets the tone for the greatest adventure movie ever made. As you hear John Williams glorious theme start to swell, and you see Alan remove his glasses and start to tremble, you know you're about to witness one of the most magical moments ever put on cinema. I can't go into detail on all the incredible scenes, from the T-Rex reveal, to the kitchen scene, but each one of them revolutionized what we thought movie magic could take us. Thank you Spielberg for making this enchanting piece of art for us, an entire generation is indebted to you."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2228448",
      "warningSpoilers": false,
      "date": "30 March 2010",
      "rate": "9",
      "helpful": "17 out of 19 found this helpful.",
      "title": "Dazzling spectacle, with the dinosaurs as the scene-stealers",
      "content": "I personally really like Steven Spielberg, and I like his films, especially Schindlers List, Jaws and ET:The Extra Terrestrial. While a tad too long and has one or two loose ends in the plot, Jurassic Park nevertheless has thrilling action and has sheer evidence of the director's vision and effortless verve at work. John Williams's score is absolutely terrific, definitely one of the more memorable scores in a Steven Spielberg movie, the score for Jaws like Psycho is one of the main reason why I am so scared to go into the sea now. The acting is really not bad at all, Sam Neill and Laura Dern have given better performances but they were good. Jeff Goldblum is terrific, and as Dennis Nedry Wayne Knight is suitably more subdued. Richard Attenborough, a talented actor and a even more talented director also is good as John Hammond, while child star Joseph Mazello, who surprised me in Shadowlands is appealing as Tim. However, the real stars are the dinosaurs, especially the T-Rex, the mix of computer animation and models is inspiring. The cinematography is astounding, the script is good and the direction is lively. I haven't read Michael Crichton's book, but regardless this is a hugely enjoyable film. 9/10 Bethany Cox"
    },
    {
      "username": "mark.waltz",
      "userUrl": "https://www.imdb.com/user/ur0968789",
      "reviewLink": "https://www.imdb.com/review/rw3460612",
      "warningSpoilers": true,
      "date": "30 April 2016",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "A child's fantasy, but the world's nightmare.",
      "content": "When man messes with the secrets of nature, they are going to live to regret it, that is if they live to see it. \"Think of it as a big cow\", scientist Sam Neill tells the kids he's trapped in the jungle when a herbivore visits the tree they are sleeping in a tree that the friendly dinosaur grabs a ton of leaves from to make a huge salad. But even big herbivores can crush a small human with their gigantic feet, and then there are the carnivores which come in all sizes, and even a small one can devour a full grown man in a matter of minutes, bones and all.If the shark of \"Jaws\" was frightening, the T-Rex and other species recreated at Richard Attenborough's mysterious island compound that he has set up as a possible amusement park. But there is no amusement when every species of meat eaters go after human prey.Impressive and cinematic, this was a huge blockbuster that came the same year as the film that won Steven Spielberg his very first Oscar, \"Schindler's List\", and it is a total contrast from that now classic drama about surviving the worst real event in modern history. \"Jurassic Park\" is about survival, too, and one that we pray never comes true with human involvement.Between Neill and Laura Dern, Jeff Goldblum and Attenborough, this is pretty star-studded. The kids get grating at times, but the mixture of tense action and humor makes for a thrilling film. Once again, composer John Williams creates a classic score, adding to the many he's already done for a Spielberg film.For me, this is a reminder why science needs to keep its corrupt fingers off of the mysteries of nature. Dinosaurs are fascinating, but there is a reason why civilization has thrived while they became extinct. I look at this as just one possibility of how they lived, how they looked, and possibly how they interacted with whatever human beings looked like when these not always friendly giants roamed the earth."
    },
    {
      "username": "MichaelM24",
      "userUrl": "https://www.imdb.com/user/ur1224390",
      "reviewLink": "https://www.imdb.com/review/rw0323954",
      "warningSpoilers": false,
      "date": "6 July 2001",
      "rate": "",
      "helpful": "146 out of 177 found this helpful.",
      "title": "exciting",
      "content": "JURASSIC PARK was the film that ignited my interest in filmmaking and drove me to get a degree in it, so I will always have a soft spot for it. I was eleven when I read the book, but all the technical stuff lost me and I never finished it. A couple years later when I heard the movie was coming out, I decided I would just see it instead. With advance tickets selling out fast, my mom was lucky enough to get some a few days before it's premiere. We stood in line for roughly thirty minutes before we finally got in. Even as the lights were dimming, I still had no idea what to expect. Within moments I was glued to my seat. The opening sequences remains one of my favorite scenes in any film and continues to give me goosebumps to this day. For the next two hours, I sat in my seat just staring at the screen as these marvelous, life-like creatures that were unlike anything I had ever seen before. The film was full of awe and scares. I walked out of the theater virtually trying to catch my breath. What a thrill ride the film had been, and I eventually went back and saw it a few more times. The film was a turning point in my life, as I said, because I walked out saying to myself, \"That's what I want to do.\" Sure the characters aren't deep and the dialogue isn't great, but who cares when the film is this entertaining? The actors are good in their parts, especially the always great Sam Neill, and the dinosaurs are incredibly life-like. The action is great, and the pacing (after a slow start) is relentless. The film has a few continuity flaws, but none of them matter. This film is great entertainment."
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw3740801",
      "warningSpoilers": true,
      "date": "28 June 2017",
      "rate": "10",
      "helpful": "20 out of 24 found this helpful.",
      "title": "Still great after almost a quarter of a century",
      "content": "After a worker is killed in an accident at the dinosaur theme park 'Jurassic Park' owner John Hammond calls in experts Dr Alan Grant and Dr Ellie Sattler as well as mathematician Ian Malcolm to visit it the park and clear it to open to the public. 'Jurassic Park' is no ordinary theme park; it is on a remote island off the coast of Costa Rica and it contains real dinosaurs! It is explained how these have been created by extracting dinosaur DNA from blood in mosquitoes preserved in amber. The first ones the visitors see are harmless herbivores but they are told that the park also contains some of the most famous carnivores such as Tyrannosaurus and Velociraptor; something that both excites and concerns the scientists. After an introduction the visitors, along with Hammond's grandchildren, Lex and Tim, and the company lawyer take part in a tour of the park. As they travel things go wrong for two reasons; a tropical storm is heading for the island and, more importantly, a corrupt company employee as set up a computer program that will turn off various security systems including the electric fences that protect the guests so he can attempt to steal dinosaur DNA sell it to a competitor. Once things do go wrong those on the tour find themselves fleeing for their lives following a T Rex attack on their vehicles while those at the park headquarters try to find a way to get the systems working again. Inevitably not everybody will get out alive.Like most people who watched this in the cinema when it was new I was amazed by the special effects that brought long extinct creatures back to life; watching it again over twenty years later and they still look fantastic. If one didn't know that dinosaurs died out millions of years ago you could be excused for thinking you were watching real animals. While these were the films big selling point it would have been for nothing if we didn't also have a good story acted by a fine cast luckily we have both. The action isn't rushed; a significant amount of time is spent introducing all the main characters and explaining the characteristics of the various dinosaurs. This means that by the time everything goes wrong we care about the protagonists and know which characters to look forward to seeing die! There aren't a huge number of deaths and those there are aren't overly gruesome; the goriest moment is the brief sight of a severed arm. Despite its UK-PG rating it is surprisingly intense at times and has plenty of genuinely scary moments. The cast do an impressive job; Sam Neill and Laura Dern impress as the two leads and there are also fine performances from Richard Attenborough, Samuel L. Jackson, Jeff Goldblum and Bob Peck. Child characters are often annoying but Joseph Mazzello and Ariana Richards are pretty good as Tim and Lex; especially the latter who is a great screamer! Overall I'd defiantly recommend this to anybody wanting a genuinely exciting film that is suitable for most ages."
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw3672213",
      "warningSpoilers": false,
      "date": "27 March 2017",
      "rate": "8",
      "helpful": "14 out of 16 found this helpful.",
      "title": "A milestone in its time",
      "content": "The biggest attraction of this film back in 1993, of course, was the realistic computer graphic animation of the dinosaurs by SGI coupled with the realistic sound effects and the good use of suspense built around them both.After I first saw this movie in the theatre 24 years ago, I laid in bed awake for hours, not from fright, but from the lingering excitement of the entire experience. Up to that time, nothing like it had ever been done on that scale. This is hard to remember when, since then, the Discovery Channel came up with the whole \"Walking with ...\" series of documentaries on dinosaurs, early man, and creatures before the dinosaur that use the same techniques that this film did, and thus people have become accustomed to this level of realism in animation both on the small and large screen.Thus with the \"shock value\" of the animation removed, this movie doesn't seem quite as \"5-star\" as it did during its first run. The dialogue, in particular, seems a bit thin now. One aspect of the movie that still impresses me that doesn't get much mention is the outstanding use of sound and sound effects. For example, when the T-Rex first appears in the movie, it is not just the sight of the thing that terrifies, but its tremendous roar. It is still great action adventure viewing for the entire family."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw2601931",
      "warningSpoilers": false,
      "date": "25 April 2012",
      "rate": "10",
      "helpful": "19 out of 23 found this helpful.",
      "title": "Classic for a reason",
      "content": "I'm no great fan of Steven Spielberg. He makes films that should interest me, but all too often ruins the experience by being overly sentimental. Take his WAR OF THE WORLDS remake as a case in point: it had the potential to be a fantastic movie, but thanks to the ridiculous plot twists I can't ever bring myself to watch it again. However, JURASSIC PARK, despite containing an overload of sentimentality, manages to be a simply great movie, a classic in fact, thanks to an overwhelming amount of elements that work.Michael Crichton's story is fresh (if you overlook the fact that it's Westworld with dinosaurs) and inventive. Okay, I wish Spielberg had made this film for adults rather than kids – complete with the graphic bloodshed of the original novel – but then I guess I wouldn't have seen it in the cinema at the age of 12 and been hugely influenced by it. The cast is splendid, particularly Sam Neill, one of those rarely-seen character actors who really deserved the big time success he enjoyed with his role here. Goldblum is even better, although much underutilised in favour of the redundant Laura Dern character. Watch out for Wayne Knight and Sam Jackson in memorable bit parts and try to avoid the annoyingly precocious brats played by Joseph Mazzello and Ariana Richards. Bob Peck's big game hunter, straight out of the pages of a H. Rider Haggard novel, is a complete scene stealer.Of course, this is one of those rare movies where the actors come second to the special effects, and the mixture of CGI and animatronic models is still breathtaking to this day. The scene where the T-Rex escapes is hands down one of the most suspenseful moments in cinema, ever. Okay, what follows is occasionally ridiculous (the car dropping down the tree scene) and involves kids running around too much, but it's still the kind of breathlessly exciting movie that there aren't all that many of.I still remember feeling a little bit jealous of how this movie popularised dinosaurs in the mainstream. As a kid, I'd always loved the creatures and owned loads of books about them, but after JURASSIC PARK every kid in the world fell in love with them and it was never the same. I ended up a little jaded, as I'd wanted to stay in that little niche on my own. Anyway, I digress: this is an outrageously good family movie, one of those films with a little bit of everything in it for everyone, and one I can wholeheartedly recommend and enjoy over and over again."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw3512611",
      "warningSpoilers": false,
      "date": "26 July 2016",
      "rate": "9",
      "helpful": "13 out of 15 found this helpful.",
      "title": "Some things dead, should stay dead",
      "content": "As a kid I so well remember my younger brother and those dinosaur toys he had as a kid. We've seen dinosaurs in film before going back to the silent version of The Lost World. But they were never better shown than when Steven Spielberg made Jurassic Park out of Michael Crichton's novel. These put other screen dinosaurs to shame.Through some cloning billionaire Richard Attenborough has succeeded in recreating those long dead creatures of the past and now has a theme park, Jurassic Park. All the herbivores and the carnivores of the past are now alive. But when you come right down to it, Attenborough has just become another Dr. Frankenstein. Some things dead should stay dead.At least that's what scientists Sam Neill and Jeff Goldblum try to tell him. And I have to admit Attenborough does have state of the art security. But he has a greedy employee in Wayne Knight who has made a secret deal with some rival tycoon. His greed brings the whole operation to disaster as dinosaurs start running amuck.The tyrannosaurus rexes and the raptors are what captured the imagination of the public when Jurassic Park was reached. Up to that time dinosaurs when they were on screen were slow moving behemoths. Spielberg's dinosaurs have some speed to them, far more like what they were in the Jurassic Age.I have to say I loved Wayne Knight's performance in Jurassic Park. He's such a loathsome creep, but also a real putz. The end he meets is truly just.Jurassic Park and its successors and imitators have brought about a renewed interest in paleontology. That's always healthy in any society, an interest in the sciences.My brother Daniel loved this film when it came out. As will you."
    },
    {
      "username": "Dragoneyed363",
      "userUrl": "https://www.imdb.com/user/ur18374320",
      "reviewLink": "https://www.imdb.com/review/rw1868582",
      "warningSpoilers": false,
      "date": "4 May 2008",
      "rate": "10",
      "helpful": "127 out of 165 found this helpful.",
      "title": "The best dinosaur movie there is; one of the best movies in general",
      "content": "I first saw this back when I was little. If I remember correctly, it was also a big thing when it came out. I even had a backpack with a Velociraptor head sticking out of it for school. It was such an amazing achievement as a movie itself and the film is so wonderfully done that there's no doubt of why it has held up as long as it has and will remain the best dinosaur film ever created.The dinosaurs in this film look more realistic than any other prehistoric film, or even most movies today that try to pass off crappy CGI has reality. The acting was spectacular, and aside from how wonderful the creatures look and how vicious and exciting they were like no other dinosaur film had had them before, the plot and characters were solid and incredibly entertaining where you didn't think they would be so amusing. I will have to say again that one really huge reason why most people loved this movie was because of the special effects, but here again, isn't that an accomplishment in itself? Having your audience enjoy the film because of how realistic and fresh you are able to make it feel and look? I have never seen another movie with better effects than this one, ever. I am sure none of these horrible effects dinosaur movies that have been coming out lately could ever live up to the greatness of Jurassic Park.I am always going to love Jurassic Park for it's witty, unbelievable maneuvers and incredible screenplay though, as well. It was so properly thought out and executed, where most might have been expecting it to be nothing but high levels of adrenaline rushes with brainless action, which there was pulsating action, it just certainly wasn't as mindless. Many who dislike Jurassic Park really just have all the same reasons the average movie-goer would have for disliking a film, yet I haven't heard anyone fully describe and explain, well, what they truly thought were faults with this film, which gives me reason to believe that Jurassic Park is a masterpiece, for I, myself, have no faults with this film, except that I have seen other films that I enjoyed more. . . just a little more."
    },
    {
      "username": "Go_rated_R",
      "userUrl": "https://www.imdb.com/user/ur1101257",
      "reviewLink": "https://www.imdb.com/review/rw0323995",
      "warningSpoilers": false,
      "date": "16 August 2001",
      "rate": "",
      "helpful": "418 out of 510 found this helpful.",
      "title": "One of the greatest films ever made.",
      "content": "I don't know why I loved this movie so much. Maybe it was the utter amazement when I first saw the Brachiosaurus eat from a tree. Or maybe it was my adrenaline rushing when two 12 year old were attacked by velociraptors. It might possibly be the chills that went down my spine when the T-Rex first made his terrifying roar. Whatever it was, it made me write this review.Allan Grant (Sam Neil) and Ellie (Laura Dern) are two successful paleontologists who are asked by a rich man John Hammond to come at his park for a major tour. They agree and are taken to an island where \"Jurassic Park\" logos are everywhere. The two paleontologists have no idea what they are getting themselves into. The first dinosaur to make an apearance is the Brachiosaurus, which both of them are extrememly amazed by its giant apearance, and so is the audience. What the two of them don't know is that there are much more terrifying and carnivorous dinosaurs who are about to escape and run loose....Directed by the mighty Steven Speilberg, Jurassic Park relied on more character development than any other creature-feature. Usually you get second-rate actors who can't act, getting terrified by monsters that don't really exist. Jurassic Park was the opposite. It changed the way we looked at the world, and it will forever. Based on the novel by Micheal Crichton, Jurassic Park was an amazing movie.From beginning to end, Jurassic Park bedazzled us with dinosaurs. Dinosaurs that are EXTINCT. There are a lot of cool cameos and the stars give great performances. The whole family should watch this movie. Not for the glossy title, but because of the dinosaurs. I remember being a kid when I first watched it, and I remember loving this movie so bad. The climax was excellent, and I am not saying what happens, unlike the sequel to this film (Jurassic Park 3). A climax-less bad film, that was. But this....this was magic. And yes, it was a masterpiece.The magic of this film is what brought me into dinosaurs, too. I had a \"Jurassic Park\" marathon today and I watched this movie, and I can still feel the magic. You will feel the magic too once you see it. I just have absolutely nothing to say except that Steven Speilberg will put a spell on you. Even if you don't like creature-features, this movie will entertain you. Steven Speilberg will take you to places that no one else ever will. And the \"life will find a way\" speech is here, ready to make someone feel that creating dinosaurs that have been extinct for millions of years is a good thing.Absolutely needless to say, Jurassic Park was a golden diamond.10/10 (One of the greatest films ever made)"
    },
    {
      "username": "NightmareOnElmStreetFan",
      "userUrl": "https://www.imdb.com/user/ur98240498",
      "reviewLink": "https://www.imdb.com/review/rw4634269",
      "warningSpoilers": false,
      "date": "8 February 2019",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "The best classic sci-fi action my number 1 personal favorite adventure Dinosaurs movie Steven Spielberg's ultimate thrill ride",
      "content": "Jurassic Park (1993) is one of the best classic science fiction action adventure movie one of my personal number 1 favorite adventure Dinosaurs films of all time. It is Steven Spielberg's ultimate thrill ride. It has great visual effects, breathtaking story, it has heart and soul it defines my childhood. I grew up with the film I used to had a t-shirt with Jurassic Park. I love the film to death it is the best one in the franchise it is my number 1 favorite film In the franchise we can say it is the best animal family movie for everyone including kids.It has wonderful score from John Williams, great cast it has Sam Neill, Laura Dern, Jeff Goldblum, Richard Attenborough, Samuel L. Jackson, Wayne Knight, Joseph Mazzello and Ariana Richards.The film is based on a novel from Michael Crichton the book come out 1990 the movie come out 1993 and Michael Crichton helped writing a script for the film. It was brilliant direction from Steven Spielberg about scientists tampering with nature, the film is also mixed with horror in which velociraptor try's to eat Dr. Ellie Sattler (Laura Dern) who finds a Ray Arnold's arm (Samuel L. Jackson). The effects are top notch, the CGI for 1993 is still good I love the design for T-Rex and the velociraptor fighting on the end. I love Brachiosaurus in this movie I love those dinosaurs so much.The story is original a group of scientist cloned dinosaurs they about to open a amusement park for people lead by John Hammond (Richard Attenborough) who invites on a island of Isla Nublar, four people paleontologist Dr. Alan Grant (Sam Neill), paleobotanist Dr. Ellie Sattler (Laura Dern), mathematician Ian Malcolm (Jeff Goldblum) and a lawyer Donald Gennaro (Martin Ferrero) to gave him their opinions. All three disagree with John Hammond that tempered with nature is wrong and only a lawyer agrees with John because he thinks the park will make a fortune. One of the employees Dennis Nedry (Wayne Knight) is planning to steal dinosaur eggs and during a preview tour, he causes a security power breakdown that allows its cloned dinosaur exhibits to run amok. Dr. Grant stays with the kids Tim (Joseph Mazzello) and Lex (Ariana Richards) alone in the park and he has to return to resort complex, meanwhile John Hammond, Dr. Ellie Sattler, Ian Malcolm, Ray Arnold and Robert Muldon (Bob Peck) trying to get the power back.I love Dr. Alan Grant I love the character he was a great hero, great adventurer great paleontologist and great researcher. I love Sam Neill his character was writen on his skin. I love the kids Tim and Lex Joseph Mazzello and Ariana Richards they were great kids who were Hammond's grandchildren I love them. The most heart in the film was Dr. Ellie Sattler (Laura Dern) because she cared about the animals she was a great human been she wanted to help a sick triceratops which I love the character so much. John Hammond (Richard Attenborough) I really miss the actor I love his character I love what he try to do I love him to dead it is a shame he is no longer with us. I like Dr. Ian Malcolm in this movie he wasn't annoying in this movie Jeff Goldblum was likable and decent.My favorite scenes in the movie are: The T-Rex chases the jeep down the road with Dr. Sattler, Ian Malcolm and Robert Muldon in an exciting car chase of an action sequence. I love in which Dr. Grant and kids are climbing over the fences and the fences are electricity high voltage the fence electrifies Tim and he fly's down off the fence great breathtaking scene ever. I love that scene. I love the action sequence in which Lex and Tim are cornered by a pair of velociraptors inside the main kitchen and fight for their survival. Another favorite scene of mine is when Ellie discovers Ray's severed arm in the maintenance shed and she sees the raptor that eat Ray try's to eat her. I really miss this movies and I miss my childhood. My best friend from my childhood was a huge fan of this film he collected comic books, action figures and he borrowed me his VHS tape of this film because I never seen the film before and I loved it.I love this film to death it has everything atmosphere, good wonderful effects, good scares, awesome thrills, breathtaking suspense on your sit, wonderful directing, great acting from everyone everything that makes the best movie in the adventure animal franchise. This is the best one in the franchise and my number 1 favorite dinosaurs film."
    },
    {
      "username": "Rob Paul",
      "userUrl": "https://www.imdb.com/user/ur0357680",
      "reviewLink": "https://www.imdb.com/review/rw0324075",
      "warningSpoilers": false,
      "date": "9 July 1999",
      "rate": "",
      "helpful": "110 out of 140 found this helpful.",
      "title": "Still a land mark in film making",
      "content": "It's hard to believe that it's 6 years since this film appeared at the cinemas. At the time it was a truly ground-breaking film, managing for the first time to portray dinosaurs in an extremely realistic manner, unlike those plasticine monsters that we were forced to watch in previous monster movies. Jurassic Park will also be remembered as the movie that finally made George Lucas sit up and realise that it was possible for him to make his prequels.In hindsight, while it is still an extremely well directed and tension filled movie, the script did seemed dumbed down in order to appeal to as many people as possible - but that's really irrelevant since this film is all about dinosaurs. One of Spielberg's brilliantly directed films, it even managed to make me forget Spielberg's previous disaster of a movie - do you recall HOOK?8/10."
    },
    {
      "username": "Criticman12",
      "userUrl": "https://www.imdb.com/user/ur24865064",
      "reviewLink": "https://www.imdb.com/review/rw2375853",
      "warningSpoilers": false,
      "date": "26 January 2011",
      "rate": "10",
      "helpful": "30 out of 36 found this helpful.",
      "title": "My favorite Movie",
      "content": "Steven Spielberg is known for making great movies like, \"E.T.\" and \"Schindler's List\". But on June 11 1993. He released my favorite movie, \"Jurassic Park\".What make's this movie great is the special effects. They really brought the Dinosaurs to life. It also had some nice suspenseful scene's. Also, the acting was good. Sam Neil does a nice job as Alan Grant and Richard Attenborough does a great job as John Hammond. Plus, the theme song was incredible. Sometimes when you listen to it, it feel's like you're going to cry.In the end, \"Jurassic Park\", is a great film and it is definitely worth watching."
    },
    {
      "username": "sophiebrooks-75145",
      "userUrl": "https://www.imdb.com/user/ur92371684",
      "reviewLink": "https://www.imdb.com/review/rw4366475",
      "warningSpoilers": false,
      "date": "28 September 2018",
      "rate": "9",
      "helpful": "36 out of 38 found this helpful.",
      "title": "Such a classic.",
      "content": "This movie is definitely one to remember. Despite being filmed in the 90s, Jurassic Park continues to be a classic to this day. Watching the movie now highlights the contrast between the effects then and the special effects available now. This, along with some acting that is a tad overdone, are the only real critiques I would give this film. The child actors were especially hilarious to me-the young boy, Timmy, has moments that really capture a reaction that a child in real life would have (\"I threw up.\" \"Well that's ok! That happens sometimes\"-Allen-is one of my favorite quotes). Another extremely influential aspect of this film is the music that plays over certain intense scenes and the iconic theme music in the opening/closing. The music combined with the diegetic sound of the dinosaur stomping/approaching builds the suspense and creates an intense tension in the audience. As a classic worldwide, it's no wonder that this movie provided the basis for generations of movies to follow."
    },
    {
      "username": "Jonathon_Natsis",
      "userUrl": "https://www.imdb.com/user/ur22122641",
      "reviewLink": "https://www.imdb.com/review/rw2775985",
      "warningSpoilers": false,
      "date": "1 April 2013",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "A genre staple gets a much deserved re-release in 3D and IMAX.",
      "content": "Perhaps more so than any other director in film history, Steven Spielberg has locked into that most desirable niche of movie-making: pleasing everyone at the same time. When his spectacular action-adventure Jurassic Park was first released in 1993, he left critics, film buffs, casual viewers, parents and children equally spellbound. Twenty years later, the film has been re-released in both 3D and IMAX, allowing a new generation to experience the magic, and old fans the chance to relive it again.Eccentric millionaire John Hammond (Richard Attenborough) has created the ultimate theme park on a secluded island, and he wants to offer a sneak preview to a select group of individuals (Sam Neill, Jeff Goldblum and Laura Dern). Of course, the prehistoric attractions don't much appreciate being detained for the amusement of others, and begin to cause havoc as soon as they take the opportunity to escape from their enclosures. An extremely imaginative plot adapted from Michael Crichton's novel of the same name, it sets the foundation for a rip-roaring battle for survival.For many viewers that first saw Jurassic Park as pre-teens, the greatest thrill will come from appreciating, to a greater degree, the way the film deftly builds suspense. Cleverly building up to the revelation of the 'meatasauruses' by stunning us with the visual treat of cuddly herbivores, when we do finally meet the imposing Tyrannosaurus, it is one of cinema's most exhilarating set pieces, only to be topped some time later by the thrilling cat-and-mouse game in the kitchen.It is a testament to the incredible skill of the animatronics and visual effects team that the film's most dated quality is the occasionally cheesy dialogue that burdens Lex and little brother Tim. The dinosaurs are clearly the main event, but the undercard of Jurassic Park spares no expense, with touches of class including Dr. Grant's personal evolution from a child apathist to a fully-fledged family man and a miasma of Shelley-esque criticisms of man's innate desire to play god while drunk on the illusion of total control.To call this the movie event of the year would be to make the grossest of understatements. Experiencing this glorious monument to total escapism on the world's biggest cinema screen is simply mandatory for anyone was has ever felt goosebumps in a theater. Bring your kids- they'll never forget it.*There's nothing I love more than a bit of feedback, good or bad. So drop me a line on jnatsis@iprimus.com.au and let me know what you thought of my review. If you're looking for a writer for your movie website or other publication, I'd also love to hear from you.*"
    },
    {
      "username": "estebangonzalez10",
      "userUrl": "https://www.imdb.com/user/ur13566917",
      "reviewLink": "https://www.imdb.com/review/rw3254893",
      "warningSpoilers": false,
      "date": "9 June 2015",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "My all-time favorite movie going experience",
      "content": "\"God creates dinosaurs. God destroys dinosaurs. God creates man. Man destroys God. Man creates dinosaurs.\"Since we're only a couple of days away from the premiere of Jurassic World I wanted to share some thoughts on one of my all time favorite movie going experiences (perhaps my favorite). I was only 12 years old when Steven Spielberg released Jurassic Park in 1993 and from the second the movie started I was at the edge of my seat. From the breathtaking and groundbreaking visuals, to the outstanding cast, and the magnificent score everything about Jurassic Park made me fall in love with it. The dinosaurs had come to life before my very eyes, and Spielberg masterfully wrote a thrilling script that had me sweating for two full hours. I can never forget the thrills I felt during the T-rex scene and that final climax with the velociraptors in the museum's kitchen. I remember thinking there was no one cooler than Sam Neill's Alan Grant and I wanted to be Tim Murphy (played brilliantly by Joseph Mazzello). The rest of the cast was also amazing: Laura Dern, Jeff Goldblum, Richard Attenborough, Ariana Richards, Bob Peck, and Samuel L. Jackson. Many will consider Jaws as Steven Spielberg's most terrifying film, but for me it was Jurassic Park because I got to experience it on the big screen and it was my first memorable experience at a theater. I had seen many other films that had made an impact on me prior to this (Star Wars, The Goonies, Raiders of the Lost Arc, and E.T.) but none in a theater, so Jurassic Park holds that nostalgic value and it will forever remain one of my favorite films. It also became the first film I went to see again at a theater because I couldn't get enough of this world. There are so many quotable lines from this movie and many memorable scenes, and I realize it is going to be impossible for Jurassic World to live up to that standard but I am still highly anticipating it while I relive some of my childhood memories with Jurassic Park. It's a masterpiece."
    },
    {
      "username": "dvdmrp",
      "userUrl": "https://www.imdb.com/user/ur0770063",
      "reviewLink": "https://www.imdb.com/review/rw0323914",
      "warningSpoilers": false,
      "date": "6 November 2000",
      "rate": "",
      "helpful": "116 out of 154 found this helpful.",
      "title": "Great Movie! One of Spielberg's best",
      "content": "Wow! That's about all one can say about this movie. The first time that I saw it I was mesmerized. The movie looked so cool and hey, it actually had a good plot. If you haven't seen this movie yet, get out from your cave and see it right away. I have seen this movie umpteen times and it still shocks and suprises me. If you have a DVD player I suggest that you buy the Jurassic Park 2 pack as soon as possible. The movie sounds and looks great, and the extras are cool too. So to summarize go see this. Spielberg is a true genius. Almost all of his movies were great. 10/10!"
    },
    {
      "username": "BA_Harrison",
      "userUrl": "https://www.imdb.com/user/ur0945066",
      "reviewLink": "https://www.imdb.com/review/rw1975880",
      "warningSpoilers": false,
      "date": "15 November 2008",
      "rate": "9",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Stomping, chomping dinosaur action par excellence.",
      "content": "I was raised on a diet of dinosaur and monster films, and so when Steven Spielberg gave us Jurassic Park in 1993 promising unbelievably lifelike prehistoric reptiles, I was at the head of the queue (metaphorically speaking of course, since I pre-booked my tickets!!). Needless to say, Steve's amazing big screen version of the Michael Crichton bestseller not only delivered on the promises, making the film a deservedly huge box-office success, but it also redefined special effects for years to come.Sam Neill, Laura Dern and Jeff Goldblum play three scientists who are invited to a multi-million dollar theme park featuring cloned dinosaurs, which the owner (good old Dickie Attenborough) hopes the trio of boffins will endorse. However, when one disloyal employee sabotages the park's computer system in order to try and steal valuable embryos for a competitor, the guests get to see the exhibits extremely close-up, and must fight for survival against the mighty T-Rex and a pack of intelligent and voracious Velociraptors.The film's plot is a somewhat stripped-down version of the book, and the narrative suffers occasionally for the lack of detail, but with Spielberg at the helm, the result is still a juggernaut of an action film that provides enough thrills, spills and adventure to make it unmissable for fans of creature features. The director manages to pull off some spectacular shots that are amongst the most memorable of his career (such as the simple yet iconic 'water-ripples' as the T-Rex approaches), and with the industry's top FX wizards at his disposal (including ace animatronics expert Stan Winston), he has made a film that still looks amazing a decade and a half later.The best of the trilogy (although part IV is currently in the pipeline, so we shall have to wait and see what happens with that one), Jurassic Park is an excellent piece of cinematic escapism, and way better than anything Spielberg has given us in recent years (I'm still reeling from the latest Indy film and the debacle that was War of the Worlds)."
    },
    {
      "username": "SimonJack",
      "userUrl": "https://www.imdb.com/user/ur17816293",
      "reviewLink": "https://www.imdb.com/review/rw8236787",
      "warningSpoilers": false,
      "date": "14 June 2022",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "The king of the monster sci-fi flicks, with the top director and athor in the field",
      "content": "\"Jurassic Park\" clearly deserved all the awards it received for special effects - visual, sound and editing. The entire production team contributed to one of the best sci-fi films ever made. And, without a doubt, it's the best monster sci-fi film ever made well into the 21st century. I can't think of another creature feature that seemed so real. While CGI was obviously very important in making this picture, the realism has to be attributed as much to the fantastic models of the dinosaurs created for the film - especially the main villain, T-Rex.This film took the development and use of animatronics to a new level. These are robotic types of models able that can be moved, for sequences of shots that make them seem to come to life. The effect, with actual creations is much more realistic than CGI. People can see videos of the creation and making of T-Rex online. People can see videos of the creation and making of the big guy online.The basis of the film, and a succession of sequels and all sorts of spinoffs, of course is the 1990 novel of the same title by Michael Crichton. Crichton (1942-2008) was a Harvard Medical school graduate and M. D. But he never practiced medicine in favor of a flourishing, driven writing career. He was the master storyteller of sci-fi thrillers, especially plots around medicine and the physical sciences. Of his 26 novels, 13 have been made into films. He also wrote several original screenplays, and directed and produced films. His first smash film success was \"The Andromeda Strain\" of 1971. Jurassic Park is by far the most successful book and film, but his books by 2020 had sold more than 200 million copies.Crichton and Stephen Spielberg became friends while working on this and other films. While having great directing talent across many genres, Spielberg has had a particular flair for sci-fi films. The Jurassic Park series are the most prominent, but others of his productions include \"Firelight\" of 1964, \"E. T. the Extra-Terrestrial\" of 1982, \"Twilight Zone, The Movie\" of 1983, \"Gremlins\" of 1984, \"Back to the Future\" of 1985, \"Innerspace\" of 1987, \"batteries not included\" of 1987, and sequels of some of these and more.All of the aspects of this film are excellent. And all of the cast are superb. The plot is simple and while many, many more have reviewed and commented on this film, I decided this late just to give the recognition to the author and director, both of whom have a repertoire of films that will last and be enjoyed far into the future. And as for seeing this film, anyone who has not yet seen it on a theater screen should watch for any such opportunity in the future. This is the type of film that misses the grand scale of the subject on TV screens, even the large flat wall screens. Dinosaurs, especially in \"Jurassic Park,\" and its sequels, should be seen on the big screen for maximum enjoyment."
    }
  ],
  "errorMessage": ""
}