{
  "imDbId": "tt0070047",
  "title": "The Exorcist",
  "fullTitle": "The Exorcist (1973)",
  "type": "Movie",
  "year": "1973",
  "items": [
    {
      "username": "jaywolfenstien",
      "userUrl": "https://www.imdb.com/user/ur1298472",
      "reviewLink": "https://www.imdb.com/review/rw1177257",
      "warningSpoilers": true,
      "date": "21 September 2005",
      "rate": "",
      "helpful": "520 out of 579 found this helpful.",
      "title": "The truth about the Exorcist.",
      "content": "There's a lot of anxiety that goes into viewing The Exorcist, \"the scariest movie ever made\", for the very first time. And with that anxiety comes a lot of expectations and preconceived ideas about what The Exorcist *should* be. Especially for someone born after the film. Then on top of that waited years before finally seeing it.I love the Exorcist, and after exposure to God knows how many horror films, the Exorcist remains my favorite within the genre. And even from a die-hard fan I have to admit, I hate hearing \"scariest movie of all time\" associated with this movie.First of all, there's no reason to compare fright factor of films, so forget that anyone ever called The Exorcist \"the scariest movie ever made.\" Take any movie  I don't care what movie  and stick a \"greatest/scariest/best\" whatever tag next to it, and you'll have audiences investing in what they *think* it should be instead of letting the film present itself for what it is. And all they see is that it is not what they expected (expectations, I might add, that are shaped by the current gimmicks and trends in Hollywood).I love the Exorcist because it dared to defy my expectations. This is not a wall-to-wall, credits-to-credits montage of scary imagery inspired by a mere scenario that's supposed to pass as a plot. This isn't a movie about that long dark corridor and something waiting to jump out of the darkness and attack (which is always preceded by a false scare featuring a cat). It's not about that cheap gimmicky scenario of X amount of people isolated from the rest of the world, with a killer/monster/ghost/whatever on the loose.The Exorcist is a very slow movie that actually features a full blown plot, its characters, and their associated arcs. The original ambition of The Exorcist was to scare the world with imagery and concepts never before seen in cinema. Shocking moments that the audience of 1973 could not believe they would ever see on the silver screen (from a major studio, no less.) After 30 years, the movie isn't so shocking because times have changed, and the success of the Exorcist has guaranteed countless imitation in all forms across all boards. However, the Exorcist is still one of the most ambition horror films ever made, because (are you ready for this?)  the Exorcist dares to tell a story.Everyone remembers the pea soup, the head spinning, the vulgarities spewed from the demon's mouth, the stairs, the infamous cut (now restored) spider walk. But I adore this movie for the things no one seems to bring up  I love the setup in Iraq where Father Lancaster Merrin detects the signs of his final showdown, and how these abstract scenes on subsequent viewings give the movie a more epic feel. I love the transition from Chris MacNeil to Father Karras walking across campus that's reminiscent of Alfred Hitchcock. I became absorbed watching Father Karras caring for his aging mother and the close relationship they have, seeing him depressed and sharing a drink with a fellow priest as he discusses his own issues with faith.And what impresses me most about a movie named the Exorcist is how it seems to reject the possibility of possession and exorcism as its ultimate and final solution. The characters in the movie don't want it to be true, and in fact don't really even know about the possibility of Exorcism, thus they explore and exhaust all other possibilities (both medical and psychological). I smiled with delight (after all the hospital scenes) in that priceless moment when Chris MacNeil asks Karras, \"And how does one go about getting an exorcism?\" which stops father Karras in his tracks as he, a man of the church, looks at her as though she's lost her mind.The fact that the movie resists the temptation to jump right into the acknowledgment that Regan is possessed continues to build up the epic Good versus Evil, God versus Satan, the exorcist versus the demon, feel. Like the characters, the movie doesn't want it to be true, it doesn't want to go there and embrace that possibility, but we the audience know what must inevitably happen. And it's almost magical how the movie finally acknowledges Regan's only hope. There's no glorious fanfare nor is there boastful ultimatums, instead the movie lamentingly and silently surrenders to it as we watch Lancaster Merrin walking up the sunny garden path, staring down at a newly delivered envelope. He doesn't have to read it. He already knows what it says, as do we.The imagery then fades to an ominous foggy night as a taxi pulls up to the MacNeil place in Georgetown, then we're treated to the haunting imagery that inspired the cover art. What must be done, must be done. I love how the movie implies that Merrin has faced this very demon before through its imagery, and through the dialogue as Karras explains he's identified at least three manifestations to which Merrin answers, \"No. There is only one.\" I can address more  the acting, the beautiful cinematography, brilliant makeup  but I'll stop to keep from sounding like a raving fan who over hypes every inch of everything. I'll close with these thoughts: I'm not the type of person who will watch the same movie over and over and over. Most movies I see, the specific imagery and specific ideas don't make a deep enough impression to stick with me for more than a few months. I remember the Exorcist, not because I thought it was the \"scariest movie ever made\", rather because of the wonderful craftsmanship, the fact that it dared to tell a story, and it defied my expectations.When Friday the 13th, the Grudge, Skeleton Key, and Cursed are reduced to vague memories and general ideas, I will still clearly remember the Exorcist."
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0129008",
      "warningSpoilers": false,
      "date": "3 August 2001",
      "rate": "10",
      "helpful": "267 out of 328 found this helpful.",
      "title": "An intense and very terrifying movie that will make you sleep with the bible a few nights in a row",
      "content": "The Exorcist is one of the best movies to come out of the 70's and deserves better than slowly descending down the top 250. It's one of those essential films you have to see in order to understand what a movie truly is and this is more than a horror film. Unfortunately there are so many people who are saying they got bored, I think because they expected a terrifying movie, people! This isn't a slasher movie, this isn't some scary Michael Myers that you can shoot, this is a story about normal people in a normal house and upstairs there is a little girl who happens to be possessed by \"The devil himself\". Faith is so strong and when it's shaken, anything in your imagination can run wild.First off the actors: Ellen Burstyn plays Chris McNeil, an actress working in Washington, D.C. on a film. She is the mother of Regan, the little girl who is possessed. I felt such sorrow for Chris, when she begs Father Karras to help her with Regan, I almost cried for her. Her daughter is not sick, this is nothing she can give Regan a pill and she'll be better. Her speech to Father Karras later on in the film: \"You show me Regan's double, same face, same voice, everything. And I'd know it wasn't Regan. I'd know in my gut. Now, I want you to tell me that you know for a fact that there's nothing wrong with my daughter, except in her mind. You tell me for a fact that an exorcism wouldn't do any good! You tell me that!\" sent shivers down my spine, this woman knows what Regan needs and will do whatever she can.We have Linda Blair who plays Regan and she was so great for a 12 year old actress. This little apple faced girl became one of the most frightening images of the 70's and still to this day. She's not scary because she's swearing, this little innocent girl has been taken over by forces that she shouldn't even know about. Jason Miller as Father Karras, for a man who had never acted professionally before, he was quite amazing as a priest who just lost his mother and his faith has been shaken up. Max Von Sydow as Father Merrin was so strong and he was like in his 20's playing a man in his 90's. He was robbed of an Oscar, he was so believable and just amazing during the exorcism scene.The effects? People! This was the 70's and they made a bed float! They turned this little angel's face into a hideous creature! If you watch the documentary \"Fear of God: The Making of the Exorcist\", Ellen Burstyn gets slapped by Regan in the film and she had kind of a rope tied around her waist. When the stunt man pulled her back, Billy the director told the guy to let her have it and he YANKED her back hard causing real pain in Ellen's back and that was an actual scream in the movie. They froze the room to the point as were moisture got into the set and there was a layer of snow in the morning they were shooting. There was no CGI, this was the real deal and I believe could truly help the actors. Linda Blair was being thrashed up and down during one of the possessed scenes where the bracing came loose and caused slamming of metal to her back repeatedly and her screams were also very real and bone chilling.William Freidkin is the director of The Exorcist, and there was no better choice. This guy took this picture seriously, so far as to shoot a gun offstage or scream obscenities to get an actor's shocked reaction on film. He slapped almost punched Reverend William O'Malley who played Father Dyer to get him to shake during his reciting the Last Rites to Father Karras. He almost would have killed to make this picture and anyone doing it.Weither or not the set of The Exorcist was truly cursed with a total of 9 deaths linked to the film, a fire on the set with no apparent reason, and the total feeling of evil around the room, we'll never know. But The Exorcist is a true motion picture never to missed or deserve no more than the true compliments it should get! This is the film that should be shown to any aspiring film makers. It's a masterpiece of a film that's more than a mere horror flick.10/10"
    },
    {
      "username": "clydestuff",
      "userUrl": "https://www.imdb.com/user/ur2286500",
      "reviewLink": "https://www.imdb.com/review/rw0129340",
      "warningSpoilers": false,
      "date": "20 July 2004",
      "rate": "10",
      "helpful": "489 out of 564 found this helpful.",
      "title": "The Devil Made Her Do It",
      "content": "In late 1973 and early 1974, women and men were lined up for blocks. People were known to become ill watching it. Some fainted. Some ran out of the theater in tears. There were reports of people having to be institutionalized, and at least one miscarriage was attributed to viewing it. No, it wasn't a Rolling Stones Concert. It was a film called The Exorcist.The first time I had heard of something called The Exorcist was on late night television when the author, William Peter Blatty, was a guest on The Tonight Show. The conversation centered around how horrible some of the things in the book were. I had also seen the novel listed on The New York Times Bestseller List, and it seemed as if it would remain there forever. After having been on the waiting list for what seemed like an eternity at the local library, I was finally able to obtain a copy. It was the first book I had read in one sitting since probably Nancy Drew and The Hidden Staircase quite a few years earlier. And yes, for it's time it was filled with gut wrenching details of what happens when for some unexplained reason; an innocent girl is possessed by Satan. While reading the book I was sure that if it ever made its way to film, most of the details would certainly be either `cleaned up' or omitted altogether. As you know the film was made and it spared the movie going public absolutely nothing in the way of details.Certainly many of the people who lined up to see The Exorcist did so to watch some of the more gruesome scenes, the worst of which involved Regan's masturbation with a crucifix. Yet, the hysteria went well beyond the fact that such scenes were so vividly depicted. I think one needs to look no further than Mel Gibson's The Passion to find the answer as to why. I'm sure most of you have read the story of people leaving Mel's film in tears, some to the point of being hysterical. From most articles I have read, it seems that the majority of the audience that was moved were those people of strong religious beliefs. For many others, the depiction of the brutality in The Passion may have been uncomfortable to sit through, but weren't emotionally effected to any degree. Much of this same feeling can explain the hysteria surrounding The Exorcist. Those who had a definitive belief in Heaven and Hell, of Good and Evil, of Jesus as The Savior and Satan as the epitome of pure evil were affected by The Exorcist far more than those who were agnostic or just never had a strong belief in spiritual matters. There is no doubt though that much in the way The Passion did, The Exorcist caused many to reconsider how they felt about their faith. The Exorcist made the prospect of Satan being alive and well and a life of eternal damnation a very uncomfortable prospect. The fact that Blatty claims his book and screenplay were based on a true story seemed to give the film even more credibility.For me, The Exorcist has always been more about the never ending conflict between pure evil and pure innocence than about being an average horror story. There are many more levels to this film than what initially meets the eye. There is no doubt that while the main story revolves around an innocent young girl, Regan McNeil (Linda Blair), being inhabited by Satan himself, Blatty enhances it greatly by adding different characters in various stages of conflict. Regan's mother, Chris McNeil (Ellen Burstyn) obviously cares deeply for her daughter. Yet she is not beyond reproach. In one scene when Reagan's father hasn't called on Regan's birthday, we see her desperately on the phone doing battle with an overseas operator. The problem is not how vicious the phone call is, but that she does it within ear shot of her daughter as if to drive the point home to Regan how worthless her father is. When, she finally does seek the aid of Father Damian Karras, we don't feel that she believes in exorcism anymore than he does, but is desperate enough to accept the fact that it is possible and will take any and all measures to save her daughter.Father Karras (Jason Miller) is a priest torn by conflict. He is ridden by overwhelming guilt for having abandoned his mother to enter the priesthood. He is torn spiritually by the confessions of those priests who seek his help as a psychiatrist, so much so that he now questions his own faith. When he states to the Bishop that `Regan's case meets all the criteria,' we know that even more than Chris, he doesn't really believe in the power of Satan to inhabit a living being in the manner that it has taken over Regan. Yet, he will do what is required of him as a priest concerned about the health of a child.Jack McGowran gives a terrific performance as the alcoholic director filming Chris's latest film in Georgetown. Kitty Winn is Sharon Spencer, the secretary who works for Chris and always seems to be in the line of fire when Chris is angry. She is always there but for all the horror she witnesses, Winn appears too bland and emotionless and her performance is probably the weakest in the film.Max Von Sydow as Father Lancester Merrin is a no nonsense aging priest. He has done battle with evil before and he shows us its effect in every scene he occupies. One could pass it off to being just good make-up but it is so much more than that as Sydow demonstrates all the nuances that brings to life a man who has faced Satan and lived to tell about it. He knows what he is up against, understands he must do it again and the consequences of what that battle may be.If I have a small complaint with The Exorcist it is in regards to the character of Lt. Kinderman (Lee J. Cobb). I have never been able to buy into the character. It is not the fault of Cobb who is his usual stalwart self in the role. The whole character should at best have only been necessary for a few brief scenes yet; he has several that go on way too long and do not add anything to the story. Even in his scenes with Chris or Damian, Kinderman is so odd that he distracts us too much from their characters and it is Chris and Damian's reactions that are more important to us, not his investigation. For all you trivia buffs out there, Blatty once sued the producers of Columbo, stating they based Peter Falk's character on Kinderman. If memory serves me correctly Blatty lost that one.As for Director William Friedken, although he won the best director award for The French Connection, for me The Exorcist will always remain his defining film. The Final half hour of The Exorcist are still as dynamic today as they were 31 years ago, French Connection car chase be damned.It seems that to many of the younger movie audiences of today, The Exorcist has become more of a joke than anything else. That's not surprising considering how many times it has been lampooned, even by Linda Blair herself in Repossessed. Yet, if they were to view the film in a more serious vein, not as just another creature feature, they may just find that there really is more to this film than a little girl spewing pea soup and spinning her head around 360 degrees. It is the ultimate battle between Heaven and Hell and Good and Evil. It is the story of the complete and total degradation of innocence. It is a study in character, and whether a man torn by the forces surrounding him, can regain his faith and his belief in God and mankind to save the life of a little girl, caught up in forces beyond her control.Call it a horror film, call it a religious film, call it what you want. For me, The Exorcist is and will always remain a classic in every sense of the word. And if I regard you as a classic of any kind I have no choice but to leave you with my grade, which for The Exorcist is an A."
    },
    {
      "username": "knersisman",
      "userUrl": "https://www.imdb.com/user/ur94119825",
      "reviewLink": "https://www.imdb.com/review/rw4410669",
      "warningSpoilers": false,
      "date": "21 October 2018",
      "rate": "8",
      "helpful": "77 out of 80 found this helpful.",
      "title": "The Exorcist",
      "content": "Stunning visuals, effects and overall horror for 1973. The characters are very strongly portrayed and the feeling of hopelessness is ever-present throughout the movie. Even though some scenes are outright shocking and provocative, there is also a strong element of the uncanny present. This is a very haunting movie that still shocks, amazes and intrigues after all these years."
    },
    {
      "username": "agro_sydney",
      "userUrl": "https://www.imdb.com/user/ur22878174",
      "reviewLink": "https://www.imdb.com/review/rw4272016",
      "warningSpoilers": false,
      "date": "6 August 2018",
      "rate": "10",
      "helpful": "51 out of 57 found this helpful.",
      "title": "Still A Masterpiece After 45 Years",
      "content": "I recently revisited this film on Blu-ray after some 45 years. It still rates as one of my favourite horror films, one of my top ten films and a masterpiece of film making. Beautiful photography, great locations, sets, special effects and acting. It still stands up as a great film today"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2502421",
      "warningSpoilers": false,
      "date": "13 October 2011",
      "rate": "10",
      "helpful": "32 out of 40 found this helpful.",
      "title": "One of the few movies to genuinely unsettle me",
      "content": "The horror genre is a genre that has been growing on me overtime, and I genuinely believe The Exorcist is a landmark of it. Not just how much it's talked about or parodied, but also its ability to unnerve and unsettle me even years later. The Exorcist is a fantastic film, both as a film of its genre and of film full-stop. The effects are superb and have held up very well, and the sound is marvellous and adds to the many startling moments. The cinematography and scenery are also incredibly well done. The macabre, obscene demonstrations of manifest evil on display still startle even now, while William Friedkin's direction is one of his best and most intelligent of his career, not just making the scares genuine but also combining these with allegorical religious subtleties. The performances also lift, Linda Blair is really quite startling, and you couldn't have had more perfect support from Max Von Sydow and Ellen Burstyn. Overall, genuinely unsettling and effective. 10/10 Bethany Cox"
    },
    {
      "username": "NpMoviez",
      "userUrl": "https://www.imdb.com/user/ur69508929",
      "reviewLink": "https://www.imdb.com/review/rw5051192",
      "warningSpoilers": false,
      "date": "10 August 2019",
      "rate": "10",
      "helpful": "81 out of 95 found this helpful.",
      "title": "One of the greatest ever!!",
      "content": "Some movies are landmarks. This is one of them.Good : There are a lot of goods that I can talk about this particular film. First off, every gothic horror, for example, The Conjuring, are inspired by this film in one way or the other. But, none of them are as good as this one. I love Conjuring 1 & 2, but that might have never existed if it weren't for this movie. So, what makes it so good? We are given a mysterious introduction to an old priest who would play a prominent role later. It gives layers to the character of young priest, which is quite interesting. The set up is done quite well. The story is being told quite well. And it has the most important aspect that most horror films today lack - the dread and actually terrifying scenes. Right from the opening credits, it feels uneasy. It tries to give us a really terrifying vibe. And it just intensifies further and further. Even the scenes having no tension don't feel like so. And, it cuts to some terrifying scenes so suddenly but smoothly that we will be exclaiming \"holy (you know what)!\". That's some true horror film. It was 1973. You had absolutely no technology or CGI. They still made an entire bed shake which looked so scary and realistic! The 180 degree turn is still an awesome effect. They did it way better, and all of it looked more realistic than CGI! It had some ideas involving Ouija board and exorcism, which are now termed as \"clichés\". Having watched so many horror films before watching this, it should've felt corny. But it felt real good. There is probably no horror movie, in particular a supernatural or gothic horror movie, that has not been inspired by this movie in some way or the other. And the ones which got as many things right as possible as in this one, were respectively better. This movie is a masterpiece!!Bad : It has sequels. Damn those pathetic sequels!! But again, good God almighty, only few people know about those stupid movies.Conclusion : It is a must watch for every horror fan. Some parts may feel clichéd to some, but that's where those \"clichés\" started. Go with a fresh mind and examine how it all started. I am optimistic that you will love it.Rating.Score : absolute 10/10Grade : A+"
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw1832281",
      "warningSpoilers": false,
      "date": "3 March 2008",
      "rate": "8",
      "helpful": "33 out of 43 found this helpful.",
      "title": "Suspense , mystery , shocks and grisly horror is this classic terror film",
      "content": "This known story concerns about a mother (Ellen Burstyn) and her daughter (Linda Blair), the latter is possessed and two Fathers , Karras (Jason Miller) and Merrin (Max Von Sidow) attempt to free Regan MacNeil from possession by the devil . Meanwhile , a Police Inspector (Lee J. Cobb) is investigating the weird events . And the priests suffering incredible risks trying to unravel mystery of demon living inside Regan .This is a fairly suspenseful and horrifying story, based on a supposedly true flick . The movie begins well and grows more and more until the scary and eerie finale . Top-notch picture, thanks to fine acting , tight pacing , well mounted edition and skillful special effects with magnificent make-up by Dick Smith . Creepy acting by Linda Blair , due to death threats against Linda Blair from religious zealots who believed the film \"glorified Satan\", Warner Bros had bodyguards protecting her for six months after the film's release . On the first day of filming the exorcism sequence, Linda Blair's delivery of her foul-mouthed dialogue so disturbed the gentlemanly Max Von Sydow that he actually forgot his lines . The script is awesome , the acting excellent and the direction by William Friedkin plenty of good pace and conviction . Enjoyable secondary cast such as Lee J Cobb , Kitty Winn and Jack McGowran who died at the time finished the movie and added a legend about Exorcist's curse . Dark cinematography in sinister and mysterious atmosphere by Owen Roitzman and frightening musical score adding Mike Oldfield's soundtrack ¨Tubular bells¨ . The tale is rated ¨R¨ for graphic violence and profanity but contains gore and guts . Reiussed in 2000 by means of a special edition by director with ten minutes approximately additional footage with new amazing scenes as Regan downing stairs .Followed by two sequels and numerous imitations , in 1977 ¨the Heretic¨ by John Borman with Richard Burton , deemed awful and in 1990 titled ¨The Exorcist III¨ by William Peter Blatty with George C Scott, Brad Dourif , Ed Flanders and Nicol Williamson . Furthermore, spawned two prequels starred by a young Father Merrin , Stellan Skarsgard , and set in Africa , both of them directed by Paul Schrader and Renny Harlin ."
    },
    {
      "username": "Collins",
      "userUrl": "https://www.imdb.com/user/ur0176175",
      "reviewLink": "https://www.imdb.com/review/rw0129069",
      "warningSpoilers": false,
      "date": "6 December 1998",
      "rate": "10",
      "helpful": "302 out of 380 found this helpful.",
      "title": "THE EXORCIST---A PERFECT FILM",
      "content": "Many people complain that this movie's too slow but those are the kind of folks who only like 80-minute splatter films with characters so dumb and one-sided, you pray for the bad guy to kill them. This monster of a drama is both beautiful and bold. It has CHARACTERS and not simply LAMEBRAINS lined up for slaughter. It has class and purpose. It takes the audience into the darkest recesses of humankind and then brings them back through a message of hope and self-sacrifice. The movie is NOT anti-religion, it's anti-evil. Anyone who likes smart, clever, meaningful horror-drama should see this film at least twice. It is surprisingly touching and amazingly powerful.That said, the cast deserves a hand for their wonderful performances. Ellen Burstyn perfectly conveys the tension of a mother of the cusp of tragedy; Max von Sydow is hauntingly perfect as the story's ray of light; Jason Miller embodies the sadness of a defeated man; and Linda Blair is far above average even at her young age.Once again, see this movie. You won't forget it."
    },
    {
      "username": "jadavix",
      "userUrl": "https://www.imdb.com/user/ur55157303",
      "reviewLink": "https://www.imdb.com/review/rw3422061",
      "warningSpoilers": true,
      "date": "26 February 2016",
      "rate": "10",
      "helpful": "17 out of 21 found this helpful.",
      "title": "Still shocking, all these years later",
      "content": "This one has lost none of its power to shock or terrify.You've heard of the head spinning round, the green vomit, probably even the crucifix masturbation scene.That doesn't prepare you.It's not the material itself that makes it so shocking, although, over forty years later, even the language retains an edge. I've still never heard that variation of the c-word in any other movie, I don't think. It's the direction, which always takes you by surprise, which lulls you into a state of security it punctures again and again until finally letting the horror take over like a bad dream you can't wake up from.It's the screenplay, too. This is a movie about people. About people suffering an unspeakable trauma. About people driven to the edge where the supernatural meets them.It's not about special effects or shocking violence.The characters live and breathe, you feel what they feel, even the disbelief.The Exorcist carries you along. It takes you to places you don't want to go, working its magic in ways you can never fully understand.And it remains shocking and terrifying."
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw2405042",
      "warningSpoilers": false,
      "date": "27 March 2011",
      "rate": "10",
      "helpful": "21 out of 28 found this helpful.",
      "title": "Simply, the greatest \"Horror\" film ever made ...",
      "content": "What scares us more than anything? The answers are multiple : the dark, the evil, a mysterious presence, death ultimately; in fact, anything incontrollable. And when you think about it, all these elements have something in common: they refer to an unknown force whose presence is palpable. Indeed, the unknown scares, because it can't be seen, can't be controlled, therefore, can't be fought.These are the primitives fears that tortured the life of people since the dawn of humanity, and we inherited this fears in the same unconscious way our children will. We're aware of our mortal nature, and each of our fears is driven by this awareness, which is due to the biggest fear, the fear of the unknown. And the genius of \"The Exorcist\" is that it perfectly plays on these primitive instincts of ours, to provide the greatest Horror film ever made, a thrilling masterpiece of realism that'll haunt cinematic memories for ever. As soon as the Tubular bells start ringing, the film is inhabited by an atmosphere that will never desert it, a fearsome and gloomy ambiance absorbing any place we're watching the film in. Everything is directed with such confidence and meticulousness, the thrills almost come precociously. Indeed, before anything happens, we feel something WILL happen, but we don't know what. It seems like a cinematic trick, but not any director has the guts to let you wait more than almost half an hour before the oddities happen. The set-up is slow paced in \"The Exorcist\" because it's a movie that respects our intelligence, and doesn't try to provide cheap thrills. William Friedkin who had just made another realistic masterpiece, the Best Picture Winner \"The French Connection\" is so confident he gives us enough time to discover the characters, to get into their daily life, patiently waiting for the pivotal point that will join their fates. The direction, the writing are all in subtlety, and work because even though nothing happens yet, we keep our guard up, we know there's an evil presence somewhere, we can feel it.This is an old cinematic device started by directors who hadn't enough money to portray credible monster-type villains: they understood that sometimes, the scare is more efficient from the suggestion of a presence than its explicit depiction. When you see, you know, and if you know, you can control, but in \"The Exorcist\", the villain is here, but we never see him, he's like the shark from \"Jaws\" or \"Alien\", with a slight difference, he's not visible because he controls the body of a poor little girl. Linda Blair, as the demonically possessed Regan MacNeil , is so convincing, it broke my heart to see how the evil can have so devastating effects on a pure little soul. And the tragedy of Regan is the torment of her mother, Chris, Ellen Burstyn, perfect as a totally helpless woman, incapable of saving her little girl. And this is the fascinating aspect of the film, more than a horror drama, it also works as a thrilling mystery. A mystery where the Lieutenant Detective Kinderman, Lee J. Cobb in one of his great last roles, is the one who investigates about the strange phenomena that occurred and acts as a bridge between the victims and the priests.So many questions are raised in the beginning, we understand that sooner or later, we'll have an exorcism. Well, it's the title, isn't it? But the set-up is necessary. The parallel stories where we're transported into the universes of Father Damien Karras, portrayed by Jason Miller, and the iconic Father Merryl, Max Von Sydow, challenge our patience: we can't wait for the exorcism ... but without the build-up, the climax would be worthless. It's a movie where any flaws can be caused by an impatience from the director, an eagerness to distract the masses with thrilling moments, but a big impatience could have ruined such a magnificent and ambitious project. And \"The Exorcist\" would never have been the masterpiece it is without this patience. However, this would never have been such an iconic horror masterpiece without the few horrifying moments that punctuate the movie between the set-up and the climax. And by horrifying, I won't give any clues, let's just say it works on every level: visual, sounds, atmosphere, cinematography, dialogs, special effects, and of course, timing, since all these effects come at the least expected moments, provoking reactions in total symbiosis with the characters. We feel and fear for them, as the realism implies that it could even happen to us. This is no Hollywood, this is true horror.Lately, the American Film institute listed the Top 100 movies and I must admit I was shocked not to see \"The Exorcist\" in the list... it's a classic, probably the most horrifying horror film ever made. It has everything, a dazzling cinematography incarnated by the iconic shot of Father Merryl's shadowy silhouette coming from the mist, an unforgettable villain, and of course shocking moments where the make-up, the visual and sound effects prove how vital they are for such a genre that relies so much on realism. But this realism would have been nothing without the genius of the script and the masterful direction, that could finally let the film exude all its greatness in the last act, one of the most unforgettable climactic sequences ever, putting \"The Exorcist\" among those films that transcends the simple act of watching, becoming more of experiences.And this is why I waited for years and years before finally getting to watch \"The Exorcist\", one of the few movies that scared me even before watching it. And all I can say is that it met my expectations. And watching it at night (with someone, I would recommend) gets more hypnotic and absorbing after each viewing \"The Exorcist\" is a must-see and ... be careful, any second, it can surprise you, really"
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw1509364",
      "warningSpoilers": true,
      "date": "29 October 2006",
      "rate": "10",
      "helpful": "20 out of 27 found this helpful.",
      "title": "\"You're telling me I should take my daughter to a witch doctor, is that it?\"",
      "content": "When I reflect back on the movies of the 1970's, I'm struck by how many of them helped reinvigorate their respective genres. There was \"Star Wars\" for fantasy, \"Alien\" for sci-fi, and \"Jaws\" for the shark crowd, though I don't think that's really a genre. For horror fans, \"The Exorcist\" was the one that had everyone talking in 1973, and not only talking, but lining up around the block to get a chance to see it. In fact, the first time I tried, the person directly in front of me in line was the last one allowed in for that showing.When I finally did get to see it, the experience left a marked impression. It was fascinating, horrific, sensational and scary all at the same time. Having read the book, I wondered how much liberty would be taken with the story, but it was pretty much all there. At the time, hands down, it was the most frightening film I'd ever seen.The movie played last night as part of AMC's Halloween Fest, and though largely sanitized for TV, the impact of the film is still alive and well. It's a movie that plants a nagging seed of doubt in one's mind - what would happen if Satan himself could take over the body and soul of an innocent young girl? The gradual unfolding of the parallel stories in \"The Exorcist\" are built on credible real life situations, so that by the time Linda Blair's demon face appears on screen, you're ready to grab the holy water and say a prayer.Now if you're a younger viewer born of a more recent era, I'll grant that the film might not have the same effect. Though Blair's possession makeup was visually stunning at the time, special effects since then have far surpassed that effort. But it had to start somewhere, and as a precursor to virtually everything that followed, this was the one to top. And when Regan's head spins, yikes!, but I thought mine would too. For 1973, that was an incredible piece of work, with visuals that stay with you long after the film is over."
    },
    {
      "username": "rocknroll8484",
      "userUrl": "https://www.imdb.com/user/ur44463089",
      "reviewLink": "https://www.imdb.com/review/rw5918445",
      "warningSpoilers": false,
      "date": "19 July 2020",
      "rate": "10",
      "helpful": "59 out of 65 found this helpful.",
      "title": "Deserves to be on IMDb Top 250!!!",
      "content": "I'm not sure why this film isn't on IMBb's Top 250 anymore but it deserves to be in at least the top 50 on the list. Maybe it's because millennials rate such beautiful classics lower since they're not getting the jump scares and torture porn of the modern era of horror... Not sure. Either way, this movie is THE horror film, the Godfather of it's genre! Absolute perfection! And it needs to be recognized as such!"
    },
    {
      "username": "CihanVercan",
      "userUrl": "https://www.imdb.com/user/ur19658928",
      "reviewLink": "https://www.imdb.com/review/rw2180326",
      "warningSpoilers": false,
      "date": "25 December 2009",
      "rate": "9",
      "helpful": "51 out of 70 found this helpful.",
      "title": "One Genre Renewal movie: The Exorcist - Horror with no Crime, instead Horror with Spirits",
      "content": "Two terrible sequels and one irrelevant remake were never replaced with the original, the 1973 version of The Exorcist; and no other version will never be any more. Written for the screen and produced by William Peter Blatty, both The Exorcist movie and the novel are incident driven basis of the actual happenings from 1949.Looking at the most remarkable movies of 1973, there are 3 other important ones that the history of cinema will remember: -- A slow and touching movie from Ingmar Bergman \"Cries and Whispers\" -- Bernardo Bertolucci's depressive movie, a study of love \"Last Tango in Paris\" -- A crime story with Redford and Newman \"The Sting\". Among all and all the other movies that are produced in this year, The Exorcist stands one step further than the rest for its uniqueness on genre renewal. It's not the first movie that features the Demon in its content, yet in the Exorcist the Demon is introduced in the human level. The idea of being possessed by a spirit is used for the first time ever on the silver-screen. Horror genre featuring spirits didn't need to refer to Crime any more like it used to be in Hitchcock ages. Thus crime became a separate genre, and mostly acted conjointly with thrillers from now on.This uniqueness profits from its sound mixing, great lighting techniques and of course a perfect screenplay. Director William Friedkin was lucky to find his producer Blatty, being also the novel-writer and the idea creator. The plot and the story development goes very smoothly: From Father Merrin's encountering with the Demon Pazuzu in Iraq; to Ellen Burstyn looking for the cure for her daughter's disease, going for visits to every type of doctor... From the noises in the attic, to Regan's peeing on the rug... From decoding the Demon's speech of speaking English in reverse, to the arriving of Merrin... Both the editing and directing gave high qualities to this film.The 25th Anniversary edition DVD is in my movie collections. It's a must to have for horror fans. Either you have this version of DVD or the year 2000 version; you should check out the special features that reveals the real-life 1949 incident, the missing and the deleted scenes including the Spider-walk scene, sound mixing and sound effects tests show how they created the demon's voice and the BBC documentary: The Fear of God, all in the special features."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw4939392",
      "warningSpoilers": false,
      "date": "16 June 2019",
      "rate": "10",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Possessive mastery - Verdict 10 out of 10",
      "content": "Among the most authentic horror ever made with shockingly well done practical effects! Best of everything, Regan (Linda Blair) and Damien Karres (Jason Miller) were so damn good! Nothing to judge about this incredible film, it's better than hundreds of horrors out there especially possession wise it's spot on with grossness and very disturbing satanic aspects. Christians wouldn't be happy to watch this lol."
    },
    {
      "username": "pheonix19",
      "userUrl": "https://www.imdb.com/user/ur0660441",
      "reviewLink": "https://www.imdb.com/review/rw0128797",
      "warningSpoilers": false,
      "date": "28 March 2000",
      "rate": "10",
      "helpful": "296 out of 355 found this helpful.",
      "title": "Unmatched brilliance",
      "content": "There is a reason for the hysteria and mystique surrounding THE EXORCIST. And it's called genius.Never have I seen a film matched in shock, terror, writing, or performances. This isn't a horror movie. The film itself is both a moving and terrifying drama that takes a realistic look at what would actually happen if a young girl were possessed in modern America. William Peter Blatty's script is amazing, bringing depth to the characters, and presenting the mystery of faith that they all deal with. Is Regan possessed? Is she insane? And most importantly, Is there a God? In the course of two hours, we see a sweet and innocent young girl become a cross masturbating, head spinning, murderous, creature. We see a successful actress overcome skepticism to save her daughter, and we see a brilliant psychiatrist struggle with his devotion to God as a priest.Friedkin's direction is marvelous, with wonderful uses of light, dark, and color throughout the film. Jason Miller (as Damien Karras) is beautifully subtle in his first film acting role. Max Von Sydow and Lee J. Cobb provide engaging supporting performances as the experienced priest who senses his impending doom, and a detective who senses something sinister is at work. Ellen Burstyn gives a brutally honest performance as a grief stricken woman trying to save her daughter. And most of all, a 12-year-old Linda Blair gives one of the most terrifying, convincing, and beautiful performances ever shown on film. Her range of emotion and connection to Regan are astonishing. She deserved that Oscar!THE EXORCIST presents to us the mystery of faith in it's most raw form--the battle of good and evil. It is an incomparable masterpiece of film, done without the aid of computers and special effects. It relies on story and performances to give us a marvelous and terrifying piece of work. In the end, it makes us ask ourselves what we believe, and keeps us wondering and shuddering at exactally what might be out there."
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw6184036",
      "warningSpoilers": false,
      "date": "17 October 2020",
      "rate": "7",
      "helpful": "15 out of 21 found this helpful.",
      "title": "It just doesn't scare me anymore...",
      "content": "... and it was pretty scary when I saw it in 1974. Maybe the horror has shifted somewhat for me. In 1974 I was 16 and I was sheltered from the horror of real life. So horror films were the only thing that probably could scare me.Today it plays like a very good drama, and what scares me the most is being put in Ellen Burstyn's place as the mother and not having a clue as to what is going on with her daughter and the patronizing doctors with their useless and apparently painful tests. Also the parallel drama of Father Karras having a crisis of faith and of conscience over the death of his mother is well done and well played as part of the larger story.There is a great supporting cast with old veteran Lee J. Cobb as the cop. But there are some holes in the plot. I mean, what does Cobb think is going on anyways? Does he think a girl that sick can push a man out of a window? He's like a noir character in search of a villain. And, at least in the film, there is never a connection made between a girl in Georgetown, Washington D.C. suddenly becoming possessed and digging up an artifact in a foreign land. I haven't read the book, maybe there the connection is made. And what is going on with leaving a window open at night in Washington,D.C. As somebody who lives near there, I can tell you if you do this, something much scarier than a demon is coming in through that window! This is the big city, not Mayberry!Some production notes: Linda Blair was in fact 15 when this movie was made, not 12. The radiology technician in the hospital scene was a legitimate active serial killer at the time of filming. Max Von Sydow was only 44 at the time of filming, not a very old man. It's odd how he has always and convincingly played men much older than himself. The \"spider walk\" scene was added back into the film years later. I have no idea why they elected to take that out of the original release. It's a sledgehammer to the face. On second thought, maybe that is the reason they took it out."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3501502",
      "warningSpoilers": true,
      "date": "9 July 2016",
      "rate": "10",
      "helpful": "13 out of 18 found this helpful.",
      "title": "One of the few films to actually have sickened me",
      "content": "Well, I couldn't miss the opportunity to see this horror classic in the cinema, or I'd have to wait another 25 years till the 50th anniversary. So I went along to the cinema, where it was playing in an original version (none of this remastered malarkey, I'll thank you very much). And suffice to say, I was impressed. Very impressed. In fact the film lived up to all expectations I had of it.From the opening prologue set in Iraq, we know something's wrong. There's a sense of dread in the air as we all know what's coming. However, it takes a long time for the possession to actually occur, which may be surprising to some, but it instead concentrates on characterisation, which is a strength and makes THE EXORCIST stand out from other run-of-the-mill stalk and slash affairs. Jason Miller's character is the most thoroughly explored, and all of the normal everyday situations shown simply make the demonic events even more horrific when they occur. The Tubular Bells music is great too, and brings chills with it.Once they occur, they do not disappoint. Regan's actions are still suitably graphic, even by today's standards (the crucifix scene for example). However her obscenities tended to provoke laughter rather than fear, such language is sadly common in this day and age. Things build to the great climax and, I feel, one of the greatest moments in cinema, that is when Karras confronts the evil. Excellent.The special effects still stand up, despite being a bit creaky. Still, they're much better than the CGI nonsense used by blockbusters today. THE EXORCIST remains a remarkably intelligent exercise in horror, and everybody has to see it to see what all the hype is about. While I wasn't scared by the film, it did actually make me feel quite sick and disturbed, so perhaps there was something really evil about it after all. Then again it's only a movie, so we can but wonder. THE EXORCIST is a great film, not easy or enjoyable viewing but extremely horrific and effective. See it and see what everyone's talking about."
    },
    {
      "username": "mjw2305",
      "userUrl": "https://www.imdb.com/user/ur3174947",
      "reviewLink": "https://www.imdb.com/review/rw1011080",
      "warningSpoilers": false,
      "date": "31 January 2005",
      "rate": "8",
      "helpful": "15 out of 20 found this helpful.",
      "title": "A Horror Classic",
      "content": "This is a very highly rated horror movie for a good reason, when it was realised it broke the mould of everything that preceded it, and set the standard for the horror genre for decades to come; because of this it should retain its place Movie history forever.The sheer terror this movie instilled in people, during the year of its release is even today unmatched by anything. Time, however has altered its effect on its audience, we simply are not as easily shocked as we used to be.For anyone who hasn't seen this movie yet, my advice is this, approach it with an open mind, and remember when it was made, this is the only way you will appreciate it for what it is.Difficult for new audiences to appreciate, but it is still a classic, time won't change that.8/10"
    },
    {
      "username": "baumer",
      "userUrl": "https://www.imdb.com/user/ur0355122",
      "reviewLink": "https://www.imdb.com/review/rw0129152",
      "warningSpoilers": false,
      "date": "25 August 1999",
      "rate": "6",
      "helpful": "55 out of 87 found this helpful.",
      "title": "I almost feel ashamed for not liking this film",
      "content": "There is a very frustrating scene from Jaws 2 where Brody walks into the selectsmen's meeting carrying the photograph that the two divers took as they were being eaten. Brody sees the outline of the mouth and the eye. And he should know what a shark looks like. But when he passes it around, Harry saysSeaweed?\" Verna Fields says, \"it's under water isn't it? That's why it's so dark?\" They can't see something that is so obviously and that is bothersome. That is how I feel about my reaction to the Exorcist. Everyone has told me how frightening it is and how it is a psychological trip. And I know the reaction that audiences had towards it in the 70's. But as much as I try, I just can't see it. It is not a scary movie and it is not even an enjoyable one, and I would even go so far as to say that it is not even a good movie.First off, there are so many parts of this film that have nothing to do with what the film is about. The first hour is nothing. It really has no relevance to the rest of the film. And for the life of me I really can't understand what the beginning is about. Why do we need the background of the Exorcist in Iraq? What does that have to do with the film and how does it further the plot? I don't get it.Secondly, this is a very poorly editted film. There were times that I cringed at some of the editting. It was such a blatant cut that you felt like you could see the editors crazy gluing the film together. And I am not saying that to be cruel, I really mean that.Thirdly, and this is the big one, what is so scary about this film? Really, all Regan did was get her face scarred a bit, vomit a lot, yell out obsenities and blugeon herself with a cross. Now that is interesting in the fact that this must have sent a shock wave through the religious community because you are not supposed to say or do anything bad towards the church. But in terms of scares or chills? No way, they just weren't there. I can admire a film like Halloween and Blair Witch for being innovative enough to scare us but no this film. Frankly, I was bored. I really was. There were times that I wanted to turn this off and watch the baseball game, and we all know how boring baseball is on the tube. But this film moved at a snails pace. And if they would have cut it down by about thirty minutes, it may have been better.The other element that I can't get past is the fact that this was the devil himself. Okay, let's just say it is. Why does it allow himself to be tied down? Why does it jump at water that isn't holy? Why does it possess a girl when it can come onto this Earth in human form if it wanted to. When Lucifer was kicked out of Heaven, he was abolished because of greed and a lust for power. So for an angel to be that despised must have been considered dangerous and powerful. If that is so, then why all the scenes of Satan being dominated by humans? Are you saying that the best he could come up with is making a girl puke, levitate, and throw a few things around the room? That sounds more like he was just having a bad day because he couldn't get his own way. That doesn't sound like the personification of evil. You want to see real evil, watch DeNiro in Angel Heart.The Exorcist is a film that has it's place in history and I can admire it for that. And to be honest I almost feel like someone that doesn't like The Blair Witch Project. I can't understand why people can't like that film, that is true fear for me. So when I say that this film is really not that good, I can understand why people may think I'm ignorant, but when you compare this to A Nightmare On Elm Street or Halloween, can you honestly say that this has more to offer? And if you can say that, well, I just don't see it."
    },
    {
      "username": "anaconda-40658",
      "userUrl": "https://www.imdb.com/user/ur60028700",
      "reviewLink": "https://www.imdb.com/review/rw3273433",
      "warningSpoilers": true,
      "date": "9 July 2015",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Blair Gets Exorcised!",
      "content": "The Exorcist (1973): Dir: William Friedkin / Cast: Ellen Burstyn, Linda Blair, Jason Miller, Max Von Sydow, Lee J. Cobb: Terrifying masterpiece based on the book by William Peter Blatty. There are many Biblical accounts where Jesus himself drove demons out of people, so an exorcist is obviously someone who rids what doesn't belong. Ellen Burstyn stars as an actress whose daughter is possessed by demonic forces. After the shocking image of her daughter screaming atop a shaking bed, she seeks professional help. When doctors fail in finding answers it is suggested that a Priest see the girl. Intelligent, shocking with a sense of insight where Burstyn asks the right questions regarding exorcism. Quite an accomplishment for director William Friedkin who previously made another masterpiece in The French Connection. Burstyn brilliantly mirrors frustration mixed with fear. Linda Blair is both sympathetic and commanding as the possessed victim. Jason Miller plays a troubled Priest whom questions his faith after his mother's death. Lee J. Cobb steals moments as a police inspector. Then there is Max Von Sydow is compelling as the exorcist who sensed the demonic force in the film's opening and ultimately understands the standoff he will eventually face. A masterpiece in horror with excellent makeup and spellbinding measures of faith. Score: 10 / 10"
    },
    {
      "username": "Rodrigo_Amaro",
      "userUrl": "https://www.imdb.com/user/ur20748638",
      "reviewLink": "https://www.imdb.com/review/rw2254520",
      "warningSpoilers": true,
      "date": "24 May 2010",
      "rate": "10",
      "helpful": "11 out of 15 found this helpful.",
      "title": "The Power of The Exorcist Compels You To Watch it!",
      "content": "Almost 40 years has passed since \"The Exorcist\" was released and it still is a haunting, exciting, thrilling and frightening horror movie. Lists after lists are made to elect the best horror movie of all time and this film always manage to get to the Top of almost every single list. Not only that: it's also an very complex dramatic film with a compelling story. A story of a devoted mother to save her teen daughter of a strange possession.After finishing the filming of a movie the actress Chris McNeil (Ellen Burstyn) finds herself with an awkward situation after her adorable daughter Regan (Linda Blair) starts to behave differently. She is taken to all the best doctors but nothing is found and doctors suspicion is that the kid may have a brain tumor. But after all the medical treatment fails and when Regan's starts to move frantically Chris is told to get a bigger help: a priest to exorcise what possessed her daughter. Father Karras (Jason Miller, incredible acting in his film debut) is called, but he himself is a tormented man, who has recently loss his elderly mother, almost faithless and with few skills to perform an exorcism. Even with all that he agrees to see the girl who has increasingly gone worst. She vomits, masturbates with a crucifix and says countless bad words and profanation. Karras's verdict: she's possessed by Pazuzu, a mysterious and powerful demon. But this demon has a weakness and this weakness is Father Merrin (Max Von Sydow in a very aged makeup), or better saying The Exorcist. Father Merrin knows everything about exorcisms and demons and he knows how to fight it. Even with all this knowledge (as it is showed in the beginning of the movie when he's in Iraq investigating an occurrence) you can feel that he has some fears, (his hands shaking) but he'll do everything to kill the demon and save the poor girl. The last 40 minutes with Karras and Merrin together performing the exorcism in that freezing and haunting bedroom is priceless, scary and the best horror moment of the 1970's. I must salute director William Friedkin for his efforts on present us a movie greater in its genre different of everything seen before. He was mean with actors to create realism but he get what he wanted and the audience was terrified by those images (Ellen Burstyn's face when she was thrown to the floor; Jason Miller's face after the vomit comes right into his face which wasn't supposed to happen). On the technical side of \"The Exorcist\" an interesting thing must be noticed: all the horror moments are shown without music. This works really great, it's not a manipulated movie where a soundtrack must be added to create tension. And without the music it was much more scarier and fun to watch, listening to all the strange sounds created by the sound group (Won Oscar). Makeup effects and visual effects are stunning and many of it it's not dated or old-fashioned. Impressive! About the screenplay: William Peter Blatty writer of the original book and the film's writer created a whole new thing here. The drama, the horror and even some humor are perfect. Although I think that some scenes, characters and clues aren't well explained, there's too much mystery. For example, we heard that the film director (Jack McGowran) died on the long stairs. This scene isn't showed and if it was it would be too frightening and unforgettable. After that the movie lover detective Kinderman (Lee J. Cobb, very good and funny) starts a investigation about the event. Then he gets some clues about many things he didn't even saw. The public may wonder how did he get to that evidence or clue. Two moments I would like to see or questions to be answered: Who puts the crucifix under Regan's bed? And what happened to Father Merrin in that bedroom after he leaves Karras and exorcise the girl alone? Not only the technical team worked well. All the actors have fantastic performances: Burstyn, Cobb, Miller, Sydow, Blair, even not professional actor the Reverend William O'Malley has a great performance here, and at last Mercedes McCambridge who plays the devil's voice (one thing I hated in the Portuguese dubbing version is that her voice was made by a man). Even being the biggest blockbuster of 1973 it only won 2 Academy Awards (Adapted Screenplay and Sound), and it deserved the award of Best Picture cause it was greater than \"The Sting\". And it must get a higher rating on IMDb's Top 250 list. This movie is awesome, one of the very few horror movies to still shock me, to not be dated or cheesy. If you haven't watched yet or didn't find time to watch it run and buy it if you can. The power of this film compels you to watch it now and over again. Must see film for horror fans and for movie lovers just like Lt. Kinderman. 10/10"
    },
    {
      "username": "somesunnyday",
      "userUrl": "https://www.imdb.com/user/ur4216884",
      "reviewLink": "https://www.imdb.com/review/rw1082429",
      "warningSpoilers": false,
      "date": "17 May 2005",
      "rate": "10",
      "helpful": "139 out of 182 found this helpful.",
      "title": "They don't make em like they used to...",
      "content": "\"The scariest movie of all time\". Some movie goers agree and some disagree. I belong to the former group, though I would like to rephrase it to \"One of the scariest movies of all time\". For those of you who have been living in a cave for the past twenty two years, the story is of a pre-pubescent girl, Regan (Linda Blair), possessed by a demon whom purports to be the Devil himself (\"Now kindly undo these straps!\").In this day and age of schlock fest horror films being relentlessly released (or spewed out for want of a better term) by the big wig studios on a quest to cash in on the latest teenage trend, this premise for a horror story may not seem so scary to most. However, it's the road we take to arrive at this supposition that makes this film stand out from the rest.The seeds of dread and fear are planted early with screen legend Max Von Sydow's Father Merrin receiving disturbing and familiar Omens of what is to come during an archaeological dig in Northern Iraq.We're then taken to the setting where the real horror will begin in the Georgetown home of Chris MacNeil (Ellen Burstyn), a successful divorcée film actress living with her daughter Regan. We're initially presented with a Regan who loves horses, has a close and loving relationship with her mother, is uncomfortable with the strained relationship between her parents and has the innocent demeanour and narrow vocabulary of every normal young girl.The carefully crafted and ever so gradual change in Regan's personality, the strange drawings and figurines she creates, the emergence of Captain Howdy (Regan's imaginary friend) and strange outbursts (\"You're gonna die up there\") and so called physical convulsions force Chris to turn to doctors and eventually psychiatrists to try and get to the bottom of Regan's ever worsening behaviour. Her vocabulary becomes quite extensive with spine chilling, sudden maturity and her outbursts more terrifyingly violent. After exhausting all the \"somatic\" possibilities for Regan's troubles Chris desperately seeks help from world weary Jesuit Psychiatrist Priest Father Karras (Jason Miller) requesting an exorcism.By the time Karras meets Regan, any semblance of the innocent young girl has completely vanished. Karras is grappling with his faith and subsequently doubts she is truly 'possessed'. Finally convinced that an exorcism is the way to go, he seeks permission from the Catholic Church, who grant him with the condition that he perform it with the help of the experienced Father Merrin.Merrin arrives like a knight in shining armour for the ultimate showdown! A great screenplay by William Peter Blatty (based on his book), intelligent directing from William Friedken and outstanding performances from all the cast, particularly Ellen Burstyn as the traumatised mother make for a classic piece of horror that will stand the test of time. 10/10"
    },
    {
      "username": "eric262003",
      "userUrl": "https://www.imdb.com/user/ur12327230",
      "reviewLink": "https://www.imdb.com/review/rw8647030",
      "warningSpoilers": true,
      "date": "31 October 2022",
      "rate": "9",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Still Disturbing and Provocative Nearly 50 Years Later",
      "content": "It has almost 50 years since \"the greatest horror film ever made\", \"The Exorsist\" is still one of the most disturbing, grotesque, but provocative horrors that was ever made and that the shock value still linger on to this day. Although there are quite a few subplots involving several conflicted characters, there is still a connection to the primary focus of the movie and that everything comes together for the grand climax at the end of the movie.\"The Exorcist\" focuses primarily on a young pre-teen girl named Regan MacNeil (Linda Blair) who lives in single parent household in Washington D. C. with her mother, Chris (Ellen Burstyn) who is acting in movie located at Georgetown. Starange things have been happening to her, from erratic behaviour, unsual superhuman strength, swearing quite frequently and bizarre traits like speaking Latin and turning her head at 180 angles. Chris turns to top doctors and therapists to see if they can find a cure for her unhinged behaviour, but her madness is beyond repairable even to the world of science and medicine. It is later revealed that Regan is no posssessed by Pazuzu, a demonic creature that was integral in Mesapotamian folklore. Fearing for the worst, Chris who's not completely deeply religious, turns towards Catholic priests to perform the ancient art of exorcism in order to save her daughter before it is too late. Father Lankester Merrin (Max Von Sydow) who has been in the past been digging for ancient artifacts in Iraq, who is an expert in the art of exorcism is sent to the task in spite of his advanced age and his declining health caused by heart failure. Under his assistence is Father Damien Karras (Jason Miller), who's also a licensed psychiatrist, who's lost faith in himself feeling responsible for his mother's death, assists him to vanquish the demon from her soul and bring her back to the innocent child she once was. This movie is saturated with creepy, grotesque features like the frequent vomiting of vile, green slime, the girl levitating in the air, and the iconic spider-walk. The suspense and the special effects are provided for the fans to walk home to feel unsettled, uncomfortable, but most of all impressed. It's not often that a horror film gets a place in the Academy Awards, but \"The Exorcist\" was nominated for 10 Oscars which included Best Picture and was the second-highest grossing film back in 1973.As a nod to the works of Alfred Hitchcock, director William Friedkin wanted this movie to be a psychological thriller which there are some elements to the scenes. However, with the notion of some demonic presence lurking around causing fear and harm towards those around it, Friedkin decided that a horror genre is quite sufficient to the story and at the time and still to this day, it's one of the scariest movie ever made. Though horror films are still made to this day and takes great influence of this particular movie, it has been often emulated but never duplicated. What this movie succeeded while many others have failed was that the filmmakers are more invested on using shock value to keep its audiences amused. Jump scares are injected into the storyline to get their viewer's hearts pumping, but when it comes to storeytelling, it very minimal and not much intellectual merit is included. \"The Exorsist\" here is not all supernatural and macabre, there are still some cring-inducing scenes like when doctors start injecting needles through her neck to get blood samples is enough to make you wince just looking at it. There is some murder mystery scenes that relate to the suspicious death of Chris' director, Burke Dennings (Jack MacGowran) and the dramatic tensions belies upon the emotional and mental breakdowns caused by an evil, uncontrollable force who made its residence in the body of an innocent child. Though the scare factor is what everybody will talk about once they've seen the movie, the weaknesses in horror genres are still bogged by overdoing the special effects, poor dialogue, bad dialogue and only half-baked character backgrounds.Based on William Peter Blatty's 1971 novel, \"The Exorcist\", Blatty based his novel on a true event that happened in 1949 to an adolescent boy who faced the same experience that Regan faced here. Heavily depended on character development and making every scene convincing, the film is not specifically for entertainment purposes but to explore the unknown forces in our environment and to take caution of the possibilities that unknown evil forces are upon us waiting to take control of our bodies. It's quite refreshing that the thought of conducting an exorcism is not the first thing that comes to mind in Chris' head, even Father Karras thinks the idea is ancient and hasn't been practiced for centuries and conducting one today is bit of an embarrassment. Just by that concept, it makes this movie feel very real.By the time we reach the climax, we are given the exciting epic battle between Good and Evil and it's handled in a very professional and experienced matter. And though we have advanced over the years in terms of technology and CGI, \"The Exorcist\" has aged very nicely. The make-up effects by Dick Smith have held on quite splendidly especially by Linda Blair giving her the menacing glare, those demonic facial looks like the flaky pale skin, the long fork tongue, and the scary yellow eyes. Though only 44 years old at the time von Sydow also got a makeover to look a lot older and frail. The smaller technical features also deserve some credit including, the lighting, the unsettling cinematography and the use of more modern use of electronical background on the soundtrack is also handled at a professional level. To this day \"The Exorcist\" hold a special place in the annals of horror film classics."
    },
    {
      "username": "callanvass",
      "userUrl": "https://www.imdb.com/user/ur2403537",
      "reviewLink": "https://www.imdb.com/review/rw1211821",
      "warningSpoilers": true,
      "date": "8 November 2005",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "Still One Of The Most Disturbing And Scariest Horror Films Out There, And Hasn't Lost A Bit Of It's Impact, With Incredible Performances All Around!",
      "content": "This is still one of the most disturbing and scariest horror films out there, and hasn't lost a bit of it's impact, with incredible performances all around!. All the characters are wonderful, and the story is extremely gripping, plus Ellen Burstyn,Max Von Sydow,Jason Miller and Linda Blair are all simply incredible in this!. The Scoe is one of the best ever, and there are plenty of creepy images as well, plus that spider walk just gives me the chills every time i see it!. There is lots of suspense and scares, and i must say Linda Blair gives one of the most frightening performances ever!, plus i was rooting for Miller, Von Sydow, Burstyn and Blair all the way!. It's extremely well written and made, and the opening is very memorable and disturbing, plus the finale is one of the most chilling ever!. The possession scenes remain the best in all of the genre, and i thought the dialog was simply wonderful!, plus i felt sorry for Father Karras's character, as he was a wonderful man!. A lot of the scenes truly disturbed me, and happened to enjoy the old ending and the new ending on the re edition, plus i thought it was so cool that Reverend William O'Malley was a priest in real life!.A lot of people think this has aged badly, i have to completely disagree, as it's still scarier then a lot of horror films out there today!, plus the character development is top notch!. all the characters are extremely likable, and i thought Burstyn and Blair had great chemistry together as the mother and daughter!, plus even at 132 minutes it never gets old. It's very emotional at times, and i thought that Lee J. Cobb was simply hilarious in his role as the Liutenant!, plus i love the constant creepy and scary atmosphere it has throughout!.The scenes with Father Karras and his mother really moved me, and the film still manages to shock me, plus William Friedkin did an incredible job of directing this!. This is still one of the most disturbing and scariest Horror films out there,and hasn't lost a bit of it's impact with incredible performances all around, and if you haven't seen it, where the hell have you been? Do so immediately you won't regret it!.The Direction is incredible!. William Friedkin does an incredible job here, with stunning camera work, wonderful angles,great use of that smoke machine, constantly adding creepy and scary atmosphere, creating lots of creepy images, and lots of other amazing shots as well, plus he kept the film at an extremely engrossing pace!.There is a lot of blood and gore, but it's all very disturbing and not fun to watch, so i'm not going to spoil it for you, one thing is for sure though, you will be disturbed by it.The Acting is Oscar worthy!.Ellen Burstyn is incredible here, she is just full of emotion, and you really will root for her character all the way, since she is so likable, and a wonderful caring mother, she also had wonderful chemistry with Linda Blair, i simply adored her performance she deserved Oscar Consideration in my opinion! (Burstyn rules!!).Max Von Sydow is wonderful as Father Merrin, and while he didn't say much, he had an extremely likable character, and his dialog said it all!, i just wished he had more screen time, because i loved him. Jason Miller is incredible as Father Karras, he is a haunted man with a haunted past, and you will be rooting for him all the way, he had some memorable lines, and had some wonderful scenes with Vasiliki Maliaros, he was incredible!, and his performance will be remembered for years to come!. Linda Blair is astounding as the Daughter, she seriously gave me the creeps and gives, one of the most chilling performances of all time in my opinion!. Lee J. Cobb is very funny as the Lt., i really liked him wished he had more screen time though. Reverend William O'Malley is fantastic as Father Dyer, and was extremely convincing, and i found it so cool that he is actually a priest in real life!. Kitty Winn and Vasiliki Maliaros both do what they have to do very well. rest of the cast are fine.Overall if you haven't seen it where the hell have you been? do so immediately you won't regret it!. ***** out of 5"
    }
  ],
  "errorMessage": ""
}