{
  "imDbId": "tt0070047",
  "title": "The Exorcist",
  "fullTitle": "The Exorcist (1973)",
  "type": "Movie",
  "year": "1973",
  "language": "en",
  "titleInLanguage": "The Exorcist",
  "url": "https://en.wikipedia.org/wiki/The_Exorcist",
  "plotShort": {
    "plainText": "The Exorcist is a 1973 American supernatural horror film directed by William Friedkin from a screenplay by William Peter Blatty, based on his 1971 novel of the same name. The film stars Ellen Burstyn, Max von Sydow, Jason Miller, and Linda Blair. The story follows the demonic possession of a young girl and her mother's attempt to rescue her through an exorcism by a pair of Catholic priests.\r\nBlatty, who also produced, and Friedkin, his choice as director, had difficulty casting the film. Their choice of relative unknowns Burstyn, Blair, and Miller, instead of major stars, drew opposition from Warner Bros. Pictures executives. Principal photography was also difficult, taking place in both hot deserts and refrigerated sets. Many cast and crew were injured, some died, and unusual accidents delayed shooting. Production took twice as long as scheduled and cost almost three times the initial budget; the many mishaps have led to a belief that the film was cursed.\r\nThe Exorcist was released in 24 theaters in the United States on December 26, 1973. Reviews were mixed, but audiences waited in long lines during winter weather; the sold-out shows were even more profitable for Warner, since they had booked it into those theaters under four wall distribution rental agreements, the first time a major studio had done that. Some viewers suffered adverse physical reactions, fainting or vomiting to shocking scenes such as a realistic cerebral angiography. Many children were allowed to see it, leading to charges that the MPAA ratings board had accommodated Warner by giving the film an R rating instead of the X rating to ensure the troubled production its commercial success. Several cities attempted to ban it outright or prevent children from attending.\r\nThe cultural conversation around the film helped it become the first horror film to be nominated for the Academy Award for Best Picture, as well as nine others. Blatty won Best Adapted Screenplay, while the sound engineers took Best Sound. It has had several sequels and was the highest-grossing R-rated horror film (unadjusted for inflation) until It. The Exorcist has had a significant influence on popular culture and several publications regard it as one of the greatest horror films ever made. In 2010, the Library of Congress selected The Exorcist to be preserved in its National Film Registry, citing it as \"culturally, historically, or aesthetically significant\".",
    "html": "<p>The Exorcist is a 1973 American supernatural horror film directed by William Friedkin from a screenplay by William Peter Blatty, based on his 1971 novel of the same name. The film stars Ellen Burstyn, Max von Sydow, Jason Miller, and Linda Blair. The story follows the demonic possession of a young girl and her mother's attempt to rescue her through an exorcism by a pair of Catholic priests.</p><p>Blatty, who also produced, and Friedkin, his choice as director, had difficulty casting the film. Their choice of relative unknowns Burstyn, Blair, and Miller, instead of major stars, drew opposition from Warner Bros. Pictures executives. Principal photography was also difficult, taking place in both hot deserts and refrigerated sets. Many cast and crew were injured, some died, and unusual accidents delayed shooting. Production took twice as long as scheduled and cost almost three times the initial budget; the many mishaps have led to a belief that the film was cursed.</p><p>The Exorcist was released in 24 theaters in the United States on December 26, 1973. Reviews were mixed, but audiences waited in long lines during winter weather; the sold-out shows were even more profitable for Warner, since they had booked it into those theaters under four wall distribution rental agreements, the first time a major studio had done that. Some viewers suffered adverse physical reactions, fainting or vomiting to shocking scenes such as a realistic cerebral angiography. Many children were allowed to see it, leading to charges that the MPAA ratings board had accommodated Warner by giving the film an R rating instead of the X rating to ensure the troubled production its commercial success. Several cities attempted to ban it outright or prevent children from attending.</p><p>The cultural conversation around the film helped it become the first horror film to be nominated for the Academy Award for Best Picture, as well as nine others. Blatty won Best Adapted Screenplay, while the sound engineers took Best Sound. It has had several sequels and was the highest-grossing R-rated horror film (unadjusted for inflation) until It. The Exorcist has had a significant influence on popular culture and several publications regard it as one of the greatest horror films ever made. In 2010, the Library of Congress selected The Exorcist to be preserved in its National Film Registry, citing it as \"culturally, historically, or aesthetically significant\".</p>"
  },
  "plotFull": {
    "plainText": "The Exorcist is a 1973 American supernatural horror film directed by William Friedkin from a screenplay by William Peter Blatty, based on his 1971 novel of the same name. The film stars Ellen Burstyn, Max von Sydow, Jason Miller, and Linda Blair. The story follows the demonic possession of a young girl and her mother's attempt to rescue her through an exorcism by a pair of Catholic priests.\r\nBlatty, who also produced, and Friedkin, his choice as director, had difficulty casting the film. Their choice of relative unknowns Burstyn, Blair, and Miller, instead of major stars, drew opposition from Warner Bros. Pictures executives. Principal photography was also difficult, taking place in both hot deserts and refrigerated sets. Many cast and crew were injured, some died, and unusual accidents delayed shooting. Production took twice as long as scheduled and cost almost three times the initial budget; the many mishaps have led to a belief that the film was cursed.\r\nThe Exorcist was released in 24 theaters in the United States on December 26, 1973. Reviews were mixed, but audiences waited in long lines during winter weather; the sold-out shows were even more profitable for Warner, since they had booked it into those theaters under four wall distribution rental agreements, the first time a major studio had done that. Some viewers suffered adverse physical reactions, fainting or vomiting to shocking scenes such as a realistic cerebral angiography. Many children were allowed to see it, leading to charges that the MPAA ratings board had accommodated Warner by giving the film an R rating instead of the X rating to ensure the troubled production its commercial success. Several cities attempted to ban it outright or prevent children from attending.\r\nThe cultural conversation around the film helped it become the first horror film to be nominated for the Academy Award for Best Picture, as well as nine others. Blatty won Best Adapted Screenplay, while the sound engineers took Best Sound. It has had several sequels and was the highest-grossing R-rated horror film (unadjusted for inflation) until It. The Exorcist has had a significant influence on popular culture and several publications regard it as one of the greatest horror films ever made. In 2010, the Library of Congress selected The Exorcist to be preserved in its National Film Registry, citing it as \"culturally, historically, or aesthetically significant\".\r\nPlot\r\nTheatrical cut\r\nIn northern Iraq, the adhan, the Islamic call to prayer, is heard. Catholic priest and archaeologist Lankester Merrin unearths a medallion of Saint Joseph and an artifact representing Pazuzu, an ancient demon. As Merrin prepares to leave Iraq, he sees a large statue of Pazuzu, and two dogs fighting.\r\nIn the Washington, D.C., neighborhood of Georgetown, actress Chris MacNeil stars in a film directed by her friend Burke Dennings. MacNeil rents a well-appointed house with servants and her 12-year-old daughter Regan. Father Damien Karras, a psychiatrist who counsels Georgetown University priests, visits his ailing mother in New York. He confides to a colleague that he feels unfit in his role, citing a crisis of faith. Chris hears noises in the attic, and Regan attributes them to her imaginary friend, \"Captain Howdy\". In a local church, a statue of Mary is found desecrated.\r\nChris hosts a party. Karras' friend Father Dyer explains Karras' role as counselor, mentioning that his mother died recently. Regan appears and urinates on the carpet. After Chris puts Regan to bed, her bed shakes violently. Dyer consoles Karras, and Karras expresses guilt at not having been with his mother when she died. Karras dreams of his mother, a Saint Joseph medallion and—briefly—a demonic face.\r\nRegan becomes violent. She is subjected to several medical tests which find nothing physically wrong with her. During a house call, a demon possesses Regan's body; the possessed Regan exhibits abnormal strength. One night, Chris finds the house empty except for a sleeping Regan. Dennings is found dead at the foot of an outdoor staircase beneath Regan's window. Homicide detective William Kinderman questions Karras, confiding that Dennings' head was turned backwards.\r\nRegan's condition worsens as her body becomes covered with sores. A doctor mentions exorcism as a remote option, suggesting a possible psychological benefit. Kinderman visits Chris, explaining that the only plausible explanation for Dennings' death is that he was pushed from Regan's window. As Kinderman leaves, the possessed Regan stabs her genitals with a crucifix. To Chris's horror, the possessed Regan turns her head backwards and speaks in Dennings' voice. Regan is confined to her bedroom.\r\nChris seeks out Karras, who visits Regan. Over two meetings, the possessed Regan claims to be the Devil himself, projectile vomits into Karras's face, speaks in tongues, and reacts violently when tap water is sprinkled on her, which Karras had claimed was holy water—a point against genuine possession. The demon says it will remain in Regan until she is dead. Desperate, Chris confides that the possessed Regan killed Dennings. At night, Chris's assistant calls Karras to the house. They witness the words \"help me\" materialize on Regan's skin. Still ambivalent, Karras concludes that an exorcism is warranted. His superior grants permission on the condition that an experienced priest lead the ritual while Karras assists. Merrin, having performed an exorcism before, is summoned.\r\nMerrin arrives at the house, warning Karras that the demon attacks psychologically. As the priests read from the Roman Ritual, the demon curses them. It focuses on Karras, verbally attacking his loss of faith and guilt over his mother's death. The priests rest momentarily and Merrin, shaking, takes nitroglycerin. Karras enters the bedroom where the demon appears as his mother. Showing weakness, Karras exclaims that the demon is not his mother. Merrin excuses Karras and continues the exorcism by himself. Karras assures Chris that Regan will not die and re-enters the room, finding Merrin dead. Enraged, Karras beats the possessed Regan and demands that the demon take him instead. The demon rips a medallion of Saint Joseph from Karras' neck and begins to possess him, freeing Regan. Karras hurls himself out the window, tumbling down the stairs outside. Chris and Kinderman enter the room. Chris embraces the healed Regan, and Kinderman surveys the scene. Outside, Dyer administers the dying Karras last rites.\r\nThe MacNeils prepare to leave, and Father Dyer says goodbye. Despite having no memory of her ordeal, Regan is moved by the sight of Dyer's clerical collar to kiss him on the cheek. As the MacNeils leave, Chris gives Dyer the medallion found in Regan's room.\r\nDirector's cut ending\r\nAt the end of the 2000 re-release, when Chris gives Karras' medallion to Dyer, Dyer returns it and suggests that she keep it. After she and Regan drive away, Dyer pauses at the top of the stone steps before walking away and coming across Kinderman, who narrowly missed Chris and Regan's departure; Kinderman and Dyer begin to develop a friendship.\r\nCast\r\nEllen Burstyn as Chris MacNeil\r\nMax von Sydow as Father Lankester Merrin\r\nLee J. Cobb as Lieutenant William F. Kinderman\r\nKitty Winn as Sharon Spencer\r\nJack MacGowran as Burke Dennings\r\nJason Miller as Father / Dr. Damien Karras, S.J.\r\nLinda Blair as Regan MacNeil\r\nFather William O'Malley as Father Joseph Dyer\r\nBarton Heyman as Dr. Samuel Klein\r\nPeter Masterson as Dr. Barringer\r\nRudolf Schündler as Karl, House Servant\r\nGina Petrushka as Willi Engstrom\r\nRobert Symonds as Dr. Taney\r\nArthur Storch as The Psychiatrist\r\nFather Thomas Bermingham as Father Tom Kanavan, President of Georgetown University\r\nVasiliki Maliaros as Mrs. Karras, Damien's Mother\r\nTitos Vandis as John, Damien's Uncle\r\nJohn Mahon as Language Lab Director\r\nWallace Rooney as Bishop Michael\r\nRon Faber as Chuck and The Voice of Pazuzu\r\nDonna Mitchell as Mary Jo Perrin\r\nDick Callinan as Captain Billy Cutshaw\r\nRoy Cooper as Jesuit Dean\r\nRobert Gerringer as Senator at Party\r\nMercedes McCambridge as The Voice of Pazuzu\r\nWilliam Peter Blatty as Fromme, The Producer (uncredited)\r\nPaul Bateson as Radiologist's Assistant (uncredited)\r\nElinore Blair as Nurse (uncredited)\r\nBarton Lane as Angiography Doctor (uncredited)\r\nEileen Dietz as The Face of Pazuzu (uncredited)\r\nAnn Lane as Spiderwalk (uncredited)\r\nProduction\r\nDevelopment\r\nAspects of Blatty's novel were inspired by the 1949 exorcism performed on a boy known as \"Roland Doe\" or \"Robbie Mannheim\" by Jesuit priest William S. Bowdern. Despite the publisher's high expectations, it sold poorly until Blatty appeared on The Dick Cavett Show to discuss the book and captivated the audience with discussions of whether the devil existed. Soon afterwards the novel was atop the New York Times best seller list.\r\nDespite Blatty's previous screenwriting experience on Blake Edwards' films, studios had generally been uninterested in adapting The Exorcist before its publication. Lew Grade made a modest offer for the rights that Blatty said later he would have accepted due to his difficult financial circumstances, but for his requirement that he produce. Shirley MacLaine, a friend of Blatty's on whom he had based the Chris McNeil character, to the point of using some things she had once said as dialogue, had been interested. The deal broke down over Blatty's insistence on producing; a later agreement to co-produce with Paul Monash, producer of Butch Cassidy and the Sundance Kid, also collapsed over differences over the script and Blatty's discovery that Monash was trying to wrest control of the film from him.\r\nWriting\r\nBlatty's screenplay follows the plot of his novel closely, but narrows the story's focus. Subplots like the desecration of the churches (and the relationship between Karras and Kinderman that develops from the latter's investigation), Karras's efforts to get the Church bureaucracy to approve the exorcism, and the ongoing medical investigations of Regan's condition, are less prominent in the film, as are supporting characters such as Chris's household staff, Dennings, and Regan's father. The overall time frame is condensed.\r\nSome scenes, particularly those with sexual content, were toned down for the movie since an actress of approximately Regan's age was expected to be cast. The scene where Regan masturbates with a crucifix was, in the book, more prolonged and explicit, with Regan seriously injuring herself yet attaining orgasm. The film also excludes the detail from the book of the possessed Regan experiencing constant diarrhea, giving her room a strong foul odor.\r\nBlatty also made the screenplay unambiguous about Regan's condition. In his novel every symptom and behavior she exhibits that might indicate possession is counterbalanced with a reference to an actual case where the same phenomena were found to have natural, scientific causes. Beyond Karras' initial professional skepticism, that perspective is absent from the film.\r\nCasting\r\nThe lead roles, particularly Regan, were not easily cast. Although many major stars of the era were considered for them, with Stacy Keach initially signed to play Father Karras, Blatty and Friedkin ultimately went with lesser-known actors, to the studio's consternation.\r\nChris and Father Karras\r\nJack Nicholson was considered for Karras, and Paul Newman interested, before Blatty hired Stacy Keach. Three A-list actresses of the time were considered for Chris. Audrey Hepburn said she would take the role but only if the movie could be shot in Rome, where she was living, which was too problematic. Anne Bancroft was pregnant and willing only if production could start after she gave birth; Friedkin could not wait that long. Jane Fonda, next on the list, purportedly derided the film and turned it down.\r\nBlatty suggested his friend Shirley MacLaine; Friedkin was hesitant to cast her, since she had starred in 1970's The Possession of Joel Delaney. After meeting Carol Burnett, Friedkin believed she had the range beyond her comic television persona, and Blatty agreed, but the studio turned her down. Ellen Burstyn received the part after she telling Friedkin she was \"destined\" to play Chris, discussing the Catholic upbringing she had later rejected. Studio head Ted Ashley vigorously opposed casting her, dramatizing his ultimatum that it would be \"over my dead body\" by making Friedkin walk over him as he lay on the floor, then grabbing the director's leg and telling him he would come back from the dead if necessary to stop him. Ashley relented after no other alternatives emerged.\r\nWith Burstyn now set, Jason Miller called Friedkin. They had previously spoken after a performance of Miller's play That Championship Season about the lapsed Catholicism in it, as background for the film. Miller had read a copy of the novel Friedkin left him, and told the director \" is me\". Miller had had a Catholic education, studied to be a Jesuit priest himself for three years at Catholic University of America (also in Washington) until experiencing a spiritual crisis similar to Karras's. Friedkin thanked him for his interest but told him Keach had already been signed.\r\nMiller, who had acted only on stage, asked for a screen test. Friedkin had the playwright and Burstyn do the scene where Chris tells Karras she thinks Regan might be possessed. Afterwards, he had Burstyn interview Miller about his life with the camera focusing on him from over her shoulder, and finally asked Miller to say Mass as if for the first time. Burstyn felt Miller was too short for the part, unlike her boyfriend at the time, whom Friedkin had passed on. The director felt the test was promising but, after viewing the footage the next morning, realized Miller's \"dark good looks, haunted eyes, quiet intensity, and low, compassionate voice\", qualities which to him evoked John Garfield, were exactly what the part needed. The studio bought out Keach's contract.\r\nRegan\r\nDirectors considered for the project were skeptical that a young actress could carry the film. Mike Nichols had turned down The Exorcist specifically for that reason. The first actresses considered had been in other successful films and television series. Pamelyn Ferdin, a veteran of science fiction and supernatural drama, was turned down as too familiar. Denise Nickerson, who had appeared in two roles on the horror-soap opera Dark Shadows and played Violet Beauregarde in Willy Wonka & the Chocolate Factory, said in later interviews her family found the script too dark. Janet Leigh would not let her daughter, Jamie Lee Curtis, audition.\r\nFriedkin had interviewed 16-year-old girls who looked young enough. Then Elinore Blair came in unannounced with her daughter Linda; her agency had not sent her for the part, but she had previously met with Warners' casting department. Both impressed Friedkin. Elinore was not a typical stage mother, and Linda's credits were primarily in modeling and a single soap opera role. \"mart but not precocious. Cute but not beautiful. A normal, happy 12-year-old girl\", Friedkin later recalled.\r\nWith Linda having the qualities Friedkin sought, he needed to know if she could handle the material. He asked if she knew what The Exorcist was about; she told him she had read the book. \"t's about a little girl who gets possessed by the devil and does a whole bunch of bad things.\" Friedkin then asked her what she meant. \"he pushes a man out of her bedroom window and she hits her mother across the face and she masturbates with a crucifix.\" Friedkin then asked Linda if she knew what masturbation meant. \"It's like jerking off, isn't it?\", and she giggled a little bit. \"Have you ever done that?\" he asked. \"Sure; haven't you?\" she responded.\r\nShe was cast after tests with Burstyn; Friedkin wanted to keep that level of spontaneity on set. \"After all these difficult scenes she'd tiptoe around and giggle, after every bit\", Blatty recalled. Of the 500 actresses Friedkin said he auditioned, \"there wasn't one other I would have considered.\"\r\nFriedkin originally intended to use Blair's electronically treated voice for the demon's dialogue. But in scenes with the demon confronting the priests it lacked the dramatic power required, so he cast Mercedes McCambridge, an experienced voice actress. After filming, Warners did not credit her, until Screen Actors Guild arbitration. It concluded quickly enough that McCambridge's name was included in the credits on all but the first 30 prints but prevented the release of a soundtrack album with excerpts of dialogue.\r\nActress Eileen Dietz, 15 years Blair's senior, stood in for her in the crucifix scene, the fistfight with Father Karras, and others that were too violent or disturbing for Blair to perform. She also appears as the face of Pazuzu. Friedkin gave her no notes, telling her to play the possessed Regan as \"a primal force of malevolence ... I wasn't playing a little girl, I was playing the demon that possessed a little girl\", she recalled.\r\nReportedly Warners had forced Friedkin to hire Dietz; he in turn used her only when absolutely necessary. Blair, who recalls Friedkin telling her the film would not succeed if she was not in as many shots as possible, estimates that Dietz is in 17 seconds of the film. Dietz, angry that her contribution to the film had been minimized, claimed in the media to have done all the possession scenes. Warners ultimately measured her screen presence at 28.25 seconds.\r\nFather Merrin\r\nWarners wanted Marlon Brando in the role of Lankester Merrin. Friedkin did not want to make a \"Brando movie\" and refused. A Philippe Halsman photograph of Pierre Teilhard de Chardin, one of Blatty's inspirations for Father Merrin, inspired Friedkin to cast Max von Sydow instead of Paul Scofield, who Blatty had wanted.\r\nSupporting roles\r\nThe film's supporting roles were cast more quickly. At a play, Blatty and Friedkin ran into Lee J. Cobb, who was cast as Lt. Kinderman. Two priests were cast. Father William O'Malley had become acquainted with Blatty through his criticism of the novel. After Blatty introduced him to Friedkin, they gave him the role of Father Dyer, a character O'Malley had considered clichéd in the novel. The Rev. Thomas Bermingham, the Georgetown professor who assigned Blatty as a student to do the research on demonic possession that informed the novel, took the role of the university president.\r\nCast sheets in The Hollywood Reporter and a Warners press release list British director J. Lee Thompson as a member of the cast early in production. It was suggested he would be playing Dennings, whom Shirley MacLaine says was based on him as he had directed the 1965 film John Goldfarb, Please Come Home!, which Blatty had adapted for the screen from his novel, but Jack MacGowran got the role instead. A later cast listing adds Mary Boylan and The Rev. John Nicola, one of the film's technical advisors, in small roles. Greek actor Titos Vandis, cast as Karras's uncle, covered his face with a hat, as Friedkin felt audiences would associate him with his role in the recent Woody Allen film Everything You Always Wanted to Know About Sex* (*But Were Afraid to Ask). Friedkin reportedly cast Vasiliki Maliaros as Karras's mother after encountering her in a Greek restaurant.\r\nDirection\r\nIn addition to Nichols, Warners had approached Arthur Penn and Stanley Kubrick to direct. Blatty recalled in 2015 that one director wanted to set the film in Salem, Massachusetts, which he rejected because he considered the contrast between the worldly nature of the capital and the supernatural aspects of the plot to be essential to the story.\r\nThe studio finally hired Mark Rydell to direct, but Blatty insisted on Friedkin, with whom he was acquainted, as he had been impressed by The French Connection. At a meeting with Edwards, Blatty recalled, Friedkin had been extremely frank about the shortcomings of a Peter Gunn script.\r\nBlatty saw Friedkin as \"a director who can bring the look of documentary realism to this incredible story, and ... a guy who is never going to lie to me.\" The studio demurred, until The French Connection was released to commercial success and a Best Picture Academy Award. While doing his press tour for that film, Friedkin began reading a copy of the novel Blatty sent him. After the first 20 pages he canceled his dinner plans and finished the book. \"I was so overwhelmed by the power of this story, and I didn't stop to think about the problems involved with making it.\"\r\nHe decided the film would be best with a deliberate pace. \"I wanted it to happen slowly because the story, as it affected the real people who inspired it, took place in just that way\", Friedkin said in 2015. For the film to work, he believed, audiences would need to see everything that happened to Regan, everything else attempted to treat her condition.\r\nAn early clash during production led to Warners telling Blatty he could not take any action against Friedkin. Afterwards, Blatty informed the studio he could no longer have any responsibility for controlling the budget; he and Friedkin reconciled and got along for the rest of the picture. Production costs soon exceeded the initial $4.2 million ($20.9 million in modern dollars) budget.\r\nFriedkin went to great lengths manipulating the actors to get genuine reactions. Unsatisfied with O'Malley's performance as Dyer ministers to the dying Karras at the end of the film, he slapped him hard across the face to generate a deeply solemn yet literally shaken reaction for the scene, offending the many Catholic crew members on set. \"It was beyond what anyone needs to do to make a movie,\" Burstyn said in 2019. He also fired blanks without warning to elicit shock from Miller for a take; Dietz recalls him also doing this during the scene where Regan assaults the doctors who have come to see her. Friedkin also told Miller that the vomit, porridge colored to resemble pea soup and pumped through a hidden tube, would hit him in the chest during the projectile vomiting scene, and rehearsed it that way. But when filmed, the soup hit his face, resulting in his disgusted reaction.\r\nCrewmembers found Friedkin demanding and sometimes difficult to work with. A shot of bacon being cooked on a griddle begins as a close-up and then pulls back. There was little space for the dolly, so Friedkin halted shooting while a wall behind it was removed. Afterward, he did not like the way the bacon curled, so the prop master was sent to look for preservative-free bacon, difficult to find at the time, further delaying the scene. Another crewmember recalls returning after three days of sick leave to find Friedkin still shooting the same scene.\r\nDietz recalls the main delay being reshoots, even of scenes that had been difficult to stage and film the first time, such as Regan's bed shaking. \"People were literally placing bets on what he would re-shoot next.\" He also fired and rehired crew regularly. One crewmember recalls seeing Friedkin shake hands warmly with someone, and then seconds later tell a second person to \"get this guy outta here\", earning him the nickname \"Wacky Willy\".\r\nCinematography\r\nDirector of photography Owen Roizman had worked with Friedkin in that capacity on The French Connection. The two collaborated again on The Exorcist, with Roizman in charge of filming every scene in the film save those in the Iraqi prologue, shot by Billy Williams. In a 1974 interview with American Cinematographer, the magazine of the American Society of Cinematographers, Roizman discussed The Exorcist at length.\r\nRoizman and Friedkin agreed that, like their previous film, they wanted The Exorcist to look as if shot with available light. But they would eschew Connection's documentary look. The MacNeil house was, unlike house interiors in horror films such as Psycho, designed to look normal and inviting. \"What we tried to do, by means of the lighting, was to give it a kind of ominous feeling—as if some lurking, mysterious thing were hanging over it. That's about as far as we went with photographic style.\"\r\n\"Friedkin demanded complete realism\", Roizman recalled. \"He wanted to see pictures with glass in them, mirrors on the walls and all of the other highly reflective surfaces you would naturally find in a house, we never tried to cover anything up, as we would normally do for expedience in shooting.\" This realism meant that the kitchen set, with much stainless steel and glass, was \"virtually impossible\" to light beyond the practical ceiling fixtures and whatever other lights they could manage to sneak in and hide. \"e'd walk in, hit the switch and shoot—through not much choice.\"\r\nFilming and locations\r\nThe film's opening sequences were filmed in and near the city of Mosul, Iraq, a country with which the U.S. did not then have diplomatic relations; Warners feared that Friedkin and his crew might not be able to return. He negotiated filming arrangements directly with local officials of the ruling Ba'ath Party, who conditioned their permission on hiring local workers as crew and teaching filmmaking to interested residents. The archaeological dig site shown is Hatra, south of Mosul. Temperatures during the days filming took place reached 130 °F (54 °C), limiting shooting to the early mornings and late evenings.\r\nAlthough the film is set in Washington, D.C., many interior scenes were shot in various parts of New York City. The MacNeil residence interiors were filmed at CECO Studios in Manhattan. Principal photography began in mid-August 1972 with Karras's confrontation with his uncle over his mother's care, shot at Goldwater Memorial Hospital (since demolished to make way for Cornell Tech) on Roosevelt Island in the East River between Manhattan and Queens; the scenes with Karras's mother in the hospital were filmed at Bellevue. The scene where Father Karras listens to the tapes of Regan was filmed in the basement of Keating Hall at Fordham University, a Jesuit university in the Bronx where O'Malley, who plays Dyer, was an assistant professor of theology.\r\nThe exterior of the MacNeil house was a family home on 36th and Prospect in Washington. A mansard roof was added to account for the scene in which Chris investigates the scratching noises in the attic. The neighboring stairs were padded with half-inch-thick (13 mm) rubber to film Karras's death. Because the house was set back slightly from them, the crew built an eastward extension with a false front.\r\nThe interior of Karras' room at Georgetown was a reconstruction of theology professor Father Thomas M. King's \"corridor Jesuit\" room in New North Hall. Every element of King's room, including posters and books, was recreated, including a poster of Pierre Teilhard de Chardin, the theologian on whom Merrin was loosely based. Locations used on campus included both exteriors such as Burstyn's first scene, shot on the steps of Healy Hall, and interiors such as the defilement of the statue of the Virgin Mary in Dahlgren Chapel, and the Archbishop's office (actually the office of the university's president). One scene was filmed in The Tombs, a student hangout.\r\nExorcism scenes\r\nThe exorcism scenes were challenging to film. Friedkin wanted the bedroom set to be cold as it is described in the novel, cold enough to see the actors' breath. A $50,000 ($249,000 in modern dollars) refrigeration system was installed that could cool the set to −20 °F (−29 °C) to make characters' breath visible. Since the set lighting warmed the air, it could only remain cold enough to film for three minutes at a time. It broke down frequently, and Friedkin was only able to complete five shots each day; the complete scene thus took a month to film, in continuity, the order they were written in the script. Blair wore green contact lenses meant to give her eyes a bestial appearance for scenes when Regan is possessed.\r\nIt was easier to film some of the other supernatural manifestations, such as the bed rocking and the curtains blowing, in Regan's room, since the walls and ceiling of the set were wild, or capable of being moved to accommodate a camera. After the scene where the ceiling cracks it was necessary to use a hard one. A hole was cut in the ceiling for the rig to go through when Regan levitates as the priests chant \"The power of Christ compels you!\", the most challenging shot in the sequence. the 80-pound (36 kg) Blair wore a bodysuit under her nightgown with attached hooks for monofilament wires.\r\nRoizman had filmed similar scenes before, painting the wires to match the background so they would not show on camera. This was difficult on The Exorcist because of the changes in background. \"We had to practically paint them frame by frame\", he told the magazine. While most directors would have been satisfied to smooth out the scene in post-production, Friedkin wanted it done in longer takes.\r\nFriedkin decided that he did not want any scenes in the movie to have \"any kind of spooky lights that you typically saw in horror films\", so all the lights in the bedroom come from a visible source. The room's color scheme also created the impression of black and white film, with gray taupe walls, Regan's bedding a neutral beige, and the priests in black. White, according to Roizman, would have been too dominant. \"In toning everything down like this, the only real color in the room became the skin tones\", he said. \"This sequence has an almost black and white feeling; yet, there is subtle color there.\"\r\nFather Merrin's arrival scene\r\nFather Merrin's arrival scene was filmed on Max von Sydow's first day on set. The scene where he steps out of a cab and stands in front of the MacNeil residence, silhouetted in a misty streetlamp's glow and staring up at a beam of light from a bedroom window, is one of the most famous scenes in the movie, used for film posters and home media release covers. It was inspired by René Magritte's 1954 painting Empire of Light (L'Empire des lumières).\r\nFriedkin wanted to evoke visually the language Blatty used in the novel for this scene, likening Merrin to \"a melancholy traveler frozen in time\", standing next to a streetlight in the fog when he gets out of the cab. He gave the crew a full day to light the scene, using mainly arc lights and tripod-mounted \"troopers\", and boosting the brightness of the existing streetlamps. Roizman said this was \"the trickiest\" of all the nighttime exterior shots in the film.\r\nIn order to get the beam of light the way Friedkin wanted it, the crew had to take the window frame out of the facade they had attached to the house for filming, put it behind the window and then put the spotlight in between the window and frame. \"t was difficult to get that bright of a glow from a shaded window and we also had to hold a fog effect all the way down the street\", Roizman said. \"Of course—wouldn't you know—just as we were ready to shoot, the wind came up, which made it more difficult to keep the fog settled in.\" By working quickly, he and the camera crew were able to get the shot, with Friedkin finding the first take satisfactory.\r\nHead spinning\r\nThe scenes where the possessed Regan's head rotates 180 degrees so that she appears to be looking directly backwards drew significant notice from audiences and critics upon the film's release. \"All I can tell you is that the way you think I did it is not the way we did it,\" Friedkin told Castle of Frankenstein at the time. Like the film's other special effects, it was performed live in front of the camera. A life-size animated dummy of the character was built, so realistic that Blair felt uncomfortable in its presence.\r\nCritic Mark Kermode says the scene's impact results from the audience not having expected it so soon after the crucifix scene. He believes its recurrence later in the film, during the exorcism scenes, was added on set since it is in neither the novel nor the screenplay. Blatty had argued against it, telling Friedkin \"supernatural doesn't mean impossible\", which led Friedkin to insert a shot of Karras, suggesting the scene might just be a hallucination. When audiences reacted strongly to it, Blatty said Friedkin had \"prov me an idiot once again.\"\r\nSpecial effects supervisor Marcel Vercoutere built the latex dummy with help from makeup artist Dick Smith. They tested its realism by putting it in the front seat of a New York City taxicab and, when enough people were looking, turning the head. They had given the dummy's face the capability to move and appear to speak, even adding a condom so its throat would bulge when speaking, but it still did not quite look real in the bedroom set. A tube was added for simulated breathing, which produced the requisite clouds of vapor.\r\nCrucifix scene\r\nThe scene where the possessed Regan masturbates with a crucifix was filmed with Dietz standing in for Blair. Dietz and Friedkin had \"this long discussion about the right way to jerk off and I showed him why a woman has to churn her wrist.\"\r\n\"This particular scene is the most thought about and talked about scene for the obvious reason that it programs two things that are generally not programmed up-front in the human mind ... sex and religion\", Friedkin said at the time. It lasts only 50 seconds, yet to many viewers seems much longer, he noted. He had filmed much more, but ultimately decided, on his own without previewing it or consulting anyone, that it was about \"how much I could take\".\"\r\n\"Far from shying away from the sight, Friedkin puts it centre-screen, overlighting the entire sequence and accompanying the visuals with a truly revolting stabbing sound,\" writes Kermode. He quotes Blatty, who recalls Friedkin telling him that people would come to the film to see the crucifix scene more than any other. \"At the time ... I thought he was destroying the film. But when I perceived that he was absolutely right, I thought it was terribly depressing.\"\r\nAngiography scene\r\nThe angiography scene, in which a needle inserted into Regan's neck spurts blood, as Blair undergoes the steps of the actual procedure, caused audiences the most discomfort, according to Blatty, who admitted he never watched it. \"I've learned over the years that the most terrifying scene\", Friedkin said in 2015. \"Medical science impinging upon the innocence of this little girl. Which is more disturbing than the demon.\"\r\nIt has been criticized as \"unappetizing\", the film's \"most needless scene\", and \"revolting\". British comedian Graeme Garden, who has a medical degree, agreed the scene was \"genuinely disturbing\"; in his review for the New Scientist, he called it \"irresponsible\".\r\n\"The camera pointedly does not express the horror of Regan's experience with modern medicine, it only records it, allowing the audience to take away from it what it will\", writes critic John Kenneth Muir of this scene in Horror Films of the 1970s. \"In some ways, the hospital interlude is the most terrifying scene in the film because it looks, sounds and feels totally real ... For a time, it is medicine that possesses Regan, not the Devil, it seems.\" Kermode says it \"seems like an Inquisitional torture, perverse in its precision and horribly sexual in its execution.\"\r\nIn a 2021 article in History of the Human Sciences, Amy C. Chambers of Manchester Metropolitan University similarly observes that \"he medical space is made spectacular and horrific in The Exorcist not through the presentation of Regan's behaviour or the demon, but through the clinical nature of her treatment and how this is communicated through shots and sound.\" She quotes Finnish media professor Frans Ilkka Mäyrä on how the scientific suggests the spiritual here: \"The violent movements and noises of arteriographic machinery reach diabolical dimensions.\"\r\nMedical professionals have described the scene, not in the novel but added to the film to reflect changes in medical technology, as a realistic depiction of the procedure. It is also of historical interest, as radiologists had started to move from using the carotid artery for the puncture (as they do in the film) in favor of a more distant artery. It has also been described as the most realistic depiction of a medical procedure in a popular film. In his 2012 commentary on the DVD release of the 2000 cut, Friedkin claimed that the scene was used as a training film for radiologists for years after the film's release.\r\n\"Spider-walk\" scene\r\nStuntwoman Ann Miles performed the spider-walk scene in November 1972, after two weeks of practice. Vercoutere had designed a special harness, but she did not need it due to her experience as a former Florida State college gymnast. on the first take. Friedkin cut it, over Blatty's objection, just prior to the premiere, believing it too early in the film for such a drastic effect on Regan to be visible. Whether the scene had been shot at all was debated by fans for years afterwards—Friedkin denied having done so—until Kermode found the footage in Warners' archives while researching his book on the film in the mid-1990s (Friedkin said he had probably forgotten filming the scene). It was restored to the 2000 director's cut, albeit with a \"muddy, grainy\" look that one critic said made the scene seem superfluous, using a different take showing Regan with blood flowing from her mouth\r\nMiles was not credited. Websites devoted to the film during the early 21st century gave credit to another contortionist, Sylvia Hager, who had been credited after the 2000 re-release. This confusion may have arisen from Vercourtere's website, where he credited her and described the harness he had designed that she supposedly wore to make the scene possible. He said the scene was cut because the harness could not be erased in post-production. According to Miles, Hager, her lighting double, could not perform the scene even with the harness, which Vercourtere had hoped to market afterwards. Since Miles was able to do the spider walk without it, she believes he left her out of his account for commercial reasons. The misidentification, Miles said in 2018, cost her jobs afterwards since some producers believed she was falsely taking credit for Hager's work. Since then, with the intercession of SAG, she has been properly credited.\r\nSpecial effects\r\nSmith, the makeup artist, created some key special effects. In one scene, von Sydow is wearing more makeup than Blair, in order to look 30 years older in some very detailed facial close-ups. Many viewers did not realize he was made up at all; critic Pauline Kael, in her generally unfavorable The New Yorker review, called it \"one of the most convincing aging jobs I've ever seen\" According to Friedkin, it took four hours to apply the makeup every morning. He said that if there was a regular Academy Award for makeup, Smith would have received it.\r\nFor the look of the possessed Regan, Friedkin and Smith drew their inspiration from the crucifix scene. If she had injured herself masturbating with it, they reasoned, it was likely that under Pazuzu's control she might also have deliberately scourged her face. \" decided to have the makeup grow out of self-inflicted wounds to the face that become gangrenous so that there was an organic reason for the change in her facial features, which might certainly be demonic possession, or self-immolation\", Friedkin later explained.\r\nA latex stomach was built for the scene where the words \"HELP ME\" appear on the possessed Regan's body. The letters were scratched in, and then heated to make them disappear. This was filmed and then reversed in the edit so the letters seemed to be appearing.\r\nPost-production\r\nEditing\r\nBud Smith recalls Friedkin asking him to work on The Exorcist after shooting wrapped. Friedkin had already hired three other editors (Jordan Leonduopoulos, credited as \"supervising editor\", Norman Gay and Evan Lottman), but told Smith he would be the lead editor. He asked Friedkin to let him cut one large rack of footage from the Iraq sequence at the beginning of the film. Smith worked through a weekend to recut the footage to a rhythm based on the sound of a blacksmith hammering an anvil near where Father Merrin is having his tea.\r\nSmith also created the \"flash face\" trailer for the film, with a montage of faces from various scenes in the film, still, all appearing in all-white against a black background, which quickly swells to almost all white and then fades back to nearly black, making a strobe-like effect, as tense string music plays, ending after almost a minute and a half with the title. Friedkin said in 2018 that Warners feared it would scare audiences too much. He considers it the best of the film's trailers.\r\nIn that 2018 tweet discussing this, Friedkin referred to Smith as \"the film's editor\", although the other three were credited. During principal photography, the editor then hired had never worked on a movie before and was not allowed to cut the raw footage. After production, Friedkin hired Lottman and closely supervised his work. \"It was all about power,\" Lottman said. \"He wanted to be in control of the film.\" All four shared the film's Academy Award nomination for editing.\r\nFriedkin's final cut was 140 minutes long; despite his insistence that it was perfect, Warners insisted he trim the film to two hours to allow for more daily screenings. Blatty was willing to fight for the whole film as it was, but over his objections Friedkin cut roughly 10–12 minutes. Some of the excluded scenes were among Blatty's favorites, including the original ending, with Dyer and Kinderman connecting and agreeing to go to the movies at some point, and a scene where Karras and Merrin take a break from the exorcism and discuss the demon's motivation for possessing Regan on the MacNeil stairs. These scenes had been in Blatty's novel, and he believed that in the movie they made it clearer at the end that good had triumphed and what was at stake.\r\nSound effects\r\nSpecial sound effects for the film were created by Ron Nagle, Doc Siegel, Gonzalo Gavira, and Bob Fine. Animal sounds such as bees, dogs, hamsters, and pigs were mixed into the demon's voice. The sound effect of Regan's head rotating was made by twisting a leather wallet.\r\nFriedkin was personally involved in the four-month sound process, the last aspect of the film completed, just before deadline. Jim Nelson, who Friedkin had hired to supervise the mixing, recalls the director being particularly demanding, treating his then-girlfriend, who was among those assisting in the process, \"like a dog\".\r\nAlleged subliminal imagery\r\nWilson Bryan Key devoted a chapter to the film in his book Media Sexploitation, alleging repeated use of subliminal and semi-subliminal imagery and sound effects. In addition to the Pazuzu face, he claimed that the safety padding on the bedposts was shaped to cast phallic shadows on the wall and that a skull face is superimposed into one of Father Merrin's breath clouds.\r\nA 1991 article in Video Watchdog examined the phenomenon, providing still frames with several uses of subliminal \"flashing\" throughout the film. Friedkin told the authors, \"I saw subliminal cuts in a number of films before I ever put them in The Exorcist, and I thought it was a very effective storytelling device ... The subliminal editing in The Exorcist was done for dramatic effect—to create, achieve, and sustain a kind of dreamlike state.\" In a 1999 interview, Blatty said \"here are no subliminal images. If you can see it, it's not subliminal.\"\r\nTitles\r\nThe title sequence was the first major project for film title designer Dan Perri, whom Friedkin sought out after seeing his work on Electra Glide in Blue, before The Exorcist was even completed. His plan for the titles evolved as the film progressed.\r\nFor the words themselves Perri chose to keep the Weiss Initials typeface used on the cover of Blatty's novel. The filmmakers wanted the words in red, but it was hard to choose an exact shade. \"When's exposed against black it tends to, what's called, bloom. It swells, it glows, it's very hard to control. I had to do a lot of exposure tests just to get the right red that wouldn't bloom.\"\r\nPerri's input into the film's opening continued after those credits, as the music abruptly shifts to an ululating male voice and the scene to the archeological dig site in northern Iraq. Friedkin told him he wanted the film to begin with a sunrise, even though he had not filmed one while there. The closest shot he had was one at midday, of the sun in an orange sky, with rising heat visible. \"I suggested that we create an implied sunrise\", Perri says, \"a very, very long fade in, like a 30-second fade in of the sun in the sky but in black and white. It very slowly dissolves into color\" That image gave the film a sense of beginning it had lacked.\r\nMusic\r\nWhat is now considered the movie's theme, the piano-based melody which opens Tubular Bells, the 1973 debut album by English progressive rock musician Mike Oldfield, became very popular after the film's release, although Oldfield had never imagined it being used in a movie. Friedkin recalled in 2015 that he had wanted something like Brahms' \"Lullaby\" with \"a kind of childhood feel\". He had gone to see Calley, who did not understand what he wanted and directed him to the nearby music library. There he found Oldfield's record, which Warners had not been planning to release. \"But I listened to that refrain, and it hooked me, and we won the rights to it\" he said. \"I think it sold 10 or 20 million records.\"\r\nFriedkin rejected Lalo Schifrin's working score. Schifrin said that after he had written six minutes of music for the \"flash face\" trailer executives told Friedkin to tone it down with softer music; but Friedkin never told him. In 2005 Schifrin said this was in retaliation for an earlier \"incident\" between the two. Schifrin denies claims he used his original Exorcist music several years later for The Amityville Horror. According to a 1998 documentary, Friedkin threw away the tapes of Schifrin's score in the studio parking lot.\r\nIn his Castle of Frankenstein interview shortly after the film's release, Friedkin said he had hired a composer, whom he did not name, \"and he did a score all right, and I thought it was terrible, just overstated and dreadful.\" He decided instead to use the music he had given the composer as inspiration. \"In other words, rather than get bad imitation Stravinsky, I might as well have the real thing.\"\r\nBernard Herrmann, famous for his scores for Orson Welles and Alfred Hitchcock, including the staccato string bursts that accompanied the killings in Psycho, turned down the job after viewing a rough cut. He felt the minimal opening credits deprived a composer of the opportunity to establish a musical mood with an overture. In a 1975 interview with High Fidelity magazine, Herrmann said that Friedkin objected to his intention to use an organ, saying \"I don't want any Catholic music in my picture\" and insisted on sharing composing credit.\r\nIn the soundtrack liner notes for 1977's Sorcerer, Friedkin said that if he had heard the music of Tangerine Dream earlier, he would have had them score The Exorcist. Instead, he used modern classical compositions, including portions of the 1972 Cello Concerto No. 1, of Polymorphia, and other pieces by Polish composer Krzysztof Penderecki, Five Pieces for Orchestra by Austrian composer Anton Webern as well as some original music by Jack Nitzsche, all heard only during scene transitions. The 2000 cut features new music by Steve Boeddeker, as well as brief source music by Les Baxter.\r\nThere are 17 minutes of music in a film around two hours long. Friedkin was satisfied. \"What I wanted\", he said, \"what I think we have in the film, is understated music. The music is just a presence like a cold hand on the back of your neck, rather than assertive.\" In her ambivalent review of the film, critic Judith Crist praised the film's \"sparing and adventurous\" use of music.\r\nIn 1998 a restored and remastered soundtrack was released by Warner (without Tubular Bells) that included three pieces—\"Music from the unused Trailer\", an 11-minute \"Suite from the Unused Score\", and \"Rock Ballad (Unused Theme)\"—from Schifrin's rejected score. That same year, the Japanese version of the original soundtrack LP did not include the Schifrin pieces but did include the main theme, and the Night of the Electric Insects movement from George Crumb's string quartet Black Angels. Waxwork Records released the remastered score in 2017. They included Friedkin's liner notes with art by Justin Erickson of Phantom City Creative.\r\nThe Greek song on the radio as Father Karras leaves his mother's house is \"Paramythaki mou\" (My Tale), sung by Giannis Kalatzis. Part of Hans Werner Henze's 1966 composition Fantasia for Strings is played over the closing credits.\r\nProduction difficulties and purported curse\r\nPrincipal photography began in August 1972, scheduled for 105 days. Due to production problems and accidents on set, it took over 200 days to wrap. The film went $2.5 million ($12.5 million in modern dollars) over budget, ultimately costing the studio $12 million ($59.8 million in modern dollars).\r\nEarly on, a bird flew into a circuit breaker on the set for the interiors of the MacNeil house, starting a fire that destroyed it except for Regan's room, halting shooting for six weeks. Later, another set was severely damaged by the sprinkler system. The 10-foot (3.0 m) statue of Pazuzu was shipped to Hong Kong instead of Iraq, causing a two-week delay.\r\nInjuries to cast and crew also affected production, with permanent consequences for two of the leads. Burstyn's back injury during the scene where the possessed Regan throws Chris backwards before the head-spinning, the take used in the film, left her unable to film for two weeks and using crutches for the remainder of the production; fracturing her coccyx has caused her chronic problems due to inadequate early treatment.\r\nBlair also injured her back, fracturing her lower spine after being too loosely strapped to the rocking bed; the take was also used in the finished film. She developed scoliosis: \" was far more serious than I ever imagined and really affected my health negatively for a long time.\" She further developed a lifelong aversion to cold after spending so much time in the refrigerated bedroom set in only a nightgown and long underwear. A carpenter cut his thumb off and a lighting technician lost a toe in different accidents.\r\nOther people connected with the film and their family members died. MacGowran died a week after completing his scenes as Dennings; Maliaros also died, like her character, before the film was finished. Deaths among or close to the crew included the night watchman and the operator of the refrigeration system for Regan's room, along with an assistant cameraman's newborn.\r\nBlair's grandfather died during the first week of production, and von Sydow had to return to Sweden after his first day shooting after his brother had died, further delaying shooting. Miller's son Jason Patric nearly died when a motorcycle struck him. Several years after the film's release, Paul Bateson, the technician in the angiography scene, was convicted of murdering journalist Addison Verrill; in 2015 Hatra, the World Heritage Site where the prologue was shot, was demolished by ISIL militants.\r\nFriedkin believed that there might have been some supernatural interference with the film. \"I'm not a convert to the occult\", he told the horror-film magazine, Castle of Frankenstein, \"but after all I've seen on this film, I definitely believe in demonic possession ... We were plagued by strange and sinister things from the beginning.\"\r\nSpecial effects supervisor Vercourtere also felt uncomfortable. \"There was definitely a feeling something could happen,\" he recalled. \"I felt I was playing around with something I shouldn't be playing around with.\" To mollify the crew, Friedkin asked Father Thomas Bermingham, the film's technical advisor, to perform an exorcism on the set. Bermingham instead blessed the cast and crew, believing that an actual exorcism would only make the cast more anxious.\r\nBritish film historian Sarah Crowther believes stories of the curse were disseminated by Warner's, which she believes purposely courted controversy by releasing the film just after Christmas. \" spread speculation of the curse prior to release. It was an extremely hot topic in global media when it hit cinemas\", she told inews.com in 2018, likening the curse to the elaborate marketing gimmicks employed by producer William Castle.\r\nCrowther believes most of the aspects of the curse are really just the result of Friedkin's driving, relentless production. Blatty agreed, telling Kermode that Friedkin had started the \"curse\" story with an interview during production in which he blamed \"devils\" for the film's many delays. \"But for God's sake\", said Blatty, \"if you shoot something for a year, people are going to get hurt, people are going to die ... these things just happen.\"\r\nBlair told Kermode that stories of the supposed curse circulated to help viewers deal with the movie. \"They chose to see a scary film, and maybe they wanted to believe all those rumors because it helped the whole process\", she said. In 2000, Blatty joked that \"There is no Exorcist curse. I am The Exorcist curse!\" when asked if the death of Blair's pet mouse was related to it.\r\nReleases\r\nTheatrical\r\nWarners scheduled The Exorcist for release the day after Christmas 1973. It had been scheduled for an earlier release, but that was postponed due to postproduction delays. Friedkin was angry about this date, believing that it hurt the film commercially. He had wanted a release before the holiday, or on it, as is more common at that time of year; it has been speculated that Warners wanted to avoid any controversy that might have come from releasing a film about demonic possession before a major religious holiday. Friedkin supposedly had seen what Paramount had done to make The Godfather, which had had similar issues, a runaway success. He had wanted Warners to choose a more preferable release date, such as March, as that film had had.\r\nThe post-holiday release served to help The Exorcist sell tickets, as most moviegoers had all or most of the week off. It is the second all-time highest-grossing Christmas week release after 1997's Titanic. It has also outgrossed The Godfather. The Exorcist's first run lasted 105 weeks, or just over two years.\r\nIn 1979, the film was re-released theatrically in 70mm, with its original 1.75:1 aspect ratio expanded to 2.20:1. A longer cut titled \"The Version You've Never Seen\" (later re-labeled \"Extended Director's Cut\") was released theatrically in 2000, with additions and changes.\r\nHome media\r\nSpecial edition 25th anniversary VHS and DVD release\r\nA limited 50,000-copy special edition box set was released in 1998 for the film's 25th anniversary on both VHS and DVD. It includes the original ending as a special feature.\r\nBlatty was pleased that the scene was restored. The night before the scene was shot, he and Friedkin had worked very hard on blocking it, to make sure it would be clear to the audience that the film ended on an upbeat moment. \"My theory over the years has been that at that point in the movie, most of the audience is a little out of it\" he said two years later. \"They're really not seeing what's happening there, and, of course, the film lost its original ending and instead ended with Father Dyer looking down the steps ... gives an audience an emotional cue about how they're supposed to feel.\" Overall, he said, the 25th anniversary cut is \"the version that I first saw on the moviola in the editing room all those years ago, and it's the way it ought to be seen.\" The DVD also contains The Fear of God, a documentary on the making of the film.\r\nOther home media\r\nThe extended edition labeled \"The Version You've Never Seen\" (released theatrically in 2000) was released on DVD in 2001. It was re-released on DVD (and Blu-ray) with slight alterations as the \"Extended Director's Cut\" in 2010.\r\nIn a 2008 DVD Review interview, Friedkin said he was scheduled to begin work on The Exorcist Blu-ray that year. When released two years later, it featured a restored version of both cuts. A 40th Anniversary Edition Blu-ray was released in 2013, with both cuts, many of the previously released bonus features and two featurettes about Blatty. The Exorcist: The Complete Anthology, a box set, was released on DVD in 2006, and on Blu-ray in 2014. It includes both cuts, the sequels Exorcist II: The Heretic and The Exorcist III, and the prequels Exorcist: The Beginning and Dominion: Prequel to the Exorcist.\r\nReception\r\nBox office\r\nSince it was a horror film that had gone well over budget, without major stars as leads, Warner did not have high expectations for The Exorcist. It did not preview the film for critics and booked its initial release for only 30 screens in 24 theaters, mostly in 21 large cities and their metropolitan areas. The film grossed $1.9 million ($8.98 million in modern dollars) in its first week, setting house records in each theater, with an average of $70,000, equivalent to $300,000 at modern ticket prices.\r\nWithin its first month it had grossed $7.4 million ($32.1 million in modern dollars) nationwide; Warners' executives expected it to easily surpass My Fair Lady as the studio's most financially successful film. The huge crowds forced the studio to expand it into a 366-screen wide release very quickly. At the time that releasing strategy had rarely been used for anything but exploitation films. Many of the theaters in large cities were not located near downtowns, where Warners had booked Magnum Force, the Dirty Harry sequel, before planning the release of The Exorcist. By February The Exorcist accounted for 15 percent of Warners' grosses in key markets.\r\nNone of the theaters were in Black neighborhoods such as South Central Los Angeles since the studio did not expect that audience to take much interest in the film, which had no Black characters. But after the theater in predominantly white Westwood that had shown the film was overwhelmed with moviegoers from South Central, it was quickly booked into theaters in that neighborhood. Black American enthusiasm for The Exorcist has been credited with ending mainstream studio support for blaxploitation movies, since Hollywood realized that Black audiences would flock to films without content geared to them.\r\nThe New York Times took notice that the audience lined up to see the film was between one-quarter and one-third Black at one theater on the Upper East Side of Manhattan, a mostly white neighborhood of the city, showing the film in late January. \"A lot of blacks relate to voodoo and witchcraft and that kind of devil stuff,\" one Black patron said, when asked why so many Black people went to such lengths to see it. \"Many still believe in black magic, especially those from Haiti and the Deep South.\"\r\nThe Exorcist earned $66.3 million ($287 million in modern dollars) in distributors' rentals during its theatrical release in 1974 in the United States and Canada, becoming the second most popular film of that year (trailing The Sting which earned $68.5 million) and Warners' highest-grossing film of all time. Most of that money went to Warners due its use of four-wall distribution, where the studio rents the theater from the owner and thus keeps all the ticket revenue, in the initial run. It was the first time a major studio had used that practice. Warners also used some practices that had made The Godfather successful for Paramount the year before, such as making theaters commit to showing the film for at least 24 weeks.\r\nOverseas, the film earned rentals of $46 million for a worldwide total of $112.3 million ($531 million in modern dollars). It became the highest-grossing film in Japan with rentals of over $8.2 million in its first 11 weeks. After several reissues, the film has grossed $232.6 million in the United States and Canada, which when adjusted for inflation, makes it the ninth highest-grossing film of all time in the U.S. and Canada and the top-grossing R-rated film of all time. As of 2019, it has grossed $441 million worldwide, or $1.8 billion adjusted for inflation by 2014.\r\nIn Easy Riders, Raging Bulls, journalist and film historian Peter Biskind wrote about Warner's reaction to the success of the film. Executives were happy, but also nervous, since the huge earnings meant that the more free-wheeling and experimental work the studio had done would give way to finding profitable film ideas and projects.\r\nCritical response\r\nStanley Kauffmann, in The New Republic, wrote, \"This is the scariest film I've seen in years—the only scary film I've seen in years\". Arthur D. Murphy of Variety noted that it was \"an expert telling of a supernatural horror story\". In the horror-film magazine Castle of Frankenstein, Joe Dante, later director of Piranha and The Howling, called it \"an amazing film, and one destined to become at the very least a horror classic ... Suffice it to say, there has never been anything like this on the screen before\".\r\nRoger Ebert of the Chicago Sun-Times gave the film a four-star review, praising the actors (particularly Burstyn) and the convincing special effects, but concluded: \"I am not sure exactly what reasons people will have for seeing this movie; surely enjoyment won't be one ... Are people so numb they need movies of this intensity in order to feel anything at all?\"\r\nIn the middle of the range was Judith Crist. Her New York review called the film \"half-successful\". She praised Friedkin's direction, its \"to-the-point performances\" and the special effects and makeup. But she felt that Blatty had taken out what made the reader of his novel connect with the characters; he was also perhaps limited since the film could not leave things to the imagination as his book had.\r\nKael called the film \"shallowness that asks to be taken seriously\" saying its main problem was being too faithful to the novel as Blatty had intended it. Vincent Canby, writing in The New York Times, dismissed The Exorcist as \"a chunk of elegant occultist claptrap ... a practically impossible film to sit through ...stablish a new low for grotesque special effects.\" Andrew Sarris of The Village Voice complained that \"Friedkin's biggest weakness is his inability to provide enough visual information about his characters ... The Exorcist succeeds on one level as an effectively excruciating entertainment, but on another, deeper level it is a thoroughly evil film\". Rolling Stone's Jon Landau called The Exorcist \"nothing more than a religious porn film, the gaudiest piece of shlock this side of Cecil B. DeMille.\" Film Quarterly's Michael Dempsey called The Exorcist \"the trash bombshell of 1973, the aesthetic equivalent of being run over by a truck ... a gloating, ugly exploitation picture.\" The San Francisco Bay Guardian's reviewer called it \"quite simply the dumbest, most insultingly anti-intellectual movie I have ever come across\".\r\nAudience reaction\r\nOn December 26 a movie called The Exorcist opened in theatres across the country and since then all Hell has broken loose.— Newsweek, February 2, 1974, quoted in Shock Value, by Jason Zinoman\r\nAudience members screamed and ran out of the theater during the only sneak preview. When it was over, Calley and the other Warners executives, instead of leaving without comment as studio executives usually do, remained in their seats, stunned. \"What in the fuck did we just see?\" Calley asked. They believed the film was brilliant, but did not know how to market it, and decided on the limited early release after Christmas, with a trade screening on December 21. Burstyn recalled watching television the morning the film opened, seeing viewers in Montreal lining up at 4 a.m. in frigid weather. \"I thought, how can a movie have that kind of impact before it even opens? I just couldn't believe it.\"\r\nDespite its mixed reviews and the controversies over its content and viewer reaction, The Exorcist was a runaway hit. In New York City, where its initial run was limited to a few theaters, patrons endured 6 °F (−14 °C) cold, rain and sleet, waiting for hours in long lines during a normally slow time of year for the movies to buy tickets, many not for the first time. The crowds gathered outside theaters sometimes rioted, and police had to be called not only in New York but Kansas City.\r\nThe New York Times asked some of those in line what drew them there. Those who had read the novel accounted for about a third; they wanted to see if the film could realistically depict some of the scenes in the book. Another said: \"We're here because we're nuts and because we wanted to be part of the madness\". A repeat viewer told the newspaper that it was the best horror film he had seen in decades, \"much better than Psycho. You feel contaminated when you leave the theater. There's something that is impossible to erase\". Many made a point of saying they had either never waited in line that long for a movie before, or not in a long time. \"It makes the movie better,\" William Hurt, then a drama student at Juilliard, said of the experience. \"The more you pay for something, the more it's worth.\"\r\nReports of strong audience reactions were widespread. Many viewers fainted; a woman in London, when the film opened there, reportedly fainted before the film. A woman in New York was said to have miscarried during a showing. One man at another showing lasted only 20 minutes before he had to be carried out on a stretcher.\r\nNausea was frequently reported. \"We have a plumber practically living here now\", said the manager of Toronto's University Theater on Bloor Street, at the time selling its 1,440 seats out four times a day. \"The smell in the bathrooms is awful. People are rushing in and they're missing the toilet seat by inches.\" Viewers seemed to be particularly disturbed by the crucifix scenes; the theater reported depleting its supply of smelling salts. Many patrons left before the end or waited for viewing companions in the lobby; the smell of marijuana smoke was also common although the police stationed at the theater reported no arrests. A reviewer for Cinefantastique recalled the vomit in the bathroom made it impossible to reach the sinks. Some theaters were said to have provided \"Exorcist barf bags\"; while there are no contemporary reports of any even providing regular such bags, Mad magazine depicted one on the cover of its October 1974 issue, which contained a parody of the film.\r\nOther theaters arranged for ambulances to be on call; Toronto's University said it had once required four in one night. Some patrons had to be helped from places they had hidden after showings. Many audience members found the angiography to be the film's most unsettling scene Friedkin speculates that it is easier to empathize with Regan in that scene, as compared to what she suffers while possessed later in the film.\r\nSome Catholic viewers, particularly those who had lapsed in their faith, experienced spiritual crises after the film, requiring priestly attention. A man in Denver walked out of a showing into the nearby Cathedral of the Immaculate Conception half-naked and so disturbed that it took two priests, several attendants and the police to calm him down. A teenage girl in New Jersey stayed up all night with her parents saying the Rosary after seeing the film, requiring a priest's reassurance to sleep; even some priests themselves had similar issues. Many parishes reported callers who believed that they or a loved one was possessed and inquiring about an exorcism. The Rev. Richard Woods, a professor at Loyola of Chicago, said most of the calls he got were from lapsed Catholics for whom the film resurfaced their religious education prior to Vatican II. \"It stirs up memories of all those descriptions of hell that you got from nuns,\" he said.\r\nIn 1975, The Journal of Nervous and Mental Disease published a paper by a psychiatrist documenting four cases of \"cinematic neurosis\" triggered by the film. In all he believed the neurosis had been latent, surfacing from the scenes depicting Regan's possession. He recommended that treating physicians view the movie with their patient to help them identify the sources of their trauma.\r\nOther causes were suggested outside the psychiatric context. One writer at Castle of Frankenstein took note of Friedkin's pride in the movie's sound, which theaters played at maximum volume, and wondered if some of the low frequencies had induced or amplified feelings of dread or uneasiness in patrons. Another writer there blamed the reactions on the mainstream audience's general unfamiliarity with horror-movie conventions. \"We have all no doubt heard of people who stood in line for four hours to see this movie, then threw up in mid-film and walked out,\" he wrote. \"I can't say for sure, but my guess is that these people hadn't gone to see a monster movie since 1935.\"\r\n\"The Exorcist ... was one of the rare horror movies that became part of the national conversation\", wrote Zinoman almost 40 years later: \"It was a movie you needed to have an opinion about\". Three separate production histories were published. Journalists complained that coverage of the film was distracting the public from the ongoing Watergate scandal. Much of that coverage focused on the audience which, film historian William Paul wrote, \"had become a spectacle equal to the film\". Paul cited an Associated Press cartoon in which a couple trying to purchase tickets to the film was told that while the film itself is sold out, \"we're selling tickets to the lobby to watch the audience.\" He did not think any other film's audience received as much coverage as The Exorcist's.\r\nReligious response\r\n\"One of the best things that could happen is if the Pope denounces it\", Friedkin said after release. The crucifix scene, and others, involved material sacrilegious to Catholics. Officially the Church, whose influence over the content of films had declined following the demise of the Hays Office and the associated Production Code a few years earlier, had bemoaned Warners' decision to release it around Christmas. The United States Conference of Catholic Bishops' Office for Film and Broadcasting's Catholic Film Newsletter rated the film A-IV, suitable for adults only with reservations, and gave it a generally negative review that faulted the film for suggesting exorcisms were common and possibly encouraging belief in the occult and Satanism.\r\nIndividual priests familiar with the underlying theology were also critical. One who, like Karras, was a Jesuit and psychiatrist at Georgetown said that while he believed in the Devil \"there is no shred of evidence from the Bible that he can possess an individual.\" Woods, the Loyola of Chicago professor, who had written a book about the Devil, told The New York Times that Karras and Merrin were incompetent. \"They departed from the ritual in the most stupid and reckless manner,\" he said. \"They tried to fight the Demon hand to hand instead of relying on the power of God.\" Eugene Kennedy, another Loyola priest and psychologist, described the film's view of the battle of good and evil as \"immature ... Being a Christian and a mature person means coming to terms with our own capacity for evil, not projecting it on an outside force that possesses us.\"\r\nSome non-Catholics were also critical. \"Surely it is the religious people who should be most offended by this movie\", wrote Kael, incredulous that Georgetown and several priests facilitated the production:\r\nOthers can laugh it off as garbage, but are American Catholics willing to see their faith turned into a horror show? Are they willing to accept anything just as long as their Church comes out in a good light? Aren't those who accept this picture getting their heads screwed on backward?\r\nKael nonetheless described The Exorcist as \"the biggest recruiting poster the Catholic Church has had since the sunnier days of Going My Way and The Bells of St. Mary's\" since the film \"says that is the true faith, feared by the Devil, and that its rituals can exorcise demons.\" A later historian has found that the Church was not as critical of the film as reports at the time suggested, privately considering it faith-affirming. Authorities in Tunisia banned the film before its 1975 release there as \"unjustified propaganda in favor of Christianity\". In 2008, Colleen McDannell, editor of Catholics In The Movies, wrote that \"The Exorcist is a horror movie that believes in its villain and, even worse, recruits its villain as a witness to Catholic truth.\"\r\nIn February 1974, the Jesuit magazine America ran several commentaries and responses by priests to the film, some of which reiterated criticisms already made. The editors allowed Blatty to respond later that month. He praised some of the commentators' points, \"ut I am truly dismayed at the misconceptions held, not only by critics, but also defenders of the novel and film.\"\r\nThe changes to the film's ending from the novel, Blatty agreed, might have made it harder to perceive that \"the mystery of goodness\" was the theme of the work, since it appeared to many viewers, including some of those who had written in America, that the film ended with the demon triumphant through the deaths of the priests despite being exorcised from Regan. The ending of the novel made this clearer, but even in the film he saw Karras's suicide as a sacrificial act of love that reaffirmed his faith.\r\nAmerican Protestant groups also took note of the Exorcist phenomenon and its religious implications. At first their response was negative. Evangelist Billy Graham told the National Enquirer that he was afraid to watch it, saying that \"the Devil is in every frame of that film\", a remark later characterized as Graham believing the print itself was possessed. He called it \"spiritual pornography, pandering to man's innate superstition.\"\r\nThe Rev. Lester Kinsolving, an Episcopal priest who wrote a widely syndicated newspaper column on religion, chastised the Catholic Church for granting its approval, saying it did so only because its heroes were priests. The Christian Century, the leading voice of mainline Protestantism, likewise denounced the film as \"hardcore pornography a completely impossible solution\" to evil. Protestant groups around the country picketed the film and offered support to those who might be disturbed by it, distributing leaflets with church contact information to filmgoers in line.\r\nRating controversy\r\nThe Motion Picture Association of America's (MPAA) ratings board had been established several years before to replace the Motion Picture Production Code. It had already been criticized for its indirect censorship—as many as a third of the films submitted to it had had to be recut after being rated X, meaning no minors could be admitted. Since many theaters would not show such films, and newspapers would not run ads for them, the X rating greatly limited a non-pornographic film's commercial prospects.\r\nWhile Friedkin wanted more blood and gore in The Exorcist than had been in any Hollywood film before, he also needed the film to be rated R (children admitted only with an adult) to reach a large audience. He believes that part of the reason for Warners' decision to open the film in limited release was the studio's certainty that the film would be rated X. Before release, Aaron Stern, the head of the MPAA ratings board, decided to watch the film himself before the rest of the board did. He then called Friedkin and said that since The Exorcist was \"an important film\", he would allow it to receive an R rating without any cuts.\r\nSome critics, both anticipating and reacting to reports of the film's effect on children who had been taken to see it, questioned the R rating. Roy Meacham, a Washington, D.C.-based critic for Metromedia television stations who had praised the film, wrote in The New York Times in February 1974 that his station repeated for several days his warning that children should not be allowed to see it even with an adult. Nevertheless, some had, and he had heard of one girl being taken from the theater in an ambulance.\r\nThe film had drawn strong interest in Washington since it was a rare film set in the area that did not involve government activity. The children Meacham saw leaving showings, he recalled, \"were drained and drawn afterward; their eyes had a look I had never seen before\". He suggested that the ratings board had yielded to pressure from Warner's, and was skeptical of MPAA head Jack Valenti's claims that since the film had no sex or nudity, it could receive an R. After a week in Washington's theaters, Meacham recalled, authorities cited the crucifix scene to invoke a local ordinance that forbid minors from seeing any scenes with sexual content even where the actors were fully clothed; police warned theaters that staff would be arrested if any minors were admitted to see The Exorcist.\r\n\"The review board surrendered all right to the claim that it provides moral and ethical leadership to the movie industry\", Meacham wrote. He feared that communities across the country would feel it necessary to pass their own, perhaps more restrictive, laws regarding the content of movies that could be shown in their jurisdictions: \"For if the movie industry cannot provide safeguards for minors, authorities will have to.\" In The New Yorker, Kael echoed his insinuations that the board had yielded to studio pressure in rating the film R: \"If The Exorcist had cost under a million or been made abroad, it would almost certainly be an X film. But when a movie is as expensive as this one, the doesn't dare give it an X\". Ebert, who had favorably reviewed the film, found the special effects unusually graphic and wrote: \"That it received an R rating and not the X is stupefying.\"\r\nTwo communities, Boston and Hattiesburg, Mississippi, attempted to prevent the film from being shown in their jurisdictions. A court in the former city blocked the ban, saying the film did not meet the U.S. Supreme Court's standard of obscenity. Nonetheless, in Boston the authorities told theaters they could not admit any minors despite the R rating. In Mississippi, the theater chain showing the movie was convicted at trial, but the state's Supreme Court overturned the conviction in 1976, finding that the state's obscenity statute was too vague to be enforceable in the wake of the Supreme Court's 1972 Miller v. California decision which laid down a new standard for obscenity.\r\nThere was also concern that theaters were not strictly enforcing the R rating, or disregarding it, allowing unaccompanied minors to view the film. Times critic Lawrence Van Gelder reported that a 16-year-old girl in California said that not only was she sold a ticket to see the film unaccompanied, others who seemed even younger were able to do so. On the other hand, another Times writer, Judy Lee Klemesrud, said she saw no unaccompanied minors, and indeed very few minors, when she went to see the film in Manhattan. Nevertheless, \"I think that if a movie ever deserved an X rating simply because it would keep the kids out of the theater, it is The Exorcist\".\r\nIn 1974, Stern's tenure as chairman of the MPAA ratings board ended. His replacement, Richard Heffner, asked during the interview process about films with controversial ratings, including The Exorcist, said: \"How could anything be worse than this? And it got an R?\" After he took over as head, he would spearhead efforts to be more aggressive with the X rating, especially over violence in films.\r\nViewing restrictions in United Kingdom\r\nThe Exorcist was released in London in March 1974. It drew protests around Britain from the Nationwide Festival of Light (NFL), a Christian public action group concerned with the influence of media on society, and especially on the young. Members of local clergy and concerned citizens handed out leaflets to those queuing to see the film, offering spiritual support afterwards. A letter-writing campaign to local councils by the NFL led many to screen The Exorcist before permitting it to be shown in their districts. It was thus banned in some areas, such as Dinefwr Borough and Ceredigion in Wales.\r\nThe Exorcist was available on home video from 1981 in the UK. After the passage of the Video Recordings Act 1984, the film was submitted to the British Board of Film Classification for a home video certificate. A majority voted to grant it but James Ferman, the board's director, vetoed them. He believed that, even with a proposed 18 certificate, the film's notoriety would lead underage viewers to seek it out. As a result, all video copies of The Exorcist were withdrawn in the UK in 1988 and could not be purchased for 11 years.\r\nFollowing a successful 1998 theatrical re-release, the film was submitted for home video release again in 1999. It was passed uncut with an 18 certificate, signifying a relaxation of the censorship rules for home video in the UK, in part due to Ferman's departure. Channel 4 showed The Exorcist on UK broadcast television for the first time in 2001.\r\nAfter release\r\nThe Exorcist set box office records that stood for many years. For almost half a century it was the top-grossing R-rated horror film. In 1999, The Sixth Sense finally bested The Exorcist as the highest-grossing supernatural horror film; it remains in third place. On both charts The Exorcist, along with The Blair Witch Project, are the only 20th-century releases in the top 10.\r\nSince its release, The Exorcist's critical reputation has grown. According to the review aggregator website Rotten Tomatoes, 84% of critics have given the film a positive review based on 84 reviews, with an average rating of 8.30/10. At Metacritic, which assigns and normalizes scores of critic reviews, the film has a weighted average score of 82 out of 100 based on 20 critics, indicating \"universal acclaim\". Chicago Tribune film critic Gene Siskel placed it in the top five films released that year. BBC film critic Mark Kermode believes The Exorcist to be the best film ever made.\r\nDirector Martin Scorsese placed The Exorcist on his list of the 11 scariest horror films. Other filmmakers, including Stanley Kubrick, Robert Eggers, Alex Proyas and David Fincher also have cited The Exorcist as a favorite film. In 2008, the film was selected by Empire as one of The 500 Greatest Movies Ever Made. The New York Times put it on a similar list of a thousand films . John Carpenter listed The Exorcist as one of his top eight scariest horror classics and listed the film as an influence in his 1980 supernatural horror film The Fog.\r\nWhen the film was re-released theatrically in 2000, some critics wondered whether it would affect contemporary audiences, since it had been so widely imitated and emulated. The Hartford Courant's Malcolm Johnson described it as a \"somewhat creaky antique ... in some ways, feels a little old hat in 2000.\" Some scenes, such as Ritalin being proposed as a treatment for Regan, provoked unintended laughter. But the film's performances were still effective, and the longer version made the medical professionals seem like \"witch doctors\".\r\nBut the Tribune found it \"even better than it was in 1973 ... it actually seems a deeper movie now.\" Friedkin, who had seemed an odd choice to direct at the time, now seemed to have been the best. \" made the story real—and more terrifying\", critic Michael Wilmington wrote. \" knows how to make the improbable real, how to convey a convincing atmosphere of modern chaos and dread.\"\r\nThemes\r\nThe Exorcist's box office success led critics and academics to consider its social resonance. Many have mentioned popular anxiety over the aftermath of the cultural, political and social upheavals of the late 1960s. \"The Exorcist communicates an image of a United States in an unstable state of change that can no longer avoid its real and historical systemic evils\", writes Amy Chambers. Kermode similarly noted that by stylistically distancing itself from the more Gothic horror films of the 1960s, the film \"presented a credible portrait of the modern urban world ripped apart by an obscene, ancient evil.\"\r\nStephen King calls The Exorcist \"a social horror film if there ever was one\" in his 1983 treatise on the genre, Danse Macabre. He sees the possessed Regan symbolizing for middle-aged viewers the outspoken youth protesting the Vietnam War, Danny Peary likewise notes the symbolic and real fragmentation throughout the film: \"With the world in such disorder, the Devil can make a dramatic entrance.\"\r\nAt the time of the film's release, the Watergate scandal, at the top of the news, was worsening, implicating President Richard Nixon. \"Maybe, between that and Vietnam, people were newly awake to a certain kind of pervading societal rot, something that the spectacle of The Exorcist might've mirrored\", wrote Tom Breihan for The A.V. Club in 2019. In a Christian Century article a year after the film's release, during which time Nixon had resigned, theologian Carl Raschke connected the two, calling them \"psychodramas of the American soul\" resulting from \"the cynical mood of our age by default from the wreck of traditional religious as well as social values.\"\r\nFeminism has gotten considerable attention in discussions of The Exorcist. The U.S. women's liberation movement had enjoyed some early gains in legislatures and courts, and commentators have seen the film, in which a single working mother and her apparently uncontrollable daughter are ultimately rescued by patriarchal authority, as a reaction against feminism. Former studio executive Peter Biskind, in Easy Riders and Raging Bulls, describes the film as \"a male nightmare of female puberty. Emergent female sexuality is equated with demonic possession.\" For the male authority figures in The Exorcist, whether priests or physicians, Regan must be restored to her innocence through abusive and violent means if necessary, the aspect of the film that he notes led John Boorman to decline it.\r\nBreihan reads the film itself as reactionary: \"The Exorcist seems like a transgressive work of art, but it's built on reverence of tradition\" he writes. \" almost sneers at the politics of the ’60s.\" Chris dismisses her film's take on student protest as \"the Walt Disney version of the Ho Chi Minh story\". In the only scene she is shown shooting, her character, a faculty member at the fictional college, grabs a megaphone and counsels a group of protesters against taking over the building, telling them change can only come from the system.\r\nMany feminist critics, like Biskind, note the film's focus on the female body as the site of horror. \"When her body changes, Regan becomes someone else; someone sexual, whose desire is a dark visitor, hollowing her out and corrupting her from within\" writes Jude Ellison Doyle in Dead Blondes and Bad Mothers: Monstrosity, Patriarchy and the Fear of Female Power. \"To become a woman is to become the worst thing on Earth, the enemy of all that is pure or holy.\" But Australian film studies professor Barbara Creed, in The Monstrous-Feminine, which inaugurated psychoanalytic feminist film theory, counters the prevailing feminist take on The Exorcist by insisting that Pazuzu is female and thus the possession of Regan is itself a feminist act, exposing \"the inability of the male order to control the woman whose perversity is expressed through her rebellious body\", as she navigates an incestuous desire for her mother.\r\nUniversity of Toronto professor S. Trimble writes that the film tapped into \"white American fears of nightmare futures\" that could be brought about by the women's liberation, gay liberation and Black Power movements, which all challenged the established social order of the 1970s. As a film about \"a revolting girl revolting against the little-girl box in which she was stuck\" and army of men trying to put her back, The Exorcist fits into a tradition of horror movies that used gender-bending to create a monster, Trimble notes.\r\nTexas State religious studies professor Joseph Laycock wrote that the popular embrace of The Exorcist also pointed to reactionary popular trends in American religion. \"The Exorcist is a depiction not of ecclesiastical Catholicism but of folk piety\", which he also describes as extra-ecclesiastical religion, pursued by the lay masses, \"incorporat beliefs about divine or supernatural intervention in the realm of everyday experience\", as tolerant of Ouija boards and practices from other spiritual traditions as it was devout in its Catholic faith. In the early 1970s, established organized religion in America had increasingly turned towards the rational as the country became more secular: \"The authentic folk piety depicted in The Exorcist likely appealed to audiences because it was a welcome alternative to rationalized religion and a cultural myth of universal secularization.\"\r\nLitigation\r\nLawsuits among the creators of The Exorcist began before the film was released, and continued into the 21st century. In early November 1973, THR reported that Blatty had sued the studio and Friedkin, over both the credits and Friedkin banning him from the set. Friedkin said he had only barred him from post-production. A week later executive producer Noel Marshall said Blatty had withdrawn his complaint against the studio; he eventually settled for the \"William Peter Blatty's The Exorcist\" line in the opening credits.\r\nThe next dispute involved Friedkin and Dietz. In February 1974 she claimed that he had made her sign a nondisclosure agreement concerning her work in the film. While Friedkin had, in earlier publicity for the film, denied any use of a double for Blair, by the end of the month Dietz was saying that she had neither claimed to have been Blair's only double for the possession scenes nor talked about it to the media. The Screen Actors Guild ruled her contract was not binding, but then Dietz declined to arbitrate the matter.\r\nAround the same time, Warners paid Friedkin $4 million, his 10 percent share of the film's profits. A year later, he sued the studio, claiming it had withheld another $8.5 million he was due. By 1978 it was reported that Friedkin had settled. Blatty had by then sued Warners, claiming he was owed $1.5 million.\r\nIn 2001, following the release of the extended version, which restored 11 minutes of footage and did well critically and commercially, Blatty and Friedkin sued Warners, alleging that they had been cheated out of profits they would receive for helping promote the film. Specifically, they had been induced to do so by a promise of a share of the sale of the cable TV rights, which the studio gave to Turner Network Television and Turner Broadcasting System. Warners called the suit \"ludicrous\" Later that year, they sued again, alleging that Warners had further defrauded them by selling broadcast rights to CBS at a discount, through claiming itself as the sole author of the new version of the film when registering it with the U.S. Copyright Office and by failing to honor an oral profit-sharing agreement with Friedkin.\r\nNine years later, Blatty sued Warners again, asking for the opportunity to inspect the studio's records and accounts, to see whether he had been paid what he was owed. He argued that his deal with the studio made him a co-owner of the film property and thus he had unique rights to access those records. \" has asserted that Blatty must 'stand in line' with profit participants in other works who seek to audit,\" his complaint read, \"but who do not share Blatty's status as a co-owner.\"\r\nCopyright infringement claims\r\nWithin a year of The Exorcist's release, two films were made that appeared to appropriate elements of its plot or production design. Warners took legal action against the producers of both, accusing them of copyright infringement. One of the films was pulled from distribution and the other one had to change its advertisements.\r\nAbby, released almost a year after The Exorcist, put a blaxploitation spin on the material. In it a Yoruba demon released during an archeological dig in Africa crosses the Atlantic Ocean and possesses the archaeologist's daughter at home in Kentucky. Director William Girdler acknowledged the movie meant to cash in on the success of The Exorcist. Warner's lawsuit early in 1975 resulted in most prints being confiscated; the film has rarely been screened since and is not available on any home media.\r\nLater, in 1975, Warners sued Film Ventures International (FVI) over Beyond the Door, also released in late 1974, alleging that its main character, also a possessed woman whose head spins around completely, projectile vomits and speaks with a deep voice when possessed, infringing the studio's copyright on Regan. Federal judge David W. Williams of the Central District of California held first that since Blatty had based the character on what he was told was a true story, Regan was not original to either film and thus Warner could not hold a copyright on Regan. Even if she had been a creation, she could not be copyrighted since she was subordinate to the story. The writers of the FVI film had also further distanced themselves from an infringement claim by having their possessed female, Jessica, be a pregnant adult woman.\r\nWilliams held for Warners on a minor issue. Some of Beyond the Door's advertising graphics, such as an image of light coming from behind a door into a darkened room, and the letter \"T\" drawn as a Christian cross, were similar enough to those used to promote The Exorcist that the public could reasonably have been confused into thinking the two films were the same, or made by the same people, and enjoined FVI from further use of those graphics.\r\nLegacy\r\nEffect on films and industry\r\n\"The Exorcist has done for the horror film what 2001 did for science fiction\", wrote Cinefantastique, \"legitimizing it in the eyes of thousands who previously considered horror movies nothing more than a giggle\". In the years following it, studios allotted large budgets to horror films with similar themes like The Omen, The Sentinel, Burnt Offerings, Audrey Rose and The Amityville Horror. Many had major stars, who until then had often avoided the genre until their later years. Friedkin's use of works like Polymorphia in the score also led to the use of similar modern avant-garde composers like Penderecki in later horror films like The Shining. Composers of original music for those films adopted some of their techniques, like dissonant intervals such as (particularly) tritones, sound massing and tone clusters, to create unease and tension.\r\nThe film's success led Warner to initiate a sequel, one of the first times a studio had done that with a major film not planned to have one, launching a franchise. While many of the classic horror films of the 1930s had spawned series of films, the practice had declined in the 60s. Also, with exceptions like Bride of Frankenstein, most sequels had been secondary properties for the studios. The other big-budget horror films made in the wake of The Exorcist also led to sequels and franchises.\r\nAmy Chambers observes that Friedkin set a precedent not only by extensively consulting with technical experts in the subject matter, in The Exorcist's case physicians and priests, but foregrounding that reliance on expertise by including those experts' names and credentials in the film's credits and press kit, a practice now common.\r\nCultural reference point\r\nThe Exorcist has become a cultural reference point. Its imagery, particularly Regan in her bedroom, has been used by political cartoonists like Mike Luckovich and Mike Peters. In 1998, New York Times columnist Maureen Dowd invoked the film when criticizing the nation's apparent indulgence of President Bill Clinton's sexual indiscretions: \"eople are saying things so bizarre they could have come out of Linda Blair in The Exorcist. ... You expect the feminists' heads to start rotating on their necks any moment now.\"\r\nFather Merrin's arrival scene has also been referenced. In an early episode of the 1982-83 CBS sitcom Square Pegs, Don Novello, as his Saturday Night Live (SNL) character Father Guido Sarducci, enters a classroom, similarly backlit amidst fog, in order to exorcise a character from possession by the Pac-Man video game. In an episode set on Halloween 2019, a first-season episode of Evil, another CBS series, paid homage to the scene by a meticulous recreation in which the black-clad character stepping out of a cab into a beam of light from an upstairs window at the home of a possibly possessed woman is a psychiatrist, not a priest.\r\nIn 1992, the hard rock band Pantera named its sixth studio album Vulgar Display of Power, from the possessed Regan's demurral when Karras asks why, if the possessing spirit is indeed the Devil, she would continue asking him to remove the straps on her arms rather than making them disappear. The title was reused for a book about the band's adventures on tour culminating in the onstage shooting death of guitarist Dimebag Darrell.\r\nPopular comedy took inspiration from the film. SNL parodied the film during its first season, with Richard Pryor in the Karras role and Laraine Newman as Regan. In 2023, the show again parodied the film, with Jenna Ortega in the Regan role. Ghostbusters, the 1984 comedy blockbuster, included joking references to many successful horror movies from the previous two decades, including The Exorcist. In one scene, Sigourney Weaver's character has become possessed by an evil spirit; as Bill Murray's character attempts to communicate with her she begins to speak with a deep, husky voice and levitates above her bed. In 1990, Blair starred as a housewife needing exorcism in the parody Repossessed.\r\nCourt opinions in cases unrelated to the film have referenced it. In 1999, Massachusetts federal judge Reginald C. Lindsay, considering a product-disparagement suit brought by Gillette against competitor Norelco, noted that in one of the latter's commercials for its Reflex Action shaver \"the razor corrodes and twists its 'neck and head,' apparently in an effort to evoke recollection of a scene from the motion picture The Exorcist. At the same time, the voiceover states: 'A blade can leave you feeling irritated. What would possess it to do that?'\" A Colorado lawyer challenging his 2005 suspension from the bar admitted his own recorded voice on obscene phone messages he left his wife while under the influence of cocaine sounded like the possessed Regan. Litigants have made similar observations about people experiencing mental illness.\r\nReligious wariness toward the film abated as it became accepted as a classic. \"The Exorcist exposed people around the world to the question of evil in a new and terrifying way\", wrote Jesuit Jim McDermott in a 2019 issue of America. \"It is a film that takes on big questions and aspires to do much more than shock.\" In the heavily Baptist South, The Exorcist was seen as acceptable viewing amid denunciations of many other horror films that supposedly promoted the occult, because, as a writer in Slate recalls, it and movies like The Omen \"didn't encourage people to dabble in the dark arts, they warned people. More to the point, they acknowledged the existence of God, the influence of Satan, and the truth of the Bible.\" British Baptist minister Peter Laws has credited the film with persuading him to abandon his youthful atheism and become a Christian:\r\nThe Exorcist, like many other horror films I loved, took the supernatural seriously. It presented a world in which devils and demons weren't metaphors ... they were a stark, terrifying reality. Plus, it suggested another whacky idea: that God might be the only truly effective answer to evil ... This film, and the thousands I watched after it, forced me to consider an utterly subversive notion: that God might be real and the church might sometimes be filed under \"solution\", not \"problem\" ... after a long road of thought, I took the step that changed my life: I became a Christian\r\nIn 2015, the District of Columbia posted a commemorative plaque on what had become known as the Exorcist steps in Georgetown, since they had become a popular tourist attraction. At a ceremony the day before Halloween that year, Blatty and Friedkin were among those present as the plaque, with Mayor Muriel Bowser's signature, was unveiled. Friedkin said that having his name on the plaque was a greater honor than another Academy Award would have been, since \"the Academy may come and go. Its importance has been diminished over the years anyway. But that plaque on those steps is going to be there for a very long time.\"\r\nVietnamese-born Danish artist Danh Võ saw The Exorcist with his family after his Catholic mother became interested in horror films following the family's journey from Vietnam to Europe after the war. He was seven at the time. In 2016, he developed an exhibit inspired by the film that, other than the title, a string of 266 obscene phrases shouted by the possessed Regan to Karras, does not visually reference the film. The White Cube gallery in Hong Kong, which showed it, describes it as 600 carved mammoth fossils and a 17th-century ivory figurine suspended from the gallery's ceiling.\r\nAccolades\r\nThe Exorcist won two of its 10 Academy Awards nominations. It was the first horror film to be nominated for Best Picture. It won four of seven Golden Globe nominations, including Best Motion Picture – Drama.\r\nRobert Knudson and Chris Newman won The Exorcist's first Oscar, for Best Sound, thanking Friedkin, the studio and their crews. Blatty won for Best Adapted Screenplay; the award was presented by Angie Dickinson and Miller, who applauded Blatty vigorously. In his short speech, Blatty posthumously thanked William Bloom, \"who taught me the rudiments and the craft of screenwriting\" and Friedkin. He also paid tribute to his parents, \"who came to this country on a cattle boat and whose love and whose courage have brought me to this moment and to this place.\"\r\nThe next morning, Blatty complained bitterly about the film's snubbing. In commentary on the front page of The Hollywood Reporter (THR), he said it was a \"disgrace\" that The Exorcist had not won all the awards it was nominated for. It was, he asserted, \"head and shoulders, the finest film made this year and in many other years\".\r\n\"Since I won an award, perhaps it would be considered ungracious,\" he admitted to THR. \"But I'd rather be ungracious than be a hypocrite.\" He accused veteran director George Cukor of having led a campaign against giving the film any awards.\r\nAmerican Film Institute Lists\r\nAFI's 100 Years...100 Thrills – No. 3\r\nAFI's 100 Years...100 Heroes and Villains: Regan MacNeil – No. 9 Villain\r\nRegan MacNeil – No. 9 Villain\r\nSequels and prequels\r\nThe film has gone on to spawn multiple sequels and an overarching media franchise including a television series.\r\nA year after The Exorcist's release, New York reported that a sequel was planned, with Friedkin producing and Blatty uninvolved. Friedkin backed out, as did the cast except Blair and von Sydow. John Boorman, who had turned down the original as \"negative and destructive\", directed, considering the sequel to be \"healthy\" by comparison. Richard Burton played the lead; the film also suffered production problems, particular cast and crew health issues, and was beset by regular script rewrites and personnel changes. On release in 1977, Exorcist II: The Heretic had what was then Warners' largest opening-day gross. It made some money but was less successful than the original.\r\nAfterward, Blatty and Friedkin began planning a story and script for a sequel of their own. Blatty continued after Friedkin dropped out and developed the story as a novel: Legion, in 1983, after Hollywood showed little interest. He saw it as an exploration of the same themes within the same fictional universe by some of the original's minor characters. The media saw it as a sequel, and it sold well.\r\nBlatty adapted a more streamlined script from the novel, which Morgan Creek Productions insisted on calling it The Exorcist III despite the lack of exorcism scenes (one was added after principal photography, with Nicol Williamson in the role). Blatty directed, with George C. Scott replacing the late Lee J. Cobb as Kinderman. The film took in $39 million on its release in 1990;\r\nExorcist: The Beginning and Dominion\r\nMorgan Creek and James G. Robinson, producer of Exorcist III, had commissioned the development of a prequel story about a young Father Merrin's first confrontation with Pazuzu. It was not produced until 2002, with Paul Schrader directing and Stellan Skarsgård in the lead.\r\nRobinson hired Renny Harlin to reshoot most of the film with Skarsgård and a new cast after disagreements with Schrader. Harlin's version, heavy on action and horror, was released in August 2004 as Exorcist: The Beginning, and failed critically and commercially. Schrader's version got a limited release in May 2005 as Dominion: Prequel to the Exorcist, a version Blatty found much better.\r\nTV series\r\nThe 2016 Fox TV series The Exorcist followed two priests investigating possible cases of demonic possession and performing exorcisms. In the fifth episode one guest character was revealed as the adult Regan, making the series a direct sequel to the original film. It was cancelled after its second season.\r\n2020s reboot trilogy\r\nIn 2020, Morgan Creek announced a reboot of the film. Fans petitioned to have it canceled. At the end of the year, Blumhouse Productions and Morgan Creek said that the reboot would instead be a \"direct sequel\" to the 1973 film directed by David Gordon Green. In July 2021, it was announced that Green would direct a trilogy produced by Jason Blum alongside James and David Robinson. Burstyn will reprise her role from the original film, with Leslie Odom Jr. co-starring. The projects will be joint ventures between Blumhouse and Morgan Creek, to be distributed by Universal, which joined with Peacock to purchase distribution rights for $400 million. The second and third films are being optioned as Peacock exclusive films; As of August 2022, theatrical release for the first film, The Exorcist: Believer, is scheduled for October 13, 2023.\r\nRelated works\r\nBlatty's script for the film has been published in two versions. William Peter Blatty on The Exorcist: From Novel to Film, in 1974, included the first draft of the screenplay. In 1998 the script was anthologized in The Exorcist/Legion - Two Classic Screenplays, and again as a standalone text in 2000.",
    "html": "<p>The Exorcist is a 1973 American supernatural horror film directed by William Friedkin from a screenplay by William Peter Blatty, based on his 1971 novel of the same name. The film stars Ellen Burstyn, Max von Sydow, Jason Miller, and Linda Blair. The story follows the demonic possession of a young girl and her mother's attempt to rescue her through an exorcism by a pair of Catholic priests.</p><p>Blatty, who also produced, and Friedkin, his choice as director, had difficulty casting the film. Their choice of relative unknowns Burstyn, Blair, and Miller, instead of major stars, drew opposition from Warner Bros. Pictures executives. Principal photography was also difficult, taking place in both hot deserts and refrigerated sets. Many cast and crew were injured, some died, and unusual accidents delayed shooting. Production took twice as long as scheduled and cost almost three times the initial budget; the many mishaps have led to a belief that the film was cursed.</p><p>The Exorcist was released in 24 theaters in the United States on December 26, 1973. Reviews were mixed, but audiences waited in long lines during winter weather; the sold-out shows were even more profitable for Warner, since they had booked it into those theaters under four wall distribution rental agreements, the first time a major studio had done that. Some viewers suffered adverse physical reactions, fainting or vomiting to shocking scenes such as a realistic cerebral angiography. Many children were allowed to see it, leading to charges that the MPAA ratings board had accommodated Warner by giving the film an R rating instead of the X rating to ensure the troubled production its commercial success. Several cities attempted to ban it outright or prevent children from attending.</p><p>The cultural conversation around the film helped it become the first horror film to be nominated for the Academy Award for Best Picture, as well as nine others. Blatty won Best Adapted Screenplay, while the sound engineers took Best Sound. It has had several sequels and was the highest-grossing R-rated horror film (unadjusted for inflation) until It. The Exorcist has had a significant influence on popular culture and several publications regard it as one of the greatest horror films ever made. In 2010, the Library of Congress selected The Exorcist to be preserved in its National Film Registry, citing it as \"culturally, historically, or aesthetically significant\".</p><br/><h3>Plot</h3><h4>Theatrical cut</h4><p>In northern Iraq, the adhan, the Islamic call to prayer, is heard. Catholic priest and archaeologist Lankester Merrin unearths a medallion of Saint Joseph and an artifact representing Pazuzu, an ancient demon. As Merrin prepares to leave Iraq, he sees a large statue of Pazuzu, and two dogs fighting.</p><p>In the Washington, D.C., neighborhood of Georgetown, actress Chris MacNeil stars in a film directed by her friend Burke Dennings. MacNeil rents a well-appointed house with servants and her 12-year-old daughter Regan. Father Damien Karras, a psychiatrist who counsels Georgetown University priests, visits his ailing mother in New York. He confides to a colleague that he feels unfit in his role, citing a crisis of faith. Chris hears noises in the attic, and Regan attributes them to her imaginary friend, \"Captain Howdy\". In a local church, a statue of Mary is found desecrated.</p><p>Chris hosts a party. Karras' friend Father Dyer explains Karras' role as counselor, mentioning that his mother died recently. Regan appears and urinates on the carpet. After Chris puts Regan to bed, her bed shakes violently. Dyer consoles Karras, and Karras expresses guilt at not having been with his mother when she died. Karras dreams of his mother, a Saint Joseph medallion and—briefly—a demonic face.</p><p>Regan becomes violent. She is subjected to several medical tests which find nothing physically wrong with her. During a house call, a demon possesses Regan's body; the possessed Regan exhibits abnormal strength. One night, Chris finds the house empty except for a sleeping Regan. Dennings is found dead at the foot of an outdoor staircase beneath Regan's window. Homicide detective William Kinderman questions Karras, confiding that Dennings' head was turned backwards.</p><p>Regan's condition worsens as her body becomes covered with sores. A doctor mentions exorcism as a remote option, suggesting a possible psychological benefit. Kinderman visits Chris, explaining that the only plausible explanation for Dennings' death is that he was pushed from Regan's window. As Kinderman leaves, the possessed Regan stabs her genitals with a crucifix. To Chris's horror, the possessed Regan turns her head backwards and speaks in Dennings' voice. Regan is confined to her bedroom.</p><p>Chris seeks out Karras, who visits Regan. Over two meetings, the possessed Regan claims to be the Devil himself, projectile vomits into Karras's face, speaks in tongues, and reacts violently when tap water is sprinkled on her, which Karras had claimed was holy water—a point against genuine possession. The demon says it will remain in Regan until she is dead. Desperate, Chris confides that the possessed Regan killed Dennings. At night, Chris's assistant calls Karras to the house. They witness the words \"help me\" materialize on Regan's skin. Still ambivalent, Karras concludes that an exorcism is warranted. His superior grants permission on the condition that an experienced priest lead the ritual while Karras assists. Merrin, having performed an exorcism before, is summoned.</p><p>Merrin arrives at the house, warning Karras that the demon attacks psychologically. As the priests read from the Roman Ritual, the demon curses them. It focuses on Karras, verbally attacking his loss of faith and guilt over his mother's death. The priests rest momentarily and Merrin, shaking, takes nitroglycerin. Karras enters the bedroom where the demon appears as his mother. Showing weakness, Karras exclaims that the demon is not his mother. Merrin excuses Karras and continues the exorcism by himself. Karras assures Chris that Regan will not die and re-enters the room, finding Merrin dead. Enraged, Karras beats the possessed Regan and demands that the demon take him instead. The demon rips a medallion of Saint Joseph from Karras' neck and begins to possess him, freeing Regan. Karras hurls himself out the window, tumbling down the stairs outside. Chris and Kinderman enter the room. Chris embraces the healed Regan, and Kinderman surveys the scene. Outside, Dyer administers the dying Karras last rites.</p><p>The MacNeils prepare to leave, and Father Dyer says goodbye. Despite having no memory of her ordeal, Regan is moved by the sight of Dyer's clerical collar to kiss him on the cheek. As the MacNeils leave, Chris gives Dyer the medallion found in Regan's room.</p><h4>Director's cut ending</h4><p>At the end of the 2000 re-release, when Chris gives Karras' medallion to Dyer, Dyer returns it and suggests that she keep it. After she and Regan drive away, Dyer pauses at the top of the stone steps before walking away and coming across Kinderman, who narrowly missed Chris and Regan's departure; Kinderman and Dyer begin to develop a friendship.</p><br/><h3>Cast</h3><ul><li>Ellen Burstyn as Chris MacNeil</li><li>Max von Sydow as Father Lankester Merrin</li><li>Lee J. Cobb as Lieutenant William F. Kinderman</li><li>Kitty Winn as Sharon Spencer</li><li>Jack MacGowran as Burke Dennings</li><li>Jason Miller as Father / Dr. Damien Karras, S.J.</li><li>Linda Blair as Regan MacNeil</li><li>Father William O'Malley as Father Joseph Dyer</li><li>Barton Heyman as Dr. Samuel Klein</li><li>Peter Masterson as Dr. Barringer</li><li>Rudolf Schündler as Karl, House Servant</li><li>Gina Petrushka as Willi Engstrom</li><li>Robert Symonds as Dr. Taney</li><li>Arthur Storch as The Psychiatrist</li><li>Father Thomas Bermingham as Father Tom Kanavan, President of Georgetown University</li><li>Vasiliki Maliaros as Mrs. Karras, Damien's Mother</li><li>Titos Vandis as John, Damien's Uncle</li><li>John Mahon as Language Lab Director</li><li>Wallace Rooney as Bishop Michael</li><li>Ron Faber as Chuck and The Voice of Pazuzu</li><li>Donna Mitchell as Mary Jo Perrin</li><li>Dick Callinan as Captain Billy Cutshaw</li><li>Roy Cooper as Jesuit Dean</li><li>Robert Gerringer as Senator at Party</li><li>Mercedes McCambridge as The Voice of Pazuzu</li><li>William Peter Blatty as Fromme, The Producer (uncredited)</li><li>Paul Bateson as Radiologist's Assistant (uncredited)</li><li>Elinore Blair as Nurse (uncredited)</li><li>Barton Lane as Angiography Doctor (uncredited)</li><li>Eileen Dietz as The Face of Pazuzu (uncredited)</li><li>Ann Lane as Spiderwalk (uncredited)</li></ul><br/><h3>Production</h3><h4>Development</h4><p>Aspects of Blatty's novel were inspired by the 1949 exorcism performed on a boy known as \"Roland Doe\" or \"Robbie Mannheim\" by Jesuit priest William S. Bowdern. Despite the publisher's high expectations, it sold poorly until Blatty appeared on The Dick Cavett Show to discuss the book and captivated the audience with discussions of whether the devil existed. Soon afterwards the novel was atop the New York Times best seller list.</p><p>Despite Blatty's previous screenwriting experience on Blake Edwards' films, studios had generally been uninterested in adapting The Exorcist before its publication. Lew Grade made a modest offer for the rights that Blatty said later he would have accepted due to his difficult financial circumstances, but for his requirement that he produce. Shirley MacLaine, a friend of Blatty's on whom he had based the Chris McNeil character, to the point of using some things she had once said as dialogue, had been interested. The deal broke down over Blatty's insistence on producing; a later agreement to co-produce with Paul Monash, producer of Butch Cassidy and the Sundance Kid, also collapsed over differences over the script and Blatty's discovery that Monash was trying to wrest control of the film from him.</p><h4>Writing</h4><p>Blatty's screenplay follows the plot of his novel closely, but narrows the story's focus. Subplots like the desecration of the churches (and the relationship between Karras and Kinderman that develops from the latter's investigation), Karras's efforts to get the Church bureaucracy to approve the exorcism, and the ongoing medical investigations of Regan's condition, are less prominent in the film, as are supporting characters such as Chris's household staff, Dennings, and Regan's father. The overall time frame is condensed.</p><p>Some scenes, particularly those with sexual content, were toned down for the movie since an actress of approximately Regan's age was expected to be cast. The scene where Regan masturbates with a crucifix was, in the book, more prolonged and explicit, with Regan seriously injuring herself yet attaining orgasm. The film also excludes the detail from the book of the possessed Regan experiencing constant diarrhea, giving her room a strong foul odor.</p><p>Blatty also made the screenplay unambiguous about Regan's condition. In his novel every symptom and behavior she exhibits that might indicate possession is counterbalanced with a reference to an actual case where the same phenomena were found to have natural, scientific causes. Beyond Karras' initial professional skepticism, that perspective is absent from the film.</p><h4>Casting</h4><p>The lead roles, particularly Regan, were not easily cast. Although many major stars of the era were considered for them, with Stacy Keach initially signed to play Father Karras, Blatty and Friedkin ultimately went with lesser-known actors, to the studio's consternation.</p><h4>Chris and Father Karras</h4><p>Jack Nicholson was considered for Karras, and Paul Newman interested, before Blatty hired Stacy Keach. Three A-list actresses of the time were considered for Chris. Audrey Hepburn said she would take the role but only if the movie could be shot in Rome, where she was living, which was too problematic. Anne Bancroft was pregnant and willing only if production could start after she gave birth; Friedkin could not wait that long. Jane Fonda, next on the list, purportedly derided the film and turned it down.</p><p>Blatty suggested his friend Shirley MacLaine; Friedkin was hesitant to cast her, since she had starred in 1970's The Possession of Joel Delaney. After meeting Carol Burnett, Friedkin believed she had the range beyond her comic television persona, and Blatty agreed, but the studio turned her down. Ellen Burstyn received the part after she telling Friedkin she was \"destined\" to play Chris, discussing the Catholic upbringing she had later rejected. Studio head Ted Ashley vigorously opposed casting her, dramatizing his ultimatum that it would be \"over my dead body\" by making Friedkin walk over him as he lay on the floor, then grabbing the director's leg and telling him he would come back from the dead if necessary to stop him. Ashley relented after no other alternatives emerged.</p><p>With Burstyn now set, Jason Miller called Friedkin. They had previously spoken after a performance of Miller's play That Championship Season about the lapsed Catholicism in it, as background for the film. Miller had read a copy of the novel Friedkin left him, and told the director \" is me\". Miller had had a Catholic education, studied to be a Jesuit priest himself for three years at Catholic University of America (also in Washington) until experiencing a spiritual crisis similar to Karras's. Friedkin thanked him for his interest but told him Keach had already been signed.</p><p>Miller, who had acted only on stage, asked for a screen test. Friedkin had the playwright and Burstyn do the scene where Chris tells Karras she thinks Regan might be possessed. Afterwards, he had Burstyn interview Miller about his life with the camera focusing on him from over her shoulder, and finally asked Miller to say Mass as if for the first time. Burstyn felt Miller was too short for the part, unlike her boyfriend at the time, whom Friedkin had passed on. The director felt the test was promising but, after viewing the footage the next morning, realized Miller's \"dark good looks, haunted eyes, quiet intensity, and low, compassionate voice\", qualities which to him evoked John Garfield, were exactly what the part needed. The studio bought out Keach's contract.</p><h4>Regan</h4><p>Directors considered for the project were skeptical that a young actress could carry the film. Mike Nichols had turned down The Exorcist specifically for that reason. The first actresses considered had been in other successful films and television series. Pamelyn Ferdin, a veteran of science fiction and supernatural drama, was turned down as too familiar. Denise Nickerson, who had appeared in two roles on the horror-soap opera Dark Shadows and played Violet Beauregarde in Willy Wonka & the Chocolate Factory, said in later interviews her family found the script too dark. Janet Leigh would not let her daughter, Jamie Lee Curtis, audition.</p><p>Friedkin had interviewed 16-year-old girls who looked young enough. Then Elinore Blair came in unannounced with her daughter Linda; her agency had not sent her for the part, but she had previously met with Warners' casting department. Both impressed Friedkin. Elinore was not a typical stage mother, and Linda's credits were primarily in modeling and a single soap opera role. \"mart but not precocious. Cute but not beautiful. A normal, happy 12-year-old girl\", Friedkin later recalled.</p><p>With Linda having the qualities Friedkin sought, he needed to know if she could handle the material. He asked if she knew what The Exorcist was about; she told him she had read the book. \"t's about a little girl who gets possessed by the devil and does a whole bunch of bad things.\" Friedkin then asked her what she meant. \"he pushes a man out of her bedroom window and she hits her mother across the face and she masturbates with a crucifix.\" Friedkin then asked Linda if she knew what masturbation meant. \"It's like jerking off, isn't it?\", and she giggled a little bit. \"Have you ever done that?\" he asked. \"Sure; haven't you?\" she responded.</p><p>She was cast after tests with Burstyn; Friedkin wanted to keep that level of spontaneity on set. \"After all these difficult scenes she'd tiptoe around and giggle, after every bit\", Blatty recalled. Of the 500 actresses Friedkin said he auditioned, \"there wasn't one other I would have considered.\"</p><p>Friedkin originally intended to use Blair's electronically treated voice for the demon's dialogue. But in scenes with the demon confronting the priests it lacked the dramatic power required, so he cast Mercedes McCambridge, an experienced voice actress. After filming, Warners did not credit her, until Screen Actors Guild arbitration. It concluded quickly enough that McCambridge's name was included in the credits on all but the first 30 prints but prevented the release of a soundtrack album with excerpts of dialogue.</p><p>Actress Eileen Dietz, 15 years Blair's senior, stood in for her in the crucifix scene, the fistfight with Father Karras, and others that were too violent or disturbing for Blair to perform. She also appears as the face of Pazuzu. Friedkin gave her no notes, telling her to play the possessed Regan as \"a primal force of malevolence ... I wasn't playing a little girl, I was playing the demon that possessed a little girl\", she recalled.</p><p>Reportedly Warners had forced Friedkin to hire Dietz; he in turn used her only when absolutely necessary. Blair, who recalls Friedkin telling her the film would not succeed if she was not in as many shots as possible, estimates that Dietz is in 17 seconds of the film. Dietz, angry that her contribution to the film had been minimized, claimed in the media to have done all the possession scenes. Warners ultimately measured her screen presence at 28.25 seconds.</p><h4>Father Merrin</h4><p>Warners wanted Marlon Brando in the role of Lankester Merrin. Friedkin did not want to make a \"Brando movie\" and refused. A Philippe Halsman photograph of Pierre Teilhard de Chardin, one of Blatty's inspirations for Father Merrin, inspired Friedkin to cast Max von Sydow instead of Paul Scofield, who Blatty had wanted.</p><h4>Supporting roles</h4><p>The film's supporting roles were cast more quickly. At a play, Blatty and Friedkin ran into Lee J. Cobb, who was cast as Lt. Kinderman. Two priests were cast. Father William O'Malley had become acquainted with Blatty through his criticism of the novel. After Blatty introduced him to Friedkin, they gave him the role of Father Dyer, a character O'Malley had considered clichéd in the novel. The Rev. Thomas Bermingham, the Georgetown professor who assigned Blatty as a student to do the research on demonic possession that informed the novel, took the role of the university president.</p><p>Cast sheets in The Hollywood Reporter and a Warners press release list British director J. Lee Thompson as a member of the cast early in production. It was suggested he would be playing Dennings, whom Shirley MacLaine says was based on him as he had directed the 1965 film John Goldfarb, Please Come Home!, which Blatty had adapted for the screen from his novel, but Jack MacGowran got the role instead. A later cast listing adds Mary Boylan and The Rev. John Nicola, one of the film's technical advisors, in small roles. Greek actor Titos Vandis, cast as Karras's uncle, covered his face with a hat, as Friedkin felt audiences would associate him with his role in the recent Woody Allen film Everything You Always Wanted to Know About Sex* (*But Were Afraid to Ask). Friedkin reportedly cast Vasiliki Maliaros as Karras's mother after encountering her in a Greek restaurant.</p><h4>Direction</h4><p>In addition to Nichols, Warners had approached Arthur Penn and Stanley Kubrick to direct. Blatty recalled in 2015 that one director wanted to set the film in Salem, Massachusetts, which he rejected because he considered the contrast between the worldly nature of the capital and the supernatural aspects of the plot to be essential to the story.</p><p>The studio finally hired Mark Rydell to direct, but Blatty insisted on Friedkin, with whom he was acquainted, as he had been impressed by The French Connection. At a meeting with Edwards, Blatty recalled, Friedkin had been extremely frank about the shortcomings of a Peter Gunn script.</p><p>Blatty saw Friedkin as \"a director who can bring the look of documentary realism to this incredible story, and ... a guy who is never going to lie to me.\" The studio demurred, until The French Connection was released to commercial success and a Best Picture Academy Award. While doing his press tour for that film, Friedkin began reading a copy of the novel Blatty sent him. After the first 20 pages he canceled his dinner plans and finished the book. \"I was so overwhelmed by the power of this story, and I didn't stop to think about the problems involved with making it.\"</p><p>He decided the film would be best with a deliberate pace. \"I wanted it to happen slowly because the story, as it affected the real people who inspired it, took place in just that way\", Friedkin said in 2015. For the film to work, he believed, audiences would need to see everything that happened to Regan, everything else attempted to treat her condition.</p><p>An early clash during production led to Warners telling Blatty he could not take any action against Friedkin. Afterwards, Blatty informed the studio he could no longer have any responsibility for controlling the budget; he and Friedkin reconciled and got along for the rest of the picture. Production costs soon exceeded the initial $4.2 million ($20.9 million in modern dollars) budget.</p><p>Friedkin went to great lengths manipulating the actors to get genuine reactions. Unsatisfied with O'Malley's performance as Dyer ministers to the dying Karras at the end of the film, he slapped him hard across the face to generate a deeply solemn yet literally shaken reaction for the scene, offending the many Catholic crew members on set. \"It was beyond what anyone needs to do to make a movie,\" Burstyn said in 2019. He also fired blanks without warning to elicit shock from Miller for a take; Dietz recalls him also doing this during the scene where Regan assaults the doctors who have come to see her. Friedkin also told Miller that the vomit, porridge colored to resemble pea soup and pumped through a hidden tube, would hit him in the chest during the projectile vomiting scene, and rehearsed it that way. But when filmed, the soup hit his face, resulting in his disgusted reaction.</p><p>Crewmembers found Friedkin demanding and sometimes difficult to work with. A shot of bacon being cooked on a griddle begins as a close-up and then pulls back. There was little space for the dolly, so Friedkin halted shooting while a wall behind it was removed. Afterward, he did not like the way the bacon curled, so the prop master was sent to look for preservative-free bacon, difficult to find at the time, further delaying the scene. Another crewmember recalls returning after three days of sick leave to find Friedkin still shooting the same scene.</p><p>Dietz recalls the main delay being reshoots, even of scenes that had been difficult to stage and film the first time, such as Regan's bed shaking. \"People were literally placing bets on what he would re-shoot next.\" He also fired and rehired crew regularly. One crewmember recalls seeing Friedkin shake hands warmly with someone, and then seconds later tell a second person to \"get this guy outta here\", earning him the nickname \"Wacky Willy\".</p><h4>Cinematography</h4><p>Director of photography Owen Roizman had worked with Friedkin in that capacity on The French Connection. The two collaborated again on The Exorcist, with Roizman in charge of filming every scene in the film save those in the Iraqi prologue, shot by Billy Williams. In a 1974 interview with American Cinematographer, the magazine of the American Society of Cinematographers, Roizman discussed The Exorcist at length.</p><p>Roizman and Friedkin agreed that, like their previous film, they wanted The Exorcist to look as if shot with available light. But they would eschew Connection's documentary look. The MacNeil house was, unlike house interiors in horror films such as Psycho, designed to look normal and inviting. \"What we tried to do, by means of the lighting, was to give it a kind of ominous feeling—as if some lurking, mysterious thing were hanging over it. That's about as far as we went with photographic style.\"</p><p>\"Friedkin demanded complete realism\", Roizman recalled. \"He wanted to see pictures with glass in them, mirrors on the walls and all of the other highly reflective surfaces you would naturally find in a house, we never tried to cover anything up, as we would normally do for expedience in shooting.\" This realism meant that the kitchen set, with much stainless steel and glass, was \"virtually impossible\" to light beyond the practical ceiling fixtures and whatever other lights they could manage to sneak in and hide. \"e'd walk in, hit the switch and shoot—through not much choice.\"</p><h4>Filming and locations</h4><p>The film's opening sequences were filmed in and near the city of Mosul, Iraq, a country with which the U.S. did not then have diplomatic relations; Warners feared that Friedkin and his crew might not be able to return. He negotiated filming arrangements directly with local officials of the ruling Ba'ath Party, who conditioned their permission on hiring local workers as crew and teaching filmmaking to interested residents. The archaeological dig site shown is Hatra, south of Mosul. Temperatures during the days filming took place reached 130 °F (54 °C), limiting shooting to the early mornings and late evenings.</p><p>Although the film is set in Washington, D.C., many interior scenes were shot in various parts of New York City. The MacNeil residence interiors were filmed at CECO Studios in Manhattan. Principal photography began in mid-August 1972 with Karras's confrontation with his uncle over his mother's care, shot at Goldwater Memorial Hospital (since demolished to make way for Cornell Tech) on Roosevelt Island in the East River between Manhattan and Queens; the scenes with Karras's mother in the hospital were filmed at Bellevue. The scene where Father Karras listens to the tapes of Regan was filmed in the basement of Keating Hall at Fordham University, a Jesuit university in the Bronx where O'Malley, who plays Dyer, was an assistant professor of theology.</p><p>The exterior of the MacNeil house was a family home on 36th and Prospect in Washington. A mansard roof was added to account for the scene in which Chris investigates the scratching noises in the attic. The neighboring stairs were padded with half-inch-thick (13 mm) rubber to film Karras's death. Because the house was set back slightly from them, the crew built an eastward extension with a false front.</p><p>The interior of Karras' room at Georgetown was a reconstruction of theology professor Father Thomas M. King's \"corridor Jesuit\" room in New North Hall. Every element of King's room, including posters and books, was recreated, including a poster of Pierre Teilhard de Chardin, the theologian on whom Merrin was loosely based. Locations used on campus included both exteriors such as Burstyn's first scene, shot on the steps of Healy Hall, and interiors such as the defilement of the statue of the Virgin Mary in Dahlgren Chapel, and the Archbishop's office (actually the office of the university's president). One scene was filmed in The Tombs, a student hangout.</p><h4>Exorcism scenes</h4><p>The exorcism scenes were challenging to film. Friedkin wanted the bedroom set to be cold as it is described in the novel, cold enough to see the actors' breath. A $50,000 ($249,000 in modern dollars) refrigeration system was installed that could cool the set to −20 °F (−29 °C) to make characters' breath visible. Since the set lighting warmed the air, it could only remain cold enough to film for three minutes at a time. It broke down frequently, and Friedkin was only able to complete five shots each day; the complete scene thus took a month to film, in continuity, the order they were written in the script. Blair wore green contact lenses meant to give her eyes a bestial appearance for scenes when Regan is possessed.</p><p>It was easier to film some of the other supernatural manifestations, such as the bed rocking and the curtains blowing, in Regan's room, since the walls and ceiling of the set were wild, or capable of being moved to accommodate a camera. After the scene where the ceiling cracks it was necessary to use a hard one. A hole was cut in the ceiling for the rig to go through when Regan levitates as the priests chant \"The power of Christ compels you!\", the most challenging shot in the sequence. the 80-pound (36 kg) Blair wore a bodysuit under her nightgown with attached hooks for monofilament wires.</p><p>Roizman had filmed similar scenes before, painting the wires to match the background so they would not show on camera. This was difficult on The Exorcist because of the changes in background. \"We had to practically paint them frame by frame\", he told the magazine. While most directors would have been satisfied to smooth out the scene in post-production, Friedkin wanted it done in longer takes.</p><p>Friedkin decided that he did not want any scenes in the movie to have \"any kind of spooky lights that you typically saw in horror films\", so all the lights in the bedroom come from a visible source. The room's color scheme also created the impression of black and white film, with gray taupe walls, Regan's bedding a neutral beige, and the priests in black. White, according to Roizman, would have been too dominant. \"In toning everything down like this, the only real color in the room became the skin tones\", he said. \"This sequence has an almost black and white feeling; yet, there is subtle color there.\"</p><h4>Father Merrin's arrival scene</h4><p>Father Merrin's arrival scene was filmed on Max von Sydow's first day on set. The scene where he steps out of a cab and stands in front of the MacNeil residence, silhouetted in a misty streetlamp's glow and staring up at a beam of light from a bedroom window, is one of the most famous scenes in the movie, used for film posters and home media release covers. It was inspired by René Magritte's 1954 painting Empire of Light (L'Empire des lumières).</p><p>Friedkin wanted to evoke visually the language Blatty used in the novel for this scene, likening Merrin to \"a melancholy traveler frozen in time\", standing next to a streetlight in the fog when he gets out of the cab. He gave the crew a full day to light the scene, using mainly arc lights and tripod-mounted \"troopers\", and boosting the brightness of the existing streetlamps. Roizman said this was \"the trickiest\" of all the nighttime exterior shots in the film.</p><p>In order to get the beam of light the way Friedkin wanted it, the crew had to take the window frame out of the facade they had attached to the house for filming, put it behind the window and then put the spotlight in between the window and frame. \"t was difficult to get that bright of a glow from a shaded window and we also had to hold a fog effect all the way down the street\", Roizman said. \"Of course—wouldn't you know—just as we were ready to shoot, the wind came up, which made it more difficult to keep the fog settled in.\" By working quickly, he and the camera crew were able to get the shot, with Friedkin finding the first take satisfactory.</p><h4>Head spinning</h4><p>The scenes where the possessed Regan's head rotates 180 degrees so that she appears to be looking directly backwards drew significant notice from audiences and critics upon the film's release. \"All I can tell you is that the way you think I did it is not the way we did it,\" Friedkin told Castle of Frankenstein at the time. Like the film's other special effects, it was performed live in front of the camera. A life-size animated dummy of the character was built, so realistic that Blair felt uncomfortable in its presence.</p><p>Critic Mark Kermode says the scene's impact results from the audience not having expected it so soon after the crucifix scene. He believes its recurrence later in the film, during the exorcism scenes, was added on set since it is in neither the novel nor the screenplay. Blatty had argued against it, telling Friedkin \"supernatural doesn't mean impossible\", which led Friedkin to insert a shot of Karras, suggesting the scene might just be a hallucination. When audiences reacted strongly to it, Blatty said Friedkin had \"prov me an idiot once again.\"</p><p>Special effects supervisor Marcel Vercoutere built the latex dummy with help from makeup artist Dick Smith. They tested its realism by putting it in the front seat of a New York City taxicab and, when enough people were looking, turning the head. They had given the dummy's face the capability to move and appear to speak, even adding a condom so its throat would bulge when speaking, but it still did not quite look real in the bedroom set. A tube was added for simulated breathing, which produced the requisite clouds of vapor.</p><h4>Crucifix scene</h4><p>The scene where the possessed Regan masturbates with a crucifix was filmed with Dietz standing in for Blair. Dietz and Friedkin had \"this long discussion about the right way to jerk off and I showed him why a woman has to churn her wrist.\"</p><p>\"This particular scene is the most thought about and talked about scene for the obvious reason that it programs two things that are generally not programmed up-front in the human mind ... sex and religion\", Friedkin said at the time. It lasts only 50 seconds, yet to many viewers seems much longer, he noted. He had filmed much more, but ultimately decided, on his own without previewing it or consulting anyone, that it was about \"how much I could take\".\"</p><p>\"Far from shying away from the sight, Friedkin puts it centre-screen, overlighting the entire sequence and accompanying the visuals with a truly revolting stabbing sound,\" writes Kermode. He quotes Blatty, who recalls Friedkin telling him that people would come to the film to see the crucifix scene more than any other. \"At the time ... I thought he was destroying the film. But when I perceived that he was absolutely right, I thought it was terribly depressing.\"</p><h4>Angiography scene</h4><p>The angiography scene, in which a needle inserted into Regan's neck spurts blood, as Blair undergoes the steps of the actual procedure, caused audiences the most discomfort, according to Blatty, who admitted he never watched it. \"I've learned over the years that the most terrifying scene\", Friedkin said in 2015. \"Medical science impinging upon the innocence of this little girl. Which is more disturbing than the demon.\"</p><p>It has been criticized as \"unappetizing\", the film's \"most needless scene\", and \"revolting\". British comedian Graeme Garden, who has a medical degree, agreed the scene was \"genuinely disturbing\"; in his review for the New Scientist, he called it \"irresponsible\".</p><p>\"The camera pointedly does not express the horror of Regan's experience with modern medicine, it only records it, allowing the audience to take away from it what it will\", writes critic John Kenneth Muir of this scene in Horror Films of the 1970s. \"In some ways, the hospital interlude is the most terrifying scene in the film because it looks, sounds and feels totally real ... For a time, it is medicine that possesses Regan, not the Devil, it seems.\" Kermode says it \"seems like an Inquisitional torture, perverse in its precision and horribly sexual in its execution.\"</p><p>In a 2021 article in History of the Human Sciences, Amy C. Chambers of Manchester Metropolitan University similarly observes that \"he medical space is made spectacular and horrific in The Exorcist not through the presentation of Regan's behaviour or the demon, but through the clinical nature of her treatment and how this is communicated through shots and sound.\" She quotes Finnish media professor Frans Ilkka Mäyrä on how the scientific suggests the spiritual here: \"The violent movements and noises of arteriographic machinery reach diabolical dimensions.\"</p><p>Medical professionals have described the scene, not in the novel but added to the film to reflect changes in medical technology, as a realistic depiction of the procedure. It is also of historical interest, as radiologists had started to move from using the carotid artery for the puncture (as they do in the film) in favor of a more distant artery. It has also been described as the most realistic depiction of a medical procedure in a popular film. In his 2012 commentary on the DVD release of the 2000 cut, Friedkin claimed that the scene was used as a training film for radiologists for years after the film's release.</p><h4>\"Spider-walk\" scene</h4><p>Stuntwoman Ann Miles performed the spider-walk scene in November 1972, after two weeks of practice. Vercoutere had designed a special harness, but she did not need it due to her experience as a former Florida State college gymnast. on the first take. Friedkin cut it, over Blatty's objection, just prior to the premiere, believing it too early in the film for such a drastic effect on Regan to be visible. Whether the scene had been shot at all was debated by fans for years afterwards—Friedkin denied having done so—until Kermode found the footage in Warners' archives while researching his book on the film in the mid-1990s (Friedkin said he had probably forgotten filming the scene). It was restored to the 2000 director's cut, albeit with a \"muddy, grainy\" look that one critic said made the scene seem superfluous, using a different take showing Regan with blood flowing from her mouth</p><p>Miles was not credited. Websites devoted to the film during the early 21st century gave credit to another contortionist, Sylvia Hager, who had been credited after the 2000 re-release. This confusion may have arisen from Vercourtere's website, where he credited her and described the harness he had designed that she supposedly wore to make the scene possible. He said the scene was cut because the harness could not be erased in post-production. According to Miles, Hager, her lighting double, could not perform the scene even with the harness, which Vercourtere had hoped to market afterwards. Since Miles was able to do the spider walk without it, she believes he left her out of his account for commercial reasons. The misidentification, Miles said in 2018, cost her jobs afterwards since some producers believed she was falsely taking credit for Hager's work. Since then, with the intercession of SAG, she has been properly credited.</p><h4>Special effects</h4><p>Smith, the makeup artist, created some key special effects. In one scene, von Sydow is wearing more makeup than Blair, in order to look 30 years older in some very detailed facial close-ups. Many viewers did not realize he was made up at all; critic Pauline Kael, in her generally unfavorable The New Yorker review, called it \"one of the most convincing aging jobs I've ever seen\" According to Friedkin, it took four hours to apply the makeup every morning. He said that if there was a regular Academy Award for makeup, Smith would have received it.</p><p>For the look of the possessed Regan, Friedkin and Smith drew their inspiration from the crucifix scene. If she had injured herself masturbating with it, they reasoned, it was likely that under Pazuzu's control she might also have deliberately scourged her face. \" decided to have the makeup grow out of self-inflicted wounds to the face that become gangrenous so that there was an organic reason for the change in her facial features, which might certainly be demonic possession, or self-immolation\", Friedkin later explained.</p><p>A latex stomach was built for the scene where the words \"HELP ME\" appear on the possessed Regan's body. The letters were scratched in, and then heated to make them disappear. This was filmed and then reversed in the edit so the letters seemed to be appearing.</p><br/><h3>Post-production</h3><h4>Editing</h4><p>Bud Smith recalls Friedkin asking him to work on The Exorcist after shooting wrapped. Friedkin had already hired three other editors (Jordan Leonduopoulos, credited as \"supervising editor\", Norman Gay and Evan Lottman), but told Smith he would be the lead editor. He asked Friedkin to let him cut one large rack of footage from the Iraq sequence at the beginning of the film. Smith worked through a weekend to recut the footage to a rhythm based on the sound of a blacksmith hammering an anvil near where Father Merrin is having his tea.</p><p>Smith also created the \"flash face\" trailer for the film, with a montage of faces from various scenes in the film, still, all appearing in all-white against a black background, which quickly swells to almost all white and then fades back to nearly black, making a strobe-like effect, as tense string music plays, ending after almost a minute and a half with the title. Friedkin said in 2018 that Warners feared it would scare audiences too much. He considers it the best of the film's trailers.</p><p>In that 2018 tweet discussing this, Friedkin referred to Smith as \"the film's editor\", although the other three were credited. During principal photography, the editor then hired had never worked on a movie before and was not allowed to cut the raw footage. After production, Friedkin hired Lottman and closely supervised his work. \"It was all about power,\" Lottman said. \"He wanted to be in control of the film.\" All four shared the film's Academy Award nomination for editing.</p><p>Friedkin's final cut was 140 minutes long; despite his insistence that it was perfect, Warners insisted he trim the film to two hours to allow for more daily screenings. Blatty was willing to fight for the whole film as it was, but over his objections Friedkin cut roughly 10–12 minutes. Some of the excluded scenes were among Blatty's favorites, including the original ending, with Dyer and Kinderman connecting and agreeing to go to the movies at some point, and a scene where Karras and Merrin take a break from the exorcism and discuss the demon's motivation for possessing Regan on the MacNeil stairs. These scenes had been in Blatty's novel, and he believed that in the movie they made it clearer at the end that good had triumphed and what was at stake.</p><h4>Sound effects</h4><p>Special sound effects for the film were created by Ron Nagle, Doc Siegel, Gonzalo Gavira, and Bob Fine. Animal sounds such as bees, dogs, hamsters, and pigs were mixed into the demon's voice. The sound effect of Regan's head rotating was made by twisting a leather wallet.</p><p>Friedkin was personally involved in the four-month sound process, the last aspect of the film completed, just before deadline. Jim Nelson, who Friedkin had hired to supervise the mixing, recalls the director being particularly demanding, treating his then-girlfriend, who was among those assisting in the process, \"like a dog\".</p><h4>Alleged subliminal imagery</h4><p>Wilson Bryan Key devoted a chapter to the film in his book Media Sexploitation, alleging repeated use of subliminal and semi-subliminal imagery and sound effects. In addition to the Pazuzu face, he claimed that the safety padding on the bedposts was shaped to cast phallic shadows on the wall and that a skull face is superimposed into one of Father Merrin's breath clouds.</p><p>A 1991 article in Video Watchdog examined the phenomenon, providing still frames with several uses of subliminal \"flashing\" throughout the film. Friedkin told the authors, \"I saw subliminal cuts in a number of films before I ever put them in The Exorcist, and I thought it was a very effective storytelling device ... The subliminal editing in The Exorcist was done for dramatic effect—to create, achieve, and sustain a kind of dreamlike state.\" In a 1999 interview, Blatty said \"here are no subliminal images. If you can see it, it's not subliminal.\"</p><h4>Titles</h4><p>The title sequence was the first major project for film title designer Dan Perri, whom Friedkin sought out after seeing his work on Electra Glide in Blue, before The Exorcist was even completed. His plan for the titles evolved as the film progressed.</p><p>For the words themselves Perri chose to keep the Weiss Initials typeface used on the cover of Blatty's novel. The filmmakers wanted the words in red, but it was hard to choose an exact shade. \"When's exposed against black it tends to, what's called, bloom. It swells, it glows, it's very hard to control. I had to do a lot of exposure tests just to get the right red that wouldn't bloom.\"</p><p>Perri's input into the film's opening continued after those credits, as the music abruptly shifts to an ululating male voice and the scene to the archeological dig site in northern Iraq. Friedkin told him he wanted the film to begin with a sunrise, even though he had not filmed one while there. The closest shot he had was one at midday, of the sun in an orange sky, with rising heat visible. \"I suggested that we create an implied sunrise\", Perri says, \"a very, very long fade in, like a 30-second fade in of the sun in the sky but in black and white. It very slowly dissolves into color\" That image gave the film a sense of beginning it had lacked.</p><h4>Music</h4><p>What is now considered the movie's theme, the piano-based melody which opens Tubular Bells, the 1973 debut album by English progressive rock musician Mike Oldfield, became very popular after the film's release, although Oldfield had never imagined it being used in a movie. Friedkin recalled in 2015 that he had wanted something like Brahms' \"Lullaby\" with \"a kind of childhood feel\". He had gone to see Calley, who did not understand what he wanted and directed him to the nearby music library. There he found Oldfield's record, which Warners had not been planning to release. \"But I listened to that refrain, and it hooked me, and we won the rights to it\" he said. \"I think it sold 10 or 20 million records.\"</p><p>Friedkin rejected Lalo Schifrin's working score. Schifrin said that after he had written six minutes of music for the \"flash face\" trailer executives told Friedkin to tone it down with softer music; but Friedkin never told him. In 2005 Schifrin said this was in retaliation for an earlier \"incident\" between the two. Schifrin denies claims he used his original Exorcist music several years later for The Amityville Horror. According to a 1998 documentary, Friedkin threw away the tapes of Schifrin's score in the studio parking lot.</p><p>In his Castle of Frankenstein interview shortly after the film's release, Friedkin said he had hired a composer, whom he did not name, \"and he did a score all right, and I thought it was terrible, just overstated and dreadful.\" He decided instead to use the music he had given the composer as inspiration. \"In other words, rather than get bad imitation Stravinsky, I might as well have the real thing.\"</p><p>Bernard Herrmann, famous for his scores for Orson Welles and Alfred Hitchcock, including the staccato string bursts that accompanied the killings in Psycho, turned down the job after viewing a rough cut. He felt the minimal opening credits deprived a composer of the opportunity to establish a musical mood with an overture. In a 1975 interview with High Fidelity magazine, Herrmann said that Friedkin objected to his intention to use an organ, saying \"I don't want any Catholic music in my picture\" and insisted on sharing composing credit.</p><p>In the soundtrack liner notes for 1977's Sorcerer, Friedkin said that if he had heard the music of Tangerine Dream earlier, he would have had them score The Exorcist. Instead, he used modern classical compositions, including portions of the 1972 Cello Concerto No. 1, of Polymorphia, and other pieces by Polish composer Krzysztof Penderecki, Five Pieces for Orchestra by Austrian composer Anton Webern as well as some original music by Jack Nitzsche, all heard only during scene transitions. The 2000 cut features new music by Steve Boeddeker, as well as brief source music by Les Baxter.</p><p>There are 17 minutes of music in a film around two hours long. Friedkin was satisfied. \"What I wanted\", he said, \"what I think we have in the film, is understated music. The music is just a presence like a cold hand on the back of your neck, rather than assertive.\" In her ambivalent review of the film, critic Judith Crist praised the film's \"sparing and adventurous\" use of music.</p><p>In 1998 a restored and remastered soundtrack was released by Warner (without Tubular Bells) that included three pieces—\"Music from the unused Trailer\", an 11-minute \"Suite from the Unused Score\", and \"Rock Ballad (Unused Theme)\"—from Schifrin's rejected score. That same year, the Japanese version of the original soundtrack LP did not include the Schifrin pieces but did include the main theme, and the Night of the Electric Insects movement from George Crumb's string quartet Black Angels. Waxwork Records released the remastered score in 2017. They included Friedkin's liner notes with art by Justin Erickson of Phantom City Creative.</p><p>The Greek song on the radio as Father Karras leaves his mother's house is \"Paramythaki mou\" (My Tale), sung by Giannis Kalatzis. Part of Hans Werner Henze's 1966 composition Fantasia for Strings is played over the closing credits.</p><br/><h3>Production difficulties and purported curse</h3><p>Principal photography began in August 1972, scheduled for 105 days. Due to production problems and accidents on set, it took over 200 days to wrap. The film went $2.5 million ($12.5 million in modern dollars) over budget, ultimately costing the studio $12 million ($59.8 million in modern dollars).</p><p>Early on, a bird flew into a circuit breaker on the set for the interiors of the MacNeil house, starting a fire that destroyed it except for Regan's room, halting shooting for six weeks. Later, another set was severely damaged by the sprinkler system. The 10-foot (3.0 m) statue of Pazuzu was shipped to Hong Kong instead of Iraq, causing a two-week delay.</p><p>Injuries to cast and crew also affected production, with permanent consequences for two of the leads. Burstyn's back injury during the scene where the possessed Regan throws Chris backwards before the head-spinning, the take used in the film, left her unable to film for two weeks and using crutches for the remainder of the production; fracturing her coccyx has caused her chronic problems due to inadequate early treatment.</p><p>Blair also injured her back, fracturing her lower spine after being too loosely strapped to the rocking bed; the take was also used in the finished film. She developed scoliosis: \" was far more serious than I ever imagined and really affected my health negatively for a long time.\" She further developed a lifelong aversion to cold after spending so much time in the refrigerated bedroom set in only a nightgown and long underwear. A carpenter cut his thumb off and a lighting technician lost a toe in different accidents.</p><p>Other people connected with the film and their family members died. MacGowran died a week after completing his scenes as Dennings; Maliaros also died, like her character, before the film was finished. Deaths among or close to the crew included the night watchman and the operator of the refrigeration system for Regan's room, along with an assistant cameraman's newborn.</p><p>Blair's grandfather died during the first week of production, and von Sydow had to return to Sweden after his first day shooting after his brother had died, further delaying shooting. Miller's son Jason Patric nearly died when a motorcycle struck him. Several years after the film's release, Paul Bateson, the technician in the angiography scene, was convicted of murdering journalist Addison Verrill; in 2015 Hatra, the World Heritage Site where the prologue was shot, was demolished by ISIL militants.</p><p>Friedkin believed that there might have been some supernatural interference with the film. \"I'm not a convert to the occult\", he told the horror-film magazine, Castle of Frankenstein, \"but after all I've seen on this film, I definitely believe in demonic possession ... We were plagued by strange and sinister things from the beginning.\"</p><p>Special effects supervisor Vercourtere also felt uncomfortable. \"There was definitely a feeling something could happen,\" he recalled. \"I felt I was playing around with something I shouldn't be playing around with.\" To mollify the crew, Friedkin asked Father Thomas Bermingham, the film's technical advisor, to perform an exorcism on the set. Bermingham instead blessed the cast and crew, believing that an actual exorcism would only make the cast more anxious.</p><p>British film historian Sarah Crowther believes stories of the curse were disseminated by Warner's, which she believes purposely courted controversy by releasing the film just after Christmas. \" spread speculation of the curse prior to release. It was an extremely hot topic in global media when it hit cinemas\", she told inews.com in 2018, likening the curse to the elaborate marketing gimmicks employed by producer William Castle.</p><p>Crowther believes most of the aspects of the curse are really just the result of Friedkin's driving, relentless production. Blatty agreed, telling Kermode that Friedkin had started the \"curse\" story with an interview during production in which he blamed \"devils\" for the film's many delays. \"But for God's sake\", said Blatty, \"if you shoot something for a year, people are going to get hurt, people are going to die ... these things just happen.\"</p><p>Blair told Kermode that stories of the supposed curse circulated to help viewers deal with the movie. \"They chose to see a scary film, and maybe they wanted to believe all those rumors because it helped the whole process\", she said. In 2000, Blatty joked that \"There is no Exorcist curse. I am The Exorcist curse!\" when asked if the death of Blair's pet mouse was related to it.</p><br/><h3>Releases</h3><h4>Theatrical</h4><p>Warners scheduled The Exorcist for release the day after Christmas 1973. It had been scheduled for an earlier release, but that was postponed due to postproduction delays. Friedkin was angry about this date, believing that it hurt the film commercially. He had wanted a release before the holiday, or on it, as is more common at that time of year; it has been speculated that Warners wanted to avoid any controversy that might have come from releasing a film about demonic possession before a major religious holiday. Friedkin supposedly had seen what Paramount had done to make The Godfather, which had had similar issues, a runaway success. He had wanted Warners to choose a more preferable release date, such as March, as that film had had.</p><p>The post-holiday release served to help The Exorcist sell tickets, as most moviegoers had all or most of the week off. It is the second all-time highest-grossing Christmas week release after 1997's Titanic. It has also outgrossed The Godfather. The Exorcist's first run lasted 105 weeks, or just over two years.</p><p>In 1979, the film was re-released theatrically in 70mm, with its original 1.75:1 aspect ratio expanded to 2.20:1. A longer cut titled \"The Version You've Never Seen\" (later re-labeled \"Extended Director's Cut\") was released theatrically in 2000, with additions and changes.</p><h4>Home media</h4><h4>Special edition 25th anniversary VHS and DVD release</h4><p>A limited 50,000-copy special edition box set was released in 1998 for the film's 25th anniversary on both VHS and DVD. It includes the original ending as a special feature.</p><p>Blatty was pleased that the scene was restored. The night before the scene was shot, he and Friedkin had worked very hard on blocking it, to make sure it would be clear to the audience that the film ended on an upbeat moment. \"My theory over the years has been that at that point in the movie, most of the audience is a little out of it\" he said two years later. \"They're really not seeing what's happening there, and, of course, the film lost its original ending and instead ended with Father Dyer looking down the steps ... gives an audience an emotional cue about how they're supposed to feel.\" Overall, he said, the 25th anniversary cut is \"the version that I first saw on the moviola in the editing room all those years ago, and it's the way it ought to be seen.\" The DVD also contains The Fear of God, a documentary on the making of the film.</p><h4>Other home media</h4><p>The extended edition labeled \"The Version You've Never Seen\" (released theatrically in 2000) was released on DVD in 2001. It was re-released on DVD (and Blu-ray) with slight alterations as the \"Extended Director's Cut\" in 2010.</p><p>In a 2008 DVD Review interview, Friedkin said he was scheduled to begin work on The Exorcist Blu-ray that year. When released two years later, it featured a restored version of both cuts. A 40th Anniversary Edition Blu-ray was released in 2013, with both cuts, many of the previously released bonus features and two featurettes about Blatty. The Exorcist: The Complete Anthology, a box set, was released on DVD in 2006, and on Blu-ray in 2014. It includes both cuts, the sequels Exorcist II: The Heretic and The Exorcist III, and the prequels Exorcist: The Beginning and Dominion: Prequel to the Exorcist.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Since it was a horror film that had gone well over budget, without major stars as leads, Warner did not have high expectations for The Exorcist. It did not preview the film for critics and booked its initial release for only 30 screens in 24 theaters, mostly in 21 large cities and their metropolitan areas. The film grossed $1.9 million ($8.98 million in modern dollars) in its first week, setting house records in each theater, with an average of $70,000, equivalent to $300,000 at modern ticket prices.</p><p>Within its first month it had grossed $7.4 million ($32.1 million in modern dollars) nationwide; Warners' executives expected it to easily surpass My Fair Lady as the studio's most financially successful film. The huge crowds forced the studio to expand it into a 366-screen wide release very quickly. At the time that releasing strategy had rarely been used for anything but exploitation films. Many of the theaters in large cities were not located near downtowns, where Warners had booked Magnum Force, the Dirty Harry sequel, before planning the release of The Exorcist. By February The Exorcist accounted for 15 percent of Warners' grosses in key markets.</p><p>None of the theaters were in Black neighborhoods such as South Central Los Angeles since the studio did not expect that audience to take much interest in the film, which had no Black characters. But after the theater in predominantly white Westwood that had shown the film was overwhelmed with moviegoers from South Central, it was quickly booked into theaters in that neighborhood. Black American enthusiasm for The Exorcist has been credited with ending mainstream studio support for blaxploitation movies, since Hollywood realized that Black audiences would flock to films without content geared to them.</p><p>The New York Times took notice that the audience lined up to see the film was between one-quarter and one-third Black at one theater on the Upper East Side of Manhattan, a mostly white neighborhood of the city, showing the film in late January. \"A lot of blacks relate to voodoo and witchcraft and that kind of devil stuff,\" one Black patron said, when asked why so many Black people went to such lengths to see it. \"Many still believe in black magic, especially those from Haiti and the Deep South.\"</p><p>The Exorcist earned $66.3 million ($287 million in modern dollars) in distributors' rentals during its theatrical release in 1974 in the United States and Canada, becoming the second most popular film of that year (trailing The Sting which earned $68.5 million) and Warners' highest-grossing film of all time. Most of that money went to Warners due its use of four-wall distribution, where the studio rents the theater from the owner and thus keeps all the ticket revenue, in the initial run. It was the first time a major studio had used that practice. Warners also used some practices that had made The Godfather successful for Paramount the year before, such as making theaters commit to showing the film for at least 24 weeks.</p><p>Overseas, the film earned rentals of $46 million for a worldwide total of $112.3 million ($531 million in modern dollars). It became the highest-grossing film in Japan with rentals of over $8.2 million in its first 11 weeks. After several reissues, the film has grossed $232.6 million in the United States and Canada, which when adjusted for inflation, makes it the ninth highest-grossing film of all time in the U.S. and Canada and the top-grossing R-rated film of all time. As of 2019, it has grossed $441 million worldwide, or $1.8 billion adjusted for inflation by 2014.</p><p>In Easy Riders, Raging Bulls, journalist and film historian Peter Biskind wrote about Warner's reaction to the success of the film. Executives were happy, but also nervous, since the huge earnings meant that the more free-wheeling and experimental work the studio had done would give way to finding profitable film ideas and projects.</p><h4>Critical response</h4><p>Stanley Kauffmann, in The New Republic, wrote, \"This is the scariest film I've seen in years—the only scary film I've seen in years\". Arthur D. Murphy of Variety noted that it was \"an expert telling of a supernatural horror story\". In the horror-film magazine Castle of Frankenstein, Joe Dante, later director of Piranha and The Howling, called it \"an amazing film, and one destined to become at the very least a horror classic ... Suffice it to say, there has never been anything like this on the screen before\".</p><p>Roger Ebert of the Chicago Sun-Times gave the film a four-star review, praising the actors (particularly Burstyn) and the convincing special effects, but concluded: \"I am not sure exactly what reasons people will have for seeing this movie; surely enjoyment won't be one ... Are people so numb they need movies of this intensity in order to feel anything at all?\"</p><p>In the middle of the range was Judith Crist. Her New York review called the film \"half-successful\". She praised Friedkin's direction, its \"to-the-point performances\" and the special effects and makeup. But she felt that Blatty had taken out what made the reader of his novel connect with the characters; he was also perhaps limited since the film could not leave things to the imagination as his book had.</p><p>Kael called the film \"shallowness that asks to be taken seriously\" saying its main problem was being too faithful to the novel as Blatty had intended it. Vincent Canby, writing in The New York Times, dismissed The Exorcist as \"a chunk of elegant occultist claptrap ... a practically impossible film to sit through ...stablish a new low for grotesque special effects.\" Andrew Sarris of The Village Voice complained that \"Friedkin's biggest weakness is his inability to provide enough visual information about his characters ... The Exorcist succeeds on one level as an effectively excruciating entertainment, but on another, deeper level it is a thoroughly evil film\". Rolling Stone's Jon Landau called The Exorcist \"nothing more than a religious porn film, the gaudiest piece of shlock this side of Cecil B. DeMille.\" Film Quarterly's Michael Dempsey called The Exorcist \"the trash bombshell of 1973, the aesthetic equivalent of being run over by a truck ... a gloating, ugly exploitation picture.\" The San Francisco Bay Guardian's reviewer called it \"quite simply the dumbest, most insultingly anti-intellectual movie I have ever come across\".</p><h4>Audience reaction</h4><blockquote>On December 26 a movie called The Exorcist opened in theatres across the country and since then all Hell has broken loose.— Newsweek, February 2, 1974, quoted in Shock Value, by Jason Zinoman</blockquote><p>Audience members screamed and ran out of the theater during the only sneak preview. When it was over, Calley and the other Warners executives, instead of leaving without comment as studio executives usually do, remained in their seats, stunned. \"What in the fuck did we just see?\" Calley asked. They believed the film was brilliant, but did not know how to market it, and decided on the limited early release after Christmas, with a trade screening on December 21. Burstyn recalled watching television the morning the film opened, seeing viewers in Montreal lining up at 4 a.m. in frigid weather. \"I thought, how can a movie have that kind of impact before it even opens? I just couldn't believe it.\"</p><p>Despite its mixed reviews and the controversies over its content and viewer reaction, The Exorcist was a runaway hit. In New York City, where its initial run was limited to a few theaters, patrons endured 6 °F (−14 °C) cold, rain and sleet, waiting for hours in long lines during a normally slow time of year for the movies to buy tickets, many not for the first time. The crowds gathered outside theaters sometimes rioted, and police had to be called not only in New York but Kansas City.</p><p>The New York Times asked some of those in line what drew them there. Those who had read the novel accounted for about a third; they wanted to see if the film could realistically depict some of the scenes in the book. Another said: \"We're here because we're nuts and because we wanted to be part of the madness\". A repeat viewer told the newspaper that it was the best horror film he had seen in decades, \"much better than Psycho. You feel contaminated when you leave the theater. There's something that is impossible to erase\". Many made a point of saying they had either never waited in line that long for a movie before, or not in a long time. \"It makes the movie better,\" William Hurt, then a drama student at Juilliard, said of the experience. \"The more you pay for something, the more it's worth.\"</p><p>Reports of strong audience reactions were widespread. Many viewers fainted; a woman in London, when the film opened there, reportedly fainted before the film. A woman in New York was said to have miscarried during a showing. One man at another showing lasted only 20 minutes before he had to be carried out on a stretcher.</p><p>Nausea was frequently reported. \"We have a plumber practically living here now\", said the manager of Toronto's University Theater on Bloor Street, at the time selling its 1,440 seats out four times a day. \"The smell in the bathrooms is awful. People are rushing in and they're missing the toilet seat by inches.\" Viewers seemed to be particularly disturbed by the crucifix scenes; the theater reported depleting its supply of smelling salts. Many patrons left before the end or waited for viewing companions in the lobby; the smell of marijuana smoke was also common although the police stationed at the theater reported no arrests. A reviewer for Cinefantastique recalled the vomit in the bathroom made it impossible to reach the sinks. Some theaters were said to have provided \"Exorcist barf bags\"; while there are no contemporary reports of any even providing regular such bags, Mad magazine depicted one on the cover of its October 1974 issue, which contained a parody of the film.</p><p>Other theaters arranged for ambulances to be on call; Toronto's University said it had once required four in one night. Some patrons had to be helped from places they had hidden after showings. Many audience members found the angiography to be the film's most unsettling scene Friedkin speculates that it is easier to empathize with Regan in that scene, as compared to what she suffers while possessed later in the film.</p><p>Some Catholic viewers, particularly those who had lapsed in their faith, experienced spiritual crises after the film, requiring priestly attention. A man in Denver walked out of a showing into the nearby Cathedral of the Immaculate Conception half-naked and so disturbed that it took two priests, several attendants and the police to calm him down. A teenage girl in New Jersey stayed up all night with her parents saying the Rosary after seeing the film, requiring a priest's reassurance to sleep; even some priests themselves had similar issues. Many parishes reported callers who believed that they or a loved one was possessed and inquiring about an exorcism. The Rev. Richard Woods, a professor at Loyola of Chicago, said most of the calls he got were from lapsed Catholics for whom the film resurfaced their religious education prior to Vatican II. \"It stirs up memories of all those descriptions of hell that you got from nuns,\" he said.</p><p>In 1975, The Journal of Nervous and Mental Disease published a paper by a psychiatrist documenting four cases of \"cinematic neurosis\" triggered by the film. In all he believed the neurosis had been latent, surfacing from the scenes depicting Regan's possession. He recommended that treating physicians view the movie with their patient to help them identify the sources of their trauma.</p><p>Other causes were suggested outside the psychiatric context. One writer at Castle of Frankenstein took note of Friedkin's pride in the movie's sound, which theaters played at maximum volume, and wondered if some of the low frequencies had induced or amplified feelings of dread or uneasiness in patrons. Another writer there blamed the reactions on the mainstream audience's general unfamiliarity with horror-movie conventions. \"We have all no doubt heard of people who stood in line for four hours to see this movie, then threw up in mid-film and walked out,\" he wrote. \"I can't say for sure, but my guess is that these people hadn't gone to see a monster movie since 1935.\"</p><p>\"The Exorcist ... was one of the rare horror movies that became part of the national conversation\", wrote Zinoman almost 40 years later: \"It was a movie you needed to have an opinion about\". Three separate production histories were published. Journalists complained that coverage of the film was distracting the public from the ongoing Watergate scandal. Much of that coverage focused on the audience which, film historian William Paul wrote, \"had become a spectacle equal to the film\". Paul cited an Associated Press cartoon in which a couple trying to purchase tickets to the film was told that while the film itself is sold out, \"we're selling tickets to the lobby to watch the audience.\" He did not think any other film's audience received as much coverage as The Exorcist's.</p><h4>Religious response</h4><p>\"One of the best things that could happen is if the Pope denounces it\", Friedkin said after release. The crucifix scene, and others, involved material sacrilegious to Catholics. Officially the Church, whose influence over the content of films had declined following the demise of the Hays Office and the associated Production Code a few years earlier, had bemoaned Warners' decision to release it around Christmas. The United States Conference of Catholic Bishops' Office for Film and Broadcasting's Catholic Film Newsletter rated the film A-IV, suitable for adults only with reservations, and gave it a generally negative review that faulted the film for suggesting exorcisms were common and possibly encouraging belief in the occult and Satanism.</p><p>Individual priests familiar with the underlying theology were also critical. One who, like Karras, was a Jesuit and psychiatrist at Georgetown said that while he believed in the Devil \"there is no shred of evidence from the Bible that he can possess an individual.\" Woods, the Loyola of Chicago professor, who had written a book about the Devil, told The New York Times that Karras and Merrin were incompetent. \"They departed from the ritual in the most stupid and reckless manner,\" he said. \"They tried to fight the Demon hand to hand instead of relying on the power of God.\" Eugene Kennedy, another Loyola priest and psychologist, described the film's view of the battle of good and evil as \"immature ... Being a Christian and a mature person means coming to terms with our own capacity for evil, not projecting it on an outside force that possesses us.\"</p><p>Some non-Catholics were also critical. \"Surely it is the religious people who should be most offended by this movie\", wrote Kael, incredulous that Georgetown and several priests facilitated the production:</p><blockquote>Others can laugh it off as garbage, but are American Catholics willing to see their faith turned into a horror show? Are they willing to accept anything just as long as their Church comes out in a good light? Aren't those who accept this picture getting their heads screwed on backward?</blockquote><p>Kael nonetheless described The Exorcist as \"the biggest recruiting poster the Catholic Church has had since the sunnier days of Going My Way and The Bells of St. Mary's\" since the film \"says that is the true faith, feared by the Devil, and that its rituals can exorcise demons.\" A later historian has found that the Church was not as critical of the film as reports at the time suggested, privately considering it faith-affirming. Authorities in Tunisia banned the film before its 1975 release there as \"unjustified propaganda in favor of Christianity\". In 2008, Colleen McDannell, editor of Catholics In The Movies, wrote that \"The Exorcist is a horror movie that believes in its villain and, even worse, recruits its villain as a witness to Catholic truth.\"</p><p>In February 1974, the Jesuit magazine America ran several commentaries and responses by priests to the film, some of which reiterated criticisms already made. The editors allowed Blatty to respond later that month. He praised some of the commentators' points, \"ut I am truly dismayed at the misconceptions held, not only by critics, but also defenders of the novel and film.\"</p><p>The changes to the film's ending from the novel, Blatty agreed, might have made it harder to perceive that \"the mystery of goodness\" was the theme of the work, since it appeared to many viewers, including some of those who had written in America, that the film ended with the demon triumphant through the deaths of the priests despite being exorcised from Regan. The ending of the novel made this clearer, but even in the film he saw Karras's suicide as a sacrificial act of love that reaffirmed his faith.</p><p>American Protestant groups also took note of the Exorcist phenomenon and its religious implications. At first their response was negative. Evangelist Billy Graham told the National Enquirer that he was afraid to watch it, saying that \"the Devil is in every frame of that film\", a remark later characterized as Graham believing the print itself was possessed. He called it \"spiritual pornography, pandering to man's innate superstition.\"</p><p>The Rev. Lester Kinsolving, an Episcopal priest who wrote a widely syndicated newspaper column on religion, chastised the Catholic Church for granting its approval, saying it did so only because its heroes were priests. The Christian Century, the leading voice of mainline Protestantism, likewise denounced the film as \"hardcore pornography a completely impossible solution\" to evil. Protestant groups around the country picketed the film and offered support to those who might be disturbed by it, distributing leaflets with church contact information to filmgoers in line.</p><h4>Rating controversy</h4><p>The Motion Picture Association of America's (MPAA) ratings board had been established several years before to replace the Motion Picture Production Code. It had already been criticized for its indirect censorship—as many as a third of the films submitted to it had had to be recut after being rated X, meaning no minors could be admitted. Since many theaters would not show such films, and newspapers would not run ads for them, the X rating greatly limited a non-pornographic film's commercial prospects.</p><p>While Friedkin wanted more blood and gore in The Exorcist than had been in any Hollywood film before, he also needed the film to be rated R (children admitted only with an adult) to reach a large audience. He believes that part of the reason for Warners' decision to open the film in limited release was the studio's certainty that the film would be rated X. Before release, Aaron Stern, the head of the MPAA ratings board, decided to watch the film himself before the rest of the board did. He then called Friedkin and said that since The Exorcist was \"an important film\", he would allow it to receive an R rating without any cuts.</p><p>Some critics, both anticipating and reacting to reports of the film's effect on children who had been taken to see it, questioned the R rating. Roy Meacham, a Washington, D.C.-based critic for Metromedia television stations who had praised the film, wrote in The New York Times in February 1974 that his station repeated for several days his warning that children should not be allowed to see it even with an adult. Nevertheless, some had, and he had heard of one girl being taken from the theater in an ambulance.</p><p>The film had drawn strong interest in Washington since it was a rare film set in the area that did not involve government activity. The children Meacham saw leaving showings, he recalled, \"were drained and drawn afterward; their eyes had a look I had never seen before\". He suggested that the ratings board had yielded to pressure from Warner's, and was skeptical of MPAA head Jack Valenti's claims that since the film had no sex or nudity, it could receive an R. After a week in Washington's theaters, Meacham recalled, authorities cited the crucifix scene to invoke a local ordinance that forbid minors from seeing any scenes with sexual content even where the actors were fully clothed; police warned theaters that staff would be arrested if any minors were admitted to see The Exorcist.</p><p>\"The review board surrendered all right to the claim that it provides moral and ethical leadership to the movie industry\", Meacham wrote. He feared that communities across the country would feel it necessary to pass their own, perhaps more restrictive, laws regarding the content of movies that could be shown in their jurisdictions: \"For if the movie industry cannot provide safeguards for minors, authorities will have to.\" In The New Yorker, Kael echoed his insinuations that the board had yielded to studio pressure in rating the film R: \"If The Exorcist had cost under a million or been made abroad, it would almost certainly be an X film. But when a movie is as expensive as this one, the doesn't dare give it an X\". Ebert, who had favorably reviewed the film, found the special effects unusually graphic and wrote: \"That it received an R rating and not the X is stupefying.\"</p><p>Two communities, Boston and Hattiesburg, Mississippi, attempted to prevent the film from being shown in their jurisdictions. A court in the former city blocked the ban, saying the film did not meet the U.S. Supreme Court's standard of obscenity. Nonetheless, in Boston the authorities told theaters they could not admit any minors despite the R rating. In Mississippi, the theater chain showing the movie was convicted at trial, but the state's Supreme Court overturned the conviction in 1976, finding that the state's obscenity statute was too vague to be enforceable in the wake of the Supreme Court's 1972 Miller v. California decision which laid down a new standard for obscenity.</p><p>There was also concern that theaters were not strictly enforcing the R rating, or disregarding it, allowing unaccompanied minors to view the film. Times critic Lawrence Van Gelder reported that a 16-year-old girl in California said that not only was she sold a ticket to see the film unaccompanied, others who seemed even younger were able to do so. On the other hand, another Times writer, Judy Lee Klemesrud, said she saw no unaccompanied minors, and indeed very few minors, when she went to see the film in Manhattan. Nevertheless, \"I think that if a movie ever deserved an X rating simply because it would keep the kids out of the theater, it is The Exorcist\".</p><p>In 1974, Stern's tenure as chairman of the MPAA ratings board ended. His replacement, Richard Heffner, asked during the interview process about films with controversial ratings, including The Exorcist, said: \"How could anything be worse than this? And it got an R?\" After he took over as head, he would spearhead efforts to be more aggressive with the X rating, especially over violence in films.</p><h4>Viewing restrictions in United Kingdom</h4><p>The Exorcist was released in London in March 1974. It drew protests around Britain from the Nationwide Festival of Light (NFL), a Christian public action group concerned with the influence of media on society, and especially on the young. Members of local clergy and concerned citizens handed out leaflets to those queuing to see the film, offering spiritual support afterwards. A letter-writing campaign to local councils by the NFL led many to screen The Exorcist before permitting it to be shown in their districts. It was thus banned in some areas, such as Dinefwr Borough and Ceredigion in Wales.</p><p>The Exorcist was available on home video from 1981 in the UK. After the passage of the Video Recordings Act 1984, the film was submitted to the British Board of Film Classification for a home video certificate. A majority voted to grant it but James Ferman, the board's director, vetoed them. He believed that, even with a proposed 18 certificate, the film's notoriety would lead underage viewers to seek it out. As a result, all video copies of The Exorcist were withdrawn in the UK in 1988 and could not be purchased for 11 years.</p><p>Following a successful 1998 theatrical re-release, the film was submitted for home video release again in 1999. It was passed uncut with an 18 certificate, signifying a relaxation of the censorship rules for home video in the UK, in part due to Ferman's departure. Channel 4 showed The Exorcist on UK broadcast television for the first time in 2001.</p><h4>After release</h4><p>The Exorcist set box office records that stood for many years. For almost half a century it was the top-grossing R-rated horror film. In 1999, The Sixth Sense finally bested The Exorcist as the highest-grossing supernatural horror film; it remains in third place. On both charts The Exorcist, along with The Blair Witch Project, are the only 20th-century releases in the top 10.</p><p>Since its release, The Exorcist's critical reputation has grown. According to the review aggregator website Rotten Tomatoes, 84% of critics have given the film a positive review based on 84 reviews, with an average rating of 8.30/10. At Metacritic, which assigns and normalizes scores of critic reviews, the film has a weighted average score of 82 out of 100 based on 20 critics, indicating \"universal acclaim\". Chicago Tribune film critic Gene Siskel placed it in the top five films released that year. BBC film critic Mark Kermode believes The Exorcist to be the best film ever made.</p><p>Director Martin Scorsese placed The Exorcist on his list of the 11 scariest horror films. Other filmmakers, including Stanley Kubrick, Robert Eggers, Alex Proyas and David Fincher also have cited The Exorcist as a favorite film. In 2008, the film was selected by Empire as one of The 500 Greatest Movies Ever Made. The New York Times put it on a similar list of a thousand films . John Carpenter listed The Exorcist as one of his top eight scariest horror classics and listed the film as an influence in his 1980 supernatural horror film The Fog.</p><p>When the film was re-released theatrically in 2000, some critics wondered whether it would affect contemporary audiences, since it had been so widely imitated and emulated. The Hartford Courant's Malcolm Johnson described it as a \"somewhat creaky antique ... in some ways, feels a little old hat in 2000.\" Some scenes, such as Ritalin being proposed as a treatment for Regan, provoked unintended laughter. But the film's performances were still effective, and the longer version made the medical professionals seem like \"witch doctors\".</p><p>But the Tribune found it \"even better than it was in 1973 ... it actually seems a deeper movie now.\" Friedkin, who had seemed an odd choice to direct at the time, now seemed to have been the best. \" made the story real—and more terrifying\", critic Michael Wilmington wrote. \" knows how to make the improbable real, how to convey a convincing atmosphere of modern chaos and dread.\"</p><br/><h3>Themes</h3><p>The Exorcist's box office success led critics and academics to consider its social resonance. Many have mentioned popular anxiety over the aftermath of the cultural, political and social upheavals of the late 1960s. \"The Exorcist communicates an image of a United States in an unstable state of change that can no longer avoid its real and historical systemic evils\", writes Amy Chambers. Kermode similarly noted that by stylistically distancing itself from the more Gothic horror films of the 1960s, the film \"presented a credible portrait of the modern urban world ripped apart by an obscene, ancient evil.\"</p><p>Stephen King calls The Exorcist \"a social horror film if there ever was one\" in his 1983 treatise on the genre, Danse Macabre. He sees the possessed Regan symbolizing for middle-aged viewers the outspoken youth protesting the Vietnam War, Danny Peary likewise notes the symbolic and real fragmentation throughout the film: \"With the world in such disorder, the Devil can make a dramatic entrance.\"</p><p>At the time of the film's release, the Watergate scandal, at the top of the news, was worsening, implicating President Richard Nixon. \"Maybe, between that and Vietnam, people were newly awake to a certain kind of pervading societal rot, something that the spectacle of The Exorcist might've mirrored\", wrote Tom Breihan for The A.V. Club in 2019. In a Christian Century article a year after the film's release, during which time Nixon had resigned, theologian Carl Raschke connected the two, calling them \"psychodramas of the American soul\" resulting from \"the cynical mood of our age by default from the wreck of traditional religious as well as social values.\"</p><p>Feminism has gotten considerable attention in discussions of The Exorcist. The U.S. women's liberation movement had enjoyed some early gains in legislatures and courts, and commentators have seen the film, in which a single working mother and her apparently uncontrollable daughter are ultimately rescued by patriarchal authority, as a reaction against feminism. Former studio executive Peter Biskind, in Easy Riders and Raging Bulls, describes the film as \"a male nightmare of female puberty. Emergent female sexuality is equated with demonic possession.\" For the male authority figures in The Exorcist, whether priests or physicians, Regan must be restored to her innocence through abusive and violent means if necessary, the aspect of the film that he notes led John Boorman to decline it.</p><p>Breihan reads the film itself as reactionary: \"The Exorcist seems like a transgressive work of art, but it's built on reverence of tradition\" he writes. \" almost sneers at the politics of the ’60s.\" Chris dismisses her film's take on student protest as \"the Walt Disney version of the Ho Chi Minh story\". In the only scene she is shown shooting, her character, a faculty member at the fictional college, grabs a megaphone and counsels a group of protesters against taking over the building, telling them change can only come from the system.</p><p>Many feminist critics, like Biskind, note the film's focus on the female body as the site of horror. \"When her body changes, Regan becomes someone else; someone sexual, whose desire is a dark visitor, hollowing her out and corrupting her from within\" writes Jude Ellison Doyle in Dead Blondes and Bad Mothers: Monstrosity, Patriarchy and the Fear of Female Power. \"To become a woman is to become the worst thing on Earth, the enemy of all that is pure or holy.\" But Australian film studies professor Barbara Creed, in The Monstrous-Feminine, which inaugurated psychoanalytic feminist film theory, counters the prevailing feminist take on The Exorcist by insisting that Pazuzu is female and thus the possession of Regan is itself a feminist act, exposing \"the inability of the male order to control the woman whose perversity is expressed through her rebellious body\", as she navigates an incestuous desire for her mother.</p><p>University of Toronto professor S. Trimble writes that the film tapped into \"white American fears of nightmare futures\" that could be brought about by the women's liberation, gay liberation and Black Power movements, which all challenged the established social order of the 1970s. As a film about \"a revolting girl revolting against the little-girl box in which she was stuck\" and army of men trying to put her back, The Exorcist fits into a tradition of horror movies that used gender-bending to create a monster, Trimble notes.</p><p>Texas State religious studies professor Joseph Laycock wrote that the popular embrace of The Exorcist also pointed to reactionary popular trends in American religion. \"The Exorcist is a depiction not of ecclesiastical Catholicism but of folk piety\", which he also describes as extra-ecclesiastical religion, pursued by the lay masses, \"incorporat beliefs about divine or supernatural intervention in the realm of everyday experience\", as tolerant of Ouija boards and practices from other spiritual traditions as it was devout in its Catholic faith. In the early 1970s, established organized religion in America had increasingly turned towards the rational as the country became more secular: \"The authentic folk piety depicted in The Exorcist likely appealed to audiences because it was a welcome alternative to rationalized religion and a cultural myth of universal secularization.\"</p><br/><h3>Litigation</h3><p>Lawsuits among the creators of The Exorcist began before the film was released, and continued into the 21st century. In early November 1973, THR reported that Blatty had sued the studio and Friedkin, over both the credits and Friedkin banning him from the set. Friedkin said he had only barred him from post-production. A week later executive producer Noel Marshall said Blatty had withdrawn his complaint against the studio; he eventually settled for the \"William Peter Blatty's The Exorcist\" line in the opening credits.</p><p>The next dispute involved Friedkin and Dietz. In February 1974 she claimed that he had made her sign a nondisclosure agreement concerning her work in the film. While Friedkin had, in earlier publicity for the film, denied any use of a double for Blair, by the end of the month Dietz was saying that she had neither claimed to have been Blair's only double for the possession scenes nor talked about it to the media. The Screen Actors Guild ruled her contract was not binding, but then Dietz declined to arbitrate the matter.</p><p>Around the same time, Warners paid Friedkin $4 million, his 10 percent share of the film's profits. A year later, he sued the studio, claiming it had withheld another $8.5 million he was due. By 1978 it was reported that Friedkin had settled. Blatty had by then sued Warners, claiming he was owed $1.5 million.</p><p>In 2001, following the release of the extended version, which restored 11 minutes of footage and did well critically and commercially, Blatty and Friedkin sued Warners, alleging that they had been cheated out of profits they would receive for helping promote the film. Specifically, they had been induced to do so by a promise of a share of the sale of the cable TV rights, which the studio gave to Turner Network Television and Turner Broadcasting System. Warners called the suit \"ludicrous\" Later that year, they sued again, alleging that Warners had further defrauded them by selling broadcast rights to CBS at a discount, through claiming itself as the sole author of the new version of the film when registering it with the U.S. Copyright Office and by failing to honor an oral profit-sharing agreement with Friedkin.</p><p>Nine years later, Blatty sued Warners again, asking for the opportunity to inspect the studio's records and accounts, to see whether he had been paid what he was owed. He argued that his deal with the studio made him a co-owner of the film property and thus he had unique rights to access those records. \" has asserted that Blatty must 'stand in line' with profit participants in other works who seek to audit,\" his complaint read, \"but who do not share Blatty's status as a co-owner.\"</p><h4>Copyright infringement claims</h4><p>Within a year of The Exorcist's release, two films were made that appeared to appropriate elements of its plot or production design. Warners took legal action against the producers of both, accusing them of copyright infringement. One of the films was pulled from distribution and the other one had to change its advertisements.</p><p>Abby, released almost a year after The Exorcist, put a blaxploitation spin on the material. In it a Yoruba demon released during an archeological dig in Africa crosses the Atlantic Ocean and possesses the archaeologist's daughter at home in Kentucky. Director William Girdler acknowledged the movie meant to cash in on the success of The Exorcist. Warner's lawsuit early in 1975 resulted in most prints being confiscated; the film has rarely been screened since and is not available on any home media.</p><p>Later, in 1975, Warners sued Film Ventures International (FVI) over Beyond the Door, also released in late 1974, alleging that its main character, also a possessed woman whose head spins around completely, projectile vomits and speaks with a deep voice when possessed, infringing the studio's copyright on Regan. Federal judge David W. Williams of the Central District of California held first that since Blatty had based the character on what he was told was a true story, Regan was not original to either film and thus Warner could not hold a copyright on Regan. Even if she had been a creation, she could not be copyrighted since she was subordinate to the story. The writers of the FVI film had also further distanced themselves from an infringement claim by having their possessed female, Jessica, be a pregnant adult woman.</p><p>Williams held for Warners on a minor issue. Some of Beyond the Door's advertising graphics, such as an image of light coming from behind a door into a darkened room, and the letter \"T\" drawn as a Christian cross, were similar enough to those used to promote The Exorcist that the public could reasonably have been confused into thinking the two films were the same, or made by the same people, and enjoined FVI from further use of those graphics.</p><br/><h3>Legacy</h3><h4>Effect on films and industry</h4><p>\"The Exorcist has done for the horror film what 2001 did for science fiction\", wrote Cinefantastique, \"legitimizing it in the eyes of thousands who previously considered horror movies nothing more than a giggle\". In the years following it, studios allotted large budgets to horror films with similar themes like The Omen, The Sentinel, Burnt Offerings, Audrey Rose and The Amityville Horror. Many had major stars, who until then had often avoided the genre until their later years. Friedkin's use of works like Polymorphia in the score also led to the use of similar modern avant-garde composers like Penderecki in later horror films like The Shining. Composers of original music for those films adopted some of their techniques, like dissonant intervals such as (particularly) tritones, sound massing and tone clusters, to create unease and tension.</p><p>The film's success led Warner to initiate a sequel, one of the first times a studio had done that with a major film not planned to have one, launching a franchise. While many of the classic horror films of the 1930s had spawned series of films, the practice had declined in the 60s. Also, with exceptions like Bride of Frankenstein, most sequels had been secondary properties for the studios. The other big-budget horror films made in the wake of The Exorcist also led to sequels and franchises.</p><p>Amy Chambers observes that Friedkin set a precedent not only by extensively consulting with technical experts in the subject matter, in The Exorcist's case physicians and priests, but foregrounding that reliance on expertise by including those experts' names and credentials in the film's credits and press kit, a practice now common.</p><h4>Cultural reference point</h4><p>The Exorcist has become a cultural reference point. Its imagery, particularly Regan in her bedroom, has been used by political cartoonists like Mike Luckovich and Mike Peters. In 1998, New York Times columnist Maureen Dowd invoked the film when criticizing the nation's apparent indulgence of President Bill Clinton's sexual indiscretions: \"eople are saying things so bizarre they could have come out of Linda Blair in The Exorcist. ... You expect the feminists' heads to start rotating on their necks any moment now.\"</p><p>Father Merrin's arrival scene has also been referenced. In an early episode of the 1982-83 CBS sitcom Square Pegs, Don Novello, as his Saturday Night Live (SNL) character Father Guido Sarducci, enters a classroom, similarly backlit amidst fog, in order to exorcise a character from possession by the Pac-Man video game. In an episode set on Halloween 2019, a first-season episode of Evil, another CBS series, paid homage to the scene by a meticulous recreation in which the black-clad character stepping out of a cab into a beam of light from an upstairs window at the home of a possibly possessed woman is a psychiatrist, not a priest.</p><p>In 1992, the hard rock band Pantera named its sixth studio album Vulgar Display of Power, from the possessed Regan's demurral when Karras asks why, if the possessing spirit is indeed the Devil, she would continue asking him to remove the straps on her arms rather than making them disappear. The title was reused for a book about the band's adventures on tour culminating in the onstage shooting death of guitarist Dimebag Darrell.</p><p>Popular comedy took inspiration from the film. SNL parodied the film during its first season, with Richard Pryor in the Karras role and Laraine Newman as Regan. In 2023, the show again parodied the film, with Jenna Ortega in the Regan role. Ghostbusters, the 1984 comedy blockbuster, included joking references to many successful horror movies from the previous two decades, including The Exorcist. In one scene, Sigourney Weaver's character has become possessed by an evil spirit; as Bill Murray's character attempts to communicate with her she begins to speak with a deep, husky voice and levitates above her bed. In 1990, Blair starred as a housewife needing exorcism in the parody Repossessed.</p><p>Court opinions in cases unrelated to the film have referenced it. In 1999, Massachusetts federal judge Reginald C. Lindsay, considering a product-disparagement suit brought by Gillette against competitor Norelco, noted that in one of the latter's commercials for its Reflex Action shaver \"the razor corrodes and twists its 'neck and head,' apparently in an effort to evoke recollection of a scene from the motion picture The Exorcist. At the same time, the voiceover states: 'A blade can leave you feeling irritated. What would possess it to do that?'\" A Colorado lawyer challenging his 2005 suspension from the bar admitted his own recorded voice on obscene phone messages he left his wife while under the influence of cocaine sounded like the possessed Regan. Litigants have made similar observations about people experiencing mental illness.</p><p>Religious wariness toward the film abated as it became accepted as a classic. \"The Exorcist exposed people around the world to the question of evil in a new and terrifying way\", wrote Jesuit Jim McDermott in a 2019 issue of America. \"It is a film that takes on big questions and aspires to do much more than shock.\" In the heavily Baptist South, The Exorcist was seen as acceptable viewing amid denunciations of many other horror films that supposedly promoted the occult, because, as a writer in Slate recalls, it and movies like The Omen \"didn't encourage people to dabble in the dark arts, they warned people. More to the point, they acknowledged the existence of God, the influence of Satan, and the truth of the Bible.\" British Baptist minister Peter Laws has credited the film with persuading him to abandon his youthful atheism and become a Christian:</p><blockquote>The Exorcist, like many other horror films I loved, took the supernatural seriously. It presented a world in which devils and demons weren't metaphors ... they were a stark, terrifying reality. Plus, it suggested another whacky idea: that God might be the only truly effective answer to evil ... This film, and the thousands I watched after it, forced me to consider an utterly subversive notion: that God might be real and the church might sometimes be filed under \"solution\", not \"problem\" ... after a long road of thought, I took the step that changed my life: I became a Christian</blockquote><p>In 2015, the District of Columbia posted a commemorative plaque on what had become known as the Exorcist steps in Georgetown, since they had become a popular tourist attraction. At a ceremony the day before Halloween that year, Blatty and Friedkin were among those present as the plaque, with Mayor Muriel Bowser's signature, was unveiled. Friedkin said that having his name on the plaque was a greater honor than another Academy Award would have been, since \"the Academy may come and go. Its importance has been diminished over the years anyway. But that plaque on those steps is going to be there for a very long time.\"</p><p>Vietnamese-born Danish artist Danh Võ saw The Exorcist with his family after his Catholic mother became interested in horror films following the family's journey from Vietnam to Europe after the war. He was seven at the time. In 2016, he developed an exhibit inspired by the film that, other than the title, a string of 266 obscene phrases shouted by the possessed Regan to Karras, does not visually reference the film. The White Cube gallery in Hong Kong, which showed it, describes it as 600 carved mammoth fossils and a 17th-century ivory figurine suspended from the gallery's ceiling.</p><h4>Accolades</h4><p>The Exorcist won two of its 10 Academy Awards nominations. It was the first horror film to be nominated for Best Picture. It won four of seven Golden Globe nominations, including Best Motion Picture – Drama.</p><p>Robert Knudson and Chris Newman won The Exorcist's first Oscar, for Best Sound, thanking Friedkin, the studio and their crews. Blatty won for Best Adapted Screenplay; the award was presented by Angie Dickinson and Miller, who applauded Blatty vigorously. In his short speech, Blatty posthumously thanked William Bloom, \"who taught me the rudiments and the craft of screenwriting\" and Friedkin. He also paid tribute to his parents, \"who came to this country on a cattle boat and whose love and whose courage have brought me to this moment and to this place.\"</p><p>The next morning, Blatty complained bitterly about the film's snubbing. In commentary on the front page of The Hollywood Reporter (THR), he said it was a \"disgrace\" that The Exorcist had not won all the awards it was nominated for. It was, he asserted, \"head and shoulders, the finest film made this year and in many other years\".</p><p>\"Since I won an award, perhaps it would be considered ungracious,\" he admitted to THR. \"But I'd rather be ungracious than be a hypocrite.\" He accused veteran director George Cukor of having led a campaign against giving the film any awards.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominees</th><th>Result</th><th>Ref.</th></tr><tr><td rowspan=\"10\"><span>Academy Awards</span></td><td><span>Best Picture</span></td><td><span>William Peter Blatty</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"10\"></td></tr><tr><td><span>Best Director</span></td><td><span>William Friedkin</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress</span></td><td><span>Ellen Burstyn</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>Jason Miller</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actress</span></td><td><span>Linda Blair</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay – Based on Material from Another Medium</span></td><td>William Peter Blatty</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Art Direction</span></td><td><span>Bill Malley</span> and <span>Jerry Wunderlich</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Owen Roizman</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Editing</span></td><td>Jordan Leondopoulos, <span>Bud Smith</span>, <span>Evan A. Lottman</span> and Norman Gay</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound</span></td><td><span>Robert Knudson</span> and <span>Chris Newman</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"7\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Motion Picture – Drama</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"7\"></td></tr><tr><td><span class=\"mw-redirect\">Best Actress in a Motion Picture – Drama</span></td><td>Ellen Burstyn</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor – Motion Picture</span></td><td><span>Max von Sydow</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actress – Motion Picture</span></td><td>Linda Blair</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director – Motion Picture</span></td><td>William Friedkin</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay – Motion Picture</span></td><td>William Peter Blatty</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Most Promising Newcomer – Female</span></td><td>Linda Blair</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><h4>American Film Institute Lists</h4><ul><li>AFI's 100 Years...100 Thrills – No. 3</li><li>AFI's 100 Years...100 Heroes and Villains: Regan MacNeil – No. 9 Villain</li><li>Regan MacNeil – No. 9 Villain</li></ul><br/><h3>Sequels and prequels</h3><p>The film has gone on to spawn multiple sequels and an overarching media franchise including a television series.</p><p>A year after The Exorcist's release, New York reported that a sequel was planned, with Friedkin producing and Blatty uninvolved. Friedkin backed out, as did the cast except Blair and von Sydow. John Boorman, who had turned down the original as \"negative and destructive\", directed, considering the sequel to be \"healthy\" by comparison. Richard Burton played the lead; the film also suffered production problems, particular cast and crew health issues, and was beset by regular script rewrites and personnel changes. On release in 1977, Exorcist II: The Heretic had what was then Warners' largest opening-day gross. It made some money but was less successful than the original.</p><p>Afterward, Blatty and Friedkin began planning a story and script for a sequel of their own. Blatty continued after Friedkin dropped out and developed the story as a novel: Legion, in 1983, after Hollywood showed little interest. He saw it as an exploration of the same themes within the same fictional universe by some of the original's minor characters. The media saw it as a sequel, and it sold well.</p><p>Blatty adapted a more streamlined script from the novel, which Morgan Creek Productions insisted on calling it The Exorcist III despite the lack of exorcism scenes (one was added after principal photography, with Nicol Williamson in the role). Blatty directed, with George C. Scott replacing the late Lee J. Cobb as Kinderman. The film took in $39 million on its release in 1990;</p><h4>Exorcist: The Beginning and Dominion</h4><p>Morgan Creek and James G. Robinson, producer of Exorcist III, had commissioned the development of a prequel story about a young Father Merrin's first confrontation with Pazuzu. It was not produced until 2002, with Paul Schrader directing and Stellan Skarsgård in the lead.</p><p>Robinson hired Renny Harlin to reshoot most of the film with Skarsgård and a new cast after disagreements with Schrader. Harlin's version, heavy on action and horror, was released in August 2004 as Exorcist: The Beginning, and failed critically and commercially. Schrader's version got a limited release in May 2005 as Dominion: Prequel to the Exorcist, a version Blatty found much better.</p><h4>TV series</h4><p>The 2016 Fox TV series The Exorcist followed two priests investigating possible cases of demonic possession and performing exorcisms. In the fifth episode one guest character was revealed as the adult Regan, making the series a direct sequel to the original film. It was cancelled after its second season.</p><h4>2020s reboot trilogy</h4><p>In 2020, Morgan Creek announced a reboot of the film. Fans petitioned to have it canceled. At the end of the year, Blumhouse Productions and Morgan Creek said that the reboot would instead be a \"direct sequel\" to the 1973 film directed by David Gordon Green. In July 2021, it was announced that Green would direct a trilogy produced by Jason Blum alongside James and David Robinson. Burstyn will reprise her role from the original film, with Leslie Odom Jr. co-starring. The projects will be joint ventures between Blumhouse and Morgan Creek, to be distributed by Universal, which joined with Peacock to purchase distribution rights for $400 million. The second and third films are being optioned as Peacock exclusive films; As of August 2022, theatrical release for the first film, The Exorcist: Believer, is scheduled for October 13, 2023.</p><br/><h3>Related works</h3><p>Blatty's script for the film has been published in two versions. William Peter Blatty on The Exorcist: From Novel to Film, in 1974, included the first draft of the screenplay. In 1998 the script was anthologized in The Exorcist/Legion - Two Classic Screenplays, and again as a standalone text in 2000.</p><br/>"
  },
  "errorMessage": ""
}