{
  "imDbId": "tt0099685",
  "title": "Goodfellas",
  "fullTitle": "Goodfellas (1990)",
  "type": "Movie",
  "year": "1990",
  "items": [
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw2923502",
      "warningSpoilers": false,
      "date": "17 December 2013",
      "rate": "10",
      "helpful": "408 out of 457 found this helpful.",
      "title": "In one word: perfection",
      "content": "Needs to be seen to be believed; in one word: perfection. Every frame, every voice-over, every song - it all comes together at the exact right moment to create the perfect film experience. This film makes you really understand and feel what makes the American mafia so compelling; in the eyes of a kid, who was unfortunate enough to grow up in a tough neighborhood, those gangsters are rock stars. Live fast, die young - but when you die, it ain't gonna be of a glamorous suicide or drug overdose - the ending will be brutal, ugly and sad. And it may very well be one of your best friends that will blow your brains out.I'll never get tired of watching Goodfellas; the entertainment value of this film is just amazing. It doesn't happen very often that every person involved in the process of making a film is at the peak of his/her game. And rarely do art and entertainment come together the way they did here. Storytelling with impeccable pacing, this is what it's like when a master composer conducts his masterpiece. All hail the king; the most versatile and talented filmmaker of his generation: Martin Scorsese.My vote: 10 out of 10Favorite films: IMDb.com/list/mkjOKvqlSBs/Lesser-Known Masterpieces: imdb.com/list/ls070242495/Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/Favorite TV-Shows reviewed: imdb.com/list/ls075552387/"
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0282597",
      "warningSpoilers": true,
      "date": "31 March 2003",
      "rate": "10",
      "helpful": "536 out of 696 found this helpful.",
      "title": "An Offer You Can't Refuse...",
      "content": "\"As far back as I can remember, I've always wanted to be a gangster.\" -- Henry Hill, Brooklyn, N. Y. 1955.Gangsters are all around us. Everyone knows it, not everyone wants to accept it. \"Goodfellas\"--based on true events--explores the lives of gangsters, chronicling the events through the eyes of Henry Hill (Ray Liotta), who gets involved with the Mafia at a young age and continues his \"career\" throughout the film.As he gets older, he marries and has children, but still works for the organized crime family, under mob boss Paulie (Paul Sorvino); and he is friends with Jimmy (Robert De Niro), a calm, steady gangster; and Tommy (Joe Pesci), a wild man with serious mental problems.Eventually Henry's life goes down the gutter, leading to drug abuse and paranoia, that leads to other unfortunate incidents that will be ruined if I type any more about them.\"Goodfellas\" is one of the best films I have ever seen. It's a tour de force of breathtaking images, witty scriptwriting, superb acting and realistic violence.Robert De Niro gives one of his best performances -- ever -- as Jimmy, even if he's not in the film as much as you might be lead to believe from the front cover.Joe Pesci is in this movie about as much as De Niro, maybe a bit more or less. But when he's on screen there's no doubting he's on screen--he's very hard to miss. A short, deranged, loud-mouthed man with something wrong in his head. Someone makes an insult toward him and he shoots them, and then laughs. It's quite disturbing. I am a huge fan of Pesci, and I tend to love his characters, but he really makes you feel sick towards his character in \"Goodfellas,\" while at the same time taking a strange liking to him. That just goes to show how good of an actor Pesci is.Ray Liotta is perfect as Henry Hill. I can't think of a better actor to play him. He captures a sense of innocence yet at the same time a feeling of violence. I love the scene where he walks over to a man's house with a regular expression on his face. \"What do you want, f&*^&?\" the man asks. Liotta continues walking, takes out a gun, and starts to continually beat the man in the skull with the butt of his gun. As Henry walks back to his car, his face is disturbing and his expression stays with you for a long, long time.Martin Scorsese is a brilliant director and his work here is fabulous; it's been recreated by other directors (namely Paul Thomas Anderson in \"Boogie Nights\") and there's a reason: it's great stuff. He totally deserved to receive Best Director in 1990, but of course he didn't. (Rumor has it the Academy frowns on Scorsese's use of racial slurs in his work. Oh boo hoo, get over it.)The movie is based on the true-crime memoirs of the real-life Henry Hill, whose novel with Nicholas Pileggi -- \"Wiseguys\" -- was adapted into a screenplay by Pileggi and Scorsese. The book itself was fantastic and insightful; the screenplay is even better. The dialogue is incredible.Anyway, \"Goodfellas\" has to be one of the best films I've ever seen--a true modern classic that will be remembered for what it is: One of the greatest tales told on screen. It's an offer you can't refuse!"
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw2159982",
      "warningSpoilers": true,
      "date": "18 November 2009",
      "rate": "10",
      "helpful": "85 out of 106 found this helpful.",
      "title": "The best mobster film ever made",
      "content": "After you see this movie, all other mobster movies you see or ever have seen will seem like garbage. They and their cast of characters will all appear cartoonish in comparison. Of course, this is a movie about the mafia from the working man/gangster point of view, where \"The Godfather\" was a mafia movie filmed from the viewpoint of the executive suite, so there really is no valid comparison there. \"Goodfellas\" really does seem ahead of its time when you realize that the only artistic work about the mafia that compares to it in quality is the HBO series \"The Sopranos\", which debuted nine years after this movie was made.\"Goodfellas\" tells the real-life story of mobster Henry Hill, and it is largely true, although there are individual scenes that are out of sequence and others that were added for dramatic effect, such as Karen Hill flushing the cocaine down the toilet during the drug bust. Also, Tommy, the character that Joe Pesci played and the part for which he won an Oscar, was actually a composite of two separate gangsters. Other details are omitted completely, probably because they would have spun the movie off in too many different directions. For example, crime boss \"Big Paulie\" actually was having an affair with Henry Hill's wife, Karen. When Tommy tried to rape her and Paulie found out, that was when he alerted the Gambinos to the fact that Tommy had killed their missing crew member, \"made man\" Billy Batts, nine years earlier. This is the true reason that it took so long for Tommy to be killed over that incident. Thus, masterful direction of the story by Martin Scorsese in what was probably his finest film is why the audience has a more cohesive view of the mobsters portrayed in this movie than if we had been told every last detail.What really makes this movie great is all of the personal details that enable you to see these mobsters living a largely suburban life, concerned about kids' birthday parties and getting the sauce just right for dinner, and all the while completely immersed in a completely amoral lifestyle in which murder and bribes solve everything- a lifestyle to which they would never voluntarily choose an alternative."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2366500",
      "warningSpoilers": false,
      "date": "9 January 2011",
      "rate": "10",
      "helpful": "58 out of 74 found this helpful.",
      "title": "A great director at the peak of his talents",
      "content": "It is hard to describe the brilliance that is Goodfellas. As good as Raging Bull and Taxi Driver are, I think Goodfellas is Martin Scorsese's best film and is a textbook example of a great director at the peak of his talents. The film crackles with raw energy and enthusiasm, the film is superbly directed and the final sequence is nothing short of stunning. The script is also excellent with memorable quotes, the story is never less than compelling and the pop and rock soundtrack is winning. The cinematography and detail is immaculate, and the ensemble cast is one of film's finest. Joe Pesci won an Oscar for his performance, and as good as he was, he is perfectly matched by Robert DeNiro and Ray Liotta. All in all, it is a brilliant film and an instant classic no matter what time, day, week or year. 10/10 Bethany Cox"
    },
    {
      "username": "mhasheider",
      "userUrl": "https://www.imdb.com/user/ur0664492",
      "reviewLink": "https://www.imdb.com/review/rw0958649",
      "warningSpoilers": false,
      "date": "6 November 2004",
      "rate": "10",
      "helpful": "335 out of 481 found this helpful.",
      "title": "One word: priceless",
      "content": "If there was one word that I could use to describe Martin Scorsese's \"Goodfellas\": it'd be priceless.A surreal and deeply fascinating take on life of Henry Hill who was involved in the Mob for three decades and his rise throughout the time span (and Nicholas Pileggi's book \"Wiseguy\").There isn't a single moment in the movie where it doesn't miss a beat, you could only tell by the atmosphere of the time period and it seems so real.The performances in this film simply make it even more memorable and how the characters are portrayed here especially by Ray Liotta, Robert De Niro, Joe Pesci (who won an Oscar for Best Supporting Actor), and Paul Sorvino are believable and easy to understand that they were a family, very close and tightly knit to the core. Also, how director Martin Scorsese lets the movie pace itself and keeps the viewer off guard in what happens deserves a lot of credit."
    },
    {
      "username": "OriginalMovieBuff21",
      "userUrl": "https://www.imdb.com/user/ur3341647",
      "reviewLink": "https://www.imdb.com/review/rw1058502",
      "warningSpoilers": false,
      "date": "11 April 2005",
      "rate": "10",
      "helpful": "330 out of 498 found this helpful.",
      "title": "The greatest mob film still today",
      "content": "Amazing is the one and only word to say for this film. I have always thought that Goodfellas was one of the greatest films ever made and set a landmark in the 90's or even in movie history. I bought Goodfellas last week and I got to watch the film a couple days ago. I really just couldn't lay my eyes off the film and everything about it was just simply worth watching. The acting was excellent, Ray Liotta, Robert DeNiro, Joe Pesci, Lorraine Bracco, and other actors did great and almost all of the characters they portrayed were 100% accurate. The camera-work also was brilliant and Martin Scorsese does a beautiful job by putting excellent camera shots in his films and I give him high credit for that. The soundtrack too is one of the best soundtracks ever made and the song \"Layla,\" put chills down my spine of how great this song fitted the film. Overall, Martin Scorsese made his best film in my opinion and him and Nicholas Pileggi made an excellent and sharp script that made this, the greatest mob film still today.Hedeen's Outlook: 10/10!! **** A+"
    },
    {
      "username": "whoisfishmooney",
      "userUrl": "https://www.imdb.com/user/ur149550104",
      "reviewLink": "https://www.imdb.com/review/rw7935672",
      "warningSpoilers": false,
      "date": "10 March 2022",
      "rate": "10",
      "helpful": "43 out of 48 found this helpful.",
      "title": "Iconic",
      "content": "One of the most iconic movies of the 90s. So many unforgettable moments in cinema history. Quotable lines throughout also. A fun film on a bit of a negative subject."
    },
    {
      "username": "alicetich",
      "userUrl": "https://www.imdb.com/user/ur149554785",
      "reviewLink": "https://www.imdb.com/review/rw7914580",
      "warningSpoilers": true,
      "date": "3 March 2022",
      "rate": "10",
      "helpful": "38 out of 41 found this helpful.",
      "title": "Aged like a fine wine",
      "content": "This film was released 32 years ago but still looks as good now as it did then. Great seeing the famous heist on the airport given mainstream light as it was a huge crime back all those years ago."
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0282302",
      "warningSpoilers": false,
      "date": "21 July 2000",
      "rate": "",
      "helpful": "267 out of 440 found this helpful.",
      "title": "The Definitive Film of the 1990s",
      "content": "\"GoodFellas\" may be the most important film of the 1990s in the fact that its incredible success led to some of the other great movies of the decade. Films like \"The Silence of the Lambs\", \"The Crying Game\", \"Pulp Fiction\", \"The Usual Suspects\", \"Fargo\", and \"L.A. Confidential\" would have likely never been made as well as they were without the influence of Scorsese's \"GoodFellas\". The film is an intense study of a Mafia family over a 30-year stretch. Ray Liotta plays the half-Irish, half-Sicilian kid from Brooklyn whose only dream is to be a gangster. Although Liotta's story is at the heart of \"GoodFellas\", it is the supporting cast that is the film's calling card. Robert DeNiro gives one of his greatest performances, Paul Sorvino is quietly effective, and Lorraine Bracco (in an Oscar-nominated role) does the best work of her career. However, it is Joe Pesci (in his well-deserved Oscar-winning turn) who steals every scene as the one who does the \"dirty work\". This is probably the definitive film in a decade that produced many film-noir styled classics. 5 stars out of 5."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1599619",
      "warningSpoilers": false,
      "date": "15 February 2007",
      "rate": "9",
      "helpful": "18 out of 25 found this helpful.",
      "title": "The Criminal Mindset",
      "content": "The gangster film has been redefined so many times in cinema history it will be interesting to see how it is redefined once again. Goodfellas is a milestone film in that regard because just as Public Enemy and Little Caesar defined it in the Thirties, The Godfather trilogy in the seventies and eighties, Goodfellas set the standard that all other films including Martin Scorsese similar Casino try to meet. The interesting thing is that Martin Scorsese is young enough to redefine it again with another work.With Ray Liotta narrating his own life in crime in a flashback as real life criminal Henry Hill, Martin Scorsese offers us one fascinating glimpse of the criminal life in the Eisenhower to Reagan era. Henry Hill even as a child got sucked into the criminal life as a kid, as he said all he ever wanted to be was a gangster. Tutored by both Robert DeNiro and Paul Sorvino, Liotta takes part in one of the biggest heists of all time of Lufthansa Airlines at JFK Airport during the seventies. Goodfellas is the story of the events from Henry Hill's perspective leading up to the heist and the aftermath.For myself I've never seen the gangster mentality better expressed on screen except maybe by Sean Connery in Family Business. Liotta and Connery operate from the same mindset. If you work hard and hope it pays off in success, you're a dope. If you want something, just take it. When you come right down to it, that's how criminals think, it's the rest of us who are fools.Goodfellas was nominated for several Oscars, but came away with only one winner, Joe Pesci in the role of crazy Tommy DeVito. He's another criminal type, one who's driven by a terrible inferiority complex due to his short stature and does terrible things even to his own peers. And those peers don't forget as you see what happens to Pesci in Goodfellas. This turned out to be a career role for Pesci. He's a multi-talented man who's got an incredible range and can play everything from the Home Alone comedies to stone killers like here in Goodfellas or in Casino.There's usually a contest in which Scorsese fans argue whether Casino or Goodfellas is better. I happen to like Casino, but without the success of Goodfellas, Casino would not have been made.For a fascinating look at the criminal mindset, Goodfellas is an absolute must."
    },
    {
      "username": "tothestables",
      "userUrl": "https://www.imdb.com/user/ur150462964",
      "reviewLink": "https://www.imdb.com/review/rw7918687",
      "warningSpoilers": true,
      "date": "4 March 2022",
      "rate": "10",
      "helpful": "28 out of 29 found this helpful.",
      "title": "Instant classic",
      "content": "The rise and Fall of Henry Hill. A kid who always wanted to be a gangster and his progression up the criminal ladder to his ultimate downfall with those around him. Great film."
    },
    {
      "username": "arthurclay",
      "userUrl": "https://www.imdb.com/user/ur2757172",
      "reviewLink": "https://www.imdb.com/review/rw0282703",
      "warningSpoilers": false,
      "date": "29 August 2004",
      "rate": "",
      "helpful": "18 out of 23 found this helpful.",
      "title": "The Mob...Revealed",
      "content": "The movie that dispelled the romantic myths about La Cosa Nostra and showed it as it really was. \"The Godfather\" for the 90's minus the silly notions of love, honor, and family. Henry Hill (Ray Liotta) is a half-Irish, half-Italian who rises to prominence in Paul Cicero's (Paul Sorvino) Lucchese Crime Family along with Jimmy Conway (Robert DeNiro) and Tommy DeVito (Joe Pesci). This is his story of hi-jacking, stealing, cheating, killing and finally drug dealing. He makes no excuses about what he does. Simply put he is just doing business and trying to survive on the mean streets of New York City. He explains the trials and tribulations of being a mobster and what it's like to have to do these things and live with the consequences. Cicero, an aging old-time underboss, heads a dangerous and powerful organization that enjoys free reign over the neighborhood in which Hill lives and recruits him when he is only a kid to work for them and learn to \"score\" more specifically, the art of committing crime. Hill quickly hooks up with veteran criminal Jimmy \"The Gent\" and his protege Tommy to hi-jack trucks from the Idlewild Airport. This makes these three rich and respected in the underworld but there is a new game in town. Narcotics. They quickly undertake this highly profitable business even though they know it is against the expressed rules of Paulie. This combined with another serious rule violation and the score of a lifetime sets them up for their own possible demise. Lorraine Bracco co-stars as Henry's wife. A marvelous true life story of one of the most violent and profitable street crews in the history of the American Mafia. The best movie of 1990."
    },
    {
      "username": "Infofreak",
      "userUrl": "https://www.imdb.com/user/ur0381265",
      "reviewLink": "https://www.imdb.com/review/rw0282591",
      "warningSpoilers": false,
      "date": "17 March 2003",
      "rate": "",
      "helpful": "150 out of 261 found this helpful.",
      "title": "Simply a masterpiece. Scorsese's last truly great movie (to date).",
      "content": "'Goodfellas' is a masterpiece, pure and simple. While not my favourite Martin Scorsese movie it is a stunning achievement, and one of his very best movies. The film is stunning technically. The consistently fine acting by the large ensemble cast (both known and unknown), the cinematography, editing, dialogue, brilliant use of music, it's all breathtaking. But Scorsese and co-writer Mitch Pileggi never lose lose sight of their main goal - to tell a story. And in that it's really hard to beat this movie. As to the actors De Niro is on top form, Ray Liotta is the best he's ever been, and this is Joe Pesci's definitive performance. Plus you have Lorraine Bracco, Paul Sorvino, Michael Imperioli, and lots of well known faces in small but important roles (Debi Mazar, Samuel L. Jackson, Illeana Douglas, Kevin Corrigan), plus dozens of unfamiliar actors (and non-actors) who are all so good it seems unfair just to single out the \"stars\". (Also keep an eye out for Vincent Gallo in a few scenes. He has no lines, but looks cool!). 'Goodfellas' is (to date) Scorsese's last Great Movie, and one of the very best films of the 1990s. Absolutely essential viewing for any movie fan, this tremendous film is not to be missed! Highly recommended!"
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8771335",
      "warningSpoilers": false,
      "date": "1 January 2023",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Martin Scorsese's masterpiece.",
      "content": "The story of Henry Hill's life from youth to adulthood, from his own words.'Never rat on your friends, and always keep your mouth shut.' The lines are as sharp as those suits.Martin Scorsese's incredible masterpiece still holds up as an out and out classic. Easily one of the best films to come out of the 90's, the direction, the visuals, the storyline are all fantastic, it's a film that never dates, it's as gritty, hard hitting and stylish as ever.The characters are incredibly rich, and there's such a variety of them. Some of the most awesome acting you'll see, the likes of De Niro, Liotta, Pesci and Sorvino,I can only imagine just how many films and TV series that this film inspired.One of the best films ever made, 10/10."
    },
    {
      "username": "Robert_duder",
      "userUrl": "https://www.imdb.com/user/ur1697212",
      "reviewLink": "https://www.imdb.com/review/rw1664839",
      "warningSpoilers": true,
      "date": "29 May 2007",
      "rate": "6",
      "helpful": "61 out of 105 found this helpful.",
      "title": "As good as those fellas are...I just don't get it",
      "content": "I have nothing against gangster films and I love Deniro, and Liotta and Pesci...in moderation...The Godfather were brilliant films and I finally made my way around to seeing the infamously talked about 'Goodfellas.' I don't get it. I'll take the heat from any fans and I know there are scores of them...Goodfellas was average at best and simply a trashy look at a mobster from childhood to his end in the mob with some decent but over the top performance, brutally gratuitous language and violence. I suppose in some circles that equivalents to a great film but I need far more. I mean even the story has little depth to it and it's more or less an extended episode of The Sopranos without the character depth. I suppose after having the film hyped for years and hearing about the 'classic' I had high expectations but for me it was run of the mill, annoyingly loud and abrasive but with some good direction. Scorsese knows how to make an epic from beginning to end starting the film in the 50's and 60's and taking it all the way to the mid 80's is a challenge and he does it flawlessly. The gritty underworld, the dark lighting, the facial expressions all very good but put to a pointless story and sub par characters unfortunately.I finally know now why Ray Liotta is still around and still gets parts because I always found him a little obnoxious in roles and I never realized he single handedly headlined Goodfellas and is great at it. His character might be the only one in the film given any depth considering he is the narrator and focus of the film. Disgustingly Liotta got no nomination that year which is absurd because if this film deserved anything (which I don't think it did) Liotta's role was it. Robert Deniro commonly gets credit for the film as being the headliner which is also a bit absurd. He might be the big name for the film but his role was small. He didn't make a significant part in the film until a good hour into it and his role was small but he still certainly brought his Deniro class and style to the ensemble. I think they would have done better to focus more on his character and his relationship with Liotta's character. They had good chemistry but just when you wanted to see more...they moved on to something else. Joe Pesci was over the top insane, downright disturbed Tommy Devito. His performance in this film is legendary \"Oh you think I'm a clown?\" but to be perfectly honest he was ridiculous. His performance wasn't sincere or believable and he was downright annoying. He was loud and abrasive and his barrage of gratuitous language actually made the film less watchable and I am not against the use of four letter words in film but his was too much. Lorraine Bracco was quite good in her pre-Soprano role as Liotta's wife Karen who sticks with him through pretty much everything and has some powerfully emotional swings throughout the film. Paul Sorvino is good as the head of the mob family, Paulie, but he doesn't make an impact. You don't really believe anyone would respect him. He's quiet and laid back and basically hiding throughout most of the film. At least with Brando's Godfather he was an image, an icon, something you just were in awe of. The cast all work well together but their characters are so thinly written you just don't give a damn about a single one of them except maybe a little for Liotta's Jimmy Conway.I get that I'm in a severe minority speaking this way about this film and that director Martin Scorsese is like a god to some but I just didn't seem the talent in this film. Scorsese showed talent in The Departed and the cast was a million times better than Goodfellas and deserved all of it's acclaim but I personally think Goodfellas is more of a non-thinking man's mob movie where bloody brutal kills and 1000 times hearing the 'F' word would prompt a dull chuckle as though the audience were 10. No I am not trying to insult anyone I was just severely disappointed by this film after having expected a brilliant classic which I will say hands down is not the case. I suppose if you like the crime genre or moreso the gangster drama than you must see Goodfellas anyways but I can promise you there is FAR better out there than this average, poorly written film. 6/10"
    },
    {
      "username": "muamba_eats_toast",
      "userUrl": "https://www.imdb.com/user/ur78018459",
      "reviewLink": "https://www.imdb.com/review/rw5675239",
      "warningSpoilers": false,
      "date": "25 April 2020",
      "rate": "8",
      "helpful": "12 out of 16 found this helpful.",
      "title": "Slightly disappointed but still very good",
      "content": "Having never seen it before but heard so much about it I was expecting it to be one of the best films I've ever seen instead it was just very good in my eyes. Potentially it has lost some originality by so many other films copying features of it that it just didn't seem new anymore but whilst nothing was wrong with it and like I said it was very good with some fantastic performances it just didn't stand out against so many others of this genre for me."
    },
    {
      "username": "baumer",
      "userUrl": "https://www.imdb.com/user/ur0355122",
      "reviewLink": "https://www.imdb.com/review/rw0282521",
      "warningSpoilers": true,
      "date": "16 September 1999",
      "rate": "10",
      "helpful": "92 out of 158 found this helpful.",
      "title": "Scorsese's best",
      "content": "Goodfellas makes you feel like you are watching guys that you know or knew. To this day, I have a friend that still talks like Jimmy Two Times. He always says things like \"Nice Nice\" and that was just a background piece in Goodfellas. But that is the point, all that is background is just as important as the main players and locales. It all paints us a perfect picture of what mob life must be like. And with all due kudos to The Godfather, but there is no other film that has ever made mob life look so real and feel so tangible the way Goodfellas does.To say that Joe Pesci is the best part of this film would be to discredit the rest of the cast, but at the same time, you have to mention him in some way. His portrayal of Tommy is haunting. Here is a man that is so insecure and wants to be the top dog, the made man so bad that he can't decipher between what is a joke and what is disrespect towards him. Of course the scene in question is when he shoots a common boy for telling Tommy to screw himself after he shot him in the leg. You would think the guy has a right to let off a little steam and vent, but Tommy is always looking for the diss. He is always looking to find some hidden gesture from someone that is putting him down. Even at the beginning when he is getting on Henri in the now famous \" You're a funny guy \" scene. He is kidding with Henri but deep down inside he is angry with him, you can see it and feel it. Joe Pesci gave the performance of his career and he richly deserved to win best supporting actor that year.The story and script by Pileggi is sheer inside brilliance. You can feel the inside observations that no one can have except for a guy that spent his whole life on the inside. They ring so true and they get into your blood. From scenes like the fat guy running around delivering messages to the other mob guys because he doesn't like to use the phone to the scene when Henri, Jimmy and Tommy have Billy Bats in the trunk but they stop off at Tommy's moms house for a late night dinner of pasta and such. They also have to borrow a sharp knife to finish off the guy in the trunk, but to his mom they have to cut off the hoof of a dear that hit the car. And the scene where Tommy does kill the young kid for joking with him and then Jimmy gets mad at him, not for killing the guy but because he doesn't want to dig a hole tonight. There are so many tiny observations in Goodfellas that give it the authenticity it has. And it is a film that stays with you for years to come. I think this is Scorcese's best film and although I understand and accept why the academy awarded Dances With Wolves the accolades it did, if this film would have swept the Oscars that year, no one would have been surprised. It is a landmark film and I think it is one of the best films ever made. And again, taking no credit away from Coppolla's Godfather epics, but this gets inside the mafia on a deeper level. It goes one step beyond what Coppolla gave us, and for that Goodfellas should be remembered as the best film about gangsters ever made."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0282420",
      "warningSpoilers": false,
      "date": "30 January 2002",
      "rate": "",
      "helpful": "24 out of 40 found this helpful.",
      "title": "Classic modern day gangster film",
      "content": "Starting with the 1950's, we follow Henry Hill from a teen who tries to realise his dream of `always wanting to be a gangster'. He goes from running errands for Paulie Cicero to become a trusted man within his organisation. Working with James Conway and Tommy De Vito, Henry navigates his violent lifestyle where death is never more than a few steps away.For my generation this was one of our first introductions to Scorsese doing a real tour-de-force of a film - I was too young to appreciate Raging Bull and his 70's work when it first came out and the eighties were a quiet period (except the brilliant king of comedy). So here was a great introduction to a fanatastic director. The plot is spread over such a long time (in terms of story years) that it's hard to get beneath the surface events, but this is a very minor problem given that it's such a great ride. The focus is on events and the culture rather than a deep story and as such Scorsese works with set pieces and events rather than too much characterisation. However the story moves so effectively through the action - Scorsese uses long tracking shots, pumping soundtracks and scenes of building tension and sudden violence to create a masterful experience.The weakness with lack of depth is really put to the back of your mind by the action, the direction and the performances. The story is well held together by Hill's narrative and the shallowness is easily over looked. Liotta is excellent as the aspiring gangster and is full of self seeking menace. De Niro does what he does best in terms of the Irish gangster role but the standout is Pesci. Pesci gives a strong role as the vicious Tommy and deserved his Oscar. The rest of the cast are all excellent whether it's major roles (Paul Sorvino, Lorraine Bracco) or minor characters (Frank Vincent, Sivero).The real star here is Scorsese - he uses the camera and the soundtrack to great effect and gets great performances from his cast. A modern gangster feast."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3510741",
      "warningSpoilers": true,
      "date": "24 July 2016",
      "rate": "10",
      "helpful": "13 out of 20 found this helpful.",
      "title": "Scorsese's masterpiece stands the test of time",
      "content": "Martin Scorsese's unflinching portrayal of life in the mafia is a rightly acclaimed epic, at times funny, depressing but most of all frightening, all the more so because it's based on a true story. Basically it's the story of Ray Liotta's character's rise and fall in the mafia, and the way his relationships change with the various figures there as times come and go.The acting is what makes this film so engaging, and Ray Liotta excels as the bright young man who eventually becomes a drug addict. His transformation is brilliant as he ages thirty years and the acting choice couldn't have been better. Robert De Niro is on hand to deliver some real class to the proceedings too, and he's as good as he ever was as the seemingly nice but deadly Jimmy. However Joe Pesci steals the overacting awards with his portrayal of the foul-mouthed psychotic Tommy, who spends the film shooting and beating those who offend him. Pesci is both funny and frightening as a maniac who doesn't think twice about killing people, and his kinetic performance bursts off the screen in a blaze of fury. The rest of the cast, including Liotta's wife and Paul Sorvino, also put in well-judged and realistic performances.While some people may be put off by the long running length, this is engrossing viewing, as the film charts the various gruesome demises of unfortunate characters (the opening body in the boot being a standout in sheer brutality), Liotta's growing paranoia (the helicopter scenes are memorable) and eventual capture, and the characters' changing loyalties. GOODFELLAS was really the final word about gangster life, at least until CASINO came along."
    },
    {
      "username": "shanfloyd",
      "userUrl": "https://www.imdb.com/user/ur2148320",
      "reviewLink": "https://www.imdb.com/review/rw1049507",
      "warningSpoilers": false,
      "date": "29 March 2005",
      "rate": "8",
      "helpful": "129 out of 231 found this helpful.",
      "title": "A classic mobster film.",
      "content": "This is one hell of a film about the mobsters, based on a true story and coming from one of the great directors of all time. This is about Henry Hill, the narrator of the story, an Irish simple person who gets involved with the Mafia at a very young age and continues his life through it. There is no major plot in this film, just isolated incidents one of which was the turning point of Hill's life. Scorsese, as brilliant as he ever was, shows violence, sex and drugs etc in his own trademark style. And his actors helps him to make this film one of the classics.Robert DeNiro is not present in much of the film, nor his acting leaves too much impression. The three actors who really did their best job here are Ray Liotta, Joe Pesci and Lorraine Bracco. I hate to say that most youngsters today don't know too much about Liotta or how talented he was. I asked my younger brother about him and he said, \"The man who did the voice on GTA: Vice City?\". This is partly because Liotta did not get too many big roles after that, especially in recent years. But here he is just brilliant as Hill. It's Pesci's one of the best too. Playing a mad mobster with dark sense of humor wasn't his usual type. And Lorraine Bracco becomes the perfect lead female in such type of films.The film's got smart screenplay and excellent cinematography. And I don't know how many times Scorsese will be denied his Academy recognition. I hate to see a lifetime achievement award as his first Oscar. But things are going like that."
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw1834962",
      "warningSpoilers": false,
      "date": "7 March 2008",
      "rate": "",
      "helpful": "17 out of 28 found this helpful.",
      "title": "A Masterpiece That Gets Better With Each New Viewing",
      "content": "Goodfellas (1990) **** (out of 4) Martin Scorsese's masterpiece about Henry Hill (Ray Liotta), a man who grew up hoping to be in the mob and he got his but crime does not pay as the old saying goes. GOODFELLAS has been called one of the greatest mob movies ever made and it's been called the best film of the 90s as well as one of the greatest films ever made. It certainly goes on my list as one of the greatest movies ever made and each time I view the thing I can't help but be amazed at the brilliance on screen. It's really does seem as if this isn't a movie because the thing is so perfect in every way that it's almost hard to believe that it's real. Even though everything in this movie is great there's no doubt that every ounce of credit belongs to Scorsese.There have been wonderful crime pictures going all the way back to the silent days so the director was behind the eight ball but instead of just delivering a great movie he instead goes all out and really creates a film unlike anything we've ever seen before. The way he films the violence, shows the good times and the bad times. Everything is so flawless that you really do forget that you're watching a movie because it comes off like you're a fly on the wall witnessing all of this stuff first hand. There's the now legendary camera shot going through the restaurant, there's the terrific music score and of course the violence that really shakes you. One could argue that we've seen this type of story countless times but it's so fresh here that you can't help but feel as if you're seeing it for the first time.There are so many brilliant moments here but special credit has to go to the final twenty-minutes or so when Hill finally starts to crack due to all the drugs. The fast-paced nature of this sequence is among the most perfect filming you're ever going to see because by the time it's over you're going to think that you too are high on drugs. Another amazing thing that Scorsese does is get you into the events in these people's lives. The good times early on are so much fun that you can see why someone would select to be in the lifestyle. The camera doesn't shy away from capturing these moments including the high times in the nightclubs with the women and the money. However, Scorsese also nails the downside when everything starts to crumble and the violence is so shocking and brutal that you then realize that this lifestyle only ends one way and you're thankful that you're not involved in it.Another major plus are of course the performances. Liotta is perfect in the role of Hill and especially when you consider he must carry the film over the more famous actors. I thought Liotta perfectly nailed not only the young, energetic Hill but he really pulled off the drug-crazed maniac. DeNiro, as usual, is also terrific in his part as he brings so much fire and energy to the character and can cause you to fear him with just a look. Joe Pesci deserves his Best Supporting Actor Oscar as there's no doubt that he delivers one of the finest villain roles in the history of film. Lorraine Bracco and Paul Sorvino are also impressive as are the rest of the supporting players even down to the bit parts.GOODFELLAS is without question one of the greatest films ever made and like all classics it's a movie that keeps getting better each passing year. Scorsese has made many great films in his career and this here is certainly among his best."
    },
    {
      "username": "wellthatswhatithinkanyway",
      "userUrl": "https://www.imdb.com/user/ur0345596",
      "reviewLink": "https://www.imdb.com/review/rw1289820",
      "warningSpoilers": false,
      "date": "12 February 2006",
      "rate": "10",
      "helpful": "39 out of 72 found this helpful.",
      "title": "Rightfully hailed as one of the greatest gangster epics of all time",
      "content": "STAR RATING: ***** The Works **** Just Misses the Mark *** That Little Bit In Between ** Lagging Behind * The Pits A film (one I'm sure you're all familiar with) charting the rise of Henry Hill, a young man growing up in a neighbourhood in 1950s New Jersey, who is in awe of the wise guys who lurk in his neighbourhood and the respect and power they command. With low prospects and an abusive father, Henry can see no other way to go than to become one of them and we follow him on his journey as he becomes ingratiated in them, the crimes he carries out for them, his marriage that starts well before going disasterously off the rails, a spell in jail after a job gone wrong and finally where he goes wildly off the rails when he starts taking/dealing drugs and him finally ending up having to testify against his former friends when he becomes a liability to them and they put out a contract on his head, which is still in force today.Robert De Niro. Ray Liotta. Joe Pesci. Three men with faces you wouldn't want to mess with and all perfectly cast in the leading roles in Martin Scorsese's legendary crime epic. All men are on fine form but, in ironically the lesser role, special mention to Pesci who steals the show as the wildly psychotic Tommy.Scorsese's masterpiece was one of the first films to really make use of the camera in new ways, from the long, lingering shot to the still shot, used excellently at various points in the movie. These are usually complimented by a fine 50s soundtrack playing over them, with some real lingering melodies from that era.The story works on two levels, both enlighteningly as an expose of how the gangster world and the gangsters themselves actually have very similar philosophies and worries as normal 9-5 people (with regards to families and staying on top of the competition) as well as showing just why the attraction to that life is so great (hitting home most forcefully at the end when Henry is forced to acknowledge that he'll have to lead the rest of his life like a 'shnuck!') and also engagingly as we watch a man rise from nothing to great heights only to lose it all again through his own bad choices and misguided loyalties. Indeed, as the film spans four decades, we do leave the film feeling as though we've known these characters for years.Coppola's The Godfather will remain the most accomplished crime epic of all time, but Scorsese's effort can never be scoffed at and will rightly remain one of the most well remembered films of it's sort, if you've got the stomach to sit through it in certain parts. *****"
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0282531",
      "warningSpoilers": true,
      "date": "22 May 2002",
      "rate": "",
      "helpful": "49 out of 95 found this helpful.",
      "title": "Italian Storytelling",
      "content": "Spoilers herein.Competent filmmakers are rare -- there is no doubt that Scorsese is competent and should be celebrated on that score alone.But his films are empty. They take you into a gangsterland (even `Temptation,' even `Innocence') and snap along until they end and then you leave. But you leave with nothing, and I expect more from a competent filmmaker.The problem -- I speculate -- is the degree to which Scorsese is locked in the Italian tradition of storytelling and its 60's incarnation in neo-realistic films. This is a matter of performance, where the force of the story is all in the force of the storyteller. The performer here is Scorsese. His screen persona is epitomized in the Pesci character: driving, driving the group by pressing on. By speaking over others. By showing the threat of violence.There's power here. It grabs your attention like Pesci grabs that of the fellas. I can see Scorsese constantly saying to himself that he'd be nuts to live any other way. But aside from some storytelling mechanics, there are no ideas here, no ambiguities, no interesting characters, no plot maturity, no symmetries, nothing to wonder about and discuss on your way home.But we should salute some of the decisions. Scorsese chooses to frame the film as a story told by the Liotta character. (He plays an Irishman, but looks and acts Italian.) Narrative voiceovers. A clever framing device with us locked in the car at midway through and mirrored in the beginning. The end with Liotta looking directly and speaking into the camera and shooting us.And the camera. Much has been said of the camera. The long, tracking shots, especially the much-copied entrance through the kitchen. The pullback-zoom toward the end when Liotta and DeNiro meet. The occasional corner ceiling shot. Normally I would love this, especially since it is in the framework of a consistent notion of the eye. What bothers me is what that eye is: it is dependent on the characters. The characters drive this movie and pull the camera. Consider the kitchen entry scene: the camera is on a string behind Liotta. We follow, always follow, just as the fellas at Pesci's table have to follow his prattling. Compare that to dePalma's similar long tracking shot of Bruce Willis at the start of `Bonfire of the Vanities.' DePalma's camera isn't dragged along behind by the force of Willis. It floats to the front, the side, swooping around, independently curious. We the viewers are masters of the story. It's the difference between the northern and southern European storytelling traditions.Seeing how little deference the camera gives us really grates when the payoff is so slight. It makes DeNiro pretty hard to take. Yes, we all get impressed by the power of his performance. But it is always clear that it is a performance: we are not seeing a character but a `serious actor,' employed as a tractor to pull us along.Is this a great film? Well, it did not change my life, give my dreams new form, or provide the basis for any meaningful discussion with my wife. It didn't help me define myself or my world. It provided no new perspectives on the things I struggle with. (And many, many films do one or more of these things.) So for me no.What a waste."
    },
    {
      "username": "Critic_For_Life",
      "userUrl": "https://www.imdb.com/user/ur25203950",
      "reviewLink": "https://www.imdb.com/review/rw8186181",
      "warningSpoilers": false,
      "date": "29 May 2022",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Watching Goodfellas- lost count of how many times to watch",
      "content": "Goodfellas is a gem, never get tired watching it and it's very fun to watch. One of the best Scorcese films along with Casino ( I know there are other films). Love all the characters and Liotta stands out (RIP) - my absolute favorite scene is when he's joking around with Pesci and tells him he's a funny guy; I read that that scene was improvised. Will miss you Ray Liotta - not your time to leave us."
    },
    {
      "username": "mnpollio",
      "userUrl": "https://www.imdb.com/user/ur13549369",
      "reviewLink": "https://www.imdb.com/review/rw2601710",
      "warningSpoilers": true,
      "date": "24 April 2012",
      "rate": "7",
      "helpful": "23 out of 37 found this helpful.",
      "title": "Slick, flashy, often brilliant, yet cannot make you give a hoot about its characters",
      "content": "Goodfellas is a technically impressive film and interesting to review largely because of the huge following it has amongst film critics and Martin Scorsese fanatics alike, most of whom reverentially believe it is his best work and they may be correct.The story based on a novel by Nicholas Pileggi chronicles the rise through the ranks of the Mafia of Irish-Sicilian Henry Hill (Ray Liotta), who has always wanted to be a gangster since he was a kid, and finds his wish granted. We follow him from a rambunctious teen to his first arrest, his marriage to Jewish wife Karen (Lorraine Bracco) through to their fall into drugs, and finally as an informer prior to entry into the Witness Protection Program.The film has a dry sense of humor and is technically and visually amazing. Scorsese loves the mobster milieu and is obviously working in his element here with a nicely picked cast. The attention to detail, the camera work, the costumes, the choice of music is all well thought out to the most intimate minutiae. The film is a fairly fascinating peek at life inside the Mafia. Scorsese allows events to unfold believably and the moments near the end where Henry and Karen become increasingly paranoid that they are under surveillance, complete with jittery, over bright intense camera work that heightens their unease, is arguably some of Scorsese's best work.The acting is fairly solid. Liotta manages to hold things together as the focal character and he gets nice support from Bracco. DeNiro manages a dignified turn as Liotta's mentor and friend. Joe Pesci won the Oscar as the psychotic killer Tommy DeVito. He is utilized well enough here to overlook the fact that it is basically the same performance he gives in everything else.Yet as amazing as the film is, it still has its drawbacks that prevent it from becoming the classic that many of its admirers would have you believe. As fascinating as Goodfellas is, I actually find Scorsese's similarly themed subsequent work Casino just as impressive technically, yet far more interesting in that it tells its tale using the backdrop of the formation of gambling mecca Las Vegas. I realize that I am in the minority with that view, but there it is.Yet most notable of all is that Goodfellas seems utterly incapable of connecting on an emotional level with the viewer. The superior Godfather films featured similar themes and focused on characters capable of shocking acts of violence, yet managed to connect on an emotional level so that we had some concern for the players. By contrast, at the end of Goodfellas, as brilliant as I thought some of the direction and technical aspects were, I found that I did not give a damn what happened to any of the characters on screen, including Henry and Karen. I was completely indifferent to whether they lived, died, escaped, etc. And this issue makes for a somewhat empty viewing experience.1990 was a very interesting film year. Coppola released his last Godfather film that year. Although it got an Oscar nod, critics largely overlooked it in favor of Goodfellas due to the fact that it is not on the same level as its predecessors. There is no question Godfather III is a flawed film, but it is also more emotionally rich than Goodfellas and any one of its flaws is more interesting to discuss at length than any of Goodfellas successes. Conversely, critics and Scorsese fans have spilled gallons of ink over the \"injustice\" of Dances With Wolves winning the Best Picture over Goodfellas, but it is not hard to see why it did. DWW in its own right is just as technically impressive as Goodfellas (maybe even more so considering its director was an amateur with a passionate vision), but DWW connects emotionally with the viewer in a far more powerful way than Goodfellas ever does. At the end of DWW and Godfather III, I had to know what happened with those characters. At the end of Goodfellas, not so much. What Scorsese has achieved is certainly noteworthy and makes for a very good, solid gangster film, but most definitely not a masterpiece. It is slick, flashy and technically well done (sometimes even brilliant), but its inability to make me give a damn about any of its characters is a huge stumbling block."
    }
  ],
  "errorMessage": ""
}