{
  "imDbId": "tt0099685",
  "title": "Goodfellas",
  "fullTitle": "Goodfellas (1990)",
  "type": "Movie",
  "year": "1990",
  "language": "en",
  "titleInLanguage": "Goodfellas",
  "url": "https://en.wikipedia.org/wiki/Goodfellas",
  "plotShort": {
    "plainText": "Goodfellas (stylized GoodFellas) is a 1990 American biographical crime film directed by Martin Scorsese, written by Nicholas Pileggi and Scorsese, and produced by Irwin Winkler. It is a film adaptation of the 1985 nonfiction book Wiseguy by Pileggi. Starring Robert De Niro, Ray Liotta, Joe Pesci, Lorraine Bracco and Paul Sorvino, the film narrates the rise and fall of mob associate Henry Hill and his friends and family from 1955 to 1980.\r\nScorsese initially titled the film Wise Guy and postponed making it; he and Pileggi later changed the title to Goodfellas. To prepare for their roles in the film, De Niro, Pesci and Liotta often spoke with Pileggi, who shared research material left over from writing the book. According to Pesci, improvisation and ad-libbing came out of rehearsals wherein Scorsese gave the actors freedom to do whatever they wanted. The director made transcripts of these sessions, took the lines he liked most and put them into a revised script, which the cast worked from during principal photography.\r\nGoodfellas premiered at the 47th Venice International Film Festival on September 9, 1990, where Scorsese was awarded with Silver Lion for Best Director, and was released in the United States on September 19, 1990, by Warner Bros. The film was made on a budget of $25 million and grossed $47 million. Goodfellas received widespread acclaim upon release: the critical consensus on Rotten Tomatoes calls it \"arguably the high point of Martin Scorsese's career\". The film was nominated for six Academy Awards, including Best Picture and Best Director, with Pesci winning for Best Supporting Actor. The film won five awards from the British Academy of Film and Television Arts, including Best Film and Best Director. Additionally, Goodfellas was named the year's best film by various critics' groups.\r\nGoodfellas is widely regarded as one of the greatest films ever made, particularly in the gangster genre. In 2000, it was deemed \"culturally, historically, or aesthetically significant\" and selected for preservation in the National Film Registry by the United States Library of Congress. Its content and style have been emulated in numerous other films and television series.",
    "html": "<p>Goodfellas (stylized GoodFellas) is a 1990 American biographical crime film directed by Martin Scorsese, written by Nicholas Pileggi and Scorsese, and produced by Irwin Winkler. It is a film adaptation of the 1985 nonfiction book Wiseguy by Pileggi. Starring Robert De Niro, Ray Liotta, Joe Pesci, Lorraine Bracco and Paul Sorvino, the film narrates the rise and fall of mob associate Henry Hill and his friends and family from 1955 to 1980.</p><p>Scorsese initially titled the film Wise Guy and postponed making it; he and Pileggi later changed the title to Goodfellas. To prepare for their roles in the film, De Niro, Pesci and Liotta often spoke with Pileggi, who shared research material left over from writing the book. According to Pesci, improvisation and ad-libbing came out of rehearsals wherein Scorsese gave the actors freedom to do whatever they wanted. The director made transcripts of these sessions, took the lines he liked most and put them into a revised script, which the cast worked from during principal photography.</p><p>Goodfellas premiered at the 47th Venice International Film Festival on September 9, 1990, where Scorsese was awarded with Silver Lion for Best Director, and was released in the United States on September 19, 1990, by Warner Bros. The film was made on a budget of $25 million and grossed $47 million. Goodfellas received widespread acclaim upon release: the critical consensus on Rotten Tomatoes calls it \"arguably the high point of Martin Scorsese's career\". The film was nominated for six Academy Awards, including Best Picture and Best Director, with Pesci winning for Best Supporting Actor. The film won five awards from the British Academy of Film and Television Arts, including Best Film and Best Director. Additionally, Goodfellas was named the year's best film by various critics' groups.</p><p>Goodfellas is widely regarded as one of the greatest films ever made, particularly in the gangster genre. In 2000, it was deemed \"culturally, historically, or aesthetically significant\" and selected for preservation in the National Film Registry by the United States Library of Congress. Its content and style have been emulated in numerous other films and television series.</p>"
  },
  "plotFull": {
    "plainText": "Goodfellas (stylized GoodFellas) is a 1990 American biographical crime film directed by Martin Scorsese, written by Nicholas Pileggi and Scorsese, and produced by Irwin Winkler. It is a film adaptation of the 1985 nonfiction book Wiseguy by Pileggi. Starring Robert De Niro, Ray Liotta, Joe Pesci, Lorraine Bracco and Paul Sorvino, the film narrates the rise and fall of mob associate Henry Hill and his friends and family from 1955 to 1980.\r\nScorsese initially titled the film Wise Guy and postponed making it; he and Pileggi later changed the title to Goodfellas. To prepare for their roles in the film, De Niro, Pesci and Liotta often spoke with Pileggi, who shared research material left over from writing the book. According to Pesci, improvisation and ad-libbing came out of rehearsals wherein Scorsese gave the actors freedom to do whatever they wanted. The director made transcripts of these sessions, took the lines he liked most and put them into a revised script, which the cast worked from during principal photography.\r\nGoodfellas premiered at the 47th Venice International Film Festival on September 9, 1990, where Scorsese was awarded with Silver Lion for Best Director, and was released in the United States on September 19, 1990, by Warner Bros. The film was made on a budget of $25 million and grossed $47 million. Goodfellas received widespread acclaim upon release: the critical consensus on Rotten Tomatoes calls it \"arguably the high point of Martin Scorsese's career\". The film was nominated for six Academy Awards, including Best Picture and Best Director, with Pesci winning for Best Supporting Actor. The film won five awards from the British Academy of Film and Television Arts, including Best Film and Best Director. Additionally, Goodfellas was named the year's best film by various critics' groups.\r\nGoodfellas is widely regarded as one of the greatest films ever made, particularly in the gangster genre. In 2000, it was deemed \"culturally, historically, or aesthetically significant\" and selected for preservation in the National Film Registry by the United States Library of Congress. Its content and style have been emulated in numerous other films and television series.\r\nPlot\r\nIn 1955, youngster Henry Hill becomes enamored by the criminal life and Mafia presence in his working class Italian-American neighborhood in Brooklyn. He begins working for local caporegime Paulie Cicero and his associates: Jimmy \"the Gent\" Conway, an Irish-American truck hijacker and gangster, and Tommy DeVito, a fellow juvenile delinquent. Henry begins as a fence for Jimmy, gradually working his way up to more serious crimes. The three associates spend most of their nights in the 1960s at the Copacabana nightclub carousing with women. Henry starts dating Karen Friedman, a Jewish woman who is initially troubled by Henry's criminal activities. Seduced by Henry's glamorous lifestyle, she marries him despite her parents' disapproval.\r\nIn 1970, Billy Batts, a made man in the Gambino crime family recently released from prison, patronizes Tommy at a nightclub owned by Henry; Tommy and Jimmy beat, stab and fatally shoot Billy. The unsanctioned murder of a made man invites retribution; realizing this, Jimmy, Henry, and Tommy bury the body in upstate New York. Six months later, however, Jimmy learns that the burial site is slated for development, prompting them to exhume and relocate the decomposing corpse.\r\nLater, in 1970, Henry witnesses Tommy murder Spider, an errand boy, after exchanging insults with him during a card game. Karen discovers Henry has a mistress and threatens him at gunpoint. Henry moves in with his mistress, but Paulie insists that he should return to Karen after collecting a debt from a gambler in Tampa with Jimmy. Upon returning, Jimmy and Henry are arrested after being turned in by the gambler's sister, an FBI typist, and they receive ten-year prison sentences. To support his family on the outside, Henry has Karen smuggle in drugs and sells them to a fellow inmate from Pittsburgh.\r\nIn 1978, Henry is paroled and expands his cocaine business with Jimmy and Tommy against Paulie's orders. Jimmy organizes a crew to raid the Lufthansa vault at John F. Kennedy International Airport, stealing six million dollars in cash and jewelry. After some members purchase expensive items against Jimmy's orders and the getaway truck is found by police, he has most of the crew (except Tommy and Henry) murdered. In 1979, Tommy is deceived into believing he is to become a made man and is murdered after walking into the room of the ceremony—partly as retribution for murdering Batts.\r\nBy 1980, Henry develops a drug habit and becomes a paranoid wreck. He sets up another drug deal with his Pittsburgh associates, but he is arrested by narcotics agents and incarcerated. After bailing him out, Karen reveals that she flushed $60,000 worth of cocaine down the toilet to prevent FBI agents from finding it during their raid, leaving them penniless. Feeling betrayed by Henry's drug dealing, Paulie gives him $3,200 and ends their association. Karen goes to Jimmy for help, but eventually flees upon suspecting a trap to murder her. Henry later meets Jimmy at a diner and is asked to travel on a hit assignment, but the novelty of such a request makes Henry suspicious.\r\nRealizing that Jimmy also plans to have him killed, Henry finally decides to become an informant and enroll, with his family, into the witness protection program. Henry gives sufficient testimony and evidence in court to have Paulie and Jimmy convicted, and moves to a nondescript neighborhood in accordance with the witness protection program. Henry describes his unhappiness in leaving his exciting and turbulent gangster life, now being condemned to live the rest of his life as a boring, average \"schnook\".\r\nCast\r\nRobert De Niro as James 'Jimmy' Conway\r\nRay Liotta as Henry Hill\r\nChristopher Serrone as Young Henry\r\nJoe Pesci as Tommy DeVito\r\nLorraine Bracco as Karen Hill\r\nPaul Sorvino as Paul Cicero\r\nFrank Sivero as Frankie Carbone\r\nTony Darrow as Sonny Bunz\r\nMike Starr as Frenchy\r\nFrank Vincent as Billy Batts\r\nChuck Low as Morris Kessler\r\nFrank DiLeo as Tuddy Cicero\r\nHenny Youngman as himself\r\nGina Mastrogiacomo as Janice Rossi\r\nCatherine Scorsese as Tommy's mother\r\nCharles Scorsese as Vinnie\r\nSuzanne Shepard as Karen's mother\r\nDebi Mazar as Sandy\r\nMargo Winkler as Belle Kessler\r\nWelker White as Lois Byrd\r\nJerry Vale as himself\r\nJulie Garfield as Mickey Conway\r\nElaine Kagan as Henry's mother\r\nBeau Starr as Henry's father\r\nKevin Corrigan as Michael Hill\r\nMichael Imperioli as Spider\r\nRobbie Vinton as Bobby Vinton\r\nJohn Williams as Johnny Roastbeef\r\nIlleana Douglas as Rosie\r\nFrank Pellegrino as Johnny Dio\r\nTony Sirico as Tony Stacks\r\nSamuel L. Jackson as Stacks Edwards\r\nPaul Herman as Dealer\r\nEdward McDonald as himself\r\nLouis Eppolito as Fat Andy\r\nTony Lip as Frankie the Wop\r\nAnthony Powers as Jimmy Two Times\r\nVinny Pastore as Man w/Coatrack\r\nTobin Bell as Parole Officer\r\nIsiah Whitlock Jr. as Doctor\r\nRichard \"Bo\" Dietl as Arresting Narc\r\nEd Deacy as Detective Deacy\r\nVictor Colicchio as Henry's 60's crew\r\nVincent Gallo as Henry's 70's crew\r\nJoseph Bono as Mikey Franzese\r\nKatherine Wallach as Diane\r\nBob Golub as Truck Driver at Diner\r\nProduction\r\nDevelopment\r\nGoodfellas is based on New York crime reporter Nicholas Pileggi's book Wiseguy. Martin Scorsese did not intend to make another mob film, but he saw a review of Pileggi's book, which he then read while working on the set of The Color of Money in 1986. He had always been fascinated by the mob lifestyle and was drawn to Pileggi's book because he thought it was the most honest portrayal of gangsters he had ever read. After reading the book, Scorsese knew what approach he wanted to take, \"To begin Goodfellas like a gunshot and have it get faster from there, almost like a two-and-a-half-hour trailer. I think it's the only way you can really sense the exhilaration of the lifestyle, and to get a sense of why a lot of people are attracted to it.\" According to Pileggi, Scorsese cold-called the writer and told him, \"I've been waiting for this book my entire life,\" to which Pileggi replied, \"I've been waiting for this phone call my entire life.\"\r\nScorsese decided to postpone making the film when funds materialized in 1988 to make The Last Temptation of Christ. He was drawn to the documentary aspects of Pileggi's book. \"The book gives you a sense of the day-to-day life, the tedium, how they work, how they take over certain nightclubs, and for what reasons. It shows how it's done.\" He saw Goodfellas as the third film in an unplanned trilogy of films that examined the lives of Italian Americans \"from slightly different angles.\" He has often described the film as \"a mob home movie\" that is about money, because \"that's what they're really in business for.\" Two weeks in advance of the filming, the real Henry Hill was paid $480,000.\r\nScreenplay\r\nScorsese and Pileggi collaborated on the screenplay, and over the course of the 12 drafts it took to reach the ideal script, the reporter realized \"the visual styling had to be completely redone... So we decided to share credit.\" They chose the sections of the book they liked and put them together like building blocks. Scorsese persuaded Pileggi that they did not need to follow a traditional narrative structure. The director wanted to take the gangster film and deal with it episode by episode, but start in the middle and move backwards and forwards. Scorsese compacted scenes, realizing that, if they were kept short, \"the impact after about an hour and a half would be terrific.\" He wanted to do the voiceover like the opening of Jules and Jim (1962) and use \"all the basic tricks of the New Wave from around 1961.\" The names of several real-life gangsters were altered for the film: Tommy \"Two Gun\" DeSimone became the character Tommy DeVito; Paul Vario became Paulie Cicero, and Jimmy \"The Gent\" Burke was portrayed as Jimmy Conway. Scorsese initially titled the film Wise Guy, but later, he and Pileggi decided to change the title of their film to Goodfellas because two contemporary projects, the 1986 Brian De Palma film Wise Guys and the 1987–1990 TV series Wiseguy, had used similar titles.\r\nCasting\r\nOnce Robert De Niro agreed to play Jimmy Conway, Scorsese was able to secure the money needed to make the film. Ray Liotta, who played Henry Hill, had read Pileggi's book when it came out and was fascinated by it. A couple of years afterward, his agent told him Scorsese was going to direct a film adaptation. In 1988, Liotta met Scorsese over a period of a couple of months and auditioned for the film. He campaigned aggressively for a role, though the studio wanted a well-known actor; he later said, \"I think they would've rather had Eddie Murphy than me.\" The director cast Liotta after De Niro saw him in Jonathan Demme's Something Wild (1986); Scorsese was surprised by \"his explosive energy\" in that film. Al Pacino and John Malkovich were considered for the role of Conway, and Sean Penn, Alec Baldwin, Val Kilmer, and Tom Cruise were considered for the role of Hill.\r\nTo prepare for the role, De Niro consulted with Pileggi, who had research material that had been discarded while writing the book. De Niro often called Hill several times a day to ask how Burke walked, held his cigarette, and so on. Driving to and from the set, Liotta listened to FBI audio cassette tapes of Hill, so he could practice speaking like his real-life counterpart. Madonna was considered for the role of Karen Hill. To research her role, Lorraine Bracco tried to get close to a mob wife but was unable to, because they exist in a very tight-knit community. She decided not to meet the real Karen, saying she \"thought it would be better if the creation came from me. I used her life with her parents as an emotional guideline for the role.\" Paul Sorvino had no problem finding the voice and walk of his character, but found it challenging finding what he called \"that kernel of coldness and absolute hardness that is antithetical to my nature except when my family is threatened.\"\r\nFormer EDNY prosecutor Edward A. McDonald appeared in the film as himself, re-creating the conversation he had with Henry and Karen Hill about joining the Witness Protection Program. McDonald, who was friends with Pileggi, was cast on a whim; while a location scout was taking pictures of his office, McDonald casually remarked that he would be happy to play himself if needed. Pileggi called him an hour later asking if he was serious, and he was cast. The scene was unscripted, with McDonald improvising the line referring to Karen as a \"babe-in-the-woods.\"\r\nPhotography\r\nThe film was shot on location in Queens, New York state, New Jersey, and parts of Long Island during the spring and summer of 1989, with a budget of $25 million. Scorsese broke the film down into sequences and storyboarded everything because of the complicated style throughout. The filmmaker stated, \" wanted lots of movement and I wanted it to be throughout the whole picture, and I wanted the style to kind of break down by the end, so that by last day as a wise guy, it's as if the whole picture would be out of control, give the impression he's just going to spin off the edge and fly out.\" He added that the film's style comes from the first two or three minutes of Jules and Jim (1962): extensive narration, quick edits, freeze frames, and multiple locale switches. It was this reckless attitude towards convention that mirrored the attitude of many of the gangsters in the film. Scorsese remarked, \"So if you do the movie, you say, 'I don't care if there's too much narration. Too many quick cuts?—That's too bad.' It's that kind of really punk attitude we're trying to show.\" He adopted a frenetic style to almost overwhelm the audience with images and information. He also put plenty of detail in every frame because he believed the gangster life is so rich. Freeze-frames were used because Scorsese wanted images that stopped \"because a point was being reached\" in Henry's life.\r\nJoe Pesci did not judge his character but found the scene where he kills Spider for talking back to his character hard to do, because he had trouble justifying the action until he forced himself to feel the way Tommy did. Bracco found the shoot to be an emotionally difficult one because it was such a male-dominated cast, and she realized if she did not make her \"work important, it would probably end up on the cutting room floor.\" When it came to the relationship between Henry and Karen, Bracco saw no difference between an abused wife and her character.\r\nAccording to Pesci, improvisation and ad-libbing came out of rehearsals wherein Scorsese let the actors do whatever they wanted. He made transcripts of these sessions, took the lines the actors came up with that he liked best, and put them into a revised script that the cast worked from during principal photography. For example, the scene where Tommy tells a story and Henry is responding to him—the \"Funny how? Do I amuse you?\" scene—is based on an actual event that Pesci experienced. Pesci was working as a waiter when he thought he was making a compliment to a mobster by saying he was \"funny\"; however, the comment was not taken well. It was worked on in rehearsals where he and Liotta improvised, and Scorsese recorded four to five takes, rewrote their dialogue, and inserted it into the script. The dinner scene with Tommy's mother was largely improvised. Her painting of the bearded man with the dogs was based on a photograph from National Geographic magazine. The cast did not meet Henry Hill until a few weeks before the film's premiere. Liotta met him in an undisclosed city; Hill had seen the film and told the actor that he loved it.\r\nThe long tracking shot through the Copacabana nightclub came about because of a practical problem: the filmmakers could not get permission to go in the short way, and this forced them to go round the back. Scorsese decided to film the sequence in one unbroken shot in order to symbolize that Henry's entire life was ahead of him, commenting, \"It's his seduction of her and it's also the lifestyle seducing him.\" This sequence was shot eight times.\r\nHenry's last day as a wise guy was the hardest part of the film for Scorsese to shoot because he wanted to properly show Henry's state of anxiety, paranoia, and racing thoughts caused by cocaine and amphetamines intoxication. In an interview with movie critic Mark Cousins, Scorsese explained the reason for Pesci shooting at the camera at the end of the film, \"well that's a reference right to the end of The Great Train Robbery, that's the way that ends, that film, and basically the plot of this picture is very similar to The Great Train Robbery. It hasn't changed, 90 years later, it's the same story, the gun shots will always be there, he's always going to look behind his back, he's gotta have eyes behind his back, because they're gonna get him someday.\" The director ended the film with Henry regretting that he is no longer a wise guy, about which Scorsese said, \"I think the audience should get angry at him and I would hope they do—and maybe with the system which allows this.\"\r\nPost-production\r\nScorsese wanted to depict the film's violence realistically, \"cold, unfeeling and horrible. Almost incidental.\" However, he had to remove 10 frames of blood to ensure an R rating from the MPAA. With a budget of $25 million, Goodfellas was Scorsese's most expensive film to that point but still only a medium-sized budget by Hollywood standards. It was also the first time he was obliged by Warner Bros. to preview the film. It was shown twice in California, and a lot of audiences were \"agitated\" by Henry's last day as a wise guy sequence. Scorsese argued that was the point of the scene. Scorsese and the film's editor, Thelma Schoonmaker, made this sequence faster with more jump cuts to convey Henry's drug-addled point of view. In the first test screening there were 40 walkouts in the first ten minutes. One of the favorite scenes for test audiences was the \"Funny Like a clown? Do I amuse you?\" scene.\r\nSoundtrack\r\nWhile there is no incidental score as such in the film, Scorsese chose songs for the soundtrack that he felt obliquely commented on the scene or the characters. In a given scene, he used only music contemporary to or older than the scene's setting. According to Scorsese, a lot of non-dialogue scenes were shot to playback. For example, he had \"Layla\" by Derek and the Dominos playing on the set while shooting the scene where the dead bodies are discovered in the car, dumpster, and meat truck. Sometimes, the lyrics of songs were put between lines of dialogue to comment on the action. Some of the music Scorsese had written into the script, while other songs he discovered during the editing phase.\r\nRelease\r\nTheatrical\r\nGoodfellas premiered at the 47th Venice International Film Festival, where Scorsese received the Silver Lion award for best director. It was given a wide release in North America on September 21, 1990.\r\nHome media\r\nGoodfellas was released on DVD in March 1997, in a single-disc, double-sided, single-layer format that requires the disc to be flipped during viewing; in 2004, Warner Home Video released a two-disc, dual-layer version, with remastered picture and sound, and bonus materials such as commentary tracks. In early 2007, the film became available on single Blu-ray with all the features from the 2004 release; an expanded Blu-ray version was released on February 16, 2010, for its 20th anniversary, bundled with a disc with features that include the 2008 documentary Public Enemies: The Golden Age of the Gangster Film. On May 5, 2015, a 25th anniversary edition was released. The film was released on 4K Ultra HD Blu-ray on December 6, 2016.\r\nReception\r\nBox office\r\nGoodfellas grossed $6.3 million from 1,070 theaters in opening weekend, topping the box office. In its second weekend the film made $5.9 million from 1,291 theaters, falling just 8% and finishing second behind newcomer Pacific Heights. It went on to make $46.8 million domestically.\r\nCritical response\r\nAccording to review aggregator Rotten Tomatoes, 96% of 107 critics have given the film a positive review, with an average rating of 9.00/10. The website's critics consensus reads, \"Hard-hitting and stylish, GoodFellas is a gangster classic—and arguably the high point of Martin Scorsese's career.\" Metacritic has assigned the film a weighted average score of 91 out of 100 based on reviews from 21 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale.\r\nIn his review for the Chicago Sun-Times, Roger Ebert gave the film a full four stars and wrote, \"No finer film has ever been made about organized crime – not even The Godfather.\" In his review for the Chicago Tribune, Gene Siskel wrote, \"All of the performances are first-rate; Pesci stands out, though, with his seemingly unscripted manner. GoodFellas is easily one of the year's best films.\" Both named it as the best film of 1990. In his review for The New York Times, Vincent Canby wrote, \"More than any earlier Scorsese film, Goodfellas is memorable for the ensemble nature of the performances... The movie has been beautifully cast from the leading roles to the bits. There is flash also in some of Mr. Scorsese's directorial choices, including freeze frames, fast cutting and the occasional long tracking shot. None of it is superfluous.\" USA Today gave the film four out of four stars and called it, \"great cinema—and also a whopping good time.\" David Ansen, in his review for Newsweek magazine, wrote \"Every crisp minute of this long, teeming movie vibrates with outlaw energy.\" Rex Reed said, \"Big, rich, powerful and explosive. One of Scorsese's best films! Goodfellas is great entertainment.\" In his review for Time, Richard Corliss wrote, \"So it is Scorsese's triumph that GoodFellas offers the fastest, sharpest 2½-hr. ride in recent film history.\"\r\nLists\r\nThe film was ranked the best of 1990 by Roger Ebert, Gene Siskel, and Peter Travers. In a poll of 80 film critics, \"Goodfellas\" was named the best film of the year by 34 critics. Director Martin Scorsese was chosen as the year's best director in 45 of the 80 ballots.\r\nGoodfellas is ranked No. 92 on the AFI's 100 Years...100 Movies (10th Anniversary Edition) list, published in 2007. In 2012, the Motion Picture Editors Guild listed Goodfellas as the fifteenth best-edited film of all time based on a survey of its membership. In the 2012 Sight & Sound polls, it was ranked the 48th-greatest film ever made in the directors' poll. In the subsequent 2022 polls, it was ranked 28th in the directors' poll and tied for 63rd (with Casablanca and The Third Man) in the critics' poll. Goodfellas is 39th on James Berardinelli's 2014-made list of the top 100 films of all time. In 2015, Goodfellas ranked 20th on BBC's \"100 Greatest American Films\" list, voted on by film critics from around the world.\r\nAccolades\r\nIt became one of the seven films to win Best Picture from three out of four major U.S. film critics' groups (LA, NBR, NY, NSFC) along with Nashville, All the President's Men, Terms of Endearment, Pulp Fiction, The Hurt Locker, and Drive My Car.\r\nLegacy\r\nGoodfellas is No. 94 on the American Film Institute's \"100 Years, 100 Movies\" list and moved up to No. 92 on its AFI's 100 Years...100 Movies (10th Anniversary Edition) from 2007. In June 2008, the AFI put Goodfellas at No. 2 on their AFI's 10 Top 10—the best ten films in ten \"classic\" American film genres—after polling over 1,500 people from the movie-related community. Goodfellas was regarded as the second-best in the gangster film genre (after The Godfather). In 2000, the United States Library of Congress deemed the film \"culturally significant\" and selected it for preservation in the National Film Registry.\r\nRoger Ebert named Goodfellas the \"best mob movie ever\" and placed it among the ten best films of the 1990s. In December 2002, a UK film critics poll in Sight & Sound ranked the film No. 4 on their list of the 10 Best Films of the Last 25 Years. Time included Goodfellas in their list of Time's All-Time 100 Movies. Channel 4 placed Goodfellas at No. 10 in their 2002 poll The 100 Greatest Films, Empire listed Goodfellas at No. 6 on their \"500 Greatest Movies Of All Time,\" and Total Film voted Goodfellas No. 1 as the greatest film of all time.\r\nPremiere listed Joe Pesci's Tommy DeVito as No. 96 on its list of \"The 100 Greatest Movie Characters of All Time,\" calling him \"perhaps the single most irredeemable character ever put on film.\" Empire ranked Tommy DeVito No. 59 in their \"The 100 Greatest Movie Characters\" poll.\r\nGoodfellas inspired director David Chase to make the HBO television series The Sopranos. He told Peter Bogdanovich, \"Goodfellas is a very important movie to me and Goodfellas really plowed that ... I found that movie very funny and brutal and it felt very real. And yet that was the first mob movie that Scorsese ever dealt with a mob crew. ... as opposed to say The Godfather ... which there's something operatic about it, classical, even the clothing and the cars. You know I mean I always think about Goodfellas when they go to their mother's house that night when they're eating, you know when she brings out her painting, that stuff is great. I mean The Sopranos learned a lot from that.\" Indeed, the film shares a total of 27 actors with The Sopranos, including Bracco, Sirico, Imperioli, Pellegrino, Lip, and Vincent, who all had major roles in Chase's HBO series.\r\nJuly 24, 2010 marked the 20th anniversary of the film's release. This milestone was celebrated with Henry Hill hosting a private screening for a select group of invitees at the Museum of the American Gangster, in New York City.\r\nIn January 2012, it was announced that the AMC Network had put a television series version of the movie in development. Pileggi was on board to co-write the adaptation with television writer-producer Jorge Zamacona. The two were set to executive produce with the film's producer Irwin Winkler and his son, David.\r\nLuc Besson's 2013 crime comedy film The Family features a sequence where Giovanni Manzoni (Goodfellas star De Niro), a gangster who is under witness protection for testifying against a member of his family, watches Goodfellas.\r\nIn 2014, the ESPN-produced 30 for 30 series debuted Playing for the Mob, the story about how Hill and his Pittsburgh associates, and several Boston College basketball players, committed the point shaving scandal during the 1978–79 season, an episode briefly mentioned in the movie. The documentary, narrated by Liotta, was set up so that the viewer needed to watch the film beforehand in order to understand many of the references in the story.\r\nIn 2015, Goodfellas closed the Tribeca Film Festival with a screening of its 25th-anniversary remaster.\r\nAmerican Film Institute Lists\r\nAFI's 100 Years... 100 Movies - #94\r\nAFI's 100 Years... 100 Movies (10th Anniversary Edition) - #92\r\nAFI's 10 Top 10 - #2 Gangster film\r\nAFI's 100 Years... 100 Heroes and Villains - Tommy DeVito - Nominated Villain\r\nAFI's 100 Years... 100 Movie Quotes - \"Funny how?\" - Nominated Quote",
    "html": "<p>Goodfellas (stylized GoodFellas) is a 1990 American biographical crime film directed by Martin Scorsese, written by Nicholas Pileggi and Scorsese, and produced by Irwin Winkler. It is a film adaptation of the 1985 nonfiction book Wiseguy by Pileggi. Starring Robert De Niro, Ray Liotta, Joe Pesci, Lorraine Bracco and Paul Sorvino, the film narrates the rise and fall of mob associate Henry Hill and his friends and family from 1955 to 1980.</p><p>Scorsese initially titled the film Wise Guy and postponed making it; he and Pileggi later changed the title to Goodfellas. To prepare for their roles in the film, De Niro, Pesci and Liotta often spoke with Pileggi, who shared research material left over from writing the book. According to Pesci, improvisation and ad-libbing came out of rehearsals wherein Scorsese gave the actors freedom to do whatever they wanted. The director made transcripts of these sessions, took the lines he liked most and put them into a revised script, which the cast worked from during principal photography.</p><p>Goodfellas premiered at the 47th Venice International Film Festival on September 9, 1990, where Scorsese was awarded with Silver Lion for Best Director, and was released in the United States on September 19, 1990, by Warner Bros. The film was made on a budget of $25 million and grossed $47 million. Goodfellas received widespread acclaim upon release: the critical consensus on Rotten Tomatoes calls it \"arguably the high point of Martin Scorsese's career\". The film was nominated for six Academy Awards, including Best Picture and Best Director, with Pesci winning for Best Supporting Actor. The film won five awards from the British Academy of Film and Television Arts, including Best Film and Best Director. Additionally, Goodfellas was named the year's best film by various critics' groups.</p><p>Goodfellas is widely regarded as one of the greatest films ever made, particularly in the gangster genre. In 2000, it was deemed \"culturally, historically, or aesthetically significant\" and selected for preservation in the National Film Registry by the United States Library of Congress. Its content and style have been emulated in numerous other films and television series.</p><br/><h3>Plot</h3><p>In 1955, youngster Henry Hill becomes enamored by the criminal life and Mafia presence in his working class Italian-American neighborhood in Brooklyn. He begins working for local caporegime Paulie Cicero and his associates: Jimmy \"the Gent\" Conway, an Irish-American truck hijacker and gangster, and Tommy DeVito, a fellow juvenile delinquent. Henry begins as a fence for Jimmy, gradually working his way up to more serious crimes. The three associates spend most of their nights in the 1960s at the Copacabana nightclub carousing with women. Henry starts dating Karen Friedman, a Jewish woman who is initially troubled by Henry's criminal activities. Seduced by Henry's glamorous lifestyle, she marries him despite her parents' disapproval.</p><p>In 1970, Billy Batts, a made man in the Gambino crime family recently released from prison, patronizes Tommy at a nightclub owned by Henry; Tommy and Jimmy beat, stab and fatally shoot Billy. The unsanctioned murder of a made man invites retribution; realizing this, Jimmy, Henry, and Tommy bury the body in upstate New York. Six months later, however, Jimmy learns that the burial site is slated for development, prompting them to exhume and relocate the decomposing corpse.</p><p>Later, in 1970, Henry witnesses Tommy murder Spider, an errand boy, after exchanging insults with him during a card game. Karen discovers Henry has a mistress and threatens him at gunpoint. Henry moves in with his mistress, but Paulie insists that he should return to Karen after collecting a debt from a gambler in Tampa with Jimmy. Upon returning, Jimmy and Henry are arrested after being turned in by the gambler's sister, an FBI typist, and they receive ten-year prison sentences. To support his family on the outside, Henry has Karen smuggle in drugs and sells them to a fellow inmate from Pittsburgh.</p><p>In 1978, Henry is paroled and expands his cocaine business with Jimmy and Tommy against Paulie's orders. Jimmy organizes a crew to raid the Lufthansa vault at John F. Kennedy International Airport, stealing six million dollars in cash and jewelry. After some members purchase expensive items against Jimmy's orders and the getaway truck is found by police, he has most of the crew (except Tommy and Henry) murdered. In 1979, Tommy is deceived into believing he is to become a made man and is murdered after walking into the room of the ceremony—partly as retribution for murdering Batts.</p><p>By 1980, Henry develops a drug habit and becomes a paranoid wreck. He sets up another drug deal with his Pittsburgh associates, but he is arrested by narcotics agents and incarcerated. After bailing him out, Karen reveals that she flushed $60,000 worth of cocaine down the toilet to prevent FBI agents from finding it during their raid, leaving them penniless. Feeling betrayed by Henry's drug dealing, Paulie gives him $3,200 and ends their association. Karen goes to Jimmy for help, but eventually flees upon suspecting a trap to murder her. Henry later meets Jimmy at a diner and is asked to travel on a hit assignment, but the novelty of such a request makes Henry suspicious.</p><p>Realizing that Jimmy also plans to have him killed, Henry finally decides to become an informant and enroll, with his family, into the witness protection program. Henry gives sufficient testimony and evidence in court to have Paulie and Jimmy convicted, and moves to a nondescript neighborhood in accordance with the witness protection program. Henry describes his unhappiness in leaving his exciting and turbulent gangster life, now being condemned to live the rest of his life as a boring, average \"schnook\".</p><br/><h3>Cast</h3><ul><li>Robert De Niro as James 'Jimmy' Conway</li><li>Ray Liotta as Henry Hill</li><li>Christopher Serrone as Young Henry</li><li>Joe Pesci as Tommy DeVito</li><li>Lorraine Bracco as Karen Hill</li><li>Paul Sorvino as Paul Cicero</li><li>Frank Sivero as Frankie Carbone</li><li>Tony Darrow as Sonny Bunz</li><li>Mike Starr as Frenchy</li><li>Frank Vincent as Billy Batts</li><li>Chuck Low as Morris Kessler</li><li>Frank DiLeo as Tuddy Cicero</li><li>Henny Youngman as himself</li><li>Gina Mastrogiacomo as Janice Rossi</li><li>Catherine Scorsese as Tommy's mother</li><li>Charles Scorsese as Vinnie</li><li>Suzanne Shepard as Karen's mother</li><li>Debi Mazar as Sandy</li><li>Margo Winkler as Belle Kessler</li><li>Welker White as Lois Byrd</li><li>Jerry Vale as himself</li><li>Julie Garfield as Mickey Conway</li><li>Elaine Kagan as Henry's mother</li><li>Beau Starr as Henry's father</li><li>Kevin Corrigan as Michael Hill</li><li>Michael Imperioli as Spider</li><li>Robbie Vinton as Bobby Vinton</li><li>John Williams as Johnny Roastbeef</li><li>Illeana Douglas as Rosie</li><li>Frank Pellegrino as Johnny Dio</li><li>Tony Sirico as Tony Stacks</li><li>Samuel L. Jackson as Stacks Edwards</li><li>Paul Herman as Dealer</li><li>Edward McDonald as himself</li><li>Louis Eppolito as Fat Andy</li><li>Tony Lip as Frankie the Wop</li><li>Anthony Powers as Jimmy Two Times</li><li>Vinny Pastore as Man w/Coatrack</li><li>Tobin Bell as Parole Officer</li><li>Isiah Whitlock Jr. as Doctor</li><li>Richard \"Bo\" Dietl as Arresting Narc</li><li>Ed Deacy as Detective Deacy</li><li>Victor Colicchio as Henry's 60's crew</li><li>Vincent Gallo as Henry's 70's crew</li><li>Joseph Bono as Mikey Franzese</li><li>Katherine Wallach as Diane</li><li>Bob Golub as Truck Driver at Diner</li></ul><br/><h3>Production</h3><h4>Development</h4><p>Goodfellas is based on New York crime reporter Nicholas Pileggi's book Wiseguy. Martin Scorsese did not intend to make another mob film, but he saw a review of Pileggi's book, which he then read while working on the set of The Color of Money in 1986. He had always been fascinated by the mob lifestyle and was drawn to Pileggi's book because he thought it was the most honest portrayal of gangsters he had ever read. After reading the book, Scorsese knew what approach he wanted to take, \"To begin Goodfellas like a gunshot and have it get faster from there, almost like a two-and-a-half-hour trailer. I think it's the only way you can really sense the exhilaration of the lifestyle, and to get a sense of why a lot of people are attracted to it.\" According to Pileggi, Scorsese cold-called the writer and told him, \"I've been waiting for this book my entire life,\" to which Pileggi replied, \"I've been waiting for this phone call my entire life.\"</p><p>Scorsese decided to postpone making the film when funds materialized in 1988 to make The Last Temptation of Christ. He was drawn to the documentary aspects of Pileggi's book. \"The book gives you a sense of the day-to-day life, the tedium, how they work, how they take over certain nightclubs, and for what reasons. It shows how it's done.\" He saw Goodfellas as the third film in an unplanned trilogy of films that examined the lives of Italian Americans \"from slightly different angles.\" He has often described the film as \"a mob home movie\" that is about money, because \"that's what they're really in business for.\" Two weeks in advance of the filming, the real Henry Hill was paid $480,000.</p><h4>Screenplay</h4><p>Scorsese and Pileggi collaborated on the screenplay, and over the course of the 12 drafts it took to reach the ideal script, the reporter realized \"the visual styling had to be completely redone... So we decided to share credit.\" They chose the sections of the book they liked and put them together like building blocks. Scorsese persuaded Pileggi that they did not need to follow a traditional narrative structure. The director wanted to take the gangster film and deal with it episode by episode, but start in the middle and move backwards and forwards. Scorsese compacted scenes, realizing that, if they were kept short, \"the impact after about an hour and a half would be terrific.\" He wanted to do the voiceover like the opening of Jules and Jim (1962) and use \"all the basic tricks of the New Wave from around 1961.\" The names of several real-life gangsters were altered for the film: Tommy \"Two Gun\" DeSimone became the character Tommy DeVito; Paul Vario became Paulie Cicero, and Jimmy \"The Gent\" Burke was portrayed as Jimmy Conway. Scorsese initially titled the film Wise Guy, but later, he and Pileggi decided to change the title of their film to Goodfellas because two contemporary projects, the 1986 Brian De Palma film Wise Guys and the 1987–1990 TV series Wiseguy, had used similar titles.</p><h4>Casting</h4><p>Once Robert De Niro agreed to play Jimmy Conway, Scorsese was able to secure the money needed to make the film. Ray Liotta, who played Henry Hill, had read Pileggi's book when it came out and was fascinated by it. A couple of years afterward, his agent told him Scorsese was going to direct a film adaptation. In 1988, Liotta met Scorsese over a period of a couple of months and auditioned for the film. He campaigned aggressively for a role, though the studio wanted a well-known actor; he later said, \"I think they would've rather had Eddie Murphy than me.\" The director cast Liotta after De Niro saw him in Jonathan Demme's Something Wild (1986); Scorsese was surprised by \"his explosive energy\" in that film. Al Pacino and John Malkovich were considered for the role of Conway, and Sean Penn, Alec Baldwin, Val Kilmer, and Tom Cruise were considered for the role of Hill.</p><p>To prepare for the role, De Niro consulted with Pileggi, who had research material that had been discarded while writing the book. De Niro often called Hill several times a day to ask how Burke walked, held his cigarette, and so on. Driving to and from the set, Liotta listened to FBI audio cassette tapes of Hill, so he could practice speaking like his real-life counterpart. Madonna was considered for the role of Karen Hill. To research her role, Lorraine Bracco tried to get close to a mob wife but was unable to, because they exist in a very tight-knit community. She decided not to meet the real Karen, saying she \"thought it would be better if the creation came from me. I used her life with her parents as an emotional guideline for the role.\" Paul Sorvino had no problem finding the voice and walk of his character, but found it challenging finding what he called \"that kernel of coldness and absolute hardness that is antithetical to my nature except when my family is threatened.\"</p><p>Former EDNY prosecutor Edward A. McDonald appeared in the film as himself, re-creating the conversation he had with Henry and Karen Hill about joining the Witness Protection Program. McDonald, who was friends with Pileggi, was cast on a whim; while a location scout was taking pictures of his office, McDonald casually remarked that he would be happy to play himself if needed. Pileggi called him an hour later asking if he was serious, and he was cast. The scene was unscripted, with McDonald improvising the line referring to Karen as a \"babe-in-the-woods.\"</p><h4>Photography</h4><p>The film was shot on location in Queens, New York state, New Jersey, and parts of Long Island during the spring and summer of 1989, with a budget of $25 million. Scorsese broke the film down into sequences and storyboarded everything because of the complicated style throughout. The filmmaker stated, \" wanted lots of movement and I wanted it to be throughout the whole picture, and I wanted the style to kind of break down by the end, so that by last day as a wise guy, it's as if the whole picture would be out of control, give the impression he's just going to spin off the edge and fly out.\" He added that the film's style comes from the first two or three minutes of Jules and Jim (1962): extensive narration, quick edits, freeze frames, and multiple locale switches. It was this reckless attitude towards convention that mirrored the attitude of many of the gangsters in the film. Scorsese remarked, \"So if you do the movie, you say, 'I don't care if there's too much narration. Too many quick cuts?—That's too bad.' It's that kind of really punk attitude we're trying to show.\" He adopted a frenetic style to almost overwhelm the audience with images and information. He also put plenty of detail in every frame because he believed the gangster life is so rich. Freeze-frames were used because Scorsese wanted images that stopped \"because a point was being reached\" in Henry's life.</p><p>Joe Pesci did not judge his character but found the scene where he kills Spider for talking back to his character hard to do, because he had trouble justifying the action until he forced himself to feel the way Tommy did. Bracco found the shoot to be an emotionally difficult one because it was such a male-dominated cast, and she realized if she did not make her \"work important, it would probably end up on the cutting room floor.\" When it came to the relationship between Henry and Karen, Bracco saw no difference between an abused wife and her character.</p><p>According to Pesci, improvisation and ad-libbing came out of rehearsals wherein Scorsese let the actors do whatever they wanted. He made transcripts of these sessions, took the lines the actors came up with that he liked best, and put them into a revised script that the cast worked from during principal photography. For example, the scene where Tommy tells a story and Henry is responding to him—the \"Funny how? Do I amuse you?\" scene—is based on an actual event that Pesci experienced. Pesci was working as a waiter when he thought he was making a compliment to a mobster by saying he was \"funny\"; however, the comment was not taken well. It was worked on in rehearsals where he and Liotta improvised, and Scorsese recorded four to five takes, rewrote their dialogue, and inserted it into the script. The dinner scene with Tommy's mother was largely improvised. Her painting of the bearded man with the dogs was based on a photograph from National Geographic magazine. The cast did not meet Henry Hill until a few weeks before the film's premiere. Liotta met him in an undisclosed city; Hill had seen the film and told the actor that he loved it.</p><p>The long tracking shot through the Copacabana nightclub came about because of a practical problem: the filmmakers could not get permission to go in the short way, and this forced them to go round the back. Scorsese decided to film the sequence in one unbroken shot in order to symbolize that Henry's entire life was ahead of him, commenting, \"It's his seduction of her and it's also the lifestyle seducing him.\" This sequence was shot eight times.</p><p>Henry's last day as a wise guy was the hardest part of the film for Scorsese to shoot because he wanted to properly show Henry's state of anxiety, paranoia, and racing thoughts caused by cocaine and amphetamines intoxication. In an interview with movie critic Mark Cousins, Scorsese explained the reason for Pesci shooting at the camera at the end of the film, \"well that's a reference right to the end of The Great Train Robbery, that's the way that ends, that film, and basically the plot of this picture is very similar to The Great Train Robbery. It hasn't changed, 90 years later, it's the same story, the gun shots will always be there, he's always going to look behind his back, he's gotta have eyes behind his back, because they're gonna get him someday.\" The director ended the film with Henry regretting that he is no longer a wise guy, about which Scorsese said, \"I think the audience should get angry at him and I would hope they do—and maybe with the system which allows this.\"</p><h4>Post-production</h4><p>Scorsese wanted to depict the film's violence realistically, \"cold, unfeeling and horrible. Almost incidental.\" However, he had to remove 10 frames of blood to ensure an R rating from the MPAA. With a budget of $25 million, Goodfellas was Scorsese's most expensive film to that point but still only a medium-sized budget by Hollywood standards. It was also the first time he was obliged by Warner Bros. to preview the film. It was shown twice in California, and a lot of audiences were \"agitated\" by Henry's last day as a wise guy sequence. Scorsese argued that was the point of the scene. Scorsese and the film's editor, Thelma Schoonmaker, made this sequence faster with more jump cuts to convey Henry's drug-addled point of view. In the first test screening there were 40 walkouts in the first ten minutes. One of the favorite scenes for test audiences was the \"Funny Like a clown? Do I amuse you?\" scene.</p><h4>Soundtrack</h4><p>While there is no incidental score as such in the film, Scorsese chose songs for the soundtrack that he felt obliquely commented on the scene or the characters. In a given scene, he used only music contemporary to or older than the scene's setting. According to Scorsese, a lot of non-dialogue scenes were shot to playback. For example, he had \"Layla\" by Derek and the Dominos playing on the set while shooting the scene where the dead bodies are discovered in the car, dumpster, and meat truck. Sometimes, the lyrics of songs were put between lines of dialogue to comment on the action. Some of the music Scorsese had written into the script, while other songs he discovered during the editing phase.</p><br/><h3>Release</h3><h4>Theatrical</h4><p>Goodfellas premiered at the 47th Venice International Film Festival, where Scorsese received the Silver Lion award for best director. It was given a wide release in North America on September 21, 1990.</p><h4>Home media</h4><p>Goodfellas was released on DVD in March 1997, in a single-disc, double-sided, single-layer format that requires the disc to be flipped during viewing; in 2004, Warner Home Video released a two-disc, dual-layer version, with remastered picture and sound, and bonus materials such as commentary tracks. In early 2007, the film became available on single Blu-ray with all the features from the 2004 release; an expanded Blu-ray version was released on February 16, 2010, for its 20th anniversary, bundled with a disc with features that include the 2008 documentary Public Enemies: The Golden Age of the Gangster Film. On May 5, 2015, a 25th anniversary edition was released. The film was released on 4K Ultra HD Blu-ray on December 6, 2016.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Goodfellas grossed $6.3 million from 1,070 theaters in opening weekend, topping the box office. In its second weekend the film made $5.9 million from 1,291 theaters, falling just 8% and finishing second behind newcomer Pacific Heights. It went on to make $46.8 million domestically.</p><h4>Critical response</h4><p>According to review aggregator Rotten Tomatoes, 96% of 107 critics have given the film a positive review, with an average rating of 9.00/10. The website's critics consensus reads, \"Hard-hitting and stylish, GoodFellas is a gangster classic—and arguably the high point of Martin Scorsese's career.\" Metacritic has assigned the film a weighted average score of 91 out of 100 based on reviews from 21 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale.</p><p>In his review for the Chicago Sun-Times, Roger Ebert gave the film a full four stars and wrote, \"No finer film has ever been made about organized crime – not even The Godfather.\" In his review for the Chicago Tribune, Gene Siskel wrote, \"All of the performances are first-rate; Pesci stands out, though, with his seemingly unscripted manner. GoodFellas is easily one of the year's best films.\" Both named it as the best film of 1990. In his review for The New York Times, Vincent Canby wrote, \"More than any earlier Scorsese film, Goodfellas is memorable for the ensemble nature of the performances... The movie has been beautifully cast from the leading roles to the bits. There is flash also in some of Mr. Scorsese's directorial choices, including freeze frames, fast cutting and the occasional long tracking shot. None of it is superfluous.\" USA Today gave the film four out of four stars and called it, \"great cinema—and also a whopping good time.\" David Ansen, in his review for Newsweek magazine, wrote \"Every crisp minute of this long, teeming movie vibrates with outlaw energy.\" Rex Reed said, \"Big, rich, powerful and explosive. One of Scorsese's best films! Goodfellas is great entertainment.\" In his review for Time, Richard Corliss wrote, \"So it is Scorsese's triumph that GoodFellas offers the fastest, sharpest 2½-hr. ride in recent film history.\"</p><h4>Lists</h4><p>The film was ranked the best of 1990 by Roger Ebert, Gene Siskel, and Peter Travers. In a poll of 80 film critics, \"Goodfellas\" was named the best film of the year by 34 critics. Director Martin Scorsese was chosen as the year's best director in 45 of the 80 ballots.</p><p>Goodfellas is ranked No. 92 on the AFI's 100 Years...100 Movies (10th Anniversary Edition) list, published in 2007. In 2012, the Motion Picture Editors Guild listed Goodfellas as the fifteenth best-edited film of all time based on a survey of its membership. In the 2012 Sight & Sound polls, it was ranked the 48th-greatest film ever made in the directors' poll. In the subsequent 2022 polls, it was ranked 28th in the directors' poll and tied for 63rd (with Casablanca and The Third Man) in the critics' poll. Goodfellas is 39th on James Berardinelli's 2014-made list of the top 100 films of all time. In 2015, Goodfellas ranked 20th on BBC's \"100 Greatest American Films\" list, voted on by film critics from around the world.</p><h4>Accolades</h4><p>It became one of the seven films to win Best Picture from three out of four major U.S. film critics' groups (LA, NBR, NY, NSFC) along with Nashville, All the President's Men, Terms of Endearment, Pulp Fiction, The Hurt Locker, and Drive My Car.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th style=\"background:#bcbcbc;\">Award</th><th style=\"background:#bcbcbc;\">Category</th><th style=\"background:#bcbcbc;\">Nominee</th><th style=\"background:#bcbcbc;\">Result</th></tr><tr><td rowspan=\"6\"><span>Academy Award</span></td><td><span>Best Picture</span></td><td><span>Irwin Winkler</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td>Martin Scorsese</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>Joe Pesci</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actress</span></td><td><span>Lorraine Bracco</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Adapted Screenplay</span></td><td>Martin Scorsese and <span>Nicholas Pileggi</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Thelma Schoonmaker</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"5\"><span>Golden Globe Award</span></td><td><span>Best Motion Picture – Drama</span></td><td>Martin Scorsese and Irwin Winkler</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td>Martin Scorsese</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor</span></td><td>Joe Pesci</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actress</span></td><td>Lorraine Bracco</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay</span></td><td>Martin Scorsese and Nicholas Pileggi</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"7\"><span>British Academy Film Award</span></td><td><span>Best Film</span></td><td>Martin Scorsese and Irwin Winkler</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Martin Scorsese</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Adapted Screenplay</span></td><td>Martin Scorsese and Nicholas Pileggi</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td><span>Robert De Niro</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Editing</span></td><td>Thelma Schoonmaker</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Michael Ballhaus</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Costume Design</span></td><td>Richard Bruno</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Directors Guild of America Award</span></td><td><span>Outstanding Directing – Feature</span></td><td>Martin Scorsese</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Writers Guild of America Award</span></td><td><span>Best Adapted Screenplay</span></td><td>Martin Scorsese and Nicholas Pileggi</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">César Award</span></td><td><span>Best Non-French Film</span></td><td>Martin Scorsese and Irwin Winkler</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>Venice Film Festival</span></td><td><span>Silver Lion</span> for Best Director</td><td>Martin Scorsese</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Audience Award</td><td>Martin Scorsese</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Filmcritica \"Bastone Bianco\" Award</td><td>Martin Scorsese</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>New York Film Critics Circle Award</span></td><td><span>Best Film</span></td><td>Martin Scorsese and Irwin Winkler</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Martin Scorsese</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td>Robert De Niro</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"5\"><span class=\"mw-redirect\">Los Angeles Film Critics Association Award</span></td><td><span>Best Film</span></td><td>Martin Scorsese and Irwin Winkler</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Martin Scorsese</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor</span></td><td>Joe Pesci</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actress</span></td><td>Lorraine Bracco</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Cinematography</span></td><td>Michael Ballhaus</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Board of Review Award</span></td><td><span>Best Supporting Actor</span></td><td>Joe Pesci</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>Boston Society of Film Critics Award</span></td><td><span>Best Film</span></td><td>Martin Scorsese and Irwin Winkler</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Martin Scorsese</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor</span></td><td>Joe Pesci</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"5\"><span>Chicago Film Critics Association Award</span></td><td><span>Best Film</span></td><td>Martin Scorsese and Irwin Winkler</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Martin Scorsese</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor</span></td><td>Joe Pesci</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actress</span></td><td>Lorraine Bracco</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay</span></td><td>Martin Scorsese and Nicholas Pileggi</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">National Society of Film Critics Award</span></td><td><span>Best Film</span></td><td>Martin Scorsese and Irwin Winkler</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Martin Scorsese</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Bodil Award</span></td><td><span>Best American Film</span></td><td>Martin Scorsese and Irwin Winkler</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><br/><h3>Legacy</h3><p>Goodfellas is No. 94 on the American Film Institute's \"100 Years, 100 Movies\" list and moved up to No. 92 on its AFI's 100 Years...100 Movies (10th Anniversary Edition) from 2007. In June 2008, the AFI put Goodfellas at No. 2 on their AFI's 10 Top 10—the best ten films in ten \"classic\" American film genres—after polling over 1,500 people from the movie-related community. Goodfellas was regarded as the second-best in the gangster film genre (after The Godfather). In 2000, the United States Library of Congress deemed the film \"culturally significant\" and selected it for preservation in the National Film Registry.</p><p>Roger Ebert named Goodfellas the \"best mob movie ever\" and placed it among the ten best films of the 1990s. In December 2002, a UK film critics poll in Sight & Sound ranked the film No. 4 on their list of the 10 Best Films of the Last 25 Years. Time included Goodfellas in their list of Time's All-Time 100 Movies. Channel 4 placed Goodfellas at No. 10 in their 2002 poll The 100 Greatest Films, Empire listed Goodfellas at No. 6 on their \"500 Greatest Movies Of All Time,\" and Total Film voted Goodfellas No. 1 as the greatest film of all time.</p><p>Premiere listed Joe Pesci's Tommy DeVito as No. 96 on its list of \"The 100 Greatest Movie Characters of All Time,\" calling him \"perhaps the single most irredeemable character ever put on film.\" Empire ranked Tommy DeVito No. 59 in their \"The 100 Greatest Movie Characters\" poll.</p><p>Goodfellas inspired director David Chase to make the HBO television series The Sopranos. He told Peter Bogdanovich, \"Goodfellas is a very important movie to me and Goodfellas really plowed that ... I found that movie very funny and brutal and it felt very real. And yet that was the first mob movie that Scorsese ever dealt with a mob crew. ... as opposed to say The Godfather ... which there's something operatic about it, classical, even the clothing and the cars. You know I mean I always think about Goodfellas when they go to their mother's house that night when they're eating, you know when she brings out her painting, that stuff is great. I mean The Sopranos learned a lot from that.\" Indeed, the film shares a total of 27 actors with The Sopranos, including Bracco, Sirico, Imperioli, Pellegrino, Lip, and Vincent, who all had major roles in Chase's HBO series.</p><p>July 24, 2010 marked the 20th anniversary of the film's release. This milestone was celebrated with Henry Hill hosting a private screening for a select group of invitees at the Museum of the American Gangster, in New York City.</p><p>In January 2012, it was announced that the AMC Network had put a television series version of the movie in development. Pileggi was on board to co-write the adaptation with television writer-producer Jorge Zamacona. The two were set to executive produce with the film's producer Irwin Winkler and his son, David.</p><p>Luc Besson's 2013 crime comedy film The Family features a sequence where Giovanni Manzoni (Goodfellas star De Niro), a gangster who is under witness protection for testifying against a member of his family, watches Goodfellas.</p><p>In 2014, the ESPN-produced 30 for 30 series debuted Playing for the Mob, the story about how Hill and his Pittsburgh associates, and several Boston College basketball players, committed the point shaving scandal during the 1978–79 season, an episode briefly mentioned in the movie. The documentary, narrated by Liotta, was set up so that the viewer needed to watch the film beforehand in order to understand many of the references in the story.</p><p>In 2015, Goodfellas closed the Tribeca Film Festival with a screening of its 25th-anniversary remaster.</p><p>American Film Institute Lists</p><ul><li>AFI's 100 Years... 100 Movies - #94</li><li>AFI's 100 Years... 100 Movies (10th Anniversary Edition) - #92</li><li>AFI's 10 Top 10 - #2 Gangster film</li><li>AFI's 100 Years... 100 Heroes and Villains - Tommy DeVito - Nominated Villain</li><li>AFI's 100 Years... 100 Movie Quotes - \"Funny how?\" - Nominated Quote</li></ul><br/>"
  },
  "errorMessage": ""
}