{
  "imDbId": "tt0105236",
  "title": "Reservoir Dogs",
  "fullTitle": "Reservoir Dogs (1992)",
  "type": "Movie",
  "year": "1992",
  "items": [
    {
      "publisher": "Entertainment Weekly",
      "author": "Ty Burr",
      "link": "",
      "rate": "100",
      "content": "You may not like the terms Tarantino sets, but you have to admit he succeeds on them."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Mick LaSalle",
      "link": "",
      "rate": "100",
      "content": "A brutal movie, brutal in all the right ways -- brutally stark, brutally funny, brutally brutal. [30 Oct 1992]"
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Rick Groen",
      "link": "",
      "rate": "100",
      "content": "Reservoir Dogs sizzles - it's dynamite on a short fuse, and you watch it with mesmerized fascination, simultaneously attracted and repelled by the explosion you know will come."
    },
    {
      "publisher": "Film Threat",
      "author": "Brad Laidman",
      "link": "",
      "rate": "90",
      "content": "The truth is that for all the controversy there really isnt that much violence in Reservoir Dogs. The reason people were so affected was because the film shows you the true impact of its violence."
    },
    {
      "publisher": "Time",
      "author": "Richard Corliss",
      "link": "",
      "rate": "90",
      "content": "Most of the movie is Actors Acting: gifted guys (Harvey Keitel, Tim Roth, Steve Buscemi, Chris Penn) running nattering riffs on familiar lout themes. [16 Nov 1992]"
    },
    {
      "publisher": "USA Today",
      "author": "Mike Clark",
      "link": "",
      "rate": "88",
      "content": "Too lingeringly creepy to ignore. [23 Oct 1992]"
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "80",
      "content": "It's unclear whether this macho thriller does anything to improve the state of the world or our understanding of it, but it certainly sets off enough rockets to hold us and shake us for every one of its 99 minutes."
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Marc Savlov",
      "link": "https://www.austinchronicle.com/events/film/",
      "rate": "78",
      "content": "Though its reach sometimes exceeds its grasp, Tarantino has created a movie with all the gritty punch of a .44 in the belly."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Kenneth Turan",
      "link": "",
      "rate": "70",
      "content": "Tarantino's palpable enthusiasm, his unapologietic passion for what he's created, reinvigorates this venerable plot and, mayhem aside, makes it involving for longer than you might suspect. [27 Oct 1992]"
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Gene Siskel",
      "link": "",
      "rate": "63",
      "content": "Tarantino's debut directing job acknowledges the sloppiness and silences that are typically squeezed out of most crime films, but we get the point early on and the remainder is macho posturing. [23 Oct 1992]"
    }
  ],
  "errorMessage": ""
}