{
  "imDbId": "tt0105236",
  "title": "Reservoir Dogs",
  "fullTitle": "Reservoir Dogs (1992)",
  "type": "Movie",
  "year": "1992",
  "language": "en",
  "titleInLanguage": "Reservoir Dogs",
  "url": "https://en.wikipedia.org/wiki/Reservoir_Dogs",
  "plotShort": {
    "plainText": "Reservoir Dogs is a 1992 American neo-noir crime film written and directed by Quentin Tarantino in his feature-length debut. It stars Harvey Keitel, Tim Roth, Chris Penn, Steve Buscemi, Lawrence Tierney, Michael Madsen, Tarantino, and Edward Bunker as diamond thieves whose heist of a jewelry store goes terribly wrong. Kirk Baltz, Randy Brooks, and Steven Wright also play supporting roles. It incorporates many motifs that have become Tarantino's hallmarks: violent crime, pop culture references, profanity, and nonlinear storytelling.\r\nThe film is regarded as a classic of independent film and a cult film and was named \"Greatest Independent Film of all Time\" by Empire. Although controversial at first for its depictions of violence and heavy use of profanity, Reservoir Dogs was generally well-received, with the cast being praised by many critics. Despite not being heavily promoted during its theatrical run, the film became a modest success in the United States after grossing $2.8 million against its scant budget. It achieved higher popularity after the success of Tarantino's next film, Pulp Fiction (1994). A soundtrack was released featuring songs used in the film, which are mostly from the 1970s.",
    "html": "<p>Reservoir Dogs is a 1992 American neo-noir crime film written and directed by Quentin Tarantino in his feature-length debut. It stars Harvey Keitel, Tim Roth, Chris Penn, Steve Buscemi, Lawrence Tierney, Michael Madsen, Tarantino, and Edward Bunker as diamond thieves whose heist of a jewelry store goes terribly wrong. Kirk Baltz, Randy Brooks, and Steven Wright also play supporting roles. It incorporates many motifs that have become Tarantino's hallmarks: violent crime, pop culture references, profanity, and nonlinear storytelling.</p><p>The film is regarded as a classic of independent film and a cult film and was named \"Greatest Independent Film of all Time\" by Empire. Although controversial at first for its depictions of violence and heavy use of profanity, Reservoir Dogs was generally well-received, with the cast being praised by many critics. Despite not being heavily promoted during its theatrical run, the film became a modest success in the United States after grossing $2.8 million against its scant budget. It achieved higher popularity after the success of Tarantino's next film, Pulp Fiction (1994). A soundtrack was released featuring songs used in the film, which are mostly from the 1970s.</p>"
  },
  "plotFull": {
    "plainText": "Reservoir Dogs is a 1992 American neo-noir crime film written and directed by Quentin Tarantino in his feature-length debut. It stars Harvey Keitel, Tim Roth, Chris Penn, Steve Buscemi, Lawrence Tierney, Michael Madsen, Tarantino, and Edward Bunker as diamond thieves whose heist of a jewelry store goes terribly wrong. Kirk Baltz, Randy Brooks, and Steven Wright also play supporting roles. It incorporates many motifs that have become Tarantino's hallmarks: violent crime, pop culture references, profanity, and nonlinear storytelling.\r\nThe film is regarded as a classic of independent film and a cult film and was named \"Greatest Independent Film of all Time\" by Empire. Although controversial at first for its depictions of violence and heavy use of profanity, Reservoir Dogs was generally well-received, with the cast being praised by many critics. Despite not being heavily promoted during its theatrical run, the film became a modest success in the United States after grossing $2.8 million against its scant budget. It achieved higher popularity after the success of Tarantino's next film, Pulp Fiction (1994). A soundtrack was released featuring songs used in the film, which are mostly from the 1970s.\r\nPlot\r\nEight gangsters eat breakfast at a Los Angeles diner. All but the boss Joe Cabot and his son, underboss \"Nice Guy\" Eddie Cabot, use aliases: Mr. Brown, Mr. White, Mr. Blonde, Mr. Blue, Mr. Orange and Mr. Pink. After Mr. Brown finishes rambling about the Madonna song \"Like a Virgin\", the group argues about Mr. Pink's policy of not tipping.\r\nThe gangsters carry out a diamond heist offscreen. Mr. White is then shown fleeing with Mr. Orange, who was shot during the escape and is bleeding severely in the back of Mr. White's car. At one of Joe's warehouses, Mr. White and Mr. Orange rendezvous with Mr. Pink, who believes that the job was a setup, and that the police were waiting for them. Mr. White informs him that Mr. Brown is dead, Mr. Blue and Mr. Blonde are missing, and Mr. Blonde murdered several civilians during the heist. Mr. White is furious that Joe, his old friend, would employ Mr. Blonde, whom he describes as a psychopath. Mr. Pink has hidden the diamonds nearby and argues with Mr. White over whether to get medical attention for Mr. Orange, and the pair draw guns at each other. They stand down when Mr. Blonde arrives with a kidnapped policeman, Marvin Nash.\r\nSome time earlier, Mr. Blonde meets with the Cabots, having completed a four-year jail sentence. To reward him for not having given Joe's name to the authorities for a lighter sentence, they offer him a no-show job. Mr. Blonde is grateful, but insists that he wants to get back to \"real work\", and they recruit him for the heist.\r\nIn the present, Mr. White and Mr. Pink beat Nash for information. Eddie arrives and orders them to retrieve the diamonds and ditch the getaway vehicles, leaving Mr. Blonde in charge of Nash and Mr. Orange. Nash denies knowledge, but Mr. Blonde ignores him and resumes the torture, cutting off Nash's ear with a straight razor. He prepares to set him on fire, but Mr. Orange shoots Mr. Blonde dead. Mr. Orange reveals to Nash that he is an undercover police officer named Freddy Newendyke (which Nash is already aware of) and that the police will arrive when Joe comes to the warehouse.\r\nWhen Eddie, Mr. Pink, and Mr. White return, Mr. Orange tries to convince them that Mr. Blonde planned to kill them all and steal the diamonds for himself. Eddie impulsively kills Nash and accuses Mr. Orange of lying, since Mr. Blonde was loyal to his father. Joe arrives with news that the police have killed Mr. Blue. He is about to execute Mr. Orange, who he suspects is the traitor behind the setup, but Mr. White intervenes and holds Joe at gunpoint, insisting that Mr. Orange is not a police officer. Eddie aims his gun at Mr. White, creating a Mexican standoff. All three fire; both Cabots are killed, and Mr. White and Mr. Orange are hit.\r\nMr. Pink (the only uninjured person), takes the diamonds and flees, but is apprehended by the police outside. As Mr. White cradles the dying Mr. Orange in his arms, Mr. Orange confesses that he is in fact a police officer. Mr. White presses his gun to Mr. Orange's head. The police storm the warehouse and order Mr. White to drop his gun. He fires the gun instead, then more gunshots sound and Mr. White collapses.\r\nCast\r\nHarvey Keitel as Larry Dimmick / Mr. White\r\nTim Roth as Freddy Newendyke / Mr. Orange\r\nMichael Madsen as Vic Vega / Mr. Blonde\r\nChris Penn as \"Nice Guy\" Eddie Cabot\r\nSteve Buscemi as Mr. Pink\r\nLawrence Tierney as Joe Cabot\r\nRandy Brooks as Holdaway\r\nKirk Baltz as Marvin Nash\r\nEdward Bunker as Mr. Blue\r\nQuentin Tarantino as Mr. Brown\r\nDavid Steen as Sheriff #2\r\nSteven Wright as K-Billy DJ (voice)\r\nNina Siemaszko played police officer Jody McClusky. Her scenes were deleted from the theatrical release. There is an unseen accomplice of Joe and Eddie who speaks to Eddie on the phone. His name is Dov Schwarz. He was named after the sound editor on My Best Friend's Birthday.\r\nProduction\r\nQuentin Tarantino had been working at Video Archives, a video store in Manhattan Beach, California, and originally planned to shoot the film with his friends on a budget of $30,000 in a 16 mm black-and-white format, with producer Lawrence Bender playing a police officer chasing Mr. Pink. Bender gave the script to his acting teacher, whose wife gave the script to Harvey Keitel. Keitel liked it enough to sign as a co-producer so Tarantino and Bender would have an easier job finding funding; with his assistance, they raised $1.5 million. Keitel also paid for Tarantino and Bender to host casting sessions in New York, where the duo found Steve Buscemi, Michael Madsen, and Tim Roth. Jon Cryer was asked to audition for the role of Mr. Pink, but he backed out at the last minute. George Clooney also read for a part. Tim Roth's agents originally wanted him to be Mr. Pink or Mr. Blonde, but he preferred Mr. Orange because he would \"be an English actor pretending to be American playing a cop pretending to be a robber\".\r\nReservoir Dogs was, according to Tarantino, influenced by Stanley Kubrick's 1956 film The Killing. Tarantino said: \"I didn't go out of my way to do a rip-off of The Killing, but I did think of it as my 'Killing', my take on that kind of heist movie.\" The film's plot was also inspired by the 1952 film Kansas City Confidential. Additionally, Joseph H. Lewis's 1955 film The Big Combo and Sergio Corbucci's 1966 Spaghetti Western Django inspired the scene where a police officer is tortured in a chair. Tarantino has denied that he plagiarized with Reservoir Dogs and instead said that he does homages. Having the main characters named after colors (Mr. Pink, White, Brown, etc.) was first seen in the 1974 film The Taking of Pelham One Two Three. The film also contains key elements similar to those found in Ringo Lam's 1987 film City on Fire. Tarantino praised the film City on Fire and mentioned it as a major influence.\r\nThe warehouse scenes were filmed in an unused mortuary filled with coffins, funeral equipment, embalming fluid, and a hearse. Mr. Orange's apartment was a room on the second floor of the mortuary, dressed to look like living quarters. The building has since been demolished.\r\nTarantino's decision not to film the diamond robbery was twofold: for budgetary reasons, and to keep the details of the heist ambiguous. By not showing the robbery and having the characters describe it, Tarantino explained, the film is allowed to be \"about other things\", similar to the way in which the robbery in Glengarry Glen Ross and its film adaptation is discussed, described, and debated, but never shown. Tarantino compared the technique to the work of a novelist, and said he wanted the film to be about something not seen and to \"play with a real-time clock as opposed to a movie clock ticking\".\r\nReception\r\nBox office\r\nReservoir Dogs premiered at the Sundance Film Festival in January 1992. It became the festival's most talked-about film, and was subsequently picked up for distribution by Miramax Films. After being shown at several other film festivals, including in Cannes, Sitges, and Toronto, Reservoir Dogs opened in the United States in 19 theaters on October 9, 1992 with a first week total of $147,839. It was expanded to 61 theaters on October 23, 1992 and totaled $2,832,029 at the domestic box office. The film grossed more than double that in the United Kingdom, where it did not receive a home video release until 1995. During the period of unavailability on home video, the film was re-released in UK cinemas in June 1994.\r\nCritical reception\r\nReservoir Dogs is regarded as an important and influential milestone of independent filmmaking. Review aggregation website Rotten Tomatoes gives the film an approval rating of 90% based on 76 reviews, and an average rating of 8.9/10. The site's critical consensus reads, \"Thrumming with intelligence and energy, Reservoir Dogs opens Quentin Tarantino's filmmaking career with hard-hitting style.\" On Metacritic the film has an average score of 81 out of 100, based on 24 critics, indicating \"universal acclaim\". Empire magazine named it the \"Greatest Independent Film\" ever made.\r\nAt the film's release at the Sundance Film Festival, film critic Jami Bernard of the New York Daily News compared the effect of Reservoir Dogs to that of the 1895 film L'Arrivée d'un Train en Gare de la Ciotat, when audiences supposedly saw a moving train approaching the camera and ducked. Bernard said that Reservoir Dogs had a similar effect and people were not ready for it. Vincent Canby of The New York Times enjoyed the cast and the usage of non-linear storytelling. He similarly complimented Tarantino's directing and liked the fact that he did not often use close-ups in the film. Kenneth Turan of the Los Angeles Times also enjoyed the film and the acting, particularly that of Buscemi, Tierney and Madsen, and said \"Tarantino's palpable enthusiasm, his unapologetic passion for what he's created, reinvigorates this venerable plot and, mayhem aside, makes it involving for longer than you might suspect.\" Critic James Berardinelli was of a similar opinion; he complimented both the cast and Tarantino's dialogue writing abilities. Hal Hinson of The Washington Post was also enthusiastic about the cast, complimenting the film on its \"deadpan sense of humor\".\r\nRoger Ebert was less enthusiastic; he felt that the script could have been better and said that the film \"feels like it's going to be terrific\", but Tarantino's script does not have much curiosity about the characters. He also said that Tarantino \"has an idea, and trusts the idea to drive the plot.\" Ebert gave the film two and a half stars out of four and said that while he enjoyed it and that it was a very good film from a talented director, \"I liked what I saw, but I wanted more.\"\r\nThe film has received substantial criticism for its strong violence and language. One scene that viewers found particularly unnerving was the ear-cutting scene; Madsen himself reportedly had great difficulty finishing it, especially after Kirk Baltz ad-libbed the desperate plea \"I've got a little kid at home.\" Many people walked out during the film. During a screening at Sitges Film Festival, 15 people walked out, including horror film director Wes Craven and special makeup effects artist Rick Baker. Baker later told Tarantino to take the walkout as a \"compliment\" and explained that he found the violence unnerving because of its heightened sense of realism. Tarantino commented about it at the time: \"It happens at every single screening. For some people the violence, or the rudeness of the language, is a mountain they can't climb. That's OK. It's not their cup of tea. But I am affecting them. I wanted that scene to be disturbing.\"\r\nAnalysis\r\nReservoir Dogs has often been seen as a prominent film in terms of on-screen violence. J.P. Telotte compared Reservoir Dogs to classic caper noir films and points out the irony in its ending scenes. Mark Irwin also made the connection between Reservoir Dogs and classic American noir. Caroline Jewers called Reservoir Dogs a \"feudal epic\" and paralleled the color pseudonyms to color names of medieval knights.\r\nCritics have observed parallels between Reservoir Dogs and other films. For its nonlinear storyline, Reservoir Dogs has often been compared to Akira Kurosawa's Rashomon. Critic John Hartl compared the ear-cutting scene to the shower murder scene in Alfred Hitchcock's Psycho and Tarantino to David Lynch. He furthermore explored parallels between Reservoir Dogs and Glengarry Glen Ross. Todd McCarthy, who called the film \"undeniably impressive\", was of the opinion that it was influenced by Mean Streets, Goodfellas and Stanley Kubrick's The Killing. After this film, Tarantino himself was also compared to Martin Scorsese, Sam Peckinpah, John Singleton, Gus Van Sant, and Abel Ferrara.\r\nA frequently cited comparison has been to Tarantino's second and more successful film Pulp Fiction, especially since the majority of audiences saw Reservoir Dogs after the success of Pulp Fiction. Comparisons have been made regarding the black humor in both the films, the theme of accidents, and more concretely, the style of dialogue and narrative that Tarantino incorporates into both films. Specifically the relationship between white people and black people plays a big part in the films—though underplayed in Reservoir Dogs. Stanley Crouch of The New York Times compared the way the white criminals speak of black people in Reservoir Dogs to the way they are spoken of in Scorsese's Mean Streets and Goodfellas. Crouch observed the way black people are looked down upon in Reservoir Dogs, but also the way that the criminals accuse each other of \"verbally imitating\" black men and the characters' apparent sexual attraction to black actress Pam Grier.\r\nIn February 2012, as part of an ongoing series of live dramatic readings of film scripts being staged with the Los Angeles County Museum of Art (LACMA), director Jason Reitman cast black actors in the originally white cast: Laurence Fishburne as Mr. White; Terrence Howard as Mr. Blonde; Anthony Mackie as Mr. Pink; Cuba Gooding Jr. as Mr. Orange; Chi McBride as Joe Cabot; Anthony Anderson as Nice Guy Eddie (Joe Cabot's son); Common as both Mr. Brown and Officer Nash (the torture victim of Mr. Blonde), and Patton Oswalt as Holdaway (the mentor cop who was originally played by Randy Brooks, the only black actor in the film). Critic Elvis Mitchell suggested that Reitman's version of the script was taking the source material back to its roots since the characters \"all sound like black dudes.\"\r\nAccolades\r\nThe film was screened out of competition at the 1992 Cannes Film Festival. It won the Critic's Award at the 4th Yubari International Fantastic Film Festival in February 1993, which Tarantino attended. The film was also nominated for the Grand Prix of the Belgian Syndicate of Cinema Critics. Steve Buscemi won the 1992 Independent Spirit Award for Best Supporting Male. Reservoir Dogs ranks at No. 97 in Empire magazine's list of the 500 Greatest Films of All Time.\r\nHome media\r\nIn the United Kingdom, release of the VHS rental video was delayed until 1995 due to the British Board of Film Classification initially refusing the film a home video certificate (UK releases are required to be certified separately for theatrical release and for viewing at home). The latter is a requirement by law due to the Video Recordings Act 1984. Following the UK VHS release approval, PolyGram released a \"Mr Blonde Deluxe Edition\", which included an interview with Tarantino and several memorabilia associated with the character Mr. Blonde, such as sunglasses and a chrome toothpick holder.\r\nRegion 1 DVDs of Reservoir Dogs have been released multiple times. The first release was a single two-sided disc from LIVE Entertainment, released in June 1997 and featuring both open matte and letterbox versions of the film. Five years later, on August 27, 2002, Artisan Entertainment (who changed their name from LIVE Entertainment in the interim) released a two-disc 10th anniversary edition on DVD and VHS featuring multiple covers color-coded to match the nicknames of five of the characters (Pink, White, Orange, Blonde, and Brown) and a disc of bonus features such as interviews with the cast and crew. However, the full screen version on the second disc was a pan and scan transfer from the widescreen 2.39:1 version, as opposed to open matte like the '97 DVD.\r\nFor the film's 15th anniversary, Lionsgate (which had purchased Artisan in the interim) produced a two-disc anniversary edition with a remastered 16:9 transfer and a new supplement, but not all of the extra features from the 10th Anniversary edition. In particular, interviews with the cast and crew were removed, and a new 48-minute-long feature called \"Tributes and Dedications\" was included.\r\nLionsgate Home Entertainment celebrated the 30th anniversary of Reservoir Dogs with a 4K Blu-ray release, which was released in the U.S. on November 15, 2022.\r\nSoundtrack\r\nThe Reservoir Dogs: Original Motion Picture Soundtrack was the first soundtrack for a Quentin Tarantino film and set the structure his later soundtracks would follow. This includes the extensive use of snippets of dialogue from the film. The soundtrack has selections of songs from the 1960s to '80s. Only the group Bedlam recorded original songs for the film. Reasoning that the film takes place over a weekend, Tarantino decided to set it to a fictional radio station 'K-Billy' (presumably KBLY)'s show \"K-Billy's Super Sounds of the Seventies Weekend\", a themed weekend show of broadcasts of songs from the seventies. The radio station played a prominent role in the film. The DJ for the radio was chosen to be Steven Wright, a comedian known for his deadpan delivery of jokes.\r\nAn unusual feature of the soundtrack was the choice of songs; Tarantino has said that he feels the music to be a counterpoint to the on-screen violence and action. He also stated that he wished for the film to have a 1950s feel while using '70s music. A prominent instance of this is the torture scene to the tune of \"Stuck in the Middle with You\".\r\nCertifications\r\nVideo games\r\nA video game based on the film was released in 2006 for PC, Xbox, and PlayStation 2. However, the game does not feature the likeness of any of the actors with the exception of Michael Madsen. The game was received unfavorably, with GameSpot calling it \"an out and out failure\". It caused controversy for its amount of violence and it was banned in Australia, Germany and New Zealand.\r\nAnother video game, Reservoir Dogs: Bloody Days, was released in 2017.\r\nOn December 14, 2017, Overkill Software added a heist to Payday 2 inspired by Reservoir Dogs in which the player is contracted to rob a jewelry store in Los Angeles with the Cabot family. It is unique in that the heist is played in reverse order, with day two occurring prior to day one, similar to how the film's plot is out of chronological order.\r\nRemakes\r\nKaante, a Bollywood film released in 2002, is a remake of Reservoir Dogs, combined with elements of City on Fire. The film also borrows plot points from Heat and The Killing. Tarantino has been quoted as saying that Kaante is his favorite among the many films inspired by his work. Tarantino later screened Kaante at his New Beverly Cinema alongside Reservoir Dogs and City on Fire.\r\nTarantino revealed in June 2021 that he had at one point considered remaking Reservoir Dogs as his tenth and final directed film, though he quickly iterated that he \"won't do it\".",
    "html": "<p>Reservoir Dogs is a 1992 American neo-noir crime film written and directed by Quentin Tarantino in his feature-length debut. It stars Harvey Keitel, Tim Roth, Chris Penn, Steve Buscemi, Lawrence Tierney, Michael Madsen, Tarantino, and Edward Bunker as diamond thieves whose heist of a jewelry store goes terribly wrong. Kirk Baltz, Randy Brooks, and Steven Wright also play supporting roles. It incorporates many motifs that have become Tarantino's hallmarks: violent crime, pop culture references, profanity, and nonlinear storytelling.</p><p>The film is regarded as a classic of independent film and a cult film and was named \"Greatest Independent Film of all Time\" by Empire. Although controversial at first for its depictions of violence and heavy use of profanity, Reservoir Dogs was generally well-received, with the cast being praised by many critics. Despite not being heavily promoted during its theatrical run, the film became a modest success in the United States after grossing $2.8 million against its scant budget. It achieved higher popularity after the success of Tarantino's next film, Pulp Fiction (1994). A soundtrack was released featuring songs used in the film, which are mostly from the 1970s.</p><br/><h3>Plot</h3><p>Eight gangsters eat breakfast at a Los Angeles diner. All but the boss Joe Cabot and his son, underboss \"Nice Guy\" Eddie Cabot, use aliases: Mr. Brown, Mr. White, Mr. Blonde, Mr. Blue, Mr. Orange and Mr. Pink. After Mr. Brown finishes rambling about the Madonna song \"Like a Virgin\", the group argues about Mr. Pink's policy of not tipping.</p><p>The gangsters carry out a diamond heist offscreen. Mr. White is then shown fleeing with Mr. Orange, who was shot during the escape and is bleeding severely in the back of Mr. White's car. At one of Joe's warehouses, Mr. White and Mr. Orange rendezvous with Mr. Pink, who believes that the job was a setup, and that the police were waiting for them. Mr. White informs him that Mr. Brown is dead, Mr. Blue and Mr. Blonde are missing, and Mr. Blonde murdered several civilians during the heist. Mr. White is furious that Joe, his old friend, would employ Mr. Blonde, whom he describes as a psychopath. Mr. Pink has hidden the diamonds nearby and argues with Mr. White over whether to get medical attention for Mr. Orange, and the pair draw guns at each other. They stand down when Mr. Blonde arrives with a kidnapped policeman, Marvin Nash.</p><p>Some time earlier, Mr. Blonde meets with the Cabots, having completed a four-year jail sentence. To reward him for not having given Joe's name to the authorities for a lighter sentence, they offer him a no-show job. Mr. Blonde is grateful, but insists that he wants to get back to \"real work\", and they recruit him for the heist.</p><p>In the present, Mr. White and Mr. Pink beat Nash for information. Eddie arrives and orders them to retrieve the diamonds and ditch the getaway vehicles, leaving Mr. Blonde in charge of Nash and Mr. Orange. Nash denies knowledge, but Mr. Blonde ignores him and resumes the torture, cutting off Nash's ear with a straight razor. He prepares to set him on fire, but Mr. Orange shoots Mr. Blonde dead. Mr. Orange reveals to Nash that he is an undercover police officer named Freddy Newendyke (which Nash is already aware of) and that the police will arrive when Joe comes to the warehouse.</p><p>When Eddie, Mr. Pink, and Mr. White return, Mr. Orange tries to convince them that Mr. Blonde planned to kill them all and steal the diamonds for himself. Eddie impulsively kills Nash and accuses Mr. Orange of lying, since Mr. Blonde was loyal to his father. Joe arrives with news that the police have killed Mr. Blue. He is about to execute Mr. Orange, who he suspects is the traitor behind the setup, but Mr. White intervenes and holds Joe at gunpoint, insisting that Mr. Orange is not a police officer. Eddie aims his gun at Mr. White, creating a Mexican standoff. All three fire; both Cabots are killed, and Mr. White and Mr. Orange are hit.</p><p>Mr. Pink (the only uninjured person), takes the diamonds and flees, but is apprehended by the police outside. As Mr. White cradles the dying Mr. Orange in his arms, Mr. Orange confesses that he is in fact a police officer. Mr. White presses his gun to Mr. Orange's head. The police storm the warehouse and order Mr. White to drop his gun. He fires the gun instead, then more gunshots sound and Mr. White collapses.</p><br/><h3>Cast</h3><ul><li>Harvey Keitel as Larry Dimmick / Mr. White</li><li>Tim Roth as Freddy Newendyke / Mr. Orange</li><li>Michael Madsen as Vic Vega / Mr. Blonde</li><li>Chris Penn as \"Nice Guy\" Eddie Cabot</li><li>Steve Buscemi as Mr. Pink</li><li>Lawrence Tierney as Joe Cabot</li><li>Randy Brooks as Holdaway</li><li>Kirk Baltz as Marvin Nash</li><li>Edward Bunker as Mr. Blue</li><li>Quentin Tarantino as Mr. Brown</li><li>David Steen as Sheriff #2</li><li>Steven Wright as K-Billy DJ (voice)</li></ul><p>Nina Siemaszko played police officer Jody McClusky. Her scenes were deleted from the theatrical release. There is an unseen accomplice of Joe and Eddie who speaks to Eddie on the phone. His name is Dov Schwarz. He was named after the sound editor on My Best Friend's Birthday.</p><br/><h3>Production</h3><p>Quentin Tarantino had been working at Video Archives, a video store in Manhattan Beach, California, and originally planned to shoot the film with his friends on a budget of $30,000 in a 16 mm black-and-white format, with producer Lawrence Bender playing a police officer chasing Mr. Pink. Bender gave the script to his acting teacher, whose wife gave the script to Harvey Keitel. Keitel liked it enough to sign as a co-producer so Tarantino and Bender would have an easier job finding funding; with his assistance, they raised $1.5 million. Keitel also paid for Tarantino and Bender to host casting sessions in New York, where the duo found Steve Buscemi, Michael Madsen, and Tim Roth. Jon Cryer was asked to audition for the role of Mr. Pink, but he backed out at the last minute. George Clooney also read for a part. Tim Roth's agents originally wanted him to be Mr. Pink or Mr. Blonde, but he preferred Mr. Orange because he would \"be an English actor pretending to be American playing a cop pretending to be a robber\".</p><p>Reservoir Dogs was, according to Tarantino, influenced by Stanley Kubrick's 1956 film The Killing. Tarantino said: \"I didn't go out of my way to do a rip-off of The Killing, but I did think of it as my 'Killing', my take on that kind of heist movie.\" The film's plot was also inspired by the 1952 film Kansas City Confidential. Additionally, Joseph H. Lewis's 1955 film The Big Combo and Sergio Corbucci's 1966 Spaghetti Western Django inspired the scene where a police officer is tortured in a chair. Tarantino has denied that he plagiarized with Reservoir Dogs and instead said that he does homages. Having the main characters named after colors (Mr. Pink, White, Brown, etc.) was first seen in the 1974 film The Taking of Pelham One Two Three. The film also contains key elements similar to those found in Ringo Lam's 1987 film City on Fire. Tarantino praised the film City on Fire and mentioned it as a major influence.</p><p>The warehouse scenes were filmed in an unused mortuary filled with coffins, funeral equipment, embalming fluid, and a hearse. Mr. Orange's apartment was a room on the second floor of the mortuary, dressed to look like living quarters. The building has since been demolished.</p><p>Tarantino's decision not to film the diamond robbery was twofold: for budgetary reasons, and to keep the details of the heist ambiguous. By not showing the robbery and having the characters describe it, Tarantino explained, the film is allowed to be \"about other things\", similar to the way in which the robbery in Glengarry Glen Ross and its film adaptation is discussed, described, and debated, but never shown. Tarantino compared the technique to the work of a novelist, and said he wanted the film to be about something not seen and to \"play with a real-time clock as opposed to a movie clock ticking\".</p><br/><h3>Reception</h3><h4>Box office</h4><p>Reservoir Dogs premiered at the Sundance Film Festival in January 1992. It became the festival's most talked-about film, and was subsequently picked up for distribution by Miramax Films. After being shown at several other film festivals, including in Cannes, Sitges, and Toronto, Reservoir Dogs opened in the United States in 19 theaters on October 9, 1992 with a first week total of $147,839. It was expanded to 61 theaters on October 23, 1992 and totaled $2,832,029 at the domestic box office. The film grossed more than double that in the United Kingdom, where it did not receive a home video release until 1995. During the period of unavailability on home video, the film was re-released in UK cinemas in June 1994.</p><h4>Critical reception</h4><p>Reservoir Dogs is regarded as an important and influential milestone of independent filmmaking. Review aggregation website Rotten Tomatoes gives the film an approval rating of 90% based on 76 reviews, and an average rating of 8.9/10. The site's critical consensus reads, \"Thrumming with intelligence and energy, Reservoir Dogs opens Quentin Tarantino's filmmaking career with hard-hitting style.\" On Metacritic the film has an average score of 81 out of 100, based on 24 critics, indicating \"universal acclaim\". Empire magazine named it the \"Greatest Independent Film\" ever made.</p><p>At the film's release at the Sundance Film Festival, film critic Jami Bernard of the New York Daily News compared the effect of Reservoir Dogs to that of the 1895 film L'Arrivée d'un Train en Gare de la Ciotat, when audiences supposedly saw a moving train approaching the camera and ducked. Bernard said that Reservoir Dogs had a similar effect and people were not ready for it. Vincent Canby of The New York Times enjoyed the cast and the usage of non-linear storytelling. He similarly complimented Tarantino's directing and liked the fact that he did not often use close-ups in the film. Kenneth Turan of the Los Angeles Times also enjoyed the film and the acting, particularly that of Buscemi, Tierney and Madsen, and said \"Tarantino's palpable enthusiasm, his unapologetic passion for what he's created, reinvigorates this venerable plot and, mayhem aside, makes it involving for longer than you might suspect.\" Critic James Berardinelli was of a similar opinion; he complimented both the cast and Tarantino's dialogue writing abilities. Hal Hinson of The Washington Post was also enthusiastic about the cast, complimenting the film on its \"deadpan sense of humor\".</p><p>Roger Ebert was less enthusiastic; he felt that the script could have been better and said that the film \"feels like it's going to be terrific\", but Tarantino's script does not have much curiosity about the characters. He also said that Tarantino \"has an idea, and trusts the idea to drive the plot.\" Ebert gave the film two and a half stars out of four and said that while he enjoyed it and that it was a very good film from a talented director, \"I liked what I saw, but I wanted more.\"</p><p>The film has received substantial criticism for its strong violence and language. One scene that viewers found particularly unnerving was the ear-cutting scene; Madsen himself reportedly had great difficulty finishing it, especially after Kirk Baltz ad-libbed the desperate plea \"I've got a little kid at home.\" Many people walked out during the film. During a screening at Sitges Film Festival, 15 people walked out, including horror film director Wes Craven and special makeup effects artist Rick Baker. Baker later told Tarantino to take the walkout as a \"compliment\" and explained that he found the violence unnerving because of its heightened sense of realism. Tarantino commented about it at the time: \"It happens at every single screening. For some people the violence, or the rudeness of the language, is a mountain they can't climb. That's OK. It's not their cup of tea. But I am affecting them. I wanted that scene to be disturbing.\"</p><h4>Analysis</h4><p>Reservoir Dogs has often been seen as a prominent film in terms of on-screen violence. J.P. Telotte compared Reservoir Dogs to classic caper noir films and points out the irony in its ending scenes. Mark Irwin also made the connection between Reservoir Dogs and classic American noir. Caroline Jewers called Reservoir Dogs a \"feudal epic\" and paralleled the color pseudonyms to color names of medieval knights.</p><p>Critics have observed parallels between Reservoir Dogs and other films. For its nonlinear storyline, Reservoir Dogs has often been compared to Akira Kurosawa's Rashomon. Critic John Hartl compared the ear-cutting scene to the shower murder scene in Alfred Hitchcock's Psycho and Tarantino to David Lynch. He furthermore explored parallels between Reservoir Dogs and Glengarry Glen Ross. Todd McCarthy, who called the film \"undeniably impressive\", was of the opinion that it was influenced by Mean Streets, Goodfellas and Stanley Kubrick's The Killing. After this film, Tarantino himself was also compared to Martin Scorsese, Sam Peckinpah, John Singleton, Gus Van Sant, and Abel Ferrara.</p><p>A frequently cited comparison has been to Tarantino's second and more successful film Pulp Fiction, especially since the majority of audiences saw Reservoir Dogs after the success of Pulp Fiction. Comparisons have been made regarding the black humor in both the films, the theme of accidents, and more concretely, the style of dialogue and narrative that Tarantino incorporates into both films. Specifically the relationship between white people and black people plays a big part in the films—though underplayed in Reservoir Dogs. Stanley Crouch of The New York Times compared the way the white criminals speak of black people in Reservoir Dogs to the way they are spoken of in Scorsese's Mean Streets and Goodfellas. Crouch observed the way black people are looked down upon in Reservoir Dogs, but also the way that the criminals accuse each other of \"verbally imitating\" black men and the characters' apparent sexual attraction to black actress Pam Grier.</p><p>In February 2012, as part of an ongoing series of live dramatic readings of film scripts being staged with the Los Angeles County Museum of Art (LACMA), director Jason Reitman cast black actors in the originally white cast: Laurence Fishburne as Mr. White; Terrence Howard as Mr. Blonde; Anthony Mackie as Mr. Pink; Cuba Gooding Jr. as Mr. Orange; Chi McBride as Joe Cabot; Anthony Anderson as Nice Guy Eddie (Joe Cabot's son); Common as both Mr. Brown and Officer Nash (the torture victim of Mr. Blonde), and Patton Oswalt as Holdaway (the mentor cop who was originally played by Randy Brooks, the only black actor in the film). Critic Elvis Mitchell suggested that Reitman's version of the script was taking the source material back to its roots since the characters \"all sound like black dudes.\"</p><h4>Accolades</h4><p>The film was screened out of competition at the 1992 Cannes Film Festival. It won the Critic's Award at the 4th Yubari International Fantastic Film Festival in February 1993, which Tarantino attended. The film was also nominated for the Grand Prix of the Belgian Syndicate of Cinema Critics. Steve Buscemi won the 1992 Independent Spirit Award for Best Supporting Male. Reservoir Dogs ranks at No. 97 in Empire magazine's list of the 500 Greatest Films of All Time.</p><br/><h3>Home media</h3><p>In the United Kingdom, release of the VHS rental video was delayed until 1995 due to the British Board of Film Classification initially refusing the film a home video certificate (UK releases are required to be certified separately for theatrical release and for viewing at home). The latter is a requirement by law due to the Video Recordings Act 1984. Following the UK VHS release approval, PolyGram released a \"Mr Blonde Deluxe Edition\", which included an interview with Tarantino and several memorabilia associated with the character Mr. Blonde, such as sunglasses and a chrome toothpick holder.</p><p>Region 1 DVDs of Reservoir Dogs have been released multiple times. The first release was a single two-sided disc from LIVE Entertainment, released in June 1997 and featuring both open matte and letterbox versions of the film. Five years later, on August 27, 2002, Artisan Entertainment (who changed their name from LIVE Entertainment in the interim) released a two-disc 10th anniversary edition on DVD and VHS featuring multiple covers color-coded to match the nicknames of five of the characters (Pink, White, Orange, Blonde, and Brown) and a disc of bonus features such as interviews with the cast and crew. However, the full screen version on the second disc was a pan and scan transfer from the widescreen 2.39:1 version, as opposed to open matte like the '97 DVD.</p><p>For the film's 15th anniversary, Lionsgate (which had purchased Artisan in the interim) produced a two-disc anniversary edition with a remastered 16:9 transfer and a new supplement, but not all of the extra features from the 10th Anniversary edition. In particular, interviews with the cast and crew were removed, and a new 48-minute-long feature called \"Tributes and Dedications\" was included.</p><p>Lionsgate Home Entertainment celebrated the 30th anniversary of Reservoir Dogs with a 4K Blu-ray release, which was released in the U.S. on November 15, 2022.</p><br/><h3>Soundtrack</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Reservoir Dogs</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\">Various Artists</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">October 13, 1992</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span>Rock</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">30</span>:<span class=\"s\">50</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span>MCA</span></td></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Quentin Tarantino</span> film soundtracks chronology</th></tr><tr><td colspan=\"2\" class=\"infobox-full-data\"><table style=\"background: transparent; width: 100%; min-width: 100%; border-collapse: collapse; display: inline-table;\"><tbody><tr style=\"line-height: 1.4em;\"><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em .1em .2em 0\"></td><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em .1em\"><i><b>Reservoir Dogs</b></i><br>(1992)</td><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em 0 .2em .1em\"><i><span>Pulp Fiction</span></i><br>(1994)</td></tr></tbody></table></td></tr></tbody></table><p>The Reservoir Dogs: Original Motion Picture Soundtrack was the first soundtrack for a Quentin Tarantino film and set the structure his later soundtracks would follow. This includes the extensive use of snippets of dialogue from the film. The soundtrack has selections of songs from the 1960s to '80s. Only the group Bedlam recorded original songs for the film. Reasoning that the film takes place over a weekend, Tarantino decided to set it to a fictional radio station 'K-Billy' (presumably KBLY)'s show \"K-Billy's Super Sounds of the Seventies Weekend\", a themed weekend show of broadcasts of songs from the seventies. The radio station played a prominent role in the film. The DJ for the radio was chosen to be Steven Wright, a comedian known for his deadpan delivery of jokes.</p><p>An unusual feature of the soundtrack was the choice of songs; Tarantino has said that he feels the music to be a counterpoint to the on-screen violence and action. He also stated that he wished for the film to have a 1950s feel while using '70s music. A prominent instance of this is the torture scene to the tune of \"Stuck in the Middle with You\".</p><h4>Certifications</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption></caption><tbody><tr><th scope=\"col\">Region</th><th scope=\"col\">Certification</th><th scope=\"col\" data-sort-type=\"number\"><span>Certified units</span>/sales</th></tr><tr><th scope=\"row\">Australia (<span>ARIA</span>)</th><td>Platinum</td><td>70,000<sup>^</sup></td></tr><tr><th scope=\"row\">Canada (<span>Music Canada</span>)</th><td>Gold</td><td>50,000<sup>^</sup></td></tr><tr><th scope=\"row\">New Zealand (<span>RMNZ</span>)</th><td>Platinum</td><td>15,000<sup>^</sup></td></tr><tr><th scope=\"row\">Spain (<span>PROMUSICAE</span>)</th><td>Gold</td><td>50,000<sup>^</sup></td></tr><tr><th scope=\"row\">United Kingdom (<span>BPI</span>)</th><td>Platinum</td><td>300,000<sup>^</sup></td></tr><tr><th scope=\"row\">United States</th><td data-sort-value=\"\" style=\"vertical-align:middle; text-align:center\" class=\"table-na\">—</td><td>863,000</td></tr><tr class=\"sortbottom\" style=\"text-align: center;\"><td colspan=\"3\"><p><small><sup>^</sup> Shipments figures based on certification alone.</small></p></td></tr></tbody></table><br/><h3>Video games</h3><p>A video game based on the film was released in 2006 for PC, Xbox, and PlayStation 2. However, the game does not feature the likeness of any of the actors with the exception of Michael Madsen. The game was received unfavorably, with GameSpot calling it \"an out and out failure\". It caused controversy for its amount of violence and it was banned in Australia, Germany and New Zealand.</p><p>Another video game, Reservoir Dogs: Bloody Days, was released in 2017.</p><p>On December 14, 2017, Overkill Software added a heist to Payday 2 inspired by Reservoir Dogs in which the player is contracted to rob a jewelry store in Los Angeles with the Cabot family. It is unique in that the heist is played in reverse order, with day two occurring prior to day one, similar to how the film's plot is out of chronological order.</p><br/><h3>Remakes</h3><p>Kaante, a Bollywood film released in 2002, is a remake of Reservoir Dogs, combined with elements of City on Fire. The film also borrows plot points from Heat and The Killing. Tarantino has been quoted as saying that Kaante is his favorite among the many films inspired by his work. Tarantino later screened Kaante at his New Beverly Cinema alongside Reservoir Dogs and City on Fire.</p><p>Tarantino revealed in June 2021 that he had at one point considered remaking Reservoir Dogs as his tenth and final directed film, though he quickly iterated that he \"won't do it\".</p><br/>"
  },
  "errorMessage": ""
}