{
  "imDbId": "tt0180093",
  "title": "Requiem for a Dream",
  "fullTitle": "Requiem for a Dream (2000)",
  "type": "Movie",
  "year": "2000",
  "items": [
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "",
      "rate": "100",
      "content": "No one interested in the power and magic of movies should miss it."
    },
    {
      "publisher": "Philadelphia Inquirer",
      "author": "Desmond Ryan",
      "link": "",
      "rate": "100",
      "content": "Aronofsky has fashioned a chilling vision that lives up to the caustic irony of its title and gives us a nightmare that is not lightly forgotten."
    },
    {
      "publisher": "New York Post",
      "author": "Jonathan Foreman",
      "link": "",
      "rate": "88",
      "content": "A powerful fable about love and addiction that manages to be darkly humorous when it isn't graphic or harrowing in the extreme."
    },
    {
      "publisher": "Village Voice",
      "author": "Michael Atkinson",
      "link": "",
      "rate": "70",
      "content": "May be an elaborate stunt, a bungee jump, but even so, it's forceful enough to leave a rare palpitating residue."
    },
    {
      "publisher": "San Francisco Examiner",
      "author": "Wesley Morris",
      "link": "",
      "rate": "63",
      "content": "It's one of the most beautifully unpleasant movies ever made - its reverse charge being that it is no fun at all."
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "Ken Fox",
      "link": "https://www.tvguide.com/?MI=42318",
      "rate": "60",
      "content": "Aronofsky has given us a well-acted, gorgeously overwrought and luridly entertaining exploitation flick -- a midnight movie for future generations."
    },
    {
      "publisher": "Washington Post",
      "author": "Desson Thomson",
      "link": "",
      "rate": "60",
      "content": "While director Aronofsky pistol-whips your attention with his style, the characters (mostly relegated to human mannequins in Aronofsky's visual schemes) suffer big time."
    },
    {
      "publisher": "Seattle Post-Intelligencer",
      "author": "William Arnold",
      "link": "",
      "rate": "58",
      "content": "To be fair, Aronofsky has a knack for stylistic overkill, and his hammering onslaught is undeniably riveting, at first anyway."
    },
    {
      "publisher": "Film.com",
      "author": "Ernest Hardy",
      "link": "",
      "rate": "30",
      "content": "Too self-consciously dark, too aware of its long, murky, art-designed descent into the underbelly of America's addictive personality."
    },
    {
      "publisher": "Washington Post",
      "author": "Stephen Hunter",
      "link": "",
      "rate": "20",
      "content": "In the end the movie goes nowhere a hundred movies haven't already been and tells us nothing we don't already know. It does so with so much violent energy, however, it's like four brutal years at film school crammed into an hour and a half."
    }
  ],
  "errorMessage": ""
}