{
  "imDbId": "tt0076759",
  "title": "Star Wars: Episode IV - A New Hope",
  "fullTitle": "Star Wars: Episode IV - A New Hope (1977)",
  "type": "Movie",
  "year": "1977",
  "items": [
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "100",
      "content": "An exhilarating update of \"Flash Gordon,\" very much in the same half-jokey, half-earnest mood, but backed by special effects that, for once, really work and are intelligently integrated with the story."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "If I were asked to say with certainty which movies will still be widely known a century or two from now, I would list \"2001,'' \"The Wizard of Oz,'' Keaton and Chaplin, Astaire and Rogers, and probably \"Casablanca'' ... and \"Star Wars,'' for sure."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "100",
      "content": "Like all great craftsmen, Lucas has managed to fashion this material in a manner that not only honors the original sources, but makes it uniquely his own. Hacks rip off other movies; artists synthesize and pay homage to their inspirations."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "Star Wars, set “a long time ago in a galaxy far, far away,” is the most exciting picture to be released this year — exciting as theater and exciting as cinema. It is the most visually awesome such work to appear since “2001: A Space Odyssey,” yet is intriguingly human in its scope and boundaries."
    },
    {
      "publisher": "San Francisco Examiner",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "A marvelous child of Star Wars technology, the advanced sound design makes a celebratory re-viewing of George Lucas' legendary, 20-year-old space opera a thrilling experience. [Special Edition]"
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1977/film/reviews/star-wars-3-1200424073/",
      "rate": "100",
      "content": "A magnificent film. George Lucas set out to make the biggest possible adventure fantasy out of his memories of serials and older action epics, and he succeeded brilliantly."
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/?MI=11499",
      "rate": "90",
      "content": "Star Wars brought back for a new generation many of the most attractive elements of studio-era moviemaking, and it did so in breathless anthology form. For some young filmgoers this film acted as a doorway to the glory of the movies."
    },
    {
      "publisher": "Film Threat",
      "author": "Chris Gore",
      "link": "",
      "rate": "80",
      "content": "Let's discuss those extra four minutes for a second, shall we? I found them incredibly distracting. [Special Edition]"
    },
    {
      "publisher": "The New York Times",
      "author": "Vincent Canby",
      "link": "",
      "rate": "80",
      "content": "Everyone treats his material with the proper combination of solemnity and good humor that avoids condescension. One of Mr. Lucas's particular achievements is the manner in which he is able to recall the tackiness of the old comic strips and serials he loves without making a movie that is, itself, tacky."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "",
      "rate": "75",
      "content": "Still packs an entertaining punch with its blend of old-movie formulas, new-age philosophies, and video-game visuals. A small amount of new material, added for the 20th-anniversary reissue, is fun to look for but doesn't make much difference to the story or its impact. [Special Edition]"
    }
  ],
  "errorMessage": ""
}