{
  "imDbId": "tt0076759",
  "title": "Star Wars: Episode IV - A New Hope",
  "fullTitle": "Star Wars: Episode IV - A New Hope (1977)",
  "type": "Movie",
  "year": "1977",
  "items": [
    {
      "username": "FiendishDramaturgy",
      "userUrl": "https://www.imdb.com/user/ur2626332",
      "reviewLink": "https://www.imdb.com/review/rw0156286",
      "warningSpoilers": false,
      "date": "26 October 2003",
      "rate": "10",
      "helpful": "577 out of 735 found this helpful.",
      "title": "One of the most successful movies of all time (and I'm not talking about the Box Office take)",
      "content": "What made this the hugely successful triumph it was? Was it casting, music, imagination, ingenuity, or luck?I remember opening day at the theaters. I was old enough to remember every scene, every character, every nuance of this film; having committed it to memory forever, as if I would never again be able to see this beloved, instantly loved masterpiece.I also remember that the HIT factor of this movie was so unexpected that you had to wait literal MONTHS to get the action figures promised on the cereal boxes. The pieces were still in the manufacturing process and we had to settle for coupons promising our toys in a few months. I wound up seeing this in the theaters a grand total of 36 times; much to my mother's dismay. She loved the movie as I did, but felt I was obsessed. Today, thirty years later, sitting here writing this review, I realize how right she was. I'm still obsessed with this movie, and with the subsequent movies which followed. I wait in great anticipation for Episode 3. I'm a fan, and I don't care what other people say about Episodes 1 & 2. I don't even mind the \"prequel\" factor, as the situation at the time, dictated to Lucas which movies he would do first.See, I remember the studios saying to him that he had to choose from the three central climactic books, and trash the rest, or just trash the whole idea. He didn't exactly \"sell out,\" he did what he had to do to get his movie...his vision...out there for us to see and experience. I admired his decision then, and I admire it now. Episodes 1-3 are being filmed now, because Lucas had the clout, the money, and the patience to give us his vision...his complete vision and not just the three center books of a 9-book series. I realize that now, there are dozens of books, but at the time, there were nine. And while most of us were happy with Episodes 4-6 and would not have missed 1-3 and 7-9, I personally am so very glad he has taken it upon himself to give us his full vision. I have enjoyed each and every installment with the same sense of awe and joy as I did this one.The casting was the first triumph for this cinematic milestone. Ford is a charismatic and magnetic personality and portrayed Han with a professionalism that you'd expect from more seasoned actors. Sir Alec Guiness is an absolute joy as Obi Wan. His casting was precise and excellent in that part. Carrie Fisher portrayed Leia in a way that, up until then, had never been experienced. Most \"princess\" types before her were whining, whimpering, little snots who were incapable of anything beyond tripping and twisting their ankle in times of peril, while Fisher portrayed her character as a bold, brazen, yet sophisticated and educated woman who was aware of her surroundings and capable of defending herself and her realm with the utmost authority.And Mark Hamil. He was perfectly cast as the whining little boy who wanted more, but was afraid to reach for it. He grows up quite well on film in these three installments, and endears himself to the audience so much the more for it. But a cast member who is almost always left out of these reviews is Peter Mayhew. Chewbacca. His character, as a supporting character to Han's, was exemplary. It's not easy portraying a walking carpet, yet holding the attention, admiration, and love of virtual millions. I am VERY happy about his being cast as Chewy in Episode 3. Couldn't happen to a more deserving...or capable...fellow. Bravo! And James Earl Jones's voice being used as the voice of Darth Vader, was pure genius. His commanding voice haunted the dreams of countless thousands of star-struck children for generations to come. I also have to say that this movie would not have had the charm it does had it not been for Anthony Daniels' C3P0. He is a gift and a joy.The musical score by John Williams featured in this masterpiece was one of the contributing factors. But honestly, this movie's success was such a total surprise to everyone, including Lucas, that nothing could prepare the world for the aftermath of having witnessed this bona fide legend, first hand.The story itself; replete with sub-plot after sub-plot, rich in dialog and detail, was beyond anyone's greatest expectations. Everyone, including Lucas, expected this movie to fail. It is a timeless classic, which I will not repeat here. There are too many movie reviews giving full details of the plot, and I won't be redundant beyond what I have already said.However, that being said, there are a few points I would like to make concerning the symbolism of this endeavor. The Force is a metaphor for the psychic abilities with which we are all born. It was also a metaphor for hope and faith, dedication and commitment to the greater state of being. The Empire is said to have been a metaphor for the Germanic Nazi \"storm troopers.\" While the Rebellion is said to have been symbolic of (what would later become) the NATO forces who defeated them.And then there are the effects. The effects were, in 1977, so awesome; so creative; so ahead of their time, as to ensure this movie's vast success for the next forty years. George Lucas enjoys an almost god-like status among sci-fi/fantasy fans worldwide.This movie does not rate a rating. Usually, when I say that, it is because the movie is so bad, or disappointing that I don't have the heart to rate it. But in this case, it far surpasses any 10/10 rating I could give it.The Fiend :."
    },
    {
      "username": "ivo-cobra8",
      "userUrl": "https://www.imdb.com/user/ur15140057",
      "reviewLink": "https://www.imdb.com/review/rw3456651",
      "warningSpoilers": true,
      "date": "23 April 2016",
      "rate": "10",
      "helpful": "148 out of 184 found this helpful.",
      "title": "A classics, phenomenal and arguably the best sci-fi flick masterpiece!",
      "content": "Star Wars: Episode IV - A New Hope (1977) is a classic phenomenal arguably the best sci-fi film in trilogy away, the one that started all and arguably changed the face of cinema forever. I love this film is actually my number 1 favorite film in the franchise and it is George Lucas masterpiece - the man who make this film happening. He wrote and Directed him self, I love this film to death! I love everything that is in A New Hope. Before I go in to this movie I want to say after watching the new awful horrible movie Episode VII The Force Awakens, I decide to re watch the original Star Wars Trilogy and I have always loved A New Hope and I always will. This was the first film in the trilogy that I have saw as a kid and that I remember. Star Wars are starring Mark Hamill, Harrison Ford and Carrie Fisher.The plot is actually more about Rebel Alliance, led by Princess Leia (Fisher), and its attempt to destroy the Galactic Empire's space station, the Death Star. It is a mission returning the plans of Death Star to the Rebel Alliance, while Galactic Empire want's them back and it is lead by Darth Vader (David Prowse). This movie is what it is, a perfect 10, because it takes the vision of one of the most imaginative directors on Earth, and realizes them almost perfectly with all the tools that fit the task -- actors, stunts, puppetry, models, and Special Effects.Star Wars is a film that I have watch it now and I will always watch it , because how much I really, really enjoy this film. This fun, pure joy, entertaining and truly a great film is like a classic, I recommend this film to any fan of the Star Wars trilogy, my favorite will always be A New Hope. This was the film that I have saw the first time as a kid and it grow on me. I love introduction when C-3PO and R2-D2 are walking trough the desert on planet Tatooine and are captured by Jawa traders, who sell them to moisture farmers Owen and Beru Lars and their nephew, Luke Skywalker. Here is the first time we met the character Luke Skywalker. This is the scene where C-3PO is walking trough the desert him self and than he saw someone far away and yells for help. I love this scene and it is the scene I remember from childhood.Which is your favorite character? My favorite character of all time is Luke Skywalker and I really love him so much. My second favorite character will be Han Solo but Luke Skywalker will be the ultimate hero of the galaxy for me.I love this flick, I love the end battle on Death Star, Luke joins the Rebel assault squadron and Luke becomes one of the few surviving pilots. Vader leads a squad of TIE fighters and prepares to attack Luke's X-wing fighter, but Han returns and fires on the Imperials, sending Vader spiraling away. Helped by guidance from Obi-Wan's spirit, Luke uses the Force and successfully destroys the Death Star seconds before it can fire on the Rebel base. I love that scene.I love John Williams score for Star wars which is the best score ever! It is an excellent score makes an actions scenes more exciting and more intense. George Lucas directed this movie well and did an excellent job been a writer as the same time been the director, the pacing is excellent the actors does an awesome job. I also love and I have enjoyed the character Darth Vader and I also love this film because it has a happy ending. Harrison Ford , Mark Hamill and Carrie Fisher did all a great joy playing their characters.Carrie Fisher is really gorgeous in this film and for the 70's film it had great pacing and great imaginary story that dose not gives you only a snippet of the backstory. The fight scene between Darth Vader and Obi-Wan \"Ben\" Kenobi was excellent and the death scene of Obi-Wan was a honorable death. Alec Guinness did a perfect job as Obi-Wan \"Ben\" Kenobi he is excellent. Overall: I have said everything about this film that I love I forgot to mention I love Han Solo, Princess Leia, Luke Skywalker (I love to death), Chewbacca, C-3PO and R2-D2. This flick get's a perfect 10 because it is the best beloved science fiction film.R.I.P. Carrie Fisher (1956 - 2016) she was the perfect Princess Leia and she is very missed."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw5412447",
      "warningSpoilers": false,
      "date": "16 January 2020",
      "rate": "10",
      "helpful": "56 out of 71 found this helpful.",
      "title": "Legendary piece of cinema",
      "content": "Only seen the original Star Wars films a few times, I tend to forget how great of a magical experience it is! A New Hope is so awesome in so many aspects especially the music and sounds of everything! It's amazing how it was made for it's time I still I don't understand how they did many things. I will admit it has a few bits that are boring but still glorious. Up until a few years ago I didn't see most of the films and I didn't understand the hype now I do in which I'm happy with them all even seen the new ones."
    },
    {
      "username": "Bogmeister",
      "userUrl": "https://www.imdb.com/user/ur6207631",
      "reviewLink": "https://www.imdb.com/review/rw1247198",
      "warningSpoilers": false,
      "date": "25 December 2005",
      "rate": "9",
      "helpful": "156 out of 206 found this helpful.",
      "title": "The Best of Sci-Fi Times,the Worst of sf Times",
      "content": "Though now known as \"Episode IV-A New Hope,\" for many of us, namely those of us who first saw this exhilarating entertainment in theaters back in '77, this will always be the first \"Star Wars.\" We will always think of it as just \"Star Wars\" - plain & simple, no pretensions, no aspirations to deep film-making or high art. This is where we first met them all: Luke, Han Solo, Princess Leia, Obi-Wan Kenobi (old 'Ben'), Chewbacca, the 2 robots C3PO & R2D2 and, of course, Darth Vader. They were instant pop culture icons; you got the sense you'd seen them before somewhere, but were sure this wasn't possible. But they'd been there before in our minds. We'd read about them constantly in science fiction novels and short stories - tales of outer space civilizations, of spaceships zooming through asteroid belts, of exotic-looking aliens hanging around space ports. We'd dream about them at night and try to imagine ourselves in their midst; up until then, we could only imagine such things - there were no projected images to realize such dreams. \"Forbidden Planet\" from 1956 came close, and then there were the \"Star Trek\" and \"Lost in Space\" TV series, both hampered by dime store budgets and cheesy sets. We ate 'em up since there was nothing else. Then Lucas made it real.I remember when I first got wind of the upcoming movie, to open in May of 1977, I think. I saw the first publicized poster and bought the novel adaptation. On the poster, a young man stood with some light sword raised, a princess at his feet, numerous spaceships flying all over the place. I was in my mid-teens and felt the first pulse of building excitement as I realized all those fantastic tales I'd been reading the past few years were going to come alive on the big screen for me. It didn't disappoint. Luke Skywalker, who stood in for all the boys pretending to be on a galactic adventure, gets swept away from his mundane desert home smack dab into the middle of an honest-to-gosh galaxy-wide civil war! The strength of the narrative is / was amazing. There are no slow spots and you can't wait for the next scene during the entire experience; and, experience is the better description for it, rather than just 'movie.' You can't wait, for example, for the moment when Luke actually meets the princess; what will happen then? It's a textbook case of an exciting narrative and what I believe makes this superior to all the sequels (knowing that many feel \"The Empire Strikes Back\" is superior - I must disagree).The one character you really can't wait to see again is the ominous Vader, naturally. The instant he steps into view during the first few minutes of the story, you just know this is the ultimate villain. This is the baddest of the bad, the coolest of the cool, the supreme uber-evildoer of the entire galaxy. You just know it by his stance, by his attitude, and by the electric chill that runs through your frail form as he steps down the corridor, moving into the annals of film history with one fell swoop. You can't wait to see what he does next, what nefarious action will send someone or some planet to its doom. Sure, he seems under the control of Tarkin (Cushing) here and later, the Emperor, but you just know he's simply biding his time until he takes over the whole damn universe. There is no precedent for Vader, and nothing close to him after. He's at his best here where there's still much mystery attached to his dark frightful form, a minion of Satan and Nazi stormtroopers all rolled into one.This was also the movie-experience which catapulted Harrison Ford (Solo) into superstardom. He seems almost childish here, not really straining to create a character, and it's this flip charm that makes it work, against all odds. He really does appear to have stepped out of the pages of some juvenile space opera, laser guns blazing, all snide remarks and foolhardy bravado. But he also becomes the older brother figure to Luke, who cannot carry the story by himself. Hamill, whose movie career began & ended with Luke, epitomizes the center of destiny for a galaxy. Both humble and arrogant, he's perfect in the role. Fisher's main surprise is that she's not all sugar and sweet as one would expect of a princess. These three characters evolved in the next two films, but they were always at their best here, icons given life for a short period - but also forever in film. The same could be said for Alec Guinness as Kenobi, a first class act all the way. You almost believe this elderly warrior could topple an empire, given enough time. Unless he runs into Vader..."
    },
    {
      "username": "mentalcritic",
      "userUrl": "https://www.imdb.com/user/ur0821456",
      "reviewLink": "https://www.imdb.com/review/rw0156229",
      "warningSpoilers": false,
      "date": "31 March 2003",
      "rate": "",
      "helpful": "39 out of 48 found this helpful.",
      "title": "The original version was brilliant...",
      "content": "I was actually born about a year after this film first premiered, but being a member of a family that was the first on the block to get such things as the VCR and the proper Hi-Fi system allowed me to catch this film in a number of different formats in the years ranging from 1982 to 1997. I think it is safe to say that without this film, I would have had no idea how truly evil a thing Pan And Scan is, or why multi-channel audio is such a damned important thing to have in the home theatre environment.Of course, I also knew that the film wasn't perfect. I could see a number of small problems where Lucas' budget just didn't quite go far enough, or where there just wasn't enough time to accomplish what was wanted. So when the announcement was made that in 1997, each film would be presented with improved special effects and footage that could not be integrated in the original cut for reasons of budget or practicality, I was excited.For the most part, I was overjoyed to see the new footage or effects. Mos Eisley now looks like a real city or port of commerce, without the viewer's sense of disbelief at the seemingly deserted streets needing to be suspended. The flight of the X-Wings towards the Death Star in its original form was very good, a marvel of its time, but when George finally got to show it the way he wanted to, it was almost the equivalent of watching the helicopters of Apocalypse Now decimating the village to the tune of Ride Of The Valkyries. The wonderfully composed tracking shots especially made the battle look almost as if it really happened and Lucas was just there to take pictures. And Jabba? Well, he doesn't look all that real, granted, but it was just nice to have that one piece of footage in order to make the appearance of Boba Fett in Episode V and the entire prologue of Episode VI make a bit more sense, especially to dullards.Unfortunately, there are a number of times when Lucas just goes too far in his quest to improve his work. Sometimes you can only do so much to anything before it starts to look overdone. Of course, I am talking about the scene between Han and Greedo in the cantina. In the original version, we are led to believe Han is a scoundrel who only cares about himself, giving us one of the best character arcs in the whole trilogy. It is also a great tribute to Sergio Leone, a nice reference to when Tuco shoots a potential assassin from his bathtub and tells the corpse \"When you have to shoot, shoot, don't talk!\". Modifying this scene so it looks like Greedo shot first is an insult on a few levels. It insults Greedo as a character, making him look like one of the most incompetent bounty hunters in the galaxy. It insults the audience, who even at the age of six should no that you'd have to be blind, drunk, brain-damaged, or all three, to miss from that distance. Lastly, it insults the character of Han Solo by destroying a vital piece of said character arc. Watching Han go from scum to a leader of men, a space-age version of King Aragorn even, was one of the best things about the original Star Wars trilogy.The story itself is the stuff of classics in that it shows the most unlikely of heroes doing things that everyone else claims to be impossible. What Lucas got right in terms of pacing and plot here is exactly where he went wrong in the prequels, in that he makes the jump from location to location seem important to the plot and totally natural, rather than forced and choppy. The story and sense of adventure makes one forget that there are really only three major locations other than the inside of a space ship.Overall, the original Star Wars rates an eight out of ten. If Lucas had applied some common sense in conjunction with his rampant desire for revisionism, I would give it a ten, but as one critic who is famous for his negativity once said about Episode II, when was the last time anyone told George Lucas no? Still, this is a classic that should be shown to future generations as an example of how an imagination and enough literacy to realise it will open doors for you when nothing else will."
    },
    {
      "username": "SantiagoDM1",
      "userUrl": "https://www.imdb.com/user/ur67641452",
      "reviewLink": "https://www.imdb.com/review/rw4255109",
      "warningSpoilers": false,
      "date": "27 July 2018",
      "rate": "10",
      "helpful": "137 out of 147 found this helpful.",
      "title": "The Force will be with you, always.",
      "content": "\"A long time ago, in a galaxy far, far away...\"Pre review:Its writing started in January 1973, \"eight hours a day, five days a week\", George Lucas said by taking small notes, inventing odd names and assigning them possible characterization... After many drafts, he finally came to a satisfactory conclusion.Then, Lucas presented Star Wars to the United Artists, but they refused to budget the film, so he went to Universal Pictures, the studio that financed American Graffiti; however, it was rejected, as the film concept was \"too strange\".Suddenly, Alan Ladd Jr -head of 20th Century Fox- appeared, a man that trusted in Lucas' genius. And that's how Star Wars became a reality.The shooting of the movie was full of mishaps, problems with practical effects never done before, a bad first edit of the movie, but that didn't stop George from fulfilling his Space Opera. Due to those setbacks, Fox Studios began to put pressure on Lucas to finish the movie. Finally, the movie was done. On the eve of Star Wars release, 20th Century Fox, George Lucas and his cast and crew braced themselves for the worse. One way or another, May 25, 1977 would be a day they would never forget...Review:Star Wars is a modern tale of mythic adventure. It follows the journey and growth of the protagonist: Luke Skywalker. His journey of discovery is set amidst a larger struggle between the Empire and the Rebel Alliance; both parties are embroiled in a civil war. The Empire is comprised of corrupted power within a small group of leaders. These sullied leaders abuse their power over the masses with impunity. It is oppression and repression of the masses. The Empire wants to destroy the hope of the rebellion to ensure the small group of leaders can keep their power...One of the most important features of the movie are the special effects. The use motion control was even superior to Stanley Kubrick's revolutionary masterpiece: \"2001: A Space Odyssey\" thanks to the creation of The Dykstraflex, the first digital motion control photography camera system developed for Star Wars on 1976. Along with an incredibly iconographic character and production design, the movie became stylistically unique.The story and the characters are original and relatable. R2-D2 and C-3PO: the astromech as the optimistic adventurer's desiring to move forward. In direct opposition C-3PO, the protocol droid filled with doubt and reservations. Luke Skywalker, the brave hero, often haunted by doubts and hopes about his future journey. Obi-Wan Kenobi, the wise master and moral guidance of our hero. Han Solo, the rebellious smuggler whose personality represents tenacity. Leia, the damsel \"in distress\", a fearsome princess and general. Finally, Darth Vader, the most iconic character in the franchise, the merciless tyrant in a black suit, representing evil and final conflict of the journey.The film score presents an emotional resonance trough a romantic 1930s Hollywood orchestral score that was commissioned for composer John Williams, who succeeded to create a haunting constellation of operatic leitmotifs.The visual composition is authentic, as Lucas wanted a nostalgic \"filtered look\" so he kept changing key lights for a \"flashing\" effect. He used a loose, \"nervous\" frame, as in newsreels. The dramatic center was displaced, deflecting the eye to background activity, which in later films would include poetically changing weather. This first film gradually turned darker, following a symbolic color scheme where organic brown and warm gold yielded to high-tech black, white, and steely gray.\" This is authenticity is reflected in it's most iconic shot: the 'Binary Sunset' sequence, which establishes the narrative through-line of the story and the world it takes place in, the main value of the scene lies in how powerfully and economically it develops Luke's character: As the suns begin to slowly sink in the evening sky, he gazes towards the horizon, his sense of longing for something more is palpable. Taking things further, he goes on to squint into the distance as if he could see his new future just out of reach, and for the first time we get to see him not as a kid, but for as a new hope.Books such as \"The hero with a thousand faces\" by Joseph Campbell structured the story, The War of Vietnam inspired the battle between the Rebels and the Empire, the lifestyle of buddhist monks characterized the Jedi, real shots of warplanes made the space battles real, Kendo foreshadowed the epic lightsaber duel, Akira Kurosawa's storytelling influenced the focus on minor characters, Fritz Lang's it's iconic protocol droid and John Ford westerns determined it's soul.The fascination with filmmaking and anthropology are the components that allowed Star Wars to be compelling and human, besides being located on a galaxy far, far away.10/10"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2162174",
      "warningSpoilers": false,
      "date": "22 November 2009",
      "rate": "10",
      "helpful": "44 out of 60 found this helpful.",
      "title": "A milestone in film-making- a superlative sci-fi movie",
      "content": "I couldn't have asked for anything more. Star Wars: A New Hope had it all. If I had to sum it up in one word, superlative would be my answer. I saw the film for the first time three months ago and loved it, and since then I have watched all the Star Wars movies. I was disappointed with the prequels (Attack of the Clones was my least favourite), but this, Return of the Jedi and Empire Strikes Back were perfection.I have to say that the film looks absolutely amazing even after thirty plus years, with highly imaginative sets and dazzling special effects. And the action sequences were superbly choreographed and brisk, the Death Star climax was a knockout. The music by John Williams is absolutely outstanding, by far one of his more exciting and rousing scores. The story is fast-paced, intelligent and has an essence of sophistication, and the screenplay is sharp and decisive.And the performances were flawless. In the prequels I had problems relating to some of the performers, namely Hayden Christensen as Anakin. Here, all the actors played their parts with superlative skill. Alec Guiness, one fine actor and will be sorely missed was a standout, likewise with Peter Cushing and Harrison Ford(hilarious here). Carrie Fisher was a fine Princess Leia, spunky, beautiful and sexy, and Mark Hamill was a completely likable Luke. And the villain Darth Vader, without doubt one of the best and in-depth villains in cinematic history, and James Earl Jones's deep booming voice was perfect for the character.All in all, a definite sci-fi classic, that blew me away. 10/10 Bethany Cox"
    },
    {
      "username": "Sfpsycho415",
      "userUrl": "https://www.imdb.com/user/ur1233583",
      "reviewLink": "https://www.imdb.com/review/rw0156284",
      "warningSpoilers": false,
      "date": "22 October 2003",
      "rate": "10",
      "helpful": "303 out of 403 found this helpful.",
      "title": "Where It All Began-----10/10",
      "content": "I can never pick a favorite movie because different movies have different effects. Goodfellas is my favorite drama. Face/Off is my favorite actioner. But when it comes to pure amazement, nothing beats Star Wars. We are introduced to a whole other universe with different creatures, different lifestyles, and different history. We are dropped in the middle of an intergalactic war between an empire and a rebellion that has raged for years and left the universe in ruin. It was the most fascinating thing to see when i was eleven, but to this day i am still a Star Wars nerd.The cast of characters includes some of the coolest, funniest, and most tragic in film, and the actors who play them fit seamlessly into this new universe. Alec Guiness is flawless as Obi-Wan Kenobi, a Jedi on the run from the evil Empire. Harrison Ford is awesome as Han Solo, a smuggler and thief who helps the gang rescue the princess. But the my favorite character of all time is Darth Vader. Not only is he the coolest bad guy, but we learn in later films why he is evil and start to feel sympathetic for him. Not to mention that badass booming voice that can make ordering a pizza sound threatening.This was not only the beginning of the best movie series ever, but it was the beginning of my love for movies. George Lucas is a genius for being able to come up with a great story and an incredible backdrop for what was supposed to be a flop, but turned into one of the best films ever. 10/10"
    },
    {
      "username": "budmassey",
      "userUrl": "https://www.imdb.com/user/ur0813657",
      "reviewLink": "https://www.imdb.com/review/rw1067659",
      "warningSpoilers": false,
      "date": "25 April 2005",
      "rate": "10",
      "helpful": "234 out of 319 found this helpful.",
      "title": "The greatest cinematic epic of all time begins here.",
      "content": "Here begins the greatest cinematic epic of all time, and arguably one of the greatest stories ever told. Originally conceived as a serialized popcorn movie in the manner of the old action movies that Lucas grew up with, Star Wars surpassed even George's keen and bombastic imagination to become a central part of movie history.There are countless tales of the making of this movie; how Lucas never believed he would get the chance to complete the series, how it spawned an industry and made the name of nearly everyone who touched it a household word. But what that does not reveal, nor do the much diminished prequels, is the sheer joy and excitement these movies generated.It was a once in a lifetime experience. You could feel it from opening day, earlier if you paid attention to such things. We had never seen anything like it, and we are not likely to again.This episode finds young Luke Skywalker yearning to leave the agrarian life he has with his aunt and uncle, and chase after adventure as his friends before him have already done. And what adventure there is. The galaxy is in the grip of a massive rebellion against a tyrannical and oppressive empire, but on Luke's home planet, it's something you only dare speak of in a whisper.Along come two robots, \"Droids\" for short, who inadvertently involve Luke in a stellar attempt to contact an old wizard named Ben Kenobi, who lives in the caves near Luke's home.The rest is history, and there isn't a person alive in the civilized world who doesn't have at least some awareness of the epic story that unfolds. Luke's rise from adolescent obscurity on Tatooine to a leading role in the greatest struggle of all time is told with humor, action, adventure, and always a sense of story that is unmatched on the screen or on the page.With the completion of the prequel trilogy, these films are enjoying a renewed popularity among a generation that never saw the films on the big screen, and the theatric revivals are almost guaranteed. Go. Get some popcorn. And may the Force be with you."
    },
    {
      "username": "paul_haakonsen",
      "userUrl": "https://www.imdb.com/user/ur22654354",
      "reviewLink": "https://www.imdb.com/review/rw3384638",
      "warningSpoilers": false,
      "date": "31 December 2015",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "The classic...",
      "content": "Having grown up with the \"Star Wars\" trilogy, then \"Star Wars: Episode IV - A New Hope\" is a classic in every sense of the word. This is the epic story of good vs. evil and of light vs. dark. But it is also a story of heroism, bravery and adventure. I am an fan-boy, yes, but what is there not to love about \"Star Wars\"?George Lucas really managed to piece together a timeless classic that stands its own even today. And even with effects from 1977 it was light years ahead of its time, no pun intended. And the effects stand their ground even by todays standards.There is something uniquely amazing about the atmosphere and feel of the \"Star Wars\" universe. And it doesn't require much to be swept away and carried along to a galaxy far, far away...The cast in \"Star Wars: Episode IV - A New Hope\" did a good and memorable job with their individual roles and characters. And with this movie George Lucas established some characters that instantly became well-known and well-loved.\"Star Wars: Episode IV - A New Hope\" is a movie of high space adventure with vibrant characters, creatures and spaceships. It is an enjoyable movie for the entire family, space nerds or not.If you are not already familiar with the legendary \"Star Wars: Episode IV - A New Hope\" movie, then it is more than due time to get to it."
    },
    {
      "username": "Anthonyjkb",
      "userUrl": "https://www.imdb.com/user/ur44584461",
      "reviewLink": "https://www.imdb.com/review/rw4468616",
      "warningSpoilers": false,
      "date": "19 November 2018",
      "rate": "10",
      "helpful": "39 out of 46 found this helpful.",
      "title": "Never gets old",
      "content": "This movie is a cinematic masterpiece that will be loved forever. The special affects are so good for 1977 and the soundtrack for this movie is amazing."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw2313319",
      "warningSpoilers": false,
      "date": "20 September 2010",
      "rate": "10",
      "helpful": "16 out of 20 found this helpful.",
      "title": "In A Galaxy Far Away................A Franchise Was Born",
      "content": "The awesome special effects and the creation of creatures that are part of the vivid imagination of George Lucas are not the reason for the enduring popularity of Star Wars and the franchise it spawned. Rather it is because of the characters Lucas created that will live as long as we have cinema and the means to display it.The spectacle is behind some real, but simple people. No shadings of gray in the first Star Wars we know without any doubt who the heroes and villains are of this piece. On an isolated planet a galaxy wide dictatorship called the Empire and the revolt against come to wear young Luke Skywalker as played by Mark Hamill and his family reside. So does Alec Guinness, a reclusive and mysterious hermit. An escape pod crashes there with two androids, C3PO and R2D2 and in the latter is a message for Guinness who was at one time a Jedi Knight, fiercest of a warrior class, from Carrie Fisher playing Princess Leia. Also in R2D2 are the schematics for the Empire's ultimate weapon the satellite size death star that can deal killing out on a planetary scale. This starts an adventure with young Hamill who teams up with futuristic soldier of fortune Harrison Ford as Han Solo and his simian like sidekick Chewbacca to rescue the Princess and defeat the Death Star.Those are the good guys. The bad guys are the blackest of black villainy. Peter Cushing cold bloodedly commands the Death Star, but the mysterious Darth Vader, clad in black with a helmet completely covering his head, has mysterious powers and even his superiors are wary of him. The voice of James Earl Jones is unforgettable as the black prince of the galaxy.These are characters that bring out the kid in all of us. The ones who claim the most sophistication in their lives will cheer on for Hamill and Ford and will be fascinated by the double dyed villainy of Darth Vader.Perhaps the most interesting aspect of Star Wars and I speak now of all the films is the way such non-humans as the robots and Chewbacca the Wookie became characters. C3PO had dialog, but R2D2 had a few clicks and bleeks and all Chewbacca did was grunt, still they became as identifiable as the human characters.Star Wars set the standard for science fiction films to come for the next several generations. It was given six Oscars in a bunch of technical categories and it's got a re-release value that Gone With The Wind used to have.The Force Will Be With Us Always."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2878091",
      "warningSpoilers": false,
      "date": "29 September 2013",
      "rate": "10",
      "helpful": "18 out of 23 found this helpful.",
      "title": "Not just a great movie. It's important",
      "content": "This story happened 'A long time ago in a galaxy far, far away'. The galaxy is under the dictatorship of the emperor. Princess Leia (Carrie Fisher) is part of the rebellion but is capture by the evil Darth Vader. Luke Skywalker (Mark Hamill) the young hero, Han Solo (Harrison Ford) the brigand, his sidekick Chewbacca, and the wise master Jedi Ben Obi-Wan Kenobi (Alec Guinness) must together rescue the princess and save the galaxy.The characters are icons pulled from classic storytelling like Akira Kurosawa's \"The Hidden Fortress\". George Lucas was able to assemble such iconic characters into a well told story. Rarely is a movie change the nature of movie-making, and even the wider culture. This may be on the list of the most important movie ever. It changed the tone of movies from the gritty morally-confused 70s to the popcorn selling blockbusters that are soon to come."
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw1956581",
      "warningSpoilers": true,
      "date": "6 October 2008",
      "rate": "9",
      "helpful": "11 out of 13 found this helpful.",
      "title": "A long time ago in a decade without CGI...",
      "content": "When I first watched this in the cinema I was ten, it was 1977 and I'd never seen anything like it. It had me gripped from the start when a small spacecraft flew past being fired upon by another much larger one that was so big that it seemed to take ages to pass over the viewer. Unlike the recent prequels scenes such as this weren't cluttered with excessive CGI activity but instead showed what was needed in a way that hadn't been seen before. The special effects used throughout the film were ground-breaking for the time and still look great to this day, there is something more real looking about the models used when compared to today's CGI.The main character are all interesting and likable and the acting was all pretty good both from veteran actors like Alec Guinness and Peter Cushing who brought a suitable gravitas to the film and from younger actors Harrison Ford, Mark Hamill and Carrie Fisher who brought a sense of youthful energy.In the unlikely event that somebody doesn't know what the film is about I'll give a brief synopsis; Set in a distant galaxy the forces of the evil galactic empire are hunting down the rebels who are attempting to restore the old republic. They are about to capture a rebel ship which has the stolen plans to the empires latest weapon, the Death Star, when they are hidden in a small robot (droid) by the name of R2-D2 by Princess Leah, he escapes in one of the ships escape pods along with his companion C3PO. They escape to the desert world of Tatooine where they are swiftly captured by strange creatures called Jawas who sell the pair to a farmer who gets his nephew Luke to clean them. While doing so he stumbles across a holographic message addressed to one Obi-Wan Kenobi. While Luke is off having his dinner R2-D2 escapes seeking Obi Wan.The next day Luke sets off to find him but shortly after doing so he is ambushed by Sand People who start ransacking his vehicle till they are disturbed by a robed figure who turns out to be Obi-Wan. He explains to Luke that he was once a Jedi knight and friend of his late father who had been killed by another Jedi called Darth Vader who had turned to the dark side of the force, they also see the full message that R2 is carrying which requests that Obi-Wan takes R2 to the planet Alderaan to get the plans to the rebels. While this is happening Vader who is on the ship searching for the plans dispatches troops to search for the two missing droids. By the time Luke returns home it is too late, the place is a burn out ruin and his aunt and uncle are dead. He decides that he will join Obi-Wan on his mission to Alderaan.They hire a ship, called the Millennium Falcon, from a smuggler called Han Solo who needs the money to pay off a debt and avoid the various bounty hunter who are after him. When they arrive at Alderaan they find it is no longer there, it has in fact been destroyed by the Death Star in an attempt to get Princess Leah to tell them where the rebels are based. Soon after arriving the Millennium Falcon is captured after it goes to investigate a small moon that turns out to be the Death Star. While Obi-Wan is off trying to disable the tractor beam that captured them Han and Luke discover that Princess Leah is being held in the detention area and set off to rescue her... I won't say any more as I don't want to spoil the ending.I think this is a film every body should see at least once, it might not be perfect but if it wasn't for this recent cinematic history would be quite different; it kick-started a revival in science fiction that lead to things like Battlestar Galactica, the return of Star Trek and Alien and was possibly the first \"block-buster\" film. In many ways it was more than just a film it was an event; everybody at my school was talking about it and little else, till one watched it you were completely out of the loop. The characters and there adventures in this and the other films in the franchise have become part of modern folklore.These comments were made based on the video released in the '80s... so no extra CGI and Greedo didn't even attempt to fire before Han killed him."
    },
    {
      "username": "MaxBorg89",
      "userUrl": "https://www.imdb.com/user/ur5156288",
      "reviewLink": "https://www.imdb.com/review/rw1216752",
      "warningSpoilers": false,
      "date": "15 November 2005",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "In 1977, in a galaxy far, far away...",
      "content": "This great classic has so many good elements it's almost impossible to list them all: The breathtaking visual effects, still awesome 28 years on; the brilliant script, which mixed epic battles and duels with matinée-serial-style characters and dialogues; the debut of one of the greatest villains in cinema history, Darth Vader; John Williams'amazing and unforgettable score, among the Top 10 best scores ever...All those things are just some of the reasons Star Wars is among the best movies (not just sci-fi) ever made: viewing after viewing, it never stops being impressive, and words are nearly useless to describe the impact it still has on the audience.George Lucas basically took a medieval story and moved it to a distant galaxy, on weird and fascinating planets. Almost everything is taken from the Middle Ages: there are knights, sword-fighting, evil Empires, unsatisfied people who want to overthrow the system, beautiful princesses waiting to be rescued...Then we've also got speeders, light-sabers, peculiar (and, in the case of Jabba the Hutt, disgusting) creatures, the Death Star, and of course the Force, that fascinating energy which is supposed to bring balance to the galaxy.The cast is a gas, both the newcomers and the veterans: Mark Hamill, Carrie Fisher and Harrison Ford are great as Luke Skywalker, Princess Leia and Han Solo (Ford in particular is hilarious as the arrogant but ultimately nice \"scoundrel\"), but the most memorable performance is of course Alec Guinness'portrayal of Obi-Wan Kenobi, the old, wise Jedi who returns one last time to initiate Luke to the mysteries of the Force.But let's not forget what everybody immediately thinks of when Star Wars is mentioned: Darth Vader. Feared by his opponents as well as his servants, this completely emotionless foe has become the very symbol of Lucas'masterpiece. He's one of those movie-characters people will remember as long as films will keep being made and his unsettling breathing noise still echoes in our memories...The beginning of a wonderful saga, whose only rival is The Lord of the Rings.May the Force be with you..."
    },
    {
      "username": "jay_amer",
      "userUrl": "https://www.imdb.com/user/ur77927383",
      "reviewLink": "https://www.imdb.com/review/rw4020477",
      "warningSpoilers": false,
      "date": "1 January 2018",
      "rate": "10",
      "helpful": "26 out of 31 found this helpful.",
      "title": "The Movie that Changed My Life Forever!",
      "content": "This movie when I first saw it as a kid absolutely amazed me and put me into a world where I wished I could be! The story is absolutely genius, the characters are amazing! Everything about this movie is amazing! George Lucas made an absolute masterpiece of a film!!!!! May The Force Be With You!"
    },
    {
      "username": "ShadeGrenade",
      "userUrl": "https://www.imdb.com/user/ur7743887",
      "reviewLink": "https://www.imdb.com/review/rw1871154",
      "warningSpoilers": true,
      "date": "9 May 2008",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "A Long, Long Wait For A Movie Far, Far Away",
      "content": "This is not a review of the first ( and best ) 'Star Wars' movie. I take it, fellow I.M.D.B. users, that you are already familiar with the plot, characters and production history, and how its success changed the face of cinema overnight. So rather than rehash all the known facts, I want instead to recount a personal memory.I first learnt of 'Star Wars' thanks to Granada's 'The Krypton Factor', a long-running game show designed to test contestants' intelligence, physical fitness, powers of observation and so on. I liked the latter round as it often gave one a chance to catch a sneak preview of a new movie. One week, they ran a clip of Han Solo, Luke Skywalker, R2D2 and C2PO escaping The Death Star in The Millennium Falcon, and being shot at by pursuing T.I.E. fighters. I fell off my chair. What was this? 1970's sci-fi movies were mostly depressing affairs, predicting gloomy futures for Mankind, now here was something fast, colourful, and lively, with lasers zapping about outer space and explosions. Right up my street.I had to see it. But the film was not yet on release here. There was no Internet then so I got my movie information from the local paper. I kept checking for news of an impending screening at my local cinema, but no - there was nothing. I began to wonder if the movie actually existed or not. Had Granada pulled off the greatest hoax of all time? I read the Sphere book voraciously until I knew the story backwards. I played the Meco disco single at every opportunity. When Marvel's comic adaptation went on sale, I was almost thrown out of the newsagent for jumping up and down for sheer joy.At my school, 'Star Wars' was a dirty word to sci-fi fans, mainly because it was not 'Close Encounters'. The Spielberg picture was regarded as 'adult' and 'intelligent', while the Lucas movie was deemed 'kiddie stuff' starring weirdos in fancy dress running around with a bloke dressed as a big teddy bear.The wait dragged on and on. In an episode of 'Coronation Street', Gail ( Helen Worth ) asked her then-boyfriend, Steve Fisher: \"When's 'Star Wars' coming round here?\" to which he replied: \"It'll be some time I expect.\". His words encapsulated the sheer frustration and impatience felt by all us U.K. fans. The highest grossing film of all time and we can't see it? What is the hold up? Are they redoing bits for the benefit of British audiences? Peter Cushing and Alec Guinness are in it so this cannot be right.In desperation, I told a blatant lie to my best friend. \"I have seen 'Star Wars'\", I proclaimed. He looked about as shocked as if I'd said I'd spent the night with Carrie Fisher. I claimed that my uncle Eric worked for Twentieth Century-Fox ( another lie. He drove taxi cabs for a living ) as an assistant editor and George Lucas had been so impressed with his work on the film, he had generously given him a print. To back up my claim, I reeled off a long list of plot details and scene descriptions. I got a few things wrong, such as Jabba The Hut and Biggs Darklighter, both of whom were excised from the final cut. But by the time my friend saw the film he had forgotten these. He did beg me to ask my uncle to run the film specially for him on Sunday afternoon, but I deflected this by stating that Uncle Eric's projector had broken down. He never asked again.Being about fifteen, I was too old for the toys, hence on Christmas Day 1977 I was denied the pleasure of reenacting the assault on The Death Star in my garden shed, with the aid of elastic bands, old Subbuteo figures and the John Williams soundtrack thumping out of my Hitachi tape recorder.After what felt like an eternity, the movie finally opened here and suddenly it became fashionable to denounce it as 'overrated'. 'It was childish when they were playing trumpets in the Cantina' was my best friend's verdict. That was all he had to say on the subject ( he would have made a great film critic! ). Many people felt that the film had not been worth the six month wait. I was one of the few to speak in its defence. I was glad that sci-fi movies were fun again. Nobody left the theatre with a spring in their step after seeing Milo The Baby Chimp's parents brutally murdered by the U.S. Government at the end of 'Escape From The Planet Of The Apes'.'Star Wars' spawned two sequels, neither as good, and inspired the likes of 'Alien', 'The Black Hole', 'Star Trek: The Motion Picture' and countless others. Without Lucas, these would simply not have been made.I am not a big fan of the prequels, but then I'm not young anymore, so can't enjoy that kind of movie in the same way. 'Star Wars' brought 'A New Hope' to those of us wanting old fashioned escapism on the Silver Screen again. I envy kids today for not having to wait until winter for the latest summer blockbuster."
    },
    {
      "username": "Prichards12345",
      "userUrl": "https://www.imdb.com/user/ur9725326",
      "reviewLink": "https://www.imdb.com/review/rw1374300",
      "warningSpoilers": false,
      "date": "22 May 2006",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "From the Lucasian Chair of Entertainment - a masterpiece",
      "content": "I first saw this film on a warm March Sunday evening in 1978, after queueing for a whole hour to get into the cinema. Oh, the anticipation! The excitement! The magic! And here was a film that changed the whole concept of cinema forever, for no matter how many times I return to it, in the flickering dark of the cinema, or the wondrous, glittering DVD release, or in where the film really scores - at the centre of my imagination, that night will live forever in my memory. ANYTHING was possible, wonders could be achieved. Miracles in the here and now. And how lucky I was to share in it.To the squares that loathe it - I pity you daddyos; you'll never experience what millions of us have felt these past three decades. Go and see Henry Jaglom again; I'll stick with Mr. Lucas - he is THE MAN!I love this film. Forget what flaws it has - minor they are indeed. Star Wars has become a mystic myth and that sorcerer supreme, Jedi master George Lucas, has given me more pleasure than I can measure. My favourite bit? Almost impossible to choose. Okay, if I must...the stunning Tie Fighter battle with the Millennium Falcon, a work or art in the editing room. It should be hung on a wall somewhere.George, old chap, if you're ever passing my house please knock - and I'll make you a cup of tea. You deserve that much at least!"
    },
    {
      "username": "Marx_Bros_Fan86",
      "userUrl": "https://www.imdb.com/user/ur4823391",
      "reviewLink": "https://www.imdb.com/review/rw1604446",
      "warningSpoilers": true,
      "date": "21 February 2007",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Just plain fun!",
      "content": "Star Wars seems to lack the sense of importance that all of the sequels and prequels had. This one just seeks to entertain, and there's nothing wrong with that! Star Wars is one of those miracle movies (a term borrowed from Leonard Maltin) where everything went wrong but it all came together in the end, like Jaws and The Wizard of Oz. The movie was plagued by budget problems, and Lucas was so behind schedule he suffered a few panic attacks, which is probably why he did not direct the sequels. Star Wars takes the audience on a series of adventures, from encountering sand people in the desert to rescuing a princess on a space station. The special effects and production design is amazing. It takes you into a whole new galaxy and makes you believe it's real. I liked how everything looked old and dirty; prior to Star Wars everything in Sci-fi movies looked brand new. John William's Star Wars score adds a whole new element of fun and is arguably the best work of his career. I can't imagine what Star Wars would be like without his music.The main characters are all familiar archetypes. Luke is the restless, immature boy who wants to get off the farm and have an adventure. Han Solo is the rugged pirate who only cares for himself. Harrison Ford really steals every scene he's in with his wise guy attitude. Obi-Wan Kenobi is the Sorcerer/Mentor stereotype, like Merlin. Alec Guinness brings a certain classiness to the role, even though this is not even close to his best performance. His final lightsaber battle is slow and boring due to the limitations of the weak lightsabers (David Prowse kept breaking them!) and his old age, but he delivers his verbal quips quite nicely, as does James Earl Jones. The scene where he dies is still very powerful; I love how Vader steps on his empty robe, it's like he's thinking \"hey, where are you hiding?\" Carrie Fisher plays the kidnapped princess; her performance is tougher and feistier in this movie. She loses those qualities to a certain extent in the following movies.Hammer Horror film veteran Peter Cushing played the sinister Imperial Officer, Grand Moff Tarkin. It's amazing how Cushing was able to slip into the role of the villain so easily (he certainly looks evil), considering the fact he was most famous for playing protagonists like Van Helsing and Dr. Frankenstein. I cannot give enough praise to James Earl Jones as the voice of Darth Vader, one of the greatest villains of all time. Some of the dialog is embarrassing but the cast was able to bring the characters alive. That is the most important difference between the originals and the prequels. These characters were not complex in any way, but they had good chemistry with each other. The prequel's characters felt like cardboard. I used to think this was the most boring Star Wars film, and I just don't understand why anymore. I've noticed this film gets criticized for bad pacing, and I could not disagree more. Star Wars has the best pacing of the original trilogy. Empire's plot stopped moving in the middle of the movie, and the first 35-40 minutes of Jedi were a total pit stop. Star Wars on the other hand smoothly builds up to the final climax at the Death Star, without any long story lags. The Battle of Yavin has been criticized for being too long (by Alec Guinness and Roger Ebert), but I don't mind. The Death Star's destruction is an exhilarating moment. Star Wars is also the funniest movie in the series. The bickering between the three heroes on the Death Star is hilarious.In 2004 the Star Wars movies were revised yet again for the DVD release. I have to say I'm disappointed with how the original trilogy has been treated by Lucas. He seems to support film preservation in every case, except when it comes to his own movies. To me, replacing actors and revising special effects is just as bad as colorizing a black and white movie. It eliminates all of the historical significance. I hope one day the original trilogy will receive better treatment in the future. I would recommend buying the original trilogy on DVD now while you still can. It might not be released again, but with Lucas you can never tell."
    },
    {
      "username": "masonsaul",
      "userUrl": "https://www.imdb.com/user/ur94560739",
      "reviewLink": "https://www.imdb.com/review/rw5326580",
      "warningSpoilers": false,
      "date": "16 December 2019",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Near perfect sci-fi adventure",
      "content": "Star Wars (A New Hope) is a near perfect sci-fi adventure that's incredibly bold, original and extremely entertaining. Mark Hamill, Harrison Ford, Anthony Daniels and Carrie Fisher all give incredible performances. James Earl Jones is fantastic as Darth Vader, one of the best villains of all time. Alec Guinness gives a great supporting performance. The visual effects are stunning and still look really good. It's extremely well paced and genuinely thrilling throughout with excellent action sequences and space battles. The music by John Williams is perfect as well as George Lucas's direction as the film is beautifully filmed."
    },
    {
      "username": "owenmul",
      "userUrl": "https://www.imdb.com/user/ur49370025",
      "reviewLink": "https://www.imdb.com/review/rw3209223",
      "warningSpoilers": false,
      "date": "27 March 2015",
      "rate": "9",
      "helpful": "12 out of 12 found this helpful.",
      "title": "Cinema Classic",
      "content": "Star Wars is simply a fantastic film, on every level this film is amazing.Each of the characters in this film are so well developed and so interesting that you just cannot wait for the next scene with them in it, the interactions between the characters us at times tense and at times downright hilarious, leaving no room for boring or lacking dialogue. The particular stand outs in this respect I feel are: Han Solo, the wise cracking bounty hunter with a tendency for arrogance that makes every scene as entertaining as possible. Secondly there is Darth Vader, who is the optometry of cool, scathing evil who poses as the ultimate villain.Surprising to me, the cinematography and special effects have held up all this time. Although there are some minor issues, one particularly notable one is during the scene where Luke is training with the training droid aboard the Millennium Falcon there are a few frame skips where Luke extends and contracts his lightsaber. Other than this though, the cinematography and special effects are amazing to have held up, particularly the shots of the Empire's space fleet moving through space which are absolutely stunning.One of the things that absolutely makes this film for me is the magnificent score, composed by John Williams. This score, while being one of the most iconic scores of all time, manages to make every single scene, fitting the mood of the scene perfectly.The story as well is fantastic, there is never a dull moment; every second of it an absolute thrill ride. Whether its the attack on the Death Star or the Cantina of Mos Eisley the story takes you through the twists and turns of this classic space opera.If I could recommend one sci-fi adventure film to someone, it would be this, it's an absolute must see.More Reviews at: http://12yearsacinephile.tumblr.com/"
    },
    {
      "username": "Horst_In_Translation",
      "userUrl": "https://www.imdb.com/user/ur3914439",
      "reviewLink": "https://www.imdb.com/review/rw3347910",
      "warningSpoilers": true,
      "date": "2 November 2015",
      "rate": "6",
      "helpful": "75 out of 120 found this helpful.",
      "title": "A great movie - for its time",
      "content": "\"Star Wars\" is a 2-hour science fiction movie from almost 30 years ago written and directed by George Lucas. There really needs nothing to be said about how good this is for a 1970s movie, especially in terms of technical aspects. The Academy certainly got it right by giving them all these Oscars for it. However, it lacks in certain other areas unfortunately. First of all, the acting isn't too great. That is not really a problem of the characters though, but rather of the way they were written, which simply offered no room for outstanding performances. And Peter Cushing's character was downright forgettable despite being the main antagonist. Instead people remember Darth Vader obviously. Why? Because this film is all about the way the characters look and not what they do or say. A bit style over substance. Apart from that, I am quite surprised Alec Guinness scored an Academy Award nomination for his turn here.The script is not the greatest achievement in general. It's the usual black-and-white characterization with good vs evil and the characters have no real shades, no facets. This was made up again by the strong work in other departments as it's not too memorable what they say and do, but what they look like, especially the non-human characters who are all somewhat considered legendary today. I am not saying the characters are written badly. Not at all. But it's just other contributions that made them what they are today. Not the script. And while I enjoyed most of the film, I cannot see it as an epic or a cult classic as so many people do to this date. \"Star Wars\" is bound to rise again with the new film coming out soon and featuring the original cast again. It should be interesting what they make out of it. Until then, feel free to watch the old films like this one, but not too many. The very first Star Wars film here is not a great achievement in terms of story, only in terms of all visual and audible aspects."
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw5821097",
      "warningSpoilers": false,
      "date": "13 June 2020",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Wonderful film",
      "content": "The best Star Wars movie is recommended for anyone who wants to start watching the Star Wars series to start this movie."
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw2044516",
      "warningSpoilers": false,
      "date": "29 March 2009",
      "rate": "10",
      "helpful": "13 out of 17 found this helpful.",
      "title": "A long time ago in a childhood not too far away...",
      "content": "Princess Leia is captured and held hostage by the Imperial Army as it seeks to rule the Galactic Empire. An old Jedi Knight by the name of Ben \"Obi-Wan\" Kenobi may just be hers, and the rebels only hope. Teaming up with farm boy Luke Skywalker, scoundrel Captain Han Solo, and a couple of quirky droids, Kenobi sets off on a mission that could well shape the destiny of the Galaxy, and all who dwell within it.Back in 1977 I was but a wee 11 year old boy, weened on films from all genres by my movie loving parents, I had no idea that Star Wars was to have the same impact on me as Jaws had two summers previously, where yet again I found myself queueing around the block for two whole hours to see a film in a one screen theatre. My love of cinema firmly cemented, Star Wars was the start of a love affair that lasts to this very day.As the years have rolled by and my love of cinema has taken on more in-depth and serious tones, I have come to realise that Star Wars proves to be a far from flawless picture. Certainly its detractors do point to some frayed acting and call the plot structure a jazzed up good versus evil axis, while the charge of George Lucas referencing many prior pictures most assuredly stands, but really do those things matter? No they do not, because Star Wars opened up a new world of cinema, something of a portal to youngsters such as I, it got people talking and debating about the merits of model work in films (which is of an extraordinary high standard here), it nudged film makers to explore being bigger and bolder in their approach, and crucially, above all else, it got film goers hungry again, a hankering for more please if you may. Now it has to be said that all that followed 20th Century Fox's historic blockbuster didn't run with the baton, in fact most pale into comparison on impact value, but for better or worse (depending on the discerning viewers peccadilloes), Star Wars stands as a bastion of adventure laden entertainment.It is by definition one of the most successful films in history, George Lucas perhaps didn't know it at the time, but in what was to become an almost operatic anthology, he didn't just make a movie, he created a whole new world seeping with style and rich texture. Almost as amazing as the success of the series, is how it has become part of modern day pop culture, anything from religion to everyday speak has at some time or another referenced Lucas' baby. Ultimately, though, it's one single thing that made (and still does make) Star Wars so great, it's that it has the ability to lift the audience into a rousing united feel good cheer; and that is something that few films can ever lay claim too. In 1977 it was an awe inspiring event to watch in the theatre, now here in my middle age it's an event that is like hugging a dear old friend, a friend that I know will never ever let me down no matter how many times I turn to it. 10/10"
    },
    {
      "username": "disdressed12",
      "userUrl": "https://www.imdb.com/user/ur11423174",
      "reviewLink": "https://www.imdb.com/review/rw1604939",
      "warningSpoilers": false,
      "date": "22 February 2007",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "the landmark space fantasy",
      "content": "what can you say about his movie.it set the bar by which all movies to come would be judged,and this was 1977.i'm talking about the visual effects,which were nothing less than astounding.it still stands up well to any movie in that regard.remember,they didn't have the benefit of CGI back then,so they relied on miniatures.when you add to that,a compelling story and a soon to be iconic villain(not to mention,the colourful cast of characters)and you have box office gold.sure,the dialogue may be wooden and stilted at times,but that is overshadowed by the achievement of the film.Besides,the film was marketed at 12 year olds,so they're not gonna care about stupid things like dialogue.The original \"Star Wars\" or as it is subtitled \"a New Hope,was a landmark film and single handedly reinvented the science fiction genre. Obviously 10/10"
    }
  ],
  "errorMessage": ""
}