{
  "imDbId": "tt0032976",
  "title": "Rebecca",
  "fullTitle": "Rebecca (1940)",
  "type": "Movie",
  "year": "1940",
  "items": [
    {
      "publisher": "New York Daily News",
      "author": "Kate Cameron",
      "link": "https://www.nydailynews.com/entertainment/movies/alfred-hitchcock-rebecca-masterpiece-article-1.2089299",
      "rate": "100",
      "content": "The suspense of the story is magnificently sustained throughout the film, which didn't surprise us, as maintaining suspense in a story has always been Director Hitchcock's forte"
    },
    {
      "publisher": "Slant Magazine",
      "author": "Chuck Bowen",
      "link": "",
      "rate": "100",
      "content": "A key film in Alfred Hitchcock’s evolution as a master explorer of sexual neuroses."
    },
    {
      "publisher": "The New York Times",
      "author": "Frank S. Nugent",
      "link": "https://www.nytimes.com/1940/03/29/archives/the-screen-splendid-film-of-du-mauriers-rebecca-is-shown-at-the.html",
      "rate": "90",
      "content": "An altogether brilliant film, haunting, suspenseful, handsome and handsomely played."
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Marjorie Baumgarten",
      "link": "https://www.austinchronicle.com/events/film/2000-05-25/rebecca/",
      "rate": "89",
      "content": "The performances are first-rate, and Anderson as the obsessively attached maid Mrs. Danvers is a perverse gem."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/rebecca",
      "rate": "88",
      "content": "With Rebecca, he (Hitchcock) illustrates an aptitude for crafting not only psychological terror but drama and romance."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1940/film/reviews/rebecca-1200413156/",
      "rate": "80",
      "content": "Picture is noteworthy in its literal translation of Daphne du Maurier’s novel to the screen, presenting all of the sombreness and dramatic tragedy of the book in its unfolding. More important, it commands attention in establishing Joan Fontaine as a potential screen personality of upper brackets."
    },
    {
      "publisher": "",
      "author": "BBC",
      "link": "https://www.bbc.co.uk/films/2006/06/12/rebecca_2006_review.shtml",
      "rate": "80",
      "content": "Produced by David Selznick, Rebecca is a delirious Gothic melodrama, swimming with queer undercurrents"
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "75",
      "content": "Through its first two-thirds it is as perfect a myth of adolescence as any of the Disney films, documenting the childlike, nameless heroine's initiation into the adult mysteries of sex, death, and identity, and the impossibility of reconciling these forces with family strictures."
    },
    {
      "publisher": "",
      "author": "The Hollywood Reporter",
      "link": "https://www.hollywoodreporter.com/news/general-news/rebecca-review-1940-movie-1098095/",
      "rate": "70",
      "content": "In its essence, Rebecca is another entry in the Wuthering Heights school of dour, somber, psychological drama, steeped in ultra-British atmosphere. Though overlong, it is beautifully done."
    },
    {
      "publisher": "Time Out",
      "author": "",
      "link": "",
      "rate": "70",
      "content": "Somewhat tonally inconsistent; following the social comedy of Monte Carlo and suspense of Manderley, the pace slackens in the crime procedural of the final half-hour, which is all tell and no show. Still, Hitchcock shows superb technical control and attends to his trademark motifs, from monstrous mother figures to the fetishisation of clothing (strong foreshadowings of ‘Vertigo’)."
    }
  ],
  "errorMessage": ""
}