{
  "imDbId": "tt0032976",
  "title": "Rebecca",
  "fullTitle": "Rebecca (1940)",
  "type": "Movie",
  "year": "1940",
  "items": [
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw3619927",
      "warningSpoilers": false,
      "date": "15 January 2017",
      "rate": "9",
      "helpful": "41 out of 46 found this helpful.",
      "title": "A film with a nameless protagonist and an invisible namesake",
      "content": "This was Alfred Hitchcock's first American-made film. Quite frankly, I'm amazed at how well Hitchcock \"got\" what American audiences wanted in their suspense films, hitting them out of the park from the moment he began working in the US. Apart from being a tad bit long, this is a well made film. I love the inside of Mandalay and Sir Laurence Olivier played a wonderful mysterious and sullen Maximillian De Winter opposite his new wife, a beautiful and naive young Joan Fontaine who is never even given a name here, probably deliberately and in keeping with how mousy and \"second hand\" she feels about herself in relation to the first and late Mrs. De Winter, who is actually Rebecca from the title.Of course there is also George Sanders, playing the type of character he is best known for--sarcastic, snobby, self-assured, pompous, witty and verbose. He hits the nail on the head as Rebecca's \"cousin\" - so he calls himself. Of course the most eerie and unsettling character was Mrs. Danvers, Rebecca's housekeeper or \"maid in waiting.\" Danvers takes great pains in sabotaging the second Mrs. De Winter's marital relationship with Max de Winter,--even going as far as calmly urging her to to plunge to her death into the water from Rebecca's bedroom window at Mandalay. There are a couple of twists in this movie, but I won't give them away. It's best if you watch them unfold yourself in true Hitchcockian style.I will say that Rebecca, the first wife of Max de Winter, is NEVER seen, but we learn about her by what is said about her by the various characters, even going as far as seeing the untouched shrine of a bedroom maintained by Mrs. Danvers. But soon you learn that Rebecca was never the perfect wife Danvers and others make her out to be. The ending is a surprise in more way than one, and yet Mrs. Danvers gets the last word in her own way. A great movie by Alfred Hitchcock and David O. Selznick."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw7109113",
      "warningSpoilers": false,
      "date": "10 July 2021",
      "rate": "10",
      "helpful": "15 out of 16 found this helpful.",
      "title": "Place Holder",
      "content": "Hitchcock - never won an Oscar - not in the Best Director department that is. He was nominated multiple times, but never got one. At least this movie right here won one for best movie. I know it is sometimes strange how a movie can win best movie, but the Director won't get one too.Anyway that does not change the perception most have of him: as one of the best directors that ever made movies. And he made lots of them thankfully. I finally came around watching this one - just before I went ahead and watched the \"remake\" that Netflix released last year. I put \"remake\" in quotes because the movie itself does try to establish itself as being based on the source novel.Now I have not read that, so I can't attest to all the changes that were made (although one was made for the ratings board considering the fate of Rebecca - and that was also used in the Remake). Humor was added though apparently and I would guess that the actors made their roles their own. In combination with what Hitchcock was able to get out of them.Many takes on the most simple things apparently and even a lot of looping (dubbing) of lines that he wasn't too keen of. But I've written so much and have not even touched the surface of what makes this movie great.You have a movie that is about the role of a woman - a second wife no less. A movie that seems to tell so many stories - but especially a story that concentrates on the female main character. Some have claimed that Hitchcock was a misogynist. On the other hand the extras here and some feminist claim the exact opposite. Even in his (infamous) interview with Truffaut, some might say it became clear he was more feminist than he liked to admit.And the movie right here seems to be able to capture many feelings of women. Even add some bi-sexual or lesbian love? You could read that into it - maybe it is in the book too. Again, I can't really tell.Every frame here is planned into the smallest detail. Nothing is left to chance and coincidence. There is a reason he is considered a master. The performances of the couple is amazing - Olivier may not be easy to read, but that is again on purpose.You also have the whole theme of romance and the age gap ... love, betrayal, addiction ... so many themes woven in here. And the overall presence of ... Rebecca. A presence that is felt throughout ... while never seen. And yet it is better this ... it is perfect as it is."
    },
    {
      "username": "Infofreak",
      "userUrl": "https://www.imdb.com/user/ur0381265",
      "reviewLink": "https://www.imdb.com/review/rw0022655",
      "warningSpoilers": false,
      "date": "8 July 2004",
      "rate": "",
      "helpful": "185 out of 224 found this helpful.",
      "title": "If you want to be totally enthralled for two hours just watch 'Rebecca'!",
      "content": "Hitchcock felt 'Rebecca', his first Hollywood film, was a compromise, but as a viewer I just can't fault it. It's a masterpiece in my opinion, full of suspense, mystery and brooding atmosphere. It's also one of the most romantic movies I've ever seen. I've watched it several times over the years, and even now that I know all the plot twists and turns (quite shocking on your first viewing), it never fails to hook me in. One of the reasons it really works is the flawless casting. I'm not much of an Olivier fan but he's superb as de Winter, with just the right mixture of charm and coldness. And Joan Fontaine is just perfect as de Winter's new bride. I can't spot an unconvincing moment in her performance and can't imagine any other actress in the role. Hitchcock subsequently used her in 'Suspicion' with Cary Grant. She was also excellent in that but 'Rebecca' is a much stronger movie. The supporting cast also includes some brilliant performances, especially Judith Anderson ('Laura') as the extremely creepy Mrs. Danvers, George Sanders who plays Rebecca's slimy cousin, and Nigel Bruce in a typical role as de Winter's bumbling brother-in-law Major Lacy. Sanders subsequently worked again with Hitchcock in 'Foreign Correspondent', and Bruce played Cary Grant's lovable pal \"Beaky\" in 'Suspicion'. I sometimes think that Hitchcock's 1940s movies are overlooked by many because they are regarded as being too \"old fashioned\", but for me movies like 'Suspicion', 'Saboteur', 'Lifeboat' and 'Spellbound' are some of the most entertaining movies Hitchcock ever made, and 'Rebecca' is the best of the lot. If you want to be totally enthralled for two hours just watch 'Rebecca'!"
    },
    {
      "username": "nycritic",
      "userUrl": "https://www.imdb.com/user/ur0384847",
      "reviewLink": "https://www.imdb.com/review/rw1033586",
      "warningSpoilers": true,
      "date": "5 March 2005",
      "rate": "10",
      "helpful": "140 out of 168 found this helpful.",
      "title": "What Atmospheric Gothic-horror Should Be.",
      "content": "Alfred Hitchcock was and is still the undisputed Master of Suspense, and there is a lot of that here in his foray into Gothic horror, as the mystery surrounding the unseen yet omnipresent Rebecca will engage the viewer from its dreamy start to its bleak conclusion. This is exactly what atmospheric is supposed to be about, and in black and white, it shines. This is also what Gothic horror is in essence, and many have imitated yet come up short, most notably M. Night Shyamalan who, in trying to go for a shock twist and purported \"atmosphere\" only creates a bad aftertaste and a hangover the size of Mount Everest. This is, essentially, Hitchcock's first true masterpiece.Not one performance rings false, not to the novel or to their respective interpretations. Lawrence Olivier, quite possibly one of the greatest actors that ever lived, portrays a broken man who still lives haunted by the past as he himself were still living in that unending hell. Judith Anderson embodies one of the most coldly sadistic figures in cinema history, her smooth and elegant truculence only exceeded by Anthony Hopkins' rendition of Dr. Hannibal Lecter. One can't seem to understand the way she wallows in her dead mistresses' clearly perverse nature, but that exactly she does, right down to her own end. George Sanders does what he does best: sneer, smirk, and spit line after line of practiced venom, and would be honored 10 years later in ALL ABOUT EVE. Gladys Cooper, still striking in her 50s, plays into her casual cattiness which means no harm, although her rendition of Beatrice Lacy is a little subdued from the novel's version.And then there is Joan Fontaine. Not one of the best actresses on film, yet here, playing a role that evolves beautifully from a frightened, weak girl who is put into a situation she does not understand and who turns right at the point of losing it into a much more mature, strong woman capable of holding her own, she carries the weight of the entire drama and comes forth with flying colors. While I would have preferred Anne Baxter who would have been the exact right age for this role, Fontaine exudes so much restraint and nervousness about her character (partially to blame Olivier's treatment of her and Hitchcock's telling her the entire cast hated her), it's almost a relief when she finally decides to confront Olivier about what it the secret of Manderley. Not many roles require such a change and not many actresses would sink her teeth into a part that requires being put-upon until she can't stand no more, and this is one beautiful performance.A movie that should have won more Oscars that year, REBECCA has since grown in stature and proved that a film need not trophies to be Timeless and Great."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2081131",
      "warningSpoilers": true,
      "date": "15 June 2009",
      "rate": "10",
      "helpful": "35 out of 44 found this helpful.",
      "title": "Chilling and dramatic- a must see for Hitchcock fans!",
      "content": "I am 17, and I love this movie. One definite positive of Rebecca is the masterful direction by Alfred Hitchcock, full of the usual twists and turns that make his films so pleasing. The chilling and suspenseful story, of a timid young woman marrying a man and finding herself in the shadow of his dead first wife, has many complex issues, such as the possibilities of suicide, murder and mistaken identity, all of which took me completely by surprise. Rebecca also has gorgeous black and white cinematography, and a beautifully atmospheric music score. But it's the performances from the distinguished cast that holds this film together. Laurence Olivier, one of Britain's finest stage and film actors(you only have to see him in Shakespeare to know the talent this man had), gives a towering performance as Maxim De Winter, a broken man haunted by his first wife's death. The lovely Joan Fontaine is the picture of innocence and vulnerability as the 2nd Mrs De Winter, giving a genuine sense of fright and emotion throughout. Also superb is the suave George Sanders as the rather loathsome blackmailing Favel, who smirks and makes acidic remarks as effortlessly as Clark Gable did in Gone With The wind. But stealing the acting honours is Judith Anderson as the housekeeper Mrs Danvers, a performance that is truly sinister, like the scene when she sets Manderly on fire, her facial expression looking out of the window gave me the shivers. The script was tense, dark and flawlessly delivered. Through the characters we hear that Rebecca was beautiful and possessed all the other positive virtues, so I was shocked when that wasn't to be. All in all, a chilling and dark film, that is a must see. 10/10 Bethany Cox."
    },
    {
      "username": "FiendishDramaturgy",
      "userUrl": "https://www.imdb.com/user/ur2626332",
      "reviewLink": "https://www.imdb.com/review/rw0022645",
      "warningSpoilers": false,
      "date": "3 December 2003",
      "rate": "10",
      "helpful": "55 out of 71 found this helpful.",
      "title": "All around, an excellent production.",
      "content": "his movie is a 10 from the very beginning. The casting is brilliant, the story is hauntingly beautiful, the performances are the best of what Hollywood once was, and the sets are of quality design and architecture. The direction is awesome, but it's Hitchcock, and I expect nothing less from his productions.Rebecca is a glamorous, beautiful socialite who has won the hearts of all who knew her. Well, almost all. But a year after her untimely death, her grieving husband near his wit's end, has grown seemingly suicidal and aloof.He engages his grief while on a trip to Monte Carlo, and meets the beautiful personal secretary and maid of a long-time friend, Mrs. Edythe Van Hopper. She is young, naive, and completely unprepared for the life which is awaiting her; all qualities which George Fortescu Maximillian 'Maxim' de Winter finds endearing.I won't detail the events in this movie, as the story itself is quite haunting, with surprises around every turn.This is a definite \"must have\" in any suspense / horror / Hitchcock / classics movie collection, and a mandatory must see for all fans of all movies.It rates a 10/10 for its absolute perfection, from...the Fiend :."
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw0022622",
      "warningSpoilers": false,
      "date": "24 August 2002",
      "rate": "",
      "helpful": "12 out of 14 found this helpful.",
      "title": "American Gothic",
      "content": "Hitchcock's first American movie, a word, American that is, that should be put in quotes because as Hitchcock pointed out, all of the cast and almost all of the crew were British. The film has already garnered so many comments that I'll avoid repeating most of them. The plot I'm sure has been thoroughly outlined and professionally analyzed but a few points are worth emphasis.The plot of very precisely structured. It consists basically of a man who is the dream of many women in the 1940s audience: ruggedly handsome, intelligent, keen witted, a bit commanding but not too much, fabulously wealthy, a touch roguish, and mysterious. It's the mystery that provides the plot engine. Every incident of his past emotional life needs to be pried out of Maxim deWinter (what a name, suggesting frigidity and distance) as if it were an abcessed tooth. Each secret, as he reveals it, is a surprise to his wife. Except for the final secret uncovered in the plot, which surprises everybody. Maxim could clear the whole mystery up with an hour's worth of private conversation with his wife. But of course he doesn't, or else there would be no story. That's why Hamlet takes so long to slaughter Claudius. And why the Indians don't shoot the horses as they're chasing the stagecoach.The acting. Olivier is extremely good at impersonating deWinter with all his charm and challenge. George Sanders is the best cad that the movies ever produced, and he proves it again here. Mrs. Danvers has a face and an expression that looks like an ice sculpture. The implicit lesbianism in her character of course had to remain implicit, but it is still rather a shock when she tenderly unfolds Mrs. DeWinter's nightie and says smoothly, \"Look, you can see my hand through it.\" As for Joan Fontaine, a friend in Ireland said of her performance, \"She does the shivering wife very well.\" Precisely put. With her delicate bone structure, fragile looking limbs, and her overall ikabani flower arrangement appearance, her wide asymmetrical eyes, with one brow arching up over her pale forehead, she looks about to faint with fright through half the movie. The only thing coarse about her is her wardrobe: bulky knit sweaters over her girlish bosom, long flapping drab skirts over her small but saucy rump, and those clodhoppers she wears while clunking about the house. She does the shivering naif in at least two other films of the period -- Hitchcock's \"Suspicion\" and \"Jane Eyre.\" In fact, rummaging through the disarranged attic that is my long-term memory, I can't really remember her \"doing\" any other role.It's the closest Hitchcock ever came to making what was then called \"a woman's picture.\" It received a \"best picture\" Oscar, which went to Selznick. Something Hitchcock seemed to resent for the remainder of his life. It was a commercial and critical success and it deserved to be."
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw1833227",
      "warningSpoilers": false,
      "date": "4 March 2008",
      "rate": "10",
      "helpful": "22 out of 28 found this helpful.",
      "title": "Do you think the dead come back and watch the living?",
      "content": "Rebecca is directed by Alfred Hitchcock and adapted to screen play from the Daphne du Maurier novel of the same name. It stars Laurence Olvier, Joan Fontaine and Judith Anderson. Cinematography is by George Barnes and music scored by Franz Waxman.After meeting and marrying 'Maxim' de Winter (Olivier), the Second Mrs. de Winter (Fontaine), finds life at his English estate, Manderley, far from comfortable because the servants and the house serve to remind her of the first Mrs. de Winter, whose death remains a source of mystery. What did happen to the first lady of the house? Can this newly married couple survive the oppressive cloud that looms large over the mansion?A Gothic emotional near masterpiece, Alfred Hitchcock's first American film may seem a bit too serviceable at times, something he was also aware of himself, but the production values are high and the story is played out supremely well. Within the story we can find Hitchcock's now famous trait of mistrusting Women, but in the main it stays the tragic tale of one young woman living in the ominous shadow of the previous Mrs. De Winter. Mood is often set as foreboding, with the director understanding the psychological pangs of the source material once the action switches to the de Winter home of Manderley. It arguably is a touch too long, and the restraint of Hitchcock, down to producer David O. Selznick overseeing things, stops it being a bit more unnerving than it should be.For Manderley the mansion here is one of the finest put on the screen, this is because Hitchcock and brilliant cinematographer George Barnes manage to make it bold & beautiful one minute, and then the next scene it comes off as a monolithic nightmare. It's wonderful case of the surroundings playing the extra character for maximum effect. Laurence Olivier is impressive, even if we would learn later on that this is the sort of performance he could do in his sleep. The supporting cast do great work as well, especially as regards the cold and terrifying turn from Judith Anderson as Mrs. Danvers. However, to me this will always be Joan Fontaine's show, she nails it perfectly, the new Mrs. De Winter wants to do right but can't seem to so for doing wrong, she infuriates at times, yet the next minute you just want to hold her, for she's so vulnerable, but beautifully so, it's a brilliant performance in a brilliant film. The ending is a switheroo from the novel, and it almost derails the success the film has achieved up to that point. And looking at it now it's hard not to curse the Production Code for enforcing a big change to what was revealed in du Maurier's wonderful novel. But the film has survived the \"appeasing\" ending to stand the test of time for all the ages. It won the Academy Award for Best Picture, and Barnes also won for Best Black & White Cinematography, it was nominated for a further nine awards, including Best Director, Best Actor, Best Actress and Best Supporting Actress. No nomination for Waxman, sadly, but his score is worthy of a mention for the evocative strains that sit nicely with the tone of the story. Rebecca, a hauntingly beautiful picture that's acted and produced with consummate skill. 9.5/10"
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0022616",
      "warningSpoilers": false,
      "date": "10 July 2002",
      "rate": "",
      "helpful": "52 out of 70 found this helpful.",
      "title": "Haunting Hitchcock.",
      "content": "The only Alfred Hitchcock (Oscar-nominated for directing) film to win the Best Picture Oscar, \"Rebecca\" is one of those typical films from the amazing director that chills, entertains and puts you on the edge of your seat each time you watch it. Joan Fontaine (Oscar-nominated) has just married the very wealthy Laurence Olivier (also Oscar-nominated), but she is haunted by his mysterious housekeeper (a show-stopping Oscar-nominated performance by Judith Anderson) and the memory of the film's titled character (Olivier's late wife). Hitchcock, noted for his subtle sexual under-tones in films spares none of that here as Anderson's character and the late titled character's relationship seemed to go much further than employee-employer. Anderson slowly tries to drive Fontaine to insanity and the end she may accomplish her devious goal. Hitchcock's first real major U.S. debut stunned the Academy and audiences alike and would lead to the coveted Best Picture Oscar. It is not the best film the legendary director ever worked on, but it is still an amazingly good production that works on many cinematic levels. 4.5 out of 5 stars."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw1490161",
      "warningSpoilers": false,
      "date": "5 October 2006",
      "rate": "8",
      "helpful": "23 out of 31 found this helpful.",
      "title": "Hitchcock's first great American success in a classic story with a love story and suspense",
      "content": "This is a Daphne Du Maurier's story (from a best-seller novel) concerning a prominent widower (Laurence Olivier) called Maxim De Winter who finds a gorgeous and timid young girl (Joan Fontaine) who is serving to an old Mistress (Florence Bates) . They are married and head to Manderley , the familiar mansion (in the exterior actually is a scale model). But Maxim is haunted by the ghost first wife , an enigmatic Rebecca , who died in mysterious circumstances . There works as a servant the creepy and obsessive housekeeper , Mrs Danvers (Judith Anderson,a famous stage actress in her most important role) and sh meets a cynic gentleman (George Sanders).This film has suspense , romance , unlimited tension , full of lingering images and with the typical touches Hitchcock . Besides , a literately and thoughtful dialog signed by Joan Harrison (Hitchcock's usual screenwriter) though lacking humor . After ¨39 steps¨and ¨Jamaica Inn¨ , Hitch was encouraged to go to America and promptly shot his first work in Hollywood hired by the great producer David O'Selznick . Fine performance by Laurence Olivier , he married Vivien Leigh and he wished to her as protagonist but Hitch hired Joan Fontaine who took seven rehearsal sessions until the engaging . Joan Fontaine as a shy bride young is superb and enjoyable . Judith Anderson as a spooky and cold house keeper is top-notch, her role as obsessed person by the glamorous Rebecca is unforgotten and immortal . Atmospheric and perceptible music by Franz Waxman and sensational visual style by the cameraman George Barnes . The picture won Academy Awards for Best film and cinematography . The movie was brilliantly directed by the Master of Suspense . It's remade in inferior versions for Television, the 1980 adaptation with Jeremy Brett as Maxim and 1996 rendition with Charles Dance and Emilie Fox . The motion picture is indispensable watching for Hithcock lovers achieving the maximum impact on his audience."
    },
    {
      "username": "jay4stein79-1",
      "userUrl": "https://www.imdb.com/user/ur4127036",
      "reviewLink": "https://www.imdb.com/review/rw0953317",
      "warningSpoilers": false,
      "date": "27 October 2004",
      "rate": "",
      "helpful": "149 out of 194 found this helpful.",
      "title": "Joan Fontaine is so beautiful",
      "content": "I spent the majority of this film thinking about how lucky M. Olivier really was. To be able to wrap his arms around Joan Fontaine and kiss her. Oh my. She's one of the most beautiful women I've ever seen (almost, but not quite as beautiful as Veronica Lake). She's also absolutely perfect in the role of the second Mrs. DeWinter, taking a character that could have become a cloying bore in less capable hands and transforming her into a sympathetic and interesting figure.The movie, on the whole, is similarly amazing, capturing the spirit and the tone of those great Gothic romances. Watching Rebecca, I was reminded (pleasantly) of Wuthering Heights; I do not mean to suggest that in some way this film re-tells the tale of Cathy and Heathcliff, but rather that Rebecca has the feel of Bronte's novel (I am most certainly not talking about the William Wyler adaptation a few years before the release of Rebecca. That's a terrible film that somehow manages to mis-interpret the novel).I must assume that the guiding hand of Hitchcock played no small role in recreating the feel of a Gothic romance. There are very few that would be able to take a love story, infuse it with such gloom, with such a sense of foreboding, and still manage to create something that ends happily without it feeling like a cop-out. I'd also like to draw everyone's attention to the incredibly moving section of the film that occurs between the arrival of the second Mrs. DeWinter at Mandalay and the masqued ball. The emotional strain on the Joan Fontaine character is so palpable, so absolutely taxing, that it actually pains me to watch. I hurt along with her. Few other movies affect me so emotionally - one of them is Vertigo.All in all, this is a fantastic piece of film-making from Hollywood's golden age. Laurence Olivier is in top-form, as he plays the quiet, sad Maxim and George Sanders is positively hateful.10/10 - a visceral masterpiece"
    },
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0022595",
      "warningSpoilers": false,
      "date": "26 July 2001",
      "rate": "",
      "helpful": "33 out of 45 found this helpful.",
      "title": "A Fine Classic",
      "content": "This fine classic combines a great director, a great story, and a great cast. Any one of those would have made for a good movie, but all three make it an excellent one. Hitchcock's style and eye for detail combine very well with a story (from a novel that is extremely good in its own right) filled with psychological fear and settings that are interesting and suggestive.Most of the time the story itself moves fairly slowly, allowing the focus to be on the characters, but there are also a couple of very good plot twists, which can be very surprising if you've not seen the movie or read the novel. So if you happen not to know the story, it's a good idea to see the film before reading a lot of comments about it. Laurence Olivier, Joan Fontaine, Judith Anderson, and George Sanders are all perfectly cast and do a wonderful job bringing their characters to life, and making you feel a part of the story.\"Rebecca\" should be satisfying not only to any Hitchcock fan, but to anyone who likes classic movies. Whether you like romance, suspense, or drama, they're all here, and put together by a director and cast that are masters of their art."
    },
    {
      "username": "sol-",
      "userUrl": "https://www.imdb.com/user/ur1355003",
      "reviewLink": "https://www.imdb.com/review/rw0990854",
      "warningSpoilers": false,
      "date": "3 January 2005",
      "rate": "10",
      "helpful": "52 out of 74 found this helpful.",
      "title": "My brief review of the film",
      "content": "A stylishly directed and photographed film that examines a number of themes, such a deception, death and depression, and explores well the emotions of its characters. It is rare to find a film like this, as it tackles various genres, ranging from being a romance to a mystery to a drama to even a comedy at times, and all without seeming pretentious. The cast is truly magnificent. Judith Anderson is a stunner is a quiet but sinister role, and George Sanders is even more impressive in lively but also sinister performance. Laurence Olivier and Joan Fontaine are perfect for their roles too. The film won Academy Awards for Best Picture and Best Cinematography quite deservingly  this is one of the best films Hollywood has ever produced."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6085359",
      "warningSpoilers": false,
      "date": "11 September 2020",
      "rate": "9",
      "helpful": "16 out of 21 found this helpful.",
      "title": "'Happiness is something I know nothing about'...",
      "content": "... and it's clear to see throughout that Maxim de Winter is not overwrought with joy as we witness a story tacking in one direction, gradually adjusting course to another and finally distorting and folding in on itself with magnificent Hitchcockian escalation towards the end.If you view this through contemporary eyes alone it's easy to see it as dated, old fashioned, antique perhaps, many things in the past fall foul of fashion sooner or later. Place a pair of pince-nez on the bridge of your nose and witness two great stars, Joan Fontaine is outstanding, add immense depth to an already deep, dark and disturbing tale with some sinister supporting characters thrown in for good measure, none more so than Judith Anderson as the mysterious and cryptic Mrs. Danvers."
    },
    {
      "username": "secondtake",
      "userUrl": "https://www.imdb.com/user/ur20961309",
      "reviewLink": "https://www.imdb.com/review/rw2228861",
      "warningSpoilers": false,
      "date": "31 March 2010",
      "rate": "10",
      "helpful": "16 out of 22 found this helpful.",
      "title": "Sucks you in totally...a high romance with astonishing sets and photography",
      "content": "Rebecca (1940)Ah, to see another great movie from those few years when Hollywood peaked, when that combination of art, freshness, and sheer collaborative talent combined over and over. I'm talking from Gone with the Wind to Casablanca, 1939 to 1942. Throw in any number of truly staggering movies in the stretch--Citizen Kane for starters--and we have to almost expect Alfred Hitchcock to fit right in. With Rebecca he does. It's another perfect movie.Daphne Du Maurier's book of the same title is a great read, something short of a literary classic but something better than a mere best-seller. I read it recently, and was completely transported into a land of subtle drama. That sounds like an oxymoron, but when you see this movie you'll notice how people act with restraint, with glances, with quiet actions, and yet achieve a grandiose, dramatic effect that tears your heart out. It's an archetypal story about a girl who seems to have a dream come true marrying a charming and very wealthy man.But of course, there are skeletons in this man's closet, and Lawrence Olivier plays the inner struggle of Maxim close to the chest. More openly troubled by events, and so sympathetic your heart jumps out of your chest, is the girl, his wife, played by Joan Fontaine. Now here is a performance that is just incredible. She even changes her presence as her innocence slowly bleeds away from start to finish. If the two of them never quite have sparks fly, they're not supposed to. But Hitchcock has done more than chosen a great, cinematic novel and two amazing actors (as well as a flawless supporting cast). With the most romantic, lush sets, delirious lights, and rich, layered photography, all fluidly combined to create scenes so beautiful you can almost taste it, the director has shown, again, that he understands the intuitive power of the cinema. It isn't the outward brilliance of any one scene or shot, or any one conversation that the camera follows invisibly, or any flinging of the curtains to reveal only more fog or sheer obscurity. It's the pacing and sequence of these moments that sucks you into the world and won't let you go.Well, it's no surprise, maybe, that Rebecca won best picture and best cinematography at the Oscars. And it was up against The Letter, The Grapes of Wrath, and The Philadelphia Story, all of which are more proof that the movies of this period are a zenith of a certain kind of Hollywood. The studio system. (Yes, there are hundreds of other great movies from other years, but I'm not really trying to make my case here.) Hitchcock never won an Oscar for best director (neither did Welles), but he could have here without fault. As much as this is just a movie to get lost in and enjoy, it's also a movie you could watch over and over and study."
    },
    {
      "username": "dave fitz",
      "userUrl": "https://www.imdb.com/user/ur0705468",
      "reviewLink": "https://www.imdb.com/review/rw0022567",
      "warningSpoilers": false,
      "date": "1 May 2000",
      "rate": "10",
      "helpful": "51 out of 67 found this helpful.",
      "title": "One of Hitchcock's best films",
      "content": "In his long career, Alfred Hitchcock directed many great films. Rebecca ranks as one of the greatest. It was the only Hitchcock movie to win a Best Picture Oscar and it was his first Hollywood film after leaving England. This was also the first film in which he adapted someone else's work, the famous novel by de Maurier.This film features all the twists and strange characters you would expect from Hitchcock along with the trademark unexpected ending. Sir Laurence Olivier is great, as usual, as Maximillian de Winter. The stunning Joan Fontaine is wonderful as \"the Second Mrs. de Winter\". Rebecca is an entertaining thriller by one of the masters of film."
    },
    {
      "username": "Dtkoyzis",
      "userUrl": "https://www.imdb.com/user/ur1032393",
      "reviewLink": "https://www.imdb.com/review/rw0022584",
      "warningSpoilers": false,
      "date": "20 February 2001",
      "rate": "",
      "helpful": "105 out of 135 found this helpful.",
      "title": "the first Hitchcock masterpiece",
      "content": "\"Rebecca\" was the first Hitchcock film I ever saw, and I was mesmerized by it from the start, convinced that I had to see more of the director's work. It richly deserved the Oscar it received, but it's a real puzzle that the Academy saw fit to withhold a best director award for Hitch. Would one possibly give an award to a work by Picasso and not to Picasso himself?\"Rebecca\" was the first of the director's American-made films, and it shows. It's quite different from his earlier British-made films, such as \"Young and Innocent\" and even \"The Lady Vanishes,\" which somehow seem more amateurish by comparison. (I know little of the British cinema of that era, but it's difficult not to conclude that Hollywood was better at producing more sophisticated efforts.) I would even judge \"Rebecca\" the best of his films of the early 1940s, with the possible exception of \"Shadow of a Doubt.\" It is true, of course, that much of this film has become cliché (remember the spoofs on the old \"Carol Burnette Show\"!), but it still weathers the decades very well. The acting is uniformly excellent. Olivier is the hardened Maxim de Winter, untitled lord of Manderly, trying to forget the past and given to unexpected bouts of anger and coldheartedness. Fontaine is perfect as the unnamed mousy heroine, innocent yet deeply in love, still carrying with her the aura of an awkward schoolgirl. Even character actor Nigel Bruce, best known for his role in the Sherlock Holmes films, makes an appearance and plays, in effect, Nigel Bruce!But it is Judith Anderson's role as Mrs. Danvers that viewers are likely to remember best. Her presence is as dark and foreboding as that of the deceased Rebecca herself, and Fontaine is evidently cowed by her icy stare and unnervingly formal manner. The dynamics between the two actresses are wonderful. Who could fail to empathize with Fontaine's unenviable position as, in effect, the new employer of such an intimidating personage? On the other hand, Olivier seems quite unfearful of Anderson, despite her representing so much of the past he is trying to block out. This part of the plot (even in the book) never made much sense to me and is unconvincing.As far as I know, this film marked Hitch's first collaboration with composer Franz Waxman, whose haunting score makes it all the more memorable. Waxman's scores are perhaps less obviously cinematic than those of the incomparable Bernard Herrmann, who would score Hitch's films from 1955 to 1966. Contrast the score for \"Rebecca\" to Herrmann's music for \"Citizen Kane\" the following year, and you'll immediately hear the difference. Waxman's is more symphonic in the central European style reflective of his own birth and upbringing. Yet it is worth recalling that scoring films was still a new art at this time, and both Waxman and Herrmann were pioneers.Finally, one has to mention the cinematography, which is magnificent. Technically \"Rebecca\" might have been filmed in colour, which was newly available in 1940. (\"Gone with the Wind\" was filmed entirely in colour the previous year, while \"The Wizzard of Oz\" and \"The Women\" had colour scenes.) But colour would have diminished its impact. The suspense and the ominous sense of impending doom could only have been communicated through the medium of black-and-white and the deft use of light and shade which it affords.In one respect, of course, \"Rebecca\" is not a typical Hitchcock film. There is no fleeing innocent trying to clear his name of a crime he did not commit. Surprisingly, there isn't even a murder, although its absence was apparently imposed by the Hayes Code and is certainly foreign to Daphne du Maurier's original novel. Some have said that there is more Selznick than Hitchcock in this film, and perhaps there's something to that. Still, if the collaborative effort between the two was not exactly amiable, it was nevertheless successful.In short, this is the first in a string of Hitchcock masterpieces."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1386669",
      "warningSpoilers": false,
      "date": "5 June 2006",
      "rate": "10",
      "helpful": "12 out of 17 found this helpful.",
      "title": "a producer/director combination that works, elegantly and to the best of abilities",
      "content": "David O. Selznick might have had more of an influence over this production than some might think- as with many of his films- and he is the one who ended up receiving the Oscar, not director Alfred Hitchcok, for the 1940 mystery-drama-romance Rebecca. But it is to the credit of both that, for the most part, it looks as if both tried to stay out of each other's way and just put up as good as film as they could. And it is a credit to Hitchcock that with a certain change from what one might see in his perhaps more entertaining films of the 50's and 60's also shows his knack at making great romantic Hollywood movie-making. He is given a plethora of the best of English acting talents (Olivier of course is hyped and hyped again just like Brando, but his work is undeniably good here, and yet it's Joan Fontaine who quietly makes her mark quite powerfully even when she is reserved in scenes), lush sets and production decor, a solid 'studio' score by Frank Waxman, and some memorable sequences and set-pieces. There is also some solid storytelling as well with his usual knack at unraveling a mystery piece by piece, with love, loss and deception at the core.Part of the film's success, however, is as attributable to the factor of it being one of the best \"chick-flicks\" in history that the film works today. And this time I mean it pretty much as a compliment, perhaps more to Selznick than anyone (Gone with the Wind, of course). The appeal that might usually go mostly for women is not lost at all on the male audience due to the sheer power and hints at what the two main actresses go for. Fontaine is the \"2nd\" Mrs. De Winter, who elopes with the Mr. played by Olivier and goes to live in Manderlay and meets some of the family and other folks. One of these is the one who has maybe the most interesting (naturally, as the antagonist) character, Mrs. Danvers played by Judith Anderson. Her's is a cold, exacting kind of character who has the straightforward, stern attitude of the ma'am of the house, but also with some dark secrets. It's not to say Hitchcock doesn't hav his eye out for other supporting parts and characters (I liked particularly the old guy who's at the shack where the majority of the secrets are house). But he also is able to get the character the audience will dislike the most as the more fascinating of the bunch, and Anderson is up to task.I wouldn't rush to see this as the first Hithcock film to see if you haven't seen one yet, but as an example of what he could direct aside from his outrageous and masterpiece works in the following years this is a fit example. It's also got, basically, an excellent story, and is pumped up with the best of Hollywood decorum and spectacle, with a big fire of an ending that practically on its own makes it worthwhile enough to see."
    },
    {
      "username": "sundae",
      "userUrl": "https://www.imdb.com/user/ur0347371",
      "reviewLink": "https://www.imdb.com/review/rw0022581",
      "warningSpoilers": false,
      "date": "11 October 2000",
      "rate": "",
      "helpful": "122 out of 151 found this helpful.",
      "title": "A Wonderful Film",
      "content": "This is one of my favorite movies of all time. Definitely my favorite classic. There are some that come close, such as Citizen Kane, Spellbound, and Psycho, but none quite compare to this amazing movie.The first thing that you notice is the outstanding cinematography. You have to remember that this movie was made in 1940, when they didn't have the technology we have now. But that first shot of the water beating up against the rocks grabs you and for one split second you wonder if maybe this isn't part of the movie but rather something filmed just recently. But then you see the familiar face of Laurence Olivier, reminding you that this was made 60 years ago, a fact that forever amazes me. The only oscar it won besides Best Picture was well deserved.Another thing that makes it such a wonderful film is the acting. I have debated on whether Laurence Olivier's character, the tortured Maxim de Winter, is the pitiable character or if his second wife played by Joan Fontaine is really the one to feel sorry for. Every time I watch it I see it from a different point of view. Joan Fontaine is excellent. Laurence Olivier is wonderful, but that's no surprise. The only thing that bugs me is that it seems in every movie he's in (well, at least, everything I've seen him in), he always plays the same type of character. But he's extremely good at it, so I suppose it doesn't matter.But although Joan Fontaine and Laurence Olivier are wonderful, Judith Anderson steals the show! The first time I watched the movie, I was immediately grabbed by her stunning performance as the sinister Mrs. Danvers. You hardly notice the other characters when she's in the scene. She acted the part so well that it's strange to imagine that she was any different in real life.With a wonderful storyline, and a very surprising ending, Rebecca well deserves the title as the only of Hitchcock's films to win the oscar for Best Picture. Although it may not be the most famous of all his films, it is without a doubt the greatest"
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw2176327",
      "warningSpoilers": false,
      "date": "18 December 2009",
      "rate": "9",
      "helpful": "16 out of 25 found this helpful.",
      "title": "Haunted by the Past",
      "content": "In Monte Carlo, the shy and naive lady's companion (Joan Fontaine) of the snobbish Mrs. Edythe Van Hopper (Florence Bates) meets the wealthy widower aristocrat Maxim de Winter (Laurence Olivier) in the hotel while her employer is ill. They spend many days together and they fall in love for each other. When the youth is ready to travel to New York with Mrs. Van Hopper, Maxim proposes her and they get married to each other. The now Mrs. de Winter discovers that Maxim is disturbed with the loss of his first wife Rebecca, who died when her boat sank with her alone nearby his manor Manderlay. They travel to Manderlay, where Mrs. De Winter has a cold reception from the housekeeper, Mrs. Danvers (Judith Anderson), who worshiped Rebecca. Along the days, the humble Mrs. de Winter is frightened by the omnipresence of perfect Rebecca through the arrogant Mrs. Danvers. However, when the boat of Rebecca is found with her body trapped in the cabin, Mr. and Mrs. de Winter are haunted by the past.\"Rebecca\" is probably is one of the most famous movies of Alfred Hitchcock in his earlier career, with a suspenseful romance with many surprises and twists. The performance of the fragile Joan Fontaine is amazing with her innocent expression and clumsy attitudes in an aristocratic world that does not belong to her, a simple working class young woman. Inclusive her character does not even have a name. Laurence Olivier makes a couple without chemistry with Joan Fontaine, in the role of a millionaire with a shadow from the past. The introduction, with Joan Fontaine telling her dream, misguides the viewers and I expected a different fate for the lead couple. George Sanders is the perfect scumbag and Judith Anderson performs a creepy character that might be homosexual grieving a non-corresponded love with Rebecca. The cinematography in black-and-white is very beautiful but the DVD released by the Brazilian distributor Continental is not remastered. My vote is nine.Title (Brazil): \"Rebecca, a Mulher Inesquecível\" (\"Rebecca, the Unforgettable Woman\")"
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8988189",
      "warningSpoilers": false,
      "date": "12 April 2023",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "A classic adaptation of the great novel.",
      "content": "A shy, naive young woman travelling as a pair companion encounters powerful, handsome widower Maxim de Winter, the pair quickly fall in love, and she moves to his family home.This film is without doubt, something of a masterpiece, there have been several adaptations of it, and it remains the ultimate adaptation.Hitchcock deserved an Oscar for this film, it really has stood the test of time. It has multiple quality elements, mystery, intrigue, romance, horror, it really does capture the imagination.Almost every sequence is meaningful, nothing feels unimportant or meaningless, every action has purpose, some are subtle, some are heavy.It looks sublime, production values are terrific, you can see lot went into it. Despite a fairly lengthy running time it never feels long or drawn out, it holds your attention so well.The acting is first class, Laurence Olivier and Joan Fontaine are absolutely perfect, exactly what I see from the book, the standout for me however, is Judith Anderson, who gives an incredible, chilling performance as Mrs Danvers.10/10."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1375727",
      "warningSpoilers": false,
      "date": "24 May 2006",
      "rate": "4",
      "helpful": "41 out of 74 found this helpful.",
      "title": "Wonderful Visuals, But A Big Yawner Overall",
      "content": "This review won't be accepted gracefully on this website but at least I am honest in telling you this was a big disappointment to me, considering all the great reviews I read (not here) prior to seeing it. Some of that praise is simply because it's an Alfred Hitchcock movie with \"Hitch\" being a big favorite among national critics.Even though I own a good amount of classic films, this was way too slow, way too corny and old-fashioned. I should re-purchase this film and use it the next time time I have trouble getting to sleep at night.Joan Fontaine has a nice, pretty wholesome face but that's about it. Her character in this was just plain stupid and got worse as the film wore on, especially at the end. Judith Anderson, whom I read was so \"creepy\" in this, was not anywhere near as evil as built up to be. As usual, the real-life wacko, George Sanders, is the most interesting actor in the film.Having said all that, I do want to highly praise the sets and camera effort of this movie. The best part of this melodrama was the cinematography with some wonderful scenes inside \"Mandaly\" (the mansion). The cameras did a great job with the use of shadows, some of the best I've ever seen. Without the visual treats, I doubt I could have stayed with this 130-minute film."
    },
    {
      "username": "Twillhead",
      "userUrl": "https://www.imdb.com/user/ur0222076",
      "reviewLink": "https://www.imdb.com/review/rw0022550",
      "warningSpoilers": false,
      "date": "11 June 1999",
      "rate": "10",
      "helpful": "86 out of 120 found this helpful.",
      "title": "A Classic on par with \"Citizen Kane\"",
      "content": "In a line-up of great motion pictures, \"Rebecca\" stands as one of the giants. It is arguably Hitchcock's greatest film effort, replete with jolting, slap-in-the-face plot twists and gothic sets. Dark and moody, the film boasts Sir Laurence Olivier and Joan Fontaine in slam-dunk, dead on performances, George Sanders as the deliciously despicable Jack Favell, and Judith Anderson nearly stealing the show as the eerie, obsessed housekeeper, Mrs. Danvers. A perfect \"10\"."
    },
    {
      "username": "BA_Harrison",
      "userUrl": "https://www.imdb.com/user/ur0945066",
      "reviewLink": "https://www.imdb.com/review/rw5481374",
      "warningSpoilers": false,
      "date": "13 February 2020",
      "rate": "8",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Hitch's first hit from Hollywood.",
      "content": "Director Alfred Hitchcock is renowned for his visual acuity, creating some of the most memorable shots in movie history; he also had a keen eye for beauty, casting some of Hollywood's most stunning actresses in iconic roles: Grace Kelly in Rear Window, Maureen O'Hara in Jamaica Inn, Tippi Hedren in The Birds, Ingrid Bergman in Spellbound, and Janet Leigh in Psycho, to name but a few. Perhaps his most enchanting leading lady was Joan Fontaine, who won an Oscar for her role in Suspicion (1941), but who was never more appealing than in her first film for Hitch, Rebecca, based on a novel by Daphne Du Maurier.The gorgeous Fontaine plays a meek young woman (we never discover her name, but she's not the 'Rebecca' of the title) who falls for rich aristocrat 'Maxim' de Winter (Laurence Olivier) while working in the South of France. Equally besotted, Maxim proposes to the self-effacing beauty, and takes her back to his ancestral home, Manderley, which he once shared with his first wife Rebecca, before she drowned in a boating accident. The new Mrs. de Winter does her best to adapt to her new lifestyle, but is constantly under the shadow of her predecessor, with stern housekeeper Mrs. Danvers (Judith Anderson) being particularly disapproving of Maxim's new bride, deliberately driving a wedge between the married couple and even going so far as to try and talk Mrs. de Winter Mk. II into killing herself.Thus far, the film is pure melodrama and sappy romance, and avid Hitchcock fans might be wondering where the murder and mystery is; worry, not, for this comes in the second half of the film and provides plenty of intrigue and suspense as Maxim reveals what really happened to his first wife and is subsequently suspected of her murder. Both his wife and the viewer are aware of his innocence, but with Rebecca's lover Jack Favell (George Sanders) accusing Mr. de Winter of murder, and plenty of damning evidence, things are looking pretty bad for the poor fellow. It all wraps up nicely in the end, of course, but there are plenty of tense moments along the way, all handled in the director's typically assured manner, with bags of atmosphere and sumptuous cinematography.But as great as the direction and story are, it is the performances that really make Rebecca a winner: Olivier is perfect as the troubled toff, Anderson is wonderfully wicked as scheming housekeeper Danvers, nobody does 'bumbling oaf' quite as well as Nigel Bruce (playing Major Giles Lacy, who puts his foot in his mouth whenever he speaks), Sanders is suitably slimy as adulterous blackmailer Favell, and Fontaine... well, she is completely captivating, every smile, every tilt of her head, and every nervous glance guaranteed to win over the viewer (she was nominated for Best Actress in a Leading Role at the Oscars, but lost to Ginger Rogers). Hell, even the dog that played Maxim's mutt Jasper was excellent (so cute!)."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1450781",
      "warningSpoilers": false,
      "date": "17 August 2006",
      "rate": "8",
      "helpful": "12 out of 19 found this helpful.",
      "title": "On The Road To Manderley",
      "content": "I've always found it curious that of all the films Alfred Hitchcock directed Rebecca was the one that wound up with the Best Picture Oscar and that Hitchcock didn't receive Best Director for it. Usually those two go together. John Ford won his second Oscar for Best Director for The Grapes of Wrath that year instead. Also Laurence Olivier, Joan Fontaine and Judith Anderson were nominated and all came up short.Off the top of my head I would say Vertigo, North By Northwest, Shadow of a Doubt, and Spellbound are all qualitatively better than Rebecca. Yet Rebecca does have a nice Gothic horror feel to it though there is nothing supernatural going on here.Laurence Olivier plays Maxim DeWinter, heir to the estate of Manderley who is in Monte Carlo looking to get away from the place because of the death of his first wife Rebecca. She was by all accounts a regal beauty who was the toast of society and he's in mourning for her loss. But he meets Joan Fontaine a nice, but plain sort of girl who is the paid companion of American dowager Florence Bates. Maybe because she's the opposite of Rebecca he's attracted to her. Fontaine grabs him on the spot when marriage is proposed.Fontaine has a lot of insecurities much like her character in a following Hitchcock film, Suspicion. They're not eased any by Judith Anderson the housekeeper of the big Manderley estate.Mrs. Danvers was Judith's career role. Before writing this review I remarked to someone else that I wonder what Mr. Danvers must have been like. It occurred to me later that there was no Mr. Danvers, he exists only as an excuse or a pretense so there would be no whispers about her unmarried status. She pretends to be a widow. There's more than just latent lesbianism in Judith Anderson's portrayal. She was totally in love with the late Rebecca DeWinter and I'm sure it got good and physical. She can't stand seeing anyone else in taking her place. Since it comes out that Rebecca was fooling around with her cousin George Sanders, why not a lesbian affair as well. If Rebecca were written today, Mrs. Danvers would be more openly lesbian.Rebecca was the first of Alfred Hitchcock's American films as well, though it was done here it was done by the English colony in Hollywood. Hitchcock never had budgets that Selznick gave him over in the UK. The sets depicting the grandeur of Manderley are an eye full. Than again so were the sets of Tara in Selznick's Best Picture of the previous year, Gone With the Wind.Rebecca is a good mixture of mystery, Gothic horror, and romance served up quite nicely by Alfred Hitchcock."
    }
  ],
  "errorMessage": ""
}