{
  "imDbId": "tt0032976",
  "title": "Rebecca",
  "fullTitle": "Rebecca (1940)",
  "type": "Movie",
  "year": "1940",
  "language": "en",
  "titleInLanguage": "Rebecca (1940 film)",
  "url": "https://en.wikipedia.org/wiki/Rebecca_(1940_film)",
  "plotShort": {
    "plainText": "Rebecca is a 1940 American romantic psychological thriller film directed by Alfred Hitchcock. It was Hitchcock's first American project, and his first film under contract with producer David O. Selznick. The screenplay by Robert E. Sherwood and Joan Harrison, and adaptation by Philip MacDonald and Michael Hogan, were based on the 1938 novel of the same name by Daphne du Maurier.\r\nThe film stars Laurence Olivier as the brooding, aristocratic widower Maxim de Winter and Joan Fontaine as the young woman who becomes his second wife, with Judith Anderson, George Sanders and Gladys Cooper in supporting roles. The film is a gothic tale shot in black-and-white. Maxim de Winter's first wife Rebecca, who died before the events of the film, is never seen. Her reputation and recollections of her, however, are a constant presence in the lives of Maxim, his new wife and the creepy housekeeper Mrs. Danvers.\r\nRebecca was theatrically released on April 12, 1940, to critical and commercial success. It received eleven nominations at the 13th Academy Awards, more than any other film that year. It won two awards; Best Picture, and Best Cinematography, becoming the only film directed by Hitchcock to win the former award. In 2018, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\" The story is also a successful musical production.",
    "html": "<p>Rebecca is a 1940 American romantic psychological thriller film directed by Alfred Hitchcock. It was Hitchcock's first American project, and his first film under contract with producer David O. Selznick. The screenplay by Robert E. Sherwood and Joan Harrison, and adaptation by Philip MacDonald and Michael Hogan, were based on the 1938 novel of the same name by Daphne du Maurier.</p><p>The film stars Laurence Olivier as the brooding, aristocratic widower Maxim de Winter and Joan Fontaine as the young woman who becomes his second wife, with Judith Anderson, George Sanders and Gladys Cooper in supporting roles. The film is a gothic tale shot in black-and-white. Maxim de Winter's first wife Rebecca, who died before the events of the film, is never seen. Her reputation and recollections of her, however, are a constant presence in the lives of Maxim, his new wife and the creepy housekeeper Mrs. Danvers.</p><p>Rebecca was theatrically released on April 12, 1940, to critical and commercial success. It received eleven nominations at the 13th Academy Awards, more than any other film that year. It won two awards; Best Picture, and Best Cinematography, becoming the only film directed by Hitchcock to win the former award. In 2018, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\" The story is also a successful musical production.</p>"
  },
  "plotFull": {
    "plainText": "Rebecca is a 1940 American romantic psychological thriller film directed by Alfred Hitchcock. It was Hitchcock's first American project, and his first film under contract with producer David O. Selznick. The screenplay by Robert E. Sherwood and Joan Harrison, and adaptation by Philip MacDonald and Michael Hogan, were based on the 1938 novel of the same name by Daphne du Maurier.\r\nThe film stars Laurence Olivier as the brooding, aristocratic widower Maxim de Winter and Joan Fontaine as the young woman who becomes his second wife, with Judith Anderson, George Sanders and Gladys Cooper in supporting roles. The film is a gothic tale shot in black-and-white. Maxim de Winter's first wife Rebecca, who died before the events of the film, is never seen. Her reputation and recollections of her, however, are a constant presence in the lives of Maxim, his new wife and the creepy housekeeper Mrs. Danvers.\r\nRebecca was theatrically released on April 12, 1940, to critical and commercial success. It received eleven nominations at the 13th Academy Awards, more than any other film that year. It won two awards; Best Picture, and Best Cinematography, becoming the only film directed by Hitchcock to win the former award. In 2018, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\" The story is also a successful musical production.\r\nPlot\r\nMaxim de Winter stands at a cliff edge, seemingly contemplating jumping. A young woman shouts at him to stop him in his tracks, but he curtly asks her to walk on.\r\nLater, at Monte Carlo on the French Riviera, the same young woman is staying with her pompous old traveling companion, Mrs. Van Hopper. She again encounters the aristocratic widower Maxim de Winter, looking much more debonair. They are attracted to each other, and although Van Hopper tells her he is still obsessed with his dead wife, Rebecca, who we are told drowned in the sea near Manderley, she soon becomes the second Mrs. de Winter.\r\nMaxim takes his new bride back to Manderley, his grand mansion by the sea in southwestern England. It is dominated by its housekeeper, Mrs. Danvers. She is a chilly individual who had been a confidante of the first Mrs. de Winter, whose death she has not forgotten. She has even preserved Rebecca's grand bedroom suite unchanged, and displays various items that carry her monogram.\r\nEventually, constant reminders of Rebecca's glamour and sophistication convince the new Mrs. de Winter that Maxim is still in love with his first wife, which could explain his irrational outbursts of anger. She tries to please her husband by holding a costume party as he and Rebecca used to. Danvers suggests she copy the dress that one of Maxim's ancestors is seen wearing in a portrait. However, when she appears in the costume, Maxim is appalled as Rebecca had worn an identical dress at her last ball, just before her death.\r\nWhen Mrs. de Winter confronts Danvers about this, she tells her she can never take Rebecca's place and tries to persuade her to jump to her death from the second-story window of Rebecca's room. At that moment, however, the alarm is raised because a ship has run aground due to the fog, and in the rescue of its crew, a sunken boat has been discovered with Rebecca's body in it.\r\nMaxim now confesses to his new wife that his first marriage had been a sham from the start. Rebecca had declared that she had no intention of keeping to her vows but would pretend to be the perfect wife and hostess for the sake of appearances. When she implied she was pregnant by her cousin and lover, Jack Favell, she taunted Maxim that the estate might pass to someone other than Maxim's line. During a heated argument, she fell, struck her head, and died. To conceal the truth, Maxim took the body out in a boat which he then scuttled, and identified another body as Rebecca's.\r\nThe crisis causes the second Mrs. de Winter to shed her naïve ways as the couple plan to prove Maxim's innocence. When the police claim the possibility of suicide, Favell attempts to blackmail Maxim, threatening to reveal that she had never been suicidal. When Maxim goes to the police, they suspect him of murder. However, further investigation with a doctor reveals that she was not pregnant but terminally ill due to cancer, so the suicide verdict stands. Maxim realizes Rebecca had been trying to goad him into killing her to ruin him.\r\nAs a free man, Maxim returns home to see Manderley on fire, set ablaze by the deranged Mrs. Danvers. All escape except Danvers, who dies when the ceiling collapses on her.\r\nCast\r\nJoan Fontaine as the second Mrs. de Winter\r\nLaurence Olivier as George Fortescue Maximilian \"Maxim\" de Winter, owner of Manderley\r\nJudith Anderson as Mrs. Danvers, housekeeper of Manderley\r\nGeorge Sanders as Jack Favell, Rebecca's first cousin and lover\r\nReginald Denny as Frank Crawley, Maxim's estate manager of Manderley and friend\r\nGladys Cooper as Beatrice Lacy, Maxim's sister\r\nC. Aubrey Smith as Colonel Julyan\r\nNigel Bruce as Major Giles Lacy, Beatrice's husband\r\nFlorence Bates as Mrs. Edythe Van Hopper, employer of the second Mrs. de Winter\r\nEdward Fielding as Frith, oldest butler of Manderley\r\nMelville Cooper as Coroner at trial\r\nLeo G. Carroll as Dr. Baker, Rebecca's doctor\r\nLeonard Carey as Ben, the beach hermit at Manderley\r\nLumsden Hare as Mr. Tabbs, boat builder\r\nForrester Harvey as Chalcroft the innkeeper\r\nPhilip Winter as Robert, a servant at Manderley\r\nHitchcock's cameo appearance, a signature feature of his films, takes place near the end; he is seen walking, back turned to the audience, outside a phone box just after Jack Favell completes a call.\r\nProduction\r\nAt Selznick's insistence, the film faithfully adapts the plot of du Maurier's novel Rebecca. However, at least one plot detail was altered to comply with the Hollywood Production Code, which said that the murder of a spouse had to be punished. In the novel, Maxim shoots Rebecca, while in the film, he only thinks of killing her as she taunted him into believing that she was pregnant with another man's child, and her subsequent death is accidental. However, Rebecca was not pregnant but had incurable cancer and had a motive to commit suicide, that of punishing Maxim from beyond the grave. Therefore, her death is declared a suicide, not murder.\r\nHitchcock later said that Selznick wanted the smoke from the burning Manderley to spell out a huge \"R\", which Hitchcock thought lacked subtlety. While Selznick was preoccupied by Gone with the Wind (1939), Hitchcock was able to replace the smoky \"R\" with the burning of a monogrammed négligée case lying atop a bed pillow. Hitchcock edited the film \"in camera\" (shooting only what he wanted to see in the final film) to restrict the producer's power to re-edit the picture. But Selznick relished the post-production process; he personally edited the footage, laid in Franz Waxman's score, and supervised retakes and extensive re-recording of the dialogue of Sanders, Bates and Fontaine. Rewrites and reshooting were called for after a rough cut was previewed on December 26, 1939.: 78–80\r\nAlthough Selznick insisted that the film be faithful to the novel, Hitchcock did make some other changes, though not as many as he had made in a previously rejected screenplay, in which he altered virtually the entire story. In the novel, Mrs. Danvers is something of a jealous mother figure, and her past is mentioned in the book. In the film, Mrs. Danvers is a much younger character (Judith Anderson would have been about 42 at the time of shooting), and her past is not revealed at all. The only thing known about her in the film is that she came to Manderley when Rebecca was a bride.\r\nThe Breen Office, Hollywood's censorship board, specifically prohibited any outright hint of a lesbian infatuation or relationship between Mrs. Danvers and Rebecca,: 70 though the film clearly does dwell on Danvers' obsessive memories of her late mistress.\r\nThe Hollywood Reporter reported in 1944 that Edwina Levin MacDonald sued Selznick, Daphne du Maurier, United Artists and Doubleday for plagiarism. MacDonald claimed that the film Rebecca was stolen from her novel Blind Windows, and sought an undisclosed amount of accounting and damages. The complaint was dismissed on January 14, 1948 and the judgment can be read online.\r\nProduction credits\r\nThe production credits on the film were as follows:\r\nDirector - Alfred Hitchcock\r\nProducer - David O. Selznick\r\nScreenplay - Robert E. Sherwood and Joan Harrison\r\nCinematography - George Barnes (photography)\r\nArt direction - Lyle R. Wheeler (art direction), Joseph B. Platt (interiors designed), Howard Bristol (interior decoration)\r\nMusic - Franz Waxman (music), Lou Forbes (music associate)\r\nSpecial effects - Jack Cosgrove\r\nFilm editor - Hal C. Kern (supervising film editor), James E. Newcom (associated film editor)\r\nScenario assistant - Barbara Keon\r\nSound - Jack Noyes (recorder)\r\nAssistant director - Edmond Bernoudy\r\nReception\r\nFrank S. Nugent of The New York Times called it \"an altogether brilliant film, haunting, suspenseful, handsome and handsomely played.\" Variety called it \"an artistic success\" but warned it was \"too tragic and deeply psychological to hit the fancy of wide audience appeal.\" Film Daily wrote: \"Here is a picture that has the mark of quality in every department - production, direction, acting, writing and photography - and should have special appeal to femme fans. It creates a new star in Joan Fontaine, who does fine work in a difficult role, while Laurence Olivier is splendid.\" Harrison's Reports declared: \"A powerful psychological drama for adults. David O. Selznick has given it a superb production, and Alfred Hitchcock has again displayed his directorial skill in building up situations that thrill and hold the spectator in tense suspense.\" John Mosher of The New Yorker wrote that Hitchcock \"labored hard to capture every tragic or ominous nuance, and presents a romance which is, I think, even more stirring than the novel.\"\r\nThe film holds a 98% approval rating on Rotten Tomatoes based on 104 reviews, with an average rating of 8.90/10. The site's consensus describes it as \"a masterpiece of haunting atmosphere, Gothic thrills, and gripping suspense\". On Metacritic it has a score of 86 out of 100, based on reviews from 16 critics, indicating \"universal acclaim\". Rebecca won the Film Daily year-end poll of 546 critics nationwide naming the best films of 1940.\r\nRebecca was the opening film at the 1st Berlin International Film Festival in 1951. The Guardian called it \"one of Hitchcock's creepiest, most oppressive films\". In a poll held by the Empire magazine in 2008, it was voted 318th 'Greatest Movie of All Time' from a list of 500. In 2016, Empire ranked the film at No. 23 on their list of \"The 100 best British films\" because although it was an American production the film was set in England and mainly starred English actors and actresses. In 2018, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\" A restored nitrate print of Rebecca was shown at the Grauman's Egyptian Theatre in Hollywood in 2019. The screening was introduced by Christopher Nolan.\r\nBox office\r\nThe film earned $3 million in theater rentals from the U.S. and Canada and $1 million in Britain on its initial release. It was re-released in Britain in 1945 and made $460,000.\r\nAccording to Kinematograph Weekly it was the most popular film of 1940 in Britain.\r\nAccolades\r\nRebecca won two Academy Awards and was nominated for nine more: It is the only film since 1936 (when awards for actors in supporting roles were first introduced) that, despite winning Best Picture, received no Academy Award for acting, directing or writing.\r\nRebecca was twice honored by the AFI in their AFI 100 Years... series\r\nAFI's 100 Years...100 Thrills – No. 80\r\nAFI's 100 Years...100 Heroes and Villains – Mrs. Danvers, No. 31 Villain",
    "html": "<p>Rebecca is a 1940 American romantic psychological thriller film directed by Alfred Hitchcock. It was Hitchcock's first American project, and his first film under contract with producer David O. Selznick. The screenplay by Robert E. Sherwood and Joan Harrison, and adaptation by Philip MacDonald and Michael Hogan, were based on the 1938 novel of the same name by Daphne du Maurier.</p><p>The film stars Laurence Olivier as the brooding, aristocratic widower Maxim de Winter and Joan Fontaine as the young woman who becomes his second wife, with Judith Anderson, George Sanders and Gladys Cooper in supporting roles. The film is a gothic tale shot in black-and-white. Maxim de Winter's first wife Rebecca, who died before the events of the film, is never seen. Her reputation and recollections of her, however, are a constant presence in the lives of Maxim, his new wife and the creepy housekeeper Mrs. Danvers.</p><p>Rebecca was theatrically released on April 12, 1940, to critical and commercial success. It received eleven nominations at the 13th Academy Awards, more than any other film that year. It won two awards; Best Picture, and Best Cinematography, becoming the only film directed by Hitchcock to win the former award. In 2018, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\" The story is also a successful musical production.</p><br/><h3>Plot</h3><p>Maxim de Winter stands at a cliff edge, seemingly contemplating jumping. A young woman shouts at him to stop him in his tracks, but he curtly asks her to walk on.</p><p>Later, at Monte Carlo on the French Riviera, the same young woman is staying with her pompous old traveling companion, Mrs. Van Hopper. She again encounters the aristocratic widower Maxim de Winter, looking much more debonair. They are attracted to each other, and although Van Hopper tells her he is still obsessed with his dead wife, Rebecca, who we are told drowned in the sea near Manderley, she soon becomes the second Mrs. de Winter.</p><p>Maxim takes his new bride back to Manderley, his grand mansion by the sea in southwestern England. It is dominated by its housekeeper, Mrs. Danvers. She is a chilly individual who had been a confidante of the first Mrs. de Winter, whose death she has not forgotten. She has even preserved Rebecca's grand bedroom suite unchanged, and displays various items that carry her monogram.</p><p>Eventually, constant reminders of Rebecca's glamour and sophistication convince the new Mrs. de Winter that Maxim is still in love with his first wife, which could explain his irrational outbursts of anger. She tries to please her husband by holding a costume party as he and Rebecca used to. Danvers suggests she copy the dress that one of Maxim's ancestors is seen wearing in a portrait. However, when she appears in the costume, Maxim is appalled as Rebecca had worn an identical dress at her last ball, just before her death.</p><p>When Mrs. de Winter confronts Danvers about this, she tells her she can never take Rebecca's place and tries to persuade her to jump to her death from the second-story window of Rebecca's room. At that moment, however, the alarm is raised because a ship has run aground due to the fog, and in the rescue of its crew, a sunken boat has been discovered with Rebecca's body in it.</p><p>Maxim now confesses to his new wife that his first marriage had been a sham from the start. Rebecca had declared that she had no intention of keeping to her vows but would pretend to be the perfect wife and hostess for the sake of appearances. When she implied she was pregnant by her cousin and lover, Jack Favell, she taunted Maxim that the estate might pass to someone other than Maxim's line. During a heated argument, she fell, struck her head, and died. To conceal the truth, Maxim took the body out in a boat which he then scuttled, and identified another body as Rebecca's.</p><p>The crisis causes the second Mrs. de Winter to shed her naïve ways as the couple plan to prove Maxim's innocence. When the police claim the possibility of suicide, Favell attempts to blackmail Maxim, threatening to reveal that she had never been suicidal. When Maxim goes to the police, they suspect him of murder. However, further investigation with a doctor reveals that she was not pregnant but terminally ill due to cancer, so the suicide verdict stands. Maxim realizes Rebecca had been trying to goad him into killing her to ruin him.</p><p>As a free man, Maxim returns home to see Manderley on fire, set ablaze by the deranged Mrs. Danvers. All escape except Danvers, who dies when the ceiling collapses on her.</p><br/><h3>Cast</h3><ul><li>Joan Fontaine as the second Mrs. de Winter</li><li>Laurence Olivier as George Fortescue Maximilian \"Maxim\" de Winter, owner of Manderley</li><li>Judith Anderson as Mrs. Danvers, housekeeper of Manderley</li><li>George Sanders as Jack Favell, Rebecca's first cousin and lover</li><li>Reginald Denny as Frank Crawley, Maxim's estate manager of Manderley and friend</li><li>Gladys Cooper as Beatrice Lacy, Maxim's sister</li><li>C. Aubrey Smith as Colonel Julyan</li><li>Nigel Bruce as Major Giles Lacy, Beatrice's husband</li><li>Florence Bates as Mrs. Edythe Van Hopper, employer of the second Mrs. de Winter</li><li>Edward Fielding as Frith, oldest butler of Manderley</li><li>Melville Cooper as Coroner at trial</li><li>Leo G. Carroll as Dr. Baker, Rebecca's doctor</li><li>Leonard Carey as Ben, the beach hermit at Manderley</li><li>Lumsden Hare as Mr. Tabbs, boat builder</li><li>Forrester Harvey as Chalcroft the innkeeper</li><li>Philip Winter as Robert, a servant at Manderley</li></ul><p>Hitchcock's cameo appearance, a signature feature of his films, takes place near the end; he is seen walking, back turned to the audience, outside a phone box just after Jack Favell completes a call.</p><br/><h3>Production</h3><p>At Selznick's insistence, the film faithfully adapts the plot of du Maurier's novel Rebecca. However, at least one plot detail was altered to comply with the Hollywood Production Code, which said that the murder of a spouse had to be punished. In the novel, Maxim shoots Rebecca, while in the film, he only thinks of killing her as she taunted him into believing that she was pregnant with another man's child, and her subsequent death is accidental. However, Rebecca was not pregnant but had incurable cancer and had a motive to commit suicide, that of punishing Maxim from beyond the grave. Therefore, her death is declared a suicide, not murder.</p><p>Hitchcock later said that Selznick wanted the smoke from the burning Manderley to spell out a huge \"R\", which Hitchcock thought lacked subtlety. While Selznick was preoccupied by Gone with the Wind (1939), Hitchcock was able to replace the smoky \"R\" with the burning of a monogrammed négligée case lying atop a bed pillow. Hitchcock edited the film \"in camera\" (shooting only what he wanted to see in the final film) to restrict the producer's power to re-edit the picture. But Selznick relished the post-production process; he personally edited the footage, laid in Franz Waxman's score, and supervised retakes and extensive re-recording of the dialogue of Sanders, Bates and Fontaine. Rewrites and reshooting were called for after a rough cut was previewed on December 26, 1939.: 78–80</p><p>Although Selznick insisted that the film be faithful to the novel, Hitchcock did make some other changes, though not as many as he had made in a previously rejected screenplay, in which he altered virtually the entire story. In the novel, Mrs. Danvers is something of a jealous mother figure, and her past is mentioned in the book. In the film, Mrs. Danvers is a much younger character (Judith Anderson would have been about 42 at the time of shooting), and her past is not revealed at all. The only thing known about her in the film is that she came to Manderley when Rebecca was a bride.</p><p>The Breen Office, Hollywood's censorship board, specifically prohibited any outright hint of a lesbian infatuation or relationship between Mrs. Danvers and Rebecca,: 70 though the film clearly does dwell on Danvers' obsessive memories of her late mistress.</p><p>The Hollywood Reporter reported in 1944 that Edwina Levin MacDonald sued Selznick, Daphne du Maurier, United Artists and Doubleday for plagiarism. MacDonald claimed that the film Rebecca was stolen from her novel Blind Windows, and sought an undisclosed amount of accounting and damages. The complaint was dismissed on January 14, 1948 and the judgment can be read online.</p><h4>Production credits</h4><p>The production credits on the film were as follows:</p><ul><li>Director - Alfred Hitchcock</li><li>Producer - David O. Selznick</li><li>Screenplay - Robert E. Sherwood and Joan Harrison</li><li>Cinematography - George Barnes (photography)</li><li>Art direction - Lyle R. Wheeler (art direction), Joseph B. Platt (interiors designed), Howard Bristol (interior decoration)</li><li>Music - Franz Waxman (music), Lou Forbes (music associate)</li><li>Special effects - Jack Cosgrove</li><li>Film editor - Hal C. Kern (supervising film editor), James E. Newcom (associated film editor)</li><li>Scenario assistant - Barbara Keon</li><li>Sound - Jack Noyes (recorder)</li><li>Assistant director - Edmond Bernoudy</li></ul><br/><h3>Reception</h3><p>Frank S. Nugent of The New York Times called it \"an altogether brilliant film, haunting, suspenseful, handsome and handsomely played.\" Variety called it \"an artistic success\" but warned it was \"too tragic and deeply psychological to hit the fancy of wide audience appeal.\" Film Daily wrote: \"Here is a picture that has the mark of quality in every department - production, direction, acting, writing and photography - and should have special appeal to femme fans. It creates a new star in Joan Fontaine, who does fine work in a difficult role, while Laurence Olivier is splendid.\" Harrison's Reports declared: \"A powerful psychological drama for adults. David O. Selznick has given it a superb production, and Alfred Hitchcock has again displayed his directorial skill in building up situations that thrill and hold the spectator in tense suspense.\" John Mosher of The New Yorker wrote that Hitchcock \"labored hard to capture every tragic or ominous nuance, and presents a romance which is, I think, even more stirring than the novel.\"</p><p>The film holds a 98% approval rating on Rotten Tomatoes based on 104 reviews, with an average rating of 8.90/10. The site's consensus describes it as \"a masterpiece of haunting atmosphere, Gothic thrills, and gripping suspense\". On Metacritic it has a score of 86 out of 100, based on reviews from 16 critics, indicating \"universal acclaim\". Rebecca won the Film Daily year-end poll of 546 critics nationwide naming the best films of 1940.</p><p>Rebecca was the opening film at the 1st Berlin International Film Festival in 1951. The Guardian called it \"one of Hitchcock's creepiest, most oppressive films\". In a poll held by the Empire magazine in 2008, it was voted 318th 'Greatest Movie of All Time' from a list of 500. In 2016, Empire ranked the film at No. 23 on their list of \"The 100 best British films\" because although it was an American production the film was set in England and mainly starred English actors and actresses. In 2018, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\" A restored nitrate print of Rebecca was shown at the Grauman's Egyptian Theatre in Hollywood in 2019. The screening was introduced by Christopher Nolan.</p><h4>Box office</h4><p>The film earned $3 million in theater rentals from the U.S. and Canada and $1 million in Britain on its initial release. It was re-released in Britain in 1945 and made $460,000.</p><p>According to Kinematograph Weekly it was the most popular film of 1940 in Britain.</p><br/><h3>Accolades</h3><p>Rebecca won two Academy Awards and was nominated for nine more: It is the only film since 1936 (when awards for actors in supporting roles were first introduced) that, despite winning Best Picture, received no Academy Award for acting, directing or writing.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"background:#ccc; text-align:center;\"><th colspan=\"5\" style=\"background: LightSteelBlue;\">Awards</th></tr><tr style=\"background:#ccc; text-align:center;\"><th>Award</th><th>Category</th><th>Subject</th><th>Result</th></tr><tr><td rowspan=\"11\"><span>Academy Awards</span></td><td><span>Outstanding Production</span></td><td><span>David O. Selznick</span> (for <span>Selznick International Pictures</span>)</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td><span>Alfred Hitchcock</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor</span></td><td><span>Laurence Olivier</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress</span></td><td><span>Joan Fontaine</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actress</span></td><td><span>Judith Anderson</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay</span></td><td><span>Robert E. Sherwood</span> and <span>Joan Harrison</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Art Direction – Black and White</span></td><td><span>Lyle R. Wheeler</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography – Black and White</span></td><td><span>George Barnes</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Hal C. Kern</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Score</span></td><td><span>Franz Waxman</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Special Effects</span></td><td><span>Jack Cosgrove</span> and <span>Arthur Johns</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><p>Rebecca was twice honored by the AFI in their AFI 100 Years... series</p><ul><li>AFI's 100 Years...100 Thrills – No. 80</li><li>AFI's 100 Years...100 Heroes and Villains – Mrs. Danvers, No. 31 Villain</li></ul><br/>"
  },
  "errorMessage": ""
}