{
  "imDbId": "tt2380307",
  "title": "Coco",
  "fullTitle": "Coco (2017)",
  "type": "Movie",
  "year": "2017",
  "items": [
    {
      "publisher": "The Hollywood Reporter",
      "author": "Michael Rechtshaffen",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/coco-review-1050825/",
      "rate": "100",
      "content": "At every imaginative juncture, the filmmakers (the screenplay is credited to Pixar veteran Molina and Matthew Aldrich) create a richly woven tapestry of comprehensively researched storytelling, fully dimensional characters, clever touches both tender and amusingly macabre, and vivid, beautifully textured visuals."
    },
    {
      "publisher": "The Playlist",
      "author": "Drew Taylor",
      "link": "",
      "rate": "100",
      "content": "Thankfully, Coco, Pixar’s latest original work and one of their very best, truly does transport you. The results are magical and feel somewhat rebellious given the current political climate, which makes the film feel even more special."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Peter Hartlaub",
      "link": "",
      "rate": "100",
      "content": "Coco is the best-looking Pixar movie since the tonally uneven “The Good Dinosaur.” The colorful afterlife is the centerpiece, but excellence is found in unexpected places."
    },
    {
      "publisher": "TheWrap",
      "author": "Robert Abele",
      "link": "https://www.thewrap.com/coco-review-pixar-disney-day-of-the-dead-dia-de-los-muertos/",
      "rate": "90",
      "content": "If an animated movie is going to offer children a way to process death, it’s hard to envision a more spirited, touching and breezily entertaining example than Coco."
    },
    {
      "publisher": "We Got This Covered",
      "author": "Matt Donato",
      "link": "https://wegotthiscovered.com/movies/coco-review/",
      "rate": "90",
      "content": "This is a masterpiece of woven ancestral roots and the importance of “familia,” confident in song and poetic in vision."
    },
    {
      "publisher": "Movie Nation",
      "author": "Roger Moore",
      "link": "https://rogersmovienation.com/2017/11/17/movie-review-pixar-finds-its-sweet-spot-again-with-the-enchanting-coco/",
      "rate": "88",
      "content": "The whole enterprise is amusing, warm and embracing, so much so that English words fall short of perfectly summing up this utterly charming film. Only a Spanish word will do. “Encantada.”"
    },
    {
      "publisher": "Variety",
      "author": "Peter Debruge",
      "link": "https://variety.com/2017/film/reviews/coco-review-pixar-1202595605/",
      "rate": "80",
      "content": "In any case, it works: Coco’s creators clearly had the perfect ending in mind before they’d nailed down all the other details, and though the movie drags in places, and features a few too many childish gags...the story’s sincere emotional resolution earns the sobs it’s sure to inspire."
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "Emily Yoshida",
      "link": "https://www.vulture.com/2017/11/coco-review.html",
      "rate": "70",
      "content": "One of the films best visual treats are its alebrijes, the colorful fantastical creatures from Mexican folk art, rendered here as electrically colored lizards and gryphons that seem to pop off the screen even without the aid of 3-D."
    },
    {
      "publisher": "IndieWire",
      "author": "David Ehrlich",
      "link": "https://www.indiewire.com/features/general/coco-review-pixar-1201895708/",
      "rate": "67",
      "content": "Fresh and stale in equal measure, Coco represents the best of what Pixar can be, and the worst of what they’ve become."
    },
    {
      "publisher": "Screen Daily",
      "author": "Tim Grierson",
      "link": "https://www.screendaily.com/reviews/coco-review/5123436.article",
      "rate": "60",
      "content": "In its zeal to pay proper respect to Mexican traditions and to avoid any hint of appropriation, Coco fails to give as much attention to its perfunctory characters or mediocre plotting, resulting in a family film which is reverent rather than inspired."
    }
  ],
  "errorMessage": ""
}