{
  "imDbId": "tt2380307",
  "title": "Coco",
  "fullTitle": "Coco (2017)",
  "type": "Movie",
  "year": "2017",
  "items": [
    {
      "username": "neil-476",
      "userUrl": "https://www.imdb.com/user/ur7813355",
      "reviewLink": "https://www.imdb.com/review/rw4150044",
      "warningSpoilers": true,
      "date": "1 May 2018",
      "rate": "10",
      "helpful": "188 out of 211 found this helpful.",
      "title": "Succeeds on all levels",
      "content": "Music is banned in Miguel's household after his musical great-grandfather abandoned his great-grandmother and her young daughter. On Mexico's Day Of The Dead festival, a convoluted series of events sees Miguel transported to the Land of the Dead, where he discovers that the dead disappear when no-one remembers them. He also discovers that unless he returns to the land of the living by dawn, he will join the dead. And there are problems ahead!The story here is very artificially structured, with all sorts of bits and pieces present s that a predetermined trail of events can be created. But you never notice that, so natural is the narrative flow. This film is highly original, full of truly gorgeous visuals, lovely songs, delightful characters, and touching resolutions to several individual story threads. And yet it appeared in the UK with no publicity, trailers, or warnings whatsoever, and my local multiscreen didn't even get it in 3D despite the fact that it is clear that the 3D would be dazzling.This is as good as any Pixar film over the last several years, and better than most."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw4430985",
      "warningSpoilers": false,
      "date": "31 October 2018",
      "rate": "10",
      "helpful": "57 out of 63 found this helpful.",
      "title": "What's not to like?!",
      "content": "I am very glad I saw \"Coco\" and understand exactly why it won the Oscar for Best Animated Feature, as it's terrifically entertaining, fun to watch...and quite touching as well.The story is set around Día de Muertos, the Mexican Day of the Dead. Miguel is a nice little boy whose family, inexplicably, HATE music and insist he never can grow up to become a musician. And, wouldn't you know it, but that's EXACTLY what the boy wants to become one day. But after destroying his homemade guitar, he is unable to enter a music contest...so he decides to take one from the local cemetery. Not surprisingly, this creates all sorts of problems...and Miguel is transported to the land of the dead. What's next? Just see the film!The CGI for this film is simply the best you'll currently find...putting it well above the quality of competing studios, such as Universal and Fox. In addition, the scope of the images is just breathtaking....and a treat to see on the big screen. Additionally, the songs, story and characters are all lovely. One warning, however, is that this film will very likely start you crying now and again...be sure to have some tissues nearby, just in case. A must-see film."
    },
    {
      "username": "jon-stokes21-539-17875",
      "userUrl": "https://www.imdb.com/user/ur38077550",
      "reviewLink": "https://www.imdb.com/review/rw3872249",
      "warningSpoilers": false,
      "date": "1 December 2017",
      "rate": "10",
      "helpful": "651 out of 729 found this helpful.",
      "title": "Shocked!",
      "content": "I knew absolutely nothing about this movie walking in, the only reason I was there was to take my daughter to see it is strictly because my wife said there was a short Frozen film that played along with the movie and my daughter just so happens to be the biggest Frozen fan on the face of the planet.Not only was I surprised by Coco, it might be the most in depth best story line I've ever seen in an animated movie. It was also educational and shed an entirely new light on the background of the Mexican holiday Dia De Los Muertos.Wonderful movie, can't say enough good things about it!"
    },
    {
      "username": "h-42927-48851",
      "userUrl": "https://www.imdb.com/user/ur118287292",
      "reviewLink": "https://www.imdb.com/review/rw5914126",
      "warningSpoilers": false,
      "date": "18 July 2020",
      "rate": "10",
      "helpful": "86 out of 94 found this helpful.",
      "title": "Coco is the number one Pixar cartoon I've seen so far",
      "content": "There are no shortcomings in the picture, connotation and plot of animation, each of which touches the hearts of the people. The animation of \"death is not the end, forgotten is\", let us move, don't forget our dead relatives."
    },
    {
      "username": "pramsalim",
      "userUrl": "https://www.imdb.com/user/ur77165650",
      "reviewLink": "https://www.imdb.com/review/rw3872461",
      "warningSpoilers": false,
      "date": "2 December 2017",
      "rate": "10",
      "helpful": "462 out of 524 found this helpful.",
      "title": "I cried twice watching this.",
      "content": "I have always been a fan of Pixar. They are really good at what they do. These guys set the bar for quality animated movies. Back then, animated movies were pretty much made for kids only. They were just your usual Sunday morning cartoons. Large eyeballs, goofy voice, exaggerated slapsticks. Disney had its classics like Bambi, Fox and The Hound, Cinderella, Sleeping Beauty. However, it felt more like fairy tales. Bedtime stories your parents give as they tuck you in. In this day and age, it wouldn't work that well. Then came Pixar with it's revolutionary debut, Toy Story. Funny, sweet, modern, relatable and plus, completely 3D animated, which marks the first time a feature film was completely 3D animated. And Pixar has been doing just this ever since.Though the movies they released were still a quality entertainment, I haven't felt like this since Toy Story 3. Toy Story 3 made me bawl like a baby. And their newest feature film, Coco, finally made me weep like a baby again. Coco is a heart-warming experience, filled with outstanding animation, wonderful music, brilliant writing, and creative models which brings out the best of Mexican culture. The movie took on themes like family, aspirations, and music. And they merged it marvelously with the Day of the Dead culture in Mexico. I also feel that this movie sends a strong message towards those that had lost their loved ones at some point. The way this movie talks about possessions and the inevitable loss that comes will, I hope, comfort you.Coco is a great movie. Definitely the best animated movie this year (The Emoji Movie? Yeah, don't think so). Could possibly be a nominee for Best Picture this year. The way it tugs our heartstrings and the emotionally satisfying end will definitely please everyone. And it's definitely up there among Pixar's finest. If Justice League annoys you, just see this movie. I definitely recommend you. Bring your families, kids to grandparents, whoever you like. I'm sure they'll like it and I'm sure you'll hug 'em all as soon as the credits roll."
    },
    {
      "username": "fjhuerta-2",
      "userUrl": "https://www.imdb.com/user/ur0508954",
      "reviewLink": "https://www.imdb.com/review/rw3844015",
      "warningSpoilers": false,
      "date": "28 October 2017",
      "rate": "10",
      "helpful": "315 out of 407 found this helpful.",
      "title": "Stunning, beautiful, colorful, powerful, sad, happy. A joy of a ride.",
      "content": "I may be biased, since this movie portrayed perfectly what life is all about in a small Mexican town. Or, perhaps I wanted to see Pixar really get back on the game. Go beyond Up, and make a complete movie that was as beautiful as the first 20 minutes of Wall-E.I got my wish. This is the movie I wanted Pixar to make, once again. A movie about what family means. A movie about the choices we make, and the roads not taken. This is a stunning work of art. It'll move you from happiness to tears, from memories of the past to the joy of the future. To understanding, to remembrance. To the joys and pains of being alive.I can't even begin to imagine how Pixar made a movie about life and death that is so colorful, so absorbing, so poignant, and so approachable for kids, and with so many layers upon layers upon layers of meaning and significance for adults.To watch Coco is to love Coco, and to remember the Cocos in your life that are no longer among us.Thank you, Pixar."
    },
    {
      "username": "Jared_Andrews",
      "userUrl": "https://www.imdb.com/user/ur53660798",
      "reviewLink": "https://www.imdb.com/review/rw4029309",
      "warningSpoilers": false,
      "date": "10 January 2018",
      "rate": "8",
      "helpful": "121 out of 154 found this helpful.",
      "title": "A Charming Depiction of a Beautiful Spanish-Language Tradition",
      "content": "Coco tells the story of young boy named Miguel living in Mexico (Coco is his great grandmother). Miguel loves music and must keep his love a secret from his family who has forbidden music of any kind since the days of his great great grandmother. On Día de Muertos, Miguel wants to enter a contest to showcase his musical talent, but his grandmother intervenes, reiterating the family's ban on music. In his hunt for a suitable guitar to play, Miguel finds himself in the land of dead, meeting the spirits of those who have passed on. On his adventure he meets his musical hero, much of his deceased family, and a strange man who asks for his help and quickly becomes a close friend. Along the way, Miguel helps his new friend and his friend helps him understand the true significance of Día de Muertos. Of course, the title character (Coco) turns out to play a vital role before the movie is over. When the moment arrives, she delivers something powerful, and it's beautiful. It moved me in a very satisfying way that felt well-earned and authentic, rather than manipulative, the way many movie moments of this sort feel. Quick sidebar: when I took Spanish in high school, my teachers would occasionally incorporate culture from Spanish-speaking countries (usually Mexico) into the lessons. In some of these lessons, I learned about Día de Muertos. Sort of. I'm not sure if the lessons were lacking or if I just wasn't paying much attention to them. Regardless, I learned more about Día de Muertos from Coco than I did in four years of high school Spanish classes. In high school, my understanding of Día de Muertos was that it was basically a Mexican Halloween. They raised spirits from the dead and played music or something, as I understood it. It seemed silly to me. After watching Coco I realized that the tradition is anything but silly. It's not about the dressing up or the food or the music. It's about family and remembering those that came before us. Leave it to Pixar to not only entertain me, but also educate me about a rich and wonderful tradition of another culture. Bravo!"
    },
    {
      "username": "jp_91",
      "userUrl": "https://www.imdb.com/user/ur21881328",
      "reviewLink": "https://www.imdb.com/review/rw7595956",
      "warningSpoilers": false,
      "date": "28 November 2021",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "The magic of Mexico!",
      "content": "\"Coco\" is the best animated film from Pixar and the best animated film of the present time. The script full of Mexican traditions and customs is rich in story, which is deep and emotional. The animation is impressive capturing the magic of Mexico and día de muertos, with colorful cinematography and tremendous characters. The voice work of the Mexican and Mexican-American actors is impressive, each voice full of emotions and with a great talent for singing that excels in each musical theme. \"Coco\" is the best film based on a Latin American country, a masterpiece!"
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw5360729",
      "warningSpoilers": false,
      "date": "28 December 2019",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Another great film from Pixar",
      "content": "This Pixar animation is centred on Miguel a Mexican boy who dreams of becoming a musician. Unfortunately for him his family has banned all music because his great great grandfather had abandoned his great great grandmother to become a musician... they expect him to become a shoemaker like the rest of his family. On the Day of the Dead he plans to sneak off and take part in a music competition but his grandmother destroys his guitar. Needing a new instrument he breaks into the tomb of his hero, legendary musician Ernesto de la Cruz, to borrow his guitar. As soon as he plays a chord something strange happens... nobody alive can see him but he can interact with his dead relatives who can enter the world of the living that one day. He returns to the Land of the Dead with them. He learns that if he stays past the end of the night he will become one of the dead! His family could return him but add the condition that he must give up on music... he refuses believing that Ernesto is his great great grandfather so could return him without such a condition. Héctor offers to help in exchange for taking his picture back to the Land of the Living. In what follows Miguel learns more about his family and culture.I found this film to be an absolute delight; the story is charming with excitement and genuinely emotional moments. I loved how it was based on the Day of the Dead; a celebration I'd previously heard of but didn't know about in any detail... I'd thought it sounded rather macabre but thanks to this see that it is really something rather beautiful; a day to remember dead family members. As one would expect the animation is great as were the detailed backgrounds. The central story of a child trying to return from a spirit world strongly reminded me of Studio Ghibli's 'Spirited Away'; the execution is quite different though so I never felt this was copying that film. One might think that a film about characters who are dead might be a bit creepy for younger viewers but the character designs aren't scary; in fact I think the film could be shown to children wondering about death. There are more songs than most Pixar films but it isn't a musical... characters perform rather than just break into song. Overall I'd definitely recommend this to all film fans."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw4127552",
      "warningSpoilers": true,
      "date": "13 April 2018",
      "rate": "10",
      "helpful": "13 out of 15 found this helpful.",
      "title": "\"Music's the only thing that makes me happy.\"",
      "content": "I'm not an animated movie fan per se, so this one caught me in just the right frame of mind or it was indeed brilliantly done. Probably the latter because I'd have no qualms about watching it again, as it was cleverly written, very colorful and had an unusually interesting story line. Not to mention that it had enough Espanol sprinkled in to make my four years of high school Spanish appropriately worthwhile. I also enjoyed some of the traditional folk concepts introduced by the story, like the Mexican 'Dia de Los Muertos', the annual Day of the Dead Celebration, along with it's fantastical sprit creatures called 'alebrijes'. One thing you'll have to do is pay attention at the beginning of the story to understand the relationship of young Miguel to his past and present family members; we go back in time all the way to his great-great grandfather, which turns out to be one of the twists in the story. At first I was upset that Ernesto de la Cruz turned out to be a villain, but the story handled that switch perfectly and helped inspire the entire Rivera Family to love music once again. The best concept for me however was in the explanation of how the spirits in the afterworld disappeared when there was no one left alive to think about them any more. Thoughtful families would do well to take that instruction to heart to keep alive the memories and traditions of their ancestors from the past."
    },
    {
      "username": "Vuraxis",
      "userUrl": "https://www.imdb.com/user/ur87974234",
      "reviewLink": "https://www.imdb.com/review/rw4152853",
      "warningSpoilers": false,
      "date": "3 May 2018",
      "rate": "9",
      "helpful": "173 out of 215 found this helpful.",
      "title": "Pixar has created a masterpiece of cinema",
      "content": "I'm no critic, but Coco is close to movie perfection. It definitely deserved the Oscar for Best Animated Feature, no doubt, and is by far the best animated movie ever created. The visuals are stunning, the characters are fantastic, the twist is somewhat predictable but still great, and the story is so touching. This is the best film I have ever seen, over Shawshank, over The Godfather, over The Matrix; this film is a godlike creation from the very, very best of cinema. Do not be fooled by the haters who say it is a poor portrayal of a tradition; the tradition is likely far more beautiful in Coco than in real life. Fantastic, I am blown away."
    },
    {
      "username": "namashi_1",
      "userUrl": "https://www.imdb.com/user/ur8503729",
      "reviewLink": "https://www.imdb.com/review/rw4066588",
      "warningSpoilers": false,
      "date": "18 February 2018",
      "rate": "9",
      "helpful": "44 out of 59 found this helpful.",
      "title": "A Pure Delight!",
      "content": "Pixar has done it AGAIN! 'Coco' is a yet another delightful ride from the prolific animation studio, who's winning streak seems to never end. And that's good for all, since 'Coco' is all heart & soul, rewarding the moviegoer wholeheartedly.'Coco' Synopsis: Aspiring musician Miguel, confronted with his family's ancestral ban on music, enters the Land of the Dead to find his great-great-grandfather, a legendary singer.'Coco' captures the themes of Life & Death, with genuine feeling. Themes of family, passion, defeat & redemption also are explored here, but with humor & real emotion. While I laughed for a good share of this winning story, I also found myself weeping in the film's final-act. This is a true fantasy-adventure, that gives life & death true meaning. Adrian Molina & Matthew Aldrich's Screenplay is excellent. Lee Unkrich's Direction is colorful. And of course, the Animation is extraordinary. 'Coco' unfolds gorgeously & not for a second, does the pace drop.Vocal-Performances are top-notch! Anthony Gonzalez as Miguel, the protagonist, is a joy, Gael García Bernal s Héctor Rivera, a charming trickster in the Land of the Dead, Benjamin Bratt as Ernesto de la Cruz, the most famous musician in the history of Mexico and Miguel's idol & Ana Ofelia Murguía as Mamá Socorro \"Coco\" Rivera, Miguel's great-grandmother, stand out. And yes, this is a Film made in America about Mexicans & their tradition. Take That, Mr. President!On the whole, 'Coco' deserves all your time & money. Don't Miss It. Oscars, are you ready?"
    },
    {
      "username": "morrison-dylan-fan",
      "userUrl": "https://www.imdb.com/user/ur5424352",
      "reviewLink": "https://www.imdb.com/review/rw4309734",
      "warningSpoilers": true,
      "date": "28 August 2018",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Celebrating the Day of the Dead.",
      "content": "With a friends daughter having a birthday soon,I looked for a DVD to pick up that they would all enjoy. Having heard praise about this film over the last few months,I was pleased to see that it had come out on disc, leading me to meet Coco.View on the film:Setting the record as the longest PIXAR film in production from 2011-2017, co-writers/(with Jason Katz and Matthew Aldrich) directors Lee Unkrich & Adrian Molina remarkably keep any sign of production woes off-screen with a dazzling array of colourful animation. Playing the first notes of Miguel preparing for the Day of the Dead with his family, the directors give the CGI a rich pastel appearance, highlighting the earthy, family connections the event celebrates. Crossing over to the Land of the Dead, the directors show a stunning advancement in CGI with gliding shots along the glittering Land and detailed character designs bringing emotions out of the skinless figures.Whilst the strings are made of the traditional Disney message of family being important, the writers find new melodies, with the use of songs spanning generations of families laying the dimensions of each character, from Miguel learning that family is part of the tapestry of his life,to Héctor looking back at everyone he ran away from. Getting Miguel changed after showing his singing talents, Anthony Gonzalez gives a splendid performance as the lively Miguel, whilst Gael García Bernal's gives a smooth melancholy to Hector's fears of being forgotten by Coco."
    },
    {
      "username": "Charliedog2015",
      "userUrl": "https://www.imdb.com/user/ur32837247",
      "reviewLink": "https://www.imdb.com/review/rw4130315",
      "warningSpoilers": false,
      "date": "15 April 2018",
      "rate": "10",
      "helpful": "180 out of 205 found this helpful.",
      "title": "Heartbreakingly beautiful. Surpasses Up and Inside Out",
      "content": "Coco is about Dias de las Muerte (Day of the Dead), family, family crises and musical passion. The posters have a boy and an adult skeleton capering through the afterlife. So you can know that upfront, Pixar is going to fully deal with the subject of death that it touched upon I UP and hinted at in the death of childhood innocence in Inside Out.We were subtly forewarned that tissues would be needed. :)It surpasses the other aforementioned masterpieces by being more relatable, drawing on family restrictions and prohibitions (e.g. \"there will be no X in this family!\" X being \"instead whatever has caused pain to a family member in the past\". Pick your poison my reader). It surpasses them in making death tolerable. It reminds us that we should be mindful and respectful of all those who went before us. Most of all it taps on the shoulder and whispers that the temporal, the world we live in, in just as important as the next one and we should strive to keep family bonds strong. For when we're at the end of our rope, who else is there to pull us up?Did I mention bring Kleenex? A full box. Even hard core macho men are driven to quiet sobs and immediate phone calls to mothers and fathers telling them \"mama, I miss you.\"Beautiful."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw4040539",
      "warningSpoilers": false,
      "date": "22 January 2018",
      "rate": "10",
      "helpful": "22 out of 29 found this helpful.",
      "title": "It is absolutely a celebration of a lifetime",
      "content": "Have always loved Pixar, and really like to love most of their films (all three 'Cars' films and 'The Good Dinosaur' are my least favourites, and although the second 'Cars' had a lot of problems for me the third one is the only less than average one).As for favourites, they are all three 'Toy Story' films, 'Inside Out' and 'Up', love 'Wall-E' and 'Finding Nemo' as well. After seeing 'Coco' yesterday, hearing nothing but great things about it and seeing the near-universal critical acclaim, from personal opinion (and many others it seems) it is right up there with the Pixar masterpieces. Would go as far to say it is easily their best since 'Inside Out', which is saying a lot since the films between that and this were lesser Pixar efforts (enjoyed 'Finding Dory' though, though it is a long way from being one of Pixar's best).'Coco' is one of the longest Pixar films, clocking in at nearly two hours, but it sure didn't feel like it. Seeing it in the cinema, the audience was a quite large one, if on a side note not as many as thought. With it being a family film, the weekend and that it was only released three days ago, part of me was thinking it would be sold out. Throughout everybody, children and adults alike, was laughing, in awe and crying. It is also a different Pixar film, with a unique setting and that it is more music/song-oriented, and has replaced 'Inside Out' as their most mature and in depth, with themes that are remarkably daring and relevant.Lets talk about what is so brilliant about 'Coco'. The film is a triumph when it comes to visuals, one of Pixar's best-looking easily. The animation throughout is absolutely spectacular, whether in the real world or the Land of the Dead. The colours are so vibrant and atmospheric and there is so much gorgeous detailing in the backgrounds, nuances in the way the characters look and the skeletal designs and movements have amazing dexterity that is both clever and ghoulish.Just as triumphant is the music. Michael Giacchino's score is one of his best and most multi-layered, capturing the spirit of Mexico in a way that's celebratory. The songs are similarly infectious, \"Remember Me\" is not just a beautiful song but it has a great, upbeat message and adds a lot to the story.The writing has so much spirit, poignancy and entertainment value. The jokes are sophisticated and amusing, neither childish or repetitive to me and Dante is both adorable and funny, and the emotional elements are truly heartfelt, especially in the last act. The story is bright and breezy in pacing, despite the fairly long length one doesn't feel it. The Mexican culture and family values were clearly comprehensively researched and the film feels like a warm, fun and heartfelt tribute and celebration to culture, family, music and even Latino cinema in the Golden Age (the latter proving crucial to the revelation of a major plot twist).Not since 'Inside Out' has a Pixar film made me laugh and bring tears to my eyes as much as 'Coco' did, not since 'Paddington 2' has a film's ending leave me sobbing. The relationship between Hector and Miguel has a huge amount of heart and complexity, one can understand the point of view of the Rivera family (living and dead) and the macabre elements are very imaginatively realised. The twists in particularly the last act keep coming, mostly unexpected and all very clever. Some elements of the reveal with Ernesto were not that surprising (Pixar have done similar and it is fairly clichéd, my one slight criticism with 'Coco' but found it easy to overlook) but none of it was guessable too early and it was extremely well done and tense regardless.All the characters are fully formed and have strengths and flaws. Hector was the most fully rounded and provided the most heart and a lot of us are likely to find ourselves in Miguel and his aspirations. Imelda is also memorable as a character and the chemistry between all the characters is realised beautifully too. Voice acting is first rate, especially the remarkably multi-faceted contribution from Gael García Bernal as Hector. Anthony Gonzalez also voices with spirit and emotion, Alanna Ubach achieves a balance to Imelda of not wanting to get on the wrong side of her and having a caring side and Benjamin Bratt shows a side that one is surprised is in him. In summary, truly amazing and a celebration of a lifetime. One of the most deserving recipients of a perfect score in a while. 10/10 Bethany Cox"
    },
    {
      "username": "p-35646",
      "userUrl": "https://www.imdb.com/user/ur116000181",
      "reviewLink": "https://www.imdb.com/review/rw5664609",
      "warningSpoilers": false,
      "date": "22 April 2020",
      "rate": "10",
      "helpful": "25 out of 29 found this helpful.",
      "title": "love it",
      "content": "Like the culture of the dead embodied in the film, they worship the dead without sadness, and even sing and dance, singing and laughing, to commemorate the reunion with the deceased family members gathered together. Before I was afraid to hear and see and spirit, ghost related topics, those words in my impression is associated with terror, but let me after seeing this film has the different understanding to the dead, people become dead still have colorful life after death, have relatives, friends, there are joys and sorrows, is no longer so afraid of death. As long as the world remembers, it will still exist in this world, only when the world is completely forgotten, that is, when you no longer have anything to do with the world, will be turned into a golden powder, facing real death"
    },
    {
      "username": "Calicodreamin",
      "userUrl": "https://www.imdb.com/user/ur29385135",
      "reviewLink": "https://www.imdb.com/review/rw5099000",
      "warningSpoilers": false,
      "date": "4 September 2019",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Absolutely lovely",
      "content": "Everything about this movie is wonderful. The characters, the meaning, the songs, the cinematography, the storyline. An absolutely lovely movie. Even as an adult, or perhaps because, I cried at the ending. Such love and such joy."
    },
    {
      "username": "mryohual",
      "userUrl": "https://www.imdb.com/user/ur81759648",
      "reviewLink": "https://www.imdb.com/review/rw3845362",
      "warningSpoilers": false,
      "date": "27 October 2017",
      "rate": "10",
      "helpful": "1,026 out of 1,153 found this helpful.",
      "title": "Gracias Pixar",
      "content": "Im Mexican and all i can say is Thanks you Pizax,I just saw this movie and i just remembered all my childhood with my grandparents, Mexico was represented beautifully,the music, the colors. This movie touched me in my soul and i cried a lot, i created an account just to say how good pixar made everything, again gracias pixar por tan hermosa pelicula."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6210634",
      "warningSpoilers": false,
      "date": "27 October 2020",
      "rate": "9",
      "helpful": "16 out of 22 found this helpful.",
      "title": "Riotous Rocking Resurrection & Insurrection...",
      "content": "An absolutely spectacular animation, story and message that's appropriate for all ages, persuasions, dogmas, societies and cultures - universal you might suggest. If you're looking to take ninety five minutes and turn it into what will feel like no time at all, then this delightful, endearing, engaging and sincerely beautiful story about a young boy trying to establish his direction in life amongst the backdrop of the Día de Muertos in Mexico is just for you, because its just for everybody! although dogs might love it too."
    },
    {
      "username": "bradinhanson",
      "userUrl": "https://www.imdb.com/user/ur42370094",
      "reviewLink": "https://www.imdb.com/review/rw4159836",
      "warningSpoilers": false,
      "date": "9 May 2018",
      "rate": "9",
      "helpful": "91 out of 131 found this helpful.",
      "title": "Why I believe it deserves a 10",
      "content": "Pixar has come a long way. To them their creations have become a science into human emotion and I don't know any better company that has nearly perfected the craft. Soon they'll have 10's across the board from music to picture and from story to the characters. Never have I seen that more than in the movie WALL-E. This movie is up there. More than just its basic elements it dared to dive into a culture that very few in the world know about. It went above and beyond in research in getting those in Mexicos stamp of approval. It touches a deeper recess of the heart where the soul lies dormant and awakens it with hope and optimism. It takes the differences we often critique and judge upon another group only for Pixar to place a mirror right in front of us and stare at our own reflection. It takes the common elements so as to identify with the characters and stir a feeling of commonality. It's brilliant and ingenious. These things alone give it an 8. The 10 is because it was bold and dared to go places other won't. In this I found originality. Something you don't see often these days. Best part of all it unified. It takes ones thick skull (pun intended) and supplies human emotion as the medium to communicate the message so as to reach the heart. One may call that manipulation but due to its sincere true message and goodness I humbly give it a 10."
    },
    {
      "username": "mjp0117-26-143834",
      "userUrl": "https://www.imdb.com/user/ur25712815",
      "reviewLink": "https://www.imdb.com/review/rw4383002",
      "warningSpoilers": false,
      "date": "7 October 2018",
      "rate": "10",
      "helpful": "30 out of 37 found this helpful.",
      "title": "The most beautiful movie.",
      "content": "I've been trying to get my kids to watch this for a year. They were never interested. Finally, it was my turn to pick. The whole family was in awe. It was colorful, imaginative, and the story was beautiful. That kid who boxes Miguel is amazing. It got me thinking we should start celebrating Dia de los Muertos."
    },
    {
      "username": "ethanbresnett",
      "userUrl": "https://www.imdb.com/user/ur114450253",
      "reviewLink": "https://www.imdb.com/review/rw7032993",
      "warningSpoilers": false,
      "date": "15 June 2021",
      "rate": "8",
      "helpful": "4 out of 4 found this helpful.",
      "title": "It really is as good as they say!",
      "content": "Coco is a very special Pixar film. Just a very special film in general Pixar or otherwise.The central theme of this film is family, and it is explored in such a beautiful and poignant way. The plot is so meaningful and emotional, while keeping that typical Pixar charm and joy. It moves along at a great pace and always has something going on.We are treated to a great selection of characters, all of whom are voiced and acted impeccably.The theme and setting of this film is also so fantastic. The concept of the afterlife is explored perfectly, and has so much imagination and wonder in it. The culture of Mexico is so wonderfully explored. Plenty to enjoy for kids and adults alike.It's worth noting as well that the colour in this film is spectacular. It is beautiful to look at and the direction and animation are faultless.The setting of the film also gives us a brilliant score which is a joy to listen to. Everything about this film just clicks and works perfectly.Added to all of this is the hugely emotional ending of this film which brought me to tears! A great and heart warming ending to a fantastic film.Sensational!"
    },
    {
      "username": "andreachaparra",
      "userUrl": "https://www.imdb.com/user/ur53374258",
      "reviewLink": "https://www.imdb.com/review/rw4157621",
      "warningSpoilers": false,
      "date": "8 May 2018",
      "rate": "10",
      "helpful": "122 out of 142 found this helpful.",
      "title": "Love it",
      "content": "As a Mexican born child I cried when I saw this movie and my son who is American born with Mexican parents loves it too.. love to teach him about our roots"
    },
    {
      "username": "inxsfett",
      "userUrl": "https://www.imdb.com/user/ur25380783",
      "reviewLink": "https://www.imdb.com/review/rw3843212",
      "warningSpoilers": false,
      "date": "28 October 2017",
      "rate": "9",
      "helpful": "149 out of 241 found this helpful.",
      "title": "\"An Respectul Tribute to Mexican Culture and his People\"",
      "content": "All my family waiting this movie all the year since we see the teaser and blow up...and more because was a Pixar movie and they all make right all the movies they make (at least the 80%).And Jesus we all not disappointed at all...The music,the animation,the characters,the colors,the family...everything was just perfect.Now being a Mexican born a was worried that Pixar takes so many liberties of the Mexican culture,people,music and more...But that didn't happen they took all the things i mention before and converted in one of the best animated pictures i ever see and make me even more proud to born Mexican.I know you all the see the trailers and teasers and know how the movie it is but NO...the movie have a great twist and surprises that gonna make you love the movie even more...Like i say before everything in the movie is just perfect and one i have to say is that PIXAR portrait The day of the Death (dia de los muertos) very accurate and with a lot of respect.Just see it...you gonna love it Pixar make another classic movie to they collection and Mexican people of all the world...You be pride to be what you are!"
    },
    {
      "username": "ilias-zournatzis",
      "userUrl": "https://www.imdb.com/user/ur56991789",
      "reviewLink": "https://www.imdb.com/review/rw4067024",
      "warningSpoilers": false,
      "date": "19 February 2018",
      "rate": "10",
      "helpful": "77 out of 91 found this helpful.",
      "title": "Overwhelmed!",
      "content": "I'm a 24 year old student who sometimes tends to overthink about the values of life and how one, including myself, expresses these kinds of thoughts through every form of art that tells a story. So as a person that really puts his soul to a movie he watches I have to say that this film is one of the most beautiful things I've ever had the pleasure of witnessing.Coco does a fantastic job of capturing the viewer from the first moment. It cleverly captures the beauty of the \"Day of the Dead\" tradition, by unfolding one of the most heartwarming stories I've ever seen in a movie, around it. The film features a young Musician called Miguel and the pursuit of his dream of being a musician against his family's approval. Throughout the movie while Miguel engages in an adventurous journey through the land of the dead, he is caught between the love he has for music and the importance of family bonds. Quiet a simple and pretty well covered subject. Somehow, Coco manages to so simply and beatifully capture the essence of what it means to be human. What it means to love and what it means to have passion for the things and the people you love. The story was told in such an elegant way that it didn't make me think about the values it represented, but instead it made me feel them, without me even analysing what I was watching. It did it so gradually that at some point near the end I was so overwhelmed by a scene, which definetely goes to my \"top 10 best movie scenes\" list, that I caught myself crying. Not tearing up like I usually do when a scene touches me. Actually crying.I could go on and on about Coco, but I'll leave with saying that this is a fantastic movie and I honestly feel grateful that I had the chance to watch it.A must see!!!"
    }
  ],
  "errorMessage": ""
}