{
  "imDbId": "tt1392214",
  "title": "Prisoners",
  "fullTitle": "Prisoners (2013)",
  "type": "Movie",
  "year": "2013",
  "items": [
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw7316428",
      "warningSpoilers": true,
      "date": "7 September 2021",
      "rate": "10",
      "helpful": "159 out of 174 found this helpful.",
      "title": "Excellent but not for all audiences",
      "content": "A few words of warning about \"Prisoners\" before you try watching it. It's a very intense, violent and disturbing movie to say the least. While it is ranked #190 on IMBD's Top 250, it's NOT a film for everyone. . I mention this just to warn you...to think about this before you watch.As for me, while this isn't the sort of film I normally would watch, it's one I decided to see because it stars Jake Gyllenhaal. He's an actor who takes lots of risks and has appeared in many unique films which I enjoyed, such as \"Source Code\", \"Nightcrawler\", and \"Donnie Darko\". In fact, I cannot think of any conventional movies he's made...and you know you're in for a few surprises when you see his films...and this definitely is no exception.The story begins with two families having a dinner party. However, partway through the evening, the parents notice that the two youngest kids are gone. Where could they be?! The search the neighborhood but find no trace. The only clue is a tenuous one...a beat up RV was seen parked nearby.The police soon locate the RV and the driver. Instead of exiting the vehicle when the police order him out, he tries to run and is soon apprehended. It seems very likely the guy knows SOMETHING but since there's no real evidence, the police are forced to let him go. Unfortunately, the father of one of the abducted girls (Hugh Jackman) isn't going to let this go....and he abducts the man and keeps him prisoner...trying to get information from him. This portion is not for the squeamish.In the meantime, Detective Loki (Gyllenhaal) has found leads on two other suspects. One is a priest with a corpse in his basement. Another is a freak who likes to buy childrens' clothing and who was first noticed at a vigil for the girls. He won't talk but keeps drawing mazes for the police....mazes that look like the necklace found on the corpse...and mazes which were mentioned by the man in captivity to his captor! All three are obsessed with mazes...so what has this to do with the missing girls?!The best thing about this film is that the screenplay is impossible to predict. If anyone tells you they could predict it, they're lying! Seriously! I appreciate a film that keeps me guessing and this one sure did. As for the acting, with Jackman and Gyllenhaal it's of course excellent. Overall, an amazing film...and an amazingly hard one to watch as well. It's certainly NOT for the squeamish!"
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw3027417",
      "warningSpoilers": false,
      "date": "2 June 2014",
      "rate": "10",
      "helpful": "323 out of 364 found this helpful.",
      "title": "More than just one meaning",
      "content": "If you think of someone being a prisoner, you automatically might think of someone behind bars. But apart from a physical prison, a prisoner can also be trapped mentally, either by his own doing or by someone else. This movie that starts off pretty light gets very heavy. And it is carried by its actors. Gyllenhalls characters might seem odd and out of place at the beginning, even like a cardboard cutout. But he does have more to do as the movie progresses.Still front row seat is Hugh Jackman. And while some might argue that a female should have a bigger role in this, you only have so much time to tell a story. And this is perfectly told and cut together. It might not fit your description of entertainment (and I don't think the filmmaker would love it described as such), but the movie is really great. If you like dramas in general you should be cherishing this .... and you will.We have a few grey areas that we visit and the ending did not satisfy everyone (I know from friends). But the movie could not have ended any other way (in my book). Superb movie one of the best released in 2013"
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw3692621",
      "warningSpoilers": true,
      "date": "24 April 2017",
      "rate": "9",
      "helpful": "58 out of 63 found this helpful.",
      "title": "Hard to Watch but Really Well Done",
      "content": "Two very good actors ply their trade very well. Jake Gyllanhaal plays a policeman who is utterly driven in his quest to find two kidnapped little girls. Hugh Jackman plays a survivalist who \"prays for the best but expects the worst.\" During Thanksgiving dinner, two little girls go up to a rusty old RV and shortly thereafter, disappear. The prime suspect is a mentally handicapped young man, the driver of the RV. But the girls are nowhere to be found. He is held for 48 hours and then released. It is then that Jackman takes matters into his own hands. He kidnaps the young man and, convinced he knows everything, tortures him and beats him for days. Meanwhile, another suspect arises but Jackman can't handle this and keeps pounding away. There are numerous twists and turns that seem to work well. Gyllanhaal is a troubled guy himself who has some anger issues that he keeps under wraps. I had not heard of this film and it was a treat to view it."
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw2909383",
      "warningSpoilers": false,
      "date": "21 November 2013",
      "rate": "",
      "helpful": "49 out of 56 found this helpful.",
      "title": "Wonderful Mystery That Keeps You Guessing Till the End",
      "content": "Prisoners (2013) **** (out of 4) Incredibly well-made and intense mystery about two little girls who go missing and the detective (Jake Gyllenhaal) put on the case to find them. When the original suspect (Paul Dano) is let go, one of the girl's father (Hugh Jackman) decides to take justice in his own hands. I really had high hopes going into PRISONERS and my expectations for a great film were met but I must admit that it wasn't anywhere near the type of great film I expected. A lot of thrillers these days are limited on talk and emotions and instead we just get one big, staged action scene after another. That's certainly not the case here because the film takes its time (153-minutes) telling its story and there are so many quiet moments where we just see the characters losing their grip and emotions as they try to make sense of not knowing where these two girls are. What really pushes the film over the edge are the terrific performances with Jackson leading the way in what's the best performance I've seen from him. This isn't your \"loving\" father in the traditional sense. Instead he's someone quite scary from the first time we see him and we see how much worse he gets as the picture goes along. While on one hand you sympathize with his situation, on the other hand you really can't support what he's doing and often wonderful about his own involvement in things. Jackman really comes off like a man full of emotion and rage and he just doesn't know how to properly let it out. The anger he shows throughout the film is something so raw that you really do feel as if you're watching a man who has a daughter missing. Gyllenhaal also deserves a lot of credit for the way he played the detective role. I really loved the various obstacles that his character gets put through and especially the own weakness and at times stuck-up approach. The supporting cast includes wonderful performances by Dano, Melissa Leo, Terrence Howard, Maria Bello and Viola Davis. The screenplay isn't going to give you a lot of easy answers and there are many times where you hate the lead characters and can't find anything in them to root for. I thought it was quite brave that the film was willing to take so many chances and it asks the viewer to ask themselves many questions about how they would react to what's going on. I can't say I agreed with all the choices but it's great that a film actually makes you think as that's something quite rare these days. PRISONERS isn't exactly an \"enjoyable\" film as it has you feeling dirty throughout the running time but if you stick with it the thing is certainly very rewarding."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw3869558",
      "warningSpoilers": true,
      "date": "28 November 2017",
      "rate": "9",
      "helpful": "54 out of 62 found this helpful.",
      "title": "\"Finish all the mazes and you can go home.\"",
      "content": "I didn't realize until I came to some of the reviews for this movie that it was two and a half hours long. It didn't seem like that while watching as one gets so engrossed in the story that time manages to fly by pretty quickly.I thought the plotting for the film was nearly flawless. The one thing I found exception to was when Detective Loki (Jake Gylenhaal) got distracted by the phone call from the department store clerk, he left Keller Dover (Hugh Jackman) in the abandoned house and never bothered to return in a timely fashion. He had pretty good instincts about something going on there, so a quicker follow up would have been expected.Otherwise, I thought the screenplay and director Denis Villeneuve crafted an intricately weaved mystery surrounding the missing girls, with an abduction history going back a quarter of a decade. Those who find Keller's kidnapping of Alex Jones (Paul Dano) distasteful and his subsequent beating of Alex brutal, I'd have to agree that it was beyond the pale for a movie treatment. The beating part anyway. You could understand the man's frustration, but having no success in getting any information, he should have backed off long before he did.But even that part of it was handled well. Loki conceded to Grace Dover (Maria Bello) that her husband would probably go to jail, so there was no getting around the idea that Keller would get away with what he did. For his part, Gyllenhaal displayed another nuanced character in Detective Loki, just about a hundred eighty degree turn from his depiction of news gatherer Lou Bloom in \"Nightcrawler\". There were times he showed remarkable restraint dealing with Keller, making me think about the way cops in real life situations have to hold back on their emotions when dealing with distraught victims of a crime. He and the rest of the supporting cast put in very credible performances."
    },
    {
      "username": "YJLcool",
      "userUrl": "https://www.imdb.com/user/ur34627686",
      "reviewLink": "https://www.imdb.com/review/rw2873696",
      "warningSpoilers": false,
      "date": "22 September 2013",
      "rate": "8",
      "helpful": "426 out of 503 found this helpful.",
      "title": "a gritty, incredibly well-acted, suspenseful, thought-provoking crime drama thriller",
      "content": "Prisoners is a gritty, incredibly well-acted, suspenseful, thought-provoking crime drama thriller. The film mainly focus on the choices taken and the consequences faced by the characters when worst things happen to them.It simply raises the question: When your kid's life is at stake, how far are you willing to do to protect your family? It explores the likelihood of human behaviour when such crime is happening to us, blurring the lines between good and bad people.For a 153 minute movie, the story does unfolds at a slow and solemn pace (which hurts the film and might bore some audiences) but the dramatic scenes performed by the main cast members in the film will keep you engaged. Hugh Jackman and Jack Gyllenhaal both giving intense, Oscar-worthy performances here, defining and developing their characters with various layers of emotions: affection, anger, grief, empathy, guilt...throughout the film.The film's atmosphere, heavy rains, stormy days and icy cold winter managed to create a dark, dreadful environment to make up the dreary and haunting mood in the film. Every violent action taken by the characters are acts of desperation given that they are running out of time.However, the film is not perfect. Despite some plot problems from the various twists and turns shown in the film, the superb performances from the casts was sufficient enough to make the story succeed and believable.Highly recommended for those who wanted to watch a serious drama thriller with powerful, engaging acting performances from its talented casts.http://yjcool.blogspot.com/2013/09/movie-review-prisoners.html"
    },
    {
      "username": "ClaytonDavis",
      "userUrl": "https://www.imdb.com/user/ur2898980",
      "reviewLink": "https://www.imdb.com/review/rw2871047",
      "warningSpoilers": false,
      "date": "17 September 2013",
      "rate": "8",
      "helpful": "380 out of 483 found this helpful.",
      "title": "'Prisoners' is a tightly wound thriller featuring career bests from Hugh Jackman and Jake Gyllenhaal...",
      "content": "There is a sensitivity that Director Denis Villenueve and writer Aaron Guzikowski inhabit in bringing their newest film \"Prisoners\" from Warner Bros. to the screen. Starring an Academy Award nominated cast that includes Hugh Jackman, Jake Gyllenhaal, Terence Howard, Maria Bello, Viola Davis, Oscar-winner Melissa Leo, and Paul Dano, this is a smartly constructed and emotionally resound mystery thriller that is thoroughly enjoyable.The synopsis is fully in the trailer. When two young girls go missing, one belonging to Keller and Grace (Jackman and Bello), the other to Franklin and Nancy (Howard and Davis), a hot-shot detective (Gyllenhaal) is assigned to the case and relentlessly tries to find the clues that could lead to the whereabouts of the missing. When a mentally handicapped Alex Jones (Dano) is found near the scene of the disappearance with no hard evidence, Keller takes matters into his own hands.I have to say that I've never been this hypnotized with the works of Hugh Jackman and Jake Gyllenhaal. Jackman, who is fresh of his inaugural nomination for Tom Hooper's \"Les Miserables\" has capitalized in a massive way. Approaching his character with the ferocity that made him a star in the \"X-Men\" franchises, he hammers his way into every scene, keeping the audience guessing about their own moral complexities. He tears into scenes in a way we've never seen him and layers his character with plenty of affection, empathy, grief, and rage. It's his best dramatic endeavor he's ever done.When it comes to Jake Gyllenhaal, many, and probably for the right reasons, gravitate towards his work in Ang Lee's \"Brokeback Mountain\" as his shining moment in film history. I believe he's gone deeper in works like \"Jarhead\" and \"Zodiac\" but those were just the surface of what he can do as an actor. As Detective Loki, Gyllenhaal stands firm and tall in one of the year's finest performances. Terrifically executed as a man disconnected from real emotion, he finds himself enamored by the mystery surrounding two missing girls. He also orchestrates character beats and ticks that's reminiscent of Joaquin Phoenix's towering work in \"The Master\" last year.What is very refreshing in the film is it offers a great reminder of how brilliant an actor Terence Howard is. The Oscar-nominated actor seemed to fall by the wayside following his nomination for \"Hustle and Flow\" in 2006, coincidentally the same year Gyllenhaal snagged his first, and now has realized his capabilities when he chooses more dynamic and passionate characters. In a film that centers around his involvement, Paul Dano doesn't have too much to offer but is completely adequate in form.The film however is not entirely perfect. Aaron Guzikowski's depth screenplay offers a great mystery story, full of twists and turns, all the bit a tad predictable, but that's not where he falters so much. His construction of the female counterparts, Maria Bello, Viola Davis, and Melissa Leo, are not as crisply or smoothly put together as I'd like them to be. They each have one \"scene\" that gives us their character's motivation and the look into their cinematic psyche however, some are thrown in quite lazily and manages to halt the story in spots.The film's technical merits all rise to the abilities of its cast. Roger Deakins, the most overdue Cinematographer in the business, captures stunning portraits of conversations, weather, and scenes that continue to prove his brilliance in the film world. The film's score is masterfully placed by Jóhann Jóhannsson while Joel Cox and Gary Roach edit the film to an impeccable pace. At 153 minutes, the film is detailed, precise, and engaging nearly throughout. I feel there's a shorter cut of the film that would surely be a Best Picture nominee for this year's Academy Awards if it existed. The film could still garner that support with what they have now, but I think there are aspects of the film members won't be able to get around. A high level of violence and torture scenes infused with a longer run time could keep people at a distance. One thing that can't be denied is the towering works of Hugh Jackman and Jake Gyllenhaal. The two have offered plenty of memorable performances in their filmography, but their work in \"Prisoners\" is cut and clear their best they've offered.\"Prisoners\" is a magnificent achievement for the film year. Thorough, enigmatic, and purely amazing. A must-see for the movie lovers.The film opens in theaters this Friday, September 20."
    },
    {
      "username": "Diablo1616",
      "userUrl": "https://www.imdb.com/user/ur108361571",
      "reviewLink": "https://www.imdb.com/review/rw5583031",
      "warningSpoilers": false,
      "date": "27 March 2020",
      "rate": "8",
      "helpful": "25 out of 27 found this helpful.",
      "title": "One of the most chilling thriller movies I have ever seen.",
      "content": "\"Prisoners\" is rich in compelling narratives and stellar performances from the ensemble cast. This movie had me love and hate Hugh Jackman's character which was so complex to the point of making me question my moral standards because I found myself empathizing with his character. On the other hand, Jake Gyllenhaal did a marvelous job on playing the frustrated cop: complete with all the intensity of his eyes and his intuition. While Gyllenhaal had more screentime as the lead, Jackman's performance really stood out for me.This film doesn't use jumpscares (often precluded by suspenseful music to build-up the tension and are often abused in this genre) in order to thrill the audience, but rather, moments of silence and stillness. Its calm and cold vibe stirs up the kind of anxiety it wants its audience to feel, and naturally, the audience would want to get rid of that uneasiness by knowing what's going on, thus, cleverly forcing them to watch the entire film which runs about 2 hrs and 33 mins.The director, Denis Villeneuve, incorporates his \"less is more\" style of using soundtracks in this movie (just like what he did with Blade Runner 2049) to emphasize the scenes, especially with the ending (heavens know how much I liked that ending). It's not rocket suspense but the simplicity of it makes your mind wander to other possibilities which I think is often a good indication of a brilliant film since it's open for other interpetations.However, one thing that won't make me rate this a perfect 9 or 8 is the fact that I'm not entirely convinced on the motivation of the antagonists for doing the things they did. It felt a bit rushed (for the lack of a better word) and while it makes sense, it doesn't leave me satisfied"
    },
    {
      "username": "Potty-Man",
      "userUrl": "https://www.imdb.com/user/ur2691652",
      "reviewLink": "https://www.imdb.com/review/rw2872778",
      "warningSpoilers": false,
      "date": "20 September 2013",
      "rate": "10",
      "helpful": "703 out of 848 found this helpful.",
      "title": "A brilliant masterpiece of atmosphere and suspense",
      "content": "This was one intense movie-going experience. Throughout the entire running time of the movie, the suspense never lets up.The director masterfully weaves the haunting atmosphere, and I was at the edge of my seat. The plot is a wonderful puzzle, unraveling slowly to reveal hidden layers of depth and complexity. The acting was wonderful, emotional and nuanced, with some unforgettable moments (The two leads - Gyllenhaal and Jackman - give their career best performances, but the biggest achievement in my opinion is Paul Dano's). The musical score contributes to a sense of dread, as well as the rich sound design and the chilly color palette of the breathtaking cinematography.All those parts add up to a rare, gut-wrenching, dark and fascinating masterpiece - the kind that lingers with you long after the credits roll."
    },
    {
      "username": "gregsrants",
      "userUrl": "https://www.imdb.com/user/ur1598260",
      "reviewLink": "https://www.imdb.com/review/rw2866056",
      "warningSpoilers": false,
      "date": "9 September 2013",
      "rate": "8",
      "helpful": "179 out of 242 found this helpful.",
      "title": "Jackman Shines in Villeneuve Classic",
      "content": "Prisoners, the new film from Canadian director Denis Villeneuve (Polytechnique), is a top notch nail-biting crime-drama that is as good a theatre as modern Hollywood has the ability to produce. Hugh Jackman and Maria Bello play the parental figures of the Dover family. They are your average hard-working blue-collar family who begin their story by visiting neighbours Franklin and Nancy Birch (Terrence Howard and Viola Davis) for a Thanksgiving dinner. The Franklins and the Dover's each have two children, the youngest of which (Anna and Joy) head out from their home on a November afternoon to play only to mysteriously disappear. Upon a frantic search, the Franklins and the Dover's suspect the worse. Especially when their elder children tell them of a mysterious camper that was parked just down the street. Police soon find the camper with Alex Jones (Paul Dano) behind the wheel. Alex has the mentality of a 10-year-old and tries fleeing when surrounded by authorities. But when Detective Loki (Jake Gyllenhaal) begins to interrogate Alex, he is less convinced that Alex was a part of the abduction. As days pass, Loki and Keller Doller work in opposite directions on the investigation. Keller is convinced that Alex Jones was a part of the abduction and kidnaps the frail and challenged Jones and tortures him for days in an attempt to extract answers. Meanwhile, Detective Loki follows leads that open up possibilities of a crime where multiple persons may be involved. And Oscar nominee Melissa Leo appears in a supporting but pivotal role that will assist in the closure.The trailer for Prisoners may have audiences hearkening back to Ron Howard's Ransom, but this is hardly the cookie-cutter kidnapping film that Mel Gibson lead back in 1996. Prisoners instead is an engulfing drama. One with a superb performance by lead Hugh Jackman that challenges how far someone would/should go in an effort to locate their stolen child. The script, from writer Aaron Guzikowski (Contrband) takes audiences down many different paths and emotional rides and Jackman's performance will have you rooting for his quest for answers even though his methods are unorthodox and highly illegal.The film is gritty and full of realistic characters and situations culminating in a perfect ending that goes 9/10ths of the way in giving its audience full closure. Not as much an edge-of-your seat thriller as it is a Zodiac type of crime drama where the stakes are the lives of two small children. Denis Villeneuve's last effort, Incendies, was nominated for an Academy Award for Best Foreign Film in 2011. Prisoners shows that he can move solidly into big star larger scaled films with the ease of a well worn slipper. And Prisoners catapults Villeneuve into not just a director to watch, but a director whose work should be awaited with palpable excitement.www.killerreviews.com"
    },
    {
      "username": "FilmMuscle",
      "userUrl": "https://www.imdb.com/user/ur18123905",
      "reviewLink": "https://www.imdb.com/review/rw2876517",
      "warningSpoilers": false,
      "date": "26 September 2013",
      "rate": "7",
      "helpful": "239 out of 317 found this helpful.",
      "title": "A True (and terrific) Exploration of Moral Ambiguity",
      "content": "Wow, what an intensely suspenseful film Prisoners was. The film commences with a naturalistic and peaceful look of a suburban neighborhood, leafless trees calmly swaying along with the cool air that encompass them. All is fine, and a perfectly normal family visits their friends/neighbors for a delightful dinner and some music. Everything is fine and dandy until both family's two kids run off to retrieve a toy they left outside. After pleasant conversation, the two families begin to realize that their kids haven't gotten back yet. The noiseless environment around them feels incredibly unusual, and once they realize that their kids have officially gone missing, chaos breaks loose. We are suddenly presented with a ruthless father (played by Hugh Jackman) who loves his daughter so much that he's willing to transcend any morally difficult obstacles to hopefully locate her. A spectacular cast, ranging from the likes of Hugh Jackman to Jake Gyllenhaal to Viola Davis and Terrence Howard, create such a chilling atmosphere that everyone in the audience immediately notices the discomforting subject matter as they prepare for a disturbing viewing. One should know prior to visiting the movie theater that this film doesn't feature morally perfect individuals. They are all human beings cast into an unbelievably frightening situation, and this is where larges amounts of debate will stir. There's one side of the audience that will persistently detest the characters' actions and the characters themselves, and there's the other side (which I am proudly a part of) that will essentially understand that people can't possibly (always) be the \"goody-two-shoes\" heroes, perceived in Hollywood blockbusters, in reality- that, by god, I will partake morally and ethically questionable activities to save a precious, loved one, absolutely! Such conversation/argument is healthy for it proves the memorability factor of the film itself. After you witness the terrifically-crafted picture, you will find enjoyment in discussing the movie's events with friends and family with- eventually- two sides forming over the talk. And holy crap is Hugh Jackman entirely convincing in his performance. You can see the longing to find his sweet, innocent daughter through his miserable eyes, filled with redness, desperation, and anger. Then, there's Jake Gyllenhaal as the second lead, playing an ambitious cop who holds a very impressive resume: no unsolved cases left under his plate. Can that mean his skill will greatly help in this predicament? On a similar note, Paul Dano takes the prize after Hugh Jackman for another wonderful performance. No offense or anything, but he completely fits into these immensely creepy and eerie roles. Speaking of, the soundtrack will definitely remain in that shocked mind of yours long after you've left the theater because it fills us with a sense of hopelessness and discomfort. At times, it sounds exceptionally ominous with the disconcerting sound of those violins in play. At others, it sounds like the music weeps for all those involved. The pace never seems to drag even though it clocks in at around 150 minutes as you remain at the edge of seat the entire time, utterly perplexed by everything that's transpiring and wholly befuddled by the choices that these people are making. The film will make you cringe and question the humanity of the participants or the competence of our law (that word could mean two things). Although I was slightly disappointed with the end result, the majority of the film strongly intrigued me. And, oh, how could I forget, the cinematography is simply amazing. Roger Deakins, the brilliant cinematographer behind last year's Skyfall, manages the camera-work of this film as well. As one wise critic said, a drive in the rain never felt so disquieting- a moment of foreboding. Furthermore, I would not recommend skipping out on Prisoners unless you're of the type that prefers more lighthearted and fun movies like The Avengers. If you love films that explore more than just entertainment and \"fun,\" such as important themes and moral ambiguity as a whole, you cannot go wrong with Prisoners. With a mix of top-notch cinematography, remarkably unsettling music, superb performances, and a thrilling/powerful story, Prisoners will definitely be one of this year's features that I'll surely be remembering. The true cinema season has started; now, let's hope every film from here on out delivers like this one did."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2917353",
      "warningSpoilers": false,
      "date": "5 December 2013",
      "rate": "8",
      "helpful": "16 out of 21 found this helpful.",
      "title": "good intense",
      "content": "Detective Loki (Jake Gyllenhaal) is searching for a child serial killer, and catches Alex Jones (Paul Dano) in an old RV. Meanwhile, Keller Dover (Hugh Jackman) and Franklin Birch (Terrence Howard) lose their daughters during a gathering. Loki has to let Jones loose, but Dover is not letting him go.Paul Dano always does a great creep. Jake Gyllenhaal does a capable cop, but I think he overacts sometimes. The interrogation room scene comes out of nowhere. I think that was a mistake. The big acting comes from Hugh Jackman. He's the key to this movie. It's possibly his best performance. He is intense without being melodramatic. What Keller Dover does in the movie is absolutely fascinating, and morally dangerous. I do wish the film go full out on that route. The film does let him escape morally a little too easily.Director Denis Villeneuve is a skilled Quebec filmmaker. He has fashioned a tight intense thriller. However, it resolves too neatly. It's a dirty dark movie. I'd prefer an ugly dark ending. Although I'm not going deduct any points for that."
    },
    {
      "username": "Prismark10",
      "userUrl": "https://www.imdb.com/user/ur4569900",
      "reviewLink": "https://www.imdb.com/review/rw2948830",
      "warningSpoilers": false,
      "date": "25 January 2014",
      "rate": "7",
      "helpful": "14 out of 18 found this helpful.",
      "title": "Loki the detective",
      "content": "I knew so little about this film before I watched it, I really thought at first it would be a Prison movie! The title is a metaphor.Prisoners has shades of Mystic River. It starts during the holidays in a small working town community where two young girls disappear believed to be abducted or worse.A suspect is found and later released by the police. One of the parent abducts and systematically tortures him.Meanwhile the detective assigned to the case methodically works the case and realises that this case may have links to the past.The film is long, harrowing in places and builds a lot of tension but it keeps you glued to the screen, that is no mean feat.It may have flaws with some convenient coincidences as well as some red herrings to keep you off track.Hugh Jackman is the father who takes the law into his own hands, aided by a more reluctant Terrence Howard who is the father of the other child that has been abducted.Jackman is the religious, hard working every-man whose raw anger threatens to tip him over the edge.Jake Gyllenhaal stands out with his tattoos as the methodical Detective Loki, he is more smarter than he looks.Roger Deakins moody cinematography adds a lot of atmosphere to this film which is very well acted by its ensemble cast."
    },
    {
      "username": "paulclaassen",
      "userUrl": "https://www.imdb.com/user/ur2263198",
      "reviewLink": "https://www.imdb.com/review/rw4218611",
      "warningSpoilers": false,
      "date": "28 June 2018",
      "rate": "9",
      "helpful": "22 out of 30 found this helpful.",
      "title": "Hugh Jackman at his very best!!",
      "content": "The entire cast is absolutely brilliant in their respective roles. Casting was perfectly done. This is the most serious I've ever seen Hugh Jackman and he does it so incredibly well that I hade goosebumps more often than not. From the plot to the execution thereof was brilliantly done to bring us an unforgettable, thrilling masterpiece. Be warned, though, as the film is quite disturbing at times."
    },
    {
      "username": "corrosion-2",
      "userUrl": "https://www.imdb.com/user/ur7024406",
      "reviewLink": "https://www.imdb.com/review/rw2872389",
      "warningSpoilers": false,
      "date": "20 September 2013",
      "rate": "9",
      "helpful": "154 out of 219 found this helpful.",
      "title": "Spellbinding",
      "content": "Prisoners is extremely suspenseful and equally disturbing. Canadian director Denis Villeneuve, whose last film was the equally spellbinding and disturbing Incendies, builds up the tension from the first frame and does not let up for the full 153 minutes of the movie. Aaron Guzikowski's script, though on the surface a child kidnapping thriller, bucks all Hollywood trends and, as well as being a taut thriller, poses serious moral issues. It also helps that the film has a first rate cast doing outstanding work: Hugh Jackman, Jake Gyllenhaal, Paul Dano, Terence Howard, Melissa Leo, Maria Bello and Viola Davis. Prisoners is not for the faint heated but is likely to feature strongly at next year's Oscars."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3804731",
      "warningSpoilers": false,
      "date": "13 September 2017",
      "rate": "8",
      "helpful": "18 out of 25 found this helpful.",
      "title": "Long in length and high in suspense and tension",
      "content": "That 'Prisoners' is directed by Denis Villeneuve, has cinematography by Roger Deakins and a music score from Johann Johannsson promised a big deal, having seen 'Sicario' and being blown away by its brilliance, especially in these areas. As did having a cast of talented actors such as Hugh Jackman, Jake Gyllenhaal, Paul Dano, Viola Davis and Melissa Leo.'Prisoners' almost lives up to the acclaimed hype with most of the film being absolutely exceptional, but doesn't quite make it. Its only major stumbling block is that it spirals out of control towards the end, the tension does slip, there are big lapses in credibility and characters' actions and morality issues become implausible and much less believable. Having been so impressed with the rest of the film, this was a real pity. Maybe it is a little overlong too.On the other hand, Roger Deakins shows again why he is one of the best contemporary cinematographers in the business with cinematography that's stunning and darkly gritty, also bringing out the visceral horror. The production values in general are impeccably audacious and deeply haunting and the editing is suitably stylish.Johannsson's music score is suitably ominous and pulse-pulsating, one can actually feel their heart beat with tension and anticipation.Villeneuve's directing has a beautiful darkness but also a hard edge that is perfect for the story.While the script is not quite as taut as that for 'Sicario', it does provoke thought and its unsettled nature hits hard. The story is not perfect, but a vast majority of it is nail-biting in tension, frightening in its suspense and very much edge of your seat. It is very violent and is not for the faint hearted because it is so vivid and the turn of events are unpredictable and devastating. It's deliberate in pacing but never dull, despite slacking towards the end.Characters are interesting, especially Jackman's increasingly unpredictable Keller Dover. You don't condone what he's done and his actions are extreme and one can sort of understand why he resorts to such drastic measures.Jackman is at his most hard-hitting, a shocking atypical performance that is among his best. Gyllenhaal is firm and understated, Dano is at his most unnerving and at times affecting and Terrence Howard gives one of the best performances he's ever given (showing that with the right material, like here, that he can be good).Davis and Leo, as to be expected, are outstanding, as is a poignant Maria Bello.In summary, 'Prisoners' may be long in length yet high in suspense and tension. It had all the makings of an exceptional film, and actually was for most of its running time, but that the ending disappoints as much it does it goes down to being a very good one. 8/10 Bethany Cox"
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw3016081",
      "warningSpoilers": true,
      "date": "15 May 2014",
      "rate": "7",
      "helpful": "13 out of 17 found this helpful.",
      "title": "Crime Story For Adults.",
      "content": "There is a scene in \"On Dangerous Ground\" (1951) in which half-crazy detective Robert Ryan is about to beat the living crap out of a suspect to gain information. Ryan's features twist into a pustule of hate, hardly human. \"Why do you DO it? Why do you punks make me DO it?\" And then he goes frantically to work.This is a a more complex story of the kidnapping of two little girls and the lengths to which the parents and police are willing to go to either retrieve the victims or find the bodies. But the most complicated character, the father who engages our interest because he instrumentalizes his grief and anger (Jackman), does more or less what Ryan does in the earlier film. He goes berserk, tramples on the law, and reduces a half-wit that he suspects to a bloody pulp.There are harmonies in the sometimes torpid story that I didn't quite get or wasn't sure of. There are ominous organ chords, a drunken priest who is a red herring, and references to penance. There's a candle light vigil for the girls. It's deep enough, even without any spiritual content. After all, when you get right down to it, the question raised by Jackman's tactics is: \"How far is it ethical to go in torturing a prisoner, even in a good cause?\" It's a medieval issue but recently a more contemporary one.It's a long movie -- too long, really -- and it could have benefited from more ruthless cutting, yet it all adds up. The director, Villeneuve, effectively captures the drab aspects of working-class life in one of those flat, brick, ranch-type residential neighborhoods on the outskirts of a small town in Pennsylvania, actually shot in Georgia.The acting is, well, hard to describe in a word but maybe \"naturalistic\" will do. It's something like \"All The President's Men\" in that respect. The kidding around and the hesitations and interruptions don't sound as if they were being read from cue cards.Jackman is fine as the enraged father who is determined to beat a confession out of his retarded prisoner, but he's not a sadist. He doesn't ENJOY doing it. And the scenes are truncated, avoiding the nasty current affection for torture porn that has infected movies like \"Unthinkable\" or the unbearable \"The Killing Gene.\" The viewer is likely to be \"for\" or \"against\" the other characters but Jackman's is problematic. He's not just rude or irrational. He's brutal. It's what makes it the most interesting role.In fact, everyone pulls his or her weight, but Maria Bello is truly impressive, though she doesn't have that much screen time. And Mellisa Leo as the mother of the chief suspect is outstanding. One of those distant, suspicious, kindly authoritative, slightly sour Midwesterners, though she's from New York.The ending collapses in upon itself. People do idiotic things like search dangerous places without calling for back up. Without warning, a familiar character splits open and reveals the demon within. Cliché follows cliché. I still don't exactly understand it. The rest is tense, involving, quite well done."
    },
    {
      "username": "alexcole10",
      "userUrl": "https://www.imdb.com/user/ur63888970",
      "reviewLink": "https://www.imdb.com/review/rw5827389",
      "warningSpoilers": true,
      "date": "15 June 2020",
      "rate": "8",
      "helpful": "60 out of 71 found this helpful.",
      "title": "First Watched it When I was 13 - Scared me to Death",
      "content": "This psychological crime thriller is one of the best out there in terms of gripping the audience. I watched it when I was 13 with a friend of mine after his step-dad recommended it. It freaked the hell out of me and left me with nightmares for weeks, simply due to the performances of Paul Dano, as the quiet and shy man-child and David Dastmalchian, as the creepy and slightly eerie red herring.Hugh Jackman played an excellent part showing the quick change from sane to distressed in few scenes after his child was kidnapped, and Jake Gyllenhaal perfected his role as a determined but stressed detective; it's a shame he wasn't Oscar nominated.I was hooked from minute one and was on the edge of my seat for the remainder of the film in order to find out the perpetrator.This film is very thoroughly thought through and is not too obvious nor too vague and will keep you watching.I only gave it an 8 rating rather than a 9 or 10 due to some minor plot holes - firstly, what was the 'maze' all about? And why was David Dastmalchian's character there, other than for distracting the viewer from the actual criminal?"
    },
    {
      "username": "Horst_In_Translation",
      "userUrl": "https://www.imdb.com/user/ur3914439",
      "reviewLink": "https://www.imdb.com/review/rw2893982",
      "warningSpoilers": true,
      "date": "25 October 2013",
      "rate": "8",
      "helpful": "11 out of 15 found this helpful.",
      "title": "A definite contender for best thriller of 2013",
      "content": "Even if he already worked for over 20 years before that, director Denis Villeneuve rose to fame considerably after giving audiences his 2010 film \"Incendies\", a nominee for the Best Foreign Language Oscar. With \"prisoners\" he directed his very first English-language movie. Two young girls disappear and the film centers on the father (Jackman) of one of them and the cop (Gyllenhaal) investigating what might have happened to them. Jackman, who already gave one of my favorite performances last year with his impressive turn as Jean Valjean, delivers again as a father who does what needs to be done to save his daughter's life and Gyllenhaal, who I've never been that big of a fan, impressed me as well. His portrayal of a loner, in his profession as well as his private life, gave me the chills occasionally and proves that he can pull off characters that go far beyond the pretty boy / nice guy image.Mostly thanks to its two leads and very atmospheric images and music, this film turned out a success and kept me on the edge of the seat for almost all of its very long 2.5 hours. It gets slightly worse when the secret behind the disappearances gets uncovered, just because most of the quiet tension vanishes and more action ensues, but it's still pretty decent. The invisible danger is far more effective than the danger from Melissa Leo when she gets exposed as the grandma from hell. She and the whole supporting cast do a decent job overall and Dano (especially), Leo, Davis and Howard did a fine job with what they were given and all have at least one scene where they can shine and command the screen. The only one who kinda left me unimpressed was Maria Bello. Once again. Guess I'm just not a great fan of her. Besides that, there were certain flaws here and there, such as the whole maze reference or the introduction of the husband to Leo's character, but looking at the whole picture, those were really just minor factors that can't remotely hurt the overall perception. This film is definitely worth a watch. Recommended, especially if you liked Eastwood's \"Mystic River\" and the ending scene is equally brilliant here."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw2907155",
      "warningSpoilers": false,
      "date": "17 November 2013",
      "rate": "",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Dark and morally murky even if it doesn't have the courage of its convictions",
      "content": "In the space of a few days both the male stars of this film were so heavily into promoting it that they both appeared on the Daily Show on different nights. This suggested that the film must be struggling either because of quality or because it is a hard sell – and it certainly seemed that the latter was most likely to be the reason for the sales push. The plot sees two young girls go missing on thanksgiving in a small rural town; a suspect is found and while the police try to figure it all out, the emotional impact on the two families starts to take its toll.This is a hard sell, even before we get to the meat of the story everything has a downbeat tone – even Thanksgiving seems a subdued affair with the grey skies and rain. From here it gets darker as the children go missing, the investigation starts and morality is testing in the actions of the characters. On this level it mostly works pretty well – mostly. The realistic tone to everything draws you into the story and it keeps you there as things start to get murky both in terms of the investigation but also the actions of the characters. This offered a much more interesting film than just a straight police procedural and for a lot of the time it does have real impact to it, but gradually it shies away from it – having its cake and eating it at the same time. This leaves the mystery which is also not as satisfyingly as I would have liked; it was solid enough but with the cast and the dark, adult tone to the film, I was hoping that the narrative would be brave enough to match it in many ways. It did a decent job, but it really did feel like it walked it back too much in too many ways. In terms of length it does run long and would have been better if the mystery hadn't included so many different branches within it.The cast justify the tone and everyone is excellent – to the point where I wished the material hadn't seemed to lose it in the final third. Whether this is a shot at Oscars I don't know but everyone is as strong as the castlist would suggest. Gyllenhaal has a straightforward character but makes a good presence from it; he has an intensity and presence that works for him and the film. Jackman does a great job with a changeable character – bravely ploughing into his actions with determination and as a result it is a shame for his performance that the film doesn't hold together as well as it should for the final third. Support is generally very strong as you would expect from Bello, Howard, Davis, Leo, Dano and others.Overall Prisoners is an engagingly dark and murky crime thriller. The mystery is flawed but still good, while the morality questions are well presented if not fully followed through. A shame for the strong performances that the film doesn't totally hold it together and deliver, but it is still worth watching for what it does well."
    },
    {
      "username": "secondtake",
      "userUrl": "https://www.imdb.com/user/ur20961309",
      "reviewLink": "https://www.imdb.com/review/rw2949894",
      "warningSpoilers": true,
      "date": "27 January 2014",
      "rate": "6",
      "helpful": "21 out of 35 found this helpful.",
      "title": "Routine and decently made but familiar to the point of blandness",
      "content": "Prisoners (2013)A highly rated movie at the moment, but be sure to know this is very well- worked territory, and it's a well made but conventionally made movie. There are some plot surprises but they won't be new ones. There is a detective (well played by Jake Gyllenhaal) but he's a familiar type. There is the parent (four parents, but one in particular, played by Hugh Jackman) who does some terrible things trying to find his daughter-but even this is now old territory (even Mel Gibson took that on).You won't have to suffer the mistreatment of little kids here, which is something some directors would explore and abuse. This is a story about the urgent hunting of the kidnappers before time ran out. There is no real clock to heighten our anxiety, just the feeling that the longer it goes on the more likely the children aren't going to make it. Mostly we follow the detective around as he follows leads and instincts, and the one dad who has his own idea of who's to blame.There is no good rationale for the kidnappings, either. Not money, which would have been easy, but some kind of religious freak craziness is to blame. An obsession with mazes creeps in, but even this we don't quite get. No, the specifics are endlessly avoided. Instead we are dependent on personality, and to some extent that works pretty well. It doesn't make for a whole movie, however.Director Denis Villeneuve has an interesting resume, including the hard-hitting \"Incendies\" which has (unlike this movie) a clear and sensational plot line. I'm not sure what made his drag this movie to an hour and a half-some economy might have been the main thing it needed, though the lack of explanation almost makes it seem a half hour has been excised already.Lots of people will not agree with me (apparently) but as a \"useful\" review I'm really trying to lay out the basic qualities that you can then judge for yourself. Bottom line? It's not boring even if it seems long, and it's a kind of film I like so I enjoyed it in a mild kind of way. That's a start!"
    },
    {
      "username": "will-vanduzer",
      "userUrl": "https://www.imdb.com/user/ur5862876",
      "reviewLink": "https://www.imdb.com/review/rw2864695",
      "warningSpoilers": false,
      "date": "6 September 2013",
      "rate": "9",
      "helpful": "338 out of 442 found this helpful.",
      "title": "Hugh Jackman's finest role?",
      "content": "Hugh Jackman takes you on a trip through the intense emotions a family is put through during its darkest hour. This may be his best role to date. From the trailers you know that his character will be out for blood as their daughter was kidnapped, but throughout the film you feel his pain, anger and moral struggles as he deals with this situation. The director does an excellent job of keeping you invested in the film emotionally even through some intensely violent scenes. Its dreary setting provides no comfort, but goes hand and hand with the narrative. This film may not be for those faint of heart but should be a must see for most viewers."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw3407914",
      "warningSpoilers": false,
      "date": "3 February 2016",
      "rate": "8",
      "helpful": "12 out of 19 found this helpful.",
      "title": "Brilliantly acted, hugely bleak, an excellent film.",
      "content": "Keller and Grace Dover's worst fears come true, their six year old daughter Anna and her friend Joy go missing, suspicions point to a local man, but The Police fail to make a case against him.This is one of the darkest, most bleak films I can remember, almost slightly too bleak in terms of tone, a wee bit too harrowing in parts, that said it was exceptionally well acted, well directed, and definitely one of those films that stirs the emotions. I wish it wasn't so long, it seemed to go on forever.Far from being a feel good film, it's violence with linger with you long after the credits have rolled.Paul Dano was brilliant in his part, such a good actor, possibly the best element of the film, although Jackman puts in a stellar performance too. Gritty, heavy and full of suspense, definitely worth a watch. 8/10."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw2949395",
      "warningSpoilers": true,
      "date": "26 January 2014",
      "rate": "9",
      "helpful": "21 out of 37 found this helpful.",
      "title": "Mesmerizing, Ambiguous and Gritty Thriller",
      "content": "On the Thanksgiving, Keller Dover (Hugh Jackman), his wife Grace (Maria Bello), their teenage son Ralph (Dylan Minnette) and their little daughter Anna (Erin Gerasimovich) go to the home of their neighbors and friends Franklin Birch (Terrence Howard), his wife Nancy (Viola Davis), their teenage daughter Eliza (Zoë Soul) and their little daughter Joy (Kyla-Drew Simmons) to celebrate together in a lunch party. Anna and Joy want to play on the street and Ralph stays with them. The girls play in a ROV and Ralph brings them back home. Later Anna asks her father to go to their house with Joy to seek her emergency whistle and Keller tells her to call Ralph or Eliza to go with them.Later the families realize that the girls went alone have vanished and they call the police department. Detective Loki (Jake Gyllenhaal) is assigned to the case and he arrests the teenager Alex Jones (Paul Dano) that drives the trailer. Soon they learn that Alex has the IQ of a ten year-old boy and he is discharged. When he is leaving the precinct with his aunt Holly Jones (Melissa Leo), Keller presses Alex and he says to Keller that \"the girls have not cried when he left them\". Keller asks to keep Alex imprisoned during the investigations, but Loki cannot hold him anymore. While Detective Loki investigates the pedophiles near the location, Keller decides to abduct Alex to torture him and find where his beloved daughter and her friend are, crossing the thin line between right and wrong.\"Prisoners\" is a mesmerizing, ambiguous and gritty thriller about the kidnapping of two girls by a sick serial-killer. The plot is divided in interesting premises that raise the discussion of what is right and what is wrong when the life of your daughter is in danger. Is Keller right or wrong abducting Alex after listening to what he told him? The police work is flawed, leaving Alex without surveillance just like in the real world.This movie has magnificent cast and cinematography and the story has glimpses of the dark Franc-Dutch \"Spoorloos\" (1988). The open conclusion is another plus in this movie. My vote is nine.Title (Brazil): \"Os Suspeitos\" (\"The Suspects\")"
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6845280",
      "warningSpoilers": false,
      "date": "24 April 2021",
      "rate": "7",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Prisoners",
      "content": "A very good movie, I felt a little bored while watching the film, especially in the first half of the film, the acting was excellent among the main actors, especially Hugh Jackman, who presented the role of the perfectly collapsed father, the story of the film was interesting and interesting, but the villain of the film was a disappointment I expected him A lot, the film would have been better if it were shorter, but it is still an excellent film and I recommend watching it."
    }
  ],
  "errorMessage": ""
}