{
  "imDbId": "tt2024544",
  "title": "12 Years a Slave",
  "fullTitle": "12 Years a Slave (2013)",
  "type": "Movie",
  "year": "2013",
  "items": [
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw3001914",
      "warningSpoilers": false,
      "date": "20 April 2014",
      "rate": "10",
      "helpful": "19 out of 25 found this helpful.",
      "title": "nothing can show us the full brutality of slavery, but this comes close",
      "content": "Solomon Northup's story of his kidnapping and sale into slavery got widely read upon its original publication but then disappeared as the Confederates built up an idealized image of the antebellum south (exemplified in \"Gone with the Wind\"). Now that Northup's story has gotten brought to the screen, it's important for everyone to see it. \"12 Years a Slave\" not only takes an uncompromising look at the sheer brutality of slavery, but also shows how nothing could take away Northup's dignity and his hope that he would one day be a free man again. One of the ugliest scenes is the whipping of a slave for perceived disobedience.Most of the credit goes to Chiwetel Ejiofor as Northup, showing him to be a man who wouldn't let even the most vicious treatment break him. The rest of the cast deserves ample kudos, but Steve McQueen deserves credit for bringing to the screen a story that got suppressed for over a century.This movie should also motivate us all to take a serious look at the plantation system and the fact that the US economy got built on it. George Washington and Thomas Jefferson owned slaves, and the White House is the product of slave labor.In the end, this definitely deserved Best Picture. Three quarters of a century after the pro-Confederate \"Gone with the End\" won big, we are finally seeing atonement. If you see only one movie this year, make it \"12 Years a Slave\"."
    },
    {
      "username": "BackFire83",
      "userUrl": "https://www.imdb.com/user/ur1288555",
      "reviewLink": "https://www.imdb.com/review/rw2893623",
      "warningSpoilers": false,
      "date": "25 October 2013",
      "rate": "10",
      "helpful": "557 out of 725 found this helpful.",
      "title": "Slavery is an evil that should befall none",
      "content": "12 Years a Slave tells the true story of Solomon Northup, an educated and free black man living in New York during the 1840's who gets abducted, shipped to the south, and sold into slavery. It is a film that stimulates at both an emotional level and an intellectual one. Chiwetel Ejiofor plays Solomon Northup. He's been a \"that guy\" actor for sometime – film-goers may know his face but not his name. After this film his name will be known. He gives, quite simply, the best performance from a leading actor since Daniel Day Lewis in There Will Be Blood. Because of his character's position as a slave he is usually unable to speak his mind unless he is prepared to be beaten. As a result Ejiofor is forced to utilize body language and his eyes, which become enormous pools of emotion to express himself to the audience. He's forced to endure terrible things, but he always maintains a certain dignity and nobility that makes his plight even more affecting. It's a performance of incredible subtlety that may leave you speechless and in complete awe.Micheal Fassbender gives the best performance of his already extremely impressive career, even besting his previous high marks from the films Shame and Hunger (both directed by Steve McQueen, who also directed 12 Years a Slave). He plays Edwynn Epps, a vicious and demonic slaver and perhaps the most loathsome and disgusting character ever put on screen. If alive today, he'd likely be a drunk with severe anger management issues. By turns pathetic and terrifying, he embodies the ultimate nightmare of a deeply flawed man given absolute power over other human beings, and through that absolute power finds only madness, which drives him to deeper cruelty. He's always a menacing and malignant presence even when not on screen, as his slaves must always be aware and prepared for his seemingly random bouts of sadism. Other actors give excellent performances as well. Paul Giamatti, Paul Dano, Benedict Cumberbatch, Sarah Paulson, Alfre Woodard are all great in relatively small roles. But in this film of titans it's the one you've probably never heard of who perhaps stands above them all. In her first role in a feature film, Lupita Nyong'o, playing the pretty young slave Patsey - the object of Edwynn Epps demented and horrifying affections and the emotional epicenter of the entire picture, gives one of the most devastating performances I have ever seen. A portrait of unbearable sadness, her character is a mirror image of Solomon. While Solomon is a man who refuses to break and give up the dignity which he's known since birth, she is one who has long since been broken, and who never knew dignity in the first place. Her life is a living hell, forced to endure the \"love\" of Edwyn Epps and the brutal jealousy of his wife, she's trapped in a terrible triangle that she can't escape. Despite that, she retains a level of innocence that only heightens the tragedy of her character. It actually gets to the point where simply looking at this character might be enough to bring you to tears. It's a shattering performance.Starting his career as a video artist before making full length films, Steve McQueen has an uncanny eye for imagery and contrast. He's also a very patient film maker, utilizing long, steady single shots to emphasize various things. In his prior films this has felt like a purely stylistic choice, here, it's a choice aimed directly at our heart. When the events on screen become their most horrifying and ugly is when his camera becomes the most unflinching. At times feeling perhaps like we're seeing out of the solemn eyes of the ghost of some murdered slave, watching in sorrow and rage. This is both McQueen's most accessible and artistically searing film yet. There are also moments of stunning natural beauty that would make Terrence Malick proud. Alone, these shots would inspire wonder, but in the context of this film they make us feel more forlorn, as if the ugliness of man is encroaching on the natural beauty of the world.Perhaps the most noteworthy thing about 12 Years a Slave is the way that it portrays slavery itself. Instead of taking the easy way out and limiting his exploration of the topic solely to the slaves, Steve McQueen increases the scope and we see how it affects those who profited by it. Take Benedict Cumberbatch's character. A seemingly decent and caring man who treats his slaves with some semblance of respect and kindness. He comes off as a relatively good man who is trapped within the powerful confines of the institution of slavery. In 12 Years a Slave, slavery is shown as a horrifying and destructive social construct that drains the humanity from everyone it touches, turning good men into moral quandaries, turning flawed men into monsters, and turning an entire race of people into livestock and tools. To watch 12 Years a Slave is to be confronted with the grim reality of slavery in a way that's never been done before. To say this is the best film ever made about slavery feels trivial, as slavery is a subject in film that has been shown with naive romanticism from films like Gone With the Wind or silly exploitation from something like Django Unchained. Both of which serve to make the topic digestible. To watch 12 Years a Slave is to experience a level of despair and misery that can become overwhelming. It's a film of such ugliness, such blunt emotional trauma, that it may haunt you for hours if not days after seeing it. So why should you watch a film that could leave you reeling and devastated? Because, it's also one of the greatest cinematic achievements of our time."
    },
    {
      "username": "dvc5159",
      "userUrl": "https://www.imdb.com/user/ur3798706",
      "reviewLink": "https://www.imdb.com/review/rw2891522",
      "warningSpoilers": false,
      "date": "18 October 2013",
      "rate": "9",
      "helpful": "193 out of 284 found this helpful.",
      "title": "Roll Jordan Roll",
      "content": "A random and encounter has led Solomon Northup from living freely in New York to being kidnapped and sold into slavery in Louisiana, getting handed over to various slave owners. There, Solomon witnesses numerous acts of cruelty that no man should ever face.As I stared at the movie screen with full dread, I was reeling back at certain scenes I had just witnessed. There were good films and television shows about slavery before, and they had various nuances at how to tackle slavery. This film is part of said resurgence of the sub- genre, hot on the heels of \"Django Unchained\" and \"The Butler\". But while the former relinquishes on Spaghetti Western entertainment more than attempting to address the issue in a political light as the latter, Steve McQueen's \"12 Years a Slave\" shuts those two up, and perhaps the entire sub-genre, for good. I doubt any future slavery-themed film will be as harrowing as this one was.Steve McQueen is a fearless filmmaker, continuing his streak of unfiltered brutality within human depths. He frames his actors' faces in extreme close-up, the eyes staring into despair, the nostrils fuming in aggression. Naked flesh are shown not because of erotic content, but rather because of desperation and futility. Long takes and wide shots are not uncommon in his films, and here they showcase a plethora of fantastic scenes and performances that work to discomfort the viewer as much as possible. McQueen doesn't just allow the audience to tackle slavery, he guts the audience and leaves them for the consequences. This is an extremely uncomfortable film to watch. Beautifully shot locations are placeholders for unsettling sequences before and after, contemplated by Hans Zimmer's poignant and at times horrifying score. This all works to create a nightmarish time and place where hell walks on Earth.Central to all of this is the performance of Chiwetel Ejiofor as Solomon. Ejiofor showcases that he is a natural force to be reckoned with in this film, after a decade of mostly supporting characters. He spaces out in despair as the camera lingers onto him for solid minutes, not a word spoken. Another sequence shows him mourning the death of a fellow worker, in which the singing of the surrounding group compels him and shakes him down to tears. These scenes follow earlier ones where he is a classy, free man in the upper states, mingling happily with the crowd and partaking in fanciful music sessions. It is a tour-de-force performance.A fine ensemble of established and up-and-coming actors surround Ejiofor in his limelight - Paul Dano, Paul Giammati, Alfre Woodard, Sarah Paulson, even Brad Pitt and Benedict Cumberbatch, but none so ferociously as McQueen regular Michael Fassbender as the despicable, sadistic plantation owner Edwin Epps. So excellent and terrifying is Fassbender's portrayal of such a merciless and barbaric person, that the mere sight of him will either cause audience members unfamiliar to him to flinch.I was left speechless as the credits rolled. A lesser film would have added tacked-on sentimentality/exaggeration and politically influenced claptrap. Not this one. This is a movie to watch as a reminder of how powerful the human spirit can endeavor, and how lucky all of us have grown past that dreadful time in history. The full effect of it has not been felt in movies before, until now."
    },
    {
      "username": "ClaytonDavis",
      "userUrl": "https://www.imdb.com/user/ur2898980",
      "reviewLink": "https://www.imdb.com/review/rw2869360",
      "warningSpoilers": false,
      "date": "14 September 2013",
      "rate": "10",
      "helpful": "278 out of 446 found this helpful.",
      "title": "McQueen's epic is beautiful and tragic anchored by sensational performances...",
      "content": "Read More @ The Awards Circuit (http://www.awardscircuit.com)One of the things that have been thrown around for months now is the notion that awards season voting bodies won't respond to it because it's too \"difficult\" to sit through. Let's define difficult, shall we? Is it difficult to see the first openly gay politician gunned down by his closeted colleague? Is it difficult to see a reformed convict put to death by our country for his crimes? Is it difficult to see a mother choose which one of her children dies during the Holocaust? I'd argue that these answers add up to a resounding yes. Yet, no one threw those phrases of \"too difficult\" around.I've watched hundreds of films throughout my short 29-year history and I've seen some difficult cinema. Steven Spielberg's \"Schindler's List\" can make anyone quiver in shame as it shows the despicable reality of the Holocaust. Paul Greengrass' \"United 93\", which is almost an emotional biopic of America's darkest hour, makes me want to crawl up into a ball and cry. And finally, Mel Gibson's \"The Passion of the Christ\", one of the highest grossing films of all-time, shows the labor of our sins fleshed out into the beaten skin of an honest man. And still, no one threw these hyperbolic terms out saying, \"it's too hard watch.\" Is it because this is an American tragedy, done by Americans? Is it the guilt of someone's ancestors manifesting it in your tear ducts? I can't answer that. Only the person who says it can. The structure of this country is built on the backs and blood of slaves. But slavery didn't just exist in America, it was everywhere. It was horrifying what occurred for over 200 years and believe it or not, still exists in some parts of the world TODAY.Now when approaching the powerful film by McQueen and distributed by Fox Searchlight Pictures, there is a resounding honesty that McQueen and screenwriter John Ridley inhabit. There are no tricks or gimmicks, no cheap takes on a side story or character that is put there for time filling or a life-lesson for Solomon to learn. Everything is genuine. Is the film heartbreaking? Oh my God yes. Did I cry for several minutes after the screening? Embarrassingly so. I was enamored the entire time, head to toe, moment to moment.I have long admired the talent that's been evident in the works of Chiwetel Ejiofor. I've known he was capable of what he has accomplished as Solomon Northup and he hits it out of the park. He has the urgency, worry, and drive to get home to his family and executes every emotion flawlessly even when all hope seems to be lost. Where he shines incredibly are the small nuances that he takes as the story slows down, you notice aspects of Solomon that make him even more believable.As Edwin Epps, Solomon's last owner, Michael Fassbender digs down deep into some evil territory. Acts as the \"Amon Goeth\" of our tale, he is exactly what you'd expect a person who believes this should be a way of life to behave. He's vile and strikes fear into not only the people he interacts with but with the viewers who watch. As Mrs. Epps, Sarah Paulson is just as wretched. Abusive, conniving, entitled, and I loved every second of her.Mark my words; Lupita Nyong'o is the emotional epicenter of the entire film. The heartache, tears, and anger that will grow inside during the feature will have our beautiful \"Patsey\" at the core. She is the great find of our film year and will surely go on to more dynamic and passionate projects in the future. You're watching the birth of a star.Hans Zimmer puts forth a very pronounced score, enriched with all the subtle ticks that strike the chords of tone. One thing that cannot be denied is the exquisite camera work of Sean Bobbit. Weaving through the parts of boat and then through the grassroots of a cotton field, he puts himself in the leagues of Roger Deakins and Seamus McGarvey as one of the most innovative and exciting DP's in the business. Especially following his work in \"The Place Beyond the Pines\" earlier this year. Simply marvelous.Oscar chances, since I know many of you are wondering. Put the Oscar's in my hands, you have a dozen nominations reap for the taking. Best Picture, Director, Lead Actor, Supporting Actor, dual Supporting Actresses, Adapted Screenplay, Production Design, Cinematography, Costume Design, Film Editing, Makeup and Hairstyling, Original Score. There's also a strong and rich sound scope that is present. The sounds of nature as the slaves walk or as Solomon approaches his master's house is noticed. The big question is, can it win? I haven't seen everything yet so I cannot yet if it deserves it or not. I can say, if critics and audiences can get off this \"difficult\" watch nonsense and accept the cinematic endeavor as a look into our own history as told from a great auteur, there's no reason it can't top the night. I'm very aware that seeing this film along with Steve McQueen crowned by Oscar is nearly erasing 85 years of history in the Academy. Are they willing and ready to begin looking into new realms and allowing someone not necessarily in their inner circles to make a bold statement as McQueen and Ridley take in \"12 Years a Slave?\" I remain hopeful."
    },
    {
      "username": "ferguson-6",
      "userUrl": "https://www.imdb.com/user/ur0806494",
      "reviewLink": "https://www.imdb.com/review/rw2895142",
      "warningSpoilers": false,
      "date": "27 October 2013",
      "rate": "8",
      "helpful": "24 out of 37 found this helpful.",
      "title": "Live, not just Survive",
      "content": "Greetings again from the darkness. Should this be labeled a historical drama? Is it one man's extraordinary tale of strength and survival? Does this fall into the \"art film\" category that so divides the movie-going public? The answer to all is YES, and I would add that it's a masterfully crafted film with exquisite story telling, stunning photography and top notch acting throughout.The movie is based on the real life and writings of Solomon Northrup, a free man who was kidnapped and sold into slavery from 1841-53. Northrup's story provides us a look inside the despicable institution of slavery. Needless to say, it's a painful and sad process made even more emotional by the work of director Steve McQueen (Hunger, Shame). McQueen takes a very direct approach. Not much is left to the imagination. Torture, abuse, cruelty and misery take up the full screen. The only subtlety comes from the terrific work of Chiwetel Ejiofor as Northrup. His facial expressions and eyes are more powerful and telling than any lines of dialogue could be.You will not find many details from the movie here. This is one to experience for yourself. It lacks the typical Hollywood agenda when it comes to American history. Instead this era is presented through the eyes of a single wronged man and his quest to return to his wife and kids, no matter the inhumane obstacles. We see Paul Giamatti as an emotionless, all-business slave trader. Benedict Cumberbatch is a plantation owner who has a heart, but lacks business savvy. And finally we enter the world of cotton farmer Michael Fassbender, who twists Bible scripture into threats directed at the slaves - his \"property\".Fassbender dives deep into evil to find his character, and along with Ejiofor, Sarah Paulsen (who plays Fassbender's icy wife), and Lupita Nyong'o (who plays slave Patsey, the center of the two most incredible scenes in the film), provide more Oscar worthy performances than any one movie can expect. You will also note Quvenzhane Wallis (as Northrup's daughter) and Dwight Henry (as a slave) in their first appearances since Beasts of the Southern Wild. Other strong support comes from Scoot McNairy, Taran Killam (SNL), Michael K Williams, Alfre Woodward, a nasty Paul Dano, Garret Dillahunt and Adepero Oduye.Steven Spielberg gave us a taste of the holocaust with Schindler's List, but not since the TV mini-series \"Roots\" has any project come so close to examining the realities of slavery. Northrup's story seems to be from a different universe than the charming slaves of Gone with the Wind. I would argue that what makes this watchable (though very difficult) is the focus on Northrup's story. While tragic, his ending actually deflects from the ongoing plight of those not so fortunate. It's a story of a man who states he doesn't wish to merely survive, he wants to live a life worth living.McQueen's direction will certainly be front and center come awards season, as will many of the actors, John Ridley (the screenwriter), Sean Bobbitt (cinematographer) and Hans Zimmer (score). The only question is whether the subject matter is too tough for Oscar voters, who traditionally lean towards projects a bit more mainstream."
    },
    {
      "username": "secondtake",
      "userUrl": "https://www.imdb.com/user/ur20961309",
      "reviewLink": "https://www.imdb.com/review/rw2972468",
      "warningSpoilers": false,
      "date": "2 March 2014",
      "rate": "8",
      "helpful": "49 out of 81 found this helpful.",
      "title": "A direct telling of the horrors, but not quite the complexities, of a man kidnapped into slavery",
      "content": "12 Years a Slave (2013)Who can possibly argue against the power of this kind of movie, and the injustice that it waves as a welcome reminder? Superbly directed and acted (especially leading man Chiwetel Ejofor playing Solomon Northup), and set with high levels of realism in pre-Civil War America, there is little to separate what the filmmakers intended and what they achieved. A work of excellence.It is not, however, quite the masterpiece it might have been. I don't mean the story or the level of competence here at all. I mean the way the story is told, the choice to simply tell it like it was.That means that the presentation is quite linear (excepting a few gratuitous flashbacks that seem like a last minute editing decision). And uncomplicated. This is the biggest surprise. I mean, the basics might seem enough—a free black man in Saratoga goes to Washington and is kidnapped and made a slave, and he remains a slave until his recovery 12 years later. But that is actually the entire movie.Oh, I know, the details are missing in that sentence. But it is these details where the movie succeeds too well. We are shown the horrors of slavery and made to experience them. It isn't that this is ignoble or unimportant. On the contrary, this is an \"important\" film and should be seen. But in some weirdly surreal way, we already know everything that happens in these details. Do we need to see a woman, naked and tied to a post, whipped and whipped and whipped, with screaming in our ears? Many will say yes. We need to feel that horror even a little bit (through a movie) to understand how utterly unbelievably horrible slavery was. I would just argue back that I don't really want to be tortured directly to confirm what I already fully agree with. It's just a choice you want to make as a moviegoer. It's similar to watching a kidnapping movie—do you want to experience the inner and outer torments of the kidnapped, or see some larger view of a kidnapping situation and the complexities of that kind of plot?For me, then the movie was excellent at being literal, but that's not enough. For example, there is absolutely no hint at what the family did when Solomon didn't return home after his trip to Washington. Did they search? Worry? How? Who helped, who ignored them? Etc. That's just one of many complexities the movie avoids for the sake of a direct experience of the protagonist. I hope that gives a sense of where this unpleasant, terrific movie leaves you, and whether to watch it."
    },
    {
      "username": "Sergeant_Tibbs",
      "userUrl": "https://www.imdb.com/user/ur11148131",
      "reviewLink": "https://www.imdb.com/review/rw2967283",
      "warningSpoilers": false,
      "date": "24 February 2014",
      "rate": "9",
      "helpful": "46 out of 74 found this helpful.",
      "title": "12 Years A Slave earns the right to be called one of the best films of the year.",
      "content": "If any contemporary director deserves to be in the mainstream spotlight without compromising their style, it's Steve McQueen. His debut, Hunger, already had the hand of a confident filmmaker taking a fly-on-the-wall style to the grimy art-house. Shame was one of the finest films of its year for its impeccable depiction of an addiction to one of humanity's primal survival instincts resulting in self-destruction. I'm so happy that his latest film has gracefully conquered early Oscar favourites from the output of David O. Russell, Martin Scorsese and the now delayed film from George Clooney to become this year's Oscar frontrunner. During its festival run when the buzz first began, I took it upon myself to read the screenplay. While I can usually sink scripts within a few hours, the poetic density of 12 Years A Slave took several sittings across a week or two. Even on the page it was a harrowing, exhausting experience. It's a film that needs a have a gut to truly display the length of time, but the script is bloated in its brilliance.Naturally, scenes were cut (whether in the editing room or pre-production I don't know) and that's a blessing and a curse. Now in the film, we rush to Solomon Northup's capture, opening with scenes we shall revisit later on. I understand the decision to enter the world as quickly as possible, but I do feel it hurts its first act. As much as I jump for joy every time Scoot McNairy hides himself in a film, the transition from ordinary life to becoming kidnapped feels jarring and contrived. Who is Solomon Northup as a free man? What does he want? Maybe we don't know because there is no source for the matter. Maybe McQueen isn't interested in telling that story. At the very least, we definitely know that Solomon is a compelling character during his capture. Chiwetel Ejiofor is an actor I've always liked but he's never made an impression until now. His passion and commitment to his portrayal of Solomon is utterly captivating. While he can slink into the background of some scenes where he is not the focus, when it's time to shine he bursts a fuse.Unfortunately during this cluttered first act, it concerns itself too much with subplots that we know will not succeed. While they accomplish establishing the stakes at hand and rule out the 'why doesn't Solomon just ' there's just too many abridged tales. Perhaps this is distracting just because I know the full stories from the script, but they should've went all or nothing with them. It results in editing that frustratingly refuses to let us into Solomon's headspace. We're along for the ride, but too frequently not Solomon's ride. During then we only get rare and rewarding glimpses into how he feels and his perspective on his past life stolen from him. Fortunately the film vastly improves once Solomon is free from the deliciously cruel Paul Giamatti to the spiteful live-wire Paul Dano. As the film focuses on his one-on-one conflicts and moral dilemmas, the film reaches intimate and truly challenging moments which is where the film's power lies. Fruitless subplots are dropped in favour of heartbreaking ones as we're introduced to the pitiful Patsey on the pathetic Edwin Epps' plantation.Michael Fassbender and Steve McQueen have been one of the most enthralling director/actor combination in recent years. They always bring out the best in each other. Here, it feels like they've reached their finest work yet, but still feels like their collaboration has just began. Fassbender's Edwin Epps is the film's most fascinating and complex character, a man who sincerely refuses to believe he is evil. He demonstrates the thesis of the film in that the authoritative caucasians didn't believe they were doing anything wrong. Many people have laid claim that he is pure evil, but I don't think that's the point, he belongs in a misguided world where he thinks his lust and affection is apt praise for Patsey's talent. While I may not have sympathy for him, he is a tortured soul, a regrettable and irreversible tragedy of mankind and this is thanks to Fassbender's incredible performance. His victim Patsey, played by talented newcomer Lupita Nyong'o, is an utter revelation. She may not have a fully developed character but in at least two powerful scenes, she makes the best out of what she can for a character that warrants the tears you will inevitably shed.One of the most consistent aspects of McQueen's films is the magnificent taste in cinematography and production design. Presumably from his art background, he's great at immersing you into his bleak visual worlds. Working with Sean Bobbit again, the cinematography is reliably enchanting. In true McQueen style, if a character must endure patiently, in this case Solomon hanging from a noose on the tips of his toes, we must endure with them. No shot this year, not even in the extraordinary Gravity, has been as stunning and unforgettable as the infamous long take of Patsey's lashes. It's a filmmaking masterclass in just a few short minutes. Despite the shaky first half hour, it's all redeemed in its harrowing final 15 minutes. It's the greatest sequence I've seen in a long time and I've never had a scene make me a blubbering mess quite like it. Yes, the jump to his kidnapping feels abrupt and there's no sense of relief to his inevitable freedom, but this is all calculated to mirror the struggle of his experience and we've felt every beat. 12 Years A Slave is a powerful testament to the endurance of the human spirit with its theme of injustice applicable to any point in history that earns the right to be one of the best of the year. After a string of lightweight Best Picture choices from the Academy, this will be a refreshing choice. 9/10"
    },
    {
      "username": "tigerfish50",
      "userUrl": "https://www.imdb.com/user/ur23091881",
      "reviewLink": "https://www.imdb.com/review/rw2873623",
      "warningSpoilers": false,
      "date": "22 September 2013",
      "rate": "9",
      "helpful": "153 out of 257 found this helpful.",
      "title": "Abducted to a Southern hell",
      "content": "Considering the social and economic importance of slavery in America's history, the scarcity of serious films depicting the daily life of slaves in the Confederate States is significant - especially since the after-effects from this shameful episode still echo through the culture. '12 Years a Slave' is based upon the memoirs of Solomon Northup, who endured a hellish period of enslavement in Louisiana, which is backed up by legal records.The story begins with him living with wife and children in upstate New York as a free man and respected member of his community. After being lured to Washington by a couple of con-artists who promised him work, he was subsequently drugged, locked in chains, viciously beaten, stripped of his identity and shipped to New Orleans to be sold into slavery. Over the next twelve years, he was owned by two men who treated him in contrasting ways. The first was a relatively civilized fellow, but the plantation's half-witted manager was threatened by Northup's superior intelligence. Their mutual dislike produced a dangerously volatile situation, and unwilling to lose his investment, Northup's owner re-sold him to a neighbor. This unbalanced individual regarded his slaves as property to be used for pleasure and profit, which caused them to live in perpetual fear that his capricious moods would flare into sadistic lust or rage at any moment.It's noteworthy that a British director has become one of the few filmmakers to delve deeply into this subject, and the combination of John Ridley's powerful script and McQueen's directorial skills has inspired exceptional performances from the entire cast. Their dramatization of Northup's experiences is both riveting and uncomfortable to watch, as the film depicts the perverse nature of a society that permitted such a barbaric system. Hopefully it will reach a large US audience, who will learn how a privileged Southern elite cruelly exploited their fellow humans in order to acquire greater wealth for themselves."
    },
    {
      "username": "tavm",
      "userUrl": "https://www.imdb.com/user/ur11228318",
      "reviewLink": "https://www.imdb.com/review/rw2912135",
      "warningSpoilers": false,
      "date": "26 November 2013",
      "rate": "10",
      "helpful": "18 out of 29 found this helpful.",
      "title": "12 Years a Slave is quite a compelling depiction of slavery at its most harrowing",
      "content": "Just watched this true story of slavery with my movie theatre-working friend. It depicts the abduction of Soloman Northup (Chiwetel Ejiofor) from his family in New York State to the bayous of Louisiana (my home state) where he is made a slave. Director Steve McQueen does a fine job depicting how harrowing the experience is and provides catharsis when the ending comes. He also does a nice job of providing some background of other fellow slaves like that of the doomed Patsy. If anyone who paid to see this expected to watch Brad Pitt in a big role, they must have been disappointed to see him in only a couple of scenes but he does well in those and I have to assume most of the public was enthralled by the story to not even care by that point. Anyway, I highly recommend 12 Years a Slave if you want to be challenged as a viewer by the way someone is depicted as the main character is here. Oh, and nice shots of the Louisiana locations."
    },
    {
      "username": "gsygsy",
      "userUrl": "https://www.imdb.com/user/ur0604321",
      "reviewLink": "https://www.imdb.com/review/rw2940019",
      "warningSpoilers": false,
      "date": "12 January 2014",
      "rate": "10",
      "helpful": "40 out of 64 found this helpful.",
      "title": "As high as cinema can go",
      "content": "It's rare that a movie lives up to its hype, even rarer that the hype is transcended by the actual achievement. 12 YEARS A SLAVE does both. Aided by powerful performances and cinematography, director McQueen exposes the barbarity of dehumanisation, of treating people as property. Reviews focus on the brutality on display, and it's true that the film is not easy to watch, with its powerful juxtaposition of sublime scenery and human degradation. But to me the final scene is the most powerful of all: we are party to the kind of raw emotion that in the hands of lesser artists could easily descend into tawdriness or sentimentality. Here, as in the rest of the film, it is raised up high, as high as cinematic art can go."
    },
    {
      "username": "rogerdarlington",
      "userUrl": "https://www.imdb.com/user/ur1911738",
      "reviewLink": "https://www.imdb.com/review/rw2944837",
      "warningSpoilers": false,
      "date": "19 January 2014",
      "rate": "",
      "helpful": "12 out of 17 found this helpful.",
      "title": "A very special piece of film making",
      "content": "Let's be honest about it: this spotlight on the darkest days of American history is a particularly British triumph. The brilliant director (and artist) Steve McQueen and outstanding Chiwetel Ejiofor, as the eponymous Solomon Northup, are both British; even Michael Fassbender, in the main support role as a sadistically brutal slave-owner, is half British; and Benedict Cumberbatch makes an appearance as a 'kinder' slave owner.But, of course, there is a vast array of American talent here too. As always, Sean Bobbitt is inspiring as director of photography, making full use of the Louisiana locations. And a host of fine US actors make cameo appearances, notably Brad Pitt (who was one of the 10 producers), Paul Giamatti (looking as if he had walked straight out of the TV mini series \"John Adams\"), Sarah Paulson and Alfre Woodard. In her first film role, Lupita Nyong'o gives a heart-rending performance as a young slave who is horrendously abused. Original music by Hans Zimmer and use of contemporary songs add to the searing atmosphere of the workMcQueen is unrelenting in his focus: except for short pieces at the beginning and the end of the film, all the time is the period in captivity and, except for occasional glimpses of humanity, we see the slaves subjected to humiliation and horror again and again and again. McQueen's style is slow and penetrating with some long and wordless scenes totally captivating.As a piece of social history, this movie is simply stunning - a virtual blow to the solar plexus. As a cinematic work, it has some challenges: there is no conventional narrative arc in which a plot unfolds or a character develops because Northrup is confined to a small geographical space where he can only survive by keeping as low a profile as possible; the characters are literally black and white with little subtlety or nuance; and there is not really a sense that the period of incarceration is more than a decade.At the start and finish of the film, we are reminded that this is a true story based on the book written by Northup in 1853, once he finally re-acquired his freedom (in a pedestrian act of bureaucracy rather than anything more dramatic or violent). As if Northup has not suffered enough, we learn that his legal actions against both those who sold and bought him failed in the courts. A special award should go to McQueen's Dutch partner Bianca Stigter who discovered Northup's book and recommended it to the director."
    },
    {
      "username": "binducherungath",
      "userUrl": "https://www.imdb.com/user/ur51472121",
      "reviewLink": "https://www.imdb.com/review/rw2982403",
      "warningSpoilers": true,
      "date": "19 March 2014",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Soulfully depicts the human tragedy...",
      "content": "Twelve Years a Slave is an adaptation of the 1853 memoir of the same name by Solomon Northup, a New-York state born free Negro who was kidnapped in Washington D.C. in 1841 and sold into slavery. He worked on plantations in the state of Louisiana for twelve years before his release. It is depressing, sad, annoying, frustrating to watch what Solomon Northup (Chiwetel Ejiofor) went through his 12 years as a slave. A great performance by Chiwetel Ejiofor whose act of bewilderment, despair, anguish, trying to survive is just outstanding. There are moments when with no sound and little movement, he projects what hopelessness looks like. His 12 years of unthinkable abuse, backbreaking labour, fading dreams of happy family, desperateness to figure a way out to his freedom every act moves us. The brutality, dehumanizing acts of the masters make it so tough to even look at the screen.Ford (Benedict Cumberbatch) as a cotton plantation owner is shown as humane yet ineffectual who eventually sells Solomon to the vicious, drunken Epps (Michael Fassbender), another cotton plantation owner. Epps is ruthless. The screen timings with him in the frame are like an unbearable demonstration of misery in movement.Another applauding performance has come from Patsey (Lupita Nyong'o) who is vocal about her grief, a young slave, victim of Epps' barbarous and insane ways. She is raped and beaten by Epps, who is also a cause of envy to Epps' wife who feels that Epps has an eye on her.I was actually moved by lot many scenes in the movie. Mother's pleading not to separate her from her two children, still all three being sold to different masters creates a lump in the throat. Solomon strung up by the neck for a transgression and his toes are barely touching the dark plantation mud as he dangles, near-dead under the scorching sun. Another disturbing visual is merged with this i.e. children are playing in the background, other slaves are going ahead with their chores since they fear that if they would help Solomon, they would lose their lives. Patsey somehow manages to give him little water. The psyche of the slaves, their surrendering to the fate one side and the heartless brutality of the masters / overseers on another side are very well captured. The night Patsey comes to Platt (Solomon's identity as a slave), asking him to kill her is a scene of unbearable pain, particularly as Platt turns his back and Patsey sobs into the night. Male / female slaves with their bleeding back after being beaten up (almost to death) choked me. Solomon just wanting to rush with officials who came to free him (following Bass -Brad Pitt's) efforts, turning back to give a warm hug to Patsey is so overwhelming. It depicts the dark chapter of slavery in American History. It is beyond one's imagination the kind of suffering the slaves faced. A complete shame to humanity.Steve McQueen as director is adept with his articulation. Though the title says that Solomon would be slave for 12 years, McQueen and John Riddley makes us feel that it could be forever. Sean Bobbit (Cinematographer) has given great aerial shots which are so effective in making us bewildered, disoriented, and a complete lost feel along with the protagonist.12 Years a Slave isn't easy to watch since it not only unfolds the tragedy of Solomon in particular but it also depicts the tragedy of such countless souls who lost the biggest gift of mankind- the freedom."
    },
    {
      "username": "maurice_yacowar",
      "userUrl": "https://www.imdb.com/user/ur40243436",
      "reviewLink": "https://www.imdb.com/review/rw2890673",
      "warningSpoilers": true,
      "date": "20 October 2013",
      "rate": "9",
      "helpful": "16 out of 24 found this helpful.",
      "title": "Black northerner sold into slavery and survives",
      "content": "Like the whipping scenes we uncomfortably witness, in 12 Years a Slave the sting comes in the tail. The end titles tell us neither the slave pen manager nor Solomon Northup's kidnappers were punished. Solomon is saved, but that individual justice does not redefine the terrible system. Racism, slavery and savage injustice persist at film's end. Of course, the point is that even after the Civil War, the freeing of the slaves, the Civil Rights Movement and its legal and societal successes, racism and injustice persist. Hardly a major daily newspaper passes without a reminder, whether it's a regressive change in the voters' rights laws or a Florida bully justified in \"standing his ground\" against the unarmed black kid he hunted. 12 Years a Slave reminds us what contemporary America grew out of and where too much of its roots remain. McQueen's film deploys an uncompromising visceral violence that rejects the sentimentality and softened focus of American treatments of that period. There is such violence in the air that steamboat paddles churn up a riot of raucous white water and the boat's furnaces roar infernal. The Southern swamps have an eerie other-worldliness that sets up the ghosts of slavery past as a still haunting presence. Apparently it takes an outsider to cast such an unflinching eye on the subject. To his credit, the physical world and the language seem perfectly realized. No trace of the outsider there, but the work of a director steeped in his subject's world. Perhaps the only false note is producer Brad Pitt appearing as the Canadian who brings Northup salvation. His performance is fine but he can't stop registering as Brad Pitt, who gets to make the film's wisest and most humane and modern speeches. Whether his casting was his or McQueen's idea, it shivers the film's verisimilitude and seems self-congratulatory. Pitt brings Northup's story to the North as outside the narrative he helps bring it to the screen. But that is a minor cavil about a film that's courageous, brilliantly written, scored, directed and performed, and as important a statement to America and the world as we have seen this year. For more see www.yacowar.blogspot.com."
    },
    {
      "username": "LetwitJr",
      "userUrl": "https://www.imdb.com/user/ur36391777",
      "reviewLink": "https://www.imdb.com/review/rw2866683",
      "warningSpoilers": true,
      "date": "9 September 2013",
      "rate": "10",
      "helpful": "224 out of 345 found this helpful.",
      "title": "Another masterpiece from McQueen",
      "content": "I attended the premiere of 12 Years a Slave at the Toronto International Film Festival. Having no tickets, we had to wait close to 4 hours hoping they might let us in. I have to say it was definitely worth the wait and it is hands down the best film I've seen at the festival. The film is based on the real story of Solomon Northup (played by Chiwetel Ejiofor), a free black man living in New York, who is abducted and sold into slavery in Louisiana. As the film begins, we are exposed to his talent as a musician (he plays the violin) and get a glimpse of the life he leads with his wife and two children. All is well until he meets two men who seem taken by his music and want to bring him along with them so he can play at various events. When Solomon wakes up in chains, his dark journey starts and the film never lets you take a break.If you've seen McQueen's other works then you more or less know what kind of movie to expect (if you haven't then please stop reading and watch Hunger and Shame). 12 Years a Slave is dark and raw, it exposes everything, without sugarcoating it. It is definitely hard to watch; Several people walked out of the the theatre but in my opinion, it is not only worth watching but necessary. Films exploring themes of slavery are few and far in between and never has one been quite as exhaustive and effective as this one. Beautifully shot and edited, the film features moments of tension, heartbreak and a few laughs here and there. Steve McQueen has created another masterpiece.Most actors get very little screen time. Paul Giamatti and Sarah Paulson are seen for a few minutes but both are great as usual. Benedict Cumberbatch plays a plantation owner, who recognizes Solomon's talent and tries to help him to a certain extent. Despite being a slaver, he is presented in the film as being a good man. Cumberbatch was very good, though outshined by far by Michael Fassbender. He goes through every emotion and gives it his everything. In my opinion, this is his best performance to date. Paul Dano gets a few minutes of screen time as well but makes incredible use of it. As Benedict's worker, he despises slaves and the songs he sings to Solomon makes an incredibly powerful scene, one of the most disturbing in the film. Lupita Nyong'o's first appearance in a feature film is stunning, as she plays a heart breaking young slave. I hope she has a long career ahead of her, she certainly has the talent for it. The true star is definitely Chiwetel Ejiofor. His performance as Solomon is stunning and unforgettable, I truly hope he wins the Oscar for it this year.All in all, if you get a chance to see 12 Years a Slave, don't miss it. Not everyone will be able to stomach it but it's an outstanding film that deserves and needs to be seen."
    },
    {
      "username": "FlashCallahan",
      "userUrl": "https://www.imdb.com/user/ur22668817",
      "reviewLink": "https://www.imdb.com/review/rw2942799",
      "warningSpoilers": true,
      "date": "16 January 2014",
      "rate": "10",
      "helpful": "10 out of 15 found this helpful.",
      "title": "Your children will soon enough be forgotten......",
      "content": "Solomon Northup lives as a free man in New York with his wife and two children, earning a living as a violinist. On what he believes will be an out of town music shoe, he is drugged and sold into slavery under the name Platt. He decides that co-operation is the best way to survive. He sees few others in the same situation as him, but slowly he is separated from those with who he has built support. This process continues over his life as a slave, as he is at the mercy of whoever his master at the time and his master's associates who work on their own priorities. But he finds that co-operation generally gets one nowhere and sometimes can get one into further trouble due to jealousy.....Its a hat trick for McQueen as he has crafted another near perfect film, and has gotten some career best performances from many involved, especially Ejiofor, who is wonderful as Soloman. The film follows the three act rule of thumb, but when watching this, you cannot help but think that its a film of two halves. The first part the incarceration, and coming to terms, but having a fair owner, played brilliantly by Cumberbatch.The second part is almost the desperation part of the story, with Soloman becoming desperate, and coming face to face with pure evil, turning his life as a slave into something else. Fassbender is wonderful here, oozing pure menace i to every act he does, whether its dancing, or just sitting there relaxing.Cinematography is wonderful, and some drawn out scenes, like Soloman hanging, are beautifully sinister.If there is a better film released this year, film-goers are in for a treat.A masterpiece on every level."
    },
    {
      "username": "asda-man",
      "userUrl": "https://www.imdb.com/user/ur25364506",
      "reviewLink": "https://www.imdb.com/review/rw2982319",
      "warningSpoilers": false,
      "date": "19 March 2014",
      "rate": "10",
      "helpful": "7 out of 9 found this helpful.",
      "title": "12 minutes of heartbreak (plus an extra 140)",
      "content": "Steve Mcqueen is proving himself to be a director to look out for. I wasn't a huge fan of his debut, Hunger, as I found it too pro-IRA and slow. However, I thought that the directing was pretty outstanding and it had a distinct style. Shame is a film I've yet to see, but I've heard plenty of rave reviews. 12 Years a Slave looks to be Mcqueen's masterpiece. It's film-making at it's most effective and powerful. I cam away from the film feeling incredibly moved as I sat there in silence along with the rest of the crowd as the credits came up. 12 Years a Slave dares to bare all in a way that most mainstream films would be afraid of doing. Mcqueen shows all the unflinching brutality to create an overwhelming sense of power. I'm used to watching harrowing and depressing films, but these are normally little known like, Dancer in the Dark and The Seventh Continent. 12 Years a Slave is very much mainstream, yet I still found it incredibly harrowing and brutal. Mainstream audiences are go to in for a nasty shock.The film itself has the look of a classic. Like other modern masterpieces such as, There Will Be Blood and Black Swan, the film looks grainy and the cinematography is quite beautiful. You can almost feel the scorching sun dripping off the screen. The directing is near perfection. Mcqueen goes for an art house vibe without over doing it. He keeps the camera deathly still when filming most of the brutality, such as the unflinching whipping of Solomon near the beginning of the film. This distance adds an added emotional punch for the audience as we're forced to feel every lash on his back. Equally as uncomfortable is the scene where Solomon has been left to hang and we're forced to watch him trying to stand on his tip toes for what feels like an eternity.Another impressive aspect of the film is the stellar performances. Chiwetel is hugely convincing in the lead as the wrongly enslaved Solomon Northup. We feel his pain as he's able to draw such emotion without even saying a word. Michael Fassbender is astounding as the evil plantation owner who treats his slaves as the vermin of the Earth. Fassbender manages to pull off a convincing deep south accent, although his Irish twang is very much still trying to come out. Lupita is also distressing to watch as the slave who has lost all hope, she especially impresses in the greatest scene of the film (more on that later). The supporting cast are all brilliant also. Paul Dano is deliciously evil and Benedict Cumberbatch offers a rare glimpse of humanity among the rich slave owners.12 Years a Slave is a film not to enjoy, but to endure. Many people would fail to see the point in going to see a film which isn't entertaining in the slightest, but I'm not one of those people. I love films which are brave, powerful and deeply emotional. The story of Solomon is a grippingly harrowing one and Steve Mcqueen forces you to watch some disturbing, yet important scenes and directs with a shattering sense of realism. The stand-out moment in the film for me was the whipping of Patsey. This scene possesses so much power and it's enough to break your heart. Mcqueen directs the scene in one long take and the emotion of it all is almost too much to bear. The grisly effects make is all the more harrowing.Another thing I loved about the film was the fantastic music. It's unsettling at times, whether it be the strange drum music on the slave boat or the haunting lyrics to Paul Dano's solo song. However, the main score is the most shattering and only served to elevate the raw emotion it portrays on the screen. It came as no surprise to see Hans Zimmer's name appear on the end credits as he is one of the greatest cinematic composers of all time in my opinion.12 Years a Slave is not an easy film to watch, but it's an important one. If you don't feel deeply moved or depressed when it's finished, then you must be Edwin Epps. It's all the more tragic that this film is true and something like this happened for a long time. It could've very easily become sentimental in its last emotional scene, but Mcqueen made it feel real and removed all the Hollywood gloss to create much more of an impact. It won the best picture Oscar and deservedly so. I can't help but feel that it should've won more though and it's shocking to see that it wasn't even nominated for best cinematography. 12 Years a Slave is harrowing cinema at its very best. Even if you just see it once. Be sure to see it."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw2951439",
      "warningSpoilers": false,
      "date": "29 January 2014",
      "rate": "9",
      "helpful": "14 out of 24 found this helpful.",
      "title": "Degradation and Despair",
      "content": "During the days of the big studio system slavery was a topic that was generally avoided. The standard interpretation of the era's history made such work as Birth Of A Nation and later Gone With The Wind the way we saw the era. It was the Civil Rights Revolution that opened a lot eyes and now with a bit of perspective there, a film like the incredible true story 12 Years A Slave could be made.Not only is it true what happens to Chiwetel Ejifor's character this was hardly a unique situation. Slave catchers were really down on the social scale even at that time, but it was a business to them. So of course if you can't find a genuine runaway slave, why just take any black person that answers a general description. Naturally free black people were on the alert, but these two low lifes who capture him use stealth and planning to bring him to the south and sell him.This story of degradation and despair is a future cinema classic and ought to be required viewing in schools and for those who think any group of human kind deserves to be treated in this way. Slave owners knew exactly what they were doing when it was forbidden to educate a slave. If you remember in Band Of Angels Clark Gable did educate the child who grew up to be Sidney Poitier almost to his dying regret. The hardest thing that Ejifor has to do is conceal his education in order to survive.Michael Fassbender plays the last and worst of a series of plantation owners who Ejifor is in slavery to. Fassbender is amazing to watch as his character sinks into moral degeneracy as more and more he has to justify this system. The saddest story in the film is not our protagonist's. Rather it is that of Lupita Nyong'o who plays a woman separated from her children when she's sold off in a slave market which is placed in someone's parlor. The degradation and misery she endures can only be compared to Schindler's List and clearly 12 Years A Slave was influenced by that Spielberg masterpiece. You have to a Medusa victim not to be moved by Nyong'o on the screen."
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw2911062",
      "warningSpoilers": false,
      "date": "24 November 2013",
      "rate": "5",
      "helpful": "97 out of 209 found this helpful.",
      "title": "2 Hours of Feeling Bad",
      "content": "There is so much badness in our modern world and, because of the non-stop flood of digital information, it's coming at us ALL the time. Therefore, if I'm going to see a film about a horrible subject (which I'm not opposed to), I want to feel like I'm being subjected to it for a reason. I want to feel that the filmmaker has something to add to the conversation about it, draws some conclusions, makes a point that hasn't already been made. Otherwise, I feel like that much more badness has been added to my life for little purpose.That is my problem with \"12 Years a Slave,\" a formally accomplished film but one which left me cold. It's two hours of watching the absolute worst humanity can inflict on itself, and beyond the fairly obvious point that slavery was a horrible dark stain on American history, there isn't much point to be made and certainly no sense of enlightenment on the subject. It's a film executed to make its audience feel bad, and it succeeds tremendously on those terms. But it fails in most other ways that make great movies truly great. I felt terrible for the slaves depicted in the film in the abstract, but the individual characters are never fully developed enough to feel bad about them as actual people. It's a hectoring film, one scene after another of hateful, brutal violence (physical, sexual, emotional) inflicted on one set of human beings by another, and the problem is that the people who will actually go to see this movie don't need to be told how terrible this kind of human evil is, while those who might serve to be enlightened on that subject wouldn't see a movie like this in a million years.Chiwetel Ejiofor gives a solid performance in the central role of a free black man who's kidnapped and sold into slavery for a dozen years. But his character never really came alive for me, and that limited the impact of Ejiofor's performance. Michael Fassbender is just asked to play crazy as a villainous plantation owner, while Brad Pitt shows up toward the film's conclusion and makes a speech about the evils of slavery right before our main character is rescued. This scene and Pitt's appearance as pretty much the only white person in the movie who's not either evil or indifferent seems a bit convenient given that he's a producer of the film.Sarah Paulson is memorable as Fassbender's equally villainous wife, while Alfre Woodard has a tiny role that teases us with the more complex issues about black and white relations in the slavery-era South that this film could have addressed had it been more interested in something other than the literalness of human suffering.Grade: C"
    },
    {
      "username": "parallel_projection",
      "userUrl": "https://www.imdb.com/user/ur34358123",
      "reviewLink": "https://www.imdb.com/review/rw2899071",
      "warningSpoilers": false,
      "date": "3 November 2013",
      "rate": "9",
      "helpful": "38 out of 59 found this helpful.",
      "title": "A disturbing but powerful portrayal of slavery in America",
      "content": "Directed by Steve McQueen and staring Chiwetel Ejiofor, Michael Fassbender, Benedict CUmberbatch, newcomer Lupita Nyong'o, and a ton of other stars, '12 Years a Slave' is based on the memoir of Solomon Northup, a freeman who was living in Saratoga, NY before being tricked, drugged, and sold into slavery in the south.McQueen is an auteur known for his honest and brutal direction, and he keeps filming when others would shut the camera off or look away. While making the picture that much more difficult to sit through, his steadfastness greatly elevates the emotional impact of the film. It's a must-see, if only for educational purposes—just as 'Schindler's List' is used to teach about the Holocaust and 'Milk' about the struggle for gay rights. I'm not trying to compare the events depicted in this film with the events depicted in those I just mentioned, all I'm saying is that they are all equally important in portraying the reality of their respective situations. There is a moment in '12 Years a Slave' when, as a form of punishment, Northup is hanged by his neck, the tips of his toes just able to reach the ground below him. The camera stays on him for a few minutes. It is silent, and all you can do is listen to him struggling for breath. This is one of the more disturbing moments in the film, but not the worst. Eventually, Northup is sold to Edwin Epps, a short-tempered and impulsive plantation owner portrayed by Michael Fassbender. He is by far the most villainous and terrifying character in the film, and Fassbender brilliantly captures his mood swings and tempestuous personality. It is Chiwetel Ejiofor, however, who steals the show. He brings so much life to Northup, and completely disappears into his characters. He is able to depict so many deep levels of emotion, while also bringing dignity to a man who was unwilling to let anyone take away his will to \"live\" rather than just \"survive.\" Additionally, Lupita Nyong'o, in her first big film role, is mesmerizing as Patsey, and hardworking and desperate woman, and the object of her master Epps's attention. She is hated by Epps's wife—masterfully played by Sarah Paulson— and most of the more dramatic moments in the film revolve around her character's tragic story. If I have one complaint, it's that 12 years do not seem to pass by at all, mainly because none of the characters substantially age. Also, Brad Pitt is thrown in for ten minutes to depict a kind-hearted abolitionist, and while he does a good job, it just feels like Brad Pitt on a slave plantation, which is totally out of place. Regardless, while the film may be harrowing and difficult to sit through, it is simply brilliant all the way through, and by far the most honest depiction of slavery that I've ever seen."
    },
    {
      "username": "george.schmidt",
      "userUrl": "https://www.imdb.com/user/ur0937743",
      "reviewLink": "https://www.imdb.com/review/rw2898644",
      "warningSpoilers": true,
      "date": "3 November 2013",
      "rate": "10",
      "helpful": "12 out of 20 found this helpful.",
      "title": "One of the year's very best; Ejiofor gives an Oscar-worthy performance in courage.",
      "content": "12 YEARS A SLAVE (2013) **** Chiwetel Ejiofor, Michael Fassbender, Benedict Cumberbatch, Lupita Nyong'o, Sarah Paulson, Paul Dano, Paul Giamatti, Alfre Woodard, Brad Pitt, Garrett Dillahunt, Michael K. Williams, Kelsey Scott, Quvenzhane Wallis, Cameron Zeigler, Scoot McNairy, Christopher Berry, Bill Camp, Devyn A. Tyler, Willo Jean-Baptiste. Remarkable true- life account of slavery in America based on the biography of freeman African-American Solomon Northup (Ejiofor in an incredible performance that is truly Oscar-worthy), who is tricked and abducted while on a trip from New York to Washington and sold into slavery against his will where he burdens many hardships in his long journey into hell. John Ridley's powerful adaptation of Northup's book is a surprisingly clear-eyed, warts-and-all blinding depiction of how history can be a personal gauntlet in spite of the tremendous odds against surviving. Filmmaker Steve McQueen uses all the archetypes of the Southern 'hospitality' usually seen in the genre of a Civil War treatise but doesn't flinch at all in the underpinnings of what is a true blight of humanity. Equally powerful in their acting (and award noticing) are Fassbender as Solomon's cruelest master with nothing but pure hatred broiling at the surface and a heartbreaking stoic turn by newcomer Nyong'o as the 'personal' slave he terrorizes to no end. One of the year's very best films."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw2940261",
      "warningSpoilers": false,
      "date": "12 January 2014",
      "rate": "",
      "helpful": "17 out of 31 found this helpful.",
      "title": "Absorbing, brutal and moving in a detached and visually beautiful way",
      "content": "A few years ago now, Mel Gibson made Passion of the Christ; a film which essentially is one long tale of suffering of Jesus on his way to the cross. It was a film that I found to be as vacuous as pornography and an ordeal to sit through because I lost all feeling for the character as he became little more than the subject for violence. I mention this because I worried that this film would be the same as it is very much an issue film and much has been written about how numbing it is in terms of the content. I decided to watch it anyway, mainly because of the British involvement in the film – a lot of talent here, not least of which is director Steve McQueen.The story is based on the true story of a free man kidnapped into slavery. As a story it is one of interest but mainly it provides a central tangible point for the audience to identify with and to follow. It also gives us the oft-used narrative device of a character seeing things for the first time as we are (see also the rookie cop etc). In this way it works very well because we never really get lost in the violence or brutality of the film and, despite the claims of some, it never made me numb to it and it never felt like it was being overdone for the sake of it – if anything it builds very well so it get progressively harder to process. The film shows the extent of the system much better than just a series of beatings; it shows that even \"good\" men are part of it, it shows that the options are zero and it shows that it is a world that has no edges – even though we know that Solomon is just a matter of distance from his rightful freedom, we never really feel that way at all because it is never escaping one place or one person.The story is well told to keep close to Solomon while also letting us see the reality and McQueen is excellent as director in how he shows it. In Hunger and Shame he sits back from his subjects in a rather detached but invasion way. It is hard to describe but long, wide shots leave us to observe simple scenes and often the simpler they are the more telling – as Solomon hangs while others go about their business, we understand the reality of this world and how utterly trapped everyone is – again, it is a system, this is just how it works. The relationship with Bobbitt continues to pay dividends because visually the film is stunning, great colors and great shots whether they be unflinching close-ups or wide and long. The use of music is good too – there is no sentimentality to it and when it is used it is subtle. This is not a film that overdoes the violence to hype it, but nor is a film that pulls on the heartstrings – it feels very factual and very realistic within the context of the system, so while the audience flinch at a particular brutal scene, the film itself does not – because this is how it is in the world we are in.The cast give very good performances in support of this goal, so while some of them are basic roles, the people give good presence and don't ham it up. In particular Ejiofor gets the balance right, his desperation and horror is pushed down as much as he can because of how the system he is in works, but he engages and moves throughout. Fassbender likewise walks the line – he is never a pantomime villain but he is still cruel and hateful. Supporting roles from Nyong'o, Dano, Williams and many others is roundly very good with only one misstep which is Pitt, which is a shame – his face is almost too famous and breaks the ensemble feel, plus the virtue of his character also makes his casting in that specific role seem a little bit like a vanity casting for a producer. This is a minor thing though, since he himself is not bad, but anyway the rest of the cast are convincing and engaging.12 Years a Slave looks like it will be just another Oscar-baiting slavery film, but it is much better than that to be fair the awards hype sullies it a little bit. It is absorbing and brutal in its convincing and detached portrayal of this world, complete with strong performances it is a memorable experience and very well made film."
    },
    {
      "username": "chaos-rampant",
      "userUrl": "https://www.imdb.com/user/ur17699578",
      "reviewLink": "https://www.imdb.com/review/rw2936518",
      "warningSpoilers": true,
      "date": "6 January 2014",
      "rate": "",
      "helpful": "27 out of 51 found this helpful.",
      "title": "Persistently avoiding cleansing",
      "content": "Going into a film like this you somewhat know what to expect. You ready yourself for callous suffering without end for no other reason than a system was just set that way, hope snuffed by despair. You know the injustice and stupidity will revolt, because it is just so blatantly wrong it baffles that it would be allowed to go on for even a day in plain sight.We can't avoid the bluntness if we are to confront that world. Slaves are casually stabbed and thrown overboard on the journey south, a mother is separated by her kids in a slave sale, down at the bayous they are beaten, a girl flogged for wanting a piece of soap, treated at best as mischievous kids or at worst as animals. We see how our man is over the years beaten or numbly retreats to protect himself into a hollow shell. But what good does it do if it merely blunts you to cleanse? Serious question here. Most films work in this way, from the Greek model demanding catharsis, a cleansing from evil so that we can go on about our lives. But if we just go on about our lives merely relieved of a burden, has any actual change taken place? If I shed a few tears at a film like this and the next day take out my work stress on my kids, am I really cleansed of the same root ignorance that at one time supported slavery? Southerners were not in support of an apparent evil after all from their pov, but of what they saw as a right or a tradition or a natural necessity.So I'm glad the film does these two things right, it's the only way it can truly be an eye-opener on the subject. It runs the gamut of people who exist today with the same ignorance: among them the young overseer scorned because he was outsmarted, the jealous and neglected wife, the white worker who betrays the letter to jump ahead in his career, the plantation owner who is thoughtful yet won't buy the kid with his mother because of the cost.And offers no catharsis. The exasperation is sweated out with a stoic capacity for having to be in the world, sentimental music doesn't try to waste all the pent-up energy into simple spine-tingling, the world itself is full of texture and sound because past the imposed confines there was still a world that extended in the distance and went on.I would only have the first segment of normal life much longer so that we'd be more deeply torn from our safet. All that staring into a clump of sunset trees in the distance much more intense because somewhere beyond that is still home and a wife, and this is the greatest visual education I could wish for anyone: not giving up into suffering as not losing sight of the horizon where loved ones are. The notion of persistence solely visual in the arduous field work itself. And only a whole separate film could do justice to the richness of slave songs, their call and response, their hidden narrative and spontaneous order.But a film that already calls up these intuitions has worked more than most, and any future film on the subject will have to build on this.No cleansing because there's nothing to so easily pretend like we can cleanse ourselves of and leave behind in the theater, all the evil in the film does not arise from intrinsic evil itself (otherwise we'd never be able to become better persons) but conditional ego and ignorance and we live every day with these things. If you relieve us with catharsis all that energy goes away. If you don't, it becomes a ball of lead that we have swallowed and have to carry with us back home to our kids, so that maybe it can work its own answer in this life."
    },
    {
      "username": "thamanidelgardo-822-410218",
      "userUrl": "https://www.imdb.com/user/ur47452965",
      "reviewLink": "https://www.imdb.com/review/rw2890028",
      "warningSpoilers": false,
      "date": "19 October 2013",
      "rate": "10",
      "helpful": "412 out of 605 found this helpful.",
      "title": "And the Oscar goes to...",
      "content": "chitchens fan  2 hours ago △ ▽ − Well, to begin, I cannot remember the last time I could not get up at the end of a movie. I literally could not rise up from my seat. My body felt as though it were being weighed down by something considerably larger and heavier than myself... History had it's way with me( I am an African American woman). Thank you Mr. McQueen, Mr. Ejiofor, Ms. Nyong'o, Ms. Paulson and others, and yes, even Mr. Fassbender. I am not a film critic nor a movie hobbyist, although I try to stay current, but what I am is a human being trying to understand the various problems and issues within our country. This movie is a potent reminder of why we are where we are as a society today. How man can be so unflinchingly cruel to his fellow man, especially if he looks, speaks or behaves differently, I will never understand."
    },
    {
      "username": "ironhorse_iv",
      "userUrl": "https://www.imdb.com/user/ur34049683",
      "reviewLink": "https://www.imdb.com/review/rw2939725",
      "warningSpoilers": true,
      "date": "11 January 2014",
      "rate": "9",
      "helpful": "11 out of 18 found this helpful.",
      "title": "A powerful movie that brings in new light to the dark topic of slavery.",
      "content": "12 Years a Slave is indeed a very powerful movie. Directed by Steve McQueen, and written by John Ridley, the movie is an adaptation of the 1853 autobiography by Solomon Northup (Chiwetel Ejiofor), a New York State-born free man who was kidnapped in Washington, D.C. in 1841 and sold into slavery in the South. Chiwetel Ejiofor did a great job, acting as Solomon Northup, and it wouldn't surprise me, if he wins a couple of awards for it. The supporting cast is just as amazing. I give mad props to both Benedict Cumberbatch, and Michael Fassbender for their performance as plantation owner, beloved William Ford and crude Edwin Epps. There are too many powerful performances scenes to count, but I had to choice some, it would be, the scene where Solomon is nearly lynch by John Tibeats (Paul Dano) and he is just hanging out there, while the other slaves couldn't do anything about it. Last is the trials and misfortune of Patsey (Lupita Nyong'o) with her being abuse by both Epps and his evil wife played by Sarah Paulsen. The movie doesn't have too much over the top moments, and seem very accurate. The movie puts a lot of insight, you wouldn't see in much modern movies today. First off, there is the good heart, slave owner William Ford. You would never see that in any other movie, as movies about slavery have all slave owners as a crude one-dimension evil human beings. Second off, you wouldn't see a white field hand (Garret Dillahunt) working besides the slaves in other films. To accurately depict the time period of the film, the filmmakers did a great job capturing the language, the look, and locations of the time. Still, the film did take artistic license, and create some new drama like the scene where a sailor kill a slave. One thing, I didn't like about the film is some of the music. Don't get me wrong, I found the songs, Roll Jordan Roll, and the classical American folk music great, but the soundtrack by Han Zimmer is kinda sound not new. Most of the emotional music being play in the background, remind me too much of 'Time' from Han Zimmer's 2010 soundtrack for the film, 'Inception'. It's seem recycled. Another thing that is bothering people is the flow of the film over the 12 years. It seems to go, really quick over the years. When he was kidnapped in the beginning, his children were kids and he looked about mid 30's. Throughout the movie he doesn't look any older at all or aged. The point is, they could have done was to add the age look for the characters because you can't tell that 12 years are going by or let us know that time is passing by. But it didn't feel like 12 years for me. It more felt like a matter of about 4 months. Maybe if they had showed seasons changing or done makeup on the actors to show them getting older it would have been better. About the brutality of the film, it was there, it wasn't too gruesome in my opinion. It was a lot harder to watch 1997's Amistad than this. I wouldn't say, this movie is for all audience, but I do agree, young mature adults should watch it. I don't find the movie, putting a white guilt to anybody, nor do I say, this is a movie trying to start hatred against whites for their ancestor mistakes. If anything, it is part of the healing process, for the most part, I found myself, not anger, but understanding what people went through back then. Most black audiences would agree with me. I have to say, all people of every race need to see this film, even if it's not teaching you anything new that you don't already know. The reason why people should see this film is indeed, while slavery seems like old practice, it still acts upon the modern world through sex trade, and the misused of illegal workers. Such modern sense of slavery need to quickly end. Indeed, if you like this movie, do check out, 1984's TV movie, Solomon Northup's Odyssey starting Avery Brooks. It's well done as well. Overall: While it did had a limited release, it is a must watch."
    },
    {
      "username": "bob-the-movie-man",
      "userUrl": "https://www.imdb.com/user/ur49208568",
      "reviewLink": "https://www.imdb.com/review/rw2940700",
      "warningSpoilers": false,
      "date": "13 January 2014",
      "rate": "9",
      "helpful": "6 out of 8 found this helpful.",
      "title": "A Powerhouse of a British movie with great direction, DP and performances",
      "content": "I love this time of year in the run up to the Oscars – - the real power-house films are coming to the fore. 12 Years a Slave is a case in point: a hard film to watch, but ultimately a must see.The film tells the true story of Solomon Northup living life as a gentleman in Saratoga, New York at a time when the divide between the Northern and Southern states on colour was never wider. Tricked and kidnapped, he is cruelly stripped of his fine clothes, his dignity and his freedom and shipped south to a life of servitude at the hands of a variety of 'owners' , all of them supposedly a'God-fearing Christians, but some distinctly more Christian that others.The film is beautifully shot (by DP of Photography Sean Bobbitt) with long lingering panoramas of bayous and vistas contrasting the beauty and quiet of the landscape with the ugliness and brutality of the plantations. In fact, this film is bound to feature strongly in all of the nominations in the technical categories at the forthcoming awards: lighting, wardrobe, editing all magnificent. And the special effects used in one particularly uncomfortable scene are truly impressive: sometimes you don't need to be in a galaxy far far away to appreciate the subtle arts of a special effect.Londoner Steve McQueen directs with true flair. Some of the shots are long, langourous and without dialogue, letting the audience inside the head of the actor to the point where you want them to cut away because it is becoming too painful to carry on watching. True directorial power. He is certainly not afraid to continue to tackle controversial material head-on, given that this is his follow-on film from sex-addiction film \"Shame\". (For female fans it is worth pointing out that there is one shot in particular – in which he wears loose fitting pantaloons – where Michael Fassbender reveals – ahem – the length to which he went in that earlier film).In the acting department – as for American Hustle – this deserves an award for the ensemble cast who work together splendidly. The big names – Benedict Cumberbatch, Paul Giamatti and Brad Pitt – all perform admirably for the limited time they are on screen. Giamatti in particular (who impressed in his role as the driver in \"Saving Mr Banks\") is particularly chilling as the inappropriately named Freeman, selling on the kidnapped slaves to new owners: a portrait of urbane callousness.But it is the sparring between London-born star Chiwetel Ejiofor and Michael Fassbender, as the evil cotton plantation owner Edwin Epps, that really make the acting sparks fly. It would be no surprise if both actors were Oscar nominated, and indeed a surprise if they were not. Both are outstanding. Interestingly Ejiofor made his film breakthrough in another slavery film, Steven Spielberg's Amistad, before going onto greater things (sarcasm) in Richard Curtis's Love Actually.Also notable is Lupito N'yongo who – astonishingly – makes her acting debut in the role of Patsey, the beautiful but abused love interest of Fassbender's Epps. Finally, acting herself firmly into the category of \"most despised female of the year so far\" is Sarah Paulson as Epps wife, vindictively taking her marital ire out on Patsey. In Django Unchained I was critical of the way in which the plantation owner's wife Mrs Candie – who seemed to be, if not good, not fundamentally evil either – got cruelly, albeit comically, dispatched at the end of the film. No such reservations if Django wants to pay Mistress Epps a visit! My one and only criticism of this amazing film is the music score. I thought a recurring theme sounded startlingly similar to a theme from \"Inception\" and I found myself thinking \"whoever wrote this must be a fan of Hans Zimmer\". Then as the credits rolled, I saw the score was written by . Hans Zimmer. A quick google of the two films' titles reveals that my observation hasn't gone unnoticed by others. A bit of an irritating distraction for me.Many years ago Spielberg's \"Colour Purple\" made a big impression, both with audiences and at the awards. This wonderful albeit gruelling film deserves to do likewise: it is the Colour Purple of 2014. It is a sad and astonishing fact that more than 150 years after this film was set, a minority of our 'civilised' society still judge a person by the colour of their skin. As such, and in the same way as Schindler's List was used as an educational tool, this film could and should be shown in schools as a weapon in the fight against racism."
    }
  ],
  "errorMessage": ""
}