{
  "imDbId": "tt0096283",
  "title": "My Neighbor Totoro",
  "fullTitle": "My Neighbor Totoro (1988)",
  "type": "Movie",
  "year": "1988",
  "items": [
    {
      "publisher": "The A.V. Club",
      "author": "Sam Adams",
      "link": "https://www.avclub.com/my-neighbor-totoro-howl-s-moving-castle-1798176927",
      "rate": "100",
      "content": "Miyazaki so effectively captures the feeling of a child’s life, inside as well as out, that little ones are often mesmerized by the movie, and adults are returned to a time when they could enjoy mystery for its own sake."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/great-movie-my-neighbor-totoro-1993",
      "rate": "100",
      "content": "Here is a children's film made for the world we should live in, rather than the one we occupy. A film with no villains. No fight scenes. No evil adults. No fighting between the two kids. No scary monsters. No darkness before the dawn. A world that is benign. A world where if you meet a strange towering creature in the forest, you curl up on its tummy and have a nap."
    },
    {
      "publisher": "Empire",
      "author": "Dan Jolin",
      "link": "https://www.empireonline.com/movies/reviews/neighbour-totoro-review/",
      "rate": "100",
      "content": "An otherworldly tale of childhood and a definitive work of imagination."
    },
    {
      "publisher": "The Guardian",
      "author": "Steve Rose",
      "link": "https://www.theguardian.com/film/2013/may/23/my-neighbour-totoro-review",
      "rate": "100",
      "content": "Hayao Miyazaki's family fantasy is full of benign spirituality, prelapsarian innocence, but little icky sentiment."
    },
    {
      "publisher": "Time Out",
      "author": "Trevor Johnston",
      "link": "",
      "rate": "100",
      "content": "An animated achievement almost without parallel."
    },
    {
      "publisher": "Slant Magazine",
      "author": "",
      "link": "",
      "rate": "88",
      "content": "It’s a film that proves time and again that life itself is the grandest, most galvanizing of all dramas."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Ted Shen",
      "link": "",
      "rate": "80",
      "content": "Sheer enchantment, this 1989 animated feature is a key early work by Hayao Miyazaki. It exemplifies Ghibli's style of fanciful realism, paying close attention to minute details as well-drawn figures move across a fluid backdrop. It also deals straightforwardly with substantial emotions like fear of death, though at times it veers toward the heart-tugging cuteness of the Pokemon series."
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/movies/my-neighbor-totoro/review/2030049226/",
      "rate": "75",
      "content": "An ideal animated film for young children, it has also found favor among adults who appreciate its unusually gentle, painterly style of animation, a trademark of the film's director, Japan's most renowned animator, Hayao Miyazaki."
    },
    {
      "publisher": "The New York Times",
      "author": "Stephen Holden",
      "link": "https://www.nytimes.com/reviews/movies?res=9F0CE7DC1430F937A25756C0A965958260",
      "rate": "50",
      "content": "When My Neighbor Totoro, which was written and directed by Hayao Miyazaki, is dispensing enchantment, it can be very charming. Too much of the film, however, is taken up with stiff, mechanical chitchat."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1993/digital/features/my-neighbor-totoro-1200432299/",
      "rate": "50",
      "content": "Writer-director Hayao Miyazaki has essentially padded a television half-hour into a sluggish theatrical feature."
    }
  ],
  "errorMessage": ""
}