{
  "imDbId": "tt0096283",
  "title": "My Neighbor Totoro",
  "fullTitle": "My Neighbor Totoro (1988)",
  "type": "Movie",
  "year": "1988",
  "items": [
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2342827",
      "warningSpoilers": false,
      "date": "23 November 2010",
      "rate": "10",
      "helpful": "29 out of 30 found this helpful.",
      "title": "Stunning",
      "content": "I am a huge Studio Ghibli/Miyazaki fan, and My Neighbour Totoro is no exception. In fact it is one of my favourites from them. There are so many wonderful things about My Neighbour Totoro. It is very simple in story and character but it is all very beautiful, charming and touching. The animation is typical Ghibli, ethereal-looking and just ravishing to watch, while the music is one of my favourite scores in a Ghibli film. The story is simple, but I loved the simplicity, it had such a pleasant atmosphere to it, and the characters are engaging with great chemistry together. I have very little to complain about the voice acting either, everybody did a fine job. In conclusion, in my opinion this is an animated classic. 10/10 Bethany Cox"
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw1747075",
      "warningSpoilers": false,
      "date": "15 October 2007",
      "rate": "10",
      "helpful": "36 out of 39 found this helpful.",
      "title": "Another miracle from Hayao Miyazaki",
      "content": "I absolutely agree with Roger Ebert who called \"My Neighbor Totoro\", \"One of the most beloved of all family films\". Its colorfully bright and sparkling animation is enchanting. It is incredibly realistic and at the same time makes us along with two main characters, the young sisters ready for a miracle to happen any minute. The gentle story is touching, uplifting, funny, and tender without being overly sentimental or didactic. The film takes place in the early 50s, when 10-year-old Satsuki and her baby sister, curious and energetic 4-year-old Mei spend one summer in an old house in the country side with their University professor father while their mother recovers from a serious illness in the nearby hospital. The great master Hayao Miyazaki remembers well what it is like to be a child, to see magic in the everyday life and be always ready to encounter it. This ability usually disappears as the child becomes adult but it stays forever in a few chosen, and they become the visionary Artists - just like Miyazaki himself. The film is partially autobiographical for the writer/director/storyboard artist. \"When Miyazaki and his brothers were children, his mother suffered from spinal tuberculosis for nine years, and spent much of her time hospitalized. It is implied, yet never revealed in the film, that Satsuki and Mei's mother also suffers from tuberculosis. He once said the film would have been too painful for him to make if the two protagonists were boys instead of girls.\" (From the IMDb film trivia)Totoro of the title is an adorable funny blue forest spirit who lives in the nest beneath a huge tree and makes the trees grow and the winds blow. Totoro becomes the friend and protector of the sisters and one day he sends them on the bus journey that is like nothing they and the viewers could ever imagine. I wish I could ride that cat bus. What a wild and kind imagination an artist should have to create it. How much happier we all are knowing that Hayao Miyazaki exists and makes his amazing films at the Studio Ghibli for which King Totoro is the mascot."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3562755",
      "warningSpoilers": false,
      "date": "16 October 2016",
      "rate": "8",
      "helpful": "11 out of 11 found this helpful.",
      "title": "cute and sweet",
      "content": "Professor Tatsuo Kusakabe moves his daughters Satsuki and Mei to an old house in the country near the hospital where his wife Yasuko is convalescencing. The girls find tiny soot sprites scurrying away from the light. Mei discovers forest spirit Totoro sleeping in a giant tree. The girls are waiting for their father at the bus stop. He's late. Mei is falling asleep when Totoro shows up. Satsuki gives him an umbrella and he's overjoyed. He gives the girls a gift of acorns as he boards the cat-bus.It's a gentle story with cute characters and an adorable spirit from legendary animator Hayao Miyazaki. The drama isn't that heightened but it's a great coming-of-age story nonetheless. Totoro discovering the fun of raindrops on the umbrella is pure joy. There is simply an endearing gentleness that extend even to the closing credits animation."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1110424",
      "warningSpoilers": false,
      "date": "24 June 2005",
      "rate": "10",
      "helpful": "23 out of 26 found this helpful.",
      "title": "I loved the film but know there are now three versions on video in the USA",
      "content": "Although so many reviews have been written here for the movie, I am including one because there are now 3 different video versions of this movie and all three are certainly worth watching.Originally in the United States, 20th Century Fox released the movie on video in the early 90s. This is the version I first saw. Then, a few years later, Studio Ghibli (who made this film in Japan) signed a deal for exclusivity with Disney. This has resulted in a more widespread release of their pictures but has also recently resulted in a new dubbed version of the movie. The Disney version has, perhaps, more realistic voices--as the children sound more like kids. However, I prefer the original voices--particularly the voice for Mei. I think it's the same lady who does the voice of Angelica on Rugrats.Finally, there is the original Japanese version that is subtitled into English. I am a bit compulsive and actually have seen all three versions! I think the subtitled is best because there are also a few tiny scenes that are in neither dubbed versions (not enough to change the story, but still I prefer a complete film). Of the dubbed, my loyalty is to the Fox version--it just sounds more charming and cute.Now about the movie itself, the animation is about the best you'll find anywhere--particularly the gorgeous backgrounds. They seem to yell out \"QUALITY PRODUCTION\" throughout. The story, though very simple, is very captivating and the emotional response the film triggers is amazing. Anyone (except a total curmudgeon) will love this charming and simple film. See the movie, as it's about as good an animated film as you can find--regardless of where it was made."
    },
    {
      "username": "Spectravideo",
      "userUrl": "https://www.imdb.com/user/ur0510266",
      "reviewLink": "https://www.imdb.com/review/rw0989583",
      "warningSpoilers": false,
      "date": "1 January 2005",
      "rate": "10",
      "helpful": "345 out of 381 found this helpful.",
      "title": "This is a great film!",
      "content": "There is no compulsory villain in this wonderfully animated film, no moral lessons, no standard blue print story, and the characters will definitely not break out in a song. Thank God! It's simply a great film for all ages. Don't mind if the soundtrack isn't dubbed to your native language, my kids (4 and 6 years old) could easily follow the story with just a few helpers. Japanese is a wonderful language. The film has great direction, beautiful backgrounds and a mystical, pleasant aura throughout. There's nothing like this, I promise you. It's idyllic, for the most part, but still with an exciting story that unfolds into something very unexpected."
    },
    {
      "username": "ghostofdaniel",
      "userUrl": "https://www.imdb.com/user/ur3565400",
      "reviewLink": "https://www.imdb.com/review/rw0263092",
      "warningSpoilers": false,
      "date": "18 August 2004",
      "rate": "10",
      "helpful": "306 out of 330 found this helpful.",
      "title": "The cutest movie I ever saw !",
      "content": "My favorite Miyazaki's movie is \"Princess Mononoke\" on a graphical scale. But on a \"charming scale\", this one is really the best.Even the Disney movies are not so charming than this movie. Poetic, charming, cute, I can't find the words to describe the good this movie made to me. Miyazaki brings us into the wonderlands of the children, better than \"Alice in wonderland\" or \"Peter pan\".In fact, Miyazaki makes us loving children. In the movie, the children run, shout all time, laugh, cry, and so on. In the real world, I hate this. In normal movies I hate this too. But, here, every actions of the two little girls touch us deep in our heart. We learn to love children's world.Every one of us will have a smile on this face, from the beginning to the end of this movie.My favorite scene is the first encounter between Mei and Totoro. It's fun, poetic, and charming. Miyazaki succeeds to make a movie enjoyable for the very little kids (4 y.o.) and for the adult audience. It's very rare to succeed doing that !Really, a masterpiece !10/10 !"
    },
    {
      "username": "burgan6203",
      "userUrl": "https://www.imdb.com/user/ur2198981",
      "reviewLink": "https://www.imdb.com/review/rw0263095",
      "warningSpoilers": false,
      "date": "29 September 2004",
      "rate": "10",
      "helpful": "162 out of 186 found this helpful.",
      "title": "This is the movie I watch to restore my faith in humanity",
      "content": "I first saw \"My Neighbor Totoro\" when I was maybe seven.At the time, I thought that it was really boring(that was still when I liked Disney movies). Years later, when I discovered \"Princess Mononoke\" I learned that MNT was by the same director and watched it again. And I find that I appreciate this film a whole lot more now then I did when I was seven.The animation is absolutely stunning(as with all Miyazaki films)and the story is deceptively simple, told with patient, subtle attention to detail. The best example IMO is the scene where Mei falls asleep on Totoro's stomach.It's fruitless to try and describe it;you have to see it for yourself.In closing, I would just like to say that I can't wait for a decent DVD to arrive so I can view this quiet masterpiece in widescreen in Japanese with subtitles."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw5833920",
      "warningSpoilers": false,
      "date": "18 June 2020",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "A Totoro for everyone",
      "content": "Or one for two would also be cool. Now I'm not sure what the Totoro is or was based on. But I know when it comes to imagination Studio Ghibli had an abundance of it. Which is present here too. You have to suspend disbelief and let fantasy reign. Your inner kid will thank you for it.Another reviewer says this movie restores his faith in humanity in him. There are many things one can take from watching this, but I would think this is one of the best takes anyone can get. Funny, playful, dreamy, but still coherent throughout, this really takes your mind of things. Not to mention our main characters, who have their worries, but also can rely on Totoro and others to give them some peace of their mind"
    },
    {
      "username": "EarthwormJimFan",
      "userUrl": "https://www.imdb.com/user/ur4838687",
      "reviewLink": "https://www.imdb.com/review/rw1025088",
      "warningSpoilers": false,
      "date": "20 February 2005",
      "rate": "10",
      "helpful": "176 out of 197 found this helpful.",
      "title": "A delightful, touching, timeless classic!",
      "content": "From the brilliant \"Walt Disney of Japan\", Hayao Miyazaki, comes a wonderful soothing film that everyone will simply embrace. Featuring stunning animation, endearing personable characters, and a heart-tugging storyline that's simple, enchanting, and even dramatic.Sometimes you feel like you're not watching an animated children's movie, because the characters (particularly the children) and the storyline seem so realistic. There's no bad guy, no song numbers, and no references to pop-culture. Most cartoons (especially Disney) feature these and it gets old and routine. Here we have a break from all of that and get a real masterpiece.Miraculously, Totoro doesn't talk, and yet you can still understand what the lovable furry creature is thinking with his endearing actions. And the six-legged CatBus is undeniably one of the most imaginative characters in animation history. And the human characters are also remarkable. Mei and Satsuki act like little girls, not like kids who are smarter than adults (a routine toons today are guilty of).I loved Totoro when I was a small child and I always will. When I have children of my own someday, I will show them Totoro instead of toy commercials like Dora and Elmo's world.BOTTOM LINE: A masterpiece... pure and simple."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6226267",
      "warningSpoilers": false,
      "date": "1 November 2020",
      "rate": "8",
      "helpful": "13 out of 15 found this helpful.",
      "title": "Stunningly Charmingly Beautiful...",
      "content": "A phenomenally, enchantingly crafted piece of animation that will restore your faith in just about anything. Take a look at a world through the eyes of two young girls, Satsuki and Mei who are both desperately missing their hospitalised mother and coming to terms with it in their own unique way and, with a bit of help, from some interesting friends they find in their neighbourhood. As honest as the day is long, there's something in here for everyone if you can find a way to open your mind to it."
    },
    {
      "username": "ww_sketcher",
      "userUrl": "https://www.imdb.com/user/ur3206599",
      "reviewLink": "https://www.imdb.com/review/rw1054721",
      "warningSpoilers": false,
      "date": "5 April 2005",
      "rate": "9",
      "helpful": "82 out of 94 found this helpful.",
      "title": "Totoro is a Winner",
      "content": "Miyazaki's My Neighbor Totoro is a film that should be able to put a smile on any viewers face, and without a doubt, it'll take you on one of the most whimsical and fantastic journey's ever.My Neighbor Totoro is a story that definitely something children can relate with, as i watched this with someone, they immediately paused the film and asked if this reminded me of being 4 years old again. This film really connects with people. But it's far from a quality nostalgia piece, it's well animated, beautiful, avoids cliché stereotypes (from both typical of the Anime genre and Children's Fantasy films), and is beautifully filmed (see scenes such as the girls waiting for the bus with Totoro and the scene where the magic nuts and seeds grow with the help of Totoro).Even the English dub done by Fox isn't as bad everyone states. I've seen the Japanese version, and i'd have to say it's a mixed-bag between having Mei's voice sounds a bit too bratty for the English version, or having the Father's voice sound a bit awkward and perhaps not as caring in the Japanese version. Disney is said to be releasing a re-dub in mid-to-late 2005, so perhaps that will even out the controversy.This film may not reach the heights of other Anime classics (mainly it's double bill with Grave of the Fireflies, or Miyazaki's other masterpieces Princess Mononoke and Spirited Away), however this will definitely be high on any film lovers list, and is definitely a high water mark of it's genre.A solid 9/10, This film is next to impossible to watch without it pushing a smile out of your face."
    },
    {
      "username": "billf7",
      "userUrl": "https://www.imdb.com/user/ur4796106",
      "reviewLink": "https://www.imdb.com/review/rw1020182",
      "warningSpoilers": false,
      "date": "13 February 2005",
      "rate": "10",
      "helpful": "204 out of 217 found this helpful.",
      "title": "The kind of film that stays with you afterwards...",
      "content": "I first watched this film in Japanese with a 12 year old translating for me and I still thought it was incredible. There are so many wonderful touches, like a tin can in the stream while the kids are fascinated by a fish, or the flying scenes (I'm convinced that Ang Lee thought of Miyazaki when he made The Hulk, just in terms of the jumping scenes) that show a curious mind at work throughout the picture. I also love the sense of magic and innocence (and the lack of violence) which pervades the movie. It is a real antidote from the Disney formula which always involves a villain being trashed at the end. This is a film about the wonder of being a child and experiencing something incredible which adults can't see but recognize nonetheless. It works for any age as well. Enjoy."
    },
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw3734924",
      "warningSpoilers": true,
      "date": "20 June 2017",
      "rate": "",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Totoro",
      "content": "at the first sigh - the film of a single character. a girl. and a Totoro. in a station. this is all. the rain. and the silence. and nothing more. because all is well known and the magic works in perfect manner. and this did this animation entrance in deep yourself . because its simplicity, its touching story, its science to say basic things in happy manner are more than virtues. it is a precious gift. for remember yourself."
    },
    {
      "username": "jmjolnir",
      "userUrl": "https://www.imdb.com/user/ur2866175",
      "reviewLink": "https://www.imdb.com/review/rw0263078",
      "warningSpoilers": false,
      "date": "25 November 2003",
      "rate": "9",
      "helpful": "513 out of 542 found this helpful.",
      "title": "A kids movie?",
      "content": "Picture if you will, a 27 year old male, scanning through his dvd collection, trying to figure out what to watch, on a boring night at home. Suddenly, he stops at My Neighbor Totoro and smiles. Well, that's a pretty typical happenning around the house here.Miyazaki created a true masterpiece with this film. It has everything a person, of any age, could want. There are points that it is hilarious, a few points where it makes one slightly nervous, the animation is outstanding (as with all Miyazaki films), and aside from lacking a little bit in plot (what movie doesn't nowadays?), the story is wonderful.One of the things that makes this film shine, at least for me, is that there is absolutely no antagonist role. No bad guy whatsoever, and only a genius like Miyazaki could pull that off.Is this a childrens movie? Yes, of course it is. Is it a movie only for children? Well... maybe for the inner child inside all of us. There's humour in this movie that the young will laugh at, and there's a bit of humour in the movie that only adults will fully catch and appreciate, without it being \"adult humour\".I would reccommend, and have reccommended this film to anyone that would listen.Thank you again Miyazaki Sensei."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw4629467",
      "warningSpoilers": false,
      "date": "6 February 2019",
      "rate": "8",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Riveting, visually sumptuous and marvellous animated movie by the great Hayao Miyazaki",
      "content": "Fascinating and wonderful cartoon movie by the genius Hayao Miyazaki . This magnificent cartoon movie concerns Japanese legends , and forest spirits . Exciting and rather good film set in the fifities about a Japanese family moves to country , being formed by the University professor father and his children : Salsaki and her younger sister Lucy whose new house in the country is filled with magic , including strange creatures as some black dusty balls and especially by Tororo . It is a cuddly , friendly animal that can fly , if weird mix of bear , owl , cat and seal with a gentle rear and whiskers . Naturally , every time the two sisters get into mischief , the sympathetic Totoro is there to rescue then . Meanwhile their mummy recuperates from Tuberculosis in hospital and only gradually becomes aware that something's hanging in the trees outside .This wonderful film is plenty of fantasy , adventures, spectacular images and with ecological message . The picture is narrated with sensibility and sense of wonder and being quite entertaining . This is the animated movie that first brought Miyazaki international attention , it remains as a cartoon movie achievement almost without parallel. The first half delicately captures both quietness and mystery as two little girls move with their daddy to remote new mansion in the countryside , inhabited by strange spirits . While younger spectators will adore the funny creatures : Tororo , Kodamas , the twelve-legged cat-bus that can be only seen by kiddies ; adults will perhaps best appreciate the movie's delicate rending of atmosphere and its attuned understanding of the wonders and anxieties of infancy . It contains a great sestimentality and sensibility , it will be utterly refreshing to those raised on a diet of Walt Disney . The protagonist animal , house-sized Totoro steals the show , it is a giant cat-alike that can fly and has a magic bus which only can be seen by children . This stunning and superbly imagined film will appeal both , children and adults .The motion picture was splendidly realized by Hayao Miyazaki , he personally corrected or redrew more than 80,000 of the film's thousands animation cels . Being accompanied by sensitive music score composed by his usual musician , Joe Hisaishi. It packs up a big resonance , weight and delicacy that make it all an awesome film . Never remotely didactic , the movie is ultimately a children fantasy that touches brief thoughtful issues dealing with sintoism religion , ethical , ecological and kiddies psychological themes . It has some self-biographic elements as Miyazaki's mother suffered TB for 9 years , and she standed in hospital . It followed a Short movie , titled ¨Mei and the cat-bus¨ it is only exhibited in Ghibli studios . My neighbour Tororo premiered in cinemas along with ¨The tomb of glowworms ¨ (1988) by Isao Takahata and failed at boxoffice . However , later on Tororo has turned to be a real classic movie . As Tororo is an icon or brand in Ghibli Studios , getting a great merchandising . No other Word : a masterpiece Miyazaki wasn't yet a culture hero in Japan when made this animated mythic adventure ; later on , he directed ¨Princess Monokone¨converted the first of any kind to gross over the box office in Japan and around the world , it raised him to a status approaching living national treasure . Miyazaki also directed other excellent cartoon movies as ¨Lupin¨ (1978) , Castle of Cagliostro¨ (1979) , ¨Nausica of the valley of wind¨ , ¨Howl's moving castle¨ , ¨Laputa castle of the sky¨ ,¨Porco Rosso¨ , ¨Kiki's delivery service¨, ¨Chihiro¨ or ¨Spirited away¨: the highest grossing Japanese film ever , and this cult movie : ¨My neighbour Tororo¨ ."
    },
    {
      "username": "DICK STEEL",
      "userUrl": "https://www.imdb.com/user/ur0317399",
      "reviewLink": "https://www.imdb.com/review/rw1671426",
      "warningSpoilers": false,
      "date": "10 June 2007",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "A Nutshell Review: (DVD) My Neighbor Totoro (1988)",
      "content": "I have never sat through a complete Hayao Miyazaki animated movie despite all the good vibes, reviews, recommendations I got from friends. Actually I have Spirited Away on DVD just waiting to be watched, but for some reason it still sits on my desk amongst others. Well, a good friend from up north passed me THREE Miyazaki DVDs, and given I'm going to where he is tomorrow visiting someone who mentioned during a visit to the previous movie set, how the scene was reminiscent of My Neighbor Totoro, I thought I'll pop that DVD and give it a watch.I was blown away. This IS animation, with a story suitable for kids to understand, and for adults to get a kick out of given its fantastical pieces. I shan't spoil the movie by spelling out the storyline, but suffice to say it centers very simply on a family, the father a professor who has recently uprooted his family of two girls, Satsuki and Mai, to the countryside, to provide a healthier environment for their ailing mom, currently in the hospital, to recuperate in. Thus begins the children's adventures in the country, with its lush greenery, and of course, with their new found friend, a giant ghibil known as Totoro, with seemingly magical powers of flight and fantasy.And it is in its simplicity where its beauty shines through. It is always said that children can see things that adults don't, and hence, there's a constant question as to whether Totoro is real, or not, and if so, how its interactions with the kids are possible. It's not just Totoro itself which is out of this world, but I totally like that grinning cat-bus.This is the kind of animated movie that our local animation production houses should be looking at. First and foremost, the story. While it doesn't contain huge battle sequences, complex or multiple characters for the sake of stuffing the movie, it goes to show that the story matters, in its ability to touch and resonate with audiences young and old (while the young ones go to the cinemas, don't forget the adults have to bring them too, and somehow you have to entertain them as well without being too complex for the little ones to understand).The character designs are also kept simple, but nonetheless effective. The animation here is top notch despite it being 2D, as are the cast who voiced the characters. The acid test here is whether the movie can stand the test of time, and watching it close to 20 years after it was made, the answer is a resounding yes, it passed with flying colours. There are plenty of moments where you go \"so cute!\" without it being saccharine, or trying too hard, and that is indeed remarkable. Characterization is superb, especially Mai, whom I think everyone who has a kid sister, would be able to relate to. That's how realistic I thought she was!Everything in this movie works well together, like a fine orchestra performing its pieces with precision yet with lots of heart. I do feel compelled to pop in and watch all the other Hayao Miyazaki DVDs I have in my collection, but I have to travel tomorrow and be away the next few days. You can be sure however, I will be back and complete watching them all real soon!I like Tonari no Totoro, certainly one of the best movies I've seen!"
    },
    {
      "username": "Jeremy Bristol",
      "userUrl": "https://www.imdb.com/user/ur1198449",
      "reviewLink": "https://www.imdb.com/review/rw0263014",
      "warningSpoilers": false,
      "date": "31 May 2001",
      "rate": "9",
      "helpful": "90 out of 120 found this helpful.",
      "title": "A superb, uncynical journey into the imagination. Not so great dubbing, though.",
      "content": "This movie, set in Japan in the early fifties, is director Miyazaki's tribute to his mother (who suffered from tuberculosis, just like Satsuki and Mei's mother), his childhood home, and childhood innocence. Although some people who watch this movie wonder where the Americans are (this is post-WWII Japan, after all) and why so little screen time is spent on the girls' mother, but that may be partly due to the dubbing.Americans: First of all, the house the girls move into is rather European in design (with doorknobs, and an attic, and a front porch) despite the Japanese style bath and occasional sliding door. Secondly, Mei and Satsuki are really into Western fairy tales (the are brief glimpses of Japanese translations of The Three Billy Goats Gruff and other stories, along with Mei inadvertently re-enacting scenes from Alice in Wonderland and Chronicles of Narnia). On top of that, according to Helen McCarthy and other Miyazaki experts, the name \"Totoro\" is little Mei's mispronunciation of the Japanese transliteration of the English word \"troll\" (\"tororo,\" which the Japanese would pronounce like \"tololo\" because they do not distinguish between r's and l's). This is why an accurate dubbed version is nearly impossible (like any little girl, Mei mispronounces a lot of words).The Mother: I think this movie is entirely about the mother. Throughout, you see them subtly (almost too subtly at times) change from completely carefree to terrified with each scene involving the mother. This parallels Satsuki's coming of age subplot (she's ten and like anyone that age she is self-conscious about believing in Santa, or in this case Totoro). There's a little bit of both in the culturally-shocking--though completely innocent--bath scene (both girls take a bath with their father during a wind storm).Really, though, My Neighbor Totoro is less about story than it is about the imagination of children.Although the animation is a little dated and a bit jerky at times, the direction is absolutely top notch. There is enough visual creativity to rival an average Hitchcock film (Miyazaki's a huge fan of Hitch: check out the long wait at the bus stop, which is reminiscent of North by Northwest). Highlights include a Mary Poppins-esque ride on an Oriental top, a beautifully animated storm, Mei's nap on the slowly rising and falling chest of the giant totoro, and a cat-bus complete with headlight eyes."
    },
    {
      "username": "CuriosityKilledShawn",
      "userUrl": "https://www.imdb.com/user/ur0102816",
      "reviewLink": "https://www.imdb.com/review/rw3383592",
      "warningSpoilers": true,
      "date": "29 December 2015",
      "rate": "6",
      "helpful": "93 out of 145 found this helpful.",
      "title": "Where's the rest of it?",
      "content": "It pains me to give it an average rating, but the fact that I wanted more of it proves that I was enjoying what we got before it came to an abrupt end. I was certain that I had accidentally hit the chapter skip button my remote, but nope, I did indeed watch the whole movie.It's summer 1955 and very cute and curious 4-year-old Mei and her sister Satsuki move out into the country with their dad while their mother is in hospital. The creaky, dusty old house that they move into appears to be hot spot for forest spirits and magical creatures. As with all Hayao Miyazaki movies there is a heavy theme of nature being beautiful and the Earth being precious but where is the story?Mei soon meets \"Totoro\" a giant cat/rabbit thing, who does...pretty much nothing. Totoro is barely IN the movie. I've seen pictures of him for years, I even carry around a Totoro satchel at work. I assumed that the movie would be filled with their wondrous discoveries, summertime adventures, and, y'know, some kind of PLOT! But nope. He's barely in it. Seriously, where is the rest of this film? I assume all those picture I saw were merely fan art and not stills from the actual film.At one point Mei runs off to find her mother but gets lost on her way to the hospital. Satsuki enlists Totoro to help her and he summons the Catbus to locate Mei and take them both to the hospital and the film ends there. That's it! My jaw was on the floor when the credits began to roll, and not in a good way.The animation is simply beautiful and is the perfect antidote to the ostentatious horror of modern CGI animated movies, the kids are cute, and Totoro (all 2 minutes he has on screen) is one of the most huggable characters ever created, but I am sorry I have to rate this on the lower rung of Miyazaki movies. There should have been more to this."
    },
    {
      "username": "WeAreLive",
      "userUrl": "https://www.imdb.com/user/ur79460801",
      "reviewLink": "https://www.imdb.com/review/rw5606411",
      "warningSpoilers": false,
      "date": "4 April 2020",
      "rate": "7",
      "helpful": "5 out of 5 found this helpful.",
      "title": "A bit more childish compared to the other studio ghibli movies but it was still good",
      "content": "Two young girls, 10-year-old Satsuki and her 4-year-old sister Mei, move into a house in the country with their father to be closer to their hospitalized mother. Satsuki and Mei discover that the nearby forest is inhabited by magical creatures called Totoros (pronounced toe-toe-ro). They soon befriend these Totoros, and have several magical adventures.Like I said in the title even though I do find it a bit more childish compared to the other films I thought it was a fun watch especially with how cute totoro plus as i am quirented I have been watch quite a few studio ghibli films on Netflix. So expect reviews for those.The dub was also good, it was nice seeing Tim Daly (the voice of Superman) in an anime dub.Overall if you are looking for something for your kids to enjoy I highly recommend this film.Edit 10/11/20i saw the old dub today and it was fairly decent as well."
    },
    {
      "username": "jzappa",
      "userUrl": "https://www.imdb.com/user/ur8625456",
      "reviewLink": "https://www.imdb.com/review/rw2062650",
      "warningSpoilers": false,
      "date": "6 May 2009",
      "rate": "8",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Miyazaki's Absolutely Hilarious, Culturally Significant Story of Existence, Location and Expedition, Rather Than Rivalry and Danger.",
      "content": "This culturally significant Kodomo anime has become one of the most endeared of all family films without ever having been much popularized or sponsored, which is a testament to its magic. This is one of the tenderly hand-crafted works of Hayao Miyazaki, perhaps the greatest of the Japanese animators, yet his collaborator at the Ghibli Studios, Isao Takahata, who fashioned Grave of the Fireflies, may be his rival. Miyazaki has not until quite lately used computers to animate his films. They are drawn a frame at a time, the time-honored way, with the master himself providing tens of thousands of the frames.Miyazaki's films are in particular viscerally entrancing, using a watercolor look for the backgrounds and working within the unique anime tradition of characters with big round eyes and mouths that can be as minute as a fleck or as enormous as a cave. They also have an spontaneous authenticity in the way they mind minutiae.The movie tells the story of two young sisters who share a wonderful bond. As it opens, their father is driving them to their new house, near a boundless forest. Their mother, who is ill, has been moved to a hospital in this community. Now think about that. The film is about two girls, not two boys or a boy and a girl, as all American cartoon films would be. It has a resolute and loving father, in contradiction to the recent Hollywood affinity for selfish or absent fathers. Their mother is sick: Does sickness happen in American family cartoons?A neighbor boy later tells them their new house is haunted. But not haunted in the American sense, with ghosts or forbidding creations. When the girls let light into the shadow, they get just a peek of little black fuzzy dots scampering to refuge. ''Probably just dust bunnies,'' says their father, but there is an old nanny who has been employed to look after them, and she suggests that they are ''soot sprites,'' which like empty houses, and will pack up and leave when they hear laughter. Perhaps I'm reading too much in, but during this scene, I feel like I caught a brief reference to Ingmar Bergman's Through a Glass Darkly, as one sister stares transfixed at a crack in the wall.Assent to how the father composedly receives their account of arcane critters. Are sprites and totoros for real? They surely do in the minds of the girls. So do other hilarious beasts, such as the Cat Bus, which bustles through the forest on eight fast paws, its big eyes working as headlights. Instead of letting the children be scared of hauntings and the soundness of their own minds, the elders teach them to like and enjoy it all. They go along with it rather than irrationally making them feel silly.While it's not necessarily clear whether or not the adults actually consider them, not once does Miyazaki trot out the relic children's literature adage of The Adults Who Think The Child Is A Liar, So Child Is Going To Have To Save The World Without Them. This welcoming approach to accustomed Japanese spirit-creatures imparts a telling distinction between our two cultures. In America, there must always be something to fear, always a scapegoat, always something or someone to antagonize. No matter how equally violent or aggressive the history is of Japan, they do not thrive on fear factors. It is a beacon of great hope and pleasure to me that family films are the rudimentary place where cultural difference is easiest to discern in the movies.My Neighbor Totoro is made of existence, location and expedition, not on rivalry and danger. This is made crystal in the engrossingly extensive sequences involving totoros, which actually are not Japanese myth, but were indeed created by Miyazaki specifically for this movie. In these sequences, Miyazaki gets no mileage out of any trite ideas about the dark and dreadful forest. It's only nature. Is the film sometimes corny and absurd? Yes, but it knows when to be quiet and real.One of the funniest scenes I think I've ever seen on film occurs when the girls go to meet their father's bus. But the hour grows late and the woods grow dark. Without a sound, matter-of-factly, the giant totoro joins them at the bus stop, standing to one side as if it's been there the whole time. It starts to rain. The girls have umbrellas, and give one to the totoro, who is fascinated by the raindrops on the umbrella, and jumps up and down to render free a downrush of drops from the trees. Watch how coolly and constructively the scene has been handled, with the night, the forest, the lateness of the father seen as a circumstance, not an omen. The movie needs no villains. I remember that Winnie the Pooh also had no evil characters at first, but that in its new American version evil weasels have been interposed into his benevolent setting.But it would never have won its worldwide audience simply owing to its fuzzy heart. It is also full of mortal humor in the manner in which it perceives the two exceptionally authentic, realistic little girls, and I refer to their characterizations, not their physicality. It is side- splitting in the scenes involving the totoro, and in the scenes with the ridiculous Cat Bus. It is a little tearful, a little hair-raising, a little out of the blue and a little enlightening, just like life itself. The film expresses a refreshing ideology with Miyazaki later deepens and defines in his more recent films. Look at the minimal amount of external things in these girls' lives, or their father's, or the nanny's. Their story exists as a situation rather than a plot, and suggests that the uncertainty of life and the makeshifts of invention afford all the enterprising escapades one needs."
    },
    {
      "username": "marka_dogg",
      "userUrl": "https://www.imdb.com/user/ur3438321",
      "reviewLink": "https://www.imdb.com/review/rw1173276",
      "warningSpoilers": false,
      "date": "15 September 2005",
      "rate": "10",
      "helpful": "93 out of 101 found this helpful.",
      "title": "Wonderfully Magical!",
      "content": "Like all Miyazaki films, this one is absolutely sacred. Some parts are reminiscent of Laputa: Castle in the Sky and Spirited Away (and Alice in Wonderland by extension), but Totoro stands out as probably the most unique of them all.The premise is nice and simple, which works brilliantly because the plot is established as a foundation without hindering the experience of the movie itself. The viewer is allowed unrestricted access and exploration of the messages offered by the film.In addition, Totoro is not bound by any rules of traditional storytelling. Instead, it presents occurrences that touch on a fundamental human level that is so deep and profound that it will have you feeling a range of emotions. There are so many layers to this movie, each one meaningful and special. From community building to the love of a family to sibling relationships to facing the unknown; everyone can take away something personal from this movie.Perhaps the most sacred aspect of the film, however, is that it reminds us that life is magical. Not all of us have a neighbor like Totoro, but we are all fortunate in different ways. Each of us has something to treasure, something that brings joy and comfort.Totoro is special in that it frees the viewer to be a child again and to contemplate the world through a perspective that we have perhaps forgotten. Everything is new and interesting and beautiful, from a crumbling porch to an acorn seed. We live in a magical world, and it is definitely worth taking the time to appreciate this."
    },
    {
      "username": "rsa5387",
      "userUrl": "https://www.imdb.com/user/ur3629020",
      "reviewLink": "https://www.imdb.com/review/rw1931368",
      "warningSpoilers": false,
      "date": "17 August 2008",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Essential Viewing",
      "content": "I was initially skeptical on the quality of this one, but surprisingly this film was both engaging and beautiful from start to finish. Loosely based on Miyazakis own childhood, My Neighbor Totoro is a simplistic story with a kind of charm, depth, and broad appeal that makes it irresistible. When two girls move to a new farmhouse to be closer to their ailing mother, they have to deal with some of life's more eccentric experiences, that of impending death and incredible magic. At its heart, its about the uninhibited curiosity of childhood, and the innocence in accepting everything without question, to such an extent that magic is a very real reality. The otherworldly in this film, comes in the form of Totoro, an animal spirit who is the guardian of the forest near the girls home. Overall, this film is absolutely spectacular. Kids will love it, though some of the deeper meaning will be lost on them. Adults will also love it, as a nostalgic ride through childhood and for some of the more profound themes running throughout the film. Technically, though made in 1988, the animation in this film looks every bit as stunning today. Totoros forest and the many quiet landscape shots are absolutely gorgeous. Disney, eat your heart out. The film is paced slow, letting the film unfurl at a relaxing pace through its scant 86 minute runtime. The lethargic pace, along with Miyazakis expressive camera pans and attention to detail lend the girls discovery of their home/the forest, the famous cat bus scene, and every moment with Totoro a very 360 degree, hypnotic feel. The new English dub is well done without losing much in translation, retaining the witty and lighthearted exchanges from the original. Overall, this films serves as a great introduction into the world of Miyazaki, and remains a timeless classic in its own right. Miyazakis most lighthearted venture also remains his most introspective and grounded work. Even without the whimsicality of Spirited Away and Kikis Delivery Service, this is by far his most engaging and charming film. Essential viewing."
    },
    {
      "username": "rrfpaf-99858",
      "userUrl": "https://www.imdb.com/user/ur64977895",
      "reviewLink": "https://www.imdb.com/review/rw6570677",
      "warningSpoilers": false,
      "date": "6 February 2021",
      "rate": "7",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Just an average family story. Well, on LSD.",
      "content": "At first I thought Spirited Away was weird. So imagine spirited away, but with no real plot. I'm telling you, this movie is just weird weird weird. It doesn't help that the Totoro and the cat have really creepy smiles. Don't get me wrong, I enjoyed every moment of it! The kids are freaking adorable, the creatures are interesting, and the whole thing left me smiling. But dang that's a weird movie."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw3860414",
      "warningSpoilers": true,
      "date": "17 November 2017",
      "rate": "7",
      "helpful": "3 out of 3 found this helpful.",
      "title": "\"We had such a weird, mysterious, spectacular day!\"",
      "content": "Director Hayao Miyazaki has certainly made his mark with the IMDb audience. If I'm not mistaken, \"My Neighbor Totoro\" joins four other of his films in IMDb's Top 250 movies. I've now seen them all, and probably come away from them with \"Howl's Moving Castle\" as the most appealing to me.The version of this film I saw was the Studio Ghibli/Disney rendering, and perhaps it was a by-product of that translation, but I was surprised with the pronunciation of the name 'Totoro'. It was rendered as 'Toe' tuh ro' with the emphasis on the first syllable, whereas before I knew that, I would have pronounced it 'Tuh tor' ro, with the emphasis on the second syllable. Maybe that's anglicizing it, I don't know, but it sounded a little off to me.What stood out to me were some of the concepts that came out of Lewis Carroll's \"Alice in Wonderland\", with elements like Mei falling down a tunnel (replacing the rabbit hole), and later on with the appearance of the smiling Cheshire Cat bus. I don't know enough about Miyazaki to know whether he was influenced by the Alice story, but he did something similar in \"Howl's Moving Castle\" when the Witch of the Waste was defeated by a bucket of water, a nod to Frank Baum's \"The Wizard of Oz\". I acknowledge that it's difficult to come up with something creatively original and brand new, but those two examples suggest that Miyazaki borrowed some of his ideas from other sources.The story itself is quite charming in it's way, and the two young girls role model an ideal family relationship. What bothered me was the way the story left their mother's condition unnamed except to say that she was ill and confined to a hospital. For some reason, the idea that some form of mental illness may have been involved kept intruding while I watched the story. There was nothing overt to suggest that, but neither was there a reasonable expectation offered that she would be out of the hospital any time soon, and I kept wondering about that.What I liked most was the imagination that came up with 'soot gremlins' and the titled Totoro itself, along with those little ghost-like apparitions that followed along. Even though a haunted theme was mentioned more than once, it didn't seem to affect Satsuki and Mei, who were innocent enough not to be fearful of the unknown. That was probably the most charming aspect of the story, and if one were to ask about a recommendation to watch the film, I'd suggest following the acorns."
    },
    {
      "username": "andyajoflaherty",
      "userUrl": "https://www.imdb.com/user/ur13674288",
      "reviewLink": "https://www.imdb.com/review/rw6076239",
      "warningSpoilers": false,
      "date": "8 September 2020",
      "rate": "7",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Surreal animated classic",
      "content": "An early Studio Ghibli effort that is charming and surreal in equal measures, the plot concernes itself with 2 young sisters in post war Japan who have to deal with the stresses of a sick parent, moving house and... soot gremlins. The film also contains bizarre forest spirits which may be rabbits... or dogs... I'm not quite sure, and a cat who is also a bus. Ahh Japan... don't ever change..."
    }
  ],
  "errorMessage": ""
}