{
  "imDbId": "tt0096283",
  "title": "My Neighbor Totoro",
  "fullTitle": "My Neighbor Totoro (1988)",
  "type": "Movie",
  "year": "1988",
  "language": "en",
  "titleInLanguage": "My Neighbor Totoro",
  "url": "https://en.wikipedia.org/wiki/My_Neighbor_Totoro",
  "plotShort": {
    "plainText": "My Neighbor Totoro (Japanese: となりのトトロ, Hepburn: Tonari no Totoro) is a 1988 Japanese animated fantasy film that was written and directed by Hayao Miyazaki and animated by Studio Ghibli for Tokuma Shoten. The film stars voice actors Noriko Hidaka, Chika Sakamoto, and Hitoshi Takagi, and tells the story of a professor's young daughters Satsuki and Mei, and their interactions with friendly wood spirits in postwar rural Japan.\r\nIn 1989, Streamline Pictures produced an English-language dub for exclusive use on transpacific flights of Japan Airlines. Troma Films, under their 50th St. Films banner, distributed the dub of the film, which was co-produced by Jerry Beck. This dub was released in 1993 to United States theaters, and the following year on LaserDisc in the US by Fox Video in 1994, and on DVD in 2002. The rights to this dub expired in 2004, so Walt Disney Home Entertainment re-released the film on March 7, 2006 with a new dub cast. This version was also released in Australia by Madman Entertainment on March 15, 2006 and in the UK by Optimum Releasing on March 27, 2006. This DVD release is the first version of the film in the US to include both Japanese and English language tracks.\r\nThe film explores themes such as animism, Shinto symbology, environmentalism and the joys of rural living; it received worldwide critical acclaim and has amassed a global cult following. My Neighbor Totoro has grossed over $41 million worldwide at the box office as of September 2019, and an estimated $277 million from home video sales and $1.142 billion from licensed merchandise sales, totaling approximately $1.46 billion.\r\nMy Neighbor Totoro received numerous awards, including the Animage Anime Grand Prix prize, the Mainichi Film Award, and Kinema Junpo Award for Best Film in 1988. It also received the Special Award at the Blue Ribbon Awards in the same year. The film is considered as one of the top animation films, ranking 41st in Empire magazine's \"The 100 Best Films of World Cinema\" in 2010 and the number-one animated film on the 2012 Sight & Sound critics' poll of all-time greatest films. The film and its titular character have become cultural icons, and made multiple cameo appearances in a number of Studio Ghibli films and video games. Totoro also serves as the mascot for Studio Ghibli and is recognized as one of the most popular characters in Japanese animation.",
    "html": "<p>My Neighbor Totoro (Japanese: となりのトトロ, Hepburn: Tonari no Totoro) is a 1988 Japanese animated fantasy film that was written and directed by Hayao Miyazaki and animated by Studio Ghibli for Tokuma Shoten. The film stars voice actors Noriko Hidaka, Chika Sakamoto, and Hitoshi Takagi, and tells the story of a professor's young daughters Satsuki and Mei, and their interactions with friendly wood spirits in postwar rural Japan.</p><p>In 1989, Streamline Pictures produced an English-language dub for exclusive use on transpacific flights of Japan Airlines. Troma Films, under their 50th St. Films banner, distributed the dub of the film, which was co-produced by Jerry Beck. This dub was released in 1993 to United States theaters, and the following year on LaserDisc in the US by Fox Video in 1994, and on DVD in 2002. The rights to this dub expired in 2004, so Walt Disney Home Entertainment re-released the film on March 7, 2006 with a new dub cast. This version was also released in Australia by Madman Entertainment on March 15, 2006 and in the UK by Optimum Releasing on March 27, 2006. This DVD release is the first version of the film in the US to include both Japanese and English language tracks.</p><p>The film explores themes such as animism, Shinto symbology, environmentalism and the joys of rural living; it received worldwide critical acclaim and has amassed a global cult following. My Neighbor Totoro has grossed over $41 million worldwide at the box office as of September 2019, and an estimated $277 million from home video sales and $1.142 billion from licensed merchandise sales, totaling approximately $1.46 billion.</p><p>My Neighbor Totoro received numerous awards, including the Animage Anime Grand Prix prize, the Mainichi Film Award, and Kinema Junpo Award for Best Film in 1988. It also received the Special Award at the Blue Ribbon Awards in the same year. The film is considered as one of the top animation films, ranking 41st in Empire magazine's \"The 100 Best Films of World Cinema\" in 2010 and the number-one animated film on the 2012 Sight & Sound critics' poll of all-time greatest films. The film and its titular character have become cultural icons, and made multiple cameo appearances in a number of Studio Ghibli films and video games. Totoro also serves as the mascot for Studio Ghibli and is recognized as one of the most popular characters in Japanese animation.</p>"
  },
  "plotFull": {
    "plainText": "My Neighbor Totoro (Japanese: となりのトトロ, Hepburn: Tonari no Totoro) is a 1988 Japanese animated fantasy film that was written and directed by Hayao Miyazaki and animated by Studio Ghibli for Tokuma Shoten. The film stars voice actors Noriko Hidaka, Chika Sakamoto, and Hitoshi Takagi, and tells the story of a professor's young daughters Satsuki and Mei, and their interactions with friendly wood spirits in postwar rural Japan.\r\nIn 1989, Streamline Pictures produced an English-language dub for exclusive use on transpacific flights of Japan Airlines. Troma Films, under their 50th St. Films banner, distributed the dub of the film, which was co-produced by Jerry Beck. This dub was released in 1993 to United States theaters, and the following year on LaserDisc in the US by Fox Video in 1994, and on DVD in 2002. The rights to this dub expired in 2004, so Walt Disney Home Entertainment re-released the film on March 7, 2006 with a new dub cast. This version was also released in Australia by Madman Entertainment on March 15, 2006 and in the UK by Optimum Releasing on March 27, 2006. This DVD release is the first version of the film in the US to include both Japanese and English language tracks.\r\nThe film explores themes such as animism, Shinto symbology, environmentalism and the joys of rural living; it received worldwide critical acclaim and has amassed a global cult following. My Neighbor Totoro has grossed over $41 million worldwide at the box office as of September 2019, and an estimated $277 million from home video sales and $1.142 billion from licensed merchandise sales, totaling approximately $1.46 billion.\r\nMy Neighbor Totoro received numerous awards, including the Animage Anime Grand Prix prize, the Mainichi Film Award, and Kinema Junpo Award for Best Film in 1988. It also received the Special Award at the Blue Ribbon Awards in the same year. The film is considered as one of the top animation films, ranking 41st in Empire magazine's \"The 100 Best Films of World Cinema\" in 2010 and the number-one animated film on the 2012 Sight & Sound critics' poll of all-time greatest films. The film and its titular character have become cultural icons, and made multiple cameo appearances in a number of Studio Ghibli films and video games. Totoro also serves as the mascot for Studio Ghibli and is recognized as one of the most popular characters in Japanese animation.\r\nPlot\r\nIn 1950s Japan, university professor Tatsuo Kusakabe and his daughters Satsuki and Mei (approximately ten and four years old, respectively) move into an old house close to the hospital where the girls' mother Yasuko is recovering from a long-term illness. The house is inhabited by small, dark, dust-like house spirits called susuwatari, which can be seen when moving from bright places to dark ones. When the girls become comfortable in their new house, the susuwatari leave to find another empty house. Mei later discovers two small spirits who lead her into the hollow of a large camphor tree. She befriends a larger spirit, which identifies itself using a series of roars she interprets as \"Totoro\". Mei thinks Totoro is the troll from her illustrated book Three Billy Goats Gruff, with her mispronouncing troll. Mei falls asleep atop Totoro but when Satsuki finds her, she is on the ground. Despite many attempts, Mei cannot show her family Totoro's tree. Tatsuo comforts her by telling her Totoro will reveal himself when he wants to.\r\nThe girls later wait for Tatsuo's bus, which is late. Mei falls asleep on Satsuki's back and Totoro appears beside them, allowing Satsuki to see him for the first time. Totoro has only a leaf on his head for protection against the rain so Satsuki offers him the umbrella she had taken for her father. Delighted, he gives her a bundle of nuts and seeds in return. A giant, bus-shaped cat halts at the stop; Totoro boards it and leaves shortly before Tatsuo's bus arrives. A few days after planting the seeds, the girls awaken at midnight to find Totoro and his fellow spirits engaged in a ceremonial dance around the planted seeds and join in, causing the seeds to grow into an enormous tree. Totoro takes the girls for a ride on a magical flying top. In the morning, the tree is gone but the seeds have sprouted.\r\nThe girls discover a planned visit by Yasuko has been postponed because of a setback in her treatment. Mei is upset and argues with Satsuki, leaving for the hospital to take fresh corn to Yasuko. Mei's disappearance prompts Satsuki and the neighbors to search for her. In desperation, Satsuki returns to the camphor tree and pleads for Totoro's help. Totoro summons the Catbus, which carries Satsuki to Mei's location and the sisters emotionally reunite. The bus then takes them to the hospital. The girls overhear a conversation between their parents and learn Yasuko has been kept in hospital by a minor cold but is otherwise recovering well. The girls secretly leave the ear of corn on the windowsill, where their parents discover it, and return home. Eventually, Yasuko returns home and the sisters play with other children while Totoro and his friends watch them from afar.\r\nThemes\r\nAnimism is a major theme in My Neighbor Totoro, according to Eriko Ogihara-Schuck. Totoro has animistic traits and has kami status because he lives in a camphor tree in a Shinto shrine surrounded by a Shinto rope, and is referred to as mori no nushi (master of the forest). Ogihara-Schuck writes when Mei returns from her encounter with Totoro, her father takes Mei and her sister to the shrine to greet and thank Totoro. This is a common practice in the Shinto tradition following an encounter with a kami. According to Phillip E. Wegner, the film is an example of alternative history, citing the utopian-like setting of the anime.\r\nVoice cast\r\nProduction\r\nDevelopment\r\nAfter working on 3000 Miles in Search of a Mother, Miyazaki wanted to make a \"delightful, wonderful film\" that would be set in Japan with the idea to \"entertain and touch its viewers, but stay with them long after they have left the theaters\". Initially, Miyazaki had the main characters Totoro, Mei, Tatsuo, and Kanta.: 8 The director based Mei on his niece, and Totoros as \"serene, carefree creatures\" that were \"supposedly the forest keeper, but that's only a half-baked idea, a rough approximation\".: 5, 103\r\nArt director Kazuo Oga was drawn to the film when Hayao Miyazaki showed him an original image of Totoro standing in a satoyama. Miyazaki challenged Oga to raise his standards, and Oga's experience with My Neighbor Totoro began Oga's career. Oga and Miyazaki debated the film's color palette; Oga wanted to paint black soil from Akita Prefecture and Miyazaki preferred the color of red soil from Kantō region.: 82 The finished film was described by Studio Ghibli producer Toshio Suzuki; \"It was nature painted with translucent colors\".\r\nOga's conscientious approach to My Neighbor Totoro was a style the International Herald Tribune recognized as \" the traditional Japanese animist sense of a natural world that is fully, spiritually alive\". The newspaper said of the film:\r\nSet in a period that is both modern and nostalgic, the film creates a fantastic, yet strangely believable universe of supernatural creatures coexisting with modernity. A great part of this sense comes from Oga's evocative backgrounds, which give each tree, hedge and twist in the road an indefinable feeling of warmth that seems ready to spring into sentient life.\r\nOga's work on My Neighbor Totoro led to his continued involvement with Studio Ghibli, which assigned him jobs that would play to his strengths, and Oga's style became a trademark style of Studio Ghibli.\r\nOnly one young girl, rather than two sisters, is depicted in several of Miyazaki's initial conceptual watercolor paintings, as well as on the theatrical release poster and on later home-video releases. According to Miyazaki; \"If she was a little girl who plays around in the yard, she wouldn't be meeting her father at a bus stop, so we had to come up with two girls instead. And that was difficult.\": 11 Miyazaki said the film's opening sequence was not storyboarded; \"The sequence was determined through permutations and combinations determined by the time sheets. Each element was made individually and combined in the time sheets ...\": 27 The ending sequence depicts the mother's return home and the signs of her return to good health by playing with Satsuki and Mei outside.: 149\r\nMiyazaki stated that the story was initially intended to be set in 1955, however, the team was not thorough in the research and instead worked on a setting \"in the recent past\".: 33 The film was originally set to be an hour long but during production it grew to respond to the social context, including the reason for the move and the father's occupation.: 54 Eight animators worked on the film, which was completed in eight months.\r\nTetsuya Endo noted numerous animation techniques were used in the film. For example, ripples were designed with \"two colors of high-lighting and shading\" and the rain for My Neighbor Totoro was \"scratched in the cels\" and superimposed for it to convey a soft feel.: 156 The animators stated one month was taken to create the tadpoles, which included four colors; the water for it was also blurred.: 154\r\nMusic\r\nThe music for My Neighbor Totoro was composed by Joe Hisaishi, who previously collaborated with Miyazaki on the movies Nausicaä of the Valley of the Wind and Castle in the Sky. Hisaishi was inspired by the contemporary composers Terry Riley, Philip Glass, Steve Reich, Karlheinz Stockhausen, and John Cage, and described Miyazaki's films as \"rich and personally compeling\". He hired an orchestra for the soundtrack and primarily used a Fairlight instrument.: 169, 170\r\nThe soundtrack for My Neighbor Totoro was first released in Japan on May 1, 1988, by Tokuma Shoten, and includes the musical score used in the film, except for five vocal pieces that were performed by Azumi Inoue, including \"Stroll\", \"A Lost Child\", and \"My Neighbor Totoro\". It had previously been released as an Image Song CD in 1987 that contains some songs that were not included in the film.\r\nRelease\r\nAfter writing and filming Nausicaä of the Valley of the Wind (1984) and Castle in the Sky (1986), Hayao Miyazaki began directing My Neighbor Totoro for Studio Ghibli. Miyazaki's production paralleled his colleague Isao Takahata's production of Grave of the Fireflies. Miyazaki's film was financed by executive producer Yasuyoshi Tokuma, and both My Neighbor Totoro and Grave of the Fireflies were released on the same bill in 1988. The dual billing was considered \"one of the most moving and remarkable double bills ever offered to a cinema audience\".\r\nBox office\r\nIn Japan, My Neighbor Totoro initially sold 801,680 tickets and earned a distribution rental income of ¥588 million in 1988. According to image researcher Seiji Kano, by 2005, the film's box-office gross receipts in Japan totalled ¥1.17 billion ($10.6 million). In France, the film has sold 429,822 tickets since 1999. The film has been internationally released several times since 2002. The film has grossed $30,476,708 worldwide since 2002.\r\nThirty years after its original release in Japan, My Neighbour Totoro received a Chinese theatrical release in December 2018. The delay was due to long-standing political tensions between China and Japan but many Chinese people had become familiar with Miyazaki's films due to rampant video piracy. In its opening weekend, ending December 16, 2018, My Neighbour Totoro grossed $13 million, entering the box-office charts at number two behind Hollywood film Aquaman and ahead of Bollywood film Padman at number three. By its second weekend, My Neighbor Totoro had grossed $20 million in China. As of February 2019, it had grossed $25,798,550 in China.\r\nEnglish dubs\r\nIn 1988, US-based company Streamline Pictures produced an exclusive English language dub of My Neighbor Totoro for use as an in-flight movie on Japan Airlines flights. In April 1993, Troma Films, under its label 50th St. Films, distributed the dub of the film as a theatrical release. The songs for the Streamline version of My Neighbor Totoro were sung by Cassie Byram.\r\nIn 2004, Walt Disney Pictures produced a new English dub of My Neighbor Totoro to be released after the rights to the Streamline dub had expired. As is the case with Disney's other English dubs of Miyazaki films, the Disney version of My Neighbor Totoro has a star-heavy cast, including Dakota and Elle Fanning as Satsuki and Mei, Timothy Daly as Mr. Kusakabe, Pat Carroll as Granny, Lea Salonga as Mrs. Kusakabe, and Frank Welker as Totoro and Catbus. The songs for the new dub retain the translation as the earlier dub but are sung by Sonya Isaacs. The Disney dub was directed by Rick Dempsey, a Disney executive in charge of the company's dubbing services, and was written by Don and Cindy Hewitt, who had written other dubs for Studio Ghibli.\r\nDisney's English-language dub premiered on October 23, 2005; it was screened at the 2005 Hollywood Film Festival. The cable television network Turner Classic Movies (TCM) held the television premiere of Disney's new English dub on January 2006, as part of the network's tribute to Hayao Miyazaki. TCM aired the dub and the original Japanese film with English subtitles. The Disney version was released on DVD in the United States on March 7, 2006.\r\nIn 2023 the film was re-released in 970 United States locations as part of celebrations to mark the 35th anniversary of its first theatrical release, with showings in both Japanese with English subtitles and with the English dub.\r\nHome media\r\nTokuma Shoten released My Neighbor Totoro on VHS and LaserDisc in August 1988. Buena Vista Home Entertainment Japan (now Walt Disney Japan) reissued the VHS on June 27, 1997, as part of their series Ghibli ga Ippai. Disney released the film on Blu-ray in Japan on 2012.\r\nAfter the rights to the Streamline dub expired in 2004, Walt Disney Home Entertainment re-released the movie on DVD on March 7, 2006, with Disney's newly produced English dub and the original Japanese version. The company reissued My Neighbor Totoro, as well as Castle in the Sky, and Kiki's Delivery Service, with updated cover art highlighting its Studio Ghibli origins, on March 2, 2010, coinciding with the US DVD and Blu-ray debut of Ponyo. My Neighbor Totoro was re-released by Disney on Blu-Ray on May 21, 2013. GKIDS re-issued the film on Blu-ray and DVD on October 17, 2017.\r\nIn Japan, My Neighbor Totoro had sold 3.5 million VHS and DVD units as of April 2012, equivalent to approximately ¥16,100 million ($202 million) at an average retail price of ¥4,600 (¥4,700 on DVD and ¥4,500 on VHS). In the United States, the film sold over 500,000 VHS units by 1996, with the later 2010 DVD release selling a further 3.8 million units and grossing $64.5 million in the United States as of October 2018.\r\nIn the UK, the film's Studio Ghibli anniversary release appeared on the annual lists of ten-best-selling foreign language films on home video for five consecutive years, ranking number seven in 2015, number six in 2016 and 2017, number one in 2018, and number two in 2019 below Spirited Away.\r\nReception\r\nMy Neighbor Totoro received widespread acclaim from film critics. On the review aggregator website Rotten Tomatoes, 93% of 56 critics' reviews are positive, with an average rating of 8.4/10. The website's consensus reads: \"My Neighbor Totoro is a heartwarming, sentimental masterpiece that captures the simple grace of childhood.\" Metacritic, which uses a weighted average, assigned the film a score of 86 out of 100, based on 15 critics, indicating \"universal acclaim\".\r\nIn 2001, Japanese magazine Animage ranked My Neighbor Totoro 45th in its list of 100 Best Anime Productions of All Time. My Neighbor Totoro was voted the highest-ranking animated film on Sight & Sound's critics' poll of all-time greatest films, and joint 154th overall. In 2022, the magazine ranked the film as the joint-72nd-greatest film overall, being one of two animated films included in the list. My Neighbor Totoro was ranked third on the list of \"Greatest Japanese Animated Films of All Time\" by film magazine Kinema Junpo in 2009, 41st in Empire magazine's \"The 100 Best Films of World Cinema\" in 2010, second on a similar Empire list of best children's films, and number one in the greatest animated films in Time Out; a similar list by the editors ranked the film in third place.\r\nFilm critic Roger Ebert of Chicago Sun-Times identified My Neighbor Totoro as one of his \"Great Movies\", calling it \"one of the lovingly hand-crafted works of Hayao Miyazaki\". In his review, Ebert said the film \"is based on experience, situation and exploration—not on conflict and threat\", and added:\r\nit would never have won its worldwide audience just because of its warm heart. It is also rich with human comedy in the way it observes the two remarkably convincing, lifelike little girls ... It is a little sad, a little scary, a little surprising and a little informative, just like life itself. It depends on a situation instead of a plot, and suggests that the wonder of life and the resources of imagination supply all the adventure you need.\r\nSteve Rose from The Guardian gave the film five stars, praising Miyazaki's \"rich, bright, hand-drawn\" animation and describing it as \"full of benign spirituality, prelapsarian innocence and joyous discovery, all rooted in a carefully detailed reality\". Trevor Johnston from Time Out also awarded the film five stars, commenting on its \"delicate rendering of the atmosphere\" and its first half that \"delicately captures both mystery and quietness\". Japanese filmmaker Akira Kurosawa cited My Neighbor Totoro as one of his favorite films. Writing for the London Evening Standard, Charlotte O'Sullivan praised the charm of the film but said it lacks complexity in comparison with Spirited Away. Jordan Cronk from Slant awarded the film three-and-a-half stars but said it is \"devoid of much of the fantasia of Miyazaki’s more outwardly visionary work\". In the 1996 movie guide \"Seen That, Now What?\", My Neighbor Totoro was given the rating of \"A\". The guide stated that the film is an \"enchanting, lushly animated view of the natural world with child's sense of wonder\", and noting its suitability for young children while being \"a perennial favorite among\".\r\nThe 1993 translation was not as well-received as the 2006 translation; Leonard Klady of Variety wrote the 1993 translation demonstrates \"adequate television technical craft\" that is characterized by \"muted pastels, homogenized pictorial style and vapid storyline\". Klady described the film's environment as \"obviously aimed at an international audience\" but \"evinces a disorienting combination of cultures that produces a nowhere land more confused than fascinating\". Stephen Holden of The New York Times described the 1993 translation as \"very visually handsome\", and said the film is \"very charming\" when \"dispensing enchantment\". Despite the highlights, Holden wrote \"too much of the film, however, is taken up with stiff, mechanical chitchat\".\r\nMatthew Leyland of Sight & Sound reviewed the DVD released in 2006, commenting; \"Miyazaki's family fable is remarkably light on tension, conflict and plot twists, yet it beguiles from beginning to end ... what sticks with the viewer is the every-kid credibility of the girls' actions as they work, play and settle into their new surroundings\". Leyland praised the DVD transfer of the film but noted the disc lacks a look at the film's production, instead being overabundant with storyboards. Writing in Joe Hisaishi's Soundtrack for My Neighbor Totoro, Kunio Hara praised the soundtrack, describing the song \"My Neighbor Totoro\" as a \"sonic icon\" of the film. Hara also commented the music \"arouse a similar sentiment of yearning for the past\".\r\nAwards and nominations\r\nLegacy\r\nMy Neighbor Totoro was considered a milestone for writer-director Hayao Miyazaki. The popularity of film's central character Totoro among Japanese children has been likened to that of Winnie-the-Pooh in Britain. The Independent said Totoro is one of the greatest cartoon characters, describing the creature; \"At once innocent and awe-inspiring, King Totoro captures the innocence and magic of childhood more than any of Miyazaki's other magical creations\". The Financial Times recognized the character's appeal, commenting Totoro \"is more genuinely loved than Mickey Mouse could hope to be in his wildest—not nearly so beautifully illustrated—fantasies\". Empire also commented on Totoro's appeal, ranking him at number 18 on a list of the greatest animated characters of all time.\r\nAccording to the environmental journal Ambio, My Neighbor Totoro \"has served as a powerful force to focus the positive feelings that the Japanese people have for satoyama and traditional village life\". The film's central character Totoro was used as a mascot by the Japanese campaign \"Totoro Hometown Fund Campaign\", which aimed to preserve areas of satoyama in Saitama Prefecture. The fund, started in 1990 after the film's release, held an auction in August 2008 at Pixar Animation Studios to sell over 210 original paintings, illustrations, and sculptures inspired by My Neighbor Totoro.\r\nTotoro has made cameo appearances in many Studio Ghibli films, including Pom Poko, Kiki's Delivery Service, and Whisper of the Heart. The character has also appeared in other anime series and films, including one episode of the Gainax television series His and Her Circumstances. Miyazaki uses Totoro as a part of his logo for Studio Ghibli. Totoro also makes a cameo appearance in the Pixar film Toy Story 3 (2010) but was not included in Toy Story 4 due to licensing problems. Toy Story 3's art director Daisuke Tsutsumi is married to Miyazaki's niece, who inspired the character Mei in My Neighbor Totoro.\r\nA main-belt asteroid that was discovered on December 31, 1994, was named 10160 Totoro. In 2013, Eoperipatus totoro, a species of velvet worm that was discovered in Vietnam, was named after Totoro. Following the request of the paper's authors, the species was named for the character because he \"uses a many-legged animal as a vehicle, which according to the collectors resembles a velvet worm\".\r\nMedia\r\nBooks\r\nIn Japan in May 1988, Tokuma published a four-volume series of ani-manga books, which use color images and lines directly from My Neighbor Totoro. The series was licensed for English-language release in North America by Viz Media, which released the books from November 10, 2004, through February 15, 2005. A 111-page picture book based on the film and aimed at young children was released by Tokuma on June 28, 1988, and, in a 112-page English translation, by Viz on November 8, 2005. Tokuma later released another 176-page art book containing conceptual art from the film and interviews with production staff on July 15, 1988, and, in English translation, by Viz on November 8, 2005. In 2013, Viz released a hardcover light novel that was written by Tsugiko Kubo and illustrated by Hayao Miyazaki.\r\nSequel\r\nMei and the Kittenbus (めいとこねこバス, Mei to Konekobasu) is a thirteen-minute sequel to My Neighbor Totoro that was written and directed by Miyazaki. Chika Sakamoto, who voiced Mei in Totoro, returned to voice Mei in this short. Hayao Miyazaki voiced Granny Cat (Neko Baa-chan) and Totoro. The sequel focuses on the character Mei Kusakabe from the original film and her one-night adventures with Kittenbus, the offspring of Catbus, and other cat-oriented vehicles. The sequel was first released in Japan in 2003 and is regularly shown at Ghibli Museum but has not been released on home video.\r\nMerchandise\r\nLicensed My Neighbor Totoro merchandise of Totoro has been sold in Japan for decades after the film's release. Sales of the film's licensed merchandise in Japan grossed ¥10.97 billion in 1999, ¥56.08 billion during 2003–2007, at least ¥4.1 billion in 2008, and ¥19.96 billion during 2010–2012.\r\nStage adaptation\r\nIn May 2022, the Royal Shakespeare Company and composer Joe Hisaishi announced a stage adaptation of the film titled My Neighbour Totoro would run from 8 October 2022 to 21 January 2023 at the Barbican Centre, London. It was adapted by British playwright Tom Morton-Smith and directed by Improbable's Phelim McDermott. Tickets went on sale on 19 May 2022, breaking the theater's box-office record for sales in one day that was previously held by the 2015 production of Hamlet starring Benedict Cumberbatch.",
    "html": "<p>My Neighbor Totoro (Japanese: となりのトトロ, Hepburn: Tonari no Totoro) is a 1988 Japanese animated fantasy film that was written and directed by Hayao Miyazaki and animated by Studio Ghibli for Tokuma Shoten. The film stars voice actors Noriko Hidaka, Chika Sakamoto, and Hitoshi Takagi, and tells the story of a professor's young daughters Satsuki and Mei, and their interactions with friendly wood spirits in postwar rural Japan.</p><p>In 1989, Streamline Pictures produced an English-language dub for exclusive use on transpacific flights of Japan Airlines. Troma Films, under their 50th St. Films banner, distributed the dub of the film, which was co-produced by Jerry Beck. This dub was released in 1993 to United States theaters, and the following year on LaserDisc in the US by Fox Video in 1994, and on DVD in 2002. The rights to this dub expired in 2004, so Walt Disney Home Entertainment re-released the film on March 7, 2006 with a new dub cast. This version was also released in Australia by Madman Entertainment on March 15, 2006 and in the UK by Optimum Releasing on March 27, 2006. This DVD release is the first version of the film in the US to include both Japanese and English language tracks.</p><p>The film explores themes such as animism, Shinto symbology, environmentalism and the joys of rural living; it received worldwide critical acclaim and has amassed a global cult following. My Neighbor Totoro has grossed over $41 million worldwide at the box office as of September 2019, and an estimated $277 million from home video sales and $1.142 billion from licensed merchandise sales, totaling approximately $1.46 billion.</p><p>My Neighbor Totoro received numerous awards, including the Animage Anime Grand Prix prize, the Mainichi Film Award, and Kinema Junpo Award for Best Film in 1988. It also received the Special Award at the Blue Ribbon Awards in the same year. The film is considered as one of the top animation films, ranking 41st in Empire magazine's \"The 100 Best Films of World Cinema\" in 2010 and the number-one animated film on the 2012 Sight & Sound critics' poll of all-time greatest films. The film and its titular character have become cultural icons, and made multiple cameo appearances in a number of Studio Ghibli films and video games. Totoro also serves as the mascot for Studio Ghibli and is recognized as one of the most popular characters in Japanese animation.</p><br/><h3>Plot</h3><p>In 1950s Japan, university professor Tatsuo Kusakabe and his daughters Satsuki and Mei (approximately ten and four years old, respectively) move into an old house close to the hospital where the girls' mother Yasuko is recovering from a long-term illness. The house is inhabited by small, dark, dust-like house spirits called susuwatari, which can be seen when moving from bright places to dark ones. When the girls become comfortable in their new house, the susuwatari leave to find another empty house. Mei later discovers two small spirits who lead her into the hollow of a large camphor tree. She befriends a larger spirit, which identifies itself using a series of roars she interprets as \"Totoro\". Mei thinks Totoro is the troll from her illustrated book Three Billy Goats Gruff, with her mispronouncing troll. Mei falls asleep atop Totoro but when Satsuki finds her, she is on the ground. Despite many attempts, Mei cannot show her family Totoro's tree. Tatsuo comforts her by telling her Totoro will reveal himself when he wants to.</p><p>The girls later wait for Tatsuo's bus, which is late. Mei falls asleep on Satsuki's back and Totoro appears beside them, allowing Satsuki to see him for the first time. Totoro has only a leaf on his head for protection against the rain so Satsuki offers him the umbrella she had taken for her father. Delighted, he gives her a bundle of nuts and seeds in return. A giant, bus-shaped cat halts at the stop; Totoro boards it and leaves shortly before Tatsuo's bus arrives. A few days after planting the seeds, the girls awaken at midnight to find Totoro and his fellow spirits engaged in a ceremonial dance around the planted seeds and join in, causing the seeds to grow into an enormous tree. Totoro takes the girls for a ride on a magical flying top. In the morning, the tree is gone but the seeds have sprouted.</p><p>The girls discover a planned visit by Yasuko has been postponed because of a setback in her treatment. Mei is upset and argues with Satsuki, leaving for the hospital to take fresh corn to Yasuko. Mei's disappearance prompts Satsuki and the neighbors to search for her. In desperation, Satsuki returns to the camphor tree and pleads for Totoro's help. Totoro summons the Catbus, which carries Satsuki to Mei's location and the sisters emotionally reunite. The bus then takes them to the hospital. The girls overhear a conversation between their parents and learn Yasuko has been kept in hospital by a minor cold but is otherwise recovering well. The girls secretly leave the ear of corn on the windowsill, where their parents discover it, and return home. Eventually, Yasuko returns home and the sisters play with other children while Totoro and his friends watch them from afar.</p><br/><h3>Themes</h3><p>Animism is a major theme in My Neighbor Totoro, according to Eriko Ogihara-Schuck. Totoro has animistic traits and has kami status because he lives in a camphor tree in a Shinto shrine surrounded by a Shinto rope, and is referred to as mori no nushi (master of the forest). Ogihara-Schuck writes when Mei returns from her encounter with Totoro, her father takes Mei and her sister to the shrine to greet and thank Totoro. This is a common practice in the Shinto tradition following an encounter with a kami. According to Phillip E. Wegner, the film is an example of alternative history, citing the utopian-like setting of the anime.</p><br/><h3>Voice cast</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Character name</th><th>Japanese voice actor<sup class=\"reference nowrap\"><span>: 175 </span></sup></th><th>English voice actor<br><small>(<span>Tokuma</span>/<span>Streamline</span>/<span>50th Street Films</span>, 1989/1993)</small></th><th>English voice actor<br><small>(<span>Walt Disney Home Entertainment</span>, 2005)</small></th></tr><tr><td>Satsuki Kusakabe<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">草壁 サツキ</span></span>)</span> (10-year-old daughter)</td><td><span>Noriko Hidaka</span></td><td><span>Lisa Michelson</span></td><td><span>Dakota Fanning</span></td></tr><tr><td>Mei Kusakabe<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">草壁 メイ</span></span>)</span> (4-year-old daughter)</td><td><span>Chika Sakamoto</span></td><td><span>Cheryl Chase</span></td><td><span>Elle Fanning</span></td></tr><tr><td>Tatsuo Kusakabe<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">草壁 タツオ</span></span>)</span> (father)</td><td><span>Shigesato Itoi</span></td><td><span>Greg Snegoff</span></td><td><span>Tim Daly</span></td></tr><tr><td>Yasuko Kusakabe<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">草壁 靖子</span></span>)</span> (mother)</td><td><span>Sumi Shimamoto</span></td><td><span>Alexandra Kenworthy</span></td><td><span>Lea Salonga</span></td></tr><tr><td>Totoro<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">トトロ</span></span>)</span></td><td><span>Hitoshi Takagi</span></td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td><span>Frank Welker</span></td></tr><tr><td>Kanta Ōgaki<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">大垣 勘太</span></span>)</span> (a local boy)</td><td>Toshiyuki Amagasa</td><td>Kenneth Hartman</td><td><span>Paul Butcher</span></td></tr><tr><td>Granny<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">祖母</span></span>)</span> (Nanny in the 1993 dub)</td><td><span>Tanie Kitabayashi</span></td><td>Natalie Core</td><td><span>Pat Carroll</span></td></tr><tr><td>Catbus<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">ネコバス</span></span>, <span><i lang=\"ja-Latn\"><i>Nekobasu</i></i></span>)</span></td><td><span>Naoki Tatsuta</span></td><td><span>Carl Macek</span> (uncredited)</td><td><span>Frank Welker</span></td></tr><tr><td>Michiko<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">ミチ子</span></span>)</span></td><td><span>Chie Kōjiro</span></td><td><span>Brianne Siddall</span> (uncredited)</td><td>Ashley Rose Orr</td></tr><tr><td>Mrs. Ogaki (Kanta's mother)</td><td>Hiroko Maruyama</td><td>Melanie MacQueen</td><td><span>Kath Soucie</span></td></tr><tr><td>Mr. Ogaki (Kanta's father)</td><td><span>Masashi Hirose</span></td><td rowspan=\"2\"><span>Steve Kramer</span></td><td>David Midthunder</td></tr><tr><td>Old Farmer</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td><span>Peter Renaday</span></td></tr><tr><td>Miss Hara (Satsuki's teacher)</td><td><span>Machiko Washio</span></td><td rowspan=\"2\"><span>Edie Mirman</span> (uncredited)</td><td><span>Tress MacNeille</span> (uncredited)</td></tr><tr><td>Kanta's Aunt</td><td><span>Reiko Suzuki</span></td><td><span>Russi Taylor</span></td></tr><tr><td>Otoko</td><td><span>Daiki Nakamura</span></td><td><span>Kerrigan Mahan</span> (uncredited)</td><td><span>Matt Adler</span></td></tr><tr><td>Ryōko</td><td><span>Yūko Mizutani</span></td><td rowspan=\"2\"><span>Lara Cody</span></td><td><span>Bridget Hoffman</span></td></tr><tr><td>Bus Attendant</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td><span>Kath Soucie</span></td></tr><tr><td>Mailman</td><td><span>Tomomichi Nishimura</span></td><td><span>Doug Stone</span> (uncredited)</td><td><span>Robert Clotworthy</span></td></tr><tr><td>Moving Man</td><td><span>Shigeru Chiba</span></td><td><span>Greg Snegoff</span></td><td>Newell Alexander</td></tr></tbody></table><br/><h3>Production</h3><h4>Development</h4><p>After working on 3000 Miles in Search of a Mother, Miyazaki wanted to make a \"delightful, wonderful film\" that would be set in Japan with the idea to \"entertain and touch its viewers, but stay with them long after they have left the theaters\". Initially, Miyazaki had the main characters Totoro, Mei, Tatsuo, and Kanta.: 8 The director based Mei on his niece, and Totoros as \"serene, carefree creatures\" that were \"supposedly the forest keeper, but that's only a half-baked idea, a rough approximation\".: 5, 103</p><p>Art director Kazuo Oga was drawn to the film when Hayao Miyazaki showed him an original image of Totoro standing in a satoyama. Miyazaki challenged Oga to raise his standards, and Oga's experience with My Neighbor Totoro began Oga's career. Oga and Miyazaki debated the film's color palette; Oga wanted to paint black soil from Akita Prefecture and Miyazaki preferred the color of red soil from Kantō region.: 82 The finished film was described by Studio Ghibli producer Toshio Suzuki; \"It was nature painted with translucent colors\".</p><p>Oga's conscientious approach to My Neighbor Totoro was a style the International Herald Tribune recognized as \" the traditional Japanese animist sense of a natural world that is fully, spiritually alive\". The newspaper said of the film:</p><blockquote>Set in a period that is both modern and nostalgic, the film creates a fantastic, yet strangely believable universe of supernatural creatures coexisting with modernity. A great part of this sense comes from Oga's evocative backgrounds, which give each tree, hedge and twist in the road an indefinable feeling of warmth that seems ready to spring into sentient life.</blockquote><p>Oga's work on My Neighbor Totoro led to his continued involvement with Studio Ghibli, which assigned him jobs that would play to his strengths, and Oga's style became a trademark style of Studio Ghibli.</p><p>Only one young girl, rather than two sisters, is depicted in several of Miyazaki's initial conceptual watercolor paintings, as well as on the theatrical release poster and on later home-video releases. According to Miyazaki; \"If she was a little girl who plays around in the yard, she wouldn't be meeting her father at a bus stop, so we had to come up with two girls instead. And that was difficult.\": 11 Miyazaki said the film's opening sequence was not storyboarded; \"The sequence was determined through permutations and combinations determined by the time sheets. Each element was made individually and combined in the time sheets ...\": 27 The ending sequence depicts the mother's return home and the signs of her return to good health by playing with Satsuki and Mei outside.: 149</p><p>Miyazaki stated that the story was initially intended to be set in 1955, however, the team was not thorough in the research and instead worked on a setting \"in the recent past\".: 33 The film was originally set to be an hour long but during production it grew to respond to the social context, including the reason for the move and the father's occupation.: 54 Eight animators worked on the film, which was completed in eight months.</p><p>Tetsuya Endo noted numerous animation techniques were used in the film. For example, ripples were designed with \"two colors of high-lighting and shading\" and the rain for My Neighbor Totoro was \"scratched in the cels\" and superimposed for it to convey a soft feel.: 156 The animators stated one month was taken to create the tadpoles, which included four colors; the water for it was also blurred.: 154</p><h4>Music</h4><p>The music for My Neighbor Totoro was composed by Joe Hisaishi, who previously collaborated with Miyazaki on the movies Nausicaä of the Valley of the Wind and Castle in the Sky. Hisaishi was inspired by the contemporary composers Terry Riley, Philip Glass, Steve Reich, Karlheinz Stockhausen, and John Cage, and described Miyazaki's films as \"rich and personally compeling\". He hired an orchestra for the soundtrack and primarily used a Fairlight instrument.: 169, 170</p><p>The soundtrack for My Neighbor Totoro was first released in Japan on May 1, 1988, by Tokuma Shoten, and includes the musical score used in the film, except for five vocal pieces that were performed by Azumi Inoue, including \"Stroll\", \"A Lost Child\", and \"My Neighbor Totoro\". It had previously been released as an Image Song CD in 1987 that contains some songs that were not included in the film.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>My Neighbor Totoro (Original Soundtrack) </caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Hey Let's Go\"</td><td class=\"tracklist-length\">2:43</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"The Village in May\"</td><td class=\"tracklist-length\">1:38</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"A Haunted House\"</td><td class=\"tracklist-length\">1:23</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Mei and the Dust Bunnies\"</td><td class=\"tracklist-length\">1:34</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Evening Wind\"</td><td class=\"tracklist-length\">1:01</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Not Afraid\"</td><td class=\"tracklist-length\">0:43</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Let's Go to the Hospital\"</td><td class=\"tracklist-length\">1:22</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Mother\"</td><td class=\"tracklist-length\">1:06</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"A Little Monster\"</td><td class=\"tracklist-length\">3:54</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Totoro\"</td><td class=\"tracklist-length\">2:49</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"A Huge Tree in the Tsukamori Forest\"</td><td class=\"tracklist-length\">2:15</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"A Lost Child\"</td><td class=\"tracklist-length\">3:48</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"The Path of the Wind\"</td><td class=\"tracklist-length\">3:16</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"A Soaking Wet Monster\"</td><td class=\"tracklist-length\">2:33</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"Moonlight Flight\"</td><td class=\"tracklist-length\">2:05</td></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"Mei is Missing\"</td><td class=\"tracklist-length\">2:32</td></tr><tr><th id=\"track17\" scope=\"row\">17.</th><td>\"Cat Bus\"</td><td class=\"tracklist-length\">2:11</td></tr><tr><th id=\"track18\" scope=\"row\">18.</th><td>\"I'm So Glad\"</td><td class=\"tracklist-length\">1:15</td></tr><tr><th id=\"track19\" scope=\"row\">19.</th><td>\"My Neighbor Totoro- Ending Song\"</td><td class=\"tracklist-length\">4:17</td></tr><tr><th id=\"track20\" scope=\"row\">20.</th><td>\"Hey Let's Go\"</td><td class=\"tracklist-length\">2:43</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>45:18</td></tr></tbody></table><br/><h3>Release</h3><p>After writing and filming Nausicaä of the Valley of the Wind (1984) and Castle in the Sky (1986), Hayao Miyazaki began directing My Neighbor Totoro for Studio Ghibli. Miyazaki's production paralleled his colleague Isao Takahata's production of Grave of the Fireflies. Miyazaki's film was financed by executive producer Yasuyoshi Tokuma, and both My Neighbor Totoro and Grave of the Fireflies were released on the same bill in 1988. The dual billing was considered \"one of the most moving and remarkable double bills ever offered to a cinema audience\".</p><h4>Box office</h4><p>In Japan, My Neighbor Totoro initially sold 801,680 tickets and earned a distribution rental income of ¥588 million in 1988. According to image researcher Seiji Kano, by 2005, the film's box-office gross receipts in Japan totalled ¥1.17 billion ($10.6 million). In France, the film has sold 429,822 tickets since 1999. The film has been internationally released several times since 2002. The film has grossed $30,476,708 worldwide since 2002.</p><p>Thirty years after its original release in Japan, My Neighbour Totoro received a Chinese theatrical release in December 2018. The delay was due to long-standing political tensions between China and Japan but many Chinese people had become familiar with Miyazaki's films due to rampant video piracy. In its opening weekend, ending December 16, 2018, My Neighbour Totoro grossed $13 million, entering the box-office charts at number two behind Hollywood film Aquaman and ahead of Bollywood film Padman at number three. By its second weekend, My Neighbor Totoro had grossed $20 million in China. As of February 2019, it had grossed $25,798,550 in China.</p><h4>English dubs</h4><p>In 1988, US-based company Streamline Pictures produced an exclusive English language dub of My Neighbor Totoro for use as an in-flight movie on Japan Airlines flights. In April 1993, Troma Films, under its label 50th St. Films, distributed the dub of the film as a theatrical release. The songs for the Streamline version of My Neighbor Totoro were sung by Cassie Byram.</p><p>In 2004, Walt Disney Pictures produced a new English dub of My Neighbor Totoro to be released after the rights to the Streamline dub had expired. As is the case with Disney's other English dubs of Miyazaki films, the Disney version of My Neighbor Totoro has a star-heavy cast, including Dakota and Elle Fanning as Satsuki and Mei, Timothy Daly as Mr. Kusakabe, Pat Carroll as Granny, Lea Salonga as Mrs. Kusakabe, and Frank Welker as Totoro and Catbus. The songs for the new dub retain the translation as the earlier dub but are sung by Sonya Isaacs. The Disney dub was directed by Rick Dempsey, a Disney executive in charge of the company's dubbing services, and was written by Don and Cindy Hewitt, who had written other dubs for Studio Ghibli.</p><p>Disney's English-language dub premiered on October 23, 2005; it was screened at the 2005 Hollywood Film Festival. The cable television network Turner Classic Movies (TCM) held the television premiere of Disney's new English dub on January 2006, as part of the network's tribute to Hayao Miyazaki. TCM aired the dub and the original Japanese film with English subtitles. The Disney version was released on DVD in the United States on March 7, 2006.</p><p>In 2023 the film was re-released in 970 United States locations as part of celebrations to mark the 35th anniversary of its first theatrical release, with showings in both Japanese with English subtitles and with the English dub.</p><h4>Home media</h4><p>Tokuma Shoten released My Neighbor Totoro on VHS and LaserDisc in August 1988. Buena Vista Home Entertainment Japan (now Walt Disney Japan) reissued the VHS on June 27, 1997, as part of their series Ghibli ga Ippai. Disney released the film on Blu-ray in Japan on 2012.</p><p>After the rights to the Streamline dub expired in 2004, Walt Disney Home Entertainment re-released the movie on DVD on March 7, 2006, with Disney's newly produced English dub and the original Japanese version. The company reissued My Neighbor Totoro, as well as Castle in the Sky, and Kiki's Delivery Service, with updated cover art highlighting its Studio Ghibli origins, on March 2, 2010, coinciding with the US DVD and Blu-ray debut of Ponyo. My Neighbor Totoro was re-released by Disney on Blu-Ray on May 21, 2013. GKIDS re-issued the film on Blu-ray and DVD on October 17, 2017.</p><p>In Japan, My Neighbor Totoro had sold 3.5 million VHS and DVD units as of April 2012, equivalent to approximately ¥16,100 million ($202 million) at an average retail price of ¥4,600 (¥4,700 on DVD and ¥4,500 on VHS). In the United States, the film sold over 500,000 VHS units by 1996, with the later 2010 DVD release selling a further 3.8 million units and grossing $64.5 million in the United States as of October 2018.</p><p>In the UK, the film's Studio Ghibli anniversary release appeared on the annual lists of ten-best-selling foreign language films on home video for five consecutive years, ranking number seven in 2015, number six in 2016 and 2017, number one in 2018, and number two in 2019 below Spirited Away.</p><br/><h3>Reception</h3><p>My Neighbor Totoro received widespread acclaim from film critics. On the review aggregator website Rotten Tomatoes, 93% of 56 critics' reviews are positive, with an average rating of 8.4/10. The website's consensus reads: \"My Neighbor Totoro is a heartwarming, sentimental masterpiece that captures the simple grace of childhood.\" Metacritic, which uses a weighted average, assigned the film a score of 86 out of 100, based on 15 critics, indicating \"universal acclaim\".</p><p>In 2001, Japanese magazine Animage ranked My Neighbor Totoro 45th in its list of 100 Best Anime Productions of All Time. My Neighbor Totoro was voted the highest-ranking animated film on Sight & Sound's critics' poll of all-time greatest films, and joint 154th overall. In 2022, the magazine ranked the film as the joint-72nd-greatest film overall, being one of two animated films included in the list. My Neighbor Totoro was ranked third on the list of \"Greatest Japanese Animated Films of All Time\" by film magazine Kinema Junpo in 2009, 41st in Empire magazine's \"The 100 Best Films of World Cinema\" in 2010, second on a similar Empire list of best children's films, and number one in the greatest animated films in Time Out; a similar list by the editors ranked the film in third place.</p><p>Film critic Roger Ebert of Chicago Sun-Times identified My Neighbor Totoro as one of his \"Great Movies\", calling it \"one of the lovingly hand-crafted works of Hayao Miyazaki\". In his review, Ebert said the film \"is based on experience, situation and exploration—not on conflict and threat\", and added:</p><blockquote>it would never have won its worldwide audience just because of its warm heart. It is also rich with human comedy in the way it observes the two remarkably convincing, lifelike little girls ... It is a little sad, a little scary, a little surprising and a little informative, just like life itself. It depends on a situation instead of a plot, and suggests that the wonder of life and the resources of imagination supply all the adventure you need.</blockquote><p>Steve Rose from The Guardian gave the film five stars, praising Miyazaki's \"rich, bright, hand-drawn\" animation and describing it as \"full of benign spirituality, prelapsarian innocence and joyous discovery, all rooted in a carefully detailed reality\". Trevor Johnston from Time Out also awarded the film five stars, commenting on its \"delicate rendering of the atmosphere\" and its first half that \"delicately captures both mystery and quietness\". Japanese filmmaker Akira Kurosawa cited My Neighbor Totoro as one of his favorite films. Writing for the London Evening Standard, Charlotte O'Sullivan praised the charm of the film but said it lacks complexity in comparison with Spirited Away. Jordan Cronk from Slant awarded the film three-and-a-half stars but said it is \"devoid of much of the fantasia of Miyazaki’s more outwardly visionary work\". In the 1996 movie guide \"Seen That, Now What?\", My Neighbor Totoro was given the rating of \"A\". The guide stated that the film is an \"enchanting, lushly animated view of the natural world with child's sense of wonder\", and noting its suitability for young children while being \"a perennial favorite among\".</p><p>The 1993 translation was not as well-received as the 2006 translation; Leonard Klady of Variety wrote the 1993 translation demonstrates \"adequate television technical craft\" that is characterized by \"muted pastels, homogenized pictorial style and vapid storyline\". Klady described the film's environment as \"obviously aimed at an international audience\" but \"evinces a disorienting combination of cultures that produces a nowhere land more confused than fascinating\". Stephen Holden of The New York Times described the 1993 translation as \"very visually handsome\", and said the film is \"very charming\" when \"dispensing enchantment\". Despite the highlights, Holden wrote \"too much of the film, however, is taken up with stiff, mechanical chitchat\".</p><p>Matthew Leyland of Sight & Sound reviewed the DVD released in 2006, commenting; \"Miyazaki's family fable is remarkably light on tension, conflict and plot twists, yet it beguiles from beginning to end ... what sticks with the viewer is the every-kid credibility of the girls' actions as they work, play and settle into their new surroundings\". Leyland praised the DVD transfer of the film but noted the disc lacks a look at the film's production, instead being overabundant with storyboards. Writing in Joe Hisaishi's Soundtrack for My Neighbor Totoro, Kunio Hara praised the soundtrack, describing the song \"My Neighbor Totoro\" as a \"sonic icon\" of the film. Hara also commented the music \"arouse a similar sentiment of yearning for the past\".</p><br/><h3>Awards and nominations</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Title</th><th>Award</th><th>Category</th><th>Result</th></tr><tr><td rowspan=\"6\">1989</td><td rowspan=\"6\"><i>My Neighbor Totoro</i></td><td rowspan=\"2\"><span class=\"mw-redirect\">Kinema Junpo Awards</span></td><td><span>Kinema Junpo Award – Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Readers' Choice Award – Best Japanese Film</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Mainichi Film Awards</span></td><td><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Ōfuji Noburō Award</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Blue Ribbon Awards</span></td><td>Special Award</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Animage</span> Anime Awards</td><td>Grand Prix prize</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><br/><h3>Legacy</h3><p>My Neighbor Totoro was considered a milestone for writer-director Hayao Miyazaki. The popularity of film's central character Totoro among Japanese children has been likened to that of Winnie-the-Pooh in Britain. The Independent said Totoro is one of the greatest cartoon characters, describing the creature; \"At once innocent and awe-inspiring, King Totoro captures the innocence and magic of childhood more than any of Miyazaki's other magical creations\". The Financial Times recognized the character's appeal, commenting Totoro \"is more genuinely loved than Mickey Mouse could hope to be in his wildest—not nearly so beautifully illustrated—fantasies\". Empire also commented on Totoro's appeal, ranking him at number 18 on a list of the greatest animated characters of all time.</p><p>According to the environmental journal Ambio, My Neighbor Totoro \"has served as a powerful force to focus the positive feelings that the Japanese people have for satoyama and traditional village life\". The film's central character Totoro was used as a mascot by the Japanese campaign \"Totoro Hometown Fund Campaign\", which aimed to preserve areas of satoyama in Saitama Prefecture. The fund, started in 1990 after the film's release, held an auction in August 2008 at Pixar Animation Studios to sell over 210 original paintings, illustrations, and sculptures inspired by My Neighbor Totoro.</p><p>Totoro has made cameo appearances in many Studio Ghibli films, including Pom Poko, Kiki's Delivery Service, and Whisper of the Heart. The character has also appeared in other anime series and films, including one episode of the Gainax television series His and Her Circumstances. Miyazaki uses Totoro as a part of his logo for Studio Ghibli. Totoro also makes a cameo appearance in the Pixar film Toy Story 3 (2010) but was not included in Toy Story 4 due to licensing problems. Toy Story 3's art director Daisuke Tsutsumi is married to Miyazaki's niece, who inspired the character Mei in My Neighbor Totoro.</p><p>A main-belt asteroid that was discovered on December 31, 1994, was named 10160 Totoro. In 2013, Eoperipatus totoro, a species of velvet worm that was discovered in Vietnam, was named after Totoro. Following the request of the paper's authors, the species was named for the character because he \"uses a many-legged animal as a vehicle, which according to the collectors resembles a velvet worm\".</p><br/><h3>Media</h3><h4>Books</h4><p>In Japan in May 1988, Tokuma published a four-volume series of ani-manga books, which use color images and lines directly from My Neighbor Totoro. The series was licensed for English-language release in North America by Viz Media, which released the books from November 10, 2004, through February 15, 2005. A 111-page picture book based on the film and aimed at young children was released by Tokuma on June 28, 1988, and, in a 112-page English translation, by Viz on November 8, 2005. Tokuma later released another 176-page art book containing conceptual art from the film and interviews with production staff on July 15, 1988, and, in English translation, by Viz on November 8, 2005. In 2013, Viz released a hardcover light novel that was written by Tsugiko Kubo and illustrated by Hayao Miyazaki.</p><h4>Sequel</h4><p>Mei and the Kittenbus (めいとこねこバス, Mei to Konekobasu) is a thirteen-minute sequel to My Neighbor Totoro that was written and directed by Miyazaki. Chika Sakamoto, who voiced Mei in Totoro, returned to voice Mei in this short. Hayao Miyazaki voiced Granny Cat (Neko Baa-chan) and Totoro. The sequel focuses on the character Mei Kusakabe from the original film and her one-night adventures with Kittenbus, the offspring of Catbus, and other cat-oriented vehicles. The sequel was first released in Japan in 2003 and is regularly shown at Ghibli Museum but has not been released on home video.</p><h4>Merchandise</h4><p>Licensed My Neighbor Totoro merchandise of Totoro has been sold in Japan for decades after the film's release. Sales of the film's licensed merchandise in Japan grossed ¥10.97 billion in 1999, ¥56.08 billion during 2003–2007, at least ¥4.1 billion in 2008, and ¥19.96 billion during 2010–2012.</p><h4>Stage adaptation</h4><p>In May 2022, the Royal Shakespeare Company and composer Joe Hisaishi announced a stage adaptation of the film titled My Neighbour Totoro would run from 8 October 2022 to 21 January 2023 at the Barbican Centre, London. It was adapted by British playwright Tom Morton-Smith and directed by Improbable's Phelim McDermott. Tickets went on sale on 19 May 2022, breaking the theater's box-office record for sales in one day that was previously held by the 2015 production of Hamlet starring Benedict Cumberbatch.</p><br/>"
  },
  "errorMessage": ""
}