{
  "imDbId": "tt0032553",
  "title": "The Great Dictator",
  "fullTitle": "The Great Dictator (1940)",
  "type": "Movie",
  "year": "1940",
  "items": [
    {
      "username": "lugonian",
      "userUrl": "https://www.imdb.com/user/ur0853359",
      "reviewLink": "https://www.imdb.com/review/rw0021783",
      "warningSpoilers": true,
      "date": "9 January 2001",
      "rate": "9",
      "helpful": "98 out of 111 found this helpful.",
      "title": "The Man With Hitler's Face",
      "content": "\"The Great Dictator\" (United Artists, 1940), became the long awaited talking debut of silent film comedian, Charlie Chaplin (who also wrote and directed), in a political satire on Adolph Hitler, only the way Chaplin dared to do at the time. He plays a Jewish barber and Hynkel, dictator of Tomania. Some of the humor cannot really be absorbed at first glance, but after repeated viewing, it gets better. My personal classic moment occurs with Chaplin in the barber shop working on a bald-headed customer by giving him a shave while listening to a classical composition on the radio, never missing a beat. Co-starring opposite Chaplin for the second and final time is Paulette Goddard as Hannah. Goddard became the only Chaplin leading lady to ever make a success on her own while the others just drifted to \"B\" movies or faded away. Jack Oakie as Napaloni, the Dictator of Bacteria (a spoof on Mussolini), appears late in the story but shares with Chaplin some of its brilliant comedic moments. Both Chaplin and Oakie earned Academy Award nominations for their performances (Chaplin for Best Actor/Oakie for Best Supporting Actor), but no wins. Henry Daniell as Garbitsch and Reginald Gardiner as Schultz also share the spotlight. Aside from Chaplin's screenplay in poking fun of its then current issues on European invasion by the Nazis, \"The Great Dictator\" expertly blends satire with dramatic overtones. Its closing scene in which Chaplin makes a speech pleading for all people to follow the path of peace, brotherhood and democracy, is not to be missed. Whether this movie is above or beyond the Marx Brothers' \"Duck Soup\" (Paramount, 1933) is anyone's matter of taste. (***)"
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw2031586",
      "warningSpoilers": false,
      "date": "3 March 2009",
      "rate": "8",
      "helpful": "36 out of 43 found this helpful.",
      "title": "Immortal classic movie with dual character for Chaplin as barber Jew and Dictator Hynkel",
      "content": "This ingenious and innovate comedy packs many priceless moments and great sense of pace , though overlong . Chaplin's satire with several classic scenes , he has dual role as a Jewish barber and dictator Hynkel , an offensive portrayal of Hitler . Then the barber is mistaken for the Hitlerian tyrant and there happens bemusing events . Funny and extraordinary acting all around , as the stunning co-stars Jack Oakie as Napolini (Mussolini-alike) , Henry Daniel as Gasbstich (Himmler-alike) and Billy Gilbert as Herring (Goering) . Chaplin's first spoken film is brilliantly photographed by Karl Struss . This splendid film contains numerous amusing scenes , the funniest are the followings : 1) The one when during the WWI the barber-soldier along with a co-pilot are flying in a turned plane without to be aware 2) When Dictator Adenoid Hynkel tells overacting speeches , including a twisted microphone 3) Hynkel playing with an enormous world balloon 4) The Jew-barber shaving a man while fitting to Hungarian Dance : number 5 by Brahms 5) when Hynkel and Napolini each try to keep his body higher than other in a barber's chair , among them .Production on the movie started in 1937 and shot in 539 days when not nearly as many people believed Nazism was a menace , as was the case when it was released in 1940 ; however , this film was ultimately upstaged as the first anti-Nazi film satire . Hitler banned movie exhibition to the Germans due to its satire of him , and put him in his death list after his proposed conquest of America . The movie is co-starred by Paulette Goddard , third of his four wives , they were married in 1936 , although no announcement of the marriage was made later, one time finished The Great Dictator . The picture was released in 1940 , when Chaplin had survived a moral scandal by a paternity suit but a brush with the House of Un-American Activities was the signal for the USA to refuse him re-entry from Britain and he fled to Switzerland . This movie was Charles Chaplin's biggest-ever box-office hit , grossing about $5 million at the time."
    },
    {
      "username": "Steffi_P",
      "userUrl": "https://www.imdb.com/user/ur3063013",
      "reviewLink": "https://www.imdb.com/review/rw2326087",
      "warningSpoilers": false,
      "date": "18 October 2010",
      "rate": "9",
      "helpful": "18 out of 19 found this helpful.",
      "title": "\"Can you hear that?\"",
      "content": "Back at the dawn of the talkie era, Charlie Chaplin defended his decision not to start making sound films by saying \"The moment the little tramp talks, he's dead\". He was right of course. His comic persona was the creation of an era in cinema when words and voices were irrelevant. The little tramp's appeal lay entirely in how he did things, not in what he was supposed to be saying. And yet it was inevitable that if Chaplin wanted to continue in the business he would have to cave in eventually. Besides Chaplin's agenda was itself changing, and he had now reached a point in his life where he really wanted to speak to the world.Many of the early scenes in The Great Dictator seem to prove Chaplin's fears about sound film. The slapstick has lost its flow, looking forced and awkward. And it appears Chaplin has no real idea how to write or direct dialogue. Sometimes characters make some banal little comment on the action as if simply to fill up the silence. Even worse things happen when Chaplin attempts verbal humour, resorting to feeble puns like the one about the gas keeping him awake all night (not that puns are necessarily bad, just that Chaplin isn't very good at them). Above all, the visual and verbal business is poorly integrated, with a badly-timed stop-start feel. It makes it particularly jarring after a dialogue scene to see this ageing version of the little tramp doing some of his old moves, such as teetering on one foot as he runs into a squad of stormtroopers. These scenes are unlikely to raise more than a titter, and are a sad testament to the fact that this familiar character was past his prime and out of time.But this is a tale of two Charlies. For the first time in decades Chaplin creates a new character for himself in dictator Adenoid Hynkel. And the great thing about Hynkel is that he sidesteps Chaplin's inability with comedy in words but still makes use of comedy in sound. The dictator's cod-Germanic speech is part silly-voice, part linguistic nonsense and it is very, very funny. It actually adds to the humour that no-one else in the picture speaks it, and that Hynkel mostly lapses into it in moments of anger, as if it was some involuntary anxiety-driven affectation. The other great thing about Hynkel is that he is one of Chaplin's great works of satire. The nonsense language is of course a lampooning of Hitler's forceful speechmaking, but the parody continues through everything Hynkel does. Take for example when he has finished posing with the baby, and rather disgustedly wipes his hand clean. He does it with the same stiff-faced disdain that Hitler always displayed in public, but the character's puffed-up austerity is also being punctured by the fact that he's just got his hand covered in wee wee. The little tramp, a creation of and for the silent era, could not make the transition to sound. But Hynkel is a creation of and for the sound era, and he works fantastically.As the picture unfolds, it begins to gain maturity and clarity, not to mention comic brilliance. Jack Oakie's Napoloni makes a perfect partner for Hynkel, and their antics together are like the Marx Brothers at their most riotous. Napoloni is also a work of satire equal to Hynkel, with Oakie working in many of Mussolini's less dignified mannerisms, such as curling his lip and bulging his eyes like he's trying to squeeze out a fart. While Chaplin's direction is at its most overt and showy, he also cleverly and subtly gears his compositions towards ridicule, making the most of those tall set designs to show off the dictator as some little twerp. And finally, the picture acquires the poignancy that made Chaplin's silent features stand out, this time with an extra bite in the seriousness of its message. It is then that you realise Chaplin knew his little tramp was finished, and yet that he needed him here to deliver his point. By subjecting him to sound, Chaplin sacrifices his alter-ego, making a means to speak his mind to the public who had loved him."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6191890",
      "warningSpoilers": false,
      "date": "20 October 2020",
      "rate": "9",
      "helpful": "18 out of 20 found this helpful.",
      "title": "'In this world there is room for everyone'...",
      "content": "... and in today's parlance that means regardless of race, ethnicity, gender or sexual orientation but you might struggle to know it with the polarisation that continually pulls us apart, doing more damage to culture and society than any aspiring dictator could ever do.A truly great piece of cinema from a truly great performer and genius, whose closing speech mirrors many of the concerns we perpetually live with today and to which we can add climate change and military AI as we enhance our quest for annihilation, extinction and mutually assured destruction."
    },
    {
      "username": "areatw",
      "userUrl": "https://www.imdb.com/user/ur66517869",
      "reviewLink": "https://www.imdb.com/review/rw3772828",
      "warningSpoilers": false,
      "date": "5 August 2017",
      "rate": "10",
      "helpful": "28 out of 32 found this helpful.",
      "title": "You, the people, have the power!",
      "content": "The tagline of 'The Great Dictator' is 'the comedy masterpiece', and I couldn't think of a better line to sum this film up. It's a hilarious political satire, but it also delivers a vitally important message. This film was released at the time when Hitler was at the height of his power and the main character, dictator Hynkel, is obviously a reference to him.Charlie Chaplin is simply outstanding in this film in what was his first spoken role. To play two completely different characters, Hynkel and the Jewish barber, so convincingly in the same film is truly remarkable. Chaplin's speech at the end, which is very much HIS speech even though he's playing a character, is a piece of cinema I will never forget. Such a powerful, moving and compelling speech that remains relevant even today.Making a comedy out of such a tragedy is risky business, but Chaplin's anti-fascist message ensured it wasn't taken the wrong way. 'The Great Dictator' is a hilarious but meaningful and powerful film. A brilliant piece of cinema."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw0021777",
      "warningSpoilers": true,
      "date": "14 September 2000",
      "rate": "8",
      "helpful": "59 out of 75 found this helpful.",
      "title": "Chaplin's comment on fascism is his first talking film...",
      "content": "Hynkel, dictator of Tomania, is a spoiled child who becomes angry when he cannot gets what he really wants... And what he simply wants is nothing less than the world...In one of the extraordinary scenes of Chaplin art, Hynkel performs a ballet with the 'world' which bursts when he thinks he has it in his grasp...Chaplin also has some biting words on war and war films... In a scene at the beginning of the movie, which takes place during World War I, the Tomanian messenger crashes the plane and thinks... He is about to die... In a state of delirium, he begins to say ridiculous words... The empty double-talk continue ascending into a brilliant take off on all the heroic death scenes of War films...In another scene when he becomes a fugitive in the Jewish ghetto and assumes command of the resistance fomenting rebellion among the old men, he plans to kill the dictator... One of the group must kill the ruthless conqueror of Austerlich... Whoever is chosen will naturally die, but his heroic death will be rewarded and his name will shine like a star in Tomanian history...The sequence in which he and four other characters eat cream cakes containing coins to determine which shall sacrifice his life to murder the dictator is a bitter hilarity filled with great fear...For all its disappointing shortcomings, \"The Great Dictator\" is still a significant movie for the ironic tones of the film adding something that neither Chaplin nor anymore else could have given it: the irony of history... The necessity to murder Hynkel presages the assassination attempt against Hitler by his generals... The force of the original satire is only surpassed by history's imitation of art...With a splendid sequence like the duck-shooting accident which leads to the dictator being mistaken for the humbly Jewish barber and vice versa, \"The Great Dictator\" is Chaplin's first talking movie... This time 'Charles' and not 'Charlie,' wanting to say more through his movie and not through an amusing comedy, the last in which he uses his celebrated 'Tramp Character.'"
    },
    {
      "username": "slokes",
      "userUrl": "https://www.imdb.com/user/ur2375356",
      "reviewLink": "https://www.imdb.com/review/rw2799700",
      "warningSpoilers": false,
      "date": "19 May 2013",
      "rate": "7",
      "helpful": "19 out of 22 found this helpful.",
      "title": "First Laughs And Last Laughs",
      "content": "Charlie Chaplin's boldest film for its willingness to take on Adolf Hitler before nearly anyone else, \"The Great Dictator\" was also Chaplin taking on sound 11 years after everyone else. If it had to be the end of cinema's greatest Silent Clown, he did what he could to take down history's greatest monster in the process.There are two reasons to like \"The Great Dictator.\" One is that Chaplin was on the side of the angels, at no small risk given his target's ambitions. The other is he didn't forget to make it funny.Essentially a Prince And The Pauper remake, \"Dictator\" presents Chaplin as both Adenoid Hynkel, the cruel if inept \"Phooey\" (a. k. a. \"Führer\") of Tomainia, and a Jewish World War I veteran, poignantly left unnamed as a nod to the Common Man, who only wants to work in peace at his barber shop. While Hynkel struggles with his two great passions, hating Jews and loving war, the barber finds love and a cause to believe in.The comedy here can be categorized into the great and the good, with most of the former featuring Chaplin as Hynkel. He's simply much funnier here as the bad guy, whether playing it broad (jumping secretaries, delivering speeches in hate-choked gobbledegook) or subtle (after shooting dead a man who claims to have \"perfected\" a bullet-proof suit, Hynkel simply turns and walks away with a three-word critique: \"Far from perfect.\")Hynkel is a character who solves Chaplin's legendary problem with sound, whether dressing down his blubbering subordinate Herring (Billy Gilbert) or struggling to keep his composure when fellow dictator Napaloni (Jack Oakie) rebuffs his attempts at intimidation. Told by his right-hand man Garbitsch (Henry Daniell) that the people are objecting to sawdust in the bread, he huffs: \"What more do they want? It's from the finest lumber our mills can supply!\"The comedy around the barber gets more labored. Maybe it's because much of it turns on the oppression of the Jews, though Chaplin here is trying to establish them as underdogs and rooting interest. It's here the film becomes tricky, not because he is mocking the unmockable but because the characters we meet, including the Barber, are fairly bland and the humor patchy. There is some very funny material here, but excessive bits too where people get klonked with pans or splattered with whitewash. At least Chaplin avoided setting a pie fight in a starving ghetto.The famous last scene is a great divider for many; in it Chaplin steps out of character to address us the audience about...what? The world needs more love and less hate, I guess. It's a philosophically strangled message, both anti-fascist and oddly pacifistic at a time when Hitler's legions were swallowing Europe, with Chaplin warning of \"machine men with machine minds\" as if he was still making \"Modern Times\" and punching the sky at times for lame effect.To me it's a crass way to end a good comedy, if perhaps necessary given the stakes involved. Hitler was real, and calling him out for what he was had real value in terms of rallying those called upon to defeat him. If it doesn't transcend time as well as it could, \"The Great Dictator\" is still a fine comedy that delivers strong laughs and stronger historical resonances."
    },
    {
      "username": "muzikla",
      "userUrl": "https://www.imdb.com/user/ur4646765",
      "reviewLink": "https://www.imdb.com/review/rw1005305",
      "warningSpoilers": false,
      "date": "23 January 2005",
      "rate": "10",
      "helpful": "228 out of 247 found this helpful.",
      "title": "We think too much and feel too little.",
      "content": "I was surprised and impressed to find out this movie was released in 1940, before the United States entered World War II. On the surface, satirizing something as solemn and horrible as Nazi Germany could be misconstrued as rash. But Chaplin's brilliance isn't limited to making a joke out of everything. In fact, the seriousness of his message wouldn't have been nearly as valid if not for the excellent use of humor in this movie along with the moments of stark drama blended in. Drama alone wouldn't have had the bite and resonance that this film did. Laughing at someone (Adenoid Hynkel) can be the best way to attack them, while laughing with someone (the Jewish Barber) can be the best way to love them. In the Jewish Barber's final speech, I forgot for a moment that the war he was talking about happened more than half a century ago. They are words that have meaning now, and in any time of war. For this reason I believe the film did far greater good than harm, as it still has the same profound effect today."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0021773",
      "warningSpoilers": false,
      "date": "6 August 2000",
      "rate": "",
      "helpful": "28 out of 38 found this helpful.",
      "title": "About the America that Exiled Him",
      "content": "I find this film remarkable. Here you have a man at the peak of his celebrity who has some moral responsibility. How rare! Imagine Michael Jordan risking all (and eventually losing all) in order to do the right thing. This film is a multidimensional risk: he is trying to master the talkie (though his talent is in the visual), he is trying to mix tragedy and comedy (always a hard mix, and nearly impossible when using current events) and he is trying to actually effect his audience, to counter evil in the land.One must remember that when this was started, Hitler was generally admired in the US and essentially no one at all was standing up for the Jews. (In the film: `first we get the Jews, and then the brunettes.')I think he succeeds so far as the talkie, but he doesn't stand at the top of the heap, and several years before, the Marx brothers had made their own, superior, antiwar movie (Duck Soup). He succeeds in mixing comedy and tragedy only by alternating, and extending the length of the film.Concerning his effectiveness in countering evil: his impassioned speech at the end is powerful. But it appears to have had no effect whatsoever. This is the man that McCarthy and friends drove from the US! I think one of his mistakes was portraying the pogrom and invasions as the work of one man, rather than of a whole nation: Germans, not Nazis."
    },
    {
      "username": "Kakueke",
      "userUrl": "https://www.imdb.com/user/ur1175169",
      "reviewLink": "https://www.imdb.com/review/rw0021796",
      "warningSpoilers": false,
      "date": "29 October 2001",
      "rate": "10",
      "helpful": "138 out of 177 found this helpful.",
      "title": "Masterpiece",
      "content": "The Great Dictator is a beyond-excellent film. Charlie Chaplin succeeds in being both extremely funny and witty and yet at the same time provides a strong statement in his satire against fascism. The anti-Nazi speech by Chaplin at the end, with its values, is one of filmdom's great moments. Throughout this movie, I sensed there was some higher form of intelligence, beyond genuinely intelligent filmmaking, at work."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw2346263",
      "warningSpoilers": false,
      "date": "30 November 2010",
      "rate": "10",
      "helpful": "11 out of 14 found this helpful.",
      "title": "The Tramp Finally Speaks",
      "content": "Charlie Chaplin certainly put off speaking on cinema long enough. His bread and butter was made with his little tramp character on the silent screen. But when Chaplin finally did speak he spoke some of the most memorable prose ever spoken on the cinema. The eloquence of his appeal for universal brotherhood is maybe more relevant today than even back in 1940 when he decided to satirize Nazi Germany in The Great Dictator.In his memoirs Chaplin said that he would never have made The Great Dictator had he suspected for a moment exactly the extent of what was going on in Nazi Germany. It was bad enough in 1940, but of course Hitler's final solution doctrine about systematic extermination wasn't put in place until the following year. After that Nazi Germany provided damn few laughs.As the film opens Chaplin hearkens back to his World War I classic Shoulder Arms when we see him as a bumbling soldier during World War I. He saves the life of air ace Reginald Gardiner, but in doing so is injured and loses his memory. Some fifteen years later Charlie regains his memory and leaves the hospital and returns to his profession as barber in the Jewish quarter of his native city.No one notices, but the little barber with the funny mustache bears no small resemblance to the dictator of his country of Ptomania, Adenoid Hynkel. And as it turns out Reginald Gardiner who is a storm trooper commandant gets reacquainted with his savior and has a reassessment of his feelings about Jews. Of course in the end that resemblance proves to be Gardiner and Chaplin's salvation and in Chaplin's fantasy world the salvation of humanity.In his Hynkel persona Chaplin was the first on the screen to satirize Hitler, to make him an object of ridicule. Later on when America was finally in World War II in some of our lesser propaganda efforts, Hitler impersonators like Bobby Watson leaned heavily on what Chaplin did in The Great Dictator. Of course his best Hynkel moment is the famous dream scene where the globe becomes a big beach ball type balloon with Chaplin lovingly treating it in the best fetishistic manner. As the barber Chaplin also goes back to his little tramp roots and is seen giving one of his customers a shave to the music of Brahm's Number 5 Dance could have been done in any of his silent classics. Chaplin's final speech was a masterpiece. People like Orson Welles, Paul Muni, and Spencer Tracy are probably the players most noted for giving long addresses well on screen, but for a man whose cinematic career was spent in silence up to that point, Chaplin was nothing short of brilliant. When the Tramp finally spoke, what profound things he had to say.The Great Dictator made a pile of money for United Artists of whom one of the partners was Charlie Chaplin. It received five Oscar nominations for Best Picture, Best Actor for Chaplin, Best Supporting Actor for Jack Oakie, Best Musical Score for Meredith Willson, and Best Original Screenplay for Chaplin. Curiously enough Charlie wasn't nominated for Best Director. Casting Jack Oakie as the spoof dictator Nappoloni based on that other Axis partner Mussolini was a stroke of genius. Oakie played loudmouth blowhards his entire film career and as Nappoloni of Bacteria, Oakie played one of the biggest blowhards in history. Oakie lost to Walter Brennan for The Westerner and Chaplin gave way to Jimmy Stewart in The Philadelphia Story. Chaplin did win the New York Film Critic's Award for Best Actor in 1940.Others worthy of note are Charlie's then estranged wife Paulette Goddard as the barber's love interest. Paulette who was Paulette Levy by birth played a Jew for maybe the only time in her career. Henry Daniell is minister of propaganda Garbitsch and he's his usual cold and cynical, but Charlie should have gotten Martin Kosleck who got a lot of work during World War II with a dead-on impersonation of Joseph Goebbels. For Air Minister Herring who would you get for the weight challenged Herman Goerring, but Billy Gilbert.In a world where a lot of self seeking politicians and terrorists appeal to the worst in man, The Great Dictator is timeless because of its appeal to the better angels of our nature as James Madison phrased it. Never miss this when it is broadcast it will renew your human spirit."
    },
    {
      "username": "barrysheene",
      "userUrl": "https://www.imdb.com/user/ur0849853",
      "reviewLink": "https://www.imdb.com/review/rw0021827",
      "warningSpoilers": false,
      "date": "6 March 2004",
      "rate": "9",
      "helpful": "212 out of 253 found this helpful.",
      "title": "Remember that......",
      "content": "..this movie has been done when Hitler ( and Mussolini who is as well in the movie) was at the top and many politics and even the Roman Church used to close eyes about brutality and evil of Nazism. Especially in USA there were many people who had not understood what was really going on in Germany and Europe ( Charles Lindenbergh for example ).It would be as today a big actor would made a parody of Berlusconi or Chirac. Chaplin maybe made a lot of mistakes in his life, but this is really a masterpiece of humanity and IMHO a great demonstration he was a courageous man. The movie is funny and deep, the final speech has a terrible strength and is still updated. I think this movie is one of the best ever done."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2295196",
      "warningSpoilers": false,
      "date": "14 August 2010",
      "rate": "10",
      "helpful": "13 out of 18 found this helpful.",
      "title": "Wonderful satire on the Anti- Semitic Nazi regime",
      "content": "Along with The Gold Rush, Modern Times and City Lights(my personal favourite) this is one of my favourites from Charlie Chaplin. The Great Dictator is just a wonderful satire on the Anti-Semitic Nazi regime- Hitler mayn't have got the joke in this comedy, but I think he got the point.The Great Dictator looks great, with some great dialogue and a chockful of great moments, comedic or not. It is also excellently directed, and features wonderful performances from Paulette Goddard, Jack Oakie and especially the comedy genius himself. The Great Dictator has many great moments as I've said, but three scenes stand out especially. One is the barber dancing in time to a Hungarian dance by Brahms. Another is Hynkel's solo ballet with a globe of the world. My favourite though is the final speech, pleading for universal tolerance. Mawkish and outrageous it is, but also very powerful and quite ambitious if you put it in context(I can only imagine the controversy that scene alone caused).Overall, wonderful and powerful. 10/10 Bethany Cox"
    },
    {
      "username": "The_Movie_Cat",
      "userUrl": "https://www.imdb.com/user/ur0234740",
      "reviewLink": "https://www.imdb.com/review/rw0021776",
      "warningSpoilers": false,
      "date": "2 September 2000",
      "rate": "8",
      "helpful": "9 out of 10 found this helpful.",
      "title": "\"Any resemblance between Hynkel the dictator and the Jewish barber is purely coincidental\"",
      "content": "When a film opens with the above note, referring to Chaplin's dual role, but also a cheeky dig at the fact that Hynkel is a not-at-all disguised parody of Hitler, you know exactly what you're in for. This two-hour long lambasting of the Nazi regime may not be subtle, but by God Chaplin knew how to rip the p***.If rumours are to be believed, Hitler had him placed at the top of his death list after this film's release – now that's street cred. We first see Adenoid Hynkel addressing the German (Tomanian) nation, giving a speech that involves much arm-saluting, nonsense English that makes use of the phrase \"sour kraut\" and his more embittered rages descending into coughing fits. \"His excellency has just referred to the Jewish people\", informs an announcer after a rage-filled moment that causes microphones to bend and quiver in fear. His first German-language dictates to his minister of war (Herring) involve \"banana\" and \"cheeseuncrackerz\". Look out too for instructions to his Minister of Interiors, Garbitsch.I've never really gotten into Charlie (always credited as Charles) Chaplin, as I find his innocent sentimentality a little hard to get to grips with in today's society. W.C.Fields, and, to an extent, Harold Lloyd and Laurel & Hardy can still entertain, as they have something of the attitude, or edge, that Chaplin lacks. Ironically, it's modern times that mean we now find it hard to fully appreciate Modern Times. However, dialogue and a harsher undercurrent – including a Jewish barber (Chaplin, again) being hung from a lamppost mean that even today The Great Dictator is relevant.There are some nice silly jokes, such as the barber, confronted by a Stormtrooper, being told: \"and I thought you were an Arian\". \"Well, I'm a veget – arian\", replies Chaplin, trying to fit in. Many jokes – such as Hynkel making a long speech and his secretary typing up just a couple of words; then saying just a couple of words only for her to translate it into paragraphs – were originated here and have been repeated countless times in other places. Some of the most amusing slapstick is when Hynkel meets fellow dictator Mussolini (Napaloni), and tries to impress him by having the greater psychological perspective in all their meetings. In a gag much honoured by Bugs Bunny, the two crank themselves up to ever-greater heights on barber's chairs.Elsewhere, the film also has a grand scale, with ceilings on sets and news reports propelling the narrative – you know, the sort of thing Citizen Kane was so highly praised for the following year. If there's a fault with this film then it's not so much with the sentimental, whiter-than-white Jewish population, but with Chaplin's interpretation of Hynkel. Although he gets all the best jokes and scenes, he's simply too likable to really convey the threat Chaplin was trying to stop. Nevertheless, this is forgotten as the ending gives us the Jewish barber taking Hynkel's place, and Chaplin making an impassioned, three-minute speech in the name of freedom.Charles Chaplin played two roles in this movie, wrote, directed, produced and, uncredited, composed original music for it. To claim it changed the world is an overstatement. America still had a good opinion of Hitler at the time, and, after it was released... they still had a good opinion of Hitler. It was still some time before they would even enter the second world war, and with the final speech being adopted for Communist pamphlets in England, this only caused Chaplin troubles when it came to the McCarthy witch trials. There's a sense that Chaplin isn't the master in the field of talkies, and that his use of mime was beginning to date. History was overtaking him, but The Great Dictator still stands as one of the most personal, and risk-taking films ever put on celluloid.Postscript, April 2012: I've since watched all of Chaplin's features and every short. So, I was talking rubbish when I said twelve years ago that he didn't have modern appeal. Sorry about that. However, I stand by most of the review, even if \"Chaplin on Hitler's death list\" is a \"fact\" I've only read in Trivial Pursuits. Oh, look out for the documentary that's included on the DVD - \"The Tramp and the Dictator\" - well worth seeing, as well as Chaplin's extensive thoughts on this film and its aftermath in his 1964 autobiography."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3694662",
      "warningSpoilers": true,
      "date": "27 April 2017",
      "rate": "7",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Well-regarded for a reason",
      "content": "THE GREAT DICTATOR is well-regarded as Charlie Chaplin's best movie and it's easy to see why. This is the film in which he mercilessly satirises Adolf Hitler, then at the peak of his ascendancy, while also exploring the persecution of the Jews under the Nazi regime. It's all disguised as another country and regime but we know it's Hitler that Chaplin is taking the mickey out of. It's a broad, character-based comedy all right, but deals with huge and pressing themes, and Chaplin deserves kudos for being the little man who stood up to a tyrant."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw1120817",
      "warningSpoilers": false,
      "date": "7 July 2005",
      "rate": "10",
      "helpful": "10 out of 13 found this helpful.",
      "title": "...und de movies und de...",
      "content": "I would say that \"The Great Dictator\" is Charlie Chaplin's best movie ever. Mainly a spoof of Hitler, but also reminding us about tyranny in any form, the movie was Chaplin's first talkie. Probably the funniest aspect is his mockery of German: dictator Adenoid Hynkel stands up on the podium and rants something that sounds like: \"Eh, de Holstein und de Aryan maiden und de strangulation itten. Kapeet! Kapatt! Deutsch Juden...grrr deutsch Juden!\" Another great scene is when he's arguing with the Mussolini character about the Ostralich border, and their argument almost turns into a catfight.Seeing how he pointed the finger at all tyranny, it's easy to see why HUAC used this movie to kick Chaplin out of the country. No matter, Chaplin ended up getting the last laugh; not only did the Oscars eventually give him an honorary Oscar, but the world remembers him as one of the greatest directors in history."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw6435807",
      "warningSpoilers": false,
      "date": "2 January 2021",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Almost Too Much to Take In",
      "content": "I hadn't watched a Charlie Chaplin movie for ages. I'd seen this a long time ago. I resurrected my admiration for the guy. First of all, the pure physical comedy is phenomenal. The choreographed fight scenes are priceless. Then there is his persona as a variant of the little tramp, this time as a Jewish barber who has had amnesia for twenty years. But the courageous parody portrayal of the disgusting figures of World War II is great. It it weren't so tragic it would be even funnier. Just the names of the figures alone are great. Paulette Godard is really fun and has a strong female voice. It's a terrific film in every aspect."
    },
    {
      "username": "blanche-2",
      "userUrl": "https://www.imdb.com/user/ur0342623",
      "reviewLink": "https://www.imdb.com/review/rw1818615",
      "warningSpoilers": false,
      "date": "12 February 2008",
      "rate": "8",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Amazing film, amazing Chaplin",
      "content": "Charlie Chaplin is \"The Great Dictator\" in this 1940 comedy-drama also starring Paulette Goddard, Reginald Gardner, Henry Daniell and Billy Gilbert. Chaplin has the dual role of a Hitler-like dictator, Adenoid Hynkel (\"Hail, Hynkel\") (all the countries are fictional, and the party logo is one X on top of another) and also a war veteran, a sweet barber who looks like Hynkel. There are some truly hilarious parts of this film as well as some truly dramatic ones. The barber trying to keep from falling out of a plane is just one; the nonsense German Hynkel speaks; the barber shaving one customer in time with the music, playing to Chaplin's silent film strengths; Hynkel's dancing with his world globe, which is really a huge balloon.The serious parts take place in the Jewish ghetto where the Jews are persecuted by Hynkel's men - Jew is written on the store fronts, and the soldiers are violent. In such stark contrast to the comedy, these scenes make a strong impression. The ghetto never knows what to expect - when Hynkel is trying to get a loan from a man named Epstein to attack and take over Osterlich, he has his soldiers lay off the Jews so as not to upset Epstein. Eventually the barber winds up in a concentration camp but escapes and is mistaken for Hynkel.Under Chaplin's direction, none of the film seems to be played for comedy. Hynkel himself is a buffoon, but he means it. The most amazing part of the film for me was the very end, when the Barber gives a speech as Hynkel. It's absolutely brilliant and very timely. The beautiful, radiant Goddard, looking at the sky, hope in her eyes, is not something I'll ever forget.Highly recommended. Made in 1940, the U.S. had not entered the war and Europe's problems were just beginning. Alas, the barber's speech wasn't reality."
    },
    {
      "username": "AttilaD87",
      "userUrl": "https://www.imdb.com/user/ur17687688",
      "reviewLink": "https://www.imdb.com/review/rw1969280",
      "warningSpoilers": false,
      "date": "2 November 2008",
      "rate": "9",
      "helpful": "26 out of 30 found this helpful.",
      "title": "An entertaining comedy with a great end speech",
      "content": "The Great Dictator is Chaplin's parody about the Nazi Germany with scenes that make you laugh no matter in what mood you are.Beside this ,from my point of view the movie's best part is the superb speech by the Jewish Barber ,a speech's thoughts that if would existed a little bit in Hitler's mind too it would had a chance for the world too pas a second world war.The Speech: \"I'm sorry but I don't want to be an emperor.That's not my business.I don't want to rule or conquer anyone.I should like to help everyone: Jew, gentile, black man, white.We all want to help one another.Human beings are like that.We want to live by each other's happiness, not misery.We don't want to hate one another.In this world, the good earth is rich and can provide for everyone.The way of life can be free and beautiful but we have lost the way.Greed has poisoned men's souls, has barricaded the world with hate, has goose-stepped us into bloodshed.We have developed speed but have shut ourselves in.Machinery has left us in want.Our knowledge has made us cynical, our cleverness, hard and unkind.We think too much and feel too little.More than machinery we need humanity.More than cleverness we need kindness and gentleness.Without these qualities, life will be violent and all will be lost...The airplane and radio have brought us closer.These inventions cry out for the goodness in man, cry out for universal brotherhood, for the unity of us all.Even now my voice is reaching millions, millions of despairing men, women and children, victims of a system that makes men torture and imprison innocent people.To those who can hear me I say, do not despair.The misery upon us is but the passing of greed, the bitterness of men who fear the way of human progress.The hate of men will pass, and dictators die, and the power they took will return to the people.So long as men die liberty will never perish.Soldiers, don't give yourselves to brutes, men who despise you, enslave you, regiment your lives, tell you what to think and feel, who drill you, treat you like cattle and use you as cannon fodder.Don't give yourselves to these men, machine men with machine minds and machine hearts.You are not machines, you are not cattle, you are men! You have the love of humanity in you.Don't hate. Only the unloved and the unnatural hate.Soldiers, don't fight for slavery, fight for liberty! St Luke says, \"The Kingdom of God is within man.\" Not in one man nor a group of men, but in all men. In you! You have the power to create machines, the power to create happiness.You have the power to make this life free and beautiful, to make this life a wonderful adventure.In the name of democracy, let us use that power.Let us all unite, let us fight for a new world, a world that will give men a chance to work, that will give youth a future and old age security.Promising these things, brutes have risen.But they lie! They do not fulfill that promise. They never will! Dictators free themselves but they enslave the people.Now let us fight to fulfill that promise! Let us fight to free the world, to do away with national barriers, to do away with greed, with hate and intolerance.Let us fight for a world of reason, a world where science and progress will lead to the happiness of all.Soldiers, in the name of democracy, let us unite!\""
    },
    {
      "username": "gbill-74877",
      "userUrl": "https://www.imdb.com/user/ur66111139",
      "reviewLink": "https://www.imdb.com/review/rw4899707",
      "warningSpoilers": false,
      "date": "30 May 2019",
      "rate": "9",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Outstanding",
      "content": "Only Chaplin could deliver such a high level of humor and scathing satire in the same film, which was a beacon of light in a very dark time, and obviously on the right side of history. I love his humanity, courage, and vision in delivering this message at a time when America was wavering about entering WWII. There were lots of highlights:The on-point Hitler impression. Aside from the vocalization, throughout the movie we see Chaplin poking at the dictator's lack of intelligence, deep insecurity, and insane whims. There is also a steady stream of mockery of the Nazi war machine: the exaggerated march, overly vertical salute, inventions like the bullet-proof uniform and compact parachute, and plays on names, e.g. The \"Phooey\" instead of The Fuhrer, Herr Herring as Goring, Minister of War, Herr Garbitsch as Goebbels, Minister of Propaganda, etc.Hitler/Hynkel getting this advice, with the relevance to today's ugly turn in politics: \"I thought your reference to the Jews might have been more violent. We've got to rouse the people's anger. At this time, violence against the Jews might take the public's mind off its stomach.\" And later: \"You might go a little further with the Jews - burn down some of their houses. A spectacular assault on their ghettos, now that might prove diverting.\"The satire in the line \"Brunettes are trouble makers. They're worse than the Jews,\" and as the fascists dream about a blonde world, Herr Garbitsch slipping in that it would have \"a brunette dictator\", which of course was an irony of Hitler's Aryan ideal despite his own looks.The physical comedy, an example of which early on is in dropping a grenade down his sleeve as he tries to throw it, and later his understated reaction to finding out they're flying upside-down and out of gas. Later we see Hitler/Hynkel doing silly things like a ballet leap across the floor, followed by climbing the curtain and imitating Garbo's \"I want to be alone,\" and also knocking that balloon globe around with his behind.The Jewish barber being a veteran of WWI, and then also walking down the street in persona of The Tramp, both of which were reminders of the humanity of the Jewish people.Paulette Goddard's character saying \"Do you believe in God? I do! But, if there wasn't one, would you live any different? I wouldn't.\"The shave to the music of Brahms (where Chuck Jones got the idea for the Bugs Bunny 'Rabbit of Seville' bit ten years later).Commander Schultz: \"Your cause is doomed to failure because it's built on the stupid, ruthless persecution of innocent people. Your policy is worse than a crime. It's a tragic blunder!\"My God, that speech near the end. Absolutely stirring. The beginning of it is:\"I'm sorry, but I don't want to be an emperor. That's not my business. I don't want to rule or conquer anyone. I should like to help everyone if possible; Jew, Gentile, black man, white. We all want to help one another. Human beings are like that. We want to live by each other's happiness, not by each other's misery. We don't want to hate and despise one another. In this world there is room for everyone, and the good earth is rich and can provide for everyone. The way of life can be free and beautiful, but we have lost the way. Greed has poisoned men's souls, has barricaded the world with hate, has goose-stepped us into misery and bloodshed. We have developed speed, but we have shut ourselves in. Machinery that gives abundance has left us in want. Our knowledge has made us cynical; our cleverness, hard and unkind. We think too much and feel too little. More than machinery, we need humanity. More than cleverness, we need kindness and gentleness. Without these qualities, life will be violent and all will be lost. The airplane and the radio have brought us closer together. The very nature of these inventions cries out for the goodness in men; cries out for universal brotherhood; for the unity of us all. Even now my voice is reaching millions throughout the world, millions of despairing men, women, and little children, victims of a system that makes men torture and imprison innocent people. To those who can hear me, I say, do not despair. The misery that is now upon us is but the passing of greed, the bitterness of men who fear the way of human progress. The hate of men will pass, and dictators die, and the power they took from the people will return to the people. And so long as men die, liberty will never perish.\""
    },
    {
      "username": "minister_of_silly_walks",
      "userUrl": "https://www.imdb.com/user/ur64212521",
      "reviewLink": "https://www.imdb.com/review/rw4864774",
      "warningSpoilers": false,
      "date": "19 May 2019",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "The icon of comedy finally speaks!",
      "content": "To call \"The Great Dictator\" an excellent film would be an understatement. It is one of the masterpieces of classic cinema brought to us by a Hollywood pioneer and one of the most beloved people of the 20th century. It is a satire of Nazi Germany released in the height of their power and the invasion of Europe. A slap in the face of tyranny and bloodthirsty rulers all across the globe, but particularly aimed at Nazi Germany. Even thought it has such a serious theme the movie is still filled to the brim with laughs and shenanigans that can only be delivered by Chaplin. It shows you the absurdness of fascism and Nazism by openly lampooning its philosophy and its leaders, but also it has a subtle message of terror showing us what happens when such people get in place of power. It all culminates with one of the most iconic speeches in cinematic history that resounds with people all around the globe to this day. A must watch for any fan of comedy, history and cinema!"
    },
    {
      "username": "filipemanuelneto",
      "userUrl": "https://www.imdb.com/user/ur53053227",
      "reviewLink": "https://www.imdb.com/review/rw5554340",
      "warningSpoilers": false,
      "date": "16 March 2020",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "A good film, which was well used for anti-Nazi propaganda.",
      "content": "Charlie Chaplin's first spoken film, most famous for his silent films, is also one of the most striking in his career, as it is a fun, deeply critical satire on Nazi Germany. It should be noted that Hitler was an admirer of Chaplin's work, to the point of copying his mustache. I doubt that it continued after this film, but we will never know.The film itself is entertaining and was skillfully used as anti-Nazi propaganda material inside and outside the United States. It's not quite a comedy ... it's more of a satire. Personally, I had no problem with an amusing Hitler or laughing at the Third Reich. The way in which Chaplin caricatured Hitler becomes pertinent in the face of the German monster's attitudes. Sometimes satirizing is a way of saying very serious things without making it seem heavy. Perhaps even heavier and deeper is Chaplin's interpretation as a Jew in this same film. It's not fun, he never makes jokes about the way Jews are treated, on the contrary: it shows the brutality and abuse of authorities and soldiers well.The dialogues are excellent, especially the famous final speech where Chaplin truly makes an overt and evident political appeal. The props, costumes and sets are also very good. In addition to Chaplin, who carries the film on his back, the cast features Paulette Goddard, Jack Oakie and Reginald Gardiner, all of whom are very good but unable to steal the protagonist's shine."
    },
    {
      "username": "zetes",
      "userUrl": "https://www.imdb.com/user/ur0391152",
      "reviewLink": "https://www.imdb.com/review/rw0021778",
      "warningSpoilers": false,
      "date": "16 September 2000",
      "rate": "8",
      "helpful": "12 out of 17 found this helpful.",
      "title": "Pretty good Chaplin film with extraordinarily powerful final moments",
      "content": "I once caught about a 20 minute portion of this movie on Turner Classic Movies about 6 months back. I thought every minute of what I was watching was gold, and, because it was somewhere in the film's middle and I didn't want to spoil the whole thing if I were to watch it from the start, I decided that I would rent it immediately. Well, the video store which I frequent did not have a copy, so it took me six months to finally go somewhere else and rent it. I had previous to that experience only seen some Chaplin shorts, funny but not greatly artful, but after I saw the snippet of The Great Dictator, I checked out three of his other films, City Lights, The Gold Rush, and Modern Times (City Lights was great, I found the Gold Rush a little overrated, but still worthwhile, and I found Modern Times to be one of the funniest films I've ever seen (second funniest, behind Keaton's Sherlock Jr., more exactly).Finally, the whole of the Great Dictator. Well, to be honest, it had its moments, both of comedy and of drama. But these moments don't always mix well. Chaplin's comedy worked well when mixed with melodrama (City Lights is the best example of this), but it didn't always work with social commentary. Plus, the fact that there was dialogue lessened the impressiveness of Chaplin's talent. Don't get me wrong, I liked the movie as a whole, but I thought it of little consequence. I would have given it a solid 7/10 on the ratings scale...if not for the ending. The final speech that the Jewish barber gives is enormously powerful. Yes, it is adressed to the tempora et mores of 1940, but his message is perfectly applicable to the world today. The speech brought me to tears, and I consider it one of the best endings I've ever seen. Final score: 8/10."
    },
    {
      "username": "donnola",
      "userUrl": "https://www.imdb.com/user/ur1425686",
      "reviewLink": "https://www.imdb.com/review/rw0021775",
      "warningSpoilers": false,
      "date": "5 June 2002",
      "rate": "",
      "helpful": "154 out of 182 found this helpful.",
      "title": "The \"Pre-Mature\" Anti-Fascist",
      "content": "Released in 1940, \"The Great Dictator\" was the first Hollywood film that denounced Hitler directly (albeit in the guise of Adenoid Hynkel), took a virulent stand against fascism, and directly addressed Anti-Semitism. Over-long, at times heavy-handed, it still has many wonderful sequences, including the famous dance with the globe, and all the scenes of Chaplin with Jack Oakie, each trying to out-do the other and prove his superiority.One criticism that seems to occasionally rear its head is the implication that Chaplin's pre-World War II anti-fascism was somehow wrong-headed. The atrocities of the Holocaust weren't fully known to the world yet, so Chaplin's anti-Hitler diatribe is, in the minds of some, misguided. After the war this mindset would result in the debacle of the blacklist, when Chaplin, among others, were branded \"pre-mature anti-fascists.\" In other words, it wasn't politically acceptable to be against Nazism until war broke out with the U.S. Hard to believe anyone could still see things that way now, but some do.The film industry of the 1930s wanted no part of international politics, no matter how blatant the brutality of a given regime. Profits were at stake. It was little goyisha Charley Chaplin, playing a Jewish barber, who took a public stand.While \"The Great Dictator\" may not among Chaplin's finest films, it may, historically, be his finest hour."
    },
    {
      "username": "Doylenf",
      "userUrl": "https://www.imdb.com/user/ur1048771",
      "reviewLink": "https://www.imdb.com/review/rw0021809",
      "warningSpoilers": false,
      "date": "1 October 2002",
      "rate": "",
      "helpful": "33 out of 59 found this helpful.",
      "title": "The best moments are in pantomime...",
      "content": "Since enough plot elements have been discussed in previous reviews, suffice it to say that although I enjoyed this legendary Chaplin film, it is by no means a masterpiece. It's slow in getting started and then becomes a series of heavy-handed vignettes about life in the ghetto contrasted with the life of The Great Dictator, giving Chaplin a chance to emote in high style as both the tramp-like Jewish barber and as Adenoid Hynkel. His funniest bits are of course whenever he does a brilliant piece of \"silent\" acting with gestures timed to the background music--notably in the barbershop scene where a nervous customer gets a close shave. Unfortunately, none of the dialogue is as brilliant as his use of pantomime.Indeed, there is a heavy handedness about much of the story's pace and direction. It almost seems as though Chaplin told his actors to play against his comedy by keeping a sober straight face uppermost in mind--watch how Henry Daniell and Reginald Gardiner play their parts with that stiff upper lip approach. An exception is Jack Oakie as Napaloni, doing a brilliant take-off on Mussolini. As a poor Jewish waif, Paulette Goddard shows all the vivaciousness that made her a star in subsequent films throughout the '40s. She adds warmth to all of her scenes with Chaplin.Some of the gags are carried on at too great a length, outlasting their comic value. And criticism can be made of some of the sequences played against fake scenery when obviously a good deal of money was spent on the main sets. The station scene featuring Napaloni's arrival is staged on an obviously fake studio set where the painted scenery stands out like a sore thumb. Jack Oakie got his only Supporting Role Oscar nomination for this one and Chaplin won a Best Actor nomination.Whatever the shortcomings, it does manage to keep afloat with some very amusing sequences. Chaplin deserves credit for even attempting such a satire--especially considering this was near the outbreak of the U.S. entry into war. His scene with the globe shows off his rare comic timing.A final note: the six minute speech at the end seems improbable coming from the timid Jewish barber and strikes a false note because it's so out of character. Obviously, Chaplin intended it to give the film a personal message of hope."
    }
  ],
  "errorMessage": ""
}