{
  "imDbId": "tt1392190",
  "title": "Mad Max: Fury Road",
  "fullTitle": "Mad Max: Fury Road (2015)",
  "type": "Movie",
  "year": "2015",
  "items": [
    {
      "publisher": "Hitfix",
      "author": "Drew McWeeny",
      "link": "https://uproxx.com/entertainment/",
      "rate": "100",
      "content": "There is nothing easy or predictable about what George Miller delivers with Mad Max: Fury Road, a stone-cold action master class, beautiful and brainy and startling in the ways it throws off the current definition of the blockbuster."
    },
    {
      "publisher": "Variety",
      "author": "Justin Chang",
      "link": "https://variety.com/2015/film/reviews/mad-max-review-tom-hardy-charlize-theron-1201491726/",
      "rate": "100",
      "content": "There is gargantuan excess here, to be sure — and no shortage of madness — but there is also an astonishing level of discipline."
    },
    {
      "publisher": "The Telegraph",
      "author": "Robbie Collin",
      "link": "https://www.telegraph.co.uk/films/",
      "rate": "100",
      "content": "The world of Mad Max has always been welded together from bits of whatever was lying around, and the films’ brilliance has always been in their welding – the ingenious ways in which their scrap-metal parts were combined to create something unthinkable, hilarious or obscene, and often all three."
    },
    {
      "publisher": "Time Out",
      "author": "David Ehrlich",
      "link": "",
      "rate": "100",
      "content": "Marrying the biting frenzy of Terry Gilliam’s film universe with the explosive grandeur of James Cameron, Miller cooks up some exhilaratingly sustained action. But the key to this symphony of twisted metal is how the film never forgets that violence is a sort of madness."
    },
    {
      "publisher": "TheWrap",
      "author": "Alonso Duralde",
      "link": "https://www.thewrap.com/mad-max-fury-road-review-tom-hardy-charlize-theron-nicholas-hoult/",
      "rate": "95",
      "content": "Where Fury Road stands apart from so much of today’s action cinema is that the human element remains front and center."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Todd McCarthy",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/mad-max-fury-road-film-794753/",
      "rate": "90",
      "content": "The first two Max features ran barely 90 minutes and it takes guts and real confidence to dare push a straight chase film with very little dialogue to two hours. But Miller has pulled it off by coming up with innumerable new elements to keep the action compelling."
    },
    {
      "publisher": "IndieWire",
      "author": "Eric Kohn",
      "link": "https://www.indiewire.com/criticism/culture/review-mad-max-fury-road-is-the-best-action-movie-of-the-year-62178/",
      "rate": "83",
      "content": "\"Mad Max\" doesn't just depict conflicts with evildoers in a tattered existence. It delivers a rare alternative to aggressively stupid action movies. At a time of great need, Max rides again."
    },
    {
      "publisher": "The Playlist",
      "author": "Rodrigo Perez",
      "link": "https://www.indiewire.com/criticism/culture/review-george-millers-mad-max-fury-road-starring-charlize-theron-tom-hardy-264195/",
      "rate": "83",
      "content": "Come for the blistering, full-tilt action, stay for the thought-provoking consideration of the post-apocalypse."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2015/may/11/mad-max-fury-road-review-tom-hardy",
      "rate": "80",
      "content": "That adjective in the title is accurate. Extravagantly deranged, ear-splittingly cacophonous, and entirely over the top, George Miller has revived his Mad Max punk-western franchise as a bizarre convoy chase action-thriller in the post-apocalyptic desert."
    },
    {
      "publisher": "Screen Daily",
      "author": "Tim Grierson",
      "link": "https://www.screendaily.com/reviews/mad-max-fury-road-review/5087602.article?",
      "rate": "70",
      "content": "For a while, Fury Road’s complete disinterest in screenwriting fundamentals feels liberating, as the director keeps upping the ante on this desperate chase through the desert. But what feels liberating at first can become monotonous, and Fury Road starts to drag once the frenetic sameness of Miller’s strategy takes hold."
    }
  ],
  "errorMessage": ""
}