{
  "imDbId": "tt1392190",
  "title": "Mad Max: Fury Road",
  "fullTitle": "Mad Max: Fury Road (2015)",
  "type": "Movie",
  "year": "2015",
  "language": "en",
  "titleInLanguage": "Mad Max: Fury Road",
  "url": "https://en.wikipedia.org/wiki/Mad_Max:_Fury_Road",
  "plotShort": {
    "plainText": "Mad Max: Fury Road is a 2015 Australian post-apocalyptic action film co-written, co-produced, and directed by George Miller. Miller collaborated with Brendan McCarthy and Nico Lathouris on the screenplay. The fourth instalment in the Mad Max franchise, it was produced by Village Roadshow Pictures, Kennedy Miller Mitchell, and RatPac-Dune Entertainment and distributed by Roadshow Entertainment in Australia and by Warner Bros. Pictures internationally. The film stars Tom Hardy and Charlize Theron, with Nicholas Hoult, Hugh Keays-Byrne, Rosie Huntington-Whiteley, Riley Keough, Zoë Kravitz, Abbey Lee, and Courtney Eaton in supporting roles. Set in a post-apocalyptic desert wasteland where petrol and water are scarce commodities, Fury Road follows Max Rockatansky, who joins forces with Imperator Furiosa against cult leader Immortan Joe and his army, leading to a lengthy road battle.\r\nMiller came up with the idea for Fury Road in 1987, but the film spent many years in development hell before pre-production began in 1998. Attempts to shoot the film in the 2000s were delayed numerous times due to the September 11 attacks, the Iraq War, and controversies surrounding star Mel Gibson, leading Miller to recast Gibson's role of Max Rockatansky. Miller decided to pursue the film again in 2007, after the release of his animated comedy film Happy Feet. In 2009, Miller announced that filming would begin in early 2011. Hardy was cast as Max in June 2010, with production planned to begin that November. Principal photography was delayed several more times before it actually began in July 2012. The film wrapped in December 2012, although additional footage was shot in November 2013.\r\nFury Road premiered in Los Angeles on 7 May 2015, and was released in Australia on 14 May. It grossed $415.2 million at the worldwide box office, making it the highest-grossing Mad Max film, but is estimated to have incurred overall losses of $20–40 million when all of the advertising and other costs are added to its $154.6–185.1 million production budget. The film was praised by critics for its direction, writing, action sequences, musical score, technical aspects, and performances (particularly those of Hardy and Theron). It won Best Film from the National Board of Review, and was also named one of the top ten films of 2015 by the American Film Institute. The film was nominated for ten awards at the 88th Academy Awards, winning six, and received numerous other accolades. Retrospectively, the film has been called one of the greatest action films of all time and one of the best films of the 2010s.\r\nFollowing a pay dispute between Warner Bros. and Miller that delayed early efforts to produce follow-up projects, a prequel, Furiosa, is set for release on 24 May 2024, with Miller returning as writer and director.",
    "html": "<p>Mad Max: Fury Road is a 2015 Australian post-apocalyptic action film co-written, co-produced, and directed by George Miller. Miller collaborated with Brendan McCarthy and Nico Lathouris on the screenplay. The fourth instalment in the Mad Max franchise, it was produced by Village Roadshow Pictures, Kennedy Miller Mitchell, and RatPac-Dune Entertainment and distributed by Roadshow Entertainment in Australia and by Warner Bros. Pictures internationally. The film stars Tom Hardy and Charlize Theron, with Nicholas Hoult, Hugh Keays-Byrne, Rosie Huntington-Whiteley, Riley Keough, Zoë Kravitz, Abbey Lee, and Courtney Eaton in supporting roles. Set in a post-apocalyptic desert wasteland where petrol and water are scarce commodities, Fury Road follows Max Rockatansky, who joins forces with Imperator Furiosa against cult leader Immortan Joe and his army, leading to a lengthy road battle.</p><p>Miller came up with the idea for Fury Road in 1987, but the film spent many years in development hell before pre-production began in 1998. Attempts to shoot the film in the 2000s were delayed numerous times due to the September 11 attacks, the Iraq War, and controversies surrounding star Mel Gibson, leading Miller to recast Gibson's role of Max Rockatansky. Miller decided to pursue the film again in 2007, after the release of his animated comedy film Happy Feet. In 2009, Miller announced that filming would begin in early 2011. Hardy was cast as Max in June 2010, with production planned to begin that November. Principal photography was delayed several more times before it actually began in July 2012. The film wrapped in December 2012, although additional footage was shot in November 2013.</p><p>Fury Road premiered in Los Angeles on 7 May 2015, and was released in Australia on 14 May. It grossed $415.2 million at the worldwide box office, making it the highest-grossing Mad Max film, but is estimated to have incurred overall losses of $20–40 million when all of the advertising and other costs are added to its $154.6–185.1 million production budget. The film was praised by critics for its direction, writing, action sequences, musical score, technical aspects, and performances (particularly those of Hardy and Theron). It won Best Film from the National Board of Review, and was also named one of the top ten films of 2015 by the American Film Institute. The film was nominated for ten awards at the 88th Academy Awards, winning six, and received numerous other accolades. Retrospectively, the film has been called one of the greatest action films of all time and one of the best films of the 2010s.</p><p>Following a pay dispute between Warner Bros. and Miller that delayed early efforts to produce follow-up projects, a prequel, Furiosa, is set for release on 24 May 2024, with Miller returning as writer and director.</p>"
  },
  "plotFull": {
    "plainText": "Mad Max: Fury Road is a 2015 Australian post-apocalyptic action film co-written, co-produced, and directed by George Miller. Miller collaborated with Brendan McCarthy and Nico Lathouris on the screenplay. The fourth instalment in the Mad Max franchise, it was produced by Village Roadshow Pictures, Kennedy Miller Mitchell, and RatPac-Dune Entertainment and distributed by Roadshow Entertainment in Australia and by Warner Bros. Pictures internationally. The film stars Tom Hardy and Charlize Theron, with Nicholas Hoult, Hugh Keays-Byrne, Rosie Huntington-Whiteley, Riley Keough, Zoë Kravitz, Abbey Lee, and Courtney Eaton in supporting roles. Set in a post-apocalyptic desert wasteland where petrol and water are scarce commodities, Fury Road follows Max Rockatansky, who joins forces with Imperator Furiosa against cult leader Immortan Joe and his army, leading to a lengthy road battle.\r\nMiller came up with the idea for Fury Road in 1987, but the film spent many years in development hell before pre-production began in 1998. Attempts to shoot the film in the 2000s were delayed numerous times due to the September 11 attacks, the Iraq War, and controversies surrounding star Mel Gibson, leading Miller to recast Gibson's role of Max Rockatansky. Miller decided to pursue the film again in 2007, after the release of his animated comedy film Happy Feet. In 2009, Miller announced that filming would begin in early 2011. Hardy was cast as Max in June 2010, with production planned to begin that November. Principal photography was delayed several more times before it actually began in July 2012. The film wrapped in December 2012, although additional footage was shot in November 2013.\r\nFury Road premiered in Los Angeles on 7 May 2015, and was released in Australia on 14 May. It grossed $415.2 million at the worldwide box office, making it the highest-grossing Mad Max film, but is estimated to have incurred overall losses of $20–40 million when all of the advertising and other costs are added to its $154.6–185.1 million production budget. The film was praised by critics for its direction, writing, action sequences, musical score, technical aspects, and performances (particularly those of Hardy and Theron). It won Best Film from the National Board of Review, and was also named one of the top ten films of 2015 by the American Film Institute. The film was nominated for ten awards at the 88th Academy Awards, winning six, and received numerous other accolades. Retrospectively, the film has been called one of the greatest action films of all time and one of the best films of the 2010s.\r\nFollowing a pay dispute between Warner Bros. and Miller that delayed early efforts to produce follow-up projects, a prequel, Furiosa, is set for release on 24 May 2024, with Miller returning as writer and director.\r\nPlot\r\nWith the world a desert wasteland following societal collapse and warfare over resources, a survivor named Max Rockatansky, who is haunted by memories of all the people he has failed to protect, is captured and taken to warlord Immortan Joe's Citadel, where he is imprisoned and used as a \"blood bag\" for Nux, a sick War Boy. Meanwhile, Imperator Furiosa, one of Joe's lieutenants, is sent in the armoured \"War Rig\" to trade produce for petrol and ammunition with two of Joe's allies. When Joe realises his five wives are fleeing in the Rig, he leads his army in pursuit of Furiosa, calling on the aid of Gas Town and the Bullet Farm. Nux joins the pursuit with Max strapped to his car, and a battle ensues. Furiosa drives into a sand storm and loses all of her pursuers, except Nux, who attempts to sacrifice himself to blow up the Rig. Max frees himself and restrains Nux, and Furiosa destroys their car.\r\nAfter the storm, Max finds Furiosa repairing the Rig, accompanied by Joe's wives: Toast, Capable, the Dag, Cheedo, and Angharad, the last of whom is heavily pregnant with Joe's child. Max tries to steal the Rig, but he does not know the code to bypass the kill switches, so he begrudgingly joins up with Furiosa and the wives. Nux boards the Rig as it leaves and attempts to kill Furiosa. He is overcome and thrown out, and Joe's army picks him up when they pass by. Furiosa drives through a canyon controlled by a biker gang, having arranged to trade fuel for her safe passage, but the gang turns on her when they spot an army approaching, forcing her to flee. The bikers detonate the canyon walls to block Joe and then pursue the Rig, only stopping when the fuel pod explodes. Joe drives over the blockade in a monster truck and catches up with the Rig, allowing Nux to board and attack Furiosa again, but he trips before reaching the cab. While helping Max, Angharad falls off the Rig and is fatally run over by Joe, who temporarily halts his pursuit.\r\nCapable finds Nux hiding in the Rig and consoles him as he laments his failure. After dark, Furiosa and Max slow Joe's forces with mines set in swampland, but Joe's ally, the Bullet Farmer, continues to pursue. The Rig gets stuck, and Nux emerges from hiding to help free it, joining the crew. Furiosa blinds the approaching Bullet Farmer, and Max confronts him and returns with guns and ammunition. In the morning, Furiosa explains to Max that the \"Green Place\" to which they are escaping is an idyllic land she remembers from her childhood. She recognises a familiar landmark and shouts out her history and clan affiliation to a woman on top. The woman summons her all-female clan, the Vuvalini, who recognise Furiosa as one of their own who was kidnapped as a child. Furiosa is devastated to learn that the swampland from the previous night was the Green Place, which is now uninhabitable, and there are only seven Vuvalini left. The group, less Max, begins to ride across an immense salt flat, hoping to find a new home.\r\nAfter seeing a vision of a child he failed to save, Max catches up and convinces the others to return the way they came and take the undefended Citadel, which has ample water and crops. They meet Joe's forces and engage in battle. Five Vuvalini and many members of Joe's forces are killed, and Toast is captured. As they approach the canyon, Joe gets in front of the Rig to slow it. While Max fights Joe's large adult son, Rictus Erectus, Furiosa, though seriously wounded, goes to save Toast and kills Joe. The surviving brides and Vuvalini cross over to Joe's vehicle, and Nux sacrifices himself by wrecking the Rig to block the canyon, killing Rictus. Max transfuses his blood to Furiosa, saving her life. Back at the Citadel, the people rejoice upon learning of Joe's death and tear his corpse to pieces. As Max's companions are lifted in triumph to Joe's cliffside fortress, Max exchanges a glance with Furiosa and disappears into the crowd.\r\nCast\r\nTom Hardy as \"Mad\" Max Rockatansky\r\nCharlize Theron as Imperator Furiosa\r\nNicholas Hoult as Nux\r\nHugh Keays-Byrne as Immortan Joe\r\nJosh Helman as Slit, Nux's lancer\r\nNathan Jones as Rictus Erectus, Joe's large, muscular son\r\nRosie Huntington-Whiteley as The Splendid Angharad, Joe's most \"treasured\" breeder, pregnant with his child.\r\nZoë Kravitz as Toast the Knowing, another of Joe's wives.\r\nRiley Keough as Capable, another of Joe's wives, who forms a bond with the War Boy Nux.\r\nAbbey Lee as The Dag, another of Joe's wives, who forms a bond with the Keeper of Seeds.\r\nCourtney Eaton as Cheedo the Fragile, another of Joe's wives.\r\nJohn Howard as The People Eater, who rules Gas Town\r\nRichard Carter as The Bullet Farmer, who rules the Bullet Farm\r\niOTA as The Doof Warrior (Coma), the guitarist who travels with Joe's war convoy\r\nAngus Sampson as The Organic Mechanic, a doctor who works for Joe\r\nJennifer Hagan as Miss Giddy, the caretaker of Joe's wives\r\nMegan Gale as The Valkyrie, the youngest of the Vuvalini\r\nMelissa Jaffer as Keeper of the Seeds, one of the Vuvalini\r\nMelita Jurisic, Gillian Jones, Joy Smithers, Antoinette Kellerman, and Christina Koch as The Vuvalini\r\nJon Iles as The Ace, head of security on the War Rig\r\nQuentin Kenihan as Corpus Colossus, Joe's son, who has a physical disability (likely osteogenesis imperfecta, which Kenihan had) that stunted his growth and prevents him from being able to walk\r\nCoco Jack Gillies as Glory the Child, the young girl in Max's flashbacks\r\nChris Patton as Morsov\r\nStephen Dunlevy as The Rock Rider Chief and The Winchman\r\nRichard Norton as The Prime Imperator\r\nProduction\r\nDevelopment\r\nMad Max: Fury Road had a lengthy gestation period. In 1987, George Miller had the idea of making a Mad Max movie that was \"almost a continuous chase\". He got an idea for the plot in 1998 when he was walking across a street in Los Angeles, and about a year later, while travelling from Los Angeles to Australia, a story in which \"violent marauders were fighting, not for oil or for material goods, but for human beings\" coalesced. Miller said he worked with five storyboard artists to design the film in storyboard form before writing the screenplay, producing about 3,500 panels, which is almost the same as the number of shots as in the finished film, as he wanted the film to be almost a continuous chase, with relatively little dialogue, and to have the visuals come first. The screenplay was written with Nico Lathouris and cult British comic creator Brendan McCarthy, who also designed many of the new characters and vehicles.\r\nThe film entered pre-production at 20th Century Fox in the early 2000s and was set to star Mel Gibson, who had portrayed Max Rockatansky in the first three films in the series, but production was postponed after either the September 11 attacks in 2001 caused \"the American dollar against the Australian dollar, and our budget ballooned\", as Miller has said in several interviews since the film was released in 2015, or due to security concerns and tightened travel and shipping restrictions during the lead up to the Iraq War caused issues with the proposed Namibian shoot, as had been reported previously. In either event, Miller said he then \"had to commit to Happy Feet because we had the digital facility booked to do it\", and by the time he got back to work on the Mad Max project four years later, Gibson \"had all that turbulence in his life.\" Both Miller and Gibson himself said the passage of time had made Gibson's age a factor, since the film \"wasn't about an old road warrior.\"\r\nIn 2006, Miller said he was thinking about making Fury Road without Gibson. He confirmed his intention to make another Mad Max film in 2007 and stated that he thought Gibson was focused on his own films and was also \"too old\" to play the part. On 5 March 2009, it was announced that an R-rated animated feature film inspired by Japanese anime, but adapted for Western audiences, was in pre-production that would be taking much of the plot from Fury Road and would not feature Gibson's voice. Miller was also developing an action-adventure tie-in video game based on the fourth film with God of War II designer Cory Barlog. Both projects were expected to take two to two-and-a-half years and, according to Miller, would be released in 2011 or 2012. The animated Fury Road was going to be produced by Dr D Studios, a digital art studios founded in 2008 by Miller and Doug Mitchell.\r\nOn 18 May 2009, it was reported that location scouting was underway for Fury Road, which \"could go into production later this year\". Miller had decided to shoot a live-action film after all, and \"already had the various vehicles built for years now - as they were built for the doomed Fury Road shoot\". By this time, the project had moved from Fox to Warner Bros. In October, Miller announced that principal photography on Fury Road would commence at Broken Hill, New South Wales in August 2010. That same month, British actor Tom Hardy was in negotiations to take the lead role of Max, and it was also announced that Charlize Theron would play a major role. The finalists for the part of Max were Hardy, Armie Hammer, and Jeremy Renner, with Michael Fassbender, Joel Kinnaman, Heath Ledger, Eric Bana, and even Eminem (who did not wish to leave the United States) all having been considered at various stages of the film's extended development. Hardy announced he had been cast on Friday Night with Jonathan Ross in June 2010.\r\nIn July 2010, Miller announced plans to shoot two Mad Max films back-to-back, entitled Mad Max: Fury Road and Mad Max: Furiosa. Weta Digital was involved with the film when it was scheduled for a 2012 release. The company was to handle visual effects, conceptual designs, speciality make-up effects, and costume designs until production was postponed from its November 2010 start date. After unexpected heavy rains caused wildflowers to grow in the desert around Broken Hill, filming was moved from Broken Hill back to Namibia in November 2011. Other potential locations scouted included the Atacama Desert in Chile, Chott el Djerid in Tunisia, and Azerbaijan.\r\nMiller said he did not feel he had to top the production design of the previous films in the series. Instead, he wanted the design to harken back to the earlier films and reflect the changes of the past 30 years. Colin Gibson, the production designer, said the filmmakers developed an internally consistent history to explain the film's look and justify its use of hot rods. He designed the vehicles in the film, some of which were constructed as early as 2003, and all of which were fully functional. Of the 150 vehicles constructed, only 88 survived to the end of filming, with the others built to facilitate their intended method of destruction. The War Rig, the film's most prominent vehicle, was made by combining a Tatra 815 and Chevrolet Fleetmaster and fusing a Volkswagen Beetle to the hull, among other modifications. The cars were designed with an emphasis on detail and characterisation, and effort was made to show the various characters' attempts to recycle the remains of civilisation and their feelings of guilt and loss.\r\nFilming\r\nCinematographer John Seale came out of retirement to lens Fury Road, replacing Dean Semler, the cinematographer of the previous two Mad Max films, who left the film near the end of its preparation period. It was the first project Seale filmed with digital cameras. He outfitted his crew with six Arri Alexa Pluses and four Alexa Ms, as well as a number of Canon EOS 5Ds and Olympus PEN E-P5s that were used as crash cams for the action sequences; as the Canon cameras were simple consumer-grade ones, when one would break, the crew would simply source new ones locally from an airport store. Because of the fast-paced editing style Miller intended for the film, he asked Seale to keep the point of interest of each shot in the centre of the frame so the audience did not have to search for it.\r\nPrincipal photography began in July 2012 in Namibia, with most of the filming based in the Dorob National Park. Some scenes were also shot at the Cape Town Film Studios in Cape Town, South Africa. In October 2012, The Hollywood Reporter reported that Warner Bros. sent an executive to Namibia to keep the production on track. Filming wrapped on 8 December 2012, although the opening and closing scenes at the Citadel had still not been shot.\r\nA draft from the Namibian Coast Conservation and Management Project that accused the producers of damaging parts of the Namib desert, endangering a number of plant and animal species, was leaked in February 2013. The Namibia Film Commission said it had \"no reservations\" after visiting the set during production and disputed claims reported in the media, calling the accusations \"unjust rhetoric\".\r\nIn September 2013, it was announced that the film would undergo reshoots of the opening and closing scenes at the Citadel. The reshoots continued on 22 November 2013 at Potts Hill and Penrith Lakes in Western Sydney, and concluded in December 2013 at Fox Studios Australia.\r\nMiller invited playwright Eve Ensler to act as an on-set adviser. Impressed with the script's depth and what she saw as feminist themes, she spent a week in Namibia, where she spoke to the actors about issues of violence against women.\r\nAccording to Miller, 90% of the effects in the film were achieved practically. Both the Doof Wagon and the Doof Warrior's guitar are fully functional, and none of his scenes was rendered using CGI—even when the guitar shoots fire. Second unit director and supervising stunt coordinator Guy Norris was in charge of over 150 stunt performers, some of whom were from Cirque du Soleil.\r\nHardy later said he had a hard time seeing Miller's vision during production, which frustrated him. He understood after seeing the finished film, however, and started his Cannes press briefing with a lengthy apology to Miller, calling the director \"brilliant\".\r\nPost-production\r\nMiller recruited his wife, Margaret Sixel, to edit the film, as he felt she could make it stand out from other action films. Sixel had 480 hours of footage to edit, which took three months to watch. The film contains about 2,700 cuts in 120 minutes, or 22.5 cuts per minute, compared to Mad Max 2's 1,200 cuts in 90 minutes, or 13.33 cuts per minute.\r\nAccording to Seale, \"something like 50 or 60 percent of the film is not running at 24 frames a second, which is the traditional frame rate. It'll be running below 24 frames because George, if he couldn't understand what was happening in the shot, he slowed it down until you could ... Or if it was too well understood, he'd shorten it or he'd speed it up back towards 24. His manipulation of every shot in that movie is intense.\" The Washington Post noted that the changing frame rate gives the film an \"almost cartoonishly jerky\" look.\r\nThe film contains 2,000 visual effects shots. The lead effects company was Iloura, which produced more than 1,500 effects shots for the film. Additional visual effects studios that worked on the film include Method Studios, Brave New World vfx, Stereo D, 4DMax, BlackGinger, The Third Floor, and Dr D Studios. The effects work included altering lighting and time of day, weather effects, terrain replacement, and plate composition.\r\nSound designer Mark Mangini stated that he viewed the War Rig as an allegory for Moby-Dick, with Immortan Joe playing the role of Captain Ahab. As such, the mechanical truck sounds of the Rig were layered with whale calls to provide a more animal-like quality, and when the tank is pierced with harpoons and milk sprays out, sounds of whales breathing from their blow-holes were incorporated. For the final destruction of the War Rig, the only sounds used were slowed down bear growls to symbolise the death of the truck as a living creature.\r\nAlthough Miller was contractually obligated to deliver a PG-13 film, Warner Bros. decided to hold test screenings for two different versions: a studio cut and a Miller cut. The Miller cut tested better than the studio cut, so Warner Bros. decided to release the film with an R-rating.\r\nMiller had originally planned to shoot the film in native 3D, but this idea was eventually scrapped, due to both budgetary concerns and doubts that the 3D cameras could withstand the tough desert filming conditions and extensive stunt work, and it was converted to 3D in post-production instead.\r\nMusic\r\nThe musical score for Mad Max: Fury Road was written by the Dutch composer Tom Holkenborg, aka Junkie XL. Prior to his involvement, Hans Zimmer, John Powell, and Marco Beltrami were attached at separate times to score the film. A soundtrack album was released by WaterTower Music on 12 May 2015.\r\nThemes\r\nSurvival and humanity\r\nMiller described the film's key theme as survival, which he said it has in common with the American Westerns that were \"such a staple for the better part of a century in American cinema\", while several critics wrote that the primary theme of Mad Max: Fury Road is the attempt to retain humanity in the face of apocalyptic events. Max begins the film as a survivor haunted by visions of deceased people, and recovers his humanity by partnering with Furiosa.\r\nFeminism\r\nFeminism is another theme that has received academic attention. Charlize Theron as Furiosa is the dramatic centre of the film. Throughout, her character demonstrates the physicality of a hero committed to a rescue mission that \"sets up the start of a matriarchy as an antidote to the barbarian, warlike tribes that came before\". These elements contrast this film with the male-centred stories of the previous Mad Max films.\r\nOther themes\r\nMiller described the film as \"a very simple allegory, almost a western on wheels\". Further themes pointed out by critics include vengeance, solidarity, home, and redemption. Home dominates the motivations of Max, Furiosa, and the Five Wives: his home was destroyed, she was taken from her home, and the wives are in search of a new home in which to raise their children. The unity of these characters also harnesses a concern for family, which is a common theme within Miller's films (see Happy Feet, Happy Feet 2, and Babe: Pig in the City). Themes of ecological collapse and moral decadence are also present in the film.\r\nRelease\r\nComic books\r\nIn May 2015, Vertigo began publishing a comic book prequel limited series consisting of four issues, with each issue focusing on the backstory of one or two of the film's characters. The first issue, titled Mad Max: Fury Road – Nux and Immortan Joe #1, was released on 20 May; the second, Mad Max: Fury Road – Furiosa #1, was released on 17 June; the third, Mad Max: Fury Road – Mad Max #1, was released on 8 July; and the fourth, Mad Max: Fury Road – Mad Max #2, was released on 5 August. A deluxe-edition hardcover collection of art inspired by the film, titled Mad Max: Fury Road – Inspired Artists Deluxe Edition, was released by Vertigo on 6 May.\r\nTheatrical\r\nThe film had its world premiere at the TCL Chinese Theatre in Los Angeles on 7 May 2015. It screened out-of-competition at the 68th Cannes Film Festival on 14 May, and it was theatrically released in the United States the next day.\r\nHome media\r\nMiller said the Blu-ray Disc release of the film would include black-and-white and silent versions of the film, with the latter accompanied by the musical score, and described the black-and-white cut as the best version. However, when details for the initial UK and US releases of the Blu-ray were announced, the alternate cuts were missing. The film was released on both 3D and standard Blu-ray as well as DVD in the UK on 5 October 2015. In the US, it was released digitally on 11 August 2015, and physically on 1 September. In addition to the stand-alone release, a box set containing all four Mad Max films and a documentary about the series titled The Madness of Max was released the same day.\r\nProducer Doug Mitchell confirmed in December 2015 that the black-and-white version of the film existed and could potentially see a future theatrical release. In January 2016, Miller announced that the black-and-white version would appear on a later DVD release, and it debuted as part of the Mad Max: High Octane anthology released in October 2016, with the black-and-white version of Fury Road called the Black & Chrome Edition. The Black & Chrome Edition was made without the involvement of cinematographer John Seale, but Seale said the idea was \"beautifully dramatic\" and he thought \"the new version will emphasise\" the actors' performances.\r\nHome media editions of Mad Max: Fury Road were among the top-selling video titles in the US in 2015 and 2016. As of 2020, over three million copies have been sold, for a total revenue of $55.8 million.\r\nReception\r\nBox office\r\nMad Max: Fury Road grossed $154.1 million in the United States and Canada, and $261.1 million in other countries, for a worldwide total of $415.2 million against a production budget of $154.6–185.1 million. While the film made a profit, it did not quite meet its expectations. The Hollywood Reporter calculated that the loss incurred by the film was around $20–40 million.\r\nIn the United States and Canada, the film was released in 3,702 theatres the same weekend as Pitch Perfect 2. It earned $16.77 million its opening day, which included $3.7 million from Thursday night screenings at 3,000 theatres. The film grossed $45.4 million its opening weekend, finishing in second at the box office behind Pitch Perfect 2 ($69.2 million).\r\nCritical response\r\nSeveral critics have called Mad Max: Fury Road one of the greatest action films ever made. On the review aggregator website Rotten Tomatoes, 97% of 437 critics' reviews are positive, with an average rating of 8.60/10. The website's \"critics consensus\" reads: \"With exhilarating action and a surprising amount of narrative heft, Mad Max: Fury Road brings George Miller's post-apocalyptic franchise roaring vigorously back to life.\" Metacritic, which uses a weighted average, assigned the film a score of 90 out of 100, based on 51 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale.\r\nRobbie Collin of The Daily Telegraph gave the film a full five stars and praised its acting, screenplay, choreography, stunts, humour, and direction, describing it as a \"Krakatoan eruption of craziness\". Peter Bradshaw of The Guardian awarded it four out of five stars and wrote that it is \"extravagantly deranged, ear-splittingly cacophonous, and entirely over the top\", a \"bizarre convoy chase action-thriller in the post-apocalyptic desert\". Lindsay Bahr of the Associated Press described the film as \"radically visionary\".\r\nIGN reviewer Scott Collura gave the film 9.2 out of 10, writing: \"the over-the-top stunts and eccentric characters and designs are all hugely important to Fury Road, as are the troubled figures like Max himself and Furiosa, but it's the overriding sense of the film's uniqueness, its striving to be something more than just another action movie, that is most impressive.\" Richard Roeper of the Chicago Sun-Times gave the film four out of four stars and wrote that Theron and Hardy are \"one of the best action duos ever, in one of the best action movies\". Similarly, Rolling Stone's Peter Travers called the film \"a new action classic\", and gave particular praise to its editing, costumes, and soundtrack. Mick LaSalle of the San Francisco Chronicle wrote a mixed review, praising the cinematography and Theron's performance, but describing the film as a \"long, dull chase\".\r\nThe film has been praised by scholars on several fronts. Women's studies scholars have praised the dominant role taken by Furiosa and the range of atypical female roles, including the wives and the gun-toting Vuvalini, and disability studies scholars have commended its positive, non-stigmatising portrayals of physical and psychological disabilities.\r\nAccolades\r\nAt the 88th Academy Awards, Mad Max: Fury Road received nominations for Best Picture, Best Director, Best Cinematography, and Best Visual Effects; and won Best Film Editing, Best Production Design, Best Costume Design, Best Makeup and Hairstyling, Best Sound Mixing and Best Sound Editing. Its six awards were more than any other film at that year's ceremony and set a new record for the most wins by an Australian film. The film's other nominations include seven British Academy Film Awards (winning four), thirteen Critics' Choice Movie Awards (winning nine), and two Golden Globe Awards. It won Best Film at the National Board of Review Awards 2015, and was named one of the ten best films of 2015 by the American Film Institute.\r\nListed on over 170 film critics' top-ten lists for 2015, including 58 first-place rankings and 26 second-place rankings, the film topped Metacritic's tally of film critics year-end best film lists, and it was also named Rotten Tomatoes' best scoring film of 2015. It was voted the nineteenth-greatest film of the 21st century in a 2016 BBC critics' poll, was named the \"nineteenth-best film of the 21st century so far\" by The New York Times in 2017, and was voted the best film of the 21st century by Empire in January 2020.\r\nThe film appeared on numerous \"best films of the decade\" lists. It was ranked first on The A.V. Club critics' \"The 100 Best Movies of the 2010s\", third on Variety's \"The Best Films of the Decade\", and ninth on The Hollywood Reporter's \"The 10 Best Films of the Decade\". It also appeared (unranked) on The New York Times' \"The 10 Most Influential Films of the Decade (and 20 Other Favorites)\", Wired's \"The 24 Absolute Best Movies of the 2010s\", and the Los Angeles Times' \"The Best Movies of the Decade: Kenneth Turan and Justin Chang's Essential Picks\". In Metacritic's tally of lists of the best films of the decade, Fury Road appeared on and topped more lists than any other film, with 20 critics placing it at number one.\r\nFuture\r\nPossible sequel\r\nDuring the writing process for Fury Road in 2011, Miller and McCarthy found that they had enough story material for two additional scripts. In March 2015, during an interview with Esquire, Hardy revealed that he was attached to star in three more Mad Max films following Fury Road. Miller told Wired in May 2015 that if the film became successful, he would tell the other two stories, and later that month he revealed that the fifth film in the franchise would be titled Mad Max: The Wasteland.\r\nBy October 2015, Miller's team had scripts for two sequels. Later that month, he clarified that Mad Max: The Wasteland was a working title for the sequel. Miller reaffirmed his intent to continue the franchise after reports to the contrary surfaced in early 2016.\r\nIn November 2017, it was reported that a lawsuit filed by Miller's production company against Warner Bros. over a disputed $7 million bonus was likely to delay the production of any sequels. In July 2019, Miller told IndieWire that three films are being considered: two Mad Max stories and a Furiosa story.\r\nPrequel\r\nIn October 2020, a prequel to Fury Road, titled Furiosa, entered \"advanced development\" at Warner Bros., with Miller set to direct. Anya Taylor-Joy was cast to portray a young Furiosa, while Chris Hemsworth and Tom Burke will star in unspecified roles. Miller co-wrote the screenplay with Nico Lathouris, and Miller and Doug Mitchell will produce through their Kennedy Miller Mitchell banner. In December 2020, Warner Bros. announced that the film would be released on 23 June 2023, but the release was later pushed back to 24 May 2024. In a February 2021 interview, composer Junkie XL confirmed that he would return to write the score for Furiosa.",
    "html": "<p>Mad Max: Fury Road is a 2015 Australian post-apocalyptic action film co-written, co-produced, and directed by George Miller. Miller collaborated with Brendan McCarthy and Nico Lathouris on the screenplay. The fourth instalment in the Mad Max franchise, it was produced by Village Roadshow Pictures, Kennedy Miller Mitchell, and RatPac-Dune Entertainment and distributed by Roadshow Entertainment in Australia and by Warner Bros. Pictures internationally. The film stars Tom Hardy and Charlize Theron, with Nicholas Hoult, Hugh Keays-Byrne, Rosie Huntington-Whiteley, Riley Keough, Zoë Kravitz, Abbey Lee, and Courtney Eaton in supporting roles. Set in a post-apocalyptic desert wasteland where petrol and water are scarce commodities, Fury Road follows Max Rockatansky, who joins forces with Imperator Furiosa against cult leader Immortan Joe and his army, leading to a lengthy road battle.</p><p>Miller came up with the idea for Fury Road in 1987, but the film spent many years in development hell before pre-production began in 1998. Attempts to shoot the film in the 2000s were delayed numerous times due to the September 11 attacks, the Iraq War, and controversies surrounding star Mel Gibson, leading Miller to recast Gibson's role of Max Rockatansky. Miller decided to pursue the film again in 2007, after the release of his animated comedy film Happy Feet. In 2009, Miller announced that filming would begin in early 2011. Hardy was cast as Max in June 2010, with production planned to begin that November. Principal photography was delayed several more times before it actually began in July 2012. The film wrapped in December 2012, although additional footage was shot in November 2013.</p><p>Fury Road premiered in Los Angeles on 7 May 2015, and was released in Australia on 14 May. It grossed $415.2 million at the worldwide box office, making it the highest-grossing Mad Max film, but is estimated to have incurred overall losses of $20–40 million when all of the advertising and other costs are added to its $154.6–185.1 million production budget. The film was praised by critics for its direction, writing, action sequences, musical score, technical aspects, and performances (particularly those of Hardy and Theron). It won Best Film from the National Board of Review, and was also named one of the top ten films of 2015 by the American Film Institute. The film was nominated for ten awards at the 88th Academy Awards, winning six, and received numerous other accolades. Retrospectively, the film has been called one of the greatest action films of all time and one of the best films of the 2010s.</p><p>Following a pay dispute between Warner Bros. and Miller that delayed early efforts to produce follow-up projects, a prequel, Furiosa, is set for release on 24 May 2024, with Miller returning as writer and director.</p><br/><h3>Plot</h3><p>With the world a desert wasteland following societal collapse and warfare over resources, a survivor named Max Rockatansky, who is haunted by memories of all the people he has failed to protect, is captured and taken to warlord Immortan Joe's Citadel, where he is imprisoned and used as a \"blood bag\" for Nux, a sick War Boy. Meanwhile, Imperator Furiosa, one of Joe's lieutenants, is sent in the armoured \"War Rig\" to trade produce for petrol and ammunition with two of Joe's allies. When Joe realises his five wives are fleeing in the Rig, he leads his army in pursuit of Furiosa, calling on the aid of Gas Town and the Bullet Farm. Nux joins the pursuit with Max strapped to his car, and a battle ensues. Furiosa drives into a sand storm and loses all of her pursuers, except Nux, who attempts to sacrifice himself to blow up the Rig. Max frees himself and restrains Nux, and Furiosa destroys their car.</p><p>After the storm, Max finds Furiosa repairing the Rig, accompanied by Joe's wives: Toast, Capable, the Dag, Cheedo, and Angharad, the last of whom is heavily pregnant with Joe's child. Max tries to steal the Rig, but he does not know the code to bypass the kill switches, so he begrudgingly joins up with Furiosa and the wives. Nux boards the Rig as it leaves and attempts to kill Furiosa. He is overcome and thrown out, and Joe's army picks him up when they pass by. Furiosa drives through a canyon controlled by a biker gang, having arranged to trade fuel for her safe passage, but the gang turns on her when they spot an army approaching, forcing her to flee. The bikers detonate the canyon walls to block Joe and then pursue the Rig, only stopping when the fuel pod explodes. Joe drives over the blockade in a monster truck and catches up with the Rig, allowing Nux to board and attack Furiosa again, but he trips before reaching the cab. While helping Max, Angharad falls off the Rig and is fatally run over by Joe, who temporarily halts his pursuit.</p><p>Capable finds Nux hiding in the Rig and consoles him as he laments his failure. After dark, Furiosa and Max slow Joe's forces with mines set in swampland, but Joe's ally, the Bullet Farmer, continues to pursue. The Rig gets stuck, and Nux emerges from hiding to help free it, joining the crew. Furiosa blinds the approaching Bullet Farmer, and Max confronts him and returns with guns and ammunition. In the morning, Furiosa explains to Max that the \"Green Place\" to which they are escaping is an idyllic land she remembers from her childhood. She recognises a familiar landmark and shouts out her history and clan affiliation to a woman on top. The woman summons her all-female clan, the Vuvalini, who recognise Furiosa as one of their own who was kidnapped as a child. Furiosa is devastated to learn that the swampland from the previous night was the Green Place, which is now uninhabitable, and there are only seven Vuvalini left. The group, less Max, begins to ride across an immense salt flat, hoping to find a new home.</p><p>After seeing a vision of a child he failed to save, Max catches up and convinces the others to return the way they came and take the undefended Citadel, which has ample water and crops. They meet Joe's forces and engage in battle. Five Vuvalini and many members of Joe's forces are killed, and Toast is captured. As they approach the canyon, Joe gets in front of the Rig to slow it. While Max fights Joe's large adult son, Rictus Erectus, Furiosa, though seriously wounded, goes to save Toast and kills Joe. The surviving brides and Vuvalini cross over to Joe's vehicle, and Nux sacrifices himself by wrecking the Rig to block the canyon, killing Rictus. Max transfuses his blood to Furiosa, saving her life. Back at the Citadel, the people rejoice upon learning of Joe's death and tear his corpse to pieces. As Max's companions are lifted in triumph to Joe's cliffside fortress, Max exchanges a glance with Furiosa and disappears into the crowd.</p><br/><h3>Cast</h3><ul><li>Tom Hardy as \"Mad\" Max Rockatansky</li><li>Charlize Theron as Imperator Furiosa</li><li>Nicholas Hoult as Nux</li><li>Hugh Keays-Byrne as Immortan Joe</li><li>Josh Helman as Slit, Nux's lancer</li><li>Nathan Jones as Rictus Erectus, Joe's large, muscular son</li><li>Rosie Huntington-Whiteley as The Splendid Angharad, Joe's most \"treasured\" breeder, pregnant with his child.</li><li>Zoë Kravitz as Toast the Knowing, another of Joe's wives.</li><li>Riley Keough as Capable, another of Joe's wives, who forms a bond with the War Boy Nux.</li><li>Abbey Lee as The Dag, another of Joe's wives, who forms a bond with the Keeper of Seeds.</li><li>Courtney Eaton as Cheedo the Fragile, another of Joe's wives.</li><li>John Howard as The People Eater, who rules Gas Town</li><li>Richard Carter as The Bullet Farmer, who rules the Bullet Farm</li><li>iOTA as The Doof Warrior (Coma), the guitarist who travels with Joe's war convoy</li><li>Angus Sampson as The Organic Mechanic, a doctor who works for Joe</li><li>Jennifer Hagan as Miss Giddy, the caretaker of Joe's wives</li><li>Megan Gale as The Valkyrie, the youngest of the Vuvalini</li><li>Melissa Jaffer as Keeper of the Seeds, one of the Vuvalini</li><li>Melita Jurisic, Gillian Jones, Joy Smithers, Antoinette Kellerman, and Christina Koch as The Vuvalini</li><li>Jon Iles as The Ace, head of security on the War Rig</li><li>Quentin Kenihan as Corpus Colossus, Joe's son, who has a physical disability (likely osteogenesis imperfecta, which Kenihan had) that stunted his growth and prevents him from being able to walk</li><li>Coco Jack Gillies as Glory the Child, the young girl in Max's flashbacks</li><li>Chris Patton as Morsov</li><li>Stephen Dunlevy as The Rock Rider Chief and The Winchman</li><li>Richard Norton as The Prime Imperator</li></ul><br/><h3>Production</h3><h4>Development</h4><p>Mad Max: Fury Road had a lengthy gestation period. In 1987, George Miller had the idea of making a Mad Max movie that was \"almost a continuous chase\". He got an idea for the plot in 1998 when he was walking across a street in Los Angeles, and about a year later, while travelling from Los Angeles to Australia, a story in which \"violent marauders were fighting, not for oil or for material goods, but for human beings\" coalesced. Miller said he worked with five storyboard artists to design the film in storyboard form before writing the screenplay, producing about 3,500 panels, which is almost the same as the number of shots as in the finished film, as he wanted the film to be almost a continuous chase, with relatively little dialogue, and to have the visuals come first. The screenplay was written with Nico Lathouris and cult British comic creator Brendan McCarthy, who also designed many of the new characters and vehicles.</p><p>The film entered pre-production at 20th Century Fox in the early 2000s and was set to star Mel Gibson, who had portrayed Max Rockatansky in the first three films in the series, but production was postponed after either the September 11 attacks in 2001 caused \"the American dollar against the Australian dollar, and our budget ballooned\", as Miller has said in several interviews since the film was released in 2015, or due to security concerns and tightened travel and shipping restrictions during the lead up to the Iraq War caused issues with the proposed Namibian shoot, as had been reported previously. In either event, Miller said he then \"had to commit to Happy Feet because we had the digital facility booked to do it\", and by the time he got back to work on the Mad Max project four years later, Gibson \"had all that turbulence in his life.\" Both Miller and Gibson himself said the passage of time had made Gibson's age a factor, since the film \"wasn't about an old road warrior.\"</p><p>In 2006, Miller said he was thinking about making Fury Road without Gibson. He confirmed his intention to make another Mad Max film in 2007 and stated that he thought Gibson was focused on his own films and was also \"too old\" to play the part. On 5 March 2009, it was announced that an R-rated animated feature film inspired by Japanese anime, but adapted for Western audiences, was in pre-production that would be taking much of the plot from Fury Road and would not feature Gibson's voice. Miller was also developing an action-adventure tie-in video game based on the fourth film with God of War II designer Cory Barlog. Both projects were expected to take two to two-and-a-half years and, according to Miller, would be released in 2011 or 2012. The animated Fury Road was going to be produced by Dr D Studios, a digital art studios founded in 2008 by Miller and Doug Mitchell.</p><p>On 18 May 2009, it was reported that location scouting was underway for Fury Road, which \"could go into production later this year\". Miller had decided to shoot a live-action film after all, and \"already had the various vehicles built for years now - as they were built for the doomed Fury Road shoot\". By this time, the project had moved from Fox to Warner Bros. In October, Miller announced that principal photography on Fury Road would commence at Broken Hill, New South Wales in August 2010. That same month, British actor Tom Hardy was in negotiations to take the lead role of Max, and it was also announced that Charlize Theron would play a major role. The finalists for the part of Max were Hardy, Armie Hammer, and Jeremy Renner, with Michael Fassbender, Joel Kinnaman, Heath Ledger, Eric Bana, and even Eminem (who did not wish to leave the United States) all having been considered at various stages of the film's extended development. Hardy announced he had been cast on Friday Night with Jonathan Ross in June 2010.</p><p>In July 2010, Miller announced plans to shoot two Mad Max films back-to-back, entitled Mad Max: Fury Road and Mad Max: Furiosa. Weta Digital was involved with the film when it was scheduled for a 2012 release. The company was to handle visual effects, conceptual designs, speciality make-up effects, and costume designs until production was postponed from its November 2010 start date. After unexpected heavy rains caused wildflowers to grow in the desert around Broken Hill, filming was moved from Broken Hill back to Namibia in November 2011. Other potential locations scouted included the Atacama Desert in Chile, Chott el Djerid in Tunisia, and Azerbaijan.</p><p>Miller said he did not feel he had to top the production design of the previous films in the series. Instead, he wanted the design to harken back to the earlier films and reflect the changes of the past 30 years. Colin Gibson, the production designer, said the filmmakers developed an internally consistent history to explain the film's look and justify its use of hot rods. He designed the vehicles in the film, some of which were constructed as early as 2003, and all of which were fully functional. Of the 150 vehicles constructed, only 88 survived to the end of filming, with the others built to facilitate their intended method of destruction. The War Rig, the film's most prominent vehicle, was made by combining a Tatra 815 and Chevrolet Fleetmaster and fusing a Volkswagen Beetle to the hull, among other modifications. The cars were designed with an emphasis on detail and characterisation, and effort was made to show the various characters' attempts to recycle the remains of civilisation and their feelings of guilt and loss.</p><h4>Filming</h4><p>Cinematographer John Seale came out of retirement to lens Fury Road, replacing Dean Semler, the cinematographer of the previous two Mad Max films, who left the film near the end of its preparation period. It was the first project Seale filmed with digital cameras. He outfitted his crew with six Arri Alexa Pluses and four Alexa Ms, as well as a number of Canon EOS 5Ds and Olympus PEN E-P5s that were used as crash cams for the action sequences; as the Canon cameras were simple consumer-grade ones, when one would break, the crew would simply source new ones locally from an airport store. Because of the fast-paced editing style Miller intended for the film, he asked Seale to keep the point of interest of each shot in the centre of the frame so the audience did not have to search for it.</p><p>Principal photography began in July 2012 in Namibia, with most of the filming based in the Dorob National Park. Some scenes were also shot at the Cape Town Film Studios in Cape Town, South Africa. In October 2012, The Hollywood Reporter reported that Warner Bros. sent an executive to Namibia to keep the production on track. Filming wrapped on 8 December 2012, although the opening and closing scenes at the Citadel had still not been shot.</p><p>A draft from the Namibian Coast Conservation and Management Project that accused the producers of damaging parts of the Namib desert, endangering a number of plant and animal species, was leaked in February 2013. The Namibia Film Commission said it had \"no reservations\" after visiting the set during production and disputed claims reported in the media, calling the accusations \"unjust rhetoric\".</p><p>In September 2013, it was announced that the film would undergo reshoots of the opening and closing scenes at the Citadel. The reshoots continued on 22 November 2013 at Potts Hill and Penrith Lakes in Western Sydney, and concluded in December 2013 at Fox Studios Australia.</p><p>Miller invited playwright Eve Ensler to act as an on-set adviser. Impressed with the script's depth and what she saw as feminist themes, she spent a week in Namibia, where she spoke to the actors about issues of violence against women.</p><p>According to Miller, 90% of the effects in the film were achieved practically. Both the Doof Wagon and the Doof Warrior's guitar are fully functional, and none of his scenes was rendered using CGI—even when the guitar shoots fire. Second unit director and supervising stunt coordinator Guy Norris was in charge of over 150 stunt performers, some of whom were from Cirque du Soleil.</p><p>Hardy later said he had a hard time seeing Miller's vision during production, which frustrated him. He understood after seeing the finished film, however, and started his Cannes press briefing with a lengthy apology to Miller, calling the director \"brilliant\".</p><h4>Post-production</h4><p>Miller recruited his wife, Margaret Sixel, to edit the film, as he felt she could make it stand out from other action films. Sixel had 480 hours of footage to edit, which took three months to watch. The film contains about 2,700 cuts in 120 minutes, or 22.5 cuts per minute, compared to Mad Max 2's 1,200 cuts in 90 minutes, or 13.33 cuts per minute.</p><p>According to Seale, \"something like 50 or 60 percent of the film is not running at 24 frames a second, which is the traditional frame rate. It'll be running below 24 frames because George, if he couldn't understand what was happening in the shot, he slowed it down until you could ... Or if it was too well understood, he'd shorten it or he'd speed it up back towards 24. His manipulation of every shot in that movie is intense.\" The Washington Post noted that the changing frame rate gives the film an \"almost cartoonishly jerky\" look.</p><p>The film contains 2,000 visual effects shots. The lead effects company was Iloura, which produced more than 1,500 effects shots for the film. Additional visual effects studios that worked on the film include Method Studios, Brave New World vfx, Stereo D, 4DMax, BlackGinger, The Third Floor, and Dr D Studios. The effects work included altering lighting and time of day, weather effects, terrain replacement, and plate composition.</p><p>Sound designer Mark Mangini stated that he viewed the War Rig as an allegory for Moby-Dick, with Immortan Joe playing the role of Captain Ahab. As such, the mechanical truck sounds of the Rig were layered with whale calls to provide a more animal-like quality, and when the tank is pierced with harpoons and milk sprays out, sounds of whales breathing from their blow-holes were incorporated. For the final destruction of the War Rig, the only sounds used were slowed down bear growls to symbolise the death of the truck as a living creature.</p><p>Although Miller was contractually obligated to deliver a PG-13 film, Warner Bros. decided to hold test screenings for two different versions: a studio cut and a Miller cut. The Miller cut tested better than the studio cut, so Warner Bros. decided to release the film with an R-rating.</p><p>Miller had originally planned to shoot the film in native 3D, but this idea was eventually scrapped, due to both budgetary concerns and doubts that the 3D cameras could withstand the tough desert filming conditions and extensive stunt work, and it was converted to 3D in post-production instead.</p><br/><h3>Music</h3><p>The musical score for Mad Max: Fury Road was written by the Dutch composer Tom Holkenborg, aka Junkie XL. Prior to his involvement, Hans Zimmer, John Powell, and Marco Beltrami were attached at separate times to score the film. A soundtrack album was released by WaterTower Music on 12 May 2015.</p><br/><h3>Themes</h3><h4>Survival and humanity</h4><p>Miller described the film's key theme as survival, which he said it has in common with the American Westerns that were \"such a staple for the better part of a century in American cinema\", while several critics wrote that the primary theme of Mad Max: Fury Road is the attempt to retain humanity in the face of apocalyptic events. Max begins the film as a survivor haunted by visions of deceased people, and recovers his humanity by partnering with Furiosa.</p><h4>Feminism</h4><p>Feminism is another theme that has received academic attention. Charlize Theron as Furiosa is the dramatic centre of the film. Throughout, her character demonstrates the physicality of a hero committed to a rescue mission that \"sets up the start of a matriarchy as an antidote to the barbarian, warlike tribes that came before\". These elements contrast this film with the male-centred stories of the previous Mad Max films.</p><h4>Other themes</h4><p>Miller described the film as \"a very simple allegory, almost a western on wheels\". Further themes pointed out by critics include vengeance, solidarity, home, and redemption. Home dominates the motivations of Max, Furiosa, and the Five Wives: his home was destroyed, she was taken from her home, and the wives are in search of a new home in which to raise their children. The unity of these characters also harnesses a concern for family, which is a common theme within Miller's films (see Happy Feet, Happy Feet 2, and Babe: Pig in the City). Themes of ecological collapse and moral decadence are also present in the film.</p><br/><h3>Release</h3><h4>Comic books</h4><p>In May 2015, Vertigo began publishing a comic book prequel limited series consisting of four issues, with each issue focusing on the backstory of one or two of the film's characters. The first issue, titled Mad Max: Fury Road – Nux and Immortan Joe #1, was released on 20 May; the second, Mad Max: Fury Road – Furiosa #1, was released on 17 June; the third, Mad Max: Fury Road – Mad Max #1, was released on 8 July; and the fourth, Mad Max: Fury Road – Mad Max #2, was released on 5 August. A deluxe-edition hardcover collection of art inspired by the film, titled Mad Max: Fury Road – Inspired Artists Deluxe Edition, was released by Vertigo on 6 May.</p><h4>Theatrical</h4><p>The film had its world premiere at the TCL Chinese Theatre in Los Angeles on 7 May 2015. It screened out-of-competition at the 68th Cannes Film Festival on 14 May, and it was theatrically released in the United States the next day.</p><h4>Home media</h4><p>Miller said the Blu-ray Disc release of the film would include black-and-white and silent versions of the film, with the latter accompanied by the musical score, and described the black-and-white cut as the best version. However, when details for the initial UK and US releases of the Blu-ray were announced, the alternate cuts were missing. The film was released on both 3D and standard Blu-ray as well as DVD in the UK on 5 October 2015. In the US, it was released digitally on 11 August 2015, and physically on 1 September. In addition to the stand-alone release, a box set containing all four Mad Max films and a documentary about the series titled The Madness of Max was released the same day.</p><p>Producer Doug Mitchell confirmed in December 2015 that the black-and-white version of the film existed and could potentially see a future theatrical release. In January 2016, Miller announced that the black-and-white version would appear on a later DVD release, and it debuted as part of the Mad Max: High Octane anthology released in October 2016, with the black-and-white version of Fury Road called the Black & Chrome Edition. The Black & Chrome Edition was made without the involvement of cinematographer John Seale, but Seale said the idea was \"beautifully dramatic\" and he thought \"the new version will emphasise\" the actors' performances.</p><p>Home media editions of Mad Max: Fury Road were among the top-selling video titles in the US in 2015 and 2016. As of 2020, over three million copies have been sold, for a total revenue of $55.8 million.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Mad Max: Fury Road grossed $154.1 million in the United States and Canada, and $261.1 million in other countries, for a worldwide total of $415.2 million against a production budget of $154.6–185.1 million. While the film made a profit, it did not quite meet its expectations. The Hollywood Reporter calculated that the loss incurred by the film was around $20–40 million.</p><p>In the United States and Canada, the film was released in 3,702 theatres the same weekend as Pitch Perfect 2. It earned $16.77 million its opening day, which included $3.7 million from Thursday night screenings at 3,000 theatres. The film grossed $45.4 million its opening weekend, finishing in second at the box office behind Pitch Perfect 2 ($69.2 million).</p><h4>Critical response</h4><p>Several critics have called Mad Max: Fury Road one of the greatest action films ever made. On the review aggregator website Rotten Tomatoes, 97% of 437 critics' reviews are positive, with an average rating of 8.60/10. The website's \"critics consensus\" reads: \"With exhilarating action and a surprising amount of narrative heft, Mad Max: Fury Road brings George Miller's post-apocalyptic franchise roaring vigorously back to life.\" Metacritic, which uses a weighted average, assigned the film a score of 90 out of 100, based on 51 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale.</p><p>Robbie Collin of The Daily Telegraph gave the film a full five stars and praised its acting, screenplay, choreography, stunts, humour, and direction, describing it as a \"Krakatoan eruption of craziness\". Peter Bradshaw of The Guardian awarded it four out of five stars and wrote that it is \"extravagantly deranged, ear-splittingly cacophonous, and entirely over the top\", a \"bizarre convoy chase action-thriller in the post-apocalyptic desert\". Lindsay Bahr of the Associated Press described the film as \"radically visionary\".</p><p>IGN reviewer Scott Collura gave the film 9.2 out of 10, writing: \"the over-the-top stunts and eccentric characters and designs are all hugely important to Fury Road, as are the troubled figures like Max himself and Furiosa, but it's the overriding sense of the film's uniqueness, its striving to be something more than just another action movie, that is most impressive.\" Richard Roeper of the Chicago Sun-Times gave the film four out of four stars and wrote that Theron and Hardy are \"one of the best action duos ever, in one of the best action movies\". Similarly, Rolling Stone's Peter Travers called the film \"a new action classic\", and gave particular praise to its editing, costumes, and soundtrack. Mick LaSalle of the San Francisco Chronicle wrote a mixed review, praising the cinematography and Theron's performance, but describing the film as a \"long, dull chase\".</p><p>The film has been praised by scholars on several fronts. Women's studies scholars have praised the dominant role taken by Furiosa and the range of atypical female roles, including the wives and the gun-toting Vuvalini, and disability studies scholars have commended its positive, non-stigmatising portrayals of physical and psychological disabilities.</p><h4>Accolades</h4><p>At the 88th Academy Awards, Mad Max: Fury Road received nominations for Best Picture, Best Director, Best Cinematography, and Best Visual Effects; and won Best Film Editing, Best Production Design, Best Costume Design, Best Makeup and Hairstyling, Best Sound Mixing and Best Sound Editing. Its six awards were more than any other film at that year's ceremony and set a new record for the most wins by an Australian film. The film's other nominations include seven British Academy Film Awards (winning four), thirteen Critics' Choice Movie Awards (winning nine), and two Golden Globe Awards. It won Best Film at the National Board of Review Awards 2015, and was named one of the ten best films of 2015 by the American Film Institute.</p><p>Listed on over 170 film critics' top-ten lists for 2015, including 58 first-place rankings and 26 second-place rankings, the film topped Metacritic's tally of film critics year-end best film lists, and it was also named Rotten Tomatoes' best scoring film of 2015. It was voted the nineteenth-greatest film of the 21st century in a 2016 BBC critics' poll, was named the \"nineteenth-best film of the 21st century so far\" by The New York Times in 2017, and was voted the best film of the 21st century by Empire in January 2020.</p><p>The film appeared on numerous \"best films of the decade\" lists. It was ranked first on The A.V. Club critics' \"The 100 Best Movies of the 2010s\", third on Variety's \"The Best Films of the Decade\", and ninth on The Hollywood Reporter's \"The 10 Best Films of the Decade\". It also appeared (unranked) on The New York Times' \"The 10 Most Influential Films of the Decade (and 20 Other Favorites)\", Wired's \"The 24 Absolute Best Movies of the 2010s\", and the Los Angeles Times' \"The Best Movies of the Decade: Kenneth Turan and Justin Chang's Essential Picks\". In Metacritic's tally of lists of the best films of the decade, Fury Road appeared on and topped more lists than any other film, with 20 critics placing it at number one.</p><br/><h3>Future</h3><h4>Possible sequel</h4><p>During the writing process for Fury Road in 2011, Miller and McCarthy found that they had enough story material for two additional scripts. In March 2015, during an interview with Esquire, Hardy revealed that he was attached to star in three more Mad Max films following Fury Road. Miller told Wired in May 2015 that if the film became successful, he would tell the other two stories, and later that month he revealed that the fifth film in the franchise would be titled Mad Max: The Wasteland.</p><p>By October 2015, Miller's team had scripts for two sequels. Later that month, he clarified that Mad Max: The Wasteland was a working title for the sequel. Miller reaffirmed his intent to continue the franchise after reports to the contrary surfaced in early 2016.</p><p>In November 2017, it was reported that a lawsuit filed by Miller's production company against Warner Bros. over a disputed $7 million bonus was likely to delay the production of any sequels. In July 2019, Miller told IndieWire that three films are being considered: two Mad Max stories and a Furiosa story.</p><h4>Prequel</h4><p>In October 2020, a prequel to Fury Road, titled Furiosa, entered \"advanced development\" at Warner Bros., with Miller set to direct. Anya Taylor-Joy was cast to portray a young Furiosa, while Chris Hemsworth and Tom Burke will star in unspecified roles. Miller co-wrote the screenplay with Nico Lathouris, and Miller and Doug Mitchell will produce through their Kennedy Miller Mitchell banner. In December 2020, Warner Bros. announced that the film would be released on 23 June 2023, but the release was later pushed back to 24 May 2024. In a February 2021 interview, composer Junkie XL confirmed that he would return to write the score for Furiosa.</p><br/>"
  },
  "errorMessage": ""
}