{
  "imDbId": "tt0353969",
  "title": "Memories of Murder",
  "fullTitle": "Memories of Murder (2003)",
  "type": "Movie",
  "year": "2003",
  "items": [
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw2028024",
      "warningSpoilers": true,
      "date": "23 February 2009",
      "rate": "",
      "helpful": "111 out of 123 found this helpful.",
      "title": "The Shaman's Eyes",
      "content": "Joon-ho Bong directs \"Memories of Murder\". A police procedural, the film's first act flows along conventional lines. Here a murder takes place and detective Park Doo-Man is assigned to the case. He's a hotshot cop, hardworking and determined, who thinks he can spot a criminal simply by \"looking into their eyes\". Joon-ho Bong, however, repeatedly questions Park's abilities. Early in the film, for example, Park's commander points at two men at the far side of a room and asks Park to pick out the criminal. Park looks deeply into each man's eyes, but before he gives his answer, the director cuts to black. We assume that Park has picked the right guy.But 20 minutes into the film, and our faith in Park begins to crumble. Indeed, he begins to come across as a bit of an idiot. He's deeply superstitious, relies on fortune tellers, believes in hunches, and is highly insecure.At this point the film introduces another detective. His name is Sae Yoon, and he's been assigned to help Park on his case. The film's second act is thus a repetition of the first act, Sae Yoon re-enacting all the scenes that we just witnessed Park do. The way Park handles the film's first crime scene is contrasted with how Sae Yoon handles the film's second crime scene. The way Park handles an interrogation is contrasted with how Sae Yoon handles an interrogation. In seeing how a methodical, clever and genuinely skilled detective like Sae Yoon handles his job, the audience is forced to reconsider their views of Park. Maybe Park wasn't a hotshot cop after all. The juxtaposition between the way the two men handle the film's first two murders forces us to re-evaluate our perceptions.This notion of reassessing what our eyes see, is constant throughout the film. A mentally ill kid seems like a likely suspect, but is actually not. A local pervert seems like the killer, but is actually a caring husband. An effeminate loner may be the rapist, but DNA samples prove otherwise. Detective Sae Yoon, himself a \"by the books\" cop, eventually becomes a violent, loose cannon, determined to throw away rules and regulations based on a hunch, whilst Park, the very cop who consults shamans and witch doctors and stages false confessions, becomes the film's voice of law-abiding righteousness.And so it is the way the film's characters are constantly in a state of moral flux that makes \"Memories of Murder\" so exciting. The audience is constantly asked to \"look the characters in the eyes\" and reassess what they're seeing.But what makes the film great is its ending. If surface perceptions are inadequate, then how can we truly understand another human being? If personal emotions get in the way of objective truth, how can we ever trust our own acuity? And so because the criminal is never identified or caught, suddenly everyone is guilty. There can be no closure because everyone, police included, is implicated. Watch how the director contrasts the film's first shot (the innocence of a child's face) with the film's final shot (the retired face of detective Frank staring down the camera and directly at the audience). Frank's catch phrase, \"look into my eyes\", now takes on a whole new level of meaning. He's a cop again, and everyone including we the audience are now under suspicion. And so while most serial killer films end with closure, or in the case of the recent \"Zodiac\", with the comfortable knowledge that our killer is now old and largely impotent, \"Memories of Murder\" leaves us on a note of profound paranoia. We're left uncomfortable, disturbed, and everyone now seems a potential suspect. 8.5/10 – Though it isn't brave enough to stray far from genre conventions, this is a stylish, engrossing film. Worth two viewings."
    },
    {
      "username": "WriterDave",
      "userUrl": "https://www.imdb.com/user/ur1069062",
      "reviewLink": "https://www.imdb.com/review/rw1127485",
      "warningSpoilers": false,
      "date": "15 July 2005",
      "rate": "9",
      "helpful": "281 out of 322 found this helpful.",
      "title": "The Slow Development of a Masterpiece",
      "content": "This is probably the best crime thriller I've seen since \"Insomnia,\" and contains the most haunting climax of any serial killer flick since \"Seven.\" But like most films reaching for greatness, this is most admirable for its striking details.The filmmakers here craft a taut, careful, and delicately strung together motion picture that relishes in its amazing development of mood, place, and character.First, the mood: Haunting cinematography (rain falling on a small village at night, shadows darting across a thick field of grass, figures lurking in the woods, a masterfully choreographed hot pursuit scene on foot), a poignant music score (aided by the creepy use of a Korean pop song that accompanies each murder), and no-nonsense direction (peppered with fabulous doses of comic relief--how Shakespearan!) keep the film more and more intriguing at each turn and fascinating to watch.Second, the place: South Korea, circa the late 1980's, and apparently under some sort of militia rule. This is inspired by the true story of Korea's first publicized (and still unsolved) serial killer case. This unique time and place serves as a wonderful respite from the typical American big-city setting of so many other films of this ilk.Finally, the character development: The small details revealing the haunted souls of the detectives on the case is nothing short of brilliant. Witness the tiny executions of minutae: The cloth one rogue cop wraps around his boot so as not to leave scars when he kick-boxes suspects into submission, the harried chief of police checking his own blood pressure while trying to keep his off-the-cuff detectives in line or fighting to keep headline-starved reporters at bay, the young female officer desperately trying to showcase her abilities in crime solving between serving the chauvinistic detectives cups of fresh coffee, the outsider detective from Seoul's insistence that documents never lie (and the brutal irony at the climax that challenges his entire sense of being), and the main village detective's scathing speech on the difference between American FBI agents and Koren policemen. The beauty is in the details, and this film, like all the great ones, revels in their uncovering.One flaw is that some might find the film a bit long in the tooth, but this is not to be missed for fans of serial killer thrillers and police procedural movies. For the Korean filmmakers, and the amazing cast...this is their master stroke."
    },
    {
      "username": "AKS-6",
      "userUrl": "https://www.imdb.com/user/ur0167865",
      "reviewLink": "https://www.imdb.com/review/rw0989429",
      "warningSpoilers": false,
      "date": "1 January 2005",
      "rate": "9",
      "helpful": "298 out of 349 found this helpful.",
      "title": "Great serial killer drama",
      "content": "I'm one of those people who tend to think that South Korean movies are perhaps a bit too slow-paced for my taste. Memories of Murder isn't a fast-paced film, by any means, but this time the slow pace made this movie about an investigation of serial killings so much better than 95% of its American counterparts.Essentially, Memories of Murder is a drama first with thriller and comedy elements (yes, in the first hour or so the movie is actually quite funny). Kang-ho Song and Sang-kyung Kim are brilliant as the two cops who have drastically different views on how to solve a crime. The character development is fascinating and believable thanks to a great script.Highly recommended."
    },
    {
      "username": "dbborroughs",
      "userUrl": "https://www.imdb.com/user/ur3079504",
      "reviewLink": "https://www.imdb.com/review/rw0975640",
      "warningSpoilers": false,
      "date": "10 December 2004",
      "rate": "8",
      "helpful": "143 out of 176 found this helpful.",
      "title": "Must See",
      "content": "After two women are found dead in a rural community, a detective arrives from the big city to help out. Things quickly mushroom with the discovery of more bodies, more suspects and no end in sight.Whether you like police films or not you should see this movie about the real hunt for Korea's first known serial killer simply because its a great movie. This is a movie that alters your expectations and changes your view of things. Its impossible to guess whats going to happen simply because the twists and turns are so unexpected. At times this is a funny funny movie, especially if you like shows like Law and Order or CSI since what we take for granted in those shows is stood on its head. At other times this is a very taut thriller and you become as desperate as the police in needing to put an end to the madness.On top of all of this is a picture of Korea in 1986, a place with political unrest and civil defense drills that for me at least makes it seem like something out of the 1950's.This is brilliant brilliant film-making.I've given the film an 8 out of 10, even though it probably deserves to be higher, simply because some 12 hours after seeing the film, I'm still pondering what I thought of it, how good is it? At least an 8. I'm sure a second and third and fourth viewings will change my mind.Yea its that good"
    },
    {
      "username": "jadavix",
      "userUrl": "https://www.imdb.com/user/ur55157303",
      "reviewLink": "https://www.imdb.com/review/rw4475961",
      "warningSpoilers": false,
      "date": "24 November 2018",
      "rate": "8",
      "helpful": "13 out of 14 found this helpful.",
      "title": "What's Korean for \"nuance\"?",
      "content": "The more South Korean films I see, the more I understand how it came to pass that filmmakers from that part of Asia are basically leading the world in terms of cinema in the 21st century.These films are always very well made, with interesting plots and characterisation. But above all, they have nuance in spades. Nothing on screen is as simple as it appears. None of the characters are typical heroes or typical villains. None of the responses to anything on-screen are simple, either.Scenes unfold in comedy and then tragedy, or the other way around - or both at once.The additional layers to every scene and every character add a panoramic realism to what unfolds. These characters live and breathe on the screen. After watching \"Memories of Murder\", \"The Wailing\", or \"The Host\", you imagine that the characters are still doing what they were doing when the credits played.That's the gift the South Koreans have given us with their wonderful and inventive cinema.Forget America, unless you are addicted to comic book movies or remakes.Korea is the one to watch."
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw6993747",
      "warningSpoilers": false,
      "date": "2 June 2021",
      "rate": "10",
      "helpful": "36 out of 44 found this helpful.",
      "title": "Do watch out for The flying kick, my favorite interrogation technique. Excellent n engaging crime drama.",
      "content": "I first saw this more than a decade ago n loved it.Revisited it recently.This one is truly one of the best crime drama.I feel Zodiac, True Detective S1 n the recent The Little Things borrowed few stuff from this movie.After the discovery of two dead bodies in a small village, a detective n his partner decides to question a mentally handicapped young man because the man used to follow one of the victims around town but their forced confessions n interrogation techniques are questioned when a detective from a city volunteers to assist them.Apart from being a very engaging movie, this one has sufficient suspense n tons of atmosphere.Another good aspect is the character development.This movie amazingly showcases the faulty police interrogation techniques, the lack of securing the crime scene, evidence being improperly collected, non availability of extra police personnel, the non-existent forensic technology n the superstitious beliefs.The isolated rural landscape where the killings take place is as much a character in the movie."
    },
    {
      "username": "ferguson-6",
      "userUrl": "https://www.imdb.com/user/ur0806494",
      "reviewLink": "https://www.imdb.com/review/rw6189995",
      "warningSpoilers": true,
      "date": "19 October 2020",
      "rate": "8",
      "helpful": "41 out of 53 found this helpful.",
      "title": "the crime is solved - decades later",
      "content": "Greetings again from the darkness. Between 1986 and 1991, 10 women were raped and brutally murdered in the province of Gyeong-gi outside Seoul. Considered South Korea's first serial killer case, the crime went unsolved until 2019. The case was the inspiration for writer-director Bong Joon Ho's second feature film, as was Kwang-rim Kim's play, \"Come to See Me\". Director Bong Joon Ho co-wrote the screenplay with Sung-bo Shim, and of course, went on to win an Oscar for PARASITE (2019), in addition to providing other popular features such as OKJA (2017), SNOWPIERCER (2013), and THE HOST (2006). This early film can be compared to David Fincher's ZODIAC (2007), although this one is a blend of murder mystery, crime thriller, black comedy, and political commentary.Kang-ho Song (PARASITE) stars as Park, a local detective called to the scene of the first victim. Almost immediately we can tell Park and the police force are borderline incompetent. Park is convinced he has \"Shaman eyes\" and can identify the guilty party simply by looking at them. Of course, this is ridiculous and is proven so on a few occasions. Park's partner, Detective Jo, is a hothead who takes a heavy-handed approach to interrogation (though he later experiences true karma). When a second victim is discovered, a more seasoned professional, Detective Seo, arrives from Seoul. In contrast to Park's gut-feeling approach, Seo puts faith in evidence, proclaiming, \"Documents never lie\". These two detectives are at the core of the story and we watch as each evolves.The film begins on October 23, 1986 as the body of the first victim is found. We witness how the crime scene is immediately corrupted by both cops and local kids. This is also our indoctrination to how the filmmaker is treating this much differently than most crime dramas. A stream of suspects Park refers to as \"punks\" are paraded through the station, but true chaos ensues at the scene of the second body. We can't help but be relieved when a professional, big city detective arrives. Bits of evidence are slowly assembled - red clothes, rainy nights, a song on the radio - each may play a role in the actions of the killer. Frustration builds as more murders occur and the detectives are unable to pin down the perpetrator.The mental and physical toll that detectives endure with such a case are on full display. The obsession with finding the murderer never ends and the fantastic ending proves that even a career change doesn't erase the failure. We are inundated with crime thrillers these days, but it's difficult to grasp how this masterpiece was put together by a director whose career was just getting started. Certainly today we recognize the brilliance of Bong Joon Ho, but this was 17 years ago! It plays as a time capsule of South Korea socially and politically in 1986, and it works on that level every bit as much as a crime thriller. Cinematographer Hyung Koo Kim (THE HOST) balances the crime scenes with the police station, as well as the telling facial expressions of the characters. Last year's solving of these horrific crimes pushed this classic into release, and it's well worth a watch."
    },
    {
      "username": "jack_o_hasanov_imdb",
      "userUrl": "https://www.imdb.com/user/ur55640799",
      "reviewLink": "https://www.imdb.com/review/rw7280030",
      "warningSpoilers": false,
      "date": "28 August 2021",
      "rate": "8",
      "helpful": "10 out of 11 found this helpful.",
      "title": "The Last scene . . .",
      "content": "It was a great movie, I like it very much. I understand why it was so recommended by others.The last scene was perfect. . ."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw3870274",
      "warningSpoilers": true,
      "date": "29 November 2017",
      "rate": "8",
      "helpful": "11 out of 13 found this helpful.",
      "title": "\"This time be realistic, like in a movie.\"",
      "content": "Starting out I didn't know how to take this movie. The senior police detective is out planting evidence, his belligerent sidekick routinely beats and tortures suspects, and people brought in for questioning admit to crimes they're completely innocent of. It's all very disorienting and doesn't make a lot of sense until about the second half of the movie when the detectives hunker down and involve themselves in routine but exhausting police work.Regarding planted evidence, feeble minded suspect Kwang-ho (No-shik Park) might have been able to out Detective Park (Kang-ho Song) for his dishonest methods if he'd been able to differentiate the underside of his left foot sneaker with the picture the detective showed him of a right shoe footprint. If you go back and check that scene, you'll see that the physical shoe couldn't have made the print in the 'evidence'. The correct sneaker would have made a reverse image print in the dirt.It's kind of ironic actually that the big break in the case occurs because a lowly female desk officer makes a connection between a sad song played on a radio station and rainy nights when a serial killer's murders occur. This while Detective Park is crystallizing his theory about crazy hairless men (trust me, you have to catch that!).When everything finally comes together and the detective on loan Seo Tae-yoon (Sang-kyung Kim) closes in on the suspected serial killer, the rug is pulled out from under him and the viewer with the information from America that the DNA sample sent in is not conclusive. It points to another irony in as much as Seo's insistence on the infallibility of 'written documents' is torn to shreds. At that point, one feels helpless over Park Hyeon-gyu's (Hae-il Park) get away, since most of the circumstantial evidence pointed to him as the killer.I didn't know this film was about a real life serial killer case that went unsolved in South Korea in the Nineties. In fact, I didn't even know about the picture until I ran across it on one of the IMDb top film lists. Fortunately, I'm glad I kept an open mind enough despite the dubious outset, because the story turned out to be a provocatively intriguing one, even if no resolution occurred as a result. The closing scene inspires closure and doubt at the same time, a unique conclusion to a murder mystery that remains unsolved in real life."
    },
    {
      "username": "guycorhuo",
      "userUrl": "https://www.imdb.com/user/ur1589020",
      "reviewLink": "https://www.imdb.com/review/rw0914386",
      "warningSpoilers": false,
      "date": "26 May 2004",
      "rate": "9",
      "helpful": "260 out of 339 found this helpful.",
      "title": "American thrillers should learn from Korean ones",
      "content": "What a good movie.What a great work of casting. Perhaps a little bit long, but the most part the movie is enjoyable and there's no perfection without mistakes. I think i haven't ever seen before a Korean movie and if there are much of them like this one i shall become Korean movie fan. The tempo, the thrill, the development of characters, everything it has been well worked.The direction is good yet without emphatic resources, there are just two moments with a little much use of slow motion but it doesn't arrive to be an abuse of it.If you can see it don't loose your time with Hollywood sad-bad thrillers bet for this Korean present.9/10 cause perfection doesn't exist."
    },
    {
      "username": "noralee",
      "userUrl": "https://www.imdb.com/user/ur2042633",
      "reviewLink": "https://www.imdb.com/review/rw1132464",
      "warningSpoilers": false,
      "date": "22 July 2005",
      "rate": "7",
      "helpful": "32 out of 43 found this helpful.",
      "title": "A Gritty Murder Mystery with Political and Social Overtones",
      "content": "\"Memories of Murder (Salinui chueok)\" is an involving, cross-cultural take on the \"L.A. Confidential\" noir genre of a murder mystery with a political filter, layered with elements that gritty British TV detectives have mastered, from \"Prime Suspect\" on.While co-writer/director Joon-ho Bong uses the conventions of the contrasting buddy cop movie, sometimes simplistically for comic effect, he has more social commentary on his mind than a captivating investigation into a serial killer and avoids the usual titillating gore fest.Set specifically in 1986, the film visually captures the changes in industrializing, modernizing and politically restive South Korea, where new, dark, noisy factories were sprouting up in the middle of agricultural areas. From the opening shot that could be out of \"Witness,\" we see a peasant bring what looks like a city sophisticated cop to a crime scene.But that's just the start of the conflicting comparisons. We've seen enough \"CSI\"s to sympathize with him immediately as he hopelessly tries to secure the crime scene for clues despite a Keystone Cops-incompetent forensics and investigative team who keep sliding into the irrigation ditch. But he starts to seem a bit of a buffoon to us as he gives more credence to gossipy tips from his girlfriend than clues from the scene and he manufactures \"evidence.\" Our sympathies are curdled even more as we see him conduct an old-fashioned coercive interrogation of a developmentally disabled suspect -- and he's the good cop. Even without knowing anything about Korean law, it certainly looks like they are compromising the investigation, as his thug partner, who is nowhere as complex as Russell Crowe's Bud White, gets as out of control as a cartoonish \"Lethal Weapon\" cop, and that cop never grows and develops in the story beyond being a brutality enforcer so becomes a pathetic comic figure. Their complicit boss just seems ineffectual as he's clearly over his head with this kind of murder investigation.But through the background TV broadcasts of demonstrations and civil defense alerts and drills, we gather that their interrogation procedures were more developed through oppressing political dissidents and forcing confessions than professional criminal detective work. Ironically, they ultimately can't get the resources they need in this difficult case because of these politically-drummed up time-consumers, especially for manpower and sophisticated forensic tools that they have to beg from the FBI.The film changes tone and settles down into an intellectual thriller as a classic big city detective is sent from Seoul, and we have some of the interchanges we've seen in \"In the Heat of the Night\" and in \"Insomnia,\" as the first cop now seems even more of a simpleton in his standard operating procedures of relying on his knowledge of the locals and instincts about human nature (though even a fellow officer teases him about whether he can tell apart a rapist and victim's brother), while the city guy is looking and listening for clues and real evidence, like a Korean \"Dalziel and Pascoe.\" But the tension is ramped up as the killer keeps killing  and the film starts showing us the murders as they are about to happen just as the cops are getting hints about his modus operandi and even after the police are on alert. Their frustration at not being able to stop him is grippingly conveyed by the lead actors, as each starts to abandon their usual procedures out of mounting frustration, and by the editing.A droll side bar is that the macho team is given a key clue by a policewoman who they otherwise relegate to getting them refreshments. Their macho attitudes also keep them from learning vital clues from the marginalized men they pick up as suspects.The coda in contemporary Korea is effective, reinforcing a sense of societal complicity is letting such murders happen and go on, though I was curious what happened to the city cop as well as the local guy. I had no idea until I read the IMDb message board that this was a based on a real case, so I appreciate even more that a cheap ending wasn't tacked on.The cinematography and editing are terrific throughout, with many of the scenes in the dark and rain. Particularly dramatic are harrowing scenes along railroad tracks and a tunnel that are reminiscent of stark imagery from Mervyn LeRoy's \"I Am a Fugitive from a Chain Gang.\" It is frustrating for English subtitle readers that not more of the Korean on the screen, such as newspaper headlines or heard, such as the TV broadcasts and pop tunes, isn't translated."
    },
    {
      "username": "tapio_hietamaki",
      "userUrl": "https://www.imdb.com/user/ur14612223",
      "reviewLink": "https://www.imdb.com/review/rw3632325",
      "warningSpoilers": true,
      "date": "3 February 2017",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "An expertly shot detective mystery",
      "content": "Simply put, this is a well-made film. The story is gripping and realistic (and real), the characters are interesting and the actors engaging, the themes are explored in depth, the visuals are striking and original, the music and sound design are immersive, and the 2 hour runtime is expertly paced. It's a tense and thrilling story, a detective mystery with gray morality and no clear resolution, so it will leave you feeling unsatisfied and even scared at the world around you, but it feels real and humane.The central conflict is between two detectives solving a murder case. The older one wants to get fast results and isn't afraid to manipulate the evidence to get a conviction, whereas the younger one is more idealistic and wants to be sure of the killer's identity. But ideals are hard to cling to in the real world, as the movie shows.'Memories of Murder' has great photography. It layers its shots so that there is always something going on in the background, movement and detail and even some kind of mini-story, so I suggest you watch with a close eye.David Fincher's 'Zodiaz' is a very similar film, and a good one, so to fans of either one I recommend the other."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw1646250",
      "warningSpoilers": true,
      "date": "29 April 2007",
      "rate": "8",
      "helpful": "18 out of 24 found this helpful.",
      "title": "Very Realistic Movie",
      "content": "In 1986, in the province of Gyunggi, in South Korea, a second young and beautiful woman is found dead, raped and tied and gagged with her underwear. Detective Park Doo-Man (Kang-ho Song) and Detective Cho Yong-koo (Roe-ha Kim), two brutal and stupid local detectives without any technique, investigate the murder using brutality and torturing the suspects, without any practical result. The Detective Seo Tae-Yoon (Sang-kyung Kim) from Seul comes to the country to help the investigations and is convinced that a serial-killer is killing the women. When a third woman is found dead in the same \"modus-operandi\", the detectives find leads of the assassin.\"Salinui chueok\" is a very realistic movie based on a true story. The performances are stunning, showing the flaws of a Third World police department in a country under dictatorship, without respect to the human rights, using torture to force the confession and without skilled agents and resources. Unfortunately the identity of the killer is not disclosed and the unsolved investigation gives a sensation that the films has not finished. I am really impressed with the excellent quality of South Korea cinema, with the movies that have been released in Brazil in the last years. My vote is eight.Title (Brazil): \"Memórias de um Assassino\" (\"Memories of an Assassin\")"
    },
    {
      "username": "edoy",
      "userUrl": "https://www.imdb.com/user/ur1397874",
      "reviewLink": "https://www.imdb.com/review/rw0914379",
      "warningSpoilers": true,
      "date": "10 February 2004",
      "rate": "10",
      "helpful": "310 out of 368 found this helpful.",
      "title": "nothing prepares me for this masterpiece",
      "content": "I read a review about this movie and am aware what business it made in Korea, but nothing (I mean NOTHING) prepares me for this great work. With the exception of, perhaps, SE7EN, serial-killer movie has never been this good. The story (about real-life killings of 10 women in Korea during the 1986-1991) is compelling enough, but the actors (Song Kang-ho cuts you deep even when he's silent, and his big-city partner offers emotional jolts at the end), the director (effectively plays some scenes in docu-style approach), the cinematography (a shadow creeps out in the paddy field will give you, well, creeps. big one.), and the music (haunting) are welcome bonuses.One scene that impresses me most is the crime-scene midnight chase between a suspect, 2 local detectives, and a big-city detective (who doesn't know his local partners are there watching him). Humorously intense, or intensely humorous, whichever serves you well.The only regret is I saw this one on DVD, while I believe a movie this big (in many senses) deserves to be seen in theaters. Korean movies rarely touch Indonesian theaters.**** out of ****Try to listen the song SAD LETTER in this movie and tell me it's not haunting you. A magnum opus."
    },
    {
      "username": "Kazombie",
      "userUrl": "https://www.imdb.com/user/ur3280926",
      "reviewLink": "https://www.imdb.com/review/rw1234213",
      "warningSpoilers": false,
      "date": "9 December 2005",
      "rate": "10",
      "helpful": "101 out of 136 found this helpful.",
      "title": "Left me in AWE!",
      "content": "Being a movie buff and a director in the making, I watched this film (with English subtitles, Korean not being my mother tongue), I was completely blown away by this piece of cinematic excellence. There is not a single thing about this film that I can think of in a negative connotation. I wouldn't want to give away anything about this masterpiece. All I would like to say is that this is a film not to be missed. If I want any of my movies to be globally renowned one day, I hope it resembles \"memories of murder\" in any form whatsoever.This film simply belongs in the top 10 of the greatest movies ever made. 10/10."
    },
    {
      "username": "whitecatus88",
      "userUrl": "https://www.imdb.com/user/ur11874239",
      "reviewLink": "https://www.imdb.com/review/rw1454221",
      "warningSpoilers": false,
      "date": "21 August 2006",
      "rate": "10",
      "helpful": "199 out of 238 found this helpful.",
      "title": "A Masterpiece that you cannot miss",
      "content": "Beginning in the fall of 1986 and continuing for the next four years South Korea was haunted by the nation's first recorded serial killer. Preying upon women in a remote rural community the killer was both vicious and meticulous, strangling his victims with their own undergarments and leaving nothing of any use to the police investigating the crimes. The killer was never caught.I do not envy any director trying to make a true crime film, particularly not one so high profile and so recent that the crimes still live on in the public consciousness. Stray too far in one direction and you devolve into saccharine sentimentality, go the other direction and you risk crass exploitation. Director Bong Joon-Ho avoided both of these traps by charting an altogether different route: he has made a film that is not about the killer or the crimes or the victims but one that is purely about the police officers charged with the case and the devastating emotional toll it took on their lives. In charting his unusual route Bong has created a bleak masterpiece, one that took home a stack of film awards in its native land but which has been largely neglected on these shores until now.The film begins with the first body discovered, a woman strangled with her own stockings, raped, tightly bound, and hidden in a drainage culvert. The detective in charge of the case is Park Du-Man (Song Kang-Ho) and it is immediately clear that he is out of his depth, that the entire local police force, in fact, are out of their depth. The crime scene is chaos, crowded by reporters and locals trampling over potentially vital evidence. Park himself is not what you'd call a systematic investigator, scoffing at the scientific approach and trusting in his supposedly unerring eye at picking out criminals just by looking at them. He relies on swagger and bravado and the brute force of his uneducated assisting officer Jo Yong-Gu.Serving as a foil to Park and Jo is Seo Tae-Yun (Kim Sang-Kyung) a detective from Seoul who has volunteered to assist with the investigation. Seo is the polar opposite of Park - methodical and rational - and it takes mere moments for the two to clash, clashes that lead to the two of them overlooking some key pieces of evidence.As the film progresses and the body count continues to rise you can feel a sense of desperation slowly settle over the department. Under educated, under manned and woefully under equipped the local force is simply not up to the task. As the realisation that they will not find the evidence they so badly need begins to set in Park and Jo resort to planting evidence to bring in suspects Park picks out with his 'keen eye', suspects they then set out to extract coached confessions from. The process inevitably leads to public humiliation. Soon even Seo begins to lose his faith in reason and just as things bottom out they finally catch a break and settle on a prime suspect, one who truly appears likely to be their man. But can they make it stick? What sets Memories of Murder apart from the crowd are the rich performances from its leads and the sure hand of Bong Joon-Ho. Bong knows exactly what he wants to do with this film and he steers the ship with a firm hand. He has a keen eye for imagery but he consistently avoids the cheap resolve, the quick hit, in favour of a slowly building mood and the film is all the stronger because of it. Song and Kim are both stellar in their roles, giving their characters much needed depth. You can feel their frustration and helplessness continually growing and when the final crushing blow is delivered you can feel their utter despair at being abandoned by a system that they have given their lives to. Bong isn't just asking how this could happen, how someone could be as evil as this killer, but how could a government allow this to happen? How could the police not be given the tools and manpower they so obviously needed to protect the people? The DVD release has been given the standard Palm treatment. The transfer is strong and presented in anamorphic widescreen. The film is presented with both the original Korean language track in 2.0 stereo and an English dub in both 2.0 and 5.1. The English subtitles are solid, clearly translated and easy to read. The disc also includes a reel of cast and crew interviews discussing their characters and the creation of the film as well as an extensive reel of deleted scenes.Memories of Murder is a minor masterpiece, a film that moved Bong immediately onto Korea's A-list of directing talent. It is richly detailed, beautifully performed and disturbing in precisely the way that people need to be disturbed in from time to time. Don't miss it."
    },
    {
      "username": "wiseman-4",
      "userUrl": "https://www.imdb.com/user/ur2906012",
      "reviewLink": "https://www.imdb.com/review/rw0960310",
      "warningSpoilers": false,
      "date": "10 November 2004",
      "rate": "10",
      "helpful": "209 out of 287 found this helpful.",
      "title": "Best crime/detective film ever",
      "content": "My \"one line summary\" might be too subjective (well it's just an opinion after all), but that's what kind of thought came to my mind after seeing this film. It just sucked me in and didn't let away until the ending credits appeared. I'm really not a fan of this genre which is popular in various \"detective\" TV series but this film was something exceptional. A perfectly made detective film based on a real shocking murder case in S.Korea in 80's. This is a must see Korean film for everybody and this must be a real pearl for those who love detective stories because perhaps it's the best detective film ever...I give it a 10/10 this film is worth it."
    },
    {
      "username": "hagfish",
      "userUrl": "https://www.imdb.com/user/ur8297001",
      "reviewLink": "https://www.imdb.com/review/rw1328346",
      "warningSpoilers": false,
      "date": "29 March 2006",
      "rate": "10",
      "helpful": "99 out of 123 found this helpful.",
      "title": "Walking in Dangerous Rain",
      "content": "Since a synopsis would be redundant here, I'll confine myself to praise alone.Each positive comment that precedes this is accurate. I watched this movie yesterday. I couldn't take my eyes off it. Everything taking place on screen was riveting, from the simple act of walking down a dark lonely road in the rain, to a wild chase by three desperate detectives. This movie held me in thrall.As a new viewer of Asian movies, I try to analyze the reason I tend not to be interested in western works any longer. I finally came to the conclusion that it has to do with the accessibility of the players. They seem to be people first, actors by choice, and stars, by the public making them so.In Memories of Murder, I saw this human factor almost too painfully. By the end of the story, I was in tears. Even now, the mood prevails. It's been so long since these crimes took place, and I don't know absolutely that they remain unsolved, but I think it's the case, and I think about that, and how frustrating it still must be to those who worked on the case.The actors have become the people in my mind, and the horrible sense of defeat that becomes palpable eventually, is heartbreaking. When one relates to the inroads made on the health; mental and physical; of the detectives, who are ultimately portrayed as tireless and completely dedicated to the case, you realize that you've watched something that is historic. You have seen the probable truth.The way this movie draws you into it, so that you are walking through dangerous rain, with a warning shout in your throat, points to the brilliance of the director and the players.It is difficult to say, \"I love this movie\", just as it is hard to say, I love Silence of the Lambs, because love is a peculiar word to use for such fare.But yes, I love it for the fact that during it, I was in a small village in South Korea in a terrible era of sirens blaring, military dictatorship, and the hopeless pursuit of a serial killer. I landed back here in this time and place with a thud, only after turning off the DVD player, and going to the kitchen for a glass of water. While I was caught there mentally---I felt the desperation, and I felt the defeat and the sorrow of the detectives, who were essentially decent enough human beings when all was said and done.There are not many movies that can time-travel you into their present. This will do it.I most seriously recommend that you view the interviews with the director and the stars (all of them are stars of a special kind in my mind) in order to dispel some of the hold the story will have on you.These are incredibly interesting people, and it's a sheer joy to see them smiling and peaceful. They're intelligent, educated and articulate. The younger members of the cast, the less seasoned, are so beautiful in their desire to do it right.They definitely did it right. They were wonderful, and they thanked the interviewer. How lovely that was to see.I watched the movie using the English subtitles rather than the English dubbing because I wanted the authenticity. The subtitles were very good."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw1697544",
      "warningSpoilers": false,
      "date": "21 July 2007",
      "rate": "8",
      "helpful": "12 out of 17 found this helpful.",
      "title": "Not everyone's taste",
      "content": "This isn't your typical serial killer thriller. That's something that elevates this above other movies right from the beginning. But as that is, the question is if you're ready for a change? There's nothing wrong with most of the serial killer thrillers, that follow the rule book, of how to make a movie like that.Back to this Korean thriller, that shows us how cops are dealing with a killer on the loose. The behaviour of the cops (the sort of \"good\" guys) is strange to say the least. Their methods to interrogate people is at least unorthodox! And that's things you have to keep in mind before you watch the movie. Because if you think that this might be a problem for you, then it will be a problem for you for sure, after you watch the movie!"
    },
    {
      "username": "Victor_Fallon",
      "userUrl": "https://www.imdb.com/user/ur23831033",
      "reviewLink": "https://www.imdb.com/review/rw7096032",
      "warningSpoilers": false,
      "date": "6 July 2021",
      "rate": "8",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Entertaining procedural thriller with tons of character.",
      "content": "This movie is in the tradition of hard-boiled detective stories. A rag-tag bunch of largely incompetent police detectives are on the hunt for a serial killer and blunder their way through a thick-headed investigation. Although it's based on real events, it never falls into the trap of treating its characters as accurately portrayed historical figures and instead goes full-on with digging around in the dirt of the story.The recreation of 80s Korea is amazing. Everything is portrayed as cramped, squalid and thoroughly grimey. The cinematography is great all the way to the end, as is the music, costume, set design and acting. There is a good dose of comedy in many scenes, which I didn't expect in this sort of story. It works well.It's a rock-solid piece of cinema with characters that never fall into good guy / bad guy stereotypes. It's much more thoughtful than it initially lets on, hiding a complex theme behind a seemingly straightforward cop thriller. Will watch again."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3689981",
      "warningSpoilers": true,
      "date": "21 April 2017",
      "rate": "8",
      "helpful": "8 out of 11 found this helpful.",
      "title": "A work of unusual depth",
      "content": "MEMORIES OF MURDER is much more than just another serial killer story; this South Korean thriller is a movie of real depth, a genre-transcending tale that shines a light on social and political issues as well as presenting that country's police force in a typically unflattering light. The main story of the tale is also interesting, as is the complex back story, and although slow-paced this is one of those films that creeps up on you to become gripping by the end. Song Kang-ho leads a great cast, but the real star here is director Bong Joon Ho, who followed this up with the equally great THE HOST and SNOWPIERCER."
    },
    {
      "username": "rainking_es",
      "userUrl": "https://www.imdb.com/user/ur3478561",
      "reviewLink": "https://www.imdb.com/review/rw0914388",
      "warningSpoilers": false,
      "date": "5 September 2004",
      "rate": "8",
      "helpful": "50 out of 83 found this helpful.",
      "title": "Scapegoats Inc.",
      "content": "Memories Of Murder is based on a true story of a south-Korean little village in which someone begins to murder young women. The Police can't catch the killer so an agent comes from Seoul to give a hand in the investigation. Soon he'll find that local police's methods are rather brutal, and that they're most interested on finding a scapegoat, someone to blame in order to ease the in tranquility of the population, than on catching the real killer (according to the real facts, they never catched the author of those crimes).The script is solid as a rock, and it's been filmed in a realistic style. trying to show the facts as they happened. Maybe they should've made a shorter movie, and cut some sequences out (the scenes of the interrogations to the three different suspects are a little bit reiterative), and the ending seems a little forced to me. Anyway, Memories Of Murder is much more effective and serious than the most of nowadays' Hollywood detective films.My rate: 7.5/10"
    },
    {
      "username": "Atavisten",
      "userUrl": "https://www.imdb.com/user/ur3231205",
      "reviewLink": "https://www.imdb.com/review/rw1118169",
      "warningSpoilers": false,
      "date": "4 July 2005",
      "rate": "8",
      "helpful": "4 out of 4 found this helpful.",
      "title": "A good thriller",
      "content": "Based on a real murder case in the 80s that now is now closed. It starts out almost as a comedy, the investigator is an amateur and resorts to tae kwondo kicks as soon as the suspects don't tell him what he want to. After a while it turns into a tense thriller.The Koreans really know how to make movies like these. Its well cast, especially the district investigator and Park He-il as the factory worker. Its well directed, and the turn in style is successful.Bong Joon-ho, being the director of the fantastic 'Flandersui Gae' made this, and since I heard a lot of praise for it I had big expectations. Only problem is that it had a few slow moments."
    },
    {
      "username": "gbill-74877",
      "userUrl": "https://www.imdb.com/user/ur66111139",
      "reviewLink": "https://www.imdb.com/review/rw5553546",
      "warningSpoilers": false,
      "date": "15 March 2020",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Haunting",
      "content": "At the time this film was made, the Hwaseong serial murders were unsolved, and director Bong Joon-ho holds nothing back in his searing indictment of Korean police work. Song Kang-ho delivers a fantastic performance as the local lead detective; his character manufactures evidence, pursues harebrained ideas, and tries to beat confessions out of suspects (along with his buddy, played well by Kim Roi-ha). He's oafish, inept, and immature, and so it's no wonder when he feels threatened when a smarter detective from Seoul arrives (Kim Sang-kyung). It's also pretty hilarious that when they meet, he attacks the newcomer with the leaping double-leg kick, thinking he's attempting to assault a young woman.Perhaps most damning, his desire to declare the killer has been found outweighs in his mind the possibility that he really hasn't been, or that stripping someone and torturing them has resulted in a false confession. As the killer always seems a step ahead, it's very interesting to see the arc that these guys go through over the course of the investigation, and to Bong's credit, there is a humanizing progression. I also loved the quiet female police officer (Go Seo-hee), who shows such a counterpoint to the heavy-handed masculine approach. The tunnel scene towards the end is brilliant, and seemed to mirror not only the previous \"documents don't lie\" statement from the detective from Seoul, but also the tunnel vision the detectives had at times over the course of the investigation. And man, that end shot is haunting."
    },
    {
      "username": "Buddy-51",
      "userUrl": "https://www.imdb.com/user/ur0375636",
      "reviewLink": "https://www.imdb.com/review/rw1566501",
      "warningSpoilers": false,
      "date": "7 January 2007",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "first rate police drama",
      "content": "Set in 1986, \"Memories of Murder\" chronicles the first serial killer case in South Korean history. The victims are all beautiful young women whose bodies have been found raped and strangled in local fields and ditches. The initial agents who have been put on the case are two incompetent bunglers - one a dropout from college, the other a dropout from high school - who seem to have gleaned the majority of their investigative techniques from cheesy TV crime dramas. Enter Seo Tae-yoon, a forensic investigator from Seoul, who wrests control from the locals and brings some big-city know-how to the case.Given the grim subject matter at hand, it's amazing just how funny so much of this movie turns out to be. Blessed with a sly sardonic humor and a willingness to make fun of its characters even while evincing a great deal of affection for them, \"Memories of Murder\" plays less like a conventional cop movie and more like a regional comedy filled with rich insights into the subtle truths of human nature. The relationship between Seo, the investigator from Seoul, and Park Doo-man, the more rational of the two local officers, is intriguing and complex, as we watch them bicker and brawl and engage in petty power struggles, while slowly coming to realize that each has something of value to teach the other if only they can set aside their egos long enough to listen. Saddled with even-then antiquated technologies, Seo and Park are forced to rely on good old investigative footwork and informed intuition to try and solve the case.There are strong performances by one and all, and a fine sense of atmosphere in the setting. Those looking for a neatly tied-up resolution to the case may find themselves disappointed at movie's end. But the rich rewards of setting and character should be compensation enough."
    }
  ],
  "errorMessage": ""
}