{
  "imDbId": "tt0353969",
  "title": "Memories of Murder",
  "fullTitle": "Memories of Murder (2003)",
  "type": "Movie",
  "year": "2003",
  "language": "en",
  "titleInLanguage": "Memories of Murder",
  "url": "https://en.wikipedia.org/wiki/Memories_of_Murder",
  "plotShort": {
    "plainText": "Memories of Murder (Korean: 살인의 추억; RR: Sarinui Chueok) is a 2003 South Korean crime thriller film directed by Bong Joon-ho, from a screenplay by Bong and Shim Sung-bo, and based on the 1996 play Come to See Me by Kim Kwang-rim. It stars Song Kang-ho, Kim Sang-kyung, Kim Roi-ha, Park Hae-il, and Byun Hee-bong. In the film, detectives Park Doo-man (Song) and Seo Tae-yoon (Kim) lead an investigation into a string of rapes and murders taking place in Hwaseong in the late 1980s.\r\nDevelopment of the film was confirmed in September 2002, after CJ Entertainment purchased the rights to Kim's play, which is loosely based on South Korea's first confirmed serial murders. It is also inspired by detective fiction and elements of Bong's personal life. Principal photography took place across South Korea, including Jangseong County, Haenam County, and Jinju.\r\nMemories of Murder was first theatrically released in South Korea on May 2, 2003, by CJ Entertainment. The film received critical acclaim, with praise for its screenplay, Bong's direction, the performances of its cast (particularly Song's), tone, and editing. It received numerous awards and nominations, and is widely considered one of the best East Asian films ever made.",
    "html": "<p>Memories of Murder (Korean: 살인의 추억; RR: Sarinui Chueok) is a 2003 South Korean crime thriller film directed by Bong Joon-ho, from a screenplay by Bong and Shim Sung-bo, and based on the 1996 play Come to See Me by Kim Kwang-rim. It stars Song Kang-ho, Kim Sang-kyung, Kim Roi-ha, Park Hae-il, and Byun Hee-bong. In the film, detectives Park Doo-man (Song) and Seo Tae-yoon (Kim) lead an investigation into a string of rapes and murders taking place in Hwaseong in the late 1980s.</p><p>Development of the film was confirmed in September 2002, after CJ Entertainment purchased the rights to Kim's play, which is loosely based on South Korea's first confirmed serial murders. It is also inspired by detective fiction and elements of Bong's personal life. Principal photography took place across South Korea, including Jangseong County, Haenam County, and Jinju.</p><p>Memories of Murder was first theatrically released in South Korea on May 2, 2003, by CJ Entertainment. The film received critical acclaim, with praise for its screenplay, Bong's direction, the performances of its cast (particularly Song's), tone, and editing. It received numerous awards and nominations, and is widely considered one of the best East Asian films ever made.</p>"
  },
  "plotFull": {
    "plainText": "Memories of Murder (Korean: 살인의 추억; RR: Sarinui Chueok) is a 2003 South Korean crime thriller film directed by Bong Joon-ho, from a screenplay by Bong and Shim Sung-bo, and based on the 1996 play Come to See Me by Kim Kwang-rim. It stars Song Kang-ho, Kim Sang-kyung, Kim Roi-ha, Park Hae-il, and Byun Hee-bong. In the film, detectives Park Doo-man (Song) and Seo Tae-yoon (Kim) lead an investigation into a string of rapes and murders taking place in Hwaseong in the late 1980s.\r\nDevelopment of the film was confirmed in September 2002, after CJ Entertainment purchased the rights to Kim's play, which is loosely based on South Korea's first confirmed serial murders. It is also inspired by detective fiction and elements of Bong's personal life. Principal photography took place across South Korea, including Jangseong County, Haenam County, and Jinju.\r\nMemories of Murder was first theatrically released in South Korea on May 2, 2003, by CJ Entertainment. The film received critical acclaim, with praise for its screenplay, Bong's direction, the performances of its cast (particularly Song's), tone, and editing. It received numerous awards and nominations, and is widely considered one of the best East Asian films ever made.\r\nPlot\r\nIn October 1986, two women are found raped and murdered on the outskirts of a small town. Local detective Park Doo-man, not having dealt with such a serious case before, is overwhelmed—evidence is improperly collected, the police's investigative methods are suspicious, and their forensic technology is near non-existent. Park claims he has a way of determining suspects by eye contact. He questions a scarred mentally handicapped boy, Baek Kwang-ho, because he used to follow one of the victims around town. Park's partner Cho beat confessions out of Baek.\r\nSeo Tae-yoon, a detective from Seoul with more scientific training in crime scene analysis, volunteers to assist them. However his and Park's methods clash. Seo determines Baek is too weak and scarred to commit such an elaborate crime and, after closely studying the crime reports, deduces that the killer strikes only on rainy nights and targets women wearing red. Inspector Kwon, the police force's diligent but unrecognized female officer, also has determined that the same obscure song is requested on the local radio station on the night of each crime. Despite a stakeout, the killer eludes them on the next rainy night and kills a woman near a gypsum mine. The next night, Park, Cho and Seo stake out the crime scene and interrupt a man masturbating there. After a chase, they apprehend him, thinking he is the killer. But despite their beating him, his improvised \"confession\" never fits the details of the crime. He does mention a mysterious person who rises out of the outhouses at a local school; this fits with a story that two local schoolgirls told Seo on the night of the most recent murder.\r\nSeo uses the story to find the killer's only surviving victim. She tells him details that exclude the man arrested at the crime scene. Park and Seo fight when the man is released, but when the killer strikes again, they agree to work together. Their investigation leads the to Hyeon-gyu, a clerk at the gypsum factory. Seo notes that Hyeon-gyu's hands are soft like the survivor had described, but they have no other evidence to go on. Listening to Baek's \"confession\" again, they realize that he had seen one of the murders as it occurred. They go to the restaurant run by Baek's father, where they encounter a drunken Cho, who has been suspended from the police force for beating Hyeon-gyu. When other patrons mock the police for not solving the crime, Cho instigates a brawl. Baek stabs him in the leg with a rusty nail then runs off. Park and Seo chase him, but before they can learn what he knows, the frightened Baek stumbles in front of a passing train and is killed.\r\nPark feels guilty when Cho's leg develops tetanus and will have to be amputated. The coroner discovers semen in the latest victim, and Seo arranges for the sample to be sent to the U.S. for DNA testing that will confirm if Hyeon-gyu is the killer. On the next rainy night, Seo loses track of Hyeon-gyu while observing him and one of the schoolgirls Seo had befriended is the next victim. Enraged, Seo attacks Hyeon-gyu the next day. Park interrupts him with the results of the DNA test. They are inconclusive--Hyeong-gyu is neither confirmed nor excluded as a suspect. Seo tries to shoot Hyeon-gyu anyway but Park stops him and Hyeon-gyu is allowed to leave.\r\nIn 2003, the crimes remain unsolved and Park is now a father and businessman. He passes by the first crime scene and stops to view the spot where the victim was found. A young girl tells him about a man she had seen there before who said he was reminiscing about something he had done there a long time ago. Park asks the girl what the man looked like, and she tells him that he looked very ordinary. Shaken, Park stares into the camera.\r\nCast\r\nSong Kang-ho as Park Doo-man, the lead detective\r\nKim Sang-kyung as Seo Tae-yoon, a detective from Seoul\r\nKim Roi-ha as Cho Yong-koo, Park's partner\r\nSong Jae-ho as Sergeant Shin Dong-chul\r\nByun Hee-bong as Sergeant Koo Hee-bong\r\nGo Seo-hee as Officer Kwon Kwi-ok\r\nRyu Tae-Ho as Jo Byeong-Sun, the second prime suspect\r\nPark No-shik as Baek Kwang-ho, the initial prime suspect\r\nPark Hae-il as Park Hyeon-gyu, the third prime suspect\r\nJeon Mi-seon as Kwok Seol-yung, Park Doo-man's girlfriend and then wife\r\nYeom Hye-ran as So-hyeon's mother\r\nProduction\r\nDevelopment\r\nOn September 9, 2002, Bong announced the start of filming in a press conference held at the Kumho Museum of Art. During the conference, Bong addressed the difficulties of shooting the film, saying that \"even though they avoided the location of the incident, Hwaseong, while filming, it was done carefully since the family of the victims of the real cases were still alive\". In an interview with South Korean newspaper Hankook Ilbo in August 2002, regarding the motivation for making the film, he replied that as a fan of detective fiction he \"aimed to depict the horror that has not yet been revealed through the emotions evoked through the clash of unmatching concepts of scenic landscapes and grotesque corpses\" along with the limitation of the times. The conflict framework and the elements of investigation through the usage of FM radio was borrowed from the play Come to See Me, and the scenario was written based on real case reports of the incident as well as personal interviews of the detective who was involved in the case. The film also aimed to reflect his personal reflections from the domestic box office failure of his previous work Barking Dogs Never Bite, which he described as an \"enumeration of personal interests\".\r\nFilming\r\nFilming took place in Jangseong County, South Jeolla Province and the reed field scene was filmed at Haenam County, South Jeolla Province with cinematography by Kim Hyung-koo. The tunnel scenes were filmed at the Jukbong tunnel located in Jinju.\r\nMusic\r\nThe production team initially contacted a lot of famous Japanese composers such as Joe Hisaishi, and yet tried to find the right music that would not \"overwhelm the film\", and later found about Taro Iwashiro. Bong and Iwashiro met each other on two occasions to exchange ideas in 10 hour meetings in Japan and South Korea respectively. Initially over 20 demo tapes were sent to Bong, with some modifications in response to Bong's requests. To reflect the blank spaces that are intentionally laid on the screens in the frames of the film as well as the missing information in time, the music was composed in \"almost connected, yet almost disconnected rhythms\". The style of the music was also required to be realistic and to contain themes of memory of the times and murder.\r\nReception\r\nWithin a year of its debut, Memories of Murder was received as a cult film. Later in the decade, it was praised by numerous international publications, referred to as one of the greatest films of 2000s, one of the best crime films ever made, and one of the best South Korean films of all time. On review aggregator website Rotten Tomatoes, the film has an approval rating of 95% based on 82 reviews, with an average rating of 8.20/10. The site's critics consensus reads, \"Memories of Murder blends the familiar crime genre with social satire and comedy, capturing the all-too human desperation of its key characters.\" On Metacritic, the film has a weighted average score of 82 out of 100 based on 17 critics, indicating \"universal acclaim\". The film won the South Korean film industry's 2003 Grand Bell Award for Best Film, while Bong Joon-ho and Song Kang-ho won the awards for Best Director and Best Leading Actor, respectively.\r\nAccording to Lathifah Indah of Cultura.id, \"Memories of Murder is arguably one of Bong Joon-ho's best movies to watch\".\r\nDeeson Thompson of The Washington Post called the film \"exciting\", while Derek Elley of Variety called it \"a powerful, slow-burning portrait of human fallibility\".\r\nBy the end of the film's domestic run, it had been seen by 5,101,645 people, making it the most watched film during the year 2003 in South Korea. While it was eventually outgained by Silmido, which was released in the same year, most of Silmido's audience did not see it until 2004. At the end of the film's run, Memories of Murder was also the fourth most viewed film of all time in the country, after Shiri, Friend and Joint Security Area. The commercial success of the film has been credited as saving one of its production companies, Sidus Pictures, from bankruptcy.\r\nMemories of Murder received screenings at several international film festivals, including New Zealand International Film Festival, South Western International Film Festival, Cannes Film Festival, Hawaii International Film Festival, London International Film Festival, Tokyo International Film Festival and San Sebastian International Film Festival, where Bong Joon-ho won the Best Director Award.\r\nDirector Quentin Tarantino named it, along with Bong's The Host, one of his Top 20 favorite movies since 1992. It was also chosen as the best Korean film of the century. Sight & Sound included it in their list of \"30 key films that defined the decade\". It was #63 in Slant Magazine's list of the 100 best films of the aughts.\r\nIn 2010, Film Comment listed their top films of the decade based on an international poll of various cinephiles, including filmmakers, critics and academics. Two films directed by Bong Joon-ho were included in the list – The Host (#71) and Memories of Murder (#84).\r\nRelease\r\nIn 2020, distributor NEON had acquired the rights to restore Memories of Murder. The film came out on Blu-ray on April 20, 2021, and was distributed by The Criterion Collection.\r\nReal life case\r\nWhile a total body count was never mentioned in the film, at least 10 similar murders were committed in the Hwaseong area between October 1986 and April 1991. This killing spree became known as the Hwaseong Serial Murders.\r\nSome of the details of the murders presented in the movie, such as the killer's gagging the women with their underwear, were taken from the case. As in the film, at the crime scenes, the investigators found bodily fluids suspected to belong to the murderer, but they did not have access to equipment to determine whether the DNA matched suspect DNA until late in the investigations. After the ninth murder, DNA evidence was sent to Japan (unlike the film, where it was sent to America) for analysis, but the results did not match any suspects.\r\nAt the time of the film's release, the actual murderer had not yet been caught. As the case was growing close to reaching the statute of limitations, South Korea's leading Uri Party sought to amend the law to give the prosecutors more time to find the murderer. However, in 2006, the statute of limitations was reached for the last-known victim.\r\nMore than 13 years later, on September 18, 2019, police announced that a man in his 50s, Lee Choon-jae, had been identified as a suspect in the killings. He was identified after DNA from the underwear of one victim was matched with his, and subsequent DNA testing linked him to four of the other unsolved serial murders. At the time he was identified, he was already serving a life sentence in a prison in Busan for the rape and murder of his sister-in-law.\r\nLee initially denied any involvement in the serial murders, but, on October 2, 2019, police announced he had confessed to killing 14 people, including all 10 serial murders. Two of the additional four murders happened in Suwon, and the other two happened in Cheongju; as of October 2019, details about the victims have not been released because the investigation is ongoing. In addition to the murders, Lee also confessed to more than 30 rapes and attempted rapes.\r\nAfter Lee's arrest, Bong Joon-ho commented, \"When I made the film, I was very curious, and I also thought a lot about this murderer. I wondered what he look like.\" He later added, \"I was able to see a photo of his face. And I think I need more time to really explain my emotions from that, but right now I’d just like to applaud the police force for their endless effort to find the culprit.” Lee had watched the film while incarcerated, stating that \"I just watched it as a movie; I had no feeling or emotion towards the movie.\"\r\nAwards and honors\r\nBest Film\r\nBest Director – Bong Joon-ho\r\nBest Actor – Song Kang-ho\r\nBest Supporting Actor – Park No-shik\r\nBest Screenplay – Bong Joon-ho, Shim Sung-bo\r\nBest Cinematography – Kim Hyung-koo\r\nBest Editing – Kim Sun-min\r\nBest Director – Bong Joon-ho\r\nBest Screenplay – Bong Joon-ho\r\nBest Film\r\nBest Director – Bong Joon-ho\r\nBest Actor – Song Kang-ho\r\nBest Asian Film\r\nBest Cinematography – Kim Hyung-koo\r\nBest Film\r\nBest Director – Bong Joon-ho\r\nBest Actor – Song Kang-ho\r\nBest Screenplay – Bong Joon-ho and Shim Sung-bo\r\nBest Cinematography – Kim Hyung-koo\r\nBest Editing – Kim Sun-min\r\nBest Director – Bong Joon-ho\r\nBest Actor – Song Kang-ho\r\nBest Producer – Cha Seung-jae\r\nBest Screenplay – Bong Joon-ho and Shim Sung-bo\r\nFirst Prize\r\nPremier Prize\r\nAdaptation\r\nScreenwriter Kim Eun-hee (Sign, Phantom) was attached to a television adaptation with the working title Signal, which aired on tvN in 2016.\r\nGap-dong, which aired on tvN in 2014, was also loosely inspired by the film.\r\nBollywood movie Footfairy was also loosely based on the film.",
    "html": "<p>Memories of Murder (Korean: 살인의 추억; RR: Sarinui Chueok) is a 2003 South Korean crime thriller film directed by Bong Joon-ho, from a screenplay by Bong and Shim Sung-bo, and based on the 1996 play Come to See Me by Kim Kwang-rim. It stars Song Kang-ho, Kim Sang-kyung, Kim Roi-ha, Park Hae-il, and Byun Hee-bong. In the film, detectives Park Doo-man (Song) and Seo Tae-yoon (Kim) lead an investigation into a string of rapes and murders taking place in Hwaseong in the late 1980s.</p><p>Development of the film was confirmed in September 2002, after CJ Entertainment purchased the rights to Kim's play, which is loosely based on South Korea's first confirmed serial murders. It is also inspired by detective fiction and elements of Bong's personal life. Principal photography took place across South Korea, including Jangseong County, Haenam County, and Jinju.</p><p>Memories of Murder was first theatrically released in South Korea on May 2, 2003, by CJ Entertainment. The film received critical acclaim, with praise for its screenplay, Bong's direction, the performances of its cast (particularly Song's), tone, and editing. It received numerous awards and nominations, and is widely considered one of the best East Asian films ever made.</p><br/><h3>Plot</h3><p>In October 1986, two women are found raped and murdered on the outskirts of a small town. Local detective Park Doo-man, not having dealt with such a serious case before, is overwhelmed—evidence is improperly collected, the police's investigative methods are suspicious, and their forensic technology is near non-existent. Park claims he has a way of determining suspects by eye contact. He questions a scarred mentally handicapped boy, Baek Kwang-ho, because he used to follow one of the victims around town. Park's partner Cho beat confessions out of Baek.</p><p>Seo Tae-yoon, a detective from Seoul with more scientific training in crime scene analysis, volunteers to assist them. However his and Park's methods clash. Seo determines Baek is too weak and scarred to commit such an elaborate crime and, after closely studying the crime reports, deduces that the killer strikes only on rainy nights and targets women wearing red. Inspector Kwon, the police force's diligent but unrecognized female officer, also has determined that the same obscure song is requested on the local radio station on the night of each crime. Despite a stakeout, the killer eludes them on the next rainy night and kills a woman near a gypsum mine. The next night, Park, Cho and Seo stake out the crime scene and interrupt a man masturbating there. After a chase, they apprehend him, thinking he is the killer. But despite their beating him, his improvised \"confession\" never fits the details of the crime. He does mention a mysterious person who rises out of the outhouses at a local school; this fits with a story that two local schoolgirls told Seo on the night of the most recent murder.</p><p>Seo uses the story to find the killer's only surviving victim. She tells him details that exclude the man arrested at the crime scene. Park and Seo fight when the man is released, but when the killer strikes again, they agree to work together. Their investigation leads the to Hyeon-gyu, a clerk at the gypsum factory. Seo notes that Hyeon-gyu's hands are soft like the survivor had described, but they have no other evidence to go on. Listening to Baek's \"confession\" again, they realize that he had seen one of the murders as it occurred. They go to the restaurant run by Baek's father, where they encounter a drunken Cho, who has been suspended from the police force for beating Hyeon-gyu. When other patrons mock the police for not solving the crime, Cho instigates a brawl. Baek stabs him in the leg with a rusty nail then runs off. Park and Seo chase him, but before they can learn what he knows, the frightened Baek stumbles in front of a passing train and is killed.</p><p>Park feels guilty when Cho's leg develops tetanus and will have to be amputated. The coroner discovers semen in the latest victim, and Seo arranges for the sample to be sent to the U.S. for DNA testing that will confirm if Hyeon-gyu is the killer. On the next rainy night, Seo loses track of Hyeon-gyu while observing him and one of the schoolgirls Seo had befriended is the next victim. Enraged, Seo attacks Hyeon-gyu the next day. Park interrupts him with the results of the DNA test. They are inconclusive--Hyeong-gyu is neither confirmed nor excluded as a suspect. Seo tries to shoot Hyeon-gyu anyway but Park stops him and Hyeon-gyu is allowed to leave.</p><p>In 2003, the crimes remain unsolved and Park is now a father and businessman. He passes by the first crime scene and stops to view the spot where the victim was found. A young girl tells him about a man she had seen there before who said he was reminiscing about something he had done there a long time ago. Park asks the girl what the man looked like, and she tells him that he looked very ordinary. Shaken, Park stares into the camera.</p><br/><h3>Cast</h3><ul><li>Song Kang-ho as Park Doo-man, the lead detective</li><li>Kim Sang-kyung as Seo Tae-yoon, a detective from Seoul</li><li>Kim Roi-ha as Cho Yong-koo, Park's partner</li><li>Song Jae-ho as Sergeant Shin Dong-chul</li><li>Byun Hee-bong as Sergeant Koo Hee-bong</li><li>Go Seo-hee as Officer Kwon Kwi-ok</li><li>Ryu Tae-Ho as Jo Byeong-Sun, the second prime suspect</li><li>Park No-shik as Baek Kwang-ho, the initial prime suspect</li><li>Park Hae-il as Park Hyeon-gyu, the third prime suspect</li><li>Jeon Mi-seon as Kwok Seol-yung, Park Doo-man's girlfriend and then wife</li><li>Yeom Hye-ran as So-hyeon's mother</li></ul><br/><h3>Production</h3><h4>Development</h4><p>On September 9, 2002, Bong announced the start of filming in a press conference held at the Kumho Museum of Art. During the conference, Bong addressed the difficulties of shooting the film, saying that \"even though they avoided the location of the incident, Hwaseong, while filming, it was done carefully since the family of the victims of the real cases were still alive\". In an interview with South Korean newspaper Hankook Ilbo in August 2002, regarding the motivation for making the film, he replied that as a fan of detective fiction he \"aimed to depict the horror that has not yet been revealed through the emotions evoked through the clash of unmatching concepts of scenic landscapes and grotesque corpses\" along with the limitation of the times. The conflict framework and the elements of investigation through the usage of FM radio was borrowed from the play Come to See Me, and the scenario was written based on real case reports of the incident as well as personal interviews of the detective who was involved in the case. The film also aimed to reflect his personal reflections from the domestic box office failure of his previous work Barking Dogs Never Bite, which he described as an \"enumeration of personal interests\".</p><h4>Filming</h4><p>Filming took place in Jangseong County, South Jeolla Province and the reed field scene was filmed at Haenam County, South Jeolla Province with cinematography by Kim Hyung-koo. The tunnel scenes were filmed at the Jukbong tunnel located in Jinju.</p><br/><h3>Music</h3><p>The production team initially contacted a lot of famous Japanese composers such as Joe Hisaishi, and yet tried to find the right music that would not \"overwhelm the film\", and later found about Taro Iwashiro. Bong and Iwashiro met each other on two occasions to exchange ideas in 10 hour meetings in Japan and South Korea respectively. Initially over 20 demo tapes were sent to Bong, with some modifications in response to Bong's requests. To reflect the blank spaces that are intentionally laid on the screens in the frames of the film as well as the missing information in time, the music was composed in \"almost connected, yet almost disconnected rhythms\". The style of the music was also required to be realistic and to contain themes of memory of the times and murder.</p><br/><h3>Reception</h3><p>Within a year of its debut, Memories of Murder was received as a cult film. Later in the decade, it was praised by numerous international publications, referred to as one of the greatest films of 2000s, one of the best crime films ever made, and one of the best South Korean films of all time. On review aggregator website Rotten Tomatoes, the film has an approval rating of 95% based on 82 reviews, with an average rating of 8.20/10. The site's critics consensus reads, \"Memories of Murder blends the familiar crime genre with social satire and comedy, capturing the all-too human desperation of its key characters.\" On Metacritic, the film has a weighted average score of 82 out of 100 based on 17 critics, indicating \"universal acclaim\". The film won the South Korean film industry's 2003 Grand Bell Award for Best Film, while Bong Joon-ho and Song Kang-ho won the awards for Best Director and Best Leading Actor, respectively.</p><p>According to Lathifah Indah of Cultura.id, \"Memories of Murder is arguably one of Bong Joon-ho's best movies to watch\".</p><p>Deeson Thompson of The Washington Post called the film \"exciting\", while Derek Elley of Variety called it \"a powerful, slow-burning portrait of human fallibility\".</p><p>By the end of the film's domestic run, it had been seen by 5,101,645 people, making it the most watched film during the year 2003 in South Korea. While it was eventually outgained by Silmido, which was released in the same year, most of Silmido's audience did not see it until 2004. At the end of the film's run, Memories of Murder was also the fourth most viewed film of all time in the country, after Shiri, Friend and Joint Security Area. The commercial success of the film has been credited as saving one of its production companies, Sidus Pictures, from bankruptcy.</p><p>Memories of Murder received screenings at several international film festivals, including New Zealand International Film Festival, South Western International Film Festival, Cannes Film Festival, Hawaii International Film Festival, London International Film Festival, Tokyo International Film Festival and San Sebastian International Film Festival, where Bong Joon-ho won the Best Director Award.</p><p>Director Quentin Tarantino named it, along with Bong's The Host, one of his Top 20 favorite movies since 1992. It was also chosen as the best Korean film of the century. Sight & Sound included it in their list of \"30 key films that defined the decade\". It was #63 in Slant Magazine's list of the 100 best films of the aughts.</p><p>In 2010, Film Comment listed their top films of the decade based on an international poll of various cinephiles, including filmmakers, critics and academics. Two films directed by Bong Joon-ho were included in the list – The Host (#71) and Memories of Murder (#84).</p><br/><h3>Release</h3><p>In 2020, distributor NEON had acquired the rights to restore Memories of Murder. The film came out on Blu-ray on April 20, 2021, and was distributed by The Criterion Collection.</p><br/><h3>Real life case</h3><p>While a total body count was never mentioned in the film, at least 10 similar murders were committed in the Hwaseong area between October 1986 and April 1991. This killing spree became known as the Hwaseong Serial Murders.</p><p>Some of the details of the murders presented in the movie, such as the killer's gagging the women with their underwear, were taken from the case. As in the film, at the crime scenes, the investigators found bodily fluids suspected to belong to the murderer, but they did not have access to equipment to determine whether the DNA matched suspect DNA until late in the investigations. After the ninth murder, DNA evidence was sent to Japan (unlike the film, where it was sent to America) for analysis, but the results did not match any suspects.</p><p>At the time of the film's release, the actual murderer had not yet been caught. As the case was growing close to reaching the statute of limitations, South Korea's leading Uri Party sought to amend the law to give the prosecutors more time to find the murderer. However, in 2006, the statute of limitations was reached for the last-known victim.</p><p>More than 13 years later, on September 18, 2019, police announced that a man in his 50s, Lee Choon-jae, had been identified as a suspect in the killings. He was identified after DNA from the underwear of one victim was matched with his, and subsequent DNA testing linked him to four of the other unsolved serial murders. At the time he was identified, he was already serving a life sentence in a prison in Busan for the rape and murder of his sister-in-law.</p><p>Lee initially denied any involvement in the serial murders, but, on October 2, 2019, police announced he had confessed to killing 14 people, including all 10 serial murders. Two of the additional four murders happened in Suwon, and the other two happened in Cheongju; as of October 2019, details about the victims have not been released because the investigation is ongoing. In addition to the murders, Lee also confessed to more than 30 rapes and attempted rapes.</p><p>After Lee's arrest, Bong Joon-ho commented, \"When I made the film, I was very curious, and I also thought a lot about this murderer. I wondered what he look like.\" He later added, \"I was able to see a photo of his face. And I think I need more time to really explain my emotions from that, but right now I’d just like to applaud the police force for their endless effort to find the culprit.” Lee had watched the film while incarcerated, stating that \"I just watched it as a movie; I had no feeling or emotion towards the movie.\"</p><br/><h3>Awards and honors</h3><ul><li>Best Film</li><li>Best Director – Bong Joon-ho</li><li>Best Actor – Song Kang-ho</li><li>Best Supporting Actor – Park No-shik</li><li>Best Screenplay – Bong Joon-ho, Shim Sung-bo</li><li>Best Cinematography – Kim Hyung-koo</li><li>Best Editing – Kim Sun-min</li></ul><ul><li>Best Director – Bong Joon-ho</li><li>Best Screenplay – Bong Joon-ho</li></ul><ul><li>Best Film</li><li>Best Director – Bong Joon-ho</li><li>Best Actor – Song Kang-ho</li></ul><ul><li>Best Asian Film</li></ul><ul><li>Best Cinematography – Kim Hyung-koo</li></ul><ul><li>Best Film</li><li>Best Director – Bong Joon-ho</li><li>Best Actor – Song Kang-ho</li><li>Best Screenplay – Bong Joon-ho and Shim Sung-bo</li><li>Best Cinematography – Kim Hyung-koo</li><li>Best Editing – Kim Sun-min</li></ul><ul><li>Best Director – Bong Joon-ho</li><li>Best Actor – Song Kang-ho</li><li>Best Producer – Cha Seung-jae</li></ul><ul><li>Best Screenplay – Bong Joon-ho and Shim Sung-bo</li></ul><ul><li>First Prize</li><li>Premier Prize</li></ul><br/><h3>Adaptation</h3><p>Screenwriter Kim Eun-hee (Sign, Phantom) was attached to a television adaptation with the working title Signal, which aired on tvN in 2016.</p><p>Gap-dong, which aired on tvN in 2014, was also loosely inspired by the film.</p><p>Bollywood movie Footfairy was also loosely based on the film.</p><br/>"
  },
  "errorMessage": ""
}