{
  "imDbId": "tt4016934",
  "title": "The Handmaiden",
  "fullTitle": "The Handmaiden (2016)",
  "type": "Movie",
  "year": "2016",
  "items": [
    {
      "publisher": "The Hollywood Reporter",
      "author": "Deborah Young",
      "link": "https://www.hollywoodreporter.com/news/general-news/handmaiden-agassi-cannes-review-894027/",
      "rate": "90",
      "content": "Expectations are fully met in Park Chan-wook’s exquisitely filmed The Handmaiden (Agassi), an amusingly kinky erotic thriller and love story that brims with delicious surprises, making its two-and-a-half hours fly by."
    },
    {
      "publisher": "IndieWire",
      "author": "Eric Kohn",
      "link": "https://www.indiewire.com/2016/05/cannes-review-the-handmaiden-is-a-sexy-and-depraved-lesbian-revenge-story-from-park-chan-wook-290562/",
      "rate": "83",
      "content": "No matter its overarching ridiculousness, The Handmaiden remains a hugely enjoyable dose of grotesque escapism from a master of the form."
    },
    {
      "publisher": "The Playlist",
      "author": "Jessica Kiang",
      "link": "",
      "rate": "83",
      "content": "An intensely pleasurable, lavishly shot dessert tray of utter hokum, The Handmaiden is a prime example of why we should be glad that there’s someone out there still invested in the overwrought Gothic melodrama, and that that person is Park Chan-wook."
    },
    {
      "publisher": "The Verge",
      "author": "Emily Yoshida",
      "link": "https://www.theverge.com/2016/9/9/12867184/the-handmaiden-review-park-chan-wook-fingersmith-tiff-2016",
      "rate": "82",
      "content": "By replacing the class system of Victorian England with the dynamic of the occupier and occupied, Park has tapped into something uniquely complex about a chapter of history that is rarely explored. There is a deep, festering malady at the heart of The Handmaiden, exacerbated by idle fantasy, cultural projection and denial."
    },
    {
      "publisher": "CineVue",
      "author": "John Bleasdale",
      "link": "",
      "rate": "80",
      "content": "The film reveals its twists and turns with a delicate hand and always manages to stay one step ahead of the audience, even as most of those watching will surrender to the hypnotic erotic charge that runs through the film."
    },
    {
      "publisher": "The Guardian",
      "author": "Benjamin Lee",
      "link": "https://www.theguardian.com/film/2016/may/14/the-handmaiden-review-park-chan-wooks-lurid-lesbian-potboiler-simmers-with-sexual-tension",
      "rate": "80",
      "content": "Given the nudity on show, some are already quick to criticise Park’s direction as gratuitous and to claim that his male gaze is affecting the depiction of lesbian romance. But the impotency of the male characters helps to counter this while the sex scenes themselves, as lovingly shot as they might be, feel vital to the narrative."
    },
    {
      "publisher": "Screen Daily",
      "author": "Wendy Ide",
      "link": "",
      "rate": "80",
      "content": "The film manages the tricky feat of both staying true to Waters breathless, page-turning prose, and creating a wholly persuasive new milieu for the story."
    },
    {
      "publisher": "Variety",
      "author": "Maggie Lee",
      "link": "https://variety.com/2016/film/reviews/the-handmaiden-review-1201774313/",
      "rate": "80",
      "content": "It’s sybaritic, cruel and luridly mesmerizing."
    },
    {
      "publisher": "The Film Stage",
      "author": "Giovanni Marchini Camia",
      "link": "",
      "rate": "67",
      "content": "Those familiar with Park’s earlier work will know that he’s hardly the most subtle of filmmakers, and his approach to gender politics here is risible, even self-contradictory. His customary prowess as a stylist and knack for constructing and navigating intricate plots, on the other hand, is once again put to good use."
    },
    {
      "publisher": "The Telegraph",
      "author": "Tim Robey",
      "link": "https://www.telegraph.co.uk/films/2016/05/18/is-the-handmaiden-liberatingly-erotic-or-a-male-wet-dream---revi/",
      "rate": "40",
      "content": "It’s hard to pinpoint the precise moment at which The Handmaiden, Park Chan-wook’s deviously kinky period thriller, shifts from being a lascivious slice of art-house delirium to a gruelling, dislikable contraption which meretriciously sells out its source material. But that’s what happens."
    }
  ],
  "errorMessage": ""
}