{
  "imDbId": "tt4016934",
  "title": "The Handmaiden",
  "fullTitle": "The Handmaiden (2016)",
  "type": "Movie",
  "year": "2016",
  "items": [
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw3673513",
      "warningSpoilers": false,
      "date": "29 March 2017",
      "rate": "",
      "helpful": "29 out of 34 found this helpful.",
      "title": "Engaging and attractively packaged and delivered",
      "content": "I knew nothing about this film coming into it, other that it being very well considered, and that it has some strong sexual content. This is probably the best way to watch it, as I did not know where the plot was going to start or go. Essentially a con man plans to seduce, marry, and abandon a wealthy unmarried woman – taking her from her uncle and then taking her money. To do this he employs the services of a young pickpocket to work as her handmaiden, and help work the plan from the inside, so to speak.What the film does with this basic plot is enjoyable and engaging. The narrative is solid, holds the interest without effort, and is very well paced and structured. I wonder would it work as well if I had known the source material, or had more knowledge of the wider plot. As a con, the plot is solidly enjoyable and avoids the silly flamboyance of some films where such a plot would be allowed to turn into a 'caper'. Within the plot are some surprisingly sexual elements, and these sit across the sweet, the sensual, and the dark. There is also a good amount of humor where it matters – in particular in part 1 of the film, this is used well in relation to the main character.The direction, production values, and general pacing of the film, all work together to give it a beautiful appearance and tone. It is quite sensuous to watch, with such great colors, sets, costumes, and designs. Within this the actors are all strong. Min-hee Kim and Tae- ri Kim in particular are engaging, although the downside of me being into their characters/performances was that it made the heavy nudity in some of their extended scenes feel a bit exploitative in nature. Jung-woo Ha is solid throughout, and Jin-woong Jo is just the right level of monster for the plot to work.A richly enjoyable film, that sits across so many elements and looks so good that it keeps the plot engaging throughout."
    },
    {
      "username": "ctowyi",
      "userUrl": "https://www.imdb.com/user/ur44546721",
      "reviewLink": "https://www.imdb.com/review/rw3500652",
      "warningSpoilers": true,
      "date": "7 July 2016",
      "rate": "10",
      "helpful": "341 out of 416 found this helpful.",
      "title": "Masterclass Cinema",
      "content": "This is hands down the most perfect film I have seen so far this year. I gave a score of 5/5 to movies like The Revenant, Spotlight and The Songs We Sang. But even with these excellent films I can always find a spot that doesn't quite sit right with me. With The Handmaiden, it is perfect; every frame handcrafted to perfection. Even with 4min of explicit sex taken away by my country's dumb censors, this is still perfect every way I see it.Auteur Park Chan-Wook's The Handmaiden is a superb exercise in form, structure and tone. With the latter, Park (Oldboy & Joint Security Area) has achieved something extraordinary. If any scene were to linger a few seconds longer or he had decided to focus on a certain issue, the film would have veered off to a different territory. As it is, and with all the major characters' kooky off-kilter portrayals, I can't pinpoint whether I was watching something real or abstract. I was also kept in awe by the intricate and resplendent set- design which suggests something dark and Gothic is working the undercurrents. There are of course some serious girl on girl action but that never encroaches into the spine of the story.Adapting Sarah Waters' Fingersmith, a Victorian tale awash with all manner of Dickensian motifs, Park spins an engrossing tale that ebbs and flows with a Hitchcockian suspense; it withholds as much as it discloses; it is an erotic tale that beats with raw fervour. It is at once a love story but also a menagerie showcasing human beings in their vilest forms. Park's finger hovers over all the buttons, teasing us gleefully but it is with the ultimate restraint that he never descends down to the usual tropes. The story is divided into three chapters; each told from a different character's perspective. The structure is Rashomon-esque but Park puts his own stamp on it. The film may be nearly 2.5 hours but I hardly moved in my seat; my senses kept spellbound as each twist hits me hard. When it ended I couldn't believe 2.5 hours have whizzed by. The plot is pulsating and it never lets up. There is even an octopus in it! This is definitely the most perfect film I have seen this year. You may not agree with me but for me this is cinema of the masterclass level.It's sexy time!"
    },
    {
      "username": "tenshi_ippikiookami",
      "userUrl": "https://www.imdb.com/user/ur6150112",
      "reviewLink": "https://www.imdb.com/review/rw3519416",
      "warningSpoilers": false,
      "date": "5 August 2016",
      "rate": "10",
      "helpful": "173 out of 217 found this helpful.",
      "title": "Just amazing",
      "content": "\"The Handmaiden\" is a crazily imaginative and beautiful movie by Chan-wook Park, who is at the top of his game in this story of a pickpocket that tries to steal the fortune of a naive, innocent rich woman that has been secluded in a mansion in the middle of nowhere. Of course, things will start to get complicated soon enough.Chan-wook Park has done a great job in adapting the original novel by Sarah Waters, and mixing it with the history of the Japanese invasion of Korea at the beginning of the twentieth century. The plot is a little bit silly sometimes, but Chan-wook Park makes it all tight and fast-paced, and even the most silly moment becomes a moment of beauty and fun. From the first moment, the viewer will be enthralled by the story of these two women and their relationship, and every plot development will just add fun to the whole.If the plot and the direction weren't amazing enough, the movie is as beautiful as they come. From the darkest moment, the most violent, to the most intimate, beauty transpires in every frame, and every scene comes to life and threatens to pop and break free from the screen. This is helped by the amazing work of all the cast, who does an incredible job in bringing this tale to life (it could be criticized, though, some of the heavily accented Japanese, for characters that are supposed to be able to pass as them).All in all, \"The Handmaiden\" is proof that a movie can have a plot, amazing direction, acting, scenery, craziness and the most beautiful package possible. And even if it is almost two hours and a half long, it feels like a breeze.You will fall in love with this movie. Just plain great."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw3610664",
      "warningSpoilers": true,
      "date": "1 January 2017",
      "rate": "8",
      "helpful": "35 out of 45 found this helpful.",
      "title": "Classy South Korean Erotic Thriller Divided in Three Parts",
      "content": "In Korea, the pickpocket Sook-Hee (Tae-ri Kim) is hired by the Japanese heiress Lady Hideko (Min-hee Kim) to be her personal servant. Hideko is supported by her Uncle Kouzuki (Jin-woong Jo) and the gold-digger \"Count Fujiwara\" (Jung-woo Ha), who is indeed son of peasants, wants to marry her to steal her inheritance. Sook-Hee is a small-time thief of the ring of the conman \"Count Fujiwara\" and is sent to help him in the confidence game. But soon Hideko and Sook- Hee get close to each other and become lovers. But Sook-Hee is pressed by Fujiwara to betray her friend. When Fujiwara marries Hideko, they go with Sook-Hee to an asylum and the nurses hold Sook- Hee believing that she is Hideko. Why Hideko poses of servant and leaves Sook-Hee in the asylum to stay with Count Fujiwara?\"Ah-ga-ssi\", a.k.a. \"The Handmaiden\", is a classy South Korean erotic thriller divided in three parts and directed by Chan-wook Park. The first part is slow paced and shows the development of the relationship among Sook-Hee, Lady Hideko and \"Count Fujiwara\". The second part shows the abusive relationship of Uncle Kouzuki and Hideko since her childhood. The third part has many twists and shows the fate of each leader character. The cinematography is very beautiful and the eroticism is elegant and stylish. The screenplay has surprising plot points. My vote is eight.Title (Brazl): \"A Criada\" (\"The Maid\")"
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw3583502",
      "warningSpoilers": false,
      "date": "20 November 2016",
      "rate": "8",
      "helpful": "27 out of 34 found this helpful.",
      "title": "will need a 2nd viewing. I mean that as a compliment (mostly)",
      "content": "The Handmaiden is a film that unfolds with a classic film stylist (in particular I felt like Chanwook Park was in a kind of Brian De Palma mode as far as making an erotic dramatic-thriller with a camera that luxuriates in long shots, elaborate camera movements, and cinematic grammar that emphasizes operatic intentions, though it's maybe not the first time he's done this anyway), and is LOADED with story. What appears to be the story of a handmaiden who is put in as part of a long con by a man who wants to steal this wealthy woman's money is actually a story about storytelling, about weaving a pack of lies and an entire personality and, in reality, how that can start to crack apart when it comes to seeing humanity in another person and their vulnerabilities.There's a lot going on in this movie, and there is a lot that is... sordid and over the top in its sexuality. That's intentional, I'm sure, and Park never coddles his audience with what he's showing as far as sexuality; the two main women of the film, the handmaiden and her master/mistress or what have you, end up having an emotional connection and this leads to a sexual one. This has the most graphic lesbian sexuality on screen since Blue is the Warmest Color, but here the rawness is matched by the elegance of Park's direction, and while you get to see much of it, only some of it (but there *is* some) that is gratuitous. Otherwise, this is a story of backstabbing and betrayal, but all of it leading up to being in the larger sense about how people fit in to the circumstances they are in, how they have to not simply play but BECOME the characters they're playing - and how these images flip based on perceptions and how we see the scenes.Here's where I may become less articulate in my criticism: the film is in three parts, and I forgot about there being 'parts' as I was so into the film during its first part. There is a major betrayal, but then the movie goes into a 'Part 2', and it turns into a different story... a VERY different kind of story, and it is one that left me confused at first, left adrift, and only Park's direction kept me afloat. As Part 2 went on I got into the movie more, though you have to be prepared for scenes from part 1 being repeated - and whether this becomes tedious will vary depending on the viewer. Nothing is ever not gorgeous to look at, and Park is inspired by paintings and art in the real world, and it's completely sumptuous (I'd be rooting for this to win all the costume/production design awards come February), but there comes a point where the filmmakers are showing the 'here's what happened this scene' moments a little too much. I won't reveal why this is done except to say that the characters take on other roles we didn't expect, and their decisions and how they hide parts of their personalities makes for fascinating viewing. Some times.And then it gets to part 3, and the movie goes into being sordid melodrama and not much more. By this time, the filmmakers have to wrap the story up, and show what this man who has been trying to machinate everything for his own ends is met with a nasty fate. Overall there's so much about The Handmaiden to admire, from the performances by Min-hee Kim as Lady Hideko (appearing in part 1 as varieties of cold and distant and then close and warm and terrified in the other parts), Tae-ri Kim (Sookie, who has much to learn about the art of performance, I mean her character not the actress, she's great), and Jung-woo Ha as the 'Count' who has to remain in control for the whole runtime, but gives in to his passions too. And yet I also wonder if a first viewing trying to explain everything how I felt doesn't do the film justice: it moves slower and more languidly than other Park films, so it took longer to get in to, and the themes of conning and performance may be done stronger in any given Quentin Tarantino film (though here done with more taste and intense sexuality - i.e. the scene with the thimball on the tooth).Another viewing may give more, or less. I can tell you now it's worth seeing if you love pure CINEMA, the likes of which get made by directors with a passion for the form and expressing stories of early 20th century sexual excess and emotional f***ed-up ness (it is early 20th century Korea with a major Japanese influence - in that way it'd make a solid double feature with Kim Jee-Woon's Age of Shadows). As for whether it's a great film, I'm not so sure."
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5475842",
      "warningSpoilers": false,
      "date": "11 February 2020",
      "rate": "",
      "helpful": "44 out of 58 found this helpful.",
      "title": "The Handmaiden",
      "content": "Park Chan-Wook explores the power of narrative (the way you tell a story and its ramifications), creating another astounding visual spectacle full of dark humor, sexual desire, betrayal and revenge, with intense performances and a wonderful production design, editing and score."
    },
    {
      "username": "sossevarvo",
      "userUrl": "https://www.imdb.com/user/ur25815292",
      "reviewLink": "https://www.imdb.com/review/rw3509947",
      "warningSpoilers": true,
      "date": "22 July 2016",
      "rate": "10",
      "helpful": "246 out of 301 found this helpful.",
      "title": "Sublime cinema - like Hithcock with the extremity of Oldboy and the sexual candour of Blue is the Warmest Colour.",
      "content": "I consider Park Chan-Wook to be among the greats of cinema, alongside Scorsese, Tarantino, Fellini, Truffaut, Coppola, Tarkovsky and Nolan. So I had huge expectations going in, and boy, they were met.TheHandmaiden is a masterpiece in pretty much every sense. It is visually exquisite, Costumes, production design, cinematography, music, all combine to create a lush vision of Japan-occupied Korea in the 1930s. Park Chan-Wook is a visually meticulous filmmaker and no film so far of his has showcased his knack for visual storytelling better than the Handmaiden. I went into this film totally blind, which I honestly recommend all people doing, because the plot itself unfolds in such a beautifully engineered fashion.My best description of the film is a Rebecca-like Hitchcockian thriller with the extremity and depravity of films like Oldboy and Battle Royale, and the humanistic sexuality of Blue is the Warmest Colour. All actors are stunning in this film. The two women share an honest, tender romance that is both passionate and moving, with a refreshing candour about the nature of sexuality that is almost never seen in Hollywood productions. The Count is an incredibly charismatic performer who remains appealing despite his many despicable acts.But as always with a Park Chan-Wook film, the real star is the director himself. The way in which this story is crafted is nothing short of engrossing. The outrageous, depraved, sexy, fascinating plot is crafted through multiple perspectives, dashing across back and forth in time, to masterfully reveal key plot points across a never less than spellbinding two hour run time. Some would say the film is slow, but I felt as though the extended running time worked in the film's favour, in order to build character to the extent that the finale for the film feels momentously epic, a real feat considering the movie showcases only four key characters.I was utterly engrossed by this beautifully made film."
    },
    {
      "username": "videorama-759-859391",
      "userUrl": "https://www.imdb.com/user/ur45707659",
      "reviewLink": "https://www.imdb.com/review/rw3562812",
      "warningSpoilers": false,
      "date": "16 October 2016",
      "rate": "8",
      "helpful": "56 out of 91 found this helpful.",
      "title": "You gotta hand it to Park Chan-wook",
      "content": "The Handmaiden is a beautifully told story in a beautifully shot film. Some of it's chosen exterior locations are so captivating and mesmerizing, you almost feel you're there, or wish you were. The actresses are beautiful and perform nothing short of excellent, the young girl (The Handmaiden) especially, such a professionally acted job. You'd expect more so sex scenes, that kind of left me a little downtrodden. The major lesbian one, amidst only a couple of others, in this near two and half hour piece, is one of the hottest and most explicit, I've ever seen, this one again, beautifully shot. The story involves a young girl, a new handmaiden, forced to defraud the wife of the husband, only the young girl falls for the wife, where the story kind of manipulates you, as to where the girl's intentions will lead, where revenge is thrown in too, as we go back in time to an earlier period, involving our young girl, and the wife, where we find ourselves returning to some old scenes, but with added stuff- purpose here. This is one you'd have to watch a couple of times to get the complete picture. Didn't understand the change in color of the subtitles, my only qualm. Acting by all is top notch, and our handmaiden is definitely something to ogle at. A handmaiden who's beautifully made. We too have some violence, and some humorous moments. Hopefully this film will command more attention from moviegoers in Adelaide, as here's one faultless cinematic experience, you should experience, and by no accounts, miss, as it will be your loss. The most impressive thing here though, above everything else here is the filming/photography from obviously a very talented photographer."
    },
    {
      "username": "wcoleparks",
      "userUrl": "https://www.imdb.com/user/ur22811477",
      "reviewLink": "https://www.imdb.com/review/rw3491586",
      "warningSpoilers": true,
      "date": "21 June 2016",
      "rate": "9",
      "helpful": "132 out of 173 found this helpful.",
      "title": "Park Chan-wook crafts another masterpiece!",
      "content": "When going into a movie by one of your favorite directors, it is easy to set high expectations. Rarely does the film fully meet those expectations, but when it does it is something special. Such is the case with Park Chan-wook's The Handmaiden (Mademoiselle). He has crafted an intricately woven tale of love and betrayal that highlights everything he can do so well from heightened sexual tension to gorgeous imagery. The film, which is an adaptation of the novel The Fingersmith, revolves around a woman who is hired as a handmaiden to a Japanese heiress. This is the very basic summary to a film that has a lot of depth underneath the surface and requires the audience's attention throughout the film. And as the plot goes on we discover the newly hired handmaiden may have some ulterior motives along with many of the other characters. Nothing is revealed too quickly and the film is split into a three-part structure that slowly pieces things together through flashbacks. It also uses a storytelling device that is typically owned by Tarantino where the same scene is shown from multiple perspectives and each adds a new layer to the story. All of these devices are used to full effect and create surprising twists on par with Park Chan-wook's Oldboy.What is immediately apparent from the start of the film is how well Park Chan-wook's aesthetic fits into the time period. His eye for gorgeous shots and camera angles makes the house in the film look like a work of art. The grounds around the house are also highlighted so well. Wide shots and lingering camera movements let you appreciate every little detail on screen and marvel at the beauty of it all. The score also fits in perfectly with the time period. It is never bombastic and always subtle, and perfectly captures the mood and feeling of each scene. Whether an intimate moment between the two women or a heated exchange between characters it's hard to realize how great the score is because of how organic it feels. Framing is also a very important addition to the story. Through the use of mirrors and reflections, Park Chan-wook suggests the double-sided nature of the characters. Also, he often obstructs part of the frame with an object and hides characters behind walls or glass to suggest we may not really see everything that is going on before us. This aspect of the film in particular I feel will only get better with subsequent viewing when you can understand all of characters motivations and desires. One thing that Park Chan-wook did so well with Stoker was creating a palpable feeling of sexual tension without using nudity or anything overtly sexual. In this film he succeeds with that throughout the entire film. Every look and every glance the two woman share conveys a longing and desire that permeates the whole film. In this film however, he continues that passion past suggestion into full on sex. There are multiple scenes with extended nudity but they are all filmed so artfully and sympathetically it always feels warranted. The scenes never feel awkward or exploitative and always are tasteful and almost poetic. Somehow despite what I was watching I still found myself admiring the camera-work and beautiful cinematography. One thing that surprised me in the film and I have not seen in Park Chan-wook's other work is the humor. It was never slapstick and usually more circumstantial, but the whole audience laughed out loud on numerous occasions. He showed a surprisingly great understanding of timing and every joke landed. One scene in particular dealt with suicide and could have come across as insensitive or callous. Due to the perfect timing, it was hilarious and even further developed the relationship between the characters. During the last act of the film, it does get unusually violent. There is a torture scene that seems out of place with the rest of the film. Though effective in its own right and thoroughly thrilling, it didn't sit right with me due to how subtle the rest of the film had been. This is a film that really stays with you and will take multiple viewing to really appreciate the complex story. The first film I have seen in a long time where I continued to think about it throughout the day and had multiple conversations about all aspects of the film. With The Handmaiden, Park Chan-wook has crafted a film that fully displays the craft and technical prowess he can show and it includes a story that that only gets better the more you think about it.The Handmaiden (2016) Directed by: Park Chan-wook Screenplay by: Seo-Kyung Chung, Park Chan-wook Starring: Jung-woo Ha, Min-hee Kim, Jin-woong Jo, Tae Ri Kim Run Time: 2 hour 25 minutes"
    },
    {
      "username": "BarryPynchon",
      "userUrl": "https://www.imdb.com/user/ur32941074",
      "reviewLink": "https://www.imdb.com/review/rw3523023",
      "warningSpoilers": false,
      "date": "10 August 2016",
      "rate": "10",
      "helpful": "98 out of 141 found this helpful.",
      "title": "Blue is the Warmest Color + Oldboy = The Handmaiden",
      "content": "Not the craziest film content wise, that award goes to The Neon Demon, but definitely the craziest film storytelling wise. Park Chan-Wook's The Handmaiden is almost as good as the film that put him on the map, Oldboy, and brings such ferocity and energy that it will be one of the most unforgettable films of 2016. Think of The Handmaiden as The Duke of Burgundy F'd Up Edition. This film is pretty twisted in the most unexpected ways from the cinematography that is very reminiscent of Possession in that it always keeps moving, eroticism that is reminiscent of Blue is the Warmest Color, performances as spellbinding as Carol, and the insanity of Park Chan- Wook as expected. The cinematography is some of the most entrancing of the year. Shots that look like they came out of The Master. It's shots like these that make me wonder how was this even possible? It looks so damn cool!The performances are perfect in sucking you into this world of erotica, selfishness, and trickery. Both female leads were fantastic. Min-hee Kim and Kim Tae-ri are amazing with sharing their sexual tension with the audience watching. It's films like these that are the most memorable. Making you feel how ther characters are feeling. Jung-woo Ha and Jin- woong Jo were great as these sexually and financially repressed men who do the most screwed up things to feel the pleasure they so desire. Nothing wrong with the cast at all. Of course Park Chank-Wook hits it out of the part with directing. How else would this immaculate vision be done without him niche for detail. He always knows exactly what to do to get an emotion out of his audience and I applaud him for that. The only negative is that during the middle briefly the pacing slows down a lot and it became really unbearable because I wanted to know exactly what was going to happen next. Thankfully it doesn't last that long and it's really minor that probably won't affect others viewings. If you have any interest in The Handmaiden or you've just heard about it for the first time I strongly suggest checking this out as soon as it comes out. I'll definitely re watch it when it releases in theaters. Easily one of the best films of the year and one I hope to re watch soon."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw7789807",
      "warningSpoilers": false,
      "date": "22 January 2022",
      "rate": "9",
      "helpful": "10 out of 14 found this helpful.",
      "title": "Maid in Heaven...",
      "content": "It's a slightly sordid affair, with plenty of flesh that's flayed and bare, but it is worth a look, it deploys quite a hook, to entice, to entangle, ensnare.A magical and mesmerising story that elegantly delivers and bestows; wraps, engulfs, smoothly flows; charms, chastises and glows - all the attributes your most adoring handmaiden should show."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw3767637",
      "warningSpoilers": false,
      "date": "30 July 2017",
      "rate": "10",
      "helpful": "9 out of 13 found this helpful.",
      "title": "there are places that you can't truly understand",
      "content": "You may have heard Park Chan-wook's \"Ah-gah-si\" (\"The Handmaiden\" in English) called an erotic psychological thriller. That's true, but the movie is more. It addresses relationships and abuse. Very well, I might add. I'm not sure how much of it I can describe without giving a lot away. I can just say that you have probably never seen anything like this. There's plenty of sex, but none of it gratuitous.The only other Park movie that I've seen is the bland \"Stoker\", so I'm impressed. I would definitely like to see the rest of his movies. Moreover, I would like to see more movies set in Korea under Japanese colonial rule (a part of history too often overlooked). Not a masterpiece, but one that I recommend."
    },
    {
      "username": "Stijak91",
      "userUrl": "https://www.imdb.com/user/ur22572846",
      "reviewLink": "https://www.imdb.com/review/rw3547362",
      "warningSpoilers": false,
      "date": "19 September 2016",
      "rate": "10",
      "helpful": "103 out of 135 found this helpful.",
      "title": "Tour De Force!",
      "content": "The controversial film from Korean master Chan-wook Park evokes the sexiness of Abdellatif Kechiche's \"Blue is the Warmest Colour\" and Park's own signature violence and thrills. Set in the 1930s Japanese occupied Korea, it's a story of a young female pickpocket (Kim Tae-ri) who becomes a handmaiden to a beautiful Japanese heiress (Min-hee Kim). However, she must manage to convince the heiress to marry a conman (Jung-woo Ha) who poses as a count, for which she will get a chance for a better life. She gets into a moral dilemma when she starts developing feelings for the heiress.The Handmaiden is a triumph on every level. The film is divided into three chapters, all giving different perspective. This way, the story is perfectly structured to give more and more insight as the film progresses, but at the same time, keep the viewers guessing. It offers a few surprises along the way as well. Visually, it's a feast for the eyes. The term \"every frame a painting\" gets overused, but it really fits here. I'm not only talking about cinematography, which offered plenty of memorable shots and beautiful scenery, but the costume and set design. The three leads all gave terrific performances. Musical score by Yeong-wook evokes, or better said, amplifies the emotions and the suspenseful tone. Despite the run time of 2 hours and 24 minutes, it never gets dull, it's very evenly paced throughout. I couldn't look away for a second.One thing needs to be addressed, the film is quite explicit. That being said, it never gets vulgar, the sex scenes are done in perfect taste, they never feel out of place and they're not there just for the sake of it. The relationship between the characters and the physical presentation of it are integral to the film. It's a film about passion, abuse, jealousy, betrayal and deception, but most of all, it's an atypical love story, which will make one love and hate the protagonists at the same time. It's original and daring work of art that will stick with viewers long after it's finished.Whenever Chan-wook Park makes a film, it must undoubtedly be compared to his masterpiece, \"Oldboy\". I don't think that \"The Handmaiden\" surpasses it, but it comes very close. With this film, he proved himself to be one of the greatest working directors today. It's the best film I've seen this year, one that I can't wait to revisit. It's not to be missed."
    },
    {
      "username": "paul2001sw-1",
      "userUrl": "https://www.imdb.com/user/ur2082018",
      "reviewLink": "https://www.imdb.com/review/rw5199077",
      "warningSpoilers": false,
      "date": "19 October 2019",
      "rate": "6",
      "helpful": "14 out of 23 found this helpful.",
      "title": "Lavish but strangely juvenile",
      "content": "Sarah Walters's novel 'Fingersmith', a tale of power, perversion, pornography and passion in Victorian England, gets a lavish Korean makeover in Park Choon-Wok's movie 'The Handmaiden'. It's certainly visually and thematically rich and provocative as it slides between frequently explicit romance, comedy and horror: if in part it aims to shock, it certainly does so in style. However, I struggled to like any of the characters, all of whom seem as selfish and ruthless as each other, and felt no especial sympathy for the female leads simply because they happen to fall in love/list for each other. The film should perhaps be seen as a paean to desire, in all its oddness and intensity. But for all the artistry, I never quite escaped the feeling of a tale told by schoolchildren, snickering behind the bikesheds."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3801214",
      "warningSpoilers": true,
      "date": "9 September 2017",
      "rate": "6",
      "helpful": "41 out of 84 found this helpful.",
      "title": "Well-made, but I wanted something grittier",
      "content": "I admit to being a little disappointed when I found out that master film-maker Park Chan-wook's latest film would be THE HANDMAIDEN, a remake of a lesbian romantic drama filmed by the BBC as FINGERSMITH. This one relocates a tale of Victorian London to South Korea, where a murky plot involves mucho double-crossing as a con man decides to employ a maid to help him seduce a Japanese heiress due to inherit a fortune.Like the rest of Park Chan-wook's output, this is an expertly-made piece of drama, with sumptuous costumes and filmography, and fine performances from the cast. A pity, then, that it turns out to be merely a romantic drama with a few dark twists. The emphasis is on explicit sex throughout. Imagine if the director had instead put his talents to making another film like OLDBOY - now that would have been something special. This lengthy, languidly-paced film has some good storytelling methods and nice twists throughout, but otherwise it feels disappointingly shallow."
    },
    {
      "username": "jadavix",
      "userUrl": "https://www.imdb.com/user/ur55157303",
      "reviewLink": "https://www.imdb.com/review/rw3616595",
      "warningSpoilers": false,
      "date": "10 January 2017",
      "rate": "6",
      "helpful": "59 out of 116 found this helpful.",
      "title": "Tedious, long winded, beautifully shot",
      "content": "\"The Handmaiden\" is a fairly tedious, hard-to-follow art movie.It looks great, like a photography book come to life... sort of. But just because it's nice to look at, doesn't mean it's fun to watch.The story is told in three parts, each introduced by an on-screen title. The movie goes back and forth on the timeline a bit.It's so long-winded in parts that I stopped caring who everyone was and what they were doing. This is anathema in any movie, but more so for one that fills you in after the fact. I am generally loath to assume that the only reason someone says they like an adults only movie is because of the sex. Here, I have to make an exception. Yes, it does have some fairly graphic lesbian scenes - though not much compared to \"Blue is the Warmest Colour\". And yes, this lesbianism is between two pretty, young Korean actresses.Supposedly, at least most guys love to see women make out, and most of them also have a preference for Asian women. I realise I am an anomaly in not being that excited by either. And take the sex out of the movie, and what do you have?A photography book you'd enjoy flipping through, but not enough of a story to make you want to take it home."
    },
    {
      "username": "Haiku-Review",
      "userUrl": "https://www.imdb.com/user/ur88875619",
      "reviewLink": "https://www.imdb.com/review/rw4986196",
      "warningSpoilers": true,
      "date": "9 July 2019",
      "rate": "8",
      "helpful": "36 out of 46 found this helpful.",
      "title": "Haiku-Review",
      "content": "Lust and Mystery Confused boners lie ahead This is worth watching"
    },
    {
      "username": "Siddhartha14",
      "userUrl": "https://www.imdb.com/user/ur46761872",
      "reviewLink": "https://www.imdb.com/review/rw6309651",
      "warningSpoilers": false,
      "date": "25 November 2020",
      "rate": "6",
      "helpful": "16 out of 24 found this helpful.",
      "title": "Mostly a bore",
      "content": "Far too much gratuitous sex. Interesting story line but focussed far too much on the sex. For the most part, a waste of 2.5 hours."
    },
    {
      "username": "Anaslair",
      "userUrl": "https://www.imdb.com/user/ur29585568",
      "reviewLink": "https://www.imdb.com/review/rw3683806",
      "warningSpoilers": false,
      "date": "13 April 2017",
      "rate": "6",
      "helpful": "79 out of 129 found this helpful.",
      "title": "Beautiful imagery, disappointing content",
      "content": "The photography in this movie is absolutely stunning. The landscapes are amazing and so are the indoor shots. The manipulation of colour is done masterfully as well.But other than that I had trouble finding any substance to the film. I enjoyed some scenes, the interaction between actors, but most of them did not feel real so I didn't really take anything from it.There are several slow parts where scenes are replayed from a different perspective and it's mostly interesting for the sexual discovery the characters partake. Actually, there is not much to it other than the sex.It was okay, different from what I usually watch, but I was expecting something more special, especially after watching such an amazing trailer."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw5980182",
      "warningSpoilers": false,
      "date": "10 August 2020",
      "rate": "9",
      "helpful": "5 out of 7 found this helpful.",
      "title": "Handmaids tale",
      "content": "I watched the longer Directors Cut of the movie and it is something to behold. A very interesting story, that might have intrigued someone like M. Night Shyamalan too (I always have to think if I wrote that correctly - would be nice if imdb had a feature where it recognized names and helped one out). The story and its pace are fairly easy and slow to follow. There is nudity and adult situations (not sure if they are cut in the theatrical release), but that is not something that should be disturbing the viewer at all. If it does, maybe the movie is not something you should watch (or read up on if there is less nudity in the other cut).Having concenterated way too much on that aspect (it is what it is as someone recently said in a way worse context), the movie is well told and may reprise certain moments to give the viewer a fuller picture of what he experienced - which overall is a nice thing, but some may find redundant. Park Chan Wook is more than Old Boy, if you are still stuck on that (great movie no doubt), and he more than proves it here"
    },
    {
      "username": "etismyname-09318",
      "userUrl": "https://www.imdb.com/user/ur67996972",
      "reviewLink": "https://www.imdb.com/review/rw3511752",
      "warningSpoilers": false,
      "date": "16 July 2016",
      "rate": "9",
      "helpful": "116 out of 156 found this helpful.",
      "title": "Not Old Boy, but that's OK",
      "content": "Sex. One of the most overused element in cinema and often mis-used and unnecessary. I was concerned when this movie is announced, a mis-used sex scene could make the movie feels cheap. This movie did manage to get it quite right.There were scenes of sexual attractions in many parts of the movie but it did not take away all other elements that were done well in the movie.Thematically beautiful, the mansion itself is split half between a western and Japanese. The costume design and cinematography are perfect. The west : grand and luxury; The Japanese : Clean, simple elegant design.The story can be summed up as a hero saving a princess and is split into 3 parts. I loved the first two parts, the third part was the only disappointing part where the plot was predictable and not as interesting and it being the last part makes the movie fell short.The music is perfect. Just like Old Boy, music is more crucial than other movies. Old Boy is a movie that would make you think of a modernized hero revenge movie that is both realistic and unbelievable. The music have strong presence to help build up that world. Same goes with this movie as it is also a very realistic setting (you know the period of time it is based upon, the characters motives are clear and their actions are) yet with some very unbelievable events when you add everything together.It isn't a perfect movie, I saw some editing that could be improved here and there. The last part was also a small disappointment for myself. But it is a damn unique movie that you have to watch."
    },
    {
      "username": "Xavier_Stone",
      "userUrl": "https://www.imdb.com/user/ur119082541",
      "reviewLink": "https://www.imdb.com/review/rw6333936",
      "warningSpoilers": false,
      "date": "3 December 2020",
      "rate": "4",
      "helpful": "25 out of 45 found this helpful.",
      "title": "Huge fan of Chan-wook Park but this is just tripe",
      "content": "So many previously good films, mostly revenge based. I even love the Drummer Girl series so after reading some great reviews I watched it with subtitles.After a slow start I was still hooked and kept slogging my way through this and when I finally finished I was left wondering what all the fuss was about. I can't recommend this to anyone. The extended graphic sex scenes don't serve the story at all and are just for ratings. How can anyone not see this is beyond me. The story is barely there and predictable after 30 minutes.I think that because there are Korean and Japanese languages spoken, rather well I'm told, that this movie gets a boost. Another boost for nudity and a bit of revenge. It's a 5 at best if you ignore these bonuses. I rate it a 4 because I'm expecting a good quality film from a respected director, who doesn't need to make soft core porn to increase his audience. It's a major let down and prevents his other films from being noticed."
    },
    {
      "username": "aboiement",
      "userUrl": "https://www.imdb.com/user/ur96203347",
      "reviewLink": "https://www.imdb.com/review/rw4597893",
      "warningSpoilers": false,
      "date": "21 January 2019",
      "rate": "8",
      "helpful": "15 out of 22 found this helpful.",
      "title": "2018-12-23",
      "content": "This is a movie without flying plots and you don't feel bored at all for the entire movie. Many layers of deceptions from different views. Worth watching for not only one time. There are tons of forums talking about this and mentioned that this is based on a TV series of BBC. Now I'm curious about that TV series."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw4248468",
      "warningSpoilers": true,
      "date": "22 July 2018",
      "rate": "7",
      "helpful": "6 out of 10 found this helpful.",
      "title": "a real art piece",
      "content": "In Japanese occupied Korea, Sook-hee is brought in as a maid to Count Fujiwara and as a handmaiden to Lady Hideko. Fujiwara is actually Korean. He intends to marry the Japanese heiress Hideko stealing her family fortune and turning himself into Japanese nobility. Sook-hee is an illiterate simpleton, illiterate both in Japanese and Korean. In reality, she comes from a 'family' of thieves hired by Fujiwara in a scheme to send Hideko into an asylum after marrying her.There is a shocking twist at the end of Part 1 which left me a little confused. One spends the rest of them movie trying to make sense of that turn of event. Honestly, I don't think it answers my questions fully to my satisfaction. I can't accept that it's the best escape plan for anybody. It's a scheme that can't be examined too deeply. It would be more definitive to fake her death. It leaves me feeling a little scammed especially since none of the characters can be believed at face value. They're all lying and I couldn't grab onto the truth. I'd rather they play it straight sending Hideko into the asylum and the Count double-crossing Sook-hee along with everybody else. She could return to rescue Hideko and fall in love. This one does feel a little constructed to shock. Honestly, my only reason to see this is that it's on the top 250 list. It's rare to have a pulpy twisty erotic thriller on the list. This one is beautiful and shot like an art piece. This is a real artistic endeavor from the nude erotica to the complex story construction. It is highly ambitious although I remain unconvinced by the twist."
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw3720388",
      "warningSpoilers": false,
      "date": "31 May 2017",
      "rate": "10",
      "helpful": "10 out of 19 found this helpful.",
      "title": "An Excellent, Liberating Film",
      "content": "\"The Handmaiden\" is a fiercely original bit of erotica that changes the setting of the novel on which it is based from England to 1930s Korea. In an example of narrative sleight of hand that would make Quentin Tarantino proud, director Chan-wook Park tells his story in three parts, each one upending the perspective of the one before and forcing his audience to re-process everything it has just seen.The first part tells the story of a young pickpocket, Sook-Hee, who is roped into a scheme concocted by a sleazy thief posing as a rich count to rob a rich heiress, lady Hideko, of her fortune. The second part tells things from the heiress's point of view, and we find out that she and the \"count\" are actually in cahoots and it's Sook-Hee who's the dupe. Then the third part details the efforts of the two women, who have fallen in love, to double cross everyone and escape to make a life together. \"The Handmaiden\" is largely about what happens when women tire of playing the role assigned to them by men and decide to write their own narrative. Storytelling is a running theme in the film, but the stories being told are all about women being sexually used by men at best but almost always suffering in some way, either physically or emotionally, at their hands. When Sook-Hee and Lady Hideko decide they don't like the parts written for them and take matters into their own hands, it's like watching a weary character in a book jump out of the pages and run away from the reader. The women are liberated, and the viewer likewise feels liberated watching them, enjoying the rare film where women are about more than what men do to them.Grade: A+"
    }
  ],
  "errorMessage": ""
}