{
  "imDbId": "tt4154796",
  "title": "Avengers: Endgame",
  "fullTitle": "Avengers: Endgame (2019)",
  "type": "Movie",
  "year": "2019",
  "items": [
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2019/apr/23/avengers-endgame-review-unconquerable-brilliance-takes-marvel-to-new-heights",
      "rate": "100",
      "content": "I have to admit, in all its surreal grandiosity, in all its delirious absurdity, there is a huge sugar rush of excitement to this mighty finale, finally interchanging with euphoric emotion and allowing us to say poignant farewells."
    },
    {
      "publisher": "IGN",
      "author": "",
      "link": "",
      "rate": "95",
      "content": "Avengers: Endgame is easily the Marvel Cinematic Universe’s most ambitious, emotional, and affecting film to date, somehow managing to tie up more than a decade of storytelling in a confident (and mostly coherent) climax - a hurdle that many other blockbuster franchises have stumbled over in their final runs."
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Richard Whittaker",
      "link": "https://www.austinchronicle.com/events/film/2019-04-26/avengers-endgame/",
      "rate": "89",
      "content": "What's best about Markus and McFeely's script is that they understand the characters."
    },
    {
      "publisher": "USA Today",
      "author": "Brian Truitt",
      "link": "https://www.usatoday.com/story/life/movies/2019/04/23/review-avengers-endgame-marvel-greatest-hits-package/3547516002/",
      "rate": "88",
      "content": "If the Marvel superhero movies on the whole are your favorite band’s individual albums, Avengers: Endgame is the triple-disc greatest-hits package with the really awesome cover and a slew of familiar, comforting gems inside."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Leah Greenblatt",
      "link": "https://ew.com/movie-reviews/2019/04/23/avengers-endgame-review/?utm_source=twitter.com&amp;utm_medium=social&amp;utm_content=link&amp;utm_term=3B0E79C4-6613-11E9-816B-ECBA4744363C&amp;utm_campaign=entertainmentweekly_ew",
      "rate": "83",
      "content": "The movie largely delivers, splashing its ambitious three-hour narrative across a sprawling canvas of characters, eras, and not-quite-insurmountable challenges."
    },
    {
      "publisher": "ScreenCrush",
      "author": "Matt Singer",
      "link": "https://screencrush.com/avengers-endgame-review/",
      "rate": "80",
      "content": "No matter what comes next from Marvel Studios, this Avengers is a gargantuan love letter to the equally enormous mythology that Stan Lee, Jack Kirby, Steve Ditko and the rest of their collaborators built — and to the generations of readers and moviegoers who truly believe in it."
    },
    {
      "publisher": "TheWrap",
      "author": "Alonso Duralde",
      "link": "https://www.thewrap.com/avengers-endgame-film-review-mcu-robert-downey-jr-chris-evans/",
      "rate": "75",
      "content": "Avengers: Endgame has almost nothing on its mind but crossing the Ts and dotting the Is of a far-flung superhero saga, but to anyone with even a minor emotional stake in the Marvel Cinematic Universe, it has all the fleeting satisfaction of a shot of whipped cream delivered directly from the spray can."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Michael Phillips",
      "link": "https://www.chicagotribune.com/entertainment/movies/sc-mov-avengers-endgame-movie-review-0423-story.html",
      "rate": "75",
      "content": "It’s the time travel conceit that keeps “Endgame” hopping, and the trial-and-error sequences recall some of the best parts of the first “Iron Man” 11 years back."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Todd McCarthy",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/avengers-endgame-review-1203971/",
      "rate": "70",
      "content": "While constantly eventful and a feast for the eyes, it's also notably more somber than its predecessors. But just when it might seem about to become too grim, Robert Downey Jr. rides to the rescue with an inspired serio-comic performance that reminds you how good he can be."
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Barry Hertz",
      "link": "https://www.theglobeandmail.com/arts/film/reviews/article-the-hulking-unstoppable-avengers-endgame-is-genius-but-of-an-evil/",
      "rate": "50",
      "content": "Even if I could muster the strength to defy studio marching orders on plot details, there is no point. There is little in Endgame that is worth spoiling, given how its core is spoiled rotten to begin with."
    }
  ],
  "errorMessage": ""
}