{
  "imDbId": "tt4154796",
  "title": "Avengers: Endgame",
  "fullTitle": "Avengers: Endgame (2019)",
  "type": "Movie",
  "year": "2019",
  "items": [
    {
      "username": "MoistMovies",
      "userUrl": "https://www.imdb.com/user/ur19484559",
      "reviewLink": "https://www.imdb.com/review/rw4814867",
      "warningSpoilers": false,
      "date": "29 April 2019",
      "rate": "7",
      "helpful": "147 out of 226 found this helpful.",
      "title": "Not as good as infinity war..",
      "content": "But its a pretty good film. A bit of a mess in some parts, lacking the cohesive and effortless feel infinity war somehow managed to accomplish. Some silly plot holes and characters that could've been cut (Ahem, captain marvel and thanos). The use of Captain marvel in this film was just ridiculous. Shes there at the start, bails for some reason? And then pops up at the end to serve no purpose but deux ex machina a space ship...The past thanos part wasn't necessary when you think about it, they could've done this film without a real 'villain' And it would've worked and been a original take on a super hero film without using the same formula we have seen in 10+ super hero films already. The entire final battle felt like a rehashed messy battle, with a bunch more characters against thanos - basically mixing the space battle from infinity war; iron man, spider man etc and the final battle of infinity war with captain america, thor etc.. mashing those two into one within this new film. The scenes of trying to pull the gauntlet off his hand.. it all felt like a rehash.To me the best part of the film was the first act and half of the second, when everyone is lost and trying to figure out how to continue on. really interesting themes that followed the pay off from infinity wars ending. And then the time heist part. Tho the heist part should've been much more stretched out. With only small parts of thanos within that, and not having him be the big bad again. But just a side character that gets in the way a little bit.And the setting up for 'new avengers' to replace the beloved actors and characters we have come to associate with these films.. they do not get me at all excited for the next phase in marvel films. Falcon, Valkyrie, blackpanther, cap marvel? I just dont care about them at all. And their actors lack any charisma or depth.To me this feels like a closing of marvel films that I'll really enjoy for my pop corn fix. I've given infinity war a 10/10 and some of the stand alone films 8's and 9's. But I have a sinking feeling this will not be happening in the future except the guardians of the galaxy films.It seems i maybe in the minority for my feelings towards this film, but im not sugar coating my opinion like it seems a few people are doing due to nostalgia. Its good, but not great. Had the opportunity to be better, maybe? And the setting up of new characters to come possible reflects on my score to... Because i just don't give two cents about any of them"
    },
    {
      "username": "dschlatter",
      "userUrl": "https://www.imdb.com/user/ur18824833",
      "reviewLink": "https://www.imdb.com/review/rw4831537",
      "warningSpoilers": true,
      "date": "6 May 2019",
      "rate": "7",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Success does not equal quality",
      "content": "The soon-to-be most successful movie of all times actually ranks fairly low among its companions. I'd say it is about as good as Winter Soldier. As a fan of the pevious films, expecially Infinity War, I couldn't miss this one. I think that goes for most movie-goers. After Infinity War, we HAD to see how it ends. Infinity War was an almost perfect movie. And now we get less than perfect. Now, we get \"good\" or \"very good\" and in comparison it seems almost bad. My issue is not how the film is made. But with the story they chose to tell: 1. Thanos can't be the stronger villain without his gauntlet. That's poor writing. 2. Captain Marvel and Captain America are NOT equally strong (when fighting Thanos). 3. Stormbreaker was this amazing weapon in Infinity War. It beat Thanos with all stones in his gauntlet. Now it's just as steong as the hammer. 4. Thor has just found his purpose and strength in Ragnarok and Infinity War. Now he is a joke. 5. The time travel is, well, how itz always is. Hardly logical. Those are the issues that now trouble me after having seen it two days ago. It just wasn't as good as Infinity War. They missed their mark."
    },
    {
      "username": "ACollegeStudent",
      "userUrl": "https://www.imdb.com/user/ur118665987",
      "reviewLink": "https://www.imdb.com/review/rw7640039",
      "warningSpoilers": true,
      "date": "13 December 2021",
      "rate": "8",
      "helpful": "51 out of 87 found this helpful.",
      "title": "Not as good as infinity war but a great movie",
      "content": "Rating: 8.6Not as good as Infinity war pacing-wise, but is a satisfying ending to the saga. High production quality, and a great soundtrack like its predecessor. The final fight did feel a little cliché (two armies brainlessly charging at each other for a typical smackdown). Not much to write about, it made every marvel movie before it worth the ticket."
    },
    {
      "username": "davyjones-636363",
      "userUrl": "https://www.imdb.com/user/ur144096861",
      "reviewLink": "https://www.imdb.com/review/rw7585695",
      "warningSpoilers": false,
      "date": "26 November 2021",
      "rate": "10",
      "helpful": "105 out of 145 found this helpful.",
      "title": "Crazy in every sense",
      "content": "This film is an emotional rollercoaster with some of the coolest superhero plot lines ever drawn up. It's straight up the most epic Marvel film that will probably ever be created. I don't see how Marvel could ever top this, but getting to see these characters all together at least one last time was a reward all on its own."
    },
    {
      "username": "dhiraj-yahoo",
      "userUrl": "https://www.imdb.com/user/ur58551387",
      "reviewLink": "https://www.imdb.com/review/rw4837185",
      "warningSpoilers": false,
      "date": "8 May 2019",
      "rate": "10",
      "helpful": "110 out of 172 found this helpful.",
      "title": "Perfect ending",
      "content": "After watching Infinity war, I was looking forward to much more this time, still a perfect ending."
    },
    {
      "username": "ahmetkozan",
      "userUrl": "https://www.imdb.com/user/ur48829349",
      "reviewLink": "https://www.imdb.com/review/rw4802892",
      "warningSpoilers": false,
      "date": "25 April 2019",
      "rate": "10",
      "helpful": "1,874 out of 3,515 found this helpful.",
      "title": "The End of an Era!",
      "content": "After Avengers Infinity War, we waited for the Avengers Endgame. We wondered how the story would go on, how our heroes would turn back, what would be the end of Thanos. Many theories related to this have been put forward. Avengers Endgame was undoubtedly the most anticipated film of recent years. Normally, the higher the expectation, the higher the probability of disappointment. But this is not the case for Endgame. Whatever you're expecting, you find much more in the film. This means that the biggest concern about the film has disappeared.On the other hand, another comparison comes up. Is Endgame more successful than Infinity War? We can comfortably say it Avengers Infinity War is just the beginning of the story. Endgame was the finale of the story. So we shouldn't think of these two films as two separate stories. There is only one story divided into two parts.Avengers Endgame is, above all, a great homage to the ten-year history of the Marvel Cinematic Universe. The story highlights the original Avengers team. Iron Man, Captain America, Thor, Hulk, Black Widow and Hawkeye are at the center of events. No character comes in front of them. Of course there are many characters that play an important role in the story outside the original Avengers team. Everyone's concern was that Captain Marvel, who was included in the Marvel world, overshadowed other heroes. We can say that this certainly did not happen. What is important in this struggle is not how strong you are, but how good you are. This comes to the fore in all areas. It gives good message about being a hero and a family.Of course, Avengers Endgame has some critical aspects. For example, is the three-hour period necessary in terms of the story? It can be discussed. The head of the story moves much slower than the rest. It also drags the heroes into an emotional predicament. Then the tempo is rising and the heavy scenes we are watching are getting more meaningful. The last 45 minutes of the movie is fully action packed. But the last 45 minutes goes so fast that you don't even realize it. Action and battle scenes are really successful. There is not even a slight distress about visual effects. There are also slight logic errors in the film, but in general the story is so successful that these details become meaningless and insignificant after a certain point.Lastly, Avengers Endgame doesn't have a movie end scene. Because after the film's final, there is no need for another scene. The Marvel legend Stan Lee appears with a small stage. But this is the last surprise scene in the Marvel Cinematic Universe. Moreover, there is no clue about Marvel's future. This makes us wonder more about Spider-Man: Far from Home. 10/10"
    },
    {
      "username": "larshoeijmans",
      "userUrl": "https://www.imdb.com/user/ur60559458",
      "reviewLink": "https://www.imdb.com/review/rw4799176",
      "warningSpoilers": false,
      "date": "24 April 2019",
      "rate": "10",
      "helpful": "1,903 out of 3,408 found this helpful.",
      "title": "The ending made all 22 movies worth it",
      "content": "If you're going to watch this movie, avoid any spoilers, even spoiler free reviews. Which is why I'm not going to say anything about the movie. Not even my opinion. All I'm going to say is:The crowd applauded 3 times during the movie, and stood up to clap their hands after. This I have never witnessed in a Dutch cinema. Dutch crowds aren't usually passionate about this. I checked the row where I was sitting, and people were crying. After the movie, I was seeing people with smudged mascara. That's all I have to say about the movie."
    },
    {
      "username": "kaintrust",
      "userUrl": "https://www.imdb.com/user/ur6152883",
      "reviewLink": "https://www.imdb.com/review/rw4827107",
      "warningSpoilers": false,
      "date": "4 May 2019",
      "rate": "",
      "helpful": "88 out of 159 found this helpful.",
      "title": "2.5 hours of dramas and flashbacks torture with 30 min of action",
      "content": "Nowadays it is like a crime to say bad things against Marvel movies but someone has to tell the truth This movie is extremely over-hyped. The first 2 hours there was almost no action, it was unnecessary endless dialogs, flashbacks and seconds chances. When we thought we gonna see some action, it took 30 min only. And then back to aftermath dramas again. I like dramas and deep stories in the movies but we already know these characters stories. why to over-extend that much? Acting was empty and going nowhere, CGI was almost none since there was a limited action. If it was up to me i would wait for torrents buy my gf wanted to see so much and in the end she also got disappointed."
    },
    {
      "username": "ymyuseda",
      "userUrl": "https://www.imdb.com/user/ur92139946",
      "reviewLink": "https://www.imdb.com/review/rw4800037",
      "warningSpoilers": false,
      "date": "24 April 2019",
      "rate": "10",
      "helpful": "1,103 out of 2,255 found this helpful.",
      "title": "Absolute Perfection End Game",
      "content": "Rating 10/10 Absolute perfection end game !! Good acting performance to all the characters. Great cgi's. Truly epic & perfect ending to a long journey of marvel movie. Go see it you wont regret it !! Perfection Marvel Endgame !!"
    },
    {
      "username": "Mardolin",
      "userUrl": "https://www.imdb.com/user/ur26436346",
      "reviewLink": "https://www.imdb.com/review/rw4801247",
      "warningSpoilers": false,
      "date": "24 April 2019",
      "rate": "8",
      "helpful": "623 out of 1,249 found this helpful.",
      "title": "A little bit underwhelmed",
      "content": "Don't get me wrong, the movie was great, but would I watch it a second time? Probably not - until the DVD comes out.I've seen infinity war at least 5 times, and it's one of my favorite films.That being said, i will compare the two movies for sure, and I just disliked the pacing, it was all over the place. Some Characters felt off, and some got little to no screen time, where others had too much.It's just too many characters for one movie, even though infinity war did it much better, with just as many characters. I just can't put my finger on it.The fighting scenes were alright, the first half lacked action, but the second half delivered some good solid scenes, nothing groundbreaking, but fun to watch. They can't reinvent the wheel, neither do they want to. They stick to what works, and that's alright.All in all, the movie was a close 8/10, the fanboys who give it a 10 are just blind to accept the mistakes the movie made. It's not a perfect film, even an 8 is really generous in my opinion. The Movie works with nostalgia and gives fans of the MCU the things they wanted, more or less.Still thinking Thor 3 was the best MCU movie. Sue me."
    },
    {
      "username": "jke_up",
      "userUrl": "https://www.imdb.com/user/ur35357628",
      "reviewLink": "https://www.imdb.com/review/rw4839513",
      "warningSpoilers": false,
      "date": "9 May 2019",
      "rate": "7",
      "helpful": "4 out of 4 found this helpful.",
      "title": "A decent end of an era.",
      "content": "Infinity war was overall a better movie, but this movie had the disadvantage of being the follow up to that movie. A good chunk of this movie is essentially remembering what happened during infinity war. The struggle against Thanos in this movie... It just isnt done in a satisfying way.Before Infinity war came out last year, it was already confirmed there would be another Avengers follow up this year. It was speculated that Endgame was actually going to be called \"Infinity war part 2\". Unfortunately, this is Endgame, but it SHOULD have been Infinity war part 2. I know that is very vague, Im trying to be vague, but essentially because of what happened in Infinity War, it was pretty much impossible to make a sequel which feels like it even is the same story with the same consistency & epic feel. Or at least, that is not what we got.Captain Marvel kinda sucks in this movie. She is a boring character with magic powers. Ughhh great. In hindsight, the tease in Infinity war was cool, but it makes it into a big letdown. And this is kind of the story of the whole movie, if Infinity War was the teaser. (Although it isnt quite that bad, this movie is still pretty good, unlike Captain Marvel in it.)"
    },
    {
      "username": "patrickpink2013",
      "userUrl": "https://www.imdb.com/user/ur57864729",
      "reviewLink": "https://www.imdb.com/review/rw5069780",
      "warningSpoilers": false,
      "date": "19 August 2019",
      "rate": "8",
      "helpful": "257 out of 516 found this helpful.",
      "title": "nothing here keep on walking",
      "content": "3 hours out of my life I will never get back. not worth the hype. you think the soap opera is done by the ultimate battle. think again. let us milk it and release another spider man. geez a lou."
    },
    {
      "username": "randomStuff101",
      "userUrl": "https://www.imdb.com/user/ur2335852",
      "reviewLink": "https://www.imdb.com/review/rw5074839",
      "warningSpoilers": false,
      "date": "22 August 2019",
      "rate": "6",
      "helpful": "74 out of 133 found this helpful.",
      "title": "slighty awkward or boring at times, slow dialog, some cool stuff",
      "content": "Unfortunately clumsy. I enjoyed all previous Avengers, and a few scenes in this are very cool and funny, but this one lowers the bar overall. For me the story petered out instead of maintained momentum from previous movies. The dialogue struggles to be interesting, boring sequences at time.Clumsy Avengers fit awkwardly together for group photo, like bad high school reunion. That said, I enjoy Avengers like everyone else for years, just not this one so much.The super-power woman, Capt Marvel, her powers are overdone. Too simplistic, too much power. No reason for her to lose any fight.Was a big collective of all heroes even necessary? Sort of not really.Some scenes linger way too long, drawing out already thin content. And where was Dr Strange? He hardly had anything to say, and very brief appearance, yet he was in possession of crucial aspect of story."
    },
    {
      "username": "jtindahouse",
      "userUrl": "https://www.imdb.com/user/ur3793011",
      "reviewLink": "https://www.imdb.com/review/rw4832025",
      "warningSpoilers": true,
      "date": "6 May 2019",
      "rate": "4",
      "helpful": "112 out of 195 found this helpful.",
      "title": "Time travel is such a lazy way to write stories",
      "content": "Only a month or so back I was talking to a friend about how much I hate it when serious movies use time travel to get their characters out of problems. I have no problem with movies like 'Back to the Future' or 'Hot Tub Time Machine' that are both comedy based and use the time machine as a plot for the movie as opposed to a solution for characters problems. When a serious movie uses it though it as lazy as writing as dream sequence in my opinion.At the end of the day though that just underlines the problem with these movies. The heroes are far too powerful. Whatever power they need they simply possess conveniently. Heck, 'Dr Strange' can even see into the future to know exactly what to do to make sure everything turns out alright. If that isn't the stupidest thing I've ever seen in a movie I don't know what is.I felt like the movie went very much as expected as well. Sure some characters die, however they were pretty much telegraphed to do so long before the movie came out. There also seemed to be a lack of conflict as key moments. A lot of things went far too smoothly for my liking in terms of the plan. Finally, the ending with 'Iron Man' simply pulling the glove off 'Thanos' - what the hell was that? Was that supposed to be clever writing? 'Thanos' just standing there for an eternity doing nothing waiting for someone to stop him?A lot of the jokes failed to land too. This was a surprisingly unfunny movie. In a 3 hour movie I got maybe 3 light chuckles out of the film. Every joke just felt so forced and some of the characters who don't have a comedy background delivered them very poorly. 'Avengers: Endgame' is three hours of my life I would like back."
    },
    {
      "username": "kricul",
      "userUrl": "https://www.imdb.com/user/ur39765408",
      "reviewLink": "https://www.imdb.com/review/rw4819372",
      "warningSpoilers": false,
      "date": "1 May 2019",
      "rate": "",
      "helpful": "89 out of 158 found this helpful.",
      "title": "Worst Marvel movie in long time. Boring, boring,,snooze fest",
      "content": "Wow! What a POS movie...So much talking. So much crying.. So much boring no action garbage. These high scores must be paid off. Don't believe the reviews. Stopped watching in one hour..and yes that first hour was painful. I can't imagine fighting thru another two hours. What a shocker. A three hour movie that stinks. Who's idea is it to make movies three hours?!?! Most of them are garbage.Skip this at all costs"
    },
    {
      "username": "ferdmalenfant",
      "userUrl": "https://www.imdb.com/user/ur88736167",
      "reviewLink": "https://www.imdb.com/review/rw5035086",
      "warningSpoilers": false,
      "date": "2 August 2019",
      "rate": "10",
      "helpful": "124 out of 253 found this helpful.",
      "title": "Just terrible!",
      "content": "They've really scrapped the bottom with this one! Oh so Bad!"
    },
    {
      "username": "vert2712",
      "userUrl": "https://www.imdb.com/user/ur0087328",
      "reviewLink": "https://www.imdb.com/review/rw4799099",
      "warningSpoilers": false,
      "date": "24 April 2019",
      "rate": "9",
      "helpful": "762 out of 1,469 found this helpful.",
      "title": "The zenith of the MCU franchise.",
      "content": "I feel like I'm wasting my time writing down my thoughts about Avengers: Endgame, because nothing I (or any critic) could say about it would ever dissuade a prospective viewer from seeing it. But after having had the chance to watch it at a preview screening, I can't help but say a few spoiler-free words.I'm not your average fanboy -- most long-running franchises have bored me at this point, and I couldn't care less about the newest Star Wars episode or whether there will be another film set in the Harry Potter universe.But Marvel films have been consistently watchable, with many solid entries and a few great ones (Winter Soldier, Ragnarok, the first Guardians of the Galaxy among others). And after Infinity War ended with a cliffhanger, I was looking forward to the conclusion. Boy, was I not disappointed!Very few highly-anticipated movies live up to the hype, but Avengers: Endgame is one of them. It's the perfect follow up to Infinity War, and the absolute zenith of the Marvel franchise. It's hard to see how they'll be able to top this one.It's surprisingly inventive (even when you know where the story is headed, the plot takes a few tangents getting there), emotionally engaging (a few people were crying in the theater) and surprisingly funny (this is probably the most I've laughed in a Marvel film since Thor: Ragnarok). Visually speaking, it's a true spectacle (topping Infinity War in the 'epic battle' stakes), and even though it's three hours long, it doesn't feel bloated. The only times I glanced at my watch was because I was hoping there would be more time before the end.Yes, it's a superhero movie, but an immensely entertaining one (especially for fans who have seen all the pictures that came before it: there are tons of references and inside jokes to reward the faithful).If \"Return of the King\" managed to win Best picture at the 2003 Oscars Avengers: Endgame deserves at least a nomination. It's as good (and in many ways better) a conclusion to a fantasy/genre series as the Peter Jackson film,.Go see it."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw5522056",
      "warningSpoilers": true,
      "date": "2 March 2020",
      "rate": "9",
      "helpful": "41 out of 78 found this helpful.",
      "title": "Great climax!",
      "content": "So here we have it, AVENGERS: ENDGAME, the expansive sequel to not only AVENGERS: INFINITY WAR but also to the whole last 13 years or so of Marvel cinema. It's a film that had big boots to fill but the good news is that it's a complete success and every bit as enjoyable as its predecessor. At three hours I wasn't sure about the pacing, but even during the slower first half the viewer's interest remains piqued thanks to the witty dialogue and huge cast of well-established characters doing their thing.The time travel plot might seem a cop out to some, but I really enjoyed the way it gives characters a chance to revisit earlier productions (and even allow the likes of Robert Redford to show up in clever cameos). The climactic action is well worth the wait and bests the battles in LORD OF THE RINGS: RETURN OF THE KING in terms of pure CGI spectacle; it only took them 16 years to get it right. Great fun, anyway, and one for the ages."
    },
    {
      "username": "ravi2445",
      "userUrl": "https://www.imdb.com/user/ur34580273",
      "reviewLink": "https://www.imdb.com/review/rw4845524",
      "warningSpoilers": false,
      "date": "12 May 2019",
      "rate": "9",
      "helpful": "114 out of 209 found this helpful.",
      "title": "Very disappointing",
      "content": "Right in the beginning, you know how the movie is going to end...the good guys are going to win. How anti-climactic that was.. The stage is not set right (half of all humanity is gone, but the enormity of that is not explored...)...when you have Thanos give his explanation as to why he did what he did, I found myself thinking - well, he actually has a point. In the meanwhile, every single superhero is given time to fight, say some cute things, some say a few smart things, a few even manage to say profoundly philosophical statements... The quantum physics explanations used to explain how things are done, are plainly non sense... ..they just made stuff up as they went on. Alls well that ends well. Except we spent 3 hours to find that out."
    },
    {
      "username": "rjcattermole",
      "userUrl": "https://www.imdb.com/user/ur66375372",
      "reviewLink": "https://www.imdb.com/review/rw4799074",
      "warningSpoilers": false,
      "date": "24 April 2019",
      "rate": "10",
      "helpful": "959 out of 1,900 found this helpful.",
      "title": "The best Marvel Superhero movie ever and also the epic conclusion to the 21 movies in the MCU",
      "content": "Avengers: Endgame is above all the best Marvel superhero movie to date. This is also the best and epic conclusion to the 21 movies in the first 10 years of the MCU. This is the epic culmination. The best storytelling ever told."
    },
    {
      "username": "jamiepick-16042",
      "userUrl": "https://www.imdb.com/user/ur122319986",
      "reviewLink": "https://www.imdb.com/review/rw6740724",
      "warningSpoilers": false,
      "date": "25 March 2021",
      "rate": "10",
      "helpful": "87 out of 162 found this helpful.",
      "title": "Overrated.",
      "content": "The Most Overrated Movie Of All Time. (Will Always be the Most Overrated and most Forgettable Movie Of all Time.)"
    },
    {
      "username": "nickgray-12862",
      "userUrl": "https://www.imdb.com/user/ur70552419",
      "reviewLink": "https://www.imdb.com/review/rw4807795",
      "warningSpoilers": true,
      "date": "27 April 2019",
      "rate": "7",
      "helpful": "656 out of 1,226 found this helpful.",
      "title": "Emotional but bit messy.",
      "content": "So it all ends. I have loved most of the MCU, some have been too predictable but I awaited after IW to see how it would all pan out. Firstly some of my favourite characters are a joke. Please don't dumb Thor or Banner/Hulk down, not necessary. Great starting scene, then slow dramatic next 1.5 hours. It builds to the time travel reversing all section with too many plot holes. We've all seen other time reversing movies who have done it so much better. The last hour is spectacular, great to see all the gang back but it feels rushed. Emotion runs high and defo not a kids film in my eyes. Cap is great Stark is amazing but everyone else feels like there just there. What I loved was the beauty of the final scenes, wonderful score and saying goodbye to old friends. Overall wanted more, but even far from perfect is still pretty good."
    },
    {
      "username": "moneypennycharley",
      "userUrl": "https://www.imdb.com/user/ur99608102",
      "reviewLink": "https://www.imdb.com/review/rw4804757",
      "warningSpoilers": true,
      "date": "26 April 2019",
      "rate": "8",
      "helpful": "361 out of 767 found this helpful.",
      "title": "Avengers: Contradictiongame",
      "content": "Personally I found it mediocre at best. Too many contradictions to count. So thors hammer DOES grant him the power of lightning? I know Odin tells thor that it doesn't give him those powers but only helps him channel them, so what, cap has had that ability the whole time but saved it or never knew till now? And what's with the whole changing the past doesnt change the future? How does anything they do then accomplish anything. And why does nebulas eye thing just conveniently decide to play the most incriminating thing possible, when it could play anything in reality. I'm glad at least that the 1 dimensional captain marvel was not present most of the film, that at least was a plus. And further more, why was tony seemingly un injured from the stones, yet died? Is he a god and we never knew? Half god quil was nearly turned to ash from just one in seconds, tony used them all. I just dont how they ended up deciding to go down some of these paths. It's like they never saw any of the past movies. And hulk?bruce? Beta Hulk? What ever he is, he managed to find a way to be more useless than in the last film. Seriously what did he even do other than the first fix snap? Why not let thor do it, I think he could take the power of it if he can handle the full force of a stars radiation in the vaccum of space. And then cap just stays in the past like an a hole and watched all this horrible stuff unfold? How did any of the events that led up to it happen then with out him? They never needed him at all? And if you cant change the past, then how does he stay and literally change the past by being in it? Too many self creating paradoxes that they basically tell you to screw yourself if you start asking \"wait but why....?\" All in all, I think what we experienced here is they peaked with infinity war, and cant make something as good. I mean cmon, thanos had the personality of a lobster in this film. It felt like we were dealing with an unknown enemy, yet we do know him.... and Gamora died in infinity war yet never comes back? Why? Because it was the soul stone thst she died for? Then arent you changing the past by removing that Gamora from the time line? And why is Thor like a broken sexual assault victim, hes the GOD of thunder for crying out loud. and why does Thanos' most impractical weapon ever, his double sided sword thing, just absolutely demolish cap's shield? Did Tony give him a fake lol? And we get to see Loki grab the tesseract and vanish, and we never see the follow up to that? What a loss of a good plot line, follow lokito find it and enlist his help against thanos. HOW DOESNT IT CHANGE ANYTHING?!?!?! Seriously it just seems like lazy writing on their end more than anything else. Like someone got half this plot and someone pointed out, hey changing the past changes the future you know, so they were like ahh crap that's right, well, just have beta hulk give some science nonsense spiel about it and that should clear things up. And if taking past gemora to the future to replace the one they lost works fine..... why doesnt anyone go grab the Tony from before he left to get the stones? If changing the past doesnt change the future, how does it stop him from sacrificing himself? Same goes for black widow. The final battle seen wasnt that great either, I like my fair share of female super heroes but just the whole girl squad assemble thing was a little too much, like they all conveniently ended up in the same place at the same time, cmon we all know you just wanted you PC plug, you guys are more creative than that, that was just desperate and laughable. I'm a big fan of marvel movies, and to be fair this one had the most to live up to, but I still feel like they didnt do it justice. Perhaps they shouldve taken more time between films. Oh well. If the spider man movie is no good as well, I think I'll be parting ways with marvel films."
    },
    {
      "username": "sajakram",
      "userUrl": "https://www.imdb.com/user/ur104320449",
      "reviewLink": "https://www.imdb.com/review/rw4934727",
      "warningSpoilers": false,
      "date": "14 June 2019",
      "rate": "7",
      "helpful": "138 out of 251 found this helpful.",
      "title": "These get worse!!!",
      "content": "I don't really know what all the hype is about. Bored watching this as it's the same again just rehashed. Glad to see the back of the Avengers to be honest."
    },
    {
      "username": "Paynebyname",
      "userUrl": "https://www.imdb.com/user/ur2037258",
      "reviewLink": "https://www.imdb.com/review/rw4826082",
      "warningSpoilers": true,
      "date": "4 May 2019",
      "rate": "4",
      "helpful": "1,471 out of 2,776 found this helpful.",
      "title": "The writers got carried away, the directors over reached and the studio sacrificed the integrity of their product.",
      "content": "I've just come from watching Endgame and I must say that I am disappointed.I loved Civil War and I loved Infinity War. When I came out of those films, I knew immediately that they were great and that I wanted to see them again. With Endgame, I'm not sure.I respect how they were prepared to show the consequences of what Thanos had done but by killing him off so quickly and then them having to do their own stone quest (hadn't we already seen Thanos doing this in IW) it felt slow and lazy. Worse still was that it felt very self-indulgent and attempting to be clever for clever sake.Like how Back to the Future II considered itself clever for showing the events of the first film but with Marty flitting around behind the scenes to ensure that it all still happened. I know it's meant to be fan pleasing but it really felt like a gimmick and lacking in confidence. Almost like it was saying 'Hey guys, this will make you smile'. If you want to make me smile, concentrate on maintaining the quality of your product rather than directly trying to make me like you.But the trouble with messing around with timelines and bouncing around is that it makes the audience start asking questions during the film. The linearity that we'd seen in IW and the imminent fast approaching threat is replaced in Endgame with a lack of direction and characters that are earlier versions of who the audience have seen.In IW we were shown Thanos. He was written to be sympathetic or at least a character that we the audience could understand. He believed in what he was doing and this made him more rounded. But in Endgame, that version is dispatched quickly and we are supplied with a 2014 (?) Thanos who isn't the character we know but is just a token bad guy.This Thanos hasn't made the sacrifice at Vormire, he isn't the guy that would empathise with Scarlet Witch for what she did to Vision. He has suddenly become a token cut out evil bad guy that needs to be defeated. Hell, the writers even manage to forget their own time loop by saying that this Thanos has learnt that he doesn't want to wipe out 50% anymore because they are too ungrateful. How does he know this when the 2014 Thanos has only just literally arrived in the post wipeout Universe? How has he had time to form the opinion that his previous quest for a 50% cull isn't worthy?Is this a case of the writers being terrified that they had created a bad guy that people related to or was it a fear that they'd written themselves into a hole? Why go to the effort of creating that character in IW to suddenly kill him off at the beginning of Endgame just for a dramatic punch?For me, the time travelling and stone gathering wasted time to create unimportant scenes that fundamentally undermine the films that came before. In my opinion it would have been better if they had shown the remaining Avengers preparing to do some Avenging and maintained the single minded linearity of IW of battling towards and reaching a post click Thanos and somehow reversing his work.The more I think of the film, the more plot holes and frustrations manifest themselves. Thor's drinking and man child antics might have been initially funny but one begins to realise that they are deliberately doing this to clip his wings. Likewise with Hulk, his primordial desire to smash and destroy has been removed to think it out and he has become an embarrassing shadow of his former self.The thing that is meant to be amazing about the MCU is the world building but inconsistencies have been appearing and there are so many in Endgame that it makes you question whether these two films are written by the same people.In IW, Thanos is a dangerous and credible threat because he has the infinity stones. He takes on half of the Avengers, Strange and some of the Guardians on Titan and smashes them and then takes on the other half on Wakanda and smashes them. Yet it is Stormbreaker (whose creation we have seen been hard earned by a motivated Thor) that has the power to take down Thanos even when he has a full complement of Infinity Stones.Yet we roll forward to Endgame and we have literally all the good guys together in one place, Cap with his shield, Tony fully powered up, Scarlet Witch p*ssed and vengeful, Capt Marvel who can seemingly do anything and Thor wielding both Mjolnir AND Stormbreaker and Thanos NOT in possession of the gauntlet, yet they can't defeat him.It's like the fights in IW were so amazing because the good guys were taking on an unbeatable foe yet here he is now seemingly defeatable by the 'rules' that the writers established . A good example of this would be in IW when Cap is the last man standing before Scarlet Witch and he grabs the gauntlet. You see the look of admiration/respect on Thanos' face that Cap is holding open the gauntlet before he punches him to the ground yet now that scene seems pointless.The writers for Endgame seem to have been driven to undo everything they did in IW. All the tension, all the sacrifice, all the development of Thanos discarded for well, I don't know what. It makes no sense.IW had two incredible scenes that used to choke me up. When Cap appears in the train station, the Avengers theme kicks in and Falcon and Widow take down the henchman in a wonderfully choreographed scene. In just that one scene it shows them coming to the rescue, it shows how intuitively they work together and it showcases their heroism.Likewise when Thor creates Stormbreaker and makes his entrance on Wakanda, I felt it for the journey that Thor has been on. He's had to contend with loss and defeat and humiliation and this is his redemption. Here is a character that has earned his game changing weapon and when he arrives and demands to face a character that everyone else is running away from, I want to punch the air.But in Endgame, that feels like it has to be corrupted. We can't have Thor being dominant, let's break him and make him a fool. We can't have Thanos being complicated and relatable, let's make him a cut out bad guy. We can't have Hulk being rage fuelled and smashing stuff up, let's make him more sensitive and talking stuff out. We can't have Cap being stoic and heroic, let's have him ridiculing one of his own iconic lines in a silly gimmicky fight with himself and commenting on his butt. We can't have a powerful female character that we're invested in look sexy AND be able to take down Thanos, let's give Scarlet Witch a small part but focus our attention on a female character that hasn't earnt our admiration or desire for revenge.To be honest, the 'rules of engagement' had been set so well in IW that when in Endgame Thanos massed his ranks against the Avengers and then ALL of the good guys showed up, I was almost expecting the camera to pull away and not show the fight given that it was so obviously going to be an easy win for the good guys.And as for the big fight scene, it did reek of what DC always manage to do which is just throw everything into an end battle and bludgeon you with CGI and pyrotechnics so that you aren't really sure what is going on.In the many fights in IW, you knew what was going on, you recognised the combatants, you understood the stakes and you identified the geography of the scene. In Endgame we got one big massive fight where everything was thrown in the pot and it was just assumed by the directors that we would be happy with all the flashing lights. And I have to say that considering that Steve and Tony fell out so hard, and that Tony's criticism of Steve was so unfair, that I really had hoped for more than just a handshake, a muttering of 'no worries' and 'here's your shield'. These guys wrote and directed Civil War, they created the line 'we fell out hard' and hence I had hoped for something deeper and more touching than a handshake.Steve wrote Tony a letter telling him that when he needed him he'd be there but once again the Iron Man bias had to creep in and once again Tony was the victim and the ultimate hero.But I think my biggest problem is how the convenient time travelling undermines everything. When a franchise starts retrofitting stuff (like Fury's eye being from a space cat), it's then hard to consider the previous stories.Having 2014 Gamorra means that all the evolution that we saw her go through in GOTG 1 and 2 is wasted. Having Cap marry Peggy means the pain of his sacrifice, him seeing her in Winter Soldier when she is suffering from Alzheimer's, hell even his blossoming relationship with Sharon Carter is kinda irrelevant. Having seen Thor at last step away from his two weaker origin films into the entertainment of Ragnarok and the redemption in IW leaves us now with a bumbling buffoon.We know that what makes Captain America what he is, is the serum that makes him a super soldier. That he was transformed from a weakling to a superhuman. Sam Wilson is not a super soldier and he didn't take the serum. He is Falcon. Now maybe in the comics he becomes Cap but Bucky is a super soldier. Is the new Cap going to foil an evil plot and be defeated with a tazer or a knife to the chest? Consider the beatings that Steve has taken and the physical strength that he has shown we can recognise that Sam Wilson does not have that.I'm sorry to say but the Russo's have dropped the ball. Themselves and their writers have succumbed to their success and their desire to be engineers of political correctness and social change. I thought Endgame would be the high soaring end to this 10 year run of impressive movie entertainment but in the end the writers got carried away, the directors over reached and the studio sacrificed the integrity of their product for a chance to 'educate' us all. A real shame and a wasted opportunity.Infinity War is clearly the highlight of the last 10 years but even now I fear that repeated viewings will render it pointless considering how the makers decided to fundamentally damage it."
    }
  ],
  "errorMessage": ""
}