{
  "imDbId": "tt0103064",
  "title": "Terminator 2: Judgment Day",
  "fullTitle": "Terminator 2: Judgment Day (1991)",
  "type": "Movie",
  "year": "1991",
  "items": [
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Rick Groen",
      "link": "",
      "rate": "100",
      "content": "A great movie... A pop epiphany, marking that commercially creative point where the power of Hollywood meets the purity of myth."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Kenneth Turan",
      "link": "",
      "rate": "100",
      "content": "More elaborate than the original, but just as shrewdly put together, it cleverly combines the most successful elements of its predecessor with a number of new twists (would you believe a kinder, gentler Terminator?) to produce on e hell of a wild ride, a Twilight of the Gods that takes no prisoners and leaves audiences desperate for mercy. [3 July 1991, Calendar, p.F-1]"
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Mick LaSalle",
      "link": "",
      "rate": "100",
      "content": "Terminator 2 imagines things you wouldn't even be likely to dream and gets these visions onto the screen with a seamlessness that's mind-boggling. [3 July 1991, Daily Datebook, p.E1]"
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "88",
      "content": "The key element in any action picture, I think, is a good villain. Terminator 2 has one, along with an intriguing hero and fierce heroine, and a young boy who is played by Furlong with guts and energy."
    },
    {
      "publisher": "Variety",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "As with \"Aliens,\" director James Cameron has again taken a first rate science fiction film and crafted a sequel that's in some ways more impressive - expanding on the original rather than merely remaking it."
    },
    {
      "publisher": "USA Today",
      "author": "Susan Wloszczyna",
      "link": "",
      "rate": "75",
      "content": "Arnie is Arnie. He has all the cute lines (\"No problemo,\" \"Hasta la vista, baby''). And he does more with a squint than anyone since Popeye. [3 July 1991, Life, p.1D]"
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "",
      "link": "",
      "rate": "70",
      "content": "Trend-setting visuals compensate for a plot that lacks the imagination and edge of the 1984 original."
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Marc Savlov",
      "link": "https://www.austinchronicle.com/gyrobase/Guides/Film/?Film=oid%25253A139549",
      "rate": "67",
      "content": "What is notable, though, is the amount of compassion invested in the film by Cameron and co-screenwriter William Wisher. There's a fairly well-drawn moral message in T2 that was more or less absent in the first film."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "60",
      "content": "All the virtues of the original... are present here, though when Cameron tries to milk some sentiment out of the \"personality\" and fate of his top machine he comes up flat and empty, and the other characters are scarcely more interesting."
    },
    {
      "publisher": "The New Republic",
      "author": "Stanley Kauffmann",
      "link": "",
      "rate": "30",
      "content": "The surprise is that a picture made to be exciting for 136 minutes is so unexciting most of the time. It starts with a bang and keeps banging, so there's little suspense and no crescendo. [12 Aug 1991, p.28]"
    }
  ],
  "errorMessage": ""
}