{
  "imDbId": "tt0103064",
  "title": "Terminator 2: Judgment Day",
  "fullTitle": "Terminator 2: Judgment Day (1991)",
  "type": "Movie",
  "year": "1991",
  "language": "en",
  "titleInLanguage": "Terminator 2: Judgment Day",
  "url": "https://en.wikipedia.org/wiki/Terminator_2:_Judgment_Day",
  "plotShort": {
    "plainText": "Terminator 2: Judgment Day is a 1991 American science-fiction action film directed by James Cameron, who co-wrote the script with William Wisher. Starring Arnold Schwarzenegger, Linda Hamilton, Robert Patrick, and Edward Furlong, it is the sequel to The Terminator (1984) and is the second installment in the Terminator franchise. In the film, the malevolent artificial intelligence Skynet sends a Terminator—a highly advanced killing machine—back in time to 1995 to kill the future leader of the human resistance John Connor, when he is a child. The resistance sends back a less-advanced, reprogrammed Terminator to protect Connor and ensure the future of humanity.\r\nThe Terminator was considered a significant success, enhancing Schwarzenegger's and Cameron's careers, but work on a sequel stalled because of animosity between the pair and Hemdale Film Corporation, which partially owned the film's rights. In 1990, Schwarzenegger and Cameron persuaded Carolco Pictures to purchase the rights from The Terminator producer Gale Anne Hurd and Hemdale, which was financially struggling. A release date was set for the following year, leaving Cameron and Wisher seven weeks to write the script. Principal photography began from October 1990 to March 1991, taking place in and around Los Angeles on an estimated $94–102 million budget, making it the most-expensive film made at the time. The advanced visual effects by Industrial Light & Magic (ILM), which include the first use of a computer-generated main character in a blockbuster film, resulted in a schedule overrun. Theatrical prints were not delivered to theaters until the night before its July 3, 1991 release.\r\nTerminator 2 earned $519–520.9 million, making it the highest-grossing film of 1991 worldwide, and the third-highest-grossing film of its time. Critics praised the visual effects, action sequences and cast, especially Patrick's performance as the T-1000 as a great cinematic villain, while criticism was directed towards the film's violence. Terminator 2 won several accolades, including Saturn, BAFTA, and Academy awards. Terminator 2 merchandise includes video games, comic books, novels, and T2-3D: Battle Across Time, a live-action attraction.\r\nTerminator 2 is considered one of the best films ever made, and one of the best science-fiction, action, and sequel films, as well as equal to or better than The Terminator. It is also seen as one of the most influential visual effects films of all time, beginning the transition from practical effects to reliance on computer-generated imagery. Although Cameron intended for Terminator 2 to be the end of the franchise, it was followed by a series of sequels, including Terminator 3: Rise of the Machines (2003), Terminator Salvation (2009), Terminator Genisys (2015), and Terminator: Dark Fate (2019), as well as a 2008 television series.",
    "html": "<p>Terminator 2: Judgment Day is a 1991 American science-fiction action film directed by James Cameron, who co-wrote the script with William Wisher. Starring Arnold Schwarzenegger, Linda Hamilton, Robert Patrick, and Edward Furlong, it is the sequel to The Terminator (1984) and is the second installment in the Terminator franchise. In the film, the malevolent artificial intelligence Skynet sends a Terminator—a highly advanced killing machine—back in time to 1995 to kill the future leader of the human resistance John Connor, when he is a child. The resistance sends back a less-advanced, reprogrammed Terminator to protect Connor and ensure the future of humanity.</p><p>The Terminator was considered a significant success, enhancing Schwarzenegger's and Cameron's careers, but work on a sequel stalled because of animosity between the pair and Hemdale Film Corporation, which partially owned the film's rights. In 1990, Schwarzenegger and Cameron persuaded Carolco Pictures to purchase the rights from The Terminator producer Gale Anne Hurd and Hemdale, which was financially struggling. A release date was set for the following year, leaving Cameron and Wisher seven weeks to write the script. Principal photography began from October 1990 to March 1991, taking place in and around Los Angeles on an estimated $94–102 million budget, making it the most-expensive film made at the time. The advanced visual effects by Industrial Light & Magic (ILM), which include the first use of a computer-generated main character in a blockbuster film, resulted in a schedule overrun. Theatrical prints were not delivered to theaters until the night before its July 3, 1991 release.</p><p>Terminator 2 earned $519–520.9 million, making it the highest-grossing film of 1991 worldwide, and the third-highest-grossing film of its time. Critics praised the visual effects, action sequences and cast, especially Patrick's performance as the T-1000 as a great cinematic villain, while criticism was directed towards the film's violence. Terminator 2 won several accolades, including Saturn, BAFTA, and Academy awards. Terminator 2 merchandise includes video games, comic books, novels, and T2-3D: Battle Across Time, a live-action attraction.</p><p>Terminator 2 is considered one of the best films ever made, and one of the best science-fiction, action, and sequel films, as well as equal to or better than The Terminator. It is also seen as one of the most influential visual effects films of all time, beginning the transition from practical effects to reliance on computer-generated imagery. Although Cameron intended for Terminator 2 to be the end of the franchise, it was followed by a series of sequels, including Terminator 3: Rise of the Machines (2003), Terminator Salvation (2009), Terminator Genisys (2015), and Terminator: Dark Fate (2019), as well as a 2008 television series.</p>"
  },
  "plotFull": {
    "plainText": "Terminator 2: Judgment Day is a 1991 American science-fiction action film directed by James Cameron, who co-wrote the script with William Wisher. Starring Arnold Schwarzenegger, Linda Hamilton, Robert Patrick, and Edward Furlong, it is the sequel to The Terminator (1984) and is the second installment in the Terminator franchise. In the film, the malevolent artificial intelligence Skynet sends a Terminator—a highly advanced killing machine—back in time to 1995 to kill the future leader of the human resistance John Connor, when he is a child. The resistance sends back a less-advanced, reprogrammed Terminator to protect Connor and ensure the future of humanity.\r\nThe Terminator was considered a significant success, enhancing Schwarzenegger's and Cameron's careers, but work on a sequel stalled because of animosity between the pair and Hemdale Film Corporation, which partially owned the film's rights. In 1990, Schwarzenegger and Cameron persuaded Carolco Pictures to purchase the rights from The Terminator producer Gale Anne Hurd and Hemdale, which was financially struggling. A release date was set for the following year, leaving Cameron and Wisher seven weeks to write the script. Principal photography began from October 1990 to March 1991, taking place in and around Los Angeles on an estimated $94–102 million budget, making it the most-expensive film made at the time. The advanced visual effects by Industrial Light & Magic (ILM), which include the first use of a computer-generated main character in a blockbuster film, resulted in a schedule overrun. Theatrical prints were not delivered to theaters until the night before its July 3, 1991 release.\r\nTerminator 2 earned $519–520.9 million, making it the highest-grossing film of 1991 worldwide, and the third-highest-grossing film of its time. Critics praised the visual effects, action sequences and cast, especially Patrick's performance as the T-1000 as a great cinematic villain, while criticism was directed towards the film's violence. Terminator 2 won several accolades, including Saturn, BAFTA, and Academy awards. Terminator 2 merchandise includes video games, comic books, novels, and T2-3D: Battle Across Time, a live-action attraction.\r\nTerminator 2 is considered one of the best films ever made, and one of the best science-fiction, action, and sequel films, as well as equal to or better than The Terminator. It is also seen as one of the most influential visual effects films of all time, beginning the transition from practical effects to reliance on computer-generated imagery. Although Cameron intended for Terminator 2 to be the end of the franchise, it was followed by a series of sequels, including Terminator 3: Rise of the Machines (2003), Terminator Salvation (2009), Terminator Genisys (2015), and Terminator: Dark Fate (2019), as well as a 2008 television series.\r\nPlot\r\nIn 2029, Earth has been ravaged by the war between the malevolent artificial intelligence Skynet and the human resistance. Skynet sends the T-1000—an advanced, prototype, shape-shifting Terminator made of virtually indestructible liquid metal—back in time to kill the resistance leader John Connor when he is a child. To protect Connor, the resistance sends back a reprogrammed T-800 Terminator, a less-advanced metal endoskeleton covered in synthetic flesh.\r\nIn 1995 Los Angeles, John's mother Sarah has been incarcerated at the Pescadero State Hospital for her violent, fanatical efforts to prevent \"Judgment Day\"—the prophesied events of August 29, 1997, when Skynet will gain sentience and, in response to its creators' attempts to deactivate it, incite a nuclear holocaust. John, taken in by his foster parents, considers Sarah's beliefs to be delusional and resents her efforts to prepare him for his future role.\r\nThe T-800 and the T-1000 converge on John in a shopping mall and a chase ensues. John and the T-800 escape together. John calls to warn his foster parents but the T-800 deduces the T-1000 has already killed them. Realizing the T-800 is programmed to obey him, John forbids it from killing people and orders it to save Sarah from the T-1000. The T-800 and John intercept Sarah during an escape attempt but Sarah flees in horror because the T-800 resembles the Terminator that was sent to kill her in 1984. John and the T-800 persuade her to join them, and they escape the pursuing T-1000. Although distrustful of the T-800, Sarah uses its knowledge of the future to learn that a revolutionary microprocessor, being developed by Cyberdyne Systems engineer Miles Dyson, will be crucial to Skynet's creation.\r\nOver the course of their journey, Sarah sees the T-800 serving as a friend and father figure to John, who teaches it catchphrases and hand signs while encouraging it to become more human-like. Sarah plans to flee with John to Mexico until a nightmare about Judgment Day convinces her to kill Dyson, whom she assaults in his home, but finds she cannot kill him and relents. John arrives and reconciles with Sarah while the T-800 convinces Dyson of the future consequences of his work. Dyson reveals his research has been reverse engineered from the damaged CPU and severed arm of the 1984 Terminator. Believing his work must be destroyed, Dyson, Sarah, John, and the T-800 break into Cyberdyne, retrieve the CPU and the arm, and set explosives to destroy the lab. The police assault the building and fatally shoot Dyson, but he detonates the explosives as he dies. The T-1000 pursues the surviving trio, cornering them in a steel mill.\r\nSarah and John split up to escape while the T-1000 mangles the T-800 and briefly deactivates it by destroying its power source. The T-1000 assumes Sarah's appearance to lure out John but Sarah intervenes and, along with the reactivated T-800, pushes it into a vat of molten steel, where it disintegrates. The T-800 explains it must also be destroyed to prevent it from serving as a foundation for Skynet. Despite John's tearful protests, the T-800 persuades him its destruction is the only way to protect their future. Sarah shakes the T-800's hand and, having come to respect it, helps lower it into the vat. Before its destruction, the T-800 gives John a thumbs-up. As Sarah drives down a highway with John, she reflects on her renewed hope for an unknown future, musing if the T-800 could learn the value of life, so can humanity.\r\nCast\r\nArnold Schwarzenegger as the Terminator: a reprogrammed Model 101 Series 800 \"T-800\" Terminator that is composed of living tissue over a metal endoskeleton\r\nLinda Hamilton as Sarah Connor: a self-trained soldier who is dedicated to preventing the rise of Skynet\r\nEdward Furlong as John Connor: Sarah's son who is destined to lead the human resistance in opposition to Skynet\r\nRobert Patrick as T-1000: an advanced, shape-shifting, prototype Terminator that is composed of liquid metal\r\nEarl Boen as Dr. Silberman: Sarah's doctor at Pescadero State Hospital\r\nJoe Morton as Miles Bennett Dyson: Director of special projects at Cyberdyne Systems Corporation\r\nThe film's cast also includes Jenette Goldstein and Xander Berkeley as John's foster parents Janelle and Todd Voight; Cástulo Guerra as Sarah's friend Enrique Salceda; S. Epatha Merkerson and DeVaughn Nixon as Dyson's wife Tarissa and son Danny; and Danny Cooksey as John's friend Tim. Hamilton's twin sister Leslie Hamilton Gearren appears as the T-1000 impersonating Sarah when Hamilton is also on-screen. Twins Don and Dan Stanton portray a guard at Pescadero State Hospital and the T-1000 imitating him.\r\nOther cast members includes Ken Gibbel as an abusive orderly; Robert Winley, Ron Young, Charles Robert Brown, and Pete Schrum as men who confront the T-800 in a biker bar; Abdul Salaam El Razzac as Gibbons, a Cyberdyne guard; and Dean Norris as the SWAT team leader. Michael Edwards portrays the John Connor of 2029 and Hamilton's twenty-month-old son Dalton Abbott portrays an infant John in a dream sequence. Co-writer William Wisher cameos as a man photographing the T-800 in the mall, and Michael Biehn reprises his role as resistance soldier Kyle Reese in scenes that were removed from the theatrical release.\r\nProduction\r\nDevelopment\r\nThe Terminator had been a surprise hit, earning $78.4 million against its $6.4 million budget, confirming Schwarzenegger's status as a lead actor and making director James Cameron a credible director. Schwarzenegger expressed interest in a sequel, saying \"I always felt we should continue the story ... I told that right after we finished the first film.\" Cameron said Schwarzenegger had always been more enthusiastic about a sequel than he was, because he had said everything he wanted to with the original.\r\nDiscussions to make a sequel stalled until 1989, in part due to Cameron's work on other films such as Aliens (1986) and The Abyss (1989), but also due to a fallout with rights holder Hemdale Film Corporation. Hemdale co-founder John Daly had attempted to alter the ending of The Terminator against Cameron's wishes, nearly resulting in a physical confrontation. A sequel, however, could not be made without Hemdale's approval; Cameron had surrendered 50% of his rights to the company to get The Terminator made. Cameron had also sold half of the remaining stake to his ex-wife Gale Anne Hurd, producer and co-writer on the first film, for $1 following their 1989 divorce. By 1990, Hemdale was being sued by Cameron, Schwarzenegger, Hurd, and special-effects artist Stan Winston for unpaid profits from The Terminator.\r\nSchwarzenegger, aware Hemdale was experiencing financial difficulties, persuaded Carolco Pictures to pursue the purchase of The Terminator rights, having worked with the independent film studio on the big-budget, science-fiction film Total Recall (1990). Owner Mario Kassar described the rights acquisition as the most-difficult deal Carolco ever conducted. He accepted a $10 million offer for Hemdale's share, considering it a sum fabricated to ward him off, and paid Hurd $5 million for her share. Prior to development, the total cost of the acquisition came to $17 million after factoring in incidental costs.\r\nKassar told Cameron that in order to recoup his investment, the film would proceed with or without him, offering Cameron $6 million to be involved and write the script. The film would become a collaboration between several production studios: Carolco, Le Studio Canal+, Cameron's Lightstorm Entertainment, and Hurd's Pacific Western Productions. The minimum estimated cost to produce Terminator 2 was $60 million, dwarfing the $6.5 million budget of the first film, but Kassar called it a \"ghost\" number; he was aware the figure would increase because of Cameron's previous work. News sources labeled Terminator 2 the most-expensive independent film ever and predicted it would \"bankrupt Carolco\". However, Kassar claimed to have secured 110% of the budget funding needed through pre-sales to markets outside the US, as well as television, home-video, and theatrical distribution rights. The studio also had an existing U.S. distribution deal with TriStar Pictures for a set percentage of the budget—an estimated $4 million. TriStar stipulated that the film be ready for release by May 27, 1991, Memorial Day.\r\nWriting\r\nWith a set scheduled release date, Cameron had six-to-seven weeks to write the sequel; he approached his frequent collaborator and The Terminator co-writer William Wisher Jr. in March 1990. They spent two weeks developing a film treatment based on Cameron's vision to form a relationship between John Connor and the T-800, a concept Wisher initially believed was a joke. Their treatment diverged from the \"science-fiction slasher\" theme of the original, instead focusing on the unconventional family bond formed between Sarah, John, and the T-800. Cameron said this relationship is \"the heart of the movie\", comparing it to the Tin Man receiving a heart in The Wizard of Oz (1939).\r\nCameron's initial concept had Skynet and the resistance each sending a T-800—both played by Schwarzenegger—into the past; one to kill John and the other to protect him. Wisher believed a fight between two identical Terminators would be boring. The pair also briefly considered a larger \"Super-Terminator\", which ultimately did not keep their interest. Instead, they adopted an early idea Cameron had for The Terminator, which involved a liquid-metal Terminator that looked like an average human in contrast to Schwarzenegger's large frame. The first half of the story would end with the destruction of Skynet's T-800, forcing it to use the T-1000, its ultimate weapon. Although he once considered removing the T-1000 altogether, Cameron later solidified it as the only antagonist. Writers had the T-1000 take on the appearance of a police officer, allowing it to operate with less suspicion. Cameron added that the decision was also thematically relevant, comparing an authority figure to the human tendency to lose compassion and become machine-like. Wisher found it challenging to depict the T-800 as \"good\" without making it non-threatening at the same time. The pair decided to give it the ability to learn and develop emotions, becoming more human over time.\r\nWisher developed the first half of the treatment at Cameron's home over the course of four weeks, while Cameron worked on the latter half. Many pages were removed, including a \"convoluted\" subplot about Dyson and a massacre of a camp of survivalists helping Sarah. Cameron, who did not consider the budget while writing, had to cut some elaborate scenes, including a nine-minute opening that showed a time-travel machine being used in 2029. Wisher and Cameron also frequently conferred with special-effects studio Industrial Light & Magic (ILM) to determine which ideas were achievable.\r\nCameron and Wisher analyzed the first film to help envision each character's development and evolution. Cameron believed Sarah's knowledge of the future would isolate her, forcing her to associate with survivalists and become a self-sufficient commando. She was written to have become an emotionally cold and distant character comparable to a Terminator, especially when deciding to go after Dyson. Instead of beginning the story with Sarah, John is placed with a foster family to increase tension. John's character was inspired by the 1985 Sting song, \"Russians\", with Cameron recalling, \"I remember sitting there once, high on E ... I was struck by 'I hope the Russians love their children too'. And I thought, 'You know what? The idea of a nuclear war is just so antithetical to life itself'. That's where came from\". Cameron wanted to make the Terminator a protagonist, because he found it uninteresting to repeat the character of The Terminator. They kept the T-800's dialogue brief, relying on the audience to infer a lot of meaning through \"small bites\". Its catchphrase, \"Hasta la vista, baby\", was something Wisher and Cameron said after their telephone calls. They spent three days refining the script, and the printed copy was still warm when Cameron boarded Carolco's charter jet on the way to Cannes, where Terminator 2 was announced in early May 1990. Schwarzenegger initially struggled with portions of the script, once asking \"What is 'polyalloy'?\" He also expressed concern about the character's non-lethal depiction, which appeared to conflict with his action-hero persona and his portrayal of the character in the first film. Cameron explained he wanted to defy audience expectations. Schwarzenegger requested: \"Just make me cool\".\r\nCasting\r\nSchwarzenegger became interested in reprising his role after finding the character more complex and sympathetic than in the previous film, although he found portraying a fearless, emotionless machine difficult. He extensively rehearsed action scenes with stunt coordinator Joel Kramer to minimize the effects of fire and explosions occurring around him. Schwarzenegger earned $12–$15 million for his involvement. Carolco had been blamed for the increase in exorbitant salaries paid to actors, having paid Schwarzenegger around $11 million for Total Recall (1990). They justified the expense as the value of their leads' wide appeal in markets outside the U.S. To lessen the immediate financial burden, Carolco paid most of Schwarzenegger's salary with a financed, $12.75 million Gulfstream III jet, allowing them to settle the fee over several years.\r\nCameron refused to re-cast Hamilton's role but developed plans to work around her absence if she chose not to return. Negotiations were initially protracted but were settled promptly after Cameron informed Carolco the script could not be finished until he knew if Hamilton would be involved. Hamilton received roughly $1 million, which she described as \"quite a bit more\" than her earnings for The Terminator but expressed disappointment at the pay disparity between her and Schwarzenegger. She requested Sarah to be \"crazy\", stating, \"I thought, 'This woman has been living with the certainty of man's demise for all these years and she'd have become this wild thing', so the warrior and the crazy woman ideas were all me\". She continued: \" is a better human than I am, and I'm a better Terminator than he is\". Cameron considered giving the character a facial scar but determined applying it daily would be difficult. Hamilton undertook extensive preparation for her role, working with a personal trainer for three hours a day, six days a week, and maintaining a strict, low-fat diet, losing about 12 pounds (5.4 kg) of body weight. She also received judo and military training from former Israeli commando Uziel Gal. Over the course of the six-month shoot, Hamilton also spent time each day with her twenty-month-old son Dalton and averaged only four hours of sleep at night. She described her experience as \"sheer Hell\" but enjoyed showing off her new physique. Hamilton's twin sister, Leslie, was also cast in scenes where two versions of Sarah appear on-screen simultaneously.\r\nPatrick, who was living in his car, was one of several actors in their late 20s considered for the T-1000 role. Cameron wanted a lithe actor who could resemble a newly recruited police officer to contrast with Schwarzenegger; according to Cameron, \"If the series is a kind of human Panzer tank, then the series had to be a Porsche\". Casting director Mali Finn believed Patrick, whose agent described him as a cross of David Bowie and James Dean, had the \"intense presence\" they wanted. Patrick auditioned by acting like an emotionless hunter and later participated in a screen test to judge the way lighting worked with his skin and eyes. For his character, he drew inspiration from Schwarzenegger's performance in The Terminator and observed the movement of hunting creatures—reptiles, insects, cats, and sharks. Patrick's facial expressions were based on those of an eagle, keeping his head tilted down to imply constant forward movement. He also employed a mixture of military posture with martial arts to express a fluid motion that differed from the T-800's rigid movements. The role demanded Patrick to be lean and fast, requiring peak physical shape. He learned to sprint without displaying heavy breathing and exhaustion, and like Hamilton, he received specialized training from Gal. Weapons master Harry Lu taught Patrick to operate and reload weapons, such as the T-1000's Beretta 92FS, without looking and eventually without blinking. Singer Billy Idol was originally cast for the role before a motorbike accident seriously injured his leg. In a 2021 retrospective, Cameron said Idol had an interesting aesthetic but in hindsight, he probably would not have cast him. Singer Blackie Lawless of the rock band W.A.S.P. was also considered but deemed too tall.\r\nCameron believed that early candidates for the role of John Connor were either overexposed in other media or came from advertisement backgrounds, which trained them to be happy and perky. Furlong had no acting experience and was discovered by Finn at the Boys & Girls Club in Pasadena. Cameron described Furlong as having a \"surliness, an intelligence, just a question of pulling it out\". Furlong, among hundreds of other prospects, secured the role at his last audition. He was required to take acting lessons, learn some Spanish, and be able to ride a motorcycle and repair guns. Joe Morton said he believed his casting as Miles Bennett Dyson had to do with Cameron wanting a minority character to be integral to the changing of the world. Morton avoided interacting with the cast so that their on-screen relationships would seem believably distant. The role of Dyson was reduced after the preferred casting choice, Denzel Washington, declined it; the role required little from him except to act scared.\r\nFilming\r\nThree months of pre-production was truncated to meet the release schedule, leaving Cameron without the time he wanted to prepare all aspects before filming began. Over one week, he spent several hours each day choreographing vehicle scenes with toy cars and trucks, filming the results, and printing the footage for storyboard artists. There was no time to properly test practical effects before filming; if effects did not work, the filmmakers had to work around them.\r\nPrincipal photography began on October 8–9, 1990, with a $60 million budget. The production was long and arduous, in part because of Cameron, who was known for his short temper, and uncompromising and \"dictatorial\" manner that resulted in the crew making T-shirts bearing the slogan \"You can't scare me—I work for Jim Cameron\". Schwarzenegger described him as a supportive but \"demanding taskmaster\" with a \"fanaticism for physical and visual detail\". Cameron had a practical approach when making scenes fit his vision; in one instance, he angrily fixed a broken camera when the operator could not, and Morton said during his death scene, Cameron decided on a whim to detonate surrounding glass to see how it would look. Because of the tight schedule, Cameron worked throughout Christmas, editing on Christmas Eve, and persuaded Schwarzenegger to cancel multiple Christmas events and a visit to American troops in Saudi Arabia with U.S. President George H. W. Bush to film his scenes. By the 101st day of filming, Schwarzenegger and Hamilton were frustrated by the number of takes Cameron ordered; five days were spent on Hamilton's close-ups in scenes at the Dyson home. Scenes were filmed out of sequence to prioritize those requiring extensive visual effects; Schwarzenegger found this difficult because he was meant to convey subtle signs of the T-800's progressive humanity and was unsure what was fitting for each scene. Cinematographer Adam Greenberg, who also worked on The Terminator, described the greater scope of the sequel as the most daunting prospect; where he had been able to shout instructions to his crew on the original film, he used one of 187 walkie-talkies to conduct efforts over an expansive area.\r\nThe production used many locations in and around California. The now-destroyed Corral bar in Sylmar is where the T-800 confronts a group of bikers. Location manager Jim Morris chose Corral because it was raised above ground, allowing the scene to take place over different levels. On one occasion, a woman who was oblivious to ongoing filming walked into the bar; when she asked Schwarzenegger, who was wearing only a pair of shorts, what was going on, he replied: \"It's male-stripper night\". Executives suggested cutting the scene to save money but Cameron and Schwarzenegger refused.\r\nThe T-1000 arrives at the Sixth Street Viaduct, John hacks an ATM at a bank in Van Nuys, and his foster parents' home is in the Canoga Park neighborhood—which was chosen because it looked generic. The Terminators confront John inside Santa Monica Place mall, although exterior shots were filmed at Northridge Fashion Center where there was less traffic. When the on-foot T-1000 chases John on a bicycle, Patrick's training made him faster than the bicycle and so its speed was increased. The T-1000 pursues John and the T-800 in a truck at Bull Creek spillway in North Hills. Other locations include the Lake View Terrace hospital, which was used for Pescadero State Hospital, and Petersen Automotive Museum became its garage; Cactus Jack's Market in Lancaster, California, Elysian Park—the site of Sarah's apocalyptic dream—and Dyson's home was near California State Route 1 in Malibu. The Cyberdyne Building destroyed in the film was an abandoned office in San Jose that was scheduled for demolition. Cameron used real Los Angeles Police Department SWAT members in the scene, although he embellished their real tactics for a more visually interesting assault.\r\nThe final highway chase was filmed along the Terminal Island Freeway near Long Beach, of which a 2.5-mile (4.0 km) stretch was shut nightly for two weeks. The future war of 2029 was filmed in the rubble of an abandoned steel mill in Oxnard, California, in a space one-half square mile (1.3 km2) that was enhanced with burned bicycles and cars from a 1989 fire at the Universal Studios Lot, and with effects such as flying vehicles added in post-production. Terminator 2's ending was filmed in the closed Kaiser Steel mill in Fontana, which Greenberg made appear operational mainly through lighting techniques. Despite appearing to be actively smelting steel, the mill was frigid and dangerous because of the moving machinery and high catwalks. The T-800's thumbs-up during his death was added during filming; Hamilton believed it was too sentimental. Six months of filming concluded on March 28, 1991, about three weeks behind schedule. Hamilton described the production as the most \"difficult, exhausting, physically, and emotionally stressful experience of my life\". She suffered permanent partial hearing loss after forgetting to wear earplugs in the scene in which the T-800 fires a gun in the hospital elevator, and experienced shell shock from months of exposure to violence, loud noise, gunfire, and action set-pieces.\r\nPost-production\r\nTerminator 2 was edited by Conrad Buff IV, Richard A. Harris, and Mark Goldblatt, who said although there was more time to edit than on The Terminator, it was still relatively small given the greater scope of the sequel; they described the complexity of scenes such as the final battle between the Terminators, which required a seamless combination of live-action, practical effect shots, and CGI. After having to rush editing at the end of The Abyss, Cameron limited filming on Terminator 2 to five days a week so he could edit the film on weekends from the start of filming. Several scenes were deleted, in part to reduce its running time; these include Kyle Reese appearing to Sarah in a dream and encouraging her to continue fighting; Sarah being beaten in the hospital; the T-1000 killing John's dog (a scene the animal-loving Patrick was not a fan of); John teaching the T-800 to smile and discussing whether it fears death; the T-1000 malfunctioning after being frozen in the steel mill; and additional scenes with Dyson's family. Schwarzenegger unsuccessfully rallied to retain his favorite scene, in which John and Sarah modify the T-800's CPU, allowing it to learn and evolve. Sarah attempts to destroy the CPU but John defends the T-800. The scene was replaced with dialogue indicating the T-800 already possesses the ability to learn. The scripted ending depicted an alternative 2029 that was filmed at the Los Angeles Arboretum in Arcadia, in which an aged Sarah narrates how Skynet was never created while John, now a senator, plays with his daughter. To make the film more evocative and memorable, Cameron changed this scene to one in which the characters look out at the road ahead. The production ran until about two days before the film's theatrical release; delays were mainly caused by the rendering of shots at Consolidated Film Industries, the most difficult of which was the T-1000's death. Co-producer Stephanie Austin said the production crew worked twenty-four-hour shifts and slept on site. The release print was delivered to theaters the night before its release. The film runs for 137 minutes.\r\nCameron and Schwarzenegger said the final budget, excluding marketing, was about $70 million, and the cost of making the film was about $51 million. According to Carolco executives Peter Hoffman and Roger Smith, the film cost $75 million figure before marketing, saying Terminator 2 was only \"modestly\" over budget. Including marketing and other costs, the film's total budget is reported to be between $94 million and $102 million. This figure was reduced by advances and guarantees of $91 million, including North-American television ($7 million) and home-video ($10 million) rights, and $61 million from theatrical and television rights outside the U.S.\r\nSpecial effects and design\r\nA 10-month schedule and about $15–$17 million of Terminator 2's budget was allocated to the entirety of its special effects, including $5 million for the T-1000 alone, and a further $1 million for stunts, at the time one of the largest-ever stunt budgets. Four main companies were involved in creating the 150 visual effects: ILM under special effects supervisor Dennis Muren managed the computer-generated imagery (CGI) effects, Stan Winston Studio the prosthetics and animatronics, Fantasy II Film Effects developed miniatures and optical effects, and 4-Ward Productions were responsible for creating a nuclear explosion effect. Pacific Data Images and Video Image provided some additional effects. The cost of producing CGI and practical limitations of staff numbers meant the effect was using sparingly, appearing in 42–43 shots, alongside 50–60 practical effects.\r\nProduced near the advent of CGI, vivifying the T-1000 was a risky endeavor as there was no backup plan in place if the CGI did not work as intended or could not be composited effectively with Winston's practical effects. The computer systems needed to animate and render the T-1000 CGI cost thousands of dollars alone, but creating the character also relied on a variety of practical appliances, visual illusions, and filming techniques. A team of up to 35 at ILM were required for the five minutes of screen time the T-1000's effects appear, and the process was so complex that rendering 15 seconds of footage would take up to ten days.\r\nMusic\r\nThe Terminator composer Brad Fiedel returned for the sequel, working in his garage in Studio City, Los Angeles. Film industry professionals regarded his return with concern and skepticism; they believed his style would not suit the film. Fiedel quickly realized he would not receive the finished footage until late in the production after most effects were completed, which made it difficult to commit to decisions such as use of an orchestra because, unlike ambient music, the score had to accompany the on-screen action. Fiedel and Cameron wanted the musical tone to be \"warmer\" due to its focus on a nobler Terminator and young John. Fiedel experimented with sounds and shared them with Cameron for feedback.\r\nWhile The Terminator score had mainly used oscillators and synthesizers, Fiedel recorded real instruments and modified their sounds. He developed a library of sounds for characters such as the T-1000, whose theme was created by sampling brass-instrument players warming up and improvising. Fiedel said to the players, \"You're an insane asylum. You're a bedlam of instruments.\" He slowed down the resulting sample and lowered the pitch, describing it as \"artificial intelligent monks chanting\". Cameron considered the \"atonal\" sound \"too avant-garde\" for him but Fiedel justified it as an accompaniment to Cameron, who was making a film \"people have never seen before\".\r\nTri-Star asked Schwarzenegger to arrange a tie-in music video and theme song for the film; he chose to work with rock band Guns N' Roses because they were popular and there was \"a rose in the movie and bloody guns\". The band offered the use of \"You Could Be Mine\", the debut single from their album Use Your Illusion II (1991). The music video, featuring Schwarzenegger as the T-800 pursuing the band, was directed by Stan Winston, Andrew Morahan, and Jeffrey Abelson. Patrick unsuccessfully lobbied to use \"Head Like a Hole\" by Nine Inch Nails as the tie-in song, in part because his brother, Richard Patrick, was their tour guitarist. Wisher suggested using \"Bad to the Bone\" by George Thorogood & the Destroyers as the T-800 puts on the biker clothes; although Cameron did not like the idea, Wisher said he later found Cameron had used the song but had forgotten it was his idea. \"Guitars, Cadillacs\" by Dwight Yoakam also features in Terminator 2.\r\nRelease\r\nContext\r\nCompetition between studios was expected to be strong during the summer theatrical season, which ran from mid-May to early September, with fifty-five films scheduled for release compared with thirty-seven in 1990. Release dates repeatedly changed as studios attempted to avoid strong competition and maximize their films' successes at a time when the cost of film production had increased 20% in a year, in part due to costly salaries for stars who also commanded a percentage of the film's profits, and declining revenues from box-office receipts, video sales, and television-network deals. Films scheduled for release included City Slickers, The Naked Gun 2½: The Smell of Fear, Only the Lonely, Hudson Hawk, The Rocketeer, What About Bob?, and Point Break. The films most expected to do well included Backdraft and Terminator 2, which were seen as having international appeal, Dying Young, and the year's predicted top film Robin Hood: Prince of Thieves. An unnamed studio executive said audiences were seeking escapist entertainment such as comedy or action, and avoiding films about less-positive subject matter.\r\nMarketing and promotion\r\nSchwarzenegger was involved in Terminator 2's marketing and merchandising campaign, which was estimated to be worth at least $20 million. By 1991, advertising for Terminator 2 was ubiquitous with high audience recognition and despite its U.S. R rating, restricting audiences to over-17s unless accompanied by an adult, the marketing was mainly aimed at younger audiences. Tristar contributed about $20 million for marketing, which included a $150,000 teaser trailer that was directed by Winston and depicts the construction of a T-800. Trailers ran for six months before the film's release; Tristar incentivized cinema staff to play it frequently by offering chances to win Terminator 2-branded goods and tickets to the premiere. Collaborations with fast-food restaurants and soft-drink manufacturers such as Subway and Pepsi, were used to promote the film.\r\nThere were two private screenings: one for family, friends, and crew at Skywalker Ranch and another in Los Angeles for studio executives. Austin said, \"People were stamping their feet and clapping for ten or fifteen minutes\", at which point the crew knew they had succeeded. During test screenings the ending was well received, and was described as a \"touching\" favorite scene. The premiere took place on July 1, 1991, at the Cineplex Odeon in Century City, Los Angeles. According to Fiedel, it was treated as a major event, unlike the premiere of The Terminator, at which the audience was skeptical or laughed at the wrong times. Celebrities in attendance included Maria Shriver, Nicolas Cage, Sylvester Stallone, Sharon Stone, Michael Douglas, and Furlong's date Soleil Moon Frye.\r\nBox office\r\nTerminator 2: Judgment Day opened in the United States and Canada on July 3, leading into the Independence Day holiday weekend. It had the highest-grossing Wednesday opening with $11.8 million. Between Friday and Sunday, the film grossed $31.8 million from 2,274 theaters, an average of $13,969 per theater, making it the number-one film of the weekend ahead of The Naked Gun 2½ ($11.6 million) in its second weekend and Robin Hood: Prince of Thieves ($10.3 million) in its fourth. Over the five-day holiday weekend (Wednesday to Sunday), Terminator 2 grossed $52.3 million, becoming the second-highest opening five-day total ever behind Batman's $57 million in 1989, It set a record opening for an R-rated film and for a Independence Day weekend. The opening-week audience was evenly split between adults, teenagers, and children, about 25%–30% of whom were females, although Tri-Star said the figure was higher. The film benefited from repeat viewings by young audience members. One theater chain executive said: \"... nothing since Batman has created the frenzy for tickets we saw this weekend with Terminator. At virtually all our locations, we are selling out ... the word-of-mouth buzz out there is just phenomenal.\" Industry professional Lawrence Kasanoff said it was an \"open secret\" that despite the R rating, children were seeing the film, remarking \"When T2 opened, I saw kids skateboard up to the ticket window ...\"\r\nIt retained the number-one position in its second weekend, grossing $20.7 million, ahead of the debuts of One Hundred and One Dalmatians ($10.3 million) and Boyz n the Hood ($10 million); and in its third weekend with $14.9 million, ahead of Bill & Ted's Bogus Journey ($10.2 million) and One Hundred and One Dalmatians ($7.8 million). Terminator 2: Judgment Day fell to number two in its fifth weekend, grossing $8.6 million against the debut of the comedy Hot Shots! ($10.8 million). It remained in the top-five highest-grossing films for twelve consecutive weeks and the top-ten highest-grossing films for fifteen weeks. In total, Terminator 2: Judgment Day spent about twenty-six weeks in theaters in a total of 2,495 cinemas, and grossed $204.8 million, making it the highest-grossing film of the year; ahead of Robin Hood: Prince of Thieves ($165 million), Beauty and the Beast ($145 million), and The Silence of the Lambs ($130 million). This also made it the thirteenth-highest-grossing film of its time, behind Back to the Future (1985), and the highest-grossing R-rated film. The Los Angeles Times estimated after the theater and distributor cuts, the box-office returns to Carolco would be well over twenty percent of the film's cost.\r\nOutside the U.S. and Canada, Terminator 2: Judgment Day set numerous box office records. In the United Kingdom it had a record three-day opening weekend of $4.4 million (and a one-week record of $7.8 million) and went on to gross at least $30 million. In France it grossed a record $9.5 million in its opening week (the biggest opening since Rocky IV) and $16 million in two weeks. In Germany it grossed a record $8 million in five days and also had a record Australian opening weekend of $1.9 million. In Thailand it was the highest-grossing western-hemisphere film ever with a gross of $1.2 million. The film also performed well in Brazil and grossed at least $51 million in Japan. Internationally, the film grossed about $312.1 million, making it the first film to gross over $300 million outside of the U.S. and Canada.\r\nTerminator 2: Judgment Day is estimated to have grossed a worldwide total of $519–$520.9 million, making it the year's highest-grossing film, and the third-highest-grossing film ever, behind 1977's Star Wars ($530 million) and 1982's E.T. the Extra-Terrestrial ($619 million).\r\nReception\r\nCritical response\r\nTerminator 2: Judgment Day was released to general acclaim. Many reviews focused on the state-of-the-art physical, special, and make-up effects, which were roundly praised as \"revolutionary\" and \"spectacular\", particularly those relating to the T-1000 as a \"technological wonder\". Several publications wrote Cameron's ability to realize cinematic action blockbusters was unmatched; Janet Maslin said at his best, despite occasional lapses into melodrama, Cameron's work is akin to that of director Stanley Kubrick. Both Maslin and The Austin Chronicle commented on the kindness and compassion in the film; The Austin Chronicle contrasted it to the lack of a moral message in The Terminator and Travers described it as a \"visionary parable\" but they, alongside others, criticized Terminator 2's \"muddled\" message about protecting the value of human life and peace by using extreme violence to prevent the use of nuclear weapons, war, and technological reliance.\r\nReviewers generally agreed the narrative early in the film is stronger than the one near the end. Owen Glieberman said the first hour has a genuine \"emotional pull\" and according to Roger Ebert, the initial concept of a boy finding a father figure in a Terminator that is learning to be human is \"intriguing\", but Glieberman said the narrative weakens once Hamilton's character joins the group; Travers and Corliss wrote it stumbles after hours of relentless action and a \"conventional climax\". Despite this observation, Glieberman praised the final battle between the T-1000 and the protagonists. Empire's review and Terrence Rafferty found the film's narrative less satisfying and idea-driven than that of The Terminator; Glieberman said despite it being an effective and witty thriller, Terminator 2: Judgment Day comes across as an expensive B movie when compared with \"visionary spectacles\" such as the Mad Max series and RoboCop (1987). Kenneth Turan said Terminator 2's action scenes succeed without the extreme gore and violence of RoboCop.\r\nEbert and Maslin, among others, appreciated the twist on Schwarzenegger's public action-hero persona by making him a hero who does not kill his enemies; David Ansen and Glieberman found humor in the T-800's non-lethal methods and efforts to become more human-like. Maslin and Hinson agreed, as in The Terminator, Schwarzenegger's role is perfect for his acting abilities; Hinson said Schwarzenegger portrayed more humanity as a machine than he did when portraying normal people. In contrast, Empire suggested the change was a concession to Schwarzenegger's young fans and Peter Travers chose the T-800's death as a \"cornball\" scene that is out of place for the actor and film.\r\nSeveral reviewers praised the T-1000 character for the combination of Patrick's \"chilling\" expressionless performance and the advanced special effects, which create an implacable, \"showstopping\" villain; Empire called the character \"one of the great monsters of the cinema\". Glieberman said the character's absence from much of the film's second act is to the film's detriment, and Hinson wrote the T-1000 lacks any \"soul\" and thus a way for the audience to identify with it. Critics generally agreed Hamilton portrays a \"fierce\" female hero with an impressive physique that lets her outshine another female action hero, Sigourney Weaver's Ellen Ripley in Cameron's Aliens (1986). Other publications found Sarah Connor's narrations about peace to be \"heavy-handed\", overused, and \"unintentionally amusing\". Furlong was praised for giving a natural performance at a young age, and Hinson wrote despite limited screentime, Morton made an impression. Audiences polled by CinemaScore gave the film an average grade of \"A+\" on a scale of A+ to F.\r\nAccolades\r\nAt the 1992 Saturn Awards, Terminator 2: Judgment Day received awards for Best Science Fiction Film, Best Director (Cameron), Best Actress (Hamilton), Best Performance by a Younger Actor (Furlong), and Best Special Effects; and a nomination for Best Actor (Schwarzenegger). It also won Favorite Motion Picture at the 18th People's Choice Awards. For the 45th British Academy Film Awards, Terminator 2 received awards for Best Sound (Lee Orloff, Tom Johnson, Gary Rydstrom, Gary Summers) and Best Special Visual Effects (Stan Winston, Dennis Muren, Gene Warren Jr., Robert Skotak), as well as a nomination for Best Production Design (Joseph Nemec III).\r\nThe 64th Academy Awards earned Terminator 2 four awards; Best Makeup (Winston and Jeff Dawn), Best Sound (Orloff, Johnson, Rydstrom, and Summers), Best Sound Effects Editing (Rydstrom and Gloria S. Borders), and Best Visual Effects (Muren, Winston, Warren Jr., and Skotak), as well as nominations for Best Cinematography (Adam Greenberg) and Best Film Editing (Conrad Buff, Mark Goldblatt and Richard A. Harris). It was the first film to win an Academy Award when its predecessor had not been nominated. It received six awards at the 1992 MTV Movie Awards, including: Best Movie, Best Action Sequence (\"L.A. Freeway Scene\"), Best Breakthrough Performance (Furlong), Best Female Performance (Hamilton), Best Male Performance (Schwarzenegger), and nominations for Best Song From a Movie (\"You Could Be Mine\"), Best Villain (Patrick), and Most Desirable Female (Hamilton); as well as a Hugo Award for Best Dramatic Presentation (Cameron and Wisher Jr.)\r\nPost-release\r\nAftermath\r\nTerminator 2: Judgment Day began the careers or raised the profiles of its principal actors. According to industry professionals, Schwarzenegger became the top international star ahead of actors such as Mel Gibson and Tom Cruise. It also marked the start of a lasting friendship between Schwarzenegger and Cameron, who formed a \"midlife crisis motorcycle club\" and reunited for the action film True Lies (1994). Cameron and Hamilton began a romantic relationship in 1991, married in 1997, and later divorced. In 1992 Cameron was given a five-year, $500 million contract by 20th Century Fox to produce twelve films.\r\nFurlong became in high demand and Patrick found dealing with his new-found recognition difficult as people asked him to impersonate the T-1000. Despite the film's success, Carolco reported 1991 losses of $265.1 million, which was caused by the financial problems of its other films and subsidiaries; despite investor support, the studio filed for bankruptcy in 1995 and its assets, including Terminator 2, were sold to Canal Plus for $58 million.\r\nHome media\r\nIn December 1991, Terminator 2: Judgment Day was released on VHS and LaserDisc. It was a popular rental in the U.S. and Canada; a record 714,000 copies were shipped to retailers and it became the best-selling rental by mid-January 1992. A \"Special Edition\" featuring a 15-minute extended version of the film that restored deleted scenes and included interviews with cast and crew, storyboards, designs, and other unrestored deleted scenes, was released on LaserDisc in 1993. Cameron stated he did not use the label \"Director's Cut\" because he considered the theatrical releases to be definitive and the extended versions as opportunities to restore \"depth and character made omissible by theatrical running time\". The theatrical version was released on DVD in 1997. In 2000, an \"Ultimate Edition\" DVD was released, containing the theatrical and \"Special Edition\" cuts, and a new \"Extended Cut\", containing a further scene of the T-1000 inspecting John's bedroom, and the aforementioned alternate ending. Terminator 2 special effects coordinator Van Ling supervised the release. The \"Extreme Edition\" was released in 2003, featuring the theatrical and \"Special Edition\" cuts, a remastered 1080p image, Cameron's first commentary, and a documentary about the film's legacy to special effects.\r\nTerminator 2 was released on Blu-ray in 2006; this was followed in 2009 by a \"Skynet Edition\" that contains the theatrical and \"Special Edition\" cuts, and commentaries with the cast and crew. This release includes a limited collector's set containing the Blu-ray; the \"Ultimate\" and \"Extreme\" editions on DVDs; a digital download version; all extant special features; and a 14-inch (360 mm) T-800 skull bust. A 4K Ultra HD Blu-ray version that includes a standard Blu-ray and digital version, was released in 2017; this release also offered a collector's option that includes one of 6,000 life-size replicas of a T-800 skeleton forearm, each signed by Cameron and individually numbered, the soundtrack, the theatrical, \"Special\", \"Extended\", and 2017 3D remaster cuts, and \"Reprogramming the Terminator\", a documentary that includes interviews with Schwarzenegger, Cameron, Furlong, and others.\r\nIn 1991 Varèse Sarabande released Fiedel's score, which spent six weeks on the Billboard 200 record chart, peaking at number 70. The theme song \"You Could Be Mine\" peaked at number 29 on the U.S. Billboard 100, and performed well in the United Kingdom, Australia, Germany, Spain, and Canada.\r\nOther media\r\nTerminator 2: Judgment Day was marketed with numerous tie-in products, including toys, puppets, trading cards, jigsaw puzzles, clothing, a perfume named \"Hero\", and a novelization by Randall Frakes that expands on the film's ending. In 1991 Marvel Comics adapted the film into a comic book, which was followed by expansions of the Terminator 2 narrative, including Malibu Comics's \"Cybernetic Dawn\" and \"Nuclear Twilight\" (1995–1996); Dynamite Entertainment's \"Infinity\" and \"Revolution\" (2007); and the T2 novel series by S. M. Stirling in the early 2000s. Several video-game adaptations of Terminator 2 were published; these include a pinball machine and an arcade game in 1991; the arcade game was popular enough to be ported to home consoles as T2: The Arcade Game. Multiple studios developed adaptations for home consoles; these widely differing games include Terminator 2 for Game Boy and Terminator 2 for the Nintendo Entertainment System (NES); the NES version was ported to Game Gear and Sega Master System in 1992. A later adaptation was developed for the Sega Genesis and Super Nintendo Entertainment System, and a different game was published for home computers. Merchandise for Terminator 2: Judgment Day was estimated to have generated $400 million in sales.\r\nIn 1996 T2-3D: Battle Across Time, a live-action attraction, was opened at Universal Studios Florida, and later at locations in Hollywood and Japan). The twenty-minute attraction was co-written and directed by Cameron and cost $60 million to produce, including live-action stunts and a $24 million, 12-minute, 3D film starring Schwarzenegger, Hamilton, Patrick, and Furlong as their in-world characters, making it the most-expensive film per minute. In it, Sarah and John attempt to stop Cyberdyne, which has developed Skynet. They are confronted by the T-1000 but saved by the T-800, which returns to 2029 with John to defeat Skynet and its latest creation, the T-1000000.\r\n3D remaster\r\nCameron oversaw a year-long 3D remaster and subsequent 2017 theatrical re-release of Terminator 2: Judgment Day in August 2017. Cameron said: \"If you've never seen it, this'll be the version you want to see and remember\". Cameron made visual modifications to the film to fix errors that had bothered him, including the addition of windshield glass to the T-1000's truck, which fell out during its stunt fall and reappears in later scenes; concealing the obvious use of stuntmen for Furlong and Schwarzenegger during the same scene, concealed more of Patrick's nudity during his introduction, and brightened the visuals. The 3D remaster's theatrical release was seen as a disappointment, earning about $562,000 in its debut across 386 theaters compared to the 3D re-release of Cameron's Titanic in 2012, which fetched $17 million.\r\nThemes and analysis\r\nFamily and humanity\r\nA central theme of Terminator 2: Judgment Day is the relationship between John Connor and the T-800 that serves as a surrogate for the father (Kyle Reese) he never knew. Cameron said: \"Sure, there's going to be big, thunderous action sequences, but the heart of the movie is that relationship\", comparing it with the Tin Man getting a heart in The Wizard of Oz. Both Terminator 2 and Cameron's earlier film Aliens focus on compassion and parental figures; Aliens' central character Ripley serves as a surrogate mother to an orphaned girl in contrast to an alien queen and her brood, while Terminator 2 depicts the T-800's relentless protection of his ward against the equally relentless T-1000. The T-800 is designed to emulate humans for infiltration purposes but as it grows and evolves, its emotions become real and it learns from John to feel grief. The T-800 chooses to sacrifice its life to ensure the survival of everyone else. In 1991 essayist Robert Bly wrote elderly men were not offering suitable role models for young men, and in Terminator 2, Sarah denounces the many men in her past who failed to be a father for John, except for the T-800. Once its role is complete, the T-800 leaves John for his own good after stating it lacks the emotions John must rely on.\r\nWhile John teaches the T-800 about humanity, his biological mother Sarah has become less human because of her knowledge about the future. Cameron said: \"She's a sad character—a tragic character ... she believes that everyone she meets, talks to, or interacts with will be dead very soon\". This theme of machine-like humans links with Cameron's and Wisher's choice to make the T-1000 appear as a police officer because thematically they believed it represents humans who should have empathy for others becoming more machine-like and detached from their emotions. The SWAT team at Cyberdyne shoots Dyson, an African American, without warning. Cinephilia described Dyson as the most-human character in the film; according to them, he is an intelligent, optimistic family man who represents real-world encounters between police forces and people of color, compared to their encounter with the Caucasian T-800, during which they warn him before opening fire. The 1991 police beating of Rodney King was captured on the same videotape a civilian used to capture the filming of the biker bar scenes.\r\nFollowing her escape from the state hospital, Sarah appears to embrace John but is actually checking him for injuries, forgoing any emotional attachment for the practicality of ensuring his survival and bringing about his destiny as a future leader. The T-800 is portrayed as a better parent than Sarah, offering him undivided attention while Sarah remains distant and focused on the future rather than the present. Philosophy professor Richard T. McClelland notes Sarah acceptance of the T-800 as John's surrogate father is such she leaves it in control of John when she leaves to kill Dyson. Sarah's dream about the nuclear holocaust that will kill six billion people, including her son, incites her to kill Dyson before he can complete the work that will bring about Skynet but when the moment comes, she is unable to fully forsake her humanity and murder him with no emotion. Cameron described this as a question of humanity's worth if we abandon it to win the battle for its existence. Compared to the bleak, nihilistic theme of The Terminator, Terminator 2 emphasizes the concept of free will and the value of human life. Schwarzenegger quoted the film's line \"no fate but what we make\", saying people have control over their own destinies.\r\nViolence\r\nOn its release, reviewers were critical of Terminator 2: Judgment Day's message about preserving peace through violence; Owen Gleiberman stated \"reckless indifference\" to human life is intrinsic to the film but the T-800 maiming people rather than killing them potentially condemns victims of violence to a life of pain. Cameron described the film as the \"world's most violent anti-war movie\", and said it is about people struggling with their own violent natures. In particular, Cameron had been concerned by the original antagonist T-800's status as a cultural icon and power fantasy as a lethal, unstoppable force of strength and power, and chose to redefine it in Terminator 2, retaining the power fantasy without taking lives. Cinephilia said it is not morally possible to recover from killing people so Terminator 2 is about redeeming the T-800 and Sarah.\r\nMasculinity and femininity\r\nAfter the success of Aliens, the growth of female-led action films reflected the increase in women assuming non-traditional roles and the division between professional critics—who perceive a masculinization of the female hero—and audiences who embrace characters regardless of gender. The hyper-masculine heroes played by Schwarzenegger, Stallone, and Jean-Claude Van Damme were replaced with independent women who are capable of defending themselves and defeating villains in films such Terminator 2 and The Silence of the Lambs. These female characters often perform stereotypical male actions, however, and have muscular physiques rather than feminine, \"soft\" bodies. Professor Jeffrey Brown considers Hamilton's undershirt to be symbolic of typically male action heroes such as John McClane and John Rambo, as well as females displaying masculine traits such as Rachel McLish in Aces: Iron Eagle III.\r\nDespite the emphasis on strong femininity, Hamilton's character remains secondary to Schwarzenegger's; Sarah's efforts to defeat the T-1000 fall short until the last-minute intervention of the T-800. Victoria Warren said this allows the female character to be strong enough to be admired but not strong enough to undermine the male protagonist's masculinity. Amanda Fernbach and Thomas B. Byers said the rigid form of the T-800 represents reactionary masculinity that is in direct opposition to the gender-bending T-1000, which represents a post-modern, fluid nature that is outside traditional norms and in opposition to patriarchy and the preservation of the traditional family.\r\nAmerican industry and individualism\r\nAuthor Mark Duckenfield said Terminator 2: Judgment Day can be seen as an unintended allegory for the decline of United States industries against successful Japanese technology firms with the cutting-edge T-1000 representing Japan against the older, less-advanced T-800. The U.S. industries, which were sometimes seen as villains during the economic boom of the 1980s, are seen as more sympathetic in the face of obsolescence, just as the T-800 is presented as friendlier and still powerful but no longer overwhelmingly so. Duckenfield considers the final scene, which takes place in a steel mill—a place of American industry—symbolic.\r\nAccording to Warren, Terminator 2 reflects Cold War American values that emphasized principles of American culture, in particular individualism and rejection of government intervention. The institutions the film's protagonists should be able to rely on, such as the government, the police, and technology, are the ones attempting to stop them because they do not believe in the protagonists' doomsday prophecy.\r\nLegacy\r\nCultural influence\r\nTerminator 2 is considered a highly influential film, setting a benchmark for sequels, action set pieces, and visual effects. Cameron and special-effects supervisor Dennis Muren said the groundbreaking special effects in Terminator 2 demonstrated the possibilities of computer generated effects and without it, effects-focused films such as Jurassic Park (1993) would not have been possible. Various publications have referenced Terminator 2's influence on special effects, describing it as the most important special-effects film since Tron (1982), and began the era of reliance on CGI effects for films such as Jurassic Park and The Matrix (1999). In 2007 the Visual Effects Society, an entertainment-industry organization of visual-effects practitioners, named Terminator 2 as the 14th-most-influential visual-effects film of all time, and the T-1000 is listed by Guinness World Records as the \"first major blockbuster movie character generated using computers\". According to The Guardian, however, the film's \"groundbreaking\" effects led to \"CGI laziness\", a reliance on computer graphics over practical effects, stunts, and craft. A 2014 Entertainment Weekly article said Terminator 2 contributed to the contemporary Hollywood high-budget, science-fiction epic film, and a reliance on turning films into franchises targeted at young audiences and broad demographics. Den of Geek described it as one of the most influential blockbusters since the thriller Jaws (1975). Several filmmakers and creative leads have named it as an influence on their work, including Steven Caple Jr., Ryan Coogler, Kevin Feige, and Hideo Kojima.\r\nWith a $94–102 million budget, Terminator 2: Judgment Day became the most expensive movie made in its time, and it remains Schwarzenegger's highest-grossing film. Alongside her appearance in The Terminator, Hamilton's Sarah Connor became regarded as one of the greatest and most-influential cinematic female action heroes and an iconic character. Patrick's T-1000 is considered one of the most-iconic and best cinematic villains; Patrick made cameo appearances as the T-1000 in Wayne's World (1992) and Schwarzenegger's Last Action Hero (1993). In Last Action Hero, Stallone replaces Schwarzenegger as the T-800 on the Terminator 2 poster. The T-800's line \"Hasta la vista, baby\" is considered an iconic piece of movie dialogue that is often quoted. Schwarzenegger also used it in speeches during his political career.\r\nTerminator 2: Judgment Day has been referenced to in a variety of media, including television, films, and video games. The biker bar scene was recreated for a 2015 advertisement, which featured Schwarzenegger, for the video game WWE 2K16; the bar patrons were replaced with WWE wrestlers.\r\nRetrospective assessments\r\nSince its release, Terminator 2: Judgment Day has been assessed as one of the greatest films, and one of the best sequels ever made. It is considered equal to or better than The Terminator, and is also regarded as either the best film in the Terminator franchise or second in quality to The Terminator. Terminator 2 is also considered one of the best action films of all time, and one of the best science-fiction films. In 2001 the American Film Institute (AFI) ranked Terminator 2 number 77 on its 100 Years ... 100 Thrills list, recognizing the \"most heart-pounding movies\"; and the 2003 list of the 100 Best Heroes & Villains ranked the T-800 character as the forty-eighth-best hero. The 2005 list of the 100 Best Movie Quotes listed the T-800 dialog line \"Hasta la vista, baby\" as the 76th-best quotation; and the 2008 AFI's 10 Top 10 named Terminator 2 as the eighth-best science-fiction film. To mark Schwarzenegger's 75th birthday in 2022, Variety listed Terminator 2: Judgment Day as the best film in his 46-year career.\r\nReview aggregator Rotten Tomatoes offers a 92% approval rating from the aggregated reviews of 84 critics, with an average score of 8.5/10. The website's critical consensus says: \"T2 features thrilling action sequences and eye-popping visual effects, but what takes this sci-fi/action landmark to the next level is the depth of the human (and cyborg) characters.\" The film has a score of 75 out of 100 on Metacritic based on 22 critics' reviews, indicating \"generally favorable reviews\". During Terminator 2's 30th anniversary in 2021, Cameron, among others, said despite using older models of cars, the film's visuals still compare well with contemporary films. Cameron also said Terminator 2 remains relevant because artificial intelligence had become a ubiquitous reality rather than a fantasy. In 2006 Terminator 2 was listed at number 32 on Film4's 50 Films to See Before You Die list, and is included in the film reference book 1001 Movies You Must See Before You Die. Rotten Tomatoes lists it as one of 300 essential movies and at number 123 on its list of 200 essential movies. Popular Mechanics and Rolling Stone jointly listed it alongside The Terminator as the third-best time-travel film ever made. Rolling Stone's reader-voted list of the best sequels ranks Terminator 2 second behind The Godfather Part II (1974); and Empire readers ranked Terminator 2 17th on its 2017 \"100 Greatest Movies\" list.\r\nSequels\r\nCameron said he had no intentions for further sequels, believing Terminator 2 \"brings the story full circle and ends. And I think ending it at this point is a good idea\". Wisher and Cameron wrote the script with the intention of leaving no option for a sequel. Even so, four sequels followed: Terminator 3: Rise of the Machines (2003), Terminator Salvation (2009), Terminator Genisys (2015), and Terminator: Dark Fate (2019), though none replicated the successes of The Terminator or Terminator 2.\r\nSchwarzenegger returned for all but Terminator Salvation, while Cameron and Hamilton returned only for Dark Fate, a direct sequel to the events of Terminator 2. Although better critically received than other post-Terminator 2 sequels, Dark Fate is also considered a failure; analysts blamed audience disinterest on the diminishing quality of the series since Terminator 2, and repeated attempts to reboot the series. Fans also criticized Dark Fate's opening scene, in which a T-800 kills Furlong's teenage John Connor; entertainment website Collider wrote this retroactively damages the ending of Terminator 2. A television series Terminator: The Sarah Connor Chronicles (2008–2009) also takes place after the events of Terminator 2, and ignores the events in sequels Terminator 3 and beyond.",
    "html": "<p>Terminator 2: Judgment Day is a 1991 American science-fiction action film directed by James Cameron, who co-wrote the script with William Wisher. Starring Arnold Schwarzenegger, Linda Hamilton, Robert Patrick, and Edward Furlong, it is the sequel to The Terminator (1984) and is the second installment in the Terminator franchise. In the film, the malevolent artificial intelligence Skynet sends a Terminator—a highly advanced killing machine—back in time to 1995 to kill the future leader of the human resistance John Connor, when he is a child. The resistance sends back a less-advanced, reprogrammed Terminator to protect Connor and ensure the future of humanity.</p><p>The Terminator was considered a significant success, enhancing Schwarzenegger's and Cameron's careers, but work on a sequel stalled because of animosity between the pair and Hemdale Film Corporation, which partially owned the film's rights. In 1990, Schwarzenegger and Cameron persuaded Carolco Pictures to purchase the rights from The Terminator producer Gale Anne Hurd and Hemdale, which was financially struggling. A release date was set for the following year, leaving Cameron and Wisher seven weeks to write the script. Principal photography began from October 1990 to March 1991, taking place in and around Los Angeles on an estimated $94–102 million budget, making it the most-expensive film made at the time. The advanced visual effects by Industrial Light & Magic (ILM), which include the first use of a computer-generated main character in a blockbuster film, resulted in a schedule overrun. Theatrical prints were not delivered to theaters until the night before its July 3, 1991 release.</p><p>Terminator 2 earned $519–520.9 million, making it the highest-grossing film of 1991 worldwide, and the third-highest-grossing film of its time. Critics praised the visual effects, action sequences and cast, especially Patrick's performance as the T-1000 as a great cinematic villain, while criticism was directed towards the film's violence. Terminator 2 won several accolades, including Saturn, BAFTA, and Academy awards. Terminator 2 merchandise includes video games, comic books, novels, and T2-3D: Battle Across Time, a live-action attraction.</p><p>Terminator 2 is considered one of the best films ever made, and one of the best science-fiction, action, and sequel films, as well as equal to or better than The Terminator. It is also seen as one of the most influential visual effects films of all time, beginning the transition from practical effects to reliance on computer-generated imagery. Although Cameron intended for Terminator 2 to be the end of the franchise, it was followed by a series of sequels, including Terminator 3: Rise of the Machines (2003), Terminator Salvation (2009), Terminator Genisys (2015), and Terminator: Dark Fate (2019), as well as a 2008 television series.</p><br/><h3>Plot</h3><p>In 2029, Earth has been ravaged by the war between the malevolent artificial intelligence Skynet and the human resistance. Skynet sends the T-1000—an advanced, prototype, shape-shifting Terminator made of virtually indestructible liquid metal—back in time to kill the resistance leader John Connor when he is a child. To protect Connor, the resistance sends back a reprogrammed T-800 Terminator, a less-advanced metal endoskeleton covered in synthetic flesh.</p><p>In 1995 Los Angeles, John's mother Sarah has been incarcerated at the Pescadero State Hospital for her violent, fanatical efforts to prevent \"Judgment Day\"—the prophesied events of August 29, 1997, when Skynet will gain sentience and, in response to its creators' attempts to deactivate it, incite a nuclear holocaust. John, taken in by his foster parents, considers Sarah's beliefs to be delusional and resents her efforts to prepare him for his future role.</p><p>The T-800 and the T-1000 converge on John in a shopping mall and a chase ensues. John and the T-800 escape together. John calls to warn his foster parents but the T-800 deduces the T-1000 has already killed them. Realizing the T-800 is programmed to obey him, John forbids it from killing people and orders it to save Sarah from the T-1000. The T-800 and John intercept Sarah during an escape attempt but Sarah flees in horror because the T-800 resembles the Terminator that was sent to kill her in 1984. John and the T-800 persuade her to join them, and they escape the pursuing T-1000. Although distrustful of the T-800, Sarah uses its knowledge of the future to learn that a revolutionary microprocessor, being developed by Cyberdyne Systems engineer Miles Dyson, will be crucial to Skynet's creation.</p><p>Over the course of their journey, Sarah sees the T-800 serving as a friend and father figure to John, who teaches it catchphrases and hand signs while encouraging it to become more human-like. Sarah plans to flee with John to Mexico until a nightmare about Judgment Day convinces her to kill Dyson, whom she assaults in his home, but finds she cannot kill him and relents. John arrives and reconciles with Sarah while the T-800 convinces Dyson of the future consequences of his work. Dyson reveals his research has been reverse engineered from the damaged CPU and severed arm of the 1984 Terminator. Believing his work must be destroyed, Dyson, Sarah, John, and the T-800 break into Cyberdyne, retrieve the CPU and the arm, and set explosives to destroy the lab. The police assault the building and fatally shoot Dyson, but he detonates the explosives as he dies. The T-1000 pursues the surviving trio, cornering them in a steel mill.</p><p>Sarah and John split up to escape while the T-1000 mangles the T-800 and briefly deactivates it by destroying its power source. The T-1000 assumes Sarah's appearance to lure out John but Sarah intervenes and, along with the reactivated T-800, pushes it into a vat of molten steel, where it disintegrates. The T-800 explains it must also be destroyed to prevent it from serving as a foundation for Skynet. Despite John's tearful protests, the T-800 persuades him its destruction is the only way to protect their future. Sarah shakes the T-800's hand and, having come to respect it, helps lower it into the vat. Before its destruction, the T-800 gives John a thumbs-up. As Sarah drives down a highway with John, she reflects on her renewed hope for an unknown future, musing if the T-800 could learn the value of life, so can humanity.</p><br/><h3>Cast</h3><ul><li>Arnold Schwarzenegger as the Terminator: a reprogrammed Model 101 Series 800 \"T-800\" Terminator that is composed of living tissue over a metal endoskeleton</li><li>Linda Hamilton as Sarah Connor: a self-trained soldier who is dedicated to preventing the rise of Skynet</li><li>Edward Furlong as John Connor: Sarah's son who is destined to lead the human resistance in opposition to Skynet</li><li>Robert Patrick as T-1000: an advanced, shape-shifting, prototype Terminator that is composed of liquid metal</li><li>Earl Boen as Dr. Silberman: Sarah's doctor at Pescadero State Hospital</li><li>Joe Morton as Miles Bennett Dyson: Director of special projects at Cyberdyne Systems Corporation</li></ul><p>The film's cast also includes Jenette Goldstein and Xander Berkeley as John's foster parents Janelle and Todd Voight; Cástulo Guerra as Sarah's friend Enrique Salceda; S. Epatha Merkerson and DeVaughn Nixon as Dyson's wife Tarissa and son Danny; and Danny Cooksey as John's friend Tim. Hamilton's twin sister Leslie Hamilton Gearren appears as the T-1000 impersonating Sarah when Hamilton is also on-screen. Twins Don and Dan Stanton portray a guard at Pescadero State Hospital and the T-1000 imitating him.</p><p>Other cast members includes Ken Gibbel as an abusive orderly; Robert Winley, Ron Young, Charles Robert Brown, and Pete Schrum as men who confront the T-800 in a biker bar; Abdul Salaam El Razzac as Gibbons, a Cyberdyne guard; and Dean Norris as the SWAT team leader. Michael Edwards portrays the John Connor of 2029 and Hamilton's twenty-month-old son Dalton Abbott portrays an infant John in a dream sequence. Co-writer William Wisher cameos as a man photographing the T-800 in the mall, and Michael Biehn reprises his role as resistance soldier Kyle Reese in scenes that were removed from the theatrical release.</p><br/><h3>Production</h3><h4>Development</h4><p>The Terminator had been a surprise hit, earning $78.4 million against its $6.4 million budget, confirming Schwarzenegger's status as a lead actor and making director James Cameron a credible director. Schwarzenegger expressed interest in a sequel, saying \"I always felt we should continue the story ... I told that right after we finished the first film.\" Cameron said Schwarzenegger had always been more enthusiastic about a sequel than he was, because he had said everything he wanted to with the original.</p><p>Discussions to make a sequel stalled until 1989, in part due to Cameron's work on other films such as Aliens (1986) and The Abyss (1989), but also due to a fallout with rights holder Hemdale Film Corporation. Hemdale co-founder John Daly had attempted to alter the ending of The Terminator against Cameron's wishes, nearly resulting in a physical confrontation. A sequel, however, could not be made without Hemdale's approval; Cameron had surrendered 50% of his rights to the company to get The Terminator made. Cameron had also sold half of the remaining stake to his ex-wife Gale Anne Hurd, producer and co-writer on the first film, for $1 following their 1989 divorce. By 1990, Hemdale was being sued by Cameron, Schwarzenegger, Hurd, and special-effects artist Stan Winston for unpaid profits from The Terminator.</p><p>Schwarzenegger, aware Hemdale was experiencing financial difficulties, persuaded Carolco Pictures to pursue the purchase of The Terminator rights, having worked with the independent film studio on the big-budget, science-fiction film Total Recall (1990). Owner Mario Kassar described the rights acquisition as the most-difficult deal Carolco ever conducted. He accepted a $10 million offer for Hemdale's share, considering it a sum fabricated to ward him off, and paid Hurd $5 million for her share. Prior to development, the total cost of the acquisition came to $17 million after factoring in incidental costs.</p><p>Kassar told Cameron that in order to recoup his investment, the film would proceed with or without him, offering Cameron $6 million to be involved and write the script. The film would become a collaboration between several production studios: Carolco, Le Studio Canal+, Cameron's Lightstorm Entertainment, and Hurd's Pacific Western Productions. The minimum estimated cost to produce Terminator 2 was $60 million, dwarfing the $6.5 million budget of the first film, but Kassar called it a \"ghost\" number; he was aware the figure would increase because of Cameron's previous work. News sources labeled Terminator 2 the most-expensive independent film ever and predicted it would \"bankrupt Carolco\". However, Kassar claimed to have secured 110% of the budget funding needed through pre-sales to markets outside the US, as well as television, home-video, and theatrical distribution rights. The studio also had an existing U.S. distribution deal with TriStar Pictures for a set percentage of the budget—an estimated $4 million. TriStar stipulated that the film be ready for release by May 27, 1991, Memorial Day.</p><h4>Writing</h4><p>With a set scheduled release date, Cameron had six-to-seven weeks to write the sequel; he approached his frequent collaborator and The Terminator co-writer William Wisher Jr. in March 1990. They spent two weeks developing a film treatment based on Cameron's vision to form a relationship between John Connor and the T-800, a concept Wisher initially believed was a joke. Their treatment diverged from the \"science-fiction slasher\" theme of the original, instead focusing on the unconventional family bond formed between Sarah, John, and the T-800. Cameron said this relationship is \"the heart of the movie\", comparing it to the Tin Man receiving a heart in The Wizard of Oz (1939).</p><p>Cameron's initial concept had Skynet and the resistance each sending a T-800—both played by Schwarzenegger—into the past; one to kill John and the other to protect him. Wisher believed a fight between two identical Terminators would be boring. The pair also briefly considered a larger \"Super-Terminator\", which ultimately did not keep their interest. Instead, they adopted an early idea Cameron had for The Terminator, which involved a liquid-metal Terminator that looked like an average human in contrast to Schwarzenegger's large frame. The first half of the story would end with the destruction of Skynet's T-800, forcing it to use the T-1000, its ultimate weapon. Although he once considered removing the T-1000 altogether, Cameron later solidified it as the only antagonist. Writers had the T-1000 take on the appearance of a police officer, allowing it to operate with less suspicion. Cameron added that the decision was also thematically relevant, comparing an authority figure to the human tendency to lose compassion and become machine-like. Wisher found it challenging to depict the T-800 as \"good\" without making it non-threatening at the same time. The pair decided to give it the ability to learn and develop emotions, becoming more human over time.</p><p>Wisher developed the first half of the treatment at Cameron's home over the course of four weeks, while Cameron worked on the latter half. Many pages were removed, including a \"convoluted\" subplot about Dyson and a massacre of a camp of survivalists helping Sarah. Cameron, who did not consider the budget while writing, had to cut some elaborate scenes, including a nine-minute opening that showed a time-travel machine being used in 2029. Wisher and Cameron also frequently conferred with special-effects studio Industrial Light & Magic (ILM) to determine which ideas were achievable.</p><p>Cameron and Wisher analyzed the first film to help envision each character's development and evolution. Cameron believed Sarah's knowledge of the future would isolate her, forcing her to associate with survivalists and become a self-sufficient commando. She was written to have become an emotionally cold and distant character comparable to a Terminator, especially when deciding to go after Dyson. Instead of beginning the story with Sarah, John is placed with a foster family to increase tension. John's character was inspired by the 1985 Sting song, \"Russians\", with Cameron recalling, \"I remember sitting there once, high on E ... I was struck by 'I hope the Russians love their children too'. And I thought, 'You know what? The idea of a nuclear war is just so antithetical to life itself'. That's where came from\". Cameron wanted to make the Terminator a protagonist, because he found it uninteresting to repeat the character of The Terminator. They kept the T-800's dialogue brief, relying on the audience to infer a lot of meaning through \"small bites\". Its catchphrase, \"Hasta la vista, baby\", was something Wisher and Cameron said after their telephone calls. They spent three days refining the script, and the printed copy was still warm when Cameron boarded Carolco's charter jet on the way to Cannes, where Terminator 2 was announced in early May 1990. Schwarzenegger initially struggled with portions of the script, once asking \"What is 'polyalloy'?\" He also expressed concern about the character's non-lethal depiction, which appeared to conflict with his action-hero persona and his portrayal of the character in the first film. Cameron explained he wanted to defy audience expectations. Schwarzenegger requested: \"Just make me cool\".</p><h4>Casting</h4><p>Schwarzenegger became interested in reprising his role after finding the character more complex and sympathetic than in the previous film, although he found portraying a fearless, emotionless machine difficult. He extensively rehearsed action scenes with stunt coordinator Joel Kramer to minimize the effects of fire and explosions occurring around him. Schwarzenegger earned $12–$15 million for his involvement. Carolco had been blamed for the increase in exorbitant salaries paid to actors, having paid Schwarzenegger around $11 million for Total Recall (1990). They justified the expense as the value of their leads' wide appeal in markets outside the U.S. To lessen the immediate financial burden, Carolco paid most of Schwarzenegger's salary with a financed, $12.75 million Gulfstream III jet, allowing them to settle the fee over several years.</p><p>Cameron refused to re-cast Hamilton's role but developed plans to work around her absence if she chose not to return. Negotiations were initially protracted but were settled promptly after Cameron informed Carolco the script could not be finished until he knew if Hamilton would be involved. Hamilton received roughly $1 million, which she described as \"quite a bit more\" than her earnings for The Terminator but expressed disappointment at the pay disparity between her and Schwarzenegger. She requested Sarah to be \"crazy\", stating, \"I thought, 'This woman has been living with the certainty of man's demise for all these years and she'd have become this wild thing', so the warrior and the crazy woman ideas were all me\". She continued: \" is a better human than I am, and I'm a better Terminator than he is\". Cameron considered giving the character a facial scar but determined applying it daily would be difficult. Hamilton undertook extensive preparation for her role, working with a personal trainer for three hours a day, six days a week, and maintaining a strict, low-fat diet, losing about 12 pounds (5.4 kg) of body weight. She also received judo and military training from former Israeli commando Uziel Gal. Over the course of the six-month shoot, Hamilton also spent time each day with her twenty-month-old son Dalton and averaged only four hours of sleep at night. She described her experience as \"sheer Hell\" but enjoyed showing off her new physique. Hamilton's twin sister, Leslie, was also cast in scenes where two versions of Sarah appear on-screen simultaneously.</p><p>Patrick, who was living in his car, was one of several actors in their late 20s considered for the T-1000 role. Cameron wanted a lithe actor who could resemble a newly recruited police officer to contrast with Schwarzenegger; according to Cameron, \"If the series is a kind of human Panzer tank, then the series had to be a Porsche\". Casting director Mali Finn believed Patrick, whose agent described him as a cross of David Bowie and James Dean, had the \"intense presence\" they wanted. Patrick auditioned by acting like an emotionless hunter and later participated in a screen test to judge the way lighting worked with his skin and eyes. For his character, he drew inspiration from Schwarzenegger's performance in The Terminator and observed the movement of hunting creatures—reptiles, insects, cats, and sharks. Patrick's facial expressions were based on those of an eagle, keeping his head tilted down to imply constant forward movement. He also employed a mixture of military posture with martial arts to express a fluid motion that differed from the T-800's rigid movements. The role demanded Patrick to be lean and fast, requiring peak physical shape. He learned to sprint without displaying heavy breathing and exhaustion, and like Hamilton, he received specialized training from Gal. Weapons master Harry Lu taught Patrick to operate and reload weapons, such as the T-1000's Beretta 92FS, without looking and eventually without blinking. Singer Billy Idol was originally cast for the role before a motorbike accident seriously injured his leg. In a 2021 retrospective, Cameron said Idol had an interesting aesthetic but in hindsight, he probably would not have cast him. Singer Blackie Lawless of the rock band W.A.S.P. was also considered but deemed too tall.</p><p>Cameron believed that early candidates for the role of John Connor were either overexposed in other media or came from advertisement backgrounds, which trained them to be happy and perky. Furlong had no acting experience and was discovered by Finn at the Boys & Girls Club in Pasadena. Cameron described Furlong as having a \"surliness, an intelligence, just a question of pulling it out\". Furlong, among hundreds of other prospects, secured the role at his last audition. He was required to take acting lessons, learn some Spanish, and be able to ride a motorcycle and repair guns. Joe Morton said he believed his casting as Miles Bennett Dyson had to do with Cameron wanting a minority character to be integral to the changing of the world. Morton avoided interacting with the cast so that their on-screen relationships would seem believably distant. The role of Dyson was reduced after the preferred casting choice, Denzel Washington, declined it; the role required little from him except to act scared.</p><h4>Filming</h4><p>Three months of pre-production was truncated to meet the release schedule, leaving Cameron without the time he wanted to prepare all aspects before filming began. Over one week, he spent several hours each day choreographing vehicle scenes with toy cars and trucks, filming the results, and printing the footage for storyboard artists. There was no time to properly test practical effects before filming; if effects did not work, the filmmakers had to work around them.</p><p>Principal photography began on October 8–9, 1990, with a $60 million budget. The production was long and arduous, in part because of Cameron, who was known for his short temper, and uncompromising and \"dictatorial\" manner that resulted in the crew making T-shirts bearing the slogan \"You can't scare me—I work for Jim Cameron\". Schwarzenegger described him as a supportive but \"demanding taskmaster\" with a \"fanaticism for physical and visual detail\". Cameron had a practical approach when making scenes fit his vision; in one instance, he angrily fixed a broken camera when the operator could not, and Morton said during his death scene, Cameron decided on a whim to detonate surrounding glass to see how it would look. Because of the tight schedule, Cameron worked throughout Christmas, editing on Christmas Eve, and persuaded Schwarzenegger to cancel multiple Christmas events and a visit to American troops in Saudi Arabia with U.S. President George H. W. Bush to film his scenes. By the 101st day of filming, Schwarzenegger and Hamilton were frustrated by the number of takes Cameron ordered; five days were spent on Hamilton's close-ups in scenes at the Dyson home. Scenes were filmed out of sequence to prioritize those requiring extensive visual effects; Schwarzenegger found this difficult because he was meant to convey subtle signs of the T-800's progressive humanity and was unsure what was fitting for each scene. Cinematographer Adam Greenberg, who also worked on The Terminator, described the greater scope of the sequel as the most daunting prospect; where he had been able to shout instructions to his crew on the original film, he used one of 187 walkie-talkies to conduct efforts over an expansive area.</p><p>The production used many locations in and around California. The now-destroyed Corral bar in Sylmar is where the T-800 confronts a group of bikers. Location manager Jim Morris chose Corral because it was raised above ground, allowing the scene to take place over different levels. On one occasion, a woman who was oblivious to ongoing filming walked into the bar; when she asked Schwarzenegger, who was wearing only a pair of shorts, what was going on, he replied: \"It's male-stripper night\". Executives suggested cutting the scene to save money but Cameron and Schwarzenegger refused.</p><p>The T-1000 arrives at the Sixth Street Viaduct, John hacks an ATM at a bank in Van Nuys, and his foster parents' home is in the Canoga Park neighborhood—which was chosen because it looked generic. The Terminators confront John inside Santa Monica Place mall, although exterior shots were filmed at Northridge Fashion Center where there was less traffic. When the on-foot T-1000 chases John on a bicycle, Patrick's training made him faster than the bicycle and so its speed was increased. The T-1000 pursues John and the T-800 in a truck at Bull Creek spillway in North Hills. Other locations include the Lake View Terrace hospital, which was used for Pescadero State Hospital, and Petersen Automotive Museum became its garage; Cactus Jack's Market in Lancaster, California, Elysian Park—the site of Sarah's apocalyptic dream—and Dyson's home was near California State Route 1 in Malibu. The Cyberdyne Building destroyed in the film was an abandoned office in San Jose that was scheduled for demolition. Cameron used real Los Angeles Police Department SWAT members in the scene, although he embellished their real tactics for a more visually interesting assault.</p><p>The final highway chase was filmed along the Terminal Island Freeway near Long Beach, of which a 2.5-mile (4.0 km) stretch was shut nightly for two weeks. The future war of 2029 was filmed in the rubble of an abandoned steel mill in Oxnard, California, in a space one-half square mile (1.3 km2) that was enhanced with burned bicycles and cars from a 1989 fire at the Universal Studios Lot, and with effects such as flying vehicles added in post-production. Terminator 2's ending was filmed in the closed Kaiser Steel mill in Fontana, which Greenberg made appear operational mainly through lighting techniques. Despite appearing to be actively smelting steel, the mill was frigid and dangerous because of the moving machinery and high catwalks. The T-800's thumbs-up during his death was added during filming; Hamilton believed it was too sentimental. Six months of filming concluded on March 28, 1991, about three weeks behind schedule. Hamilton described the production as the most \"difficult, exhausting, physically, and emotionally stressful experience of my life\". She suffered permanent partial hearing loss after forgetting to wear earplugs in the scene in which the T-800 fires a gun in the hospital elevator, and experienced shell shock from months of exposure to violence, loud noise, gunfire, and action set-pieces.</p><h4>Post-production</h4><p>Terminator 2 was edited by Conrad Buff IV, Richard A. Harris, and Mark Goldblatt, who said although there was more time to edit than on The Terminator, it was still relatively small given the greater scope of the sequel; they described the complexity of scenes such as the final battle between the Terminators, which required a seamless combination of live-action, practical effect shots, and CGI. After having to rush editing at the end of The Abyss, Cameron limited filming on Terminator 2 to five days a week so he could edit the film on weekends from the start of filming. Several scenes were deleted, in part to reduce its running time; these include Kyle Reese appearing to Sarah in a dream and encouraging her to continue fighting; Sarah being beaten in the hospital; the T-1000 killing John's dog (a scene the animal-loving Patrick was not a fan of); John teaching the T-800 to smile and discussing whether it fears death; the T-1000 malfunctioning after being frozen in the steel mill; and additional scenes with Dyson's family. Schwarzenegger unsuccessfully rallied to retain his favorite scene, in which John and Sarah modify the T-800's CPU, allowing it to learn and evolve. Sarah attempts to destroy the CPU but John defends the T-800. The scene was replaced with dialogue indicating the T-800 already possesses the ability to learn. The scripted ending depicted an alternative 2029 that was filmed at the Los Angeles Arboretum in Arcadia, in which an aged Sarah narrates how Skynet was never created while John, now a senator, plays with his daughter. To make the film more evocative and memorable, Cameron changed this scene to one in which the characters look out at the road ahead. The production ran until about two days before the film's theatrical release; delays were mainly caused by the rendering of shots at Consolidated Film Industries, the most difficult of which was the T-1000's death. Co-producer Stephanie Austin said the production crew worked twenty-four-hour shifts and slept on site. The release print was delivered to theaters the night before its release. The film runs for 137 minutes.</p><p>Cameron and Schwarzenegger said the final budget, excluding marketing, was about $70 million, and the cost of making the film was about $51 million. According to Carolco executives Peter Hoffman and Roger Smith, the film cost $75 million figure before marketing, saying Terminator 2 was only \"modestly\" over budget. Including marketing and other costs, the film's total budget is reported to be between $94 million and $102 million. This figure was reduced by advances and guarantees of $91 million, including North-American television ($7 million) and home-video ($10 million) rights, and $61 million from theatrical and television rights outside the U.S.</p><h4>Special effects and design</h4><p>A 10-month schedule and about $15–$17 million of Terminator 2's budget was allocated to the entirety of its special effects, including $5 million for the T-1000 alone, and a further $1 million for stunts, at the time one of the largest-ever stunt budgets. Four main companies were involved in creating the 150 visual effects: ILM under special effects supervisor Dennis Muren managed the computer-generated imagery (CGI) effects, Stan Winston Studio the prosthetics and animatronics, Fantasy II Film Effects developed miniatures and optical effects, and 4-Ward Productions were responsible for creating a nuclear explosion effect. Pacific Data Images and Video Image provided some additional effects. The cost of producing CGI and practical limitations of staff numbers meant the effect was using sparingly, appearing in 42–43 shots, alongside 50–60 practical effects.</p><p>Produced near the advent of CGI, vivifying the T-1000 was a risky endeavor as there was no backup plan in place if the CGI did not work as intended or could not be composited effectively with Winston's practical effects. The computer systems needed to animate and render the T-1000 CGI cost thousands of dollars alone, but creating the character also relied on a variety of practical appliances, visual illusions, and filming techniques. A team of up to 35 at ILM were required for the five minutes of screen time the T-1000's effects appear, and the process was so complex that rendering 15 seconds of footage would take up to ten days.</p><h4>Music</h4><p>The Terminator composer Brad Fiedel returned for the sequel, working in his garage in Studio City, Los Angeles. Film industry professionals regarded his return with concern and skepticism; they believed his style would not suit the film. Fiedel quickly realized he would not receive the finished footage until late in the production after most effects were completed, which made it difficult to commit to decisions such as use of an orchestra because, unlike ambient music, the score had to accompany the on-screen action. Fiedel and Cameron wanted the musical tone to be \"warmer\" due to its focus on a nobler Terminator and young John. Fiedel experimented with sounds and shared them with Cameron for feedback.</p><p>While The Terminator score had mainly used oscillators and synthesizers, Fiedel recorded real instruments and modified their sounds. He developed a library of sounds for characters such as the T-1000, whose theme was created by sampling brass-instrument players warming up and improvising. Fiedel said to the players, \"You're an insane asylum. You're a bedlam of instruments.\" He slowed down the resulting sample and lowered the pitch, describing it as \"artificial intelligent monks chanting\". Cameron considered the \"atonal\" sound \"too avant-garde\" for him but Fiedel justified it as an accompaniment to Cameron, who was making a film \"people have never seen before\".</p><p>Tri-Star asked Schwarzenegger to arrange a tie-in music video and theme song for the film; he chose to work with rock band Guns N' Roses because they were popular and there was \"a rose in the movie and bloody guns\". The band offered the use of \"You Could Be Mine\", the debut single from their album Use Your Illusion II (1991). The music video, featuring Schwarzenegger as the T-800 pursuing the band, was directed by Stan Winston, Andrew Morahan, and Jeffrey Abelson. Patrick unsuccessfully lobbied to use \"Head Like a Hole\" by Nine Inch Nails as the tie-in song, in part because his brother, Richard Patrick, was their tour guitarist. Wisher suggested using \"Bad to the Bone\" by George Thorogood & the Destroyers as the T-800 puts on the biker clothes; although Cameron did not like the idea, Wisher said he later found Cameron had used the song but had forgotten it was his idea. \"Guitars, Cadillacs\" by Dwight Yoakam also features in Terminator 2.</p><br/><h3>Release</h3><h4>Context</h4><p>Competition between studios was expected to be strong during the summer theatrical season, which ran from mid-May to early September, with fifty-five films scheduled for release compared with thirty-seven in 1990. Release dates repeatedly changed as studios attempted to avoid strong competition and maximize their films' successes at a time when the cost of film production had increased 20% in a year, in part due to costly salaries for stars who also commanded a percentage of the film's profits, and declining revenues from box-office receipts, video sales, and television-network deals. Films scheduled for release included City Slickers, The Naked Gun 2½: The Smell of Fear, Only the Lonely, Hudson Hawk, The Rocketeer, What About Bob?, and Point Break. The films most expected to do well included Backdraft and Terminator 2, which were seen as having international appeal, Dying Young, and the year's predicted top film Robin Hood: Prince of Thieves. An unnamed studio executive said audiences were seeking escapist entertainment such as comedy or action, and avoiding films about less-positive subject matter.</p><h4>Marketing and promotion</h4><p>Schwarzenegger was involved in Terminator 2's marketing and merchandising campaign, which was estimated to be worth at least $20 million. By 1991, advertising for Terminator 2 was ubiquitous with high audience recognition and despite its U.S. R rating, restricting audiences to over-17s unless accompanied by an adult, the marketing was mainly aimed at younger audiences. Tristar contributed about $20 million for marketing, which included a $150,000 teaser trailer that was directed by Winston and depicts the construction of a T-800. Trailers ran for six months before the film's release; Tristar incentivized cinema staff to play it frequently by offering chances to win Terminator 2-branded goods and tickets to the premiere. Collaborations with fast-food restaurants and soft-drink manufacturers such as Subway and Pepsi, were used to promote the film.</p><p>There were two private screenings: one for family, friends, and crew at Skywalker Ranch and another in Los Angeles for studio executives. Austin said, \"People were stamping their feet and clapping for ten or fifteen minutes\", at which point the crew knew they had succeeded. During test screenings the ending was well received, and was described as a \"touching\" favorite scene. The premiere took place on July 1, 1991, at the Cineplex Odeon in Century City, Los Angeles. According to Fiedel, it was treated as a major event, unlike the premiere of The Terminator, at which the audience was skeptical or laughed at the wrong times. Celebrities in attendance included Maria Shriver, Nicolas Cage, Sylvester Stallone, Sharon Stone, Michael Douglas, and Furlong's date Soleil Moon Frye.</p><h4>Box office</h4><p>Terminator 2: Judgment Day opened in the United States and Canada on July 3, leading into the Independence Day holiday weekend. It had the highest-grossing Wednesday opening with $11.8 million. Between Friday and Sunday, the film grossed $31.8 million from 2,274 theaters, an average of $13,969 per theater, making it the number-one film of the weekend ahead of The Naked Gun 2½ ($11.6 million) in its second weekend and Robin Hood: Prince of Thieves ($10.3 million) in its fourth. Over the five-day holiday weekend (Wednesday to Sunday), Terminator 2 grossed $52.3 million, becoming the second-highest opening five-day total ever behind Batman's $57 million in 1989, It set a record opening for an R-rated film and for a Independence Day weekend. The opening-week audience was evenly split between adults, teenagers, and children, about 25%–30% of whom were females, although Tri-Star said the figure was higher. The film benefited from repeat viewings by young audience members. One theater chain executive said: \"... nothing since Batman has created the frenzy for tickets we saw this weekend with Terminator. At virtually all our locations, we are selling out ... the word-of-mouth buzz out there is just phenomenal.\" Industry professional Lawrence Kasanoff said it was an \"open secret\" that despite the R rating, children were seeing the film, remarking \"When T2 opened, I saw kids skateboard up to the ticket window ...\"</p><p>It retained the number-one position in its second weekend, grossing $20.7 million, ahead of the debuts of One Hundred and One Dalmatians ($10.3 million) and Boyz n the Hood ($10 million); and in its third weekend with $14.9 million, ahead of Bill & Ted's Bogus Journey ($10.2 million) and One Hundred and One Dalmatians ($7.8 million). Terminator 2: Judgment Day fell to number two in its fifth weekend, grossing $8.6 million against the debut of the comedy Hot Shots! ($10.8 million). It remained in the top-five highest-grossing films for twelve consecutive weeks and the top-ten highest-grossing films for fifteen weeks. In total, Terminator 2: Judgment Day spent about twenty-six weeks in theaters in a total of 2,495 cinemas, and grossed $204.8 million, making it the highest-grossing film of the year; ahead of Robin Hood: Prince of Thieves ($165 million), Beauty and the Beast ($145 million), and The Silence of the Lambs ($130 million). This also made it the thirteenth-highest-grossing film of its time, behind Back to the Future (1985), and the highest-grossing R-rated film. The Los Angeles Times estimated after the theater and distributor cuts, the box-office returns to Carolco would be well over twenty percent of the film's cost.</p><p>Outside the U.S. and Canada, Terminator 2: Judgment Day set numerous box office records. In the United Kingdom it had a record three-day opening weekend of $4.4 million (and a one-week record of $7.8 million) and went on to gross at least $30 million. In France it grossed a record $9.5 million in its opening week (the biggest opening since Rocky IV) and $16 million in two weeks. In Germany it grossed a record $8 million in five days and also had a record Australian opening weekend of $1.9 million. In Thailand it was the highest-grossing western-hemisphere film ever with a gross of $1.2 million. The film also performed well in Brazil and grossed at least $51 million in Japan. Internationally, the film grossed about $312.1 million, making it the first film to gross over $300 million outside of the U.S. and Canada.</p><p>Terminator 2: Judgment Day is estimated to have grossed a worldwide total of $519–$520.9 million, making it the year's highest-grossing film, and the third-highest-grossing film ever, behind 1977's Star Wars ($530 million) and 1982's E.T. the Extra-Terrestrial ($619 million).</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Terminator 2: Judgment Day was released to general acclaim. Many reviews focused on the state-of-the-art physical, special, and make-up effects, which were roundly praised as \"revolutionary\" and \"spectacular\", particularly those relating to the T-1000 as a \"technological wonder\". Several publications wrote Cameron's ability to realize cinematic action blockbusters was unmatched; Janet Maslin said at his best, despite occasional lapses into melodrama, Cameron's work is akin to that of director Stanley Kubrick. Both Maslin and The Austin Chronicle commented on the kindness and compassion in the film; The Austin Chronicle contrasted it to the lack of a moral message in The Terminator and Travers described it as a \"visionary parable\" but they, alongside others, criticized Terminator 2's \"muddled\" message about protecting the value of human life and peace by using extreme violence to prevent the use of nuclear weapons, war, and technological reliance.</p><p>Reviewers generally agreed the narrative early in the film is stronger than the one near the end. Owen Glieberman said the first hour has a genuine \"emotional pull\" and according to Roger Ebert, the initial concept of a boy finding a father figure in a Terminator that is learning to be human is \"intriguing\", but Glieberman said the narrative weakens once Hamilton's character joins the group; Travers and Corliss wrote it stumbles after hours of relentless action and a \"conventional climax\". Despite this observation, Glieberman praised the final battle between the T-1000 and the protagonists. Empire's review and Terrence Rafferty found the film's narrative less satisfying and idea-driven than that of The Terminator; Glieberman said despite it being an effective and witty thriller, Terminator 2: Judgment Day comes across as an expensive B movie when compared with \"visionary spectacles\" such as the Mad Max series and RoboCop (1987). Kenneth Turan said Terminator 2's action scenes succeed without the extreme gore and violence of RoboCop.</p><p>Ebert and Maslin, among others, appreciated the twist on Schwarzenegger's public action-hero persona by making him a hero who does not kill his enemies; David Ansen and Glieberman found humor in the T-800's non-lethal methods and efforts to become more human-like. Maslin and Hinson agreed, as in The Terminator, Schwarzenegger's role is perfect for his acting abilities; Hinson said Schwarzenegger portrayed more humanity as a machine than he did when portraying normal people. In contrast, Empire suggested the change was a concession to Schwarzenegger's young fans and Peter Travers chose the T-800's death as a \"cornball\" scene that is out of place for the actor and film.</p><p>Several reviewers praised the T-1000 character for the combination of Patrick's \"chilling\" expressionless performance and the advanced special effects, which create an implacable, \"showstopping\" villain; Empire called the character \"one of the great monsters of the cinema\". Glieberman said the character's absence from much of the film's second act is to the film's detriment, and Hinson wrote the T-1000 lacks any \"soul\" and thus a way for the audience to identify with it. Critics generally agreed Hamilton portrays a \"fierce\" female hero with an impressive physique that lets her outshine another female action hero, Sigourney Weaver's Ellen Ripley in Cameron's Aliens (1986). Other publications found Sarah Connor's narrations about peace to be \"heavy-handed\", overused, and \"unintentionally amusing\". Furlong was praised for giving a natural performance at a young age, and Hinson wrote despite limited screentime, Morton made an impression. Audiences polled by CinemaScore gave the film an average grade of \"A+\" on a scale of A+ to F.</p><h4>Accolades</h4><p>At the 1992 Saturn Awards, Terminator 2: Judgment Day received awards for Best Science Fiction Film, Best Director (Cameron), Best Actress (Hamilton), Best Performance by a Younger Actor (Furlong), and Best Special Effects; and a nomination for Best Actor (Schwarzenegger). It also won Favorite Motion Picture at the 18th People's Choice Awards. For the 45th British Academy Film Awards, Terminator 2 received awards for Best Sound (Lee Orloff, Tom Johnson, Gary Rydstrom, Gary Summers) and Best Special Visual Effects (Stan Winston, Dennis Muren, Gene Warren Jr., Robert Skotak), as well as a nomination for Best Production Design (Joseph Nemec III).</p><p>The 64th Academy Awards earned Terminator 2 four awards; Best Makeup (Winston and Jeff Dawn), Best Sound (Orloff, Johnson, Rydstrom, and Summers), Best Sound Effects Editing (Rydstrom and Gloria S. Borders), and Best Visual Effects (Muren, Winston, Warren Jr., and Skotak), as well as nominations for Best Cinematography (Adam Greenberg) and Best Film Editing (Conrad Buff, Mark Goldblatt and Richard A. Harris). It was the first film to win an Academy Award when its predecessor had not been nominated. It received six awards at the 1992 MTV Movie Awards, including: Best Movie, Best Action Sequence (\"L.A. Freeway Scene\"), Best Breakthrough Performance (Furlong), Best Female Performance (Hamilton), Best Male Performance (Schwarzenegger), and nominations for Best Song From a Movie (\"You Could Be Mine\"), Best Villain (Patrick), and Most Desirable Female (Hamilton); as well as a Hugo Award for Best Dramatic Presentation (Cameron and Wisher Jr.)</p><br/><h3>Post-release</h3><h4>Aftermath</h4><p>Terminator 2: Judgment Day began the careers or raised the profiles of its principal actors. According to industry professionals, Schwarzenegger became the top international star ahead of actors such as Mel Gibson and Tom Cruise. It also marked the start of a lasting friendship between Schwarzenegger and Cameron, who formed a \"midlife crisis motorcycle club\" and reunited for the action film True Lies (1994). Cameron and Hamilton began a romantic relationship in 1991, married in 1997, and later divorced. In 1992 Cameron was given a five-year, $500 million contract by 20th Century Fox to produce twelve films.</p><p>Furlong became in high demand and Patrick found dealing with his new-found recognition difficult as people asked him to impersonate the T-1000. Despite the film's success, Carolco reported 1991 losses of $265.1 million, which was caused by the financial problems of its other films and subsidiaries; despite investor support, the studio filed for bankruptcy in 1995 and its assets, including Terminator 2, were sold to Canal Plus for $58 million.</p><h4>Home media</h4><p>In December 1991, Terminator 2: Judgment Day was released on VHS and LaserDisc. It was a popular rental in the U.S. and Canada; a record 714,000 copies were shipped to retailers and it became the best-selling rental by mid-January 1992. A \"Special Edition\" featuring a 15-minute extended version of the film that restored deleted scenes and included interviews with cast and crew, storyboards, designs, and other unrestored deleted scenes, was released on LaserDisc in 1993. Cameron stated he did not use the label \"Director's Cut\" because he considered the theatrical releases to be definitive and the extended versions as opportunities to restore \"depth and character made omissible by theatrical running time\". The theatrical version was released on DVD in 1997. In 2000, an \"Ultimate Edition\" DVD was released, containing the theatrical and \"Special Edition\" cuts, and a new \"Extended Cut\", containing a further scene of the T-1000 inspecting John's bedroom, and the aforementioned alternate ending. Terminator 2 special effects coordinator Van Ling supervised the release. The \"Extreme Edition\" was released in 2003, featuring the theatrical and \"Special Edition\" cuts, a remastered 1080p image, Cameron's first commentary, and a documentary about the film's legacy to special effects.</p><p>Terminator 2 was released on Blu-ray in 2006; this was followed in 2009 by a \"Skynet Edition\" that contains the theatrical and \"Special Edition\" cuts, and commentaries with the cast and crew. This release includes a limited collector's set containing the Blu-ray; the \"Ultimate\" and \"Extreme\" editions on DVDs; a digital download version; all extant special features; and a 14-inch (360 mm) T-800 skull bust. A 4K Ultra HD Blu-ray version that includes a standard Blu-ray and digital version, was released in 2017; this release also offered a collector's option that includes one of 6,000 life-size replicas of a T-800 skeleton forearm, each signed by Cameron and individually numbered, the soundtrack, the theatrical, \"Special\", \"Extended\", and 2017 3D remaster cuts, and \"Reprogramming the Terminator\", a documentary that includes interviews with Schwarzenegger, Cameron, Furlong, and others.</p><p>In 1991 Varèse Sarabande released Fiedel's score, which spent six weeks on the Billboard 200 record chart, peaking at number 70. The theme song \"You Could Be Mine\" peaked at number 29 on the U.S. Billboard 100, and performed well in the United Kingdom, Australia, Germany, Spain, and Canada.</p><h4>Other media</h4><p>Terminator 2: Judgment Day was marketed with numerous tie-in products, including toys, puppets, trading cards, jigsaw puzzles, clothing, a perfume named \"Hero\", and a novelization by Randall Frakes that expands on the film's ending. In 1991 Marvel Comics adapted the film into a comic book, which was followed by expansions of the Terminator 2 narrative, including Malibu Comics's \"Cybernetic Dawn\" and \"Nuclear Twilight\" (1995–1996); Dynamite Entertainment's \"Infinity\" and \"Revolution\" (2007); and the T2 novel series by S. M. Stirling in the early 2000s. Several video-game adaptations of Terminator 2 were published; these include a pinball machine and an arcade game in 1991; the arcade game was popular enough to be ported to home consoles as T2: The Arcade Game. Multiple studios developed adaptations for home consoles; these widely differing games include Terminator 2 for Game Boy and Terminator 2 for the Nintendo Entertainment System (NES); the NES version was ported to Game Gear and Sega Master System in 1992. A later adaptation was developed for the Sega Genesis and Super Nintendo Entertainment System, and a different game was published for home computers. Merchandise for Terminator 2: Judgment Day was estimated to have generated $400 million in sales.</p><p>In 1996 T2-3D: Battle Across Time, a live-action attraction, was opened at Universal Studios Florida, and later at locations in Hollywood and Japan). The twenty-minute attraction was co-written and directed by Cameron and cost $60 million to produce, including live-action stunts and a $24 million, 12-minute, 3D film starring Schwarzenegger, Hamilton, Patrick, and Furlong as their in-world characters, making it the most-expensive film per minute. In it, Sarah and John attempt to stop Cyberdyne, which has developed Skynet. They are confronted by the T-1000 but saved by the T-800, which returns to 2029 with John to defeat Skynet and its latest creation, the T-1000000.</p><h4>3D remaster</h4><p>Cameron oversaw a year-long 3D remaster and subsequent 2017 theatrical re-release of Terminator 2: Judgment Day in August 2017. Cameron said: \"If you've never seen it, this'll be the version you want to see and remember\". Cameron made visual modifications to the film to fix errors that had bothered him, including the addition of windshield glass to the T-1000's truck, which fell out during its stunt fall and reappears in later scenes; concealing the obvious use of stuntmen for Furlong and Schwarzenegger during the same scene, concealed more of Patrick's nudity during his introduction, and brightened the visuals. The 3D remaster's theatrical release was seen as a disappointment, earning about $562,000 in its debut across 386 theaters compared to the 3D re-release of Cameron's Titanic in 2012, which fetched $17 million.</p><br/><h3>Themes and analysis</h3><h4>Family and humanity</h4><p>A central theme of Terminator 2: Judgment Day is the relationship between John Connor and the T-800 that serves as a surrogate for the father (Kyle Reese) he never knew. Cameron said: \"Sure, there's going to be big, thunderous action sequences, but the heart of the movie is that relationship\", comparing it with the Tin Man getting a heart in The Wizard of Oz. Both Terminator 2 and Cameron's earlier film Aliens focus on compassion and parental figures; Aliens' central character Ripley serves as a surrogate mother to an orphaned girl in contrast to an alien queen and her brood, while Terminator 2 depicts the T-800's relentless protection of his ward against the equally relentless T-1000. The T-800 is designed to emulate humans for infiltration purposes but as it grows and evolves, its emotions become real and it learns from John to feel grief. The T-800 chooses to sacrifice its life to ensure the survival of everyone else. In 1991 essayist Robert Bly wrote elderly men were not offering suitable role models for young men, and in Terminator 2, Sarah denounces the many men in her past who failed to be a father for John, except for the T-800. Once its role is complete, the T-800 leaves John for his own good after stating it lacks the emotions John must rely on.</p><p>While John teaches the T-800 about humanity, his biological mother Sarah has become less human because of her knowledge about the future. Cameron said: \"She's a sad character—a tragic character ... she believes that everyone she meets, talks to, or interacts with will be dead very soon\". This theme of machine-like humans links with Cameron's and Wisher's choice to make the T-1000 appear as a police officer because thematically they believed it represents humans who should have empathy for others becoming more machine-like and detached from their emotions. The SWAT team at Cyberdyne shoots Dyson, an African American, without warning. Cinephilia described Dyson as the most-human character in the film; according to them, he is an intelligent, optimistic family man who represents real-world encounters between police forces and people of color, compared to their encounter with the Caucasian T-800, during which they warn him before opening fire. The 1991 police beating of Rodney King was captured on the same videotape a civilian used to capture the filming of the biker bar scenes.</p><p>Following her escape from the state hospital, Sarah appears to embrace John but is actually checking him for injuries, forgoing any emotional attachment for the practicality of ensuring his survival and bringing about his destiny as a future leader. The T-800 is portrayed as a better parent than Sarah, offering him undivided attention while Sarah remains distant and focused on the future rather than the present. Philosophy professor Richard T. McClelland notes Sarah acceptance of the T-800 as John's surrogate father is such she leaves it in control of John when she leaves to kill Dyson. Sarah's dream about the nuclear holocaust that will kill six billion people, including her son, incites her to kill Dyson before he can complete the work that will bring about Skynet but when the moment comes, she is unable to fully forsake her humanity and murder him with no emotion. Cameron described this as a question of humanity's worth if we abandon it to win the battle for its existence. Compared to the bleak, nihilistic theme of The Terminator, Terminator 2 emphasizes the concept of free will and the value of human life. Schwarzenegger quoted the film's line \"no fate but what we make\", saying people have control over their own destinies.</p><h4>Violence</h4><p>On its release, reviewers were critical of Terminator 2: Judgment Day's message about preserving peace through violence; Owen Gleiberman stated \"reckless indifference\" to human life is intrinsic to the film but the T-800 maiming people rather than killing them potentially condemns victims of violence to a life of pain. Cameron described the film as the \"world's most violent anti-war movie\", and said it is about people struggling with their own violent natures. In particular, Cameron had been concerned by the original antagonist T-800's status as a cultural icon and power fantasy as a lethal, unstoppable force of strength and power, and chose to redefine it in Terminator 2, retaining the power fantasy without taking lives. Cinephilia said it is not morally possible to recover from killing people so Terminator 2 is about redeeming the T-800 and Sarah.</p><h4>Masculinity and femininity</h4><p>After the success of Aliens, the growth of female-led action films reflected the increase in women assuming non-traditional roles and the division between professional critics—who perceive a masculinization of the female hero—and audiences who embrace characters regardless of gender. The hyper-masculine heroes played by Schwarzenegger, Stallone, and Jean-Claude Van Damme were replaced with independent women who are capable of defending themselves and defeating villains in films such Terminator 2 and The Silence of the Lambs. These female characters often perform stereotypical male actions, however, and have muscular physiques rather than feminine, \"soft\" bodies. Professor Jeffrey Brown considers Hamilton's undershirt to be symbolic of typically male action heroes such as John McClane and John Rambo, as well as females displaying masculine traits such as Rachel McLish in Aces: Iron Eagle III.</p><p>Despite the emphasis on strong femininity, Hamilton's character remains secondary to Schwarzenegger's; Sarah's efforts to defeat the T-1000 fall short until the last-minute intervention of the T-800. Victoria Warren said this allows the female character to be strong enough to be admired but not strong enough to undermine the male protagonist's masculinity. Amanda Fernbach and Thomas B. Byers said the rigid form of the T-800 represents reactionary masculinity that is in direct opposition to the gender-bending T-1000, which represents a post-modern, fluid nature that is outside traditional norms and in opposition to patriarchy and the preservation of the traditional family.</p><h4>American industry and individualism</h4><p>Author Mark Duckenfield said Terminator 2: Judgment Day can be seen as an unintended allegory for the decline of United States industries against successful Japanese technology firms with the cutting-edge T-1000 representing Japan against the older, less-advanced T-800. The U.S. industries, which were sometimes seen as villains during the economic boom of the 1980s, are seen as more sympathetic in the face of obsolescence, just as the T-800 is presented as friendlier and still powerful but no longer overwhelmingly so. Duckenfield considers the final scene, which takes place in a steel mill—a place of American industry—symbolic.</p><p>According to Warren, Terminator 2 reflects Cold War American values that emphasized principles of American culture, in particular individualism and rejection of government intervention. The institutions the film's protagonists should be able to rely on, such as the government, the police, and technology, are the ones attempting to stop them because they do not believe in the protagonists' doomsday prophecy.</p><br/><h3>Legacy</h3><h4>Cultural influence</h4><p>Terminator 2 is considered a highly influential film, setting a benchmark for sequels, action set pieces, and visual effects. Cameron and special-effects supervisor Dennis Muren said the groundbreaking special effects in Terminator 2 demonstrated the possibilities of computer generated effects and without it, effects-focused films such as Jurassic Park (1993) would not have been possible. Various publications have referenced Terminator 2's influence on special effects, describing it as the most important special-effects film since Tron (1982), and began the era of reliance on CGI effects for films such as Jurassic Park and The Matrix (1999). In 2007 the Visual Effects Society, an entertainment-industry organization of visual-effects practitioners, named Terminator 2 as the 14th-most-influential visual-effects film of all time, and the T-1000 is listed by Guinness World Records as the \"first major blockbuster movie character generated using computers\". According to The Guardian, however, the film's \"groundbreaking\" effects led to \"CGI laziness\", a reliance on computer graphics over practical effects, stunts, and craft. A 2014 Entertainment Weekly article said Terminator 2 contributed to the contemporary Hollywood high-budget, science-fiction epic film, and a reliance on turning films into franchises targeted at young audiences and broad demographics. Den of Geek described it as one of the most influential blockbusters since the thriller Jaws (1975). Several filmmakers and creative leads have named it as an influence on their work, including Steven Caple Jr., Ryan Coogler, Kevin Feige, and Hideo Kojima.</p><p>With a $94–102 million budget, Terminator 2: Judgment Day became the most expensive movie made in its time, and it remains Schwarzenegger's highest-grossing film. Alongside her appearance in The Terminator, Hamilton's Sarah Connor became regarded as one of the greatest and most-influential cinematic female action heroes and an iconic character. Patrick's T-1000 is considered one of the most-iconic and best cinematic villains; Patrick made cameo appearances as the T-1000 in Wayne's World (1992) and Schwarzenegger's Last Action Hero (1993). In Last Action Hero, Stallone replaces Schwarzenegger as the T-800 on the Terminator 2 poster. The T-800's line \"Hasta la vista, baby\" is considered an iconic piece of movie dialogue that is often quoted. Schwarzenegger also used it in speeches during his political career.</p><p>Terminator 2: Judgment Day has been referenced to in a variety of media, including television, films, and video games. The biker bar scene was recreated for a 2015 advertisement, which featured Schwarzenegger, for the video game WWE 2K16; the bar patrons were replaced with WWE wrestlers.</p><h4>Retrospective assessments</h4><p>Since its release, Terminator 2: Judgment Day has been assessed as one of the greatest films, and one of the best sequels ever made. It is considered equal to or better than The Terminator, and is also regarded as either the best film in the Terminator franchise or second in quality to The Terminator. Terminator 2 is also considered one of the best action films of all time, and one of the best science-fiction films. In 2001 the American Film Institute (AFI) ranked Terminator 2 number 77 on its 100 Years ... 100 Thrills list, recognizing the \"most heart-pounding movies\"; and the 2003 list of the 100 Best Heroes & Villains ranked the T-800 character as the forty-eighth-best hero. The 2005 list of the 100 Best Movie Quotes listed the T-800 dialog line \"Hasta la vista, baby\" as the 76th-best quotation; and the 2008 AFI's 10 Top 10 named Terminator 2 as the eighth-best science-fiction film. To mark Schwarzenegger's 75th birthday in 2022, Variety listed Terminator 2: Judgment Day as the best film in his 46-year career.</p><p>Review aggregator Rotten Tomatoes offers a 92% approval rating from the aggregated reviews of 84 critics, with an average score of 8.5/10. The website's critical consensus says: \"T2 features thrilling action sequences and eye-popping visual effects, but what takes this sci-fi/action landmark to the next level is the depth of the human (and cyborg) characters.\" The film has a score of 75 out of 100 on Metacritic based on 22 critics' reviews, indicating \"generally favorable reviews\". During Terminator 2's 30th anniversary in 2021, Cameron, among others, said despite using older models of cars, the film's visuals still compare well with contemporary films. Cameron also said Terminator 2 remains relevant because artificial intelligence had become a ubiquitous reality rather than a fantasy. In 2006 Terminator 2 was listed at number 32 on Film4's 50 Films to See Before You Die list, and is included in the film reference book 1001 Movies You Must See Before You Die. Rotten Tomatoes lists it as one of 300 essential movies and at number 123 on its list of 200 essential movies. Popular Mechanics and Rolling Stone jointly listed it alongside The Terminator as the third-best time-travel film ever made. Rolling Stone's reader-voted list of the best sequels ranks Terminator 2 second behind The Godfather Part II (1974); and Empire readers ranked Terminator 2 17th on its 2017 \"100 Greatest Movies\" list.</p><br/><h3>Sequels</h3><p>Cameron said he had no intentions for further sequels, believing Terminator 2 \"brings the story full circle and ends. And I think ending it at this point is a good idea\". Wisher and Cameron wrote the script with the intention of leaving no option for a sequel. Even so, four sequels followed: Terminator 3: Rise of the Machines (2003), Terminator Salvation (2009), Terminator Genisys (2015), and Terminator: Dark Fate (2019), though none replicated the successes of The Terminator or Terminator 2.</p><p>Schwarzenegger returned for all but Terminator Salvation, while Cameron and Hamilton returned only for Dark Fate, a direct sequel to the events of Terminator 2. Although better critically received than other post-Terminator 2 sequels, Dark Fate is also considered a failure; analysts blamed audience disinterest on the diminishing quality of the series since Terminator 2, and repeated attempts to reboot the series. Fans also criticized Dark Fate's opening scene, in which a T-800 kills Furlong's teenage John Connor; entertainment website Collider wrote this retroactively damages the ending of Terminator 2. A television series Terminator: The Sarah Connor Chronicles (2008–2009) also takes place after the events of Terminator 2, and ignores the events in sequels Terminator 3 and beyond.</p><br/>"
  },
  "errorMessage": ""
}