{
  "imDbId": "tt0090605",
  "title": "Aliens",
  "fullTitle": "Aliens (1986)",
  "type": "Movie",
  "year": "1986",
  "items": [
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/movies/a/aliens.html",
      "rate": "100",
      "content": "Tautly paced and expertly directed, this roller coaster ride of a motion picture offers a little bit of everything, all wrapped up in a tidy science fiction/action package."
    },
    {
      "publisher": "Time",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "For this movie stands to be something its predecessor was not, a megahit. And it deserves to be, for it is a remarkable accomplishment: a sequel that exceeds its predecessor in the reach of its appeal while giving Weaver new emotional dimensions to explore."
    },
    {
      "publisher": "Empire",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "Truly great cinema- manages to dodge that 'dodgy sequel' curse with ease."
    },
    {
      "publisher": "Time Out",
      "author": "",
      "link": "",
      "rate": "90",
      "content": "There is always an interesting tension in Cameron's work between masculine and feminine qualities. When it finally hits the fan here, we're in for the mother of all battles."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "88",
      "content": "I'm giving the movie a high rating for its skill and professionalism and because it does the job it says it will do. I am also advising you not to eat before you go to see it."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "80",
      "content": "Director James Cameron dumps the decorative effects of Ridley Scott's 1979 Alien in favor of some daring narrative strategies and a tight thematic focus."
    },
    {
      "publisher": "Variety",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "James Cameron's vault into the big time after scoring with the exploitation actioner The Terminator makes up for lack of surprise with sheer volume of thrills and chills - emphasis is decidedly on the plural aspect of the title."
    },
    {
      "publisher": "",
      "author": "Salon",
      "link": "https://www.salon.com/1999/07/12/aliens/",
      "rate": "80",
      "content": "The startling thing about \"Aliens\" is how obsessed it is with women as child bearers. It's the theme that allows the movie to have all the trappings of a typical science fiction/action movie while creating a primal emotive connection for the audience."
    },
    {
      "publisher": "",
      "author": "The New York Times",
      "link": "https://www.nytimes.com/1986/07/18/movies/film-sigourney-weaver-in-aliens.html",
      "rate": "80",
      "content": "Under the direction of James (''The Terminator'') Cameron, [the special effects team has] put together a flaming, flashing, crashing, crackling blow-'em-up show that keeps you popping from your seat despite your better instincts and the basically conventional scare tactics."
    },
    {
      "publisher": "",
      "author": "The Hollywood Reporter",
      "link": "https://www.hollywoodreporter.com/movies/movie-news/aliens-review-1986-movie-1022037/",
      "rate": "80",
      "content": "Cameron isn't as concerned with scares or atmosphere, the staples of traditional horror films, as he is with setting up difficult situations for his characters to get out of, leaving audiences deliciously on edge."
    }
  ],
  "errorMessage": ""
}