{
  "imDbId": "tt0090605",
  "title": "Aliens",
  "fullTitle": "Aliens (1986)",
  "type": "Movie",
  "year": "1986",
  "items": [
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw5458761",
      "warningSpoilers": false,
      "date": "4 February 2020",
      "rate": "10",
      "helpful": "73 out of 84 found this helpful.",
      "title": "One of the best films ever made.",
      "content": "So often when you think of sequels you imagine cynical attempts to cash in on successful movies, efforts to bring in the coins with any old rubbish, when you think of the likes of Police Academy, Halloween and Jaws you can understand why, and then there is Aliens......Not often is a follow up as good as the original (and better in some ways,) but Aliens is, I would class it as one of the best movies of all time, a cinematic Masterpiece which seems to improve with age. It's a space horror, which is dramatic, action packed and funny at times.Aliens changed the genre, sci fi would never quite be the same again. This film will have you gripped, glued and on the edge of your seat, truly an adrenaline fuelled thrill ride, with amazing visuals, wonderful acting, and terrific music. Film makers of today watch and see how it should be done.A masterpiece. 10/10"
    },
    {
      "username": "ivo-cobra8",
      "userUrl": "https://www.imdb.com/user/ur15140057",
      "reviewLink": "https://www.imdb.com/review/rw4061568",
      "warningSpoilers": true,
      "date": "13 February 2018",
      "rate": "10",
      "helpful": "229 out of 264 found this helpful.",
      "title": "A masterpiece - one of the best epic-action films of all time my personal favorite",
      "content": "Aliens (1986) is the best Epic Sci-Fi Classic Action Movie of all time and one of my personal favorite best action sci-fi flicks that I love to death. Just like I love The Terminator and T2, I love this movie to death. James Cameron's classic masterpiece. The now classic science fiction film was only the third feature directed by James Cameron (following Piranha Part Two, The Terminator). It is the sequel to the 1979 film Alien and Alien is a masterpiece I love that film, but I love this movie more sorry this is my personal opinion this is my movie. I am not saying it is better than the original movie but it is right up there with Alien a real classic. Ellen Ripley (Sigourney Weaver), the sole survivor from the original \"Alien\", returns to Earth after drifting trough space in hyper sleep for 57 years. Although her story about the Alien encounter is met with skepticism, she agrees to accompany a team of high-tech marines back to LV-426 and this time it's war! It has great cast I love the marines fighting aliens in this movie. The movie stars: Sigourney Weaver, Michael Biehn, Carrie Henn, Paul Reiser, Lance Henriksen, Bill Paxton, William Hope, Jenette Goldstein, Al Matthews, Mark Rolston , Ricco Ross, Colette Hiller, Daniel Kash ,Cynthia Dale Scott and Tip Tipping and they are all believable enough.I love the characters beside Ellen Ripley, Newt, Corporal Hicks, Bishop, Private Hudson, Private Vasquez, Sergeant Apone, Private Drake, Private Frost, Corporal Ferro, Private Spunkmeyer, Corporal Dietrich, Private Crowe I love those platoon of US Colonial Marines I know I haven't mentioned Burke because he was the bad guy and I don't like him. But most of the characters in this movie I love. I know it is a sci-fi action film but it also does a have a horror mixed together people just don't see that. There's plenty of horror in it. The nightmare sequence in the beginning, the creepy atmosphere of the LV-426 colony, and the heart pounding face hugger on the loose scene in the medical bay. You see mother of those aliens who cocooned all the humans and killed them you see Ripley finding the nest and fight the Alien queen on the end. Ripley faces her fear and gets over her PTSD by going in by herself to rescue the Girl/Fight the Aliens/and Destroy the Entire Nest...Battles One on One with an Alien Queen and Whips its' Ass...and, by the end, now both her and Newt can dream without the worry of any more Nightmares (which plagued Ripley at the beginning of the film).This is the finest action movie of all time. And, yet, believe it or not, it's not the action in the film itself that makes this be the case. This is especially odd in a movie with a $100 million budget (in 1986!), with multiple huge explosions, with thousands of bullets fired, and scores from James Horner of stuntmen used.10/10 I have the Blu-ray disc which it also have a special edition version on it I used to had this film on DVD but I throw it away because I bought the Blu-ray which I am very happy about it. I love this film to death it is my personal favorite sci-fi action film even Lance Henriksen from Hard Target and The Terminator is in here and he is the good guy."
    },
    {
      "username": "BrandtSponseller",
      "userUrl": "https://www.imdb.com/user/ur0139258",
      "reviewLink": "https://www.imdb.com/review/rw1016544",
      "warningSpoilers": false,
      "date": "7 February 2005",
      "rate": "10",
      "helpful": "329 out of 387 found this helpful.",
      "title": "Excellent sequel--matches the brilliance of the first film",
      "content": "Series note: It is strongly advised that you watch this film only after seeing Alien (1979). This is a direct continuation of that story.57 years after the events of the first film, Ellen Ripley (Sigourney Weaver) is found and awakened from hyper sleep to discover that a terraforming colony has been set up on LV-426, the planet wherein she and her fellow crew of the mining cargo spaceship Nostromo first encountered the titular aliens. When Earth-based communications loses contact with LV-426, a band of marines are sent to investigate, taking Ripley and a representative from the company that financed the colony, Carter Burke (Paul Reiser) along for the ride.For the difficult job of following up Ridley Scott's excellent Alien, director James Cameron decided to go a completely different route--to make a fast moving, slightly tongue-in-cheek, boisterous action extravaganza. Remarkably, he was able to do that while still maintaining a stylistic and literary continuity that melds Aliens seamlessly with the first film.Ripley is much more fully developed in this film, although unfortunately, some of the most significant scenes were deleted from the theatrical release (if at all possible, watch the 2-hour and 37-minute director's cut instead). Cameron fashioned Aliens into a grand arc where Ripley's actions at the end of the film have much more meaning as she's not only fighting monsters, but also fighting to retain a semblance of something she lost due to her 57-year hyper sleep. As in the first film, she is still the most intelligent, courageous and resourceful member of the crew, but she has much more colorful company.The marines accompanying Ripley back to LV-426 may be too cartoonish for some tastes (as for viewers of that opinion, most of the action and the film overall is likely to be too cartoonish), but for anyone more agreeable to that kind of caricatured exaggeration, it's a joy to watch. I'm a big fan of both Bill Paxton and Lance Henriksen, and both turn in wonderfully over-the-top performances, at their diametrically opposed ends of the emotional spectrum--Paxton as the spastic surfer/redneck and Henriksen as the intense, moody sage, with a surprising reality and an even more surprising conscience to go along with it. We also get a cigar-chomping Sergeant, a crazy, butch Private, and a complex, pensive Corporal as main characters, and a mysterious, bright young girl (played in a terrific performance by Carrie Henn). Much of the center section of the film hinges on the interrelationships of these characters, despite the action trappings going on around them.Cameron carries over the crypt/labyrinth motif of the first film, and adds a metaphorical descent into the bowels of hell in the climax. The action throughout is suspenseful. Aliens contains one of my favorite \"cat fights\" in any film. It's also worth noting the influence this film may have had on Paul Verhoeven's Starship Troopers (1997)--although admittedly, we could say that Cameron was influenced a bit by the Robert A. Heinlein book, as well. Throughout all of the varied action sequences, as well as the important early scenes of colonists on LV-426, Cameron is able to clearly convey the logistics of very complex sets, so that viewers remain on the edges of their seats.Part of what makes the monsters so effective is that we're not told too much about them. We only get glimpses into their physiology's, their behavioral patterns and their intelligence. Cameron gives us just enough to become wrapped up in the film, but not so much that we become overly familiar with the aliens, or start to question the logic behind the film. He also smartly carries over some devices from the first film that were abandoned to an extent, such as the acidic blood of the aliens, and he supplies answers to the few questions that the first film raised, such as why the blood doesn't corrode instruments and objects when a dead alien is examined.Aliens is yet another example of a sequel that is just as good as an original film in a series. Just make sure you watch both in order, and try to watch the director's cuts."
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw6859665",
      "warningSpoilers": false,
      "date": "28 April 2021",
      "rate": "8",
      "helpful": "30 out of 34 found this helpful.",
      "title": "Action, horror n science fiction combined in an amazing way.",
      "content": "I first saw this in the late 80s on a vhs.Revisited all the four parts in the early 2k on dvds which i own.Revisited this part (154 mins special edition version) few days back as i am on Alien movie marathon n very impatient to check out Prometheus n Covenant.This movie has some amazing star cast, lots of fireworks, intense action n claustrophobic horror."
    },
    {
      "username": "mark.waltz",
      "userUrl": "https://www.imdb.com/user/ur0968789",
      "reviewLink": "https://www.imdb.com/review/rw6057380",
      "warningSpoilers": true,
      "date": "3 September 2020",
      "rate": "10",
      "helpful": "27 out of 31 found this helpful.",
      "title": "Who could believe that a sequel could top an already modern classic?",
      "content": "While Ridley Scott did not return as director, they got someone to take the reins that seems to have proven in teeny tiny ways that he was capable of the job, a man named James Cameron. This film is better (which isn't an easy task considering how good \"Alien\" was) simply because more care is put into the creation of the characters. Sigourney Weaver returns as Ripley, and this time, she gets more dialogue to express who she is underneath the rather sheltered heroin from the first film. She has not given dialog just to hear Sigourney Weaver speak, because this dialogue really expresses the lessons that she has learned through the events of the first film, and how secrets of her personal life impacted the way she was as a human.Sigourney's recipient of an Oscar nomination for this film is no joke, even if it is the first for a woman in a science fiction film. She truly is magnificent, and in moving up the ranks after a couple of films in the late 70's, she truly proved the notion that she wasn't just a fluke. When seen at the beginning of the film, she is having a nightmare of being back in space and the victim of the alien utilizing her through inserting another monster inside her. It takes a lot of convincing for her to go back into space, but once she is there and settled in, she is willing and determine under every circumstance to destroy the evil force that could bring around the destruction of the universe.This is a heroin that the women can look up to and men are comfortable with her because she feels like someone you could pal around with. Her interactions with the other members of the crew (which includes a very tough younger woman, Jenette Goldstein, who basically ridicules her at the beginning) vary from person to person because she is someone who obviously judges on strength of character. Bill Paxton and Michael Biehn have very unique personality is quite different from each other that have different types of relationships with Weaver's character.A little bit of tenderness is added through the presence of a nine-year-old girl (Carrie Henn) they find as the only survivor on a space vehicle, and if they were looking for a nine-year-old who could scream loudly non-stop, they accomplished what they set out to do. It gets to be a bit piercing at times, but if the viewer just thinks of how they would react in a similar situation, then they may be able to tolerate it more. Like the first one, this is non-stop action, but scores higher simply because they put more effort into making it more than just Another Science Fiction / space monster movie. This really has great themes and ideas, and 35 years later, is it true classic, with the leading lady who has become one of the great movie heroines of all time."
    },
    {
      "username": "baumer",
      "userUrl": "https://www.imdb.com/user/ur0355122",
      "reviewLink": "https://www.imdb.com/review/rw0229800",
      "warningSpoilers": false,
      "date": "15 June 1999",
      "rate": "10",
      "helpful": "258 out of 323 found this helpful.",
      "title": "James Cameron and Bill Paxton at their finest",
      "content": "There are really good movies and then there's that select few that change your life. For me movies like Jaws, Raiders of the Lost Ark, JFK, Titanic and Star Wars did that. By viewing a movie you see life in a different light. Aliens also did that to me. I didn't think a movie could scare me as much as Halloween did but this one certainly did that and more. The atmosphere in this movie, and the lighting and cinematography and of course the direction are top notch, and some of the scenes are some of the scariest I've seen in my life time. But what puts this movie over the top as one of the all time greatest films ever made is the casting.Sigourney Weaver is terrific but it is her supporting cast that shines and makes you feel like you know the crew that is heading to that desolate planet.Paul Reiser is perfect as Burke,the slimy corporate kiss ass that cares about profit before human lives. Lance Henriksen shines as Bishop, the cyborg with a heart. Jeanette Goldstein is the rough around the edges female marine that more than holds her own with all the testosterone floating around and Michael Biehn ( another Cameron favourite )is the perfect quiet leader that leads by example and not so much a loud demonstrative voice. But the show stopper in this flick ( just as he always is in any movie that he is in ) is Bill Paxton.Paxton and Cameron have worked on Terminator 1, True Lies, Titanic and Aliens and Bill is one of those actors that steals scenes from every actor and was always a recognizable face even before Titanic. Here, his Hudson character is the comic relief but he is also perhaps one of the true characters that we can all identify with. His tough exterior is nothing more than camouflage for his frightened fragile interior. He realizes the dire situation that they are all in and he can't hide his fear. When he finds out that they won't be rescued for at least seventeen days, his response is \" Hey man, we're not going to survive 17 hours man! Those things are going to come in here and they're going to get us and..... \" ( Ripley ) This little girl survived longer than that with no weapons and no military training. \" ( Hudson ) \" Why don't ya put her in charge!!! \"Paxton is a gift to any and every movie that he is in and this is his finest work. He should have won a best supporting actor that year. And if you haven't seen this movie, rush to see it if only for Bill Paxton. He steals the show. But if a tightly wound, brilliantly technical and unbelievably scary movie is your thing, then you can't go wrong here. This is easily a ten out of ten, and one of the best ever made. If Spielberg is the king is Hollywood, then Cameron is his heir apparent. Oh, and one more thing, Paxton will win an Oscar one day."
    },
    {
      "username": "Derek237",
      "userUrl": "https://www.imdb.com/user/ur1142410",
      "reviewLink": "https://www.imdb.com/review/rw1162174",
      "warningSpoilers": false,
      "date": "31 August 2005",
      "rate": "10",
      "helpful": "309 out of 363 found this helpful.",
      "title": "One of the most thrilling films ever- special edition highly recommended",
      "content": "James Cameron is an extremely talented action director because not only does he know great action, but he always backs the action up with a great story and interesting characters. Aliens is his finest achievement, as far as I'm concerned. Of course, I should specify: Aliens Special Edition is his finest achievement.In 1986 several scenes were cut to keep the movie's run-time reasonable but there was one scene that was incredibly foolish to leave out. The scene I refer to is near the beginning where Ripley learns that her daughter has died while she was away in 'hypersleep' for 57 years. \"I promised her I'd be home for her 11th birthday,\" cries Ripley. This is a very moving scene that adds a great deal the character's depth and makes more sense to why she cares for a little girl named Newt later in the film. She's seeking penance through Newt with her love and determination to keep her alive at all costs. The theatrical edition obviously doesn't elude to any of this, and even cheapens the relationship between Ripley and Newt- just a little bit. James Cameron has said that all of his movies are love stories, and Aliens is a story of parental love. He has also said that the special edition is his intended (if not definitive) version of the film. For about five years or so the Special Edition was the only version of Aliens you could get on DVD. It should have stayed that way.Aliens is a unique film experience: it's genuinely thrilling and exciting, unlike a lot of movies where people shoot the evil monsters and there's disgusting blood and rapid gunfire, and it's really meaningless. In Aliens' case, the aliens are very threatening and more than just target practice. We don't see any aliens for over an hour, but once we do, it's a huge payoff. By that time, we get to know some interesting characters: Hicks (Michael Beihn), a take-charge marine who also turns out to be sweet and sincere, Hudson (Bill Paxton), a braggart who turns out to be a coward and complains most of the time, Vasquez (Jeanette Goldstein), the iron-willed woman soldier who proves to be one of the bravest characters in the film, Bishop (Lance Henrikson), a robot that is very helpful for everyone's survival, Burke (Paul Rieser), the slimy company man who the audience loves to hate, and of course, the adorable little Newt (Carrie Henn), a girl who has survived unspeakable horror. Holding the whole film together is Ripley, played by Sigourney Weaver in her surprise-Oscar-nominated performance. I think the only reason why the audience cared for her in the first film is because she was the only person left and we wanted her to live. But for this film, James Cameron added so much to her. With all this investment in characters, we're really concerned for their well-being. We don't want those aliens to get them. Some die, and I'm always truly bummed out when it happens.Filled with amazing performances and an abundance of thrills, Aliens is one of the greatest of any genre it attempts: whether it's action, sci-fi, horror, or even drama. I personally liked it better than the first film, but it's really like comparing apples and oranges. I prefer the special edition and don't see why anyone should view the other version instead.My rating: 10/10"
    },
    {
      "username": "IMDbKeepsDeletingMyReviews",
      "userUrl": "https://www.imdb.com/user/ur73645337",
      "reviewLink": "https://www.imdb.com/review/rw6072670",
      "warningSpoilers": false,
      "date": "7 September 2020",
      "rate": "9",
      "helpful": "101 out of 114 found this helpful.",
      "title": "This is how it's done, you morons",
      "content": "Welcome to 1986, where they had diverse AND well-written characters in what has to be one of the best Sci-Fi Action films of all time: ALIENS.Even in 1979, Ellen Ripley was what those wannabes today want to recreate: a strong, yet believable female character with a real challenge and a highly competent movie around her. Now, imagine being tasked to do a sequel to ALIEN. You'd be right to directly spray your pants, go throw up, have a heart attack and then politely decline. But not James Cameron. He went on and made one of the most valuable and memorable sequels in film history, despite having a lot of nay-sayers in his own team who didn't believe he could pull it off. Oh, the balls this guy had.Well, what can I tell you about this film that you don't already know? If you really haven't seen it, go watch it. Immediately. It basically is the American version of the suspenseful, British original, but it does get to expand on the world-building quite a lot, as well as on Ripley herself. Add Michael Biehn, Bill Paxton and a ton of Xenomorphs, paranoia, action, quite a bit of horror, Paul Reiser and Lance Henriksen and a badass called Vasquez, and you will have a cocktail that you won't forget, I promise. Then just realize that I didn't even mention Sigourney Weaver and holy cow, why are you still reading this?Go watch this movie!"
    },
    {
      "username": "carflo",
      "userUrl": "https://www.imdb.com/user/ur2509775",
      "reviewLink": "https://www.imdb.com/review/rw0974486",
      "warningSpoilers": false,
      "date": "8 December 2004",
      "rate": "10",
      "helpful": "408 out of 479 found this helpful.",
      "title": "Gets better every time I see it",
      "content": "I am just going to add my voice to the chorus of praise for this movie. It is as near to being perfect as any I have ever seen. I will not say that it is much better than Alien - which is just about near to being perfect also. But I do love all the characters in this movie. I have rarely seen a movie where all the characters were so well developed. Even most serious dramas seldom develops each character so completely. None of these characters are stereotypes even Paul Reiser as Burke, although the slimy company/government man villain is a prerequisite in disaster type movies. I would almost say that my favorite is Michael Beihn as Hicks, just because I like his work & consider him to be underrated. But I also like Lance Henriksen as Bishop, William Hope as Lt. Gorman, Bill Paxton as Hudson, and of course, Jenette Goldstein as Vasquez. I liked all of these characters. I cared about their lives & deaths. The final scene for Gorman & Vasquez still chokes me up after seeing it many times. I am not ignoring Sigourney Weaver or Carrie Henn. Ripley is the template for the modern action heroine. In the 24 years since Alien, few have been able to measure up to Sigourney Weaver's Ripley. Even in Alien 3 & 4, Ripley was still powerful, despite the 3ed rate quality of the movies. As for Carrie Henn as Newt, she was the emotional heart of Aliens. Cameron's ability to develop well rounded characters does not detract from his ability to create great action scenes or to scare the audience out of a several years of growth."
    },
    {
      "username": "one9eighty",
      "userUrl": "https://www.imdb.com/user/ur16650558",
      "reviewLink": "https://www.imdb.com/review/rw5478917",
      "warningSpoilers": false,
      "date": "12 February 2020",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "In space, nobody can hear you s**t your pants",
      "content": "57 years ago Ellen Ripley (Sigourney Weaver) was part of the Nostromo spaceship's crew that encountered a terrifying alien, as the last remaining member of the crew she has drifted through space in hyper sleep. Awake and alive nobody believes her, so she is asked upon to support a Colonial Marine outfit as they go back to Moon LV-426 - a now colonized moon where the original Alien came from. They have recently gone dark and potentially abandoned the moon, and the authorities want to know why. The Colonial Marines are outfitted with state of the art warfare machinery and an arsenal to potentially deal with any threat.This is an amazing film - on par, if not better than the first in the series. It takes concepts from the first film, and then changes the approach and dynamic of the plot - expanding the universe in which the story unfolds. Some sequels just re-hash what came before them; this takes the original and does an A-Team transformation on it, attaching guns, lasers, nitro, bells and whistles. The end result is a genre bending action horror sci-fi chase war thriller masterpiece. There are explosions, special effects, gorgeous cinematography and mise-en-scene, great plot, thrilling story, top actors delivering excellent performances, scares, frights, fights, character development - oh believe me, I could go on singing the praises of this film. When James Cameron was given the reigns to this after Ridley Scott's seminal \"Alien\" film a lot of film-goes where dubious - but given the proof of the \"Terminator\" movie, Cameron had the pedigree to be successful and boy did he deliver! Not just a tour-de-force of a visual spectacle, but also a film lecturers dream as the material further promotes lots of themes and discussions - none more than the heroine who is the vehicle for plot. If the first film made people look at Sigourney Weaver differently, this film went a long way to elevating her star power as she totally flipped action hero conventions on their head - to this day her performance is still synonymous with being a major player in the change from masculine dominated cinema. The matriarchal bond shown between Ripley and Newt is great, the character development goes some way to showing an attempt to fix the fragility of the broken bond exemplified at the start of the film when it becomes clear that Ripley's own biological daughter is resentful of the unjustified absence of a mother. Another well documented discussion this film birthed deals with the parallels to war films, and in particularly Vietnam themed war film - however rather than shoehorning academic thesis' into this review I'll just say that the film did more than just entertained, it became an icon in cinema.I seriously cannot give this film less than 10 out of 10. It scared, thrilled and entertained me as a child when I watched it (admittedly under the legal age), and it still keeps a smile on my face as I watch it as an adult."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3203562",
      "warningSpoilers": false,
      "date": "17 March 2015",
      "rate": "10",
      "helpful": "45 out of 56 found this helpful.",
      "title": "All-time classic; one of the greatest films ever made",
      "content": "What more can be said that hasn't been said before about one of the greatest movies of our time? One of Jim Cameron's top three films, this is by far the best of the ALIEN saga, an endlessly rewatchable piece of classic action cinema which can best be described as \"Vietnam in space\". The alien is back and has multiplied, so now we have the now-classic action premise of \"group of marines vs. invincible enemy\".From start to finish this is perfectly made entertainment with every frame minutely conceived to be the best. The music is eerily gripping and there are dozens of one-liners to be had from Bill Paxton, excelling in his first big role as the comic relief. The horror and gore quotient hasn't been reduced at all, this is definitely not a film for the kids. But oodles of gripping suspense and guns-blazing action violence is the main thing this sequel offers and it still remains one of the best action classics of our time. Even now, when some of the special effects are starting to look a little ropey (most remain fantastic, however, especially the Queen) and when you begin to realise there are no more than six aliens on screen at one time, this is still pulse-pounding entertainment, packed with horror, suspense, tension and plenty of thrills.The cast is efficient, an ensemble outfit that pays off nicely. Sigourney Weaver puts in her best performance in her best role that she can never hope to better success-wise. Michael Biehn is the hard-but-human soldier who befriends her, Lance Henriksen has his mainstream breakthrough role as the likable android Bishop. Paul Reiser's Burke is one of the greatest portrayals of corporate evil I've seen, a fantastic show of strength, corruption, evil and cowardice from Reiser. The rest of the marines are great and, most importantly, believable and likable. The action never lets up and the extended version has to be seen to get the full story. Although it runs for two and a half hours this is a film that never runs out of steam; instead it will just age gracefully like the finest wines, sitting in its place in history as a classic of the '80s."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2885391",
      "warningSpoilers": false,
      "date": "12 October 2013",
      "rate": "9",
      "helpful": "26 out of 31 found this helpful.",
      "title": "Great follow up",
      "content": "It's 57 years after the first movie. Ellen Ripley (Sigourney Weaver) has been lost in cryogenic sleep until she's discovered by a deep salvage team. She's asked to return to the planet to investigate why the colony there has lost all communication. She and a team of space marines must battle the aliens in an all out fight.James Cameron has taken this franchise from its horror origins to a great big action adventure. The change in style is seamless. The action is perfect, and it's a non-stop roller coaster ride. Ripley has transformed herself from the feminist icon into a powerful mother figure. There isn't a false note in this movie. The characters are all well drawn from the humanist robot Lance Henriksen to the comic relief Bill Paxton. They all work to create one of the most thrilling rides of all times."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw8194445",
      "warningSpoilers": false,
      "date": "1 June 2022",
      "rate": "9",
      "helpful": "17 out of 20 found this helpful.",
      "title": "Prophetic & Visionary...",
      "content": "Allegorically and quite unintentionally a tale of a virus, ignorantly released its only aim is to destroy us, the wheels set in motion, a search begins for a new potion, but perpetuation has begun and there's absolutely nowhere you can run - from the evolutionary transformations, variations and mutations, the prequels, sequels and unequals yet to come."
    },
    {
      "username": "MaxBorg89",
      "userUrl": "https://www.imdb.com/user/ur5156288",
      "reviewLink": "https://www.imdb.com/review/rw1656261",
      "warningSpoilers": false,
      "date": "15 May 2007",
      "rate": "10",
      "helpful": "49 out of 65 found this helpful.",
      "title": "Hands down one of the best sequels ever!",
      "content": "Back in 1986, sequels had become very common (Superman, Star Wars, Indiana Jones), yet people were suspicious when they heard of a follow-up to Alien, Ridley Scott's acclaimed sci-fi horror from 1979. Most of the criticism was aimed at the fact that Scott had nothing to do with the new movie, which had been entrusted to an unknown (at the time) named James Cameron. Fortunately, Cameron had shown he knew the genre two years earlier with The Terminator, and by perfecting the skills he had developed on that film he delivered Aliens, which still stands out as one of the greatest science fiction flicks of all time.Given how the first film ended (all characters but one died), Cameron wisely decided to radically separate his movie from the original, and he does so from the very beginning by having Ripley (Sigourney Weaver) wake up from her cryogenic sleep and make a shocking discovery: although she hasn't aged at all, 57 years have passed since she left the Nostromo, meaning everyone she knew is either dead or very old (in a particularly heartbreaking scene, she talks on the phone with her grown-up daughter, who is full of resentment for her \"unjustified\" absence). In addition, no one believes her story regarding the alien since, as she's told by scientist Carter Burke (Paul Reiser), the planet where these creatures allegedly lived has been successfully colonized. Suddenly, though, all communications with LV-426 are inexplicably interrupted. Thinking there might be some truth to Ripley's tale, Burke asks her to join him and a group of soldiers on a mission to uncover the mystery. And while most of the participants are in it just for the money, our heroine realizes this is her only chance of confronting her worst nightmare and overcoming it for good.The main problem with Alien, some have said, was that, as great as it can be, the characterizations were reduced to the minimum (not that it really mattered, with Ridley Scott ensuring the film retained the right pace and suspense throughout). With Aliens, character development is the last thing fans should worry about, Cameron being fully aware of each individual's potential and exploiting it as much as he can. Ripley, who was just part of an ensemble in the original, is now allowed to carry the whole film, and boy, does she carry it: rarely has there been a more solid, compelling female role in a genre movie like this (the fact that Sigourney Weaver is the only actress, thus far, to have received an Oscar nomination for a science-fiction film is further testament to Aliens' immortality). The supporting cast is equally good, with a multitude of different characters ranging from funny (regular Cameron collaborators Michael Biehn and Bill Paxton) to weird (Lance Henriksen's android Bishop) and bringing something extra to the movie's unique atmosphere.Ah, the film's mood: that's the other aspect Cameron deserves all the credit in the world for. On a superficial level, it could be said Alien was a horror movie, while the follow-up is more action-oriented; that may be true, but one should also notice that every single spectacular battle scene actually oozes tension, never leaving the audience with a pause to breathe or relax. In fact, Cameron has succeeded where many other directors would have failed: he stayed faithful to the original's tone, but managed nonetheless to make the film undeniably his own.Relentlessly creepy, occasionally very violent and consistently compelling, Aliens is a pitch-perfect piece of adult science-fiction. Watch it on a double bill with Scott's version and you will get four hours of genre film-making at its finest."
    },
    {
      "username": "Pluto-3",
      "userUrl": "https://www.imdb.com/user/ur0077956",
      "reviewLink": "https://www.imdb.com/review/rw0229748",
      "warningSpoilers": false,
      "date": "14 August 1998",
      "rate": "10",
      "helpful": "638 out of 767 found this helpful.",
      "title": "This ain't a film.",
      "content": "THE sci-fi movie. It's nearly perfect in every way: storyline, characters, menacing threat, suspense, action, direction, music, emotion, etc... It's always been a favorite of mine and still is. To me this is not just a film, it is an experience. The adrenaline pumps like in no other film and rarely have we had the chance to see a heroine as compelling as Sigourney Weaver. She can kick anyone's ass and still keep a heart and soul. (Why she didn't win the Oscar back in 1986 is beyond me.) When the action starts, you're in for the ride of your life. Truly a milestone in movie making. Now if they could only release it on DVD..."
    },
    {
      "username": "Collins",
      "userUrl": "https://www.imdb.com/user/ur0176175",
      "reviewLink": "https://www.imdb.com/review/rw0229623",
      "warningSpoilers": true,
      "date": "6 December 1998",
      "rate": "9",
      "helpful": "174 out of 220 found this helpful.",
      "title": "ALIENS IS THE SCI-FI GENRE",
      "content": "\"Aliens\" is the best trapped-with-a-monster-right-behind-you movie of all time. The weird part is that it's not the first of its kind. Usually, the first of a genre is always the best but these kinds of movies were made decades-and-decades before 1986's \"Aliens.\" Still, through its strong story and characters, it elbows its way to the head of the class.Ripley is a heroine like no other. She thrills you. Her powerful presence and unstoppable soul will always live on in the minds of movie-goers. She and Newt form a surrogate mother-daughter relationship that is more touching than anything I've seen before in this kind of a movie. In this movie more than any other in the \"Alien\" series, Ripley's a woman who does what she can (and then some) to protect herself and the ones around her. She's the perfect action hero.On top of that, the pulsing music that plays while Bishop is speeding them away from the exploding compound and while Ripley is booting the Queen Alien out into space is beyond comparison.Note: If you LOVED this movie, it's probably best you don't see Alien 3. It, for some reason, turns the triumph of this film's conclusion into a depression deeper than the vastness of a hundred black holes."
    },
    {
      "username": "screenman",
      "userUrl": "https://www.imdb.com/user/ur9227049",
      "reviewLink": "https://www.imdb.com/review/rw1867769",
      "warningSpoilers": true,
      "date": "3 May 2008",
      "rate": "9",
      "helpful": "29 out of 40 found this helpful.",
      "title": "Could Hardly Be Improved.",
      "content": "Rarely does a sequel do greater justice to an idea than the original. But 'Aliens' manages it in spades.The music and sound score alone are absolutely mesmerising. If you haven't got a good system, you're missing-out big time. Here's a simple thing; just listen to the 3 latches locking into place when Ripley's 'lifeboat' is recovered by the deep-space explorer. You can't see them, but you can hear them, ker-k-link, each in succession, right around your sound stage. The noise tells you that they haven't just latched, but latched and locked. Listen with you eyes shut, if you don't believe me. It's that meticulous attention to detail both aural and visual that makes this movie a true work of art. There really is no need for the sounds to be there at all. But they are, and they convey complete fidelity to a scene that lasts just seconds. Here's another. When the marines are crossing the rain-swept depot to the airlock, its windy and wild. When they get inside, the ambiance completely changes. it's still noisy, the wind continues, faint but audible and there is lots of dripping water, but now there's also a strange, claustrophobic intimacy, and I'm quite at a loss as to how that has been accomplished. Yet the mood-change is hair-raisingly palpable. These set pieces are completely seamless throughout the movie. Strange, gloomy, suggestive, broken; the ghost of dead technology appears to haunt them as much as any alien demons. A thin, whining, electronic note does the work of tense music, it suits the circumstances perfectly, as well as providing a foil to any ambient sounds that the engineers and director thought appropriate. The sound and sets earned it two well-deserved Oscars.Tension builds and builds again. It's a fairly well-worn formula of gradual attrition. Ripley's valliant rescue of the ambushed and trapped space-marines must have any viewer at the edge of their seat. And on it goes, tighter and tighter, until finally we are squeezing through air-ducts. Acting is pretty formulaic but entirely believable. People we've quickly grown to like get killed suddenly and nastily, smug Apone, and macho Drake. The alien queen brings the movie to a perfect climax. Correct me if I'm wrong, but there was absolutely no CGI in this. Proof enough that it isn't actually needed, and is never as good as the real McCoy. And the script, by the way, is excellent.As a comment upon sexuality and survival it is a very telling one. The female is deadlier than the male. It draws from a simple Darwinian premise, that she makes a greater investment in the production of the young, and will therefore go to more determined and ruthless lengths to ensure their survival. She knows her genes are in the offspring: momma's baby, poppa's maybe. Males are simply expendable seed-carriers of convenience. I've docked a point for what strikes me as technological incongruity. The continued use of old-fashioned 'querty' keyboards for example, and CRT/VDU. The latter have all but gone to the scrap-heap now, never mind hundreds of years hence. Check-out the roll-up screens in 'Red Planet'; now that's more like it. Also, a sophisticated android like 'Bishop' surely suggests the probability of 'mechanised' marines. Or at least, a self-propelled remote for entering the alien hive. Bomb disposal squads already have those today. Bishop himself should have been able to simply plug-in and interface with the uplink. Or even communicate by WiFi. Though these things would compromise drama, their absence compromises its science-fiction credentials. And I am certainly no purist. But, golly-gosh! - nit-picking aside; this is an absolute crackerjack of entertainment.I believe it has only one other challenger for the crown of greatest sci-fi horror movie - Carpenter's 'The Thing'. You split 'em; I can't. It's 22 and 26 years since their creation, and no-one has managed to raise the bar. What does that tell you?"
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw2303644",
      "warningSpoilers": false,
      "date": "31 August 2010",
      "rate": "10",
      "helpful": "15 out of 20 found this helpful.",
      "title": "A Masterpiece of Suspense",
      "content": "This is a fantastic film in every respect. While the original was outstanding, this takes it to new heights. Everything is set up so well. The bad guys in the futuristic corporate world are at it again. They know of the horrors but see people as cannon fodder for the the venomous aliens. Ripley's character is mature and smart. Throw in the little colonist and a group of overzealous (and frightened) Marines and you have the ingredients for one of the best. The story is extremely well plotted. Every single thing that is put in front of us serves a purpose later in the film. The byplay among characters and the actions of the shortsighted bureaucrat all work. The combat scenes with the aliens are intense and frightening. The work in the first movie is drawn on to create this second one. It isn't the slipshod sequel, made to make a few bucks on a previously successful movie. The aliens have now become a silly franchise. This was the real thing. Don't bother with the other stuff."
    },
    {
      "username": "ruth.boaz",
      "userUrl": "https://www.imdb.com/user/ur0598589",
      "reviewLink": "https://www.imdb.com/review/rw0229529",
      "warningSpoilers": false,
      "date": "23 February 2000",
      "rate": "",
      "helpful": "381 out of 452 found this helpful.",
      "title": "Outstanding blend of sci-fi, action, and humour.",
      "content": "I rate Aliens a perfect 10. This second installment in the Alien series evolves the original movie's horror/sci-fi genre into action-adventure/sci-fi, setting a standard which has not yet been matched. I like this movie because it paints a picture of the future which is realistic enough to suck you in during the beginning of the film and then quickly introduces you to interesting characters who you become concerned with; some you love and others you hate.....but none of them bore you. By the time the action starts it's possible to forget you're watching a movie (at least the first couple of times). The plot is filled with tension that is occasionally broken by some of the most memorable one-liners in history (especially by Private Hudson). The special effects are remarkable, considering the fact that they were accomplished the \"old fashioned way\" prior to digital manipulation. I can report that I now own the Director's Cut and rate this version a 10 also. The extra footage will be extremely interesting to fans of the 1986 release. Either version gives you great characters, suspense, action, firepower, sarcasm, and wit. Aliens is an outstanding show!"
    },
    {
      "username": "sqeaston9",
      "userUrl": "https://www.imdb.com/user/ur18338314",
      "reviewLink": "https://www.imdb.com/review/rw1812617",
      "warningSpoilers": false,
      "date": "2 February 2008",
      "rate": "10",
      "helpful": "111 out of 147 found this helpful.",
      "title": "The best Sci Fi action flick ever made",
      "content": "What can I say that hasn't already been said? Every aspect of this movie is spot on, which I can only put down to James Cameron's obsessive attention to detail. The characters are distinct, memorable and believable. The plot builds slowly into the most tense, suspenseful roller-coaster ride I've ever experienced in the cinema. The special effects are good even by today's standards, and the sets are simply second to none. This is one of my top 10 favourite movies of all time.If you like this kind of movie and haven't seen this yet, what are you waiting for? Twenty years on and the only other Sci Fi action movie in the same league is James Cameron's Terminator 2. I can only hope he returns to this genre in the future, he is the master.Oh, and try to see the special extended edition if possible, the extra scenes make an amazing movie even better."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2367588",
      "warningSpoilers": false,
      "date": "11 January 2011",
      "rate": "10",
      "helpful": "34 out of 53 found this helpful.",
      "title": "Every bit as good as Alien",
      "content": "Alien is a sci-fi classic, so when I saw Aliens I was expecting great things. Which is exactly what I got. Aliens I have often seen and heard being described as one of the best sequels ever made, and I have to heartily concur. Aliens is every bit as good as Alien, and just a brilliant film. The production design once again is immaculate with the spectacle surpassing Alien(to me), while the script is credible, the story interesting and well-constructed and James Cameron's direction brilliant. As with Alien, there are also some very genuine shocks and scares, and if there was something I marginally preferred here it was the suspense which was particularly nail-biting. The acting once again is top notch, all the supporting cast do great work but Sigourney Weaver is simply terrific and it helps that Ellen Ripley is expanded upon here. Overall, just like Alien, a sci-fi classic. 10/10 Bethany Cox"
    },
    {
      "username": "FlashCallahan",
      "userUrl": "https://www.imdb.com/user/ur22668817",
      "reviewLink": "https://www.imdb.com/review/rw8841200",
      "warningSpoilers": true,
      "date": "31 January 2023",
      "rate": "8",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Have you ever been mistaken for a man?.....",
      "content": "Ellen Ripley is called back to help a group of highly trained colonial marines fight off against extraterrestrials. The aliens have taken over a space colony on the moon LV-426.When the marines are called upon to search the deserted space colony, they find out that they are up against more than what they bargained for. Using specially modified machine guns and enough firepower, it's either fight or die as the space marines battle against the aliens.As the Marines do their best to defend themselves, Ripley must attempt to protect a young girl who is the sole survivor of the nearly wiped out space colony.Aliens needs no introductions. It's one of the seminal science fiction films of the eighties, and it still holds up almost 40 years later. Cameron is big on nuclear family, and the way that Ridley's head fades into the earth is referencing that she is maternal toward the human race, as she rightly has an extreme hatred for the xenomorphs, and aside from Burke and Bishop, she's very caring about all of the characters and acts differently with each one. And the bond she has with Newt, is one of the most intricate relationships ever seen.Weaver is amazing, just brilliant as Ripley, and this is her performance, the one she will be remembered for. She owns the film and is the heart and the soul of the film.Moving from horror to action is a good move for Cameron, but the film still has some very scary moments, but the action is flawless, with some really memorable set pieces. When the crew are in the mess, it's as if Ripley is mother to a bunch of Teens, they are not paying attention to what she is saying, because of course, they know best.Whatever version you see, it's amazing stuff, cementing Cameron as one of the great directors, it's a shame he's gone slightly off key with his Avatar franchise, but he is still pushing cinematic boundaries.The effects are stunning, just brilliant, and the alien queen is still awe inspiring.If you haven't seen this masterpiece yet, please do so, or wait until its inevitable rerelease on the big screen."
    },
    {
      "username": "subarctic",
      "userUrl": "https://www.imdb.com/user/ur1705442",
      "reviewLink": "https://www.imdb.com/review/rw0229887",
      "warningSpoilers": false,
      "date": "6 February 2003",
      "rate": "10",
      "helpful": "247 out of 330 found this helpful.",
      "title": "\"I knew you'd come...\"",
      "content": "ALIENS really does have it all. Perfect direction. Beautiful cinematography. Intense characters. Big guns. Action. Heroism. Courage. Battles. Friendship. Bravery. It is certainly the BEST sequel ever made in movie history, and one of the GREATEST MOVIES EVER MADE.At its core is Lt. Ellen Ripley (played by the badass Sigourney Weaver), a warrant officer, and tough as nails. Her character is one of the greatest heroines of all time. Sigourney really does pull it off. No one else could have done it like her. Ripley's maternal connection with the young girl Newt is amazing to watch...but the ultimate scene is her final battle with the galaxy's most deadly creature - set to a pulsing military score (James Horner delivers in a big way!). Quite possibly my favorite fight scene of all time.There's not really much else to say - just go watch the movie on DVD, and you will not be let down. You're in for a wild ride!!!ALIENS: THIS TIME, IT'S WAR"
    },
    {
      "username": "WoBiE1",
      "userUrl": "https://www.imdb.com/user/ur0152922",
      "reviewLink": "https://www.imdb.com/review/rw0229795",
      "warningSpoilers": false,
      "date": "7 June 1999",
      "rate": "10",
      "helpful": "61 out of 77 found this helpful.",
      "title": "A milestone in movie making....",
      "content": "Just recently, I have purchased the new Alien Legacy box set on DVD, and each one is excellent. Aliens is the second chapter in the Alien saga and is probably the most remembered by today's generation. Let's face it; it changed the way sci-fi movies were made forever,and it hasn't been for the best(I'm not saying Aliens is a bad film). Aliens set such a high standard in action sci-fi(basically the new genre the James Cameron has created) that none of the copycats can compete. Take the recent movies Soldier and Event Horizon(both directed by Paul Anderson). They both try to be Alien movies but do not succeed. My advice to Mr. Anderson is to stop trying to copy what has already been done. Enough said.As for Aliens, it is a perfect sci-fi action movie. Great casting(although ALL are stereotypes), great music(James Horner is the man), great use of technology and a well written script are all present. Weaver's performance is outstanding; one of the best action heroes of all time just happens to be a woman. If you have a chance to watch the director' cut of Aliens, I suggest you take it(it's available in the new Alien Legacy box set or alone on DVD and VHS as well as on laserdisc). It expands on Ripley's maternal persona which makes Weaver's performance all the better.James Cameron came off making The Terminator and made Aliens. He used his expertise in the sci-fi genre and created an engrossing story that does not let up until the final reel of the film. For all the young folk out there that have not seen this film, watch it and see perfection in action movie making. A must see."
    },
    {
      "username": "dorotka24",
      "userUrl": "https://www.imdb.com/user/ur13536731",
      "reviewLink": "https://www.imdb.com/review/rw1799947",
      "warningSpoilers": false,
      "date": "14 January 2008",
      "rate": "10",
      "helpful": "35 out of 48 found this helpful.",
      "title": "Best of Sci-Fi Action",
      "content": "Aliens is one of many movies from my adolescent years that is just as good today as it was back then. It is an adrenaline filled ride filled with creepy locations, intense action, thrills, much circumstantial humor and one-liners that will never grow old (mostly thanks to Bill Paxton). It is, unapologetically, a man's movie, filled with everything except nudity (which it did not need).All movies in the Alien series have a claustrophobic feel to them, and involve a relatively small cast of players. Aliens is no exception and really capitalizes on the fear potential of the locale. Cameron is not exactly known for injecting horror into his films, but provides enough here to satisfy.The characters are very well cast and the actors have great chemistry. I especially grooved to the fact that, even though the soldiers are supposed to be tough marines, not all of them were completely gung-ho about their adventures. In fact, a few were downright cowardly and indecisive in the face of combat - something I'm certain would happen to many in such a situation. Bill Paxton stole the show as the wisecracking space marine. With all the likable characters involved, the stakes were very high. When they start dropping, we feel the loss.Movies like this just don't come around very often. The pacing is very tight, even when the action is absent. The characters and situations are interesting enough - when the action hits, it just serves to suck us in deeper. I have nothing bad to say about Aliens. It is simply an awesome movie with a well deserved reputation for being such. See for yourself."
    }
  ],
  "errorMessage": ""
}