{
  "imDbId": "tt0057565",
  "title": "High and Low",
  "fullTitle": "High and Low (1963)",
  "type": "Movie",
  "year": "1963",
  "items": [
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0083653",
      "warningSpoilers": false,
      "date": "30 August 2004",
      "rate": "10",
      "helpful": "53 out of 65 found this helpful.",
      "title": "If you like ransom/police storiesmysteries, and have interest in Kurosawa &/or Mifune, check it out at least once",
      "content": "High and Low, like Yojimbo and Throne of Blood, combines elements to create something special while seeming rather routine- while Yojimbo seems like a bad-ass samurai flick, it has the ingredients of a western and satire, and Throne of Blood is a rather faithful, strange adaptation of Macbeth in the guise of a warlord/samurai tale, High and Low does a similar method. Akira Kurosawa, a filmmaker who gets film buff's ears lit up at the mere mention of him, can usually be counted on to keep a film interesting even if it may not be entertaining to some of the crowd that likes a section of his movies or another (there's usually a split between his samurai/medieval tales and epics, and his dramas about the tragedies of ordinary people). Here he finds a middle ground- the story is taken from a hard-boiled detective novel, the kind you could probably buy for a quarter or fifty cents in the old days- as he tells of two stories interconnected at the hip, both with detail a commercial Hollywood director would brush off. The first is of businessman Gondo (Toshiro Mifune, with his usual bravura presence, but with enough nuanced and quiet moments for two movies), who is about to close a deal to get the shoe company he's worked for for years, when he gets a phone call. There's been a kidnapping- not his son, but his chauffeur's by default. Backed into a corner without options, he gets together 30 million he really can't afford, and gives it to the kidnapper(s). The police, meanwhile, are not about to give up, and start digging for clues with an in-depth investigation that goes to probe every possibility: the chauffeur's son used as a partial witness with drawings; a car; a trolly car; all this leads to nothing and everything, leading to a third act that's as riveting as the first two.Although the acting by everyone involved, cop characters included (Tatsuya Nakadai and Yutaka Sada are surprisingly good, the later even with limited screen time), Kurosawa keeps the film deliberately paced. Another director (more modern perhaps, but maybe not) might cut to the chase quicker, cutting past most of the investigation details, and even the emotional high-points in the first act. But Kurosawa is as interested in the nature and details of what the police do as he is with the compositions, which are constructed and framed as only an artist would do. The film creates a superb juxtaposition as well- Mifune's Gondo is enraged about what will happen with his money, but his morals stand above everything in his business affairs. Meanwhile, the cops here aren't cruel and unforgiving, but professionals trying to crack a case that the audience can hang onto. And then when the \"seedy\" underbelly of the city comes into view, it's looked on with at least some compassion by Kurosawa, and it's not too over-the-top.If all your looking for is thrill after thrill, like in Sanjuro or even Hidden Fortress, look elsewhere- the violence, by the way, is kept to a low level for this one (it'd even be quite suitable for kids, if they don't mind the subtitles and quintessential intensity in the Japanese style of film acting). But for tight, often gripping suspense in the IL' 'whodunit' mystery tale, this is a keeper. Manipulative, perhaps, yet in the hands of a master it's an exemplary deal. And, in the end, it even provides a sad, existential kind of conclusion as good and evil become blurred as the kidnapper looks through glass at the disillusioned Gondo. It's one of the great endings in world cinema. A+"
    },
    {
      "username": "jemmytee",
      "userUrl": "https://www.imdb.com/user/ur2466469",
      "reviewLink": "https://www.imdb.com/review/rw0083651",
      "warningSpoilers": false,
      "date": "1 August 2004",
      "rate": "10",
      "helpful": "110 out of 122 found this helpful.",
      "title": "Kurosawa at his best and most subtle",
      "content": "This is one of those rare movies I had to watch twice to catch all the meaning and beauty of its construction, that is how sleek and polished this film is. The storyline is deceptively simple -- a businessman named Gondo is about to take control of the company he's worked in for years when he's told his son's been kidnapped. It turns out the kidnappers got his chauffeur's son by mistake, but they still want him to pay the ransom. If he does, he will be financially ruined. If he doesn't, he will be reviled. Which will he choose? This makes up the first half of the movie, culminating in a breathtaking scene on one of Japan's bullet trains. The second half is the police search for the kidnapper/murderer and how a case is built that will take him to the gallows.Now this sounds like your typical cop thriller, the type Hollywood churns out with one hand tied behind its back, but Kurosawa makes it into a meditation on honor and decency, and on how one's choices can lead one to Heaven or to Hell in little steps that seem to be taking you nowhere. Gondo is an honorable man who worked hard to built himself a life of wealth and power. This is no small feat, considering Japan is not known as a society where one can easily change one's station in life, so this adds to his dilemma; he will not only lose his fortune, he will also lose his hard-gained power and respect in the business community, all for a child that is not even his. And not only will he lose but his own wife and son will, as well. But to NOT pay the ransom means he will lose everything in him that is human and decent, and his wife and son will suffer from that, too.This is a big deal -- not just in Japanese society but in the world as a whole. It doesn't matter if you live in Nepal or Kenya or Argentina or New York City, when faced with the choice of losing your position in your society or losing your soul, which would you choose? And would you still make that choice knowing that even if the cops catch the bad guy, it will make no difference in your own circumstances? Just a glance at some of the recent stock scandals gives you a good idea of where most people fall in their choices. And even Ed McBain, upon whose novel this movie is based, knew how hard it would be to give up your world for your spirit; his businessman refuses to pay the ransom.To me, this movie is Kurosawa at his best and most subtle. Every shot is composed and measured and done just right. Not all films have to have bombs exploding and chase scenes and people going \"Boo!\" to affect you; sometimes just a man riding on a train en route to what he knows will be a catastrophe to him and his world is enough to make you thank the heavens for a story well told."
    },
    {
      "username": "kmscb-1",
      "userUrl": "https://www.imdb.com/user/ur3647281",
      "reviewLink": "https://www.imdb.com/review/rw0083652",
      "warningSpoilers": false,
      "date": "27 July 2004",
      "rate": "10",
      "helpful": "105 out of 115 found this helpful.",
      "title": "The film \"Ransom\" could have been.",
      "content": "\"High and Low\" is one of those deceptive detective-thrillers that sneak in under your radar and grab you from behind with their storytelling magic. It's proof positive of Kurosawa's mastery of film and all its imagery.The story was adapted from an Ed McBain \"87th Precinct\" novel, \"King's Ransom\", and is really very simple. A successful businessman (Mr. Gondo) in the middle of a major deal is told his son has been kidnapped. All concerns about money fly out the window...until Gondo learns it was actually his chauffeur's son who was taken by mistake. Doesn't matter; the kidnapper still wants him to pay the ransom, even though it will bankrupt him. Will Gondo destroy his standing in the business world to save the life of a child that is not even his? Or will he just leave it to the police and fate to determine whether the child lives or dies? This makes up the first half of the film.The second half deals with the search for the kidnapper and his accomplices, and it does not shy away from showing how dull and grueling good police work is. Step by step, the cops narrow their field of suspects and build their evidence to link their prey to murder as well as the kidnapping, meaning he would face execution. This makes up the second half of the film.It helps to know that in the original story, the businessman refuses to pay the ransom but does help the police track down the kidnappers. It also helps to understand that in Japan, working your way up from making shoes and satchels by hand to being in a position where you could wind up owning the company is a HUGE accomplishment in a caste driven society. It means he is due additional respect, and this is what Gondo faces losing if he pays the ransom, which is far more important than the fact that he will be driven into bankruptcy. From the first scene through an amazingly exciting section on a bullet train to the ending moments between Gondo and the kidnapper, Kurosawa shows exactly why he is a master of cinema. To take what is basically an episode of \"Law and Order\" and make it into a meditation on the meaning of life and evil is not something just any film school twit could do.To me, the best moment on a human level comes when Gondo descends the stairs the morning after the kidnapping to explain to the police why he cannot pay the ransom for a child not even his. You can see the man realizing he is allowing himself go to hell in order to protect his family and station in life, and Toshiro Mifune underplays it beautifully...and Kurosawa lets it just simply happen. Wonderful.THIS is the movie Mel Gibson's \"Ransom\" wishes it had been. something real and human and meaningful instead of merely kick-ass.Ten out of ten stars."
    },
    {
      "username": "reelreviewsandrecommendations",
      "userUrl": "https://www.imdb.com/user/ur140941989",
      "reviewLink": "https://www.imdb.com/review/rw8792777",
      "warningSpoilers": false,
      "date": "11 January 2023",
      "rate": "9",
      "helpful": "17 out of 18 found this helpful.",
      "title": "A Powerful Police Procedural",
      "content": "Kingo Gondo is a wealthy executive at the National Shoes company in Yokohama. He aims to make affordable, sturdy footwear for the masses. His co-workers opt instead for those of the cheap, low-quality variety that will wear easily, meaning they will need to be replaced often. In secret, Gondo organizes a leveraged buyout of the company, mortgaging all he has to afford it. However, just before he makes the deal, the son of his chauffeur is kidnapped and held for ransom. It's clear the kidnappers intended to kidnap Gondo's child, and he feels just as responsible as if they had. Will the police- led by the capable Inspector Tokura- be able to find the child and solve the extortion plot before it's too late?Loosely based on Ed McBain's novel 'King's Ransom,' Akira Kurosawa's 'High and Low' is a powerful police procedural that will keep viewers' attentions held rapt from start to finish. With a screenplay by Kurosawa, Hideo Oguni, Ryûzô Kikushima and Eijirô Hisaita, the film examines many themes in an eloquent manner, including those of honor and morality. It also paints a picture of then-contemporary Yokohama as a city built upon an endemic inequality between the classes, and shows how easily the disenfranchised and impecunious can fall into a life of crime.'High and Low' is a tense thriller that feels most authentic. Kurosawa shows us with precision the minutia that the police engage in, how they build their case and begin scavenging the city for clues to the kidnapping. Slowly, but steadily, headway is made, and Kurosawa doesn't rush the procedural process of the investigation. This is not to say the film is in any way slow-moving or drawn out, because the opposite is the case: 'High and Low' rockets along at a brisk pace, feeling all too short at 143 minutes; if anything.The film reunites Kurosawa with cinematographers Asakazu Nakai and Takao Saitô, whose camera-work and shot construction is mightily impressive. 'High and Low' has an assured visual style, and the utilization of shadows is most striking. There is one instance of color being used in the film, which is to great effect; while the remainder of the black and white cinematography is rich and textured. Though he made some beautiful looking pictures in his time, the naturalism and style with which 'High and Low' is captured makes it a standout in Kurosawa's filmography.As do the terrific, power-house performances from his cast. His second-to-last collaboration with the incomparable Toshirô Mifune, here his original muse stars as Gondo, giving a masterful performance of much restraint. Mifune creates in Gondo an initially fastidious character, whose evolution over the course of the film feels both authentic and subtle. Often, when one thinks of Kurosawa and Mifune, the Samurai pictures spring first to mind; though their work together here is just as impactful and entertaining as any of those earlier films.Co-starring as Inspector Tokura is Kurosawa's second muse, the great Tatsuya Nakadai. Always a commanding presence on screen, he plays Tokura as a charming, determined detective who will do anything to catch his man. Though he has less emotional volubility to exhibit in the role, Nakadai performs just as strongly as Mifune; and neither man overshadows the other. Additionally, in a small but pivotal role stars Tsutomu Yamazaki, who showcases much depth and range, leaving a lasting impression on the viewer.Thrilling from beginning to end, Akira Kurosawa's 'High and Low' is a brilliant piece of film noir, featuring an interesting examination of class at its center. Boasting stunning cinematography, as well as strong performances from all in the cast, there is little fault one can find with it. If you haven't seen it before, and you're a fan of police procedurals, they look no further: for 'High and Low' is a masterpiece of the genre."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8786471",
      "warningSpoilers": false,
      "date": "8 January 2023",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Another Kurosawa masterpiece.",
      "content": "The only of a successful shoe company receives a ransom demand for his son, but it's a case of mistaken identity.This is the second film I've watched from Akira Kurosawa, I was pretty blown away by his skills when I watched Seven Samurai only recently, I'm making it my mission to see more.I see the quality of Seven Samurai is replicated here as well, I was totally blindsided, this is one supremely good film.I suppose it's a story about justice, in some ways it's a game of cat and mouse, but it's broader than that, it deals with class, justice, morals and so much more.After a fairly slow moving, but intense opening, it builds as it develops, picking up the pace, in some points it's a fast moving film, the only issue I had was reading the subtitles, as it does move by very quickly, some scenes I had to rewind once or twice to digest.I love 60's crime films and shows, the likes of Hitchcock, Wallace and Durbridge, there are so many twists and turns here, this will keep you entertained from start to finish.10/10."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw4119356",
      "warningSpoilers": true,
      "date": "6 April 2018",
      "rate": "8",
      "helpful": "8 out of 10 found this helpful.",
      "title": "\"I'd rather be told the cruel truth than to be fed gentle lies.\"",
      "content": "Up till now I've only seen Toshiro Mifune in Kurosawa's samurai movies, so it was kind of comical to see and hear him in this film when he stated \"Shoes are my life\". It just struck me as rather funny, but then, almost on a dime, Mifune's character Kingo Gondo reacted to his young son playing cowboys with a friend by stating that in a tense situation, \"Man must kill or be killed\". That had to be a subliminal rationale for Gondo's decision to wrest control of his National Shoe Company away from the owner and executive board. Borrowing against everything he owned, he was about to make a business deal that would have set him up for life.The first half of this movie sets up a moral dilemma for Gondo after a kidnapping gone awry puts him in the position of having to come up with a thirty million yen ransom, not for his own son, but for the son of his chauffeur. Without having knowledge of the Japanese mindset, I had trouble understanding why Gondo would have refused to pay the ransom if it meant his son's friend might be faced with death at the hands of a maniacal kidnapper. Granted, we had insight on the strings Gondo had to pull in order to put together the takeover plan for his company, but to my mind, the scales were balanced in favor of saving the kid. It was interesting to see how it was Gondo's wife and chauffeur who appealed to his better nature and not the police detectives assigned to the kidnapping case. Chief Inspector Tokura (Tatsuya Nakadai) remained emotionally detached during these confrontations, which struck me as somewhat odd.What's also intriguing is how the film switches gears in the second half after the ransom demand is finally met, and the police begin their work to solve the crime and capture the kidnapper. The forensic work of the detectives is quite significant in scope, taking into account such features as train schedules, landscape, locations of phone booths near Gondo's home, and the recollections of the young kidnap victim who was released after the ransom was paid. Having identified the perpetrator however, I was left stymied as to why the detective team failed to make an immediate move on Ginjiro Takeuchi (Tsutomu Yamazaki) when they had a chance more than once on the street. Since the apprehension was eventually made at a hideout location identified by Tokura, it didn't make sense to me why the police waited, other than as a concession to the script. Nothing of significance occurred with the kidnap suspect to suggest the cops should have delayed.The final sequence in which Takeuchi requested a face to face meeting with Gondo reminded me of a similar scene in the 1938 film \"Angels With Dirty Faces\". Only in that movie, Cagney's Rocky Sullivan went 'yellow' at the request of his childhood friend Father Jerry, whereas Takeuchi transformed from an arrogant and smug wise guy into that of a cowardly punk in the face of execution for the murder of his two associates in the kidnapping case. Except for Gondo appearing at the meeting with Takeuchi, the disappearance of Mifune's character in the second half of the story almost made it feel like one is watching a different movie."
    },
    {
      "username": "dorlago",
      "userUrl": "https://www.imdb.com/user/ur1214432",
      "reviewLink": "https://www.imdb.com/review/rw0083634",
      "warningSpoilers": false,
      "date": "10 October 2001",
      "rate": "10",
      "helpful": "52 out of 63 found this helpful.",
      "title": "Intense and Highly Entertaining",
      "content": "\"High and Low\" could be considered two movies. The first, \"High\" takes place in Kingo Gondo's (Mifune's) hilltop mansion. The crime occurs and what follows in the next hour is one of the most meticulous and brilliantly constructed film segments I have ever seen! The first half of the film could almost be considered theatre. It is static and deceptively simple but.....so intense! The ensemble acting is superb with Mifune a stand out as usual! Connecting these two movies is the train sequence. After the calculated intensity of the first part this scene comes at you like a sledgehammer! These four or five minutes are magnificent! So very exciting and so very quick it leaves you drained when it ends! \"Low\" begins with the hunt for the criminal. Only \"Stray Dog\" comes closer to capturing the cop's decent into hell. This last part of the film is fast and furious. We are no longer an observer. We have become part of the chase. First, we know who the criminal is. The police do not know and what follows is a fascinating puzzle being put together before our eyes! The last scene in the film is unexpected, deeply disturbing and left me numb and staring at the TV screen after the film had ended. Like Gondo we are left with the answers that we did not want to hear."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1132507",
      "warningSpoilers": false,
      "date": "22 July 2005",
      "rate": "9",
      "helpful": "11 out of 17 found this helpful.",
      "title": "highly underrated Kurasawa flick",
      "content": "Too often when people talk about Akira Kurasawa, they emphasize the samurai movies he made so much that the average film buff might incorrectly assumed that's all he did. In fact, most of his films were NOT about the samurai culture, but about modern Japan.Among the best of these non-samurai movies are Ikiru, Scandal, The Bad Sleep Well and this film. High And Low is set in contemporary Japan and it's the story of a kidnapping. The first half of the film centers mostly on the Toshiro Mifune character and the impact of the kidnapping on him. It seems the kidnappers accidentally kidnapped the chauffeur's son and not the one belonging to corporate big-shot Mifune. He struggles with whether or not to pay the extremely high ransom, as it will likely bankrupt him and his family. This dilemma is handled very well. The second half of the film is centered on the forensics and police footwork done to try to bring the perpetrators to justice.Particularly outstanding in this film is the pacing. Some might consider it to be a bit slow, but I loved how they fused a human drama with the step-by-step police work (similar to a Law And Order episode in how it unfolds, but in even greater detail and attention to realism). The acting is also top-notch, though it is not a \"Toshiro Mifune\" movie per se, as he barely appears in the second half of the film. Instead, it's an ensemble film starring many actors you might recognize from previous Kurasawa flicks.I saw this on a Criterion DVD. The picture quality was absolutely PERFECT--like the print was just made yesterday. However, it was very disappointing to see that this DVD had NO EXTRAS!!! That's a little unusual for a Criterion DVD--so often they have great special features--often several."
    },
    {
      "username": "Craig-32",
      "userUrl": "https://www.imdb.com/user/ur0137509",
      "reviewLink": "https://www.imdb.com/review/rw0083639",
      "warningSpoilers": false,
      "date": "23 September 1999",
      "rate": "",
      "helpful": "33 out of 41 found this helpful.",
      "title": "Another Great Film from Japan's Master Filmmaker",
      "content": "While I've seen HIGH AND LOW referred to as a \"film noir,\" a \"detective drama,\" a \"riveting game of cat-and-mouse,\" and so on into infinity, I think those terms tend to underestimate some very great films (such as this and Kubrick's THE KILLING) and attempts to place them within boundaries over which the expanse of a few powerful films such as these spill.Indeed HIGH AND LOW is a story involving some familiar techniques from film noir; the detective story; and the hunter-and-hunted storyline, but it surpasses so many films that might be included in a list of fine films noires. It, in true Kurosawa style (one which Stanley Kubrick matched blow-for-blow, seeming to complement one another in their stunning gifts to the cinema), stands as a fable showing the differences and tensions which the coexistance of different classes creates.Gondo, the rich on high, receives torment from those who live below him, being literally perched upon a hill, overlooking the city in a feudalistic way, in which the king's palace gazes down upon the serfs below. As the kidnapper says, \"it's hot as hell down here. But you wouldn't know that, you have air conditioning.\" Thus we see the parallels pile upon each other: it is about class warfare but also shows the differences between heaven and hell; and Gondo makes both a descent and ascent simultaneously.The plot is simple, but the truth is complicated, and I won't go into it here, but take my word as it stands: this is an amazing piece of film. See it now or regret it! Every Kurosawa film is sublime."
    },
    {
      "username": "theorbys",
      "userUrl": "https://www.imdb.com/user/ur0415977",
      "reviewLink": "https://www.imdb.com/review/rw0083640",
      "warningSpoilers": false,
      "date": "7 October 1999",
      "rate": "10",
      "helpful": "63 out of 82 found this helpful.",
      "title": "About the best police procedural you're ever likely to see",
      "content": "Toshiro Mifune is a businessman in a Japan that is on the brink of the Economic Miracle of the Sixties. He is an honest man who loves his job as a shoe factory exec and is in a battle for corporate control against a pack of hyenas. He has mortgaged and borrowed and scraped to raise the money for a surprise coup when his son is kidnapped. But there is a major plot twist: it is not HIS son that was taken but his son's playmate, the chauffeur's kid and the ransom demanded is astronomical. If he pays he will lose everything he has worked so hard for, but can he just sacrifice the chauffeur's child because it is not his? From here on High and Low (perhaps better translated as Heaven and Hell) is a police procedural based on an Ed McBain 87th precinct story.Watching this film I had a rare, almost unique, experience. I saw it on a fairly screen tv, letterboxed, in a darkened room. All the preceding conditions helped contribute to put me into an objective/subjective middle ground where I had the feeling of looking through a special visor that allowed me to see the world by means of an almost perfect film as if through the eyes of a cinematic genius who is in total command of his artistic means and in total command of his subject matter. I think the key to this experience is that while High and Low is interesting as human drama, it is yet peculiarly uninvolving emotionally but very involving cinematically. These distances are important in Kurosawa's films (he is high on my list of top ten directors but after Welles). In IKIRU you probably could not be more deeply involved emotionally, while in RAN there is nothing but relentless distance.I think a good companion film to watch with this would be Kurosawa's earlier, looser, but much more individually tense, police film STRAY DOG (this time Mifune is the cop)"
    },
    {
      "username": "marstokyo",
      "userUrl": "https://www.imdb.com/user/ur4007535",
      "reviewLink": "https://www.imdb.com/review/rw0083655",
      "warningSpoilers": false,
      "date": "25 September 2004",
      "rate": "9",
      "helpful": "41 out of 49 found this helpful.",
      "title": "I was enthralled from start to finish.",
      "content": "This movie was incredible!! They called it Film Noir but, my God, it's so much better than THAT-- This film out-Hitchcocks Hitchcock! And I'm a Hitchcock devotee. The issues Kurosawa wrestles with in this, and his other films; the ethic responsibility we have as humans, humanity vs. greed, crime and punishment are universally understood. Nothing he presents in black and white(except literally in the film stock)-- but every shade of grey is reflected on. The story unfolds slowly but contains many twists and turns as the viewer questions the motives of each character. It's not just the force of good against evil--but a question of what is morally right and morally wrong. The title itself clues the viewer in to the ambiguities of class, greed, and moral ethic."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0083646",
      "warningSpoilers": true,
      "date": "9 July 2002",
      "rate": "",
      "helpful": "11 out of 18 found this helpful.",
      "title": "Challenging Decomposition",
      "content": "Spoilers herein.Kurosawa is a giant, both as a film intellectual and as master visualist. But unlike Welles, he moved away from flamboyance and in this film moves into actual meditation after the fashion of Eric Rohmer. What we have is a long (by conventional standards) decomposition of a painting. Greenaway would later use this idea in `Draughtsman's Contract.'The first part of the film is the presentation of the painting: several characters in a room -- Gondo, his wife, his assistant, his driver, and several policemen who we yet know little about. This section is very technical visually with the camera composing every conceivable combination of these people in this room. This is _not_ like `Rope,' where the intent was to confine the film itself. Here we use the space as a device to frame the images, that's all.This section of the film is a complex painting like say Vermeer, but we have the luxury of seeing it in all its possibilities. Once we have exhausted these possibilities, we have a short section which triggers the decomposition of characters. The train introduces motion and extent that we live with for the remainder.Then the decomposition proper. The participants in the painting struggle with logic and clues to understand what it all means. In turn, we discover something about each of the individuals that constituted the initial tableau. There are no extraordinary people or events here and I presume that's the point. The solution to the crime is simply that someone else saw the same tableau through the windows and didn't like/understand it. The `viewing' of the film takes place on four levels: that of us the audience, that of the examining police, that of the voyeur kidnapper, and that of the `public' through the popular media. It is `Rashomon' folded into itself.This is somewhat challenging, but worth it: durable yet stylish."
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw4919903",
      "warningSpoilers": false,
      "date": "7 June 2019",
      "rate": "10",
      "helpful": "8 out of 12 found this helpful.",
      "title": "Morality as a choice-driven virtue, not a duty...",
      "content": "\"High and Low\" is Akira Kurosawa's unsung masterpiece, it's strikingly similar to \"Straw Dog\" in its meticulous depiction of police procedural and the indirect canvas it offers for an exploration of Japan's social strata in the mid-sixties, from the highest layers to the lowest depths, presenting in painstaking precision the cohabitation between the upper and lower classes, made of protocoled compliance and officious defiance. It's one of the few modern dramas directed by the Master, as if his usual period \"Samurai\" movies wouldn't fit the social significance he's aiming at.To understand that, one should get to Kurosawa's vision of humanism, only a virtue if the character has a choice. In his Jidageiki movies, samurai or warriors lived under a code so strict that their bravery was closer to the realms of duty than genuine heroism. Only until his masterpieces in color, Kurosawa could portray characters the viewers could both admire and relate to, from the petty criminal played by Tatsuya Nakadai, charged to impersonate a lord in \"Kagemusha\" to the greedy and ambitious sons in \"Ran\", Kurosawa was never better as painting the flaws of humanity with a firm but forgiving hand and this is why \"Rashomon\" is such a milestone, it offered a new vision of characterization, not relying on personalities' actions but on their perception by or resonance on other people's live. Kurosawa is perhaps to cinema both an Einstein and a Sartre, bringing relativity and existentialism.We're good or we're bad by choice not by duty.This is why there always comes a point in his dramas when a flawed character chooses his destiny and this is why it never worked better than in movies set in the contemporary world such as \"Drunken Angel\" and \"Ikiru\" and even more in police procedurals like \"Stray Dog\" because these film offered a panoramic view on a Japanese society devoid of such codes of honor as the Bushido, so socially broad and ethically uncertain that it became the arena where the forces of evil and good, greed and generosity, calculations and disinterest, confronted each other. \"High and Low\" is the culmination of that introspection through one of the most painful choices ever forced upon a man, so vital to the film's emotional backbone that it needed a twenty-minute set-up. The opening is a remarkable exercise in exposition all in detail in concision as if Kurosawa was already experimenting in his directing style the same rigor applied by the detectives in charge of the case.The residence of Mr.Gondo (Toshiro Mifune) is located at the top of a hill offering a panoramic view on the lowest parts, it's vast, well-furnished, his boy has a cowboy disguise and plays with the chauffeur's son, which means that he's rich enough to be a chauffeur. Gondo is a no-nonsense self-made-man and one of the stockholders of a huge national shoe company and is coerced by his associates to make a move against the president whose old-fashioned views are incompatible with their visions of profitability, making lesser shoes but with higher profits. Gondo refuses the deal but what we take for a proof of integrity is contradicted by his plan, he bought enough stock to lead the company alone, which forced him to mortgage his house and twenty years of social ladder climbing; it's a fool-proof make-it-or-break. One phone-call later, he learns that his son has been kidnapped for a ransom of 30 million yens, we expect Gondo to pay, but that would be too easy, there's a catch in that plot.If not the best or the most iconic Kurosawa, \"High and Low\" has certainly the greatest premise, the boy was the chauffeur's son, the two kids had switched disguises. The cops come, the chauffeur keeps quiet until he hears his son and then begs his boss to do something. The kidnapper realizes his mistake (which makes sense since there's no reason the son would pretend to be Gondo's) but the dilemma is all the same, either Gondo pays and jeopardizes his future or he lets the kid die. That's the equation. We know a man like Gondo will be likely to pay, it's interesting however to watch him examin his own conscience under the tacit observance of the police officer played by Nakadai. At that point of the review, I don't want to spoil much of the film because it is one to experience, and on three levels: the ethical dilemma, the police investigation and the social documentary on Japan in the 60s where the absorption of the Western way of life went at the expenses of the ancient codes.While the first part is set completely in Gondo's house, a fitting bridge sequence makes the transition to the investigation that will structure the entire second part, with tracing calls, interrogation, tailings, facial composites and all the archetypes. Gondo is absent for the most part but we feel his presence from the efforts displayed by the public opinion, the chauffeur, his son and the police. Such a fruitful zeal couldn't have been possible if the right choice wasn't made; which raises a challenging question: is it always a matter of doing your job or is morality the true driver or people's actions? Had Gondo made the wrong choice, his public and private aura would've been destroyed, his decision was moral and ethical but let's not pretend it wasn't also practical. Still, maybe it's because Gondo climbed so high that he could have a full view on the low he could sink, materially or symbolically.And when the investigation leads us to the criminal, we realizes he'd jus offered us the perfect counter-example as man who was so low that he saw the highest spot reached by Gondo with envy and jealousy instead of climbing his way to the top. Indeed \"High and Low\" is a captivating immersion into the heights humanity can raise itself above and the lowest lows it can plunge in... and it's a terrific cop thriller!"
    },
    {
      "username": "Steffi_P",
      "userUrl": "https://www.imdb.com/user/ur3063013",
      "reviewLink": "https://www.imdb.com/review/rw1738485",
      "warningSpoilers": false,
      "date": "30 September 2007",
      "rate": "7",
      "helpful": "12 out of 18 found this helpful.",
      "title": "\"It's very interesting to make fortunate people unfortunate\"",
      "content": "In the late 50s and early 60s Kurosawa's pictures began to get increasingly pessimistic and depersonalised. High and Low pretty much represents the peak of this trend, a film noir every bit as cynical and universal in its condemnations as Robert Aldrich's Kiss Me Deadly or Orson Welles' Touch of Evil.Kurosawa's style is sometimes hard to categorise, because he was always adapting it to suit the story. Here, we get very contrasting styles within the one film, which is informally divided into three \"acts\". The first, set in millionaire Gondo's mansion is composed in whites and lights, with few cuts or close-ups. The middle section, in which the detectives track down the kidnapper, is constructed with point-by-point technicality, and a sense of urgency with short scenes and plenty of cross-cuts. The final act is the titular \"low\"  a look at Tokyo's seedy underbelly, with low key lighting, agonising close-ups and awkward angles.This structure is perhaps where the problems of High and Low lie. It's occasionally uneven and doesn't flow well as a whole. The first act is the best - a tight, confined drama like Hitchcock's Rope. Kurosawa's handling of his characters' emotional turmoil is expertly choreographed in the placement of actors and cameras  for example, you often have everyone looking in opposite directions as if unable to face each other. The middle section has some good tension to it, but is a little too technical and formulaic. The final act looks great, but that is its very problem. There is so much going on  particularly in the sleazy nightclub  that you end up caught up focusing on all the background details rather than the actual plot. It's great as a kind of realist expose, but doesn't sit well in a thriller.The biggest trouble with the structure of High and Low is that we never really get to grips with any of the characters. There is no consistent hero or anti-hero, no single individual whose eyes we see the story through. The businessman played by Mifune is the closest thing we have to a protagonist, but he is all but dropped from the storyline after the first hour. There is not much depth to the detective characters. The kidnapper is a complex character but the focus on him is constantly shifting.While certain aspects of the picture seem really well thought out, others simply appear to be nothing more than Kurosawa going through familiar motions. Like his previous noir-ish thriller Stray Dog (1949) High and Low takes place during a heat wave, but this is not so fully emphasised as in the earlier picture and so has little real effect. Kurosawa returns to his theme of blurring social status (the chauffeur's boy being mistaken for Gondo's son despite their differing \"values\" reminds me of the disguised princess in Hidden Fortress or Mifune's wannabe-Samurai in Seven Samurai), but any emotional depth is stifled under the picture's tone of selfishness and sleaze.High and Low's score seems deliberately weird and minimalist, and perhaps just a bit too simplistic. There is great sound design though, particularly the eerie distant noises of the city as heard from Gondo's house. This is one of High and Low's best features, and its interesting to note the picture was made around the same time as Hitchcock's The Birds, which experimentally uses a sound design of bird noises in place of a musical score.Like some of Hitchcock's thrillers, High and Low is gripping when watched for the first time, but loses its appeal on repeated viewings. Kurosawa was to follow it up with Red Beard, which is heavy-handedly optimistic and humanist, perhaps to make up for the cynicism of its predecessors. Red Beard and High and Low are my two least favourite Kurosawa pictures and for me this was a real low point in his career, where his message making got in the way of his ability to tell a good story."
    },
    {
      "username": "ross_d",
      "userUrl": "https://www.imdb.com/user/ur0761497",
      "reviewLink": "https://www.imdb.com/review/rw0083628",
      "warningSpoilers": false,
      "date": "14 February 2001",
      "rate": "10",
      "helpful": "33 out of 43 found this helpful.",
      "title": "The masterpiece of the \"police procedural\" genre",
      "content": "This is one of the outstanding detective films. For me, the most remarkable feature of this film is its architecture - the beginning is a long, static set piece taking place in one room. however, about a third of the way through the movie, it erupts into action, showing the resourcefulness of a largely blue collar police force tracking a lone sociopathic criminal.The film is a fascinating portrait of '60's Japan, but at the same time reveals its roots in Ed McBain's _King's Ransom_, from which it was taken.This is one of those films which doesn't seem to age after several viewings. Especially affecting are the police detectives, whose proletarian roots contrast sharply with the cold insensitivity of the powerful corporate executives. But the police find a hero in Gondo, the rebellious general manager who stakes his entire fortune to rescue his chauffeur's son. The admiration that the police detectives feel for him is one of the key emotions in the film."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3366608",
      "warningSpoilers": false,
      "date": "5 December 2015",
      "rate": "9",
      "helpful": "3 out of 4 found this helpful.",
      "title": "Top-tier Kurosawa thriller",
      "content": "HIGH AND LOW is one of the excellent contemporary thrillers that Akira Kurosawa made during the peak of his career. Unfortunately it's a sub-genre that seems mostly forgotten about today, passed over in favour of Kurosawa's well-renowned samurai movies. It's a shame because these films often have just as much to offer.HIGH AND LOW tells a detailed, lengthy story about a kidnapping and subsequent police investigation. It's a long and slow-moving film but one which rewards close submersion into the storyline and narrative. Toshiro Mifune is cast against type playing a hard-headed shoe factory boss whose son is kidnapped for ransom. However, the kidnapper gets his kids mixed up and accidentally kidnaps the chauffeur's son instead.What follows is tense, well-shot and superbly acted, as are the majority of the director's films. Mifune gives a bullishly realistic turn as the proud factory boss but it's Tatsuya Nakadai who really shines as the smooth detective brought in to solve the case. Watch out for Kurosawa regular Takashi Shimura in the minor role of the police chief. Essentially HIGH AND LOW is a film in two parts, and the original Japanese title - HEAVEN AND HELL - gives some idea of Kurosawa's thematic ideas. Watching these characters descend into a literal and figurative Hell makes for unmissable cinema."
    },
    {
      "username": "kenzel",
      "userUrl": "https://www.imdb.com/user/ur4295114",
      "reviewLink": "https://www.imdb.com/review/rw0973854",
      "warningSpoilers": true,
      "date": "1 December 2004",
      "rate": "",
      "helpful": "21 out of 27 found this helpful.",
      "title": "Heaven and Hell",
      "content": "Possible SpoilersA film of expert and scrupulous construction, High and Low demonstrates how a gifted filmmaker can control the structure of a film to enhance tension and narrative suspense. This film came at the zenith of Kurosawa's career and his skill is apparent in every shot; it is the work of a man who possesses complete mastery of his craft, and the movie is a masterpiece of 'constructional' film. Externally High and Low is about a kidnapping case, but as the title suggests, it is also about paradox, and relationship between polar opposites. The film can be enjoyed at both levels, either as a suspenseful police procedural, or as a meditation on opposite and similar existences. Because Kuroswa intertwines both, the film is extremely engaging. As in Ikiru, Kurosawa forces the viewer to abstain from empathizing with the characters, and it is through this method that the viewer can learn from them and appreciate the situations they exist in. One of the few films to create suspense through structure, High and Low deserves special notice. It is in this aspect that Kurosawa's expertise really shows. As in Ikiru, High and Low is broken into separate parts. The first trimester takes place entirely in a living room. The angled shots, intense close-ups, unchanging setting, and the viewers anticipations all contribute to an acute suspense that culminates in one of the most powerful transitions to ever take place in film. The transition scene occurs one a train, and the sense of motion and speed allow the viewer to experience tension and excitement merely through change in setting and suggestion of motion. Once the suspense is resolved the movie takes the form of a detective story, as the kidnapping culprit is sought after. The procedure is very interesting and the methods and processes of the detectives easily intrigue the viewer. The discovery of the culprit is accomplished through a brilliant sequence of editing, in which Kurosawa demonstrates his skills with one of the most fluid and seamless series of cuts in filmic history. Afterwards the detectives pursue the criminal and the film reaches conclusion with his capture. As always Kurosawa's shot composition is gorgeous, but in High and Low it also serves to support Kurosawa's affirmations about man. High angles and low shots combine with intense close-ups to elevate tension and remind the viewer of the films ever-present motifs. As previously stated the editing is worthy of special notice. The acting is superb, but not as prominent or vital to the film as others of Kurosawa. Sound is used carefully and successfully, and dialogue is minimal but effective. High and Low must be seen by Kurosawa devotees and fans of well-crafted cinema."
    },
    {
      "username": "pete-283",
      "userUrl": "https://www.imdb.com/user/ur0748603",
      "reviewLink": "https://www.imdb.com/review/rw0083643",
      "warningSpoilers": false,
      "date": "18 June 2000",
      "rate": "10",
      "helpful": "36 out of 49 found this helpful.",
      "title": "Best crime film of 1960s, among the best all time",
      "content": "Even at nearly two and a half hours, this movie can rivet even casual movie-watchers. High and Low was adapted from the novel \"King's Ransom\" by Ed McBain, and though I haven't read the novel, the film stands up surprisingly in a completely different setting (Japan, as opposed to America). The script is great, the cinematography is outstanding, and if you're watching the Criterion print available on DVD you'll find yourself wondering if it was really made in 1963. This film scores an easy 10 with me. I can't think of a crime film that I enjoyed more than this one."
    },
    {
      "username": "fuyuno",
      "userUrl": "https://www.imdb.com/user/ur0248308",
      "reviewLink": "https://www.imdb.com/review/rw0083625",
      "warningSpoilers": false,
      "date": "19 February 1999",
      "rate": "",
      "helpful": "16 out of 23 found this helpful.",
      "title": "Great suspenceful crime story. Fine performances early in the careers of future stars.",
      "content": "A child of a chauffeur is mistakenly kidnapped in the place of a businessman's son. The businessman, involved in a high-stakes takeover of his company from his erring bosses, chooses to risk losing his shirt to pay the ransom for a child not his own. While the clock is ticking on both the businessman's fortune and the child's life, the police decide that they want a sure conviction rather than a quick arrest.A suspenseful crime story based on a novel by Evan Hunter (aka Ed McBain) transported to 1960's Japan. The soon to be famous \"Economic miracle\" is in full swing as Japan rebuilds its war-ravaged landscape. The mix of optimism and despair of the people in the thick of this economic transformation is palpable beneath the multiple story lines of scrappy cops following their hunches, the inventive kidnapper and the businessman.Toshiro Mifune shines as the businessman while Tatuya Nakadai makes a fine appearance as Inspector Tokura. Tsutomu Yamazaki as the kidnapper debuts into a glorious career. Many of the bit players who appear only briefly eventually became big stars notably Eijiro Tono as the worker in a shoe factory and Nekohachi Edoya as the charming engineer who identifies a train, gesturing with chopsticks, by merely listening to recorded sounds."
    },
    {
      "username": "net_orders",
      "userUrl": "https://www.imdb.com/user/ur66450558",
      "reviewLink": "https://www.imdb.com/review/rw3514379",
      "warningSpoilers": true,
      "date": "29 July 2016",
      "rate": "9",
      "helpful": "7 out of 11 found this helpful.",
      "title": "Hitchcock Japanese Style.",
      "content": "Viewed on DVD. Perhaps the best in the Kurosawa canon! A close to seamless cinema/home-video experience with suspense (the nail-biting kind), intrigue (the edge-of-your-seat kind), thrills (due to an excellent script with many NON-telegraphed twists and turns), terrorism, kidnapping, restrained but none-the-less powerful acting (mostly involving the director's acting troupe), etc. The black & white cinematography in ultra wide format (at least 2.35 to 1.0) is often startling with frames always fully utilized (side to side) by the Director. The music score underlines what is on the screen without drawing unnecessary attention to itself. There are many now classic cinema scenes. Those in the police station especially stand out. Every question you may have asked yourself while watching events unfold are methodically raised, explored, and addressed with reasoned discourse (by a cast of about 20 police officers and undercover investigators). Hitchcock Japanese Style And With A Vengeance! (You might want to watch it frequently with the subtitles off to expand your formal/informal Japanese comprehension.) WILLIAM FLANIGAN, PhD."
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw2100621",
      "warningSpoilers": false,
      "date": "23 July 2009",
      "rate": "",
      "helpful": "4 out of 8 found this helpful.",
      "title": "High and Low",
      "content": "High and Low (1963) *** 1/2 (out of 4) Toshiro Mifune plays a rich executive at a show company who is about to take all his possessions and put it into the company so that he can take it over. Before he can do this he gets word that his son has been kidnapped and he has no problem exchanging his money for the life of his son. However, things change when it turns out the kidnappers actually took his chauffeur's son instead. This is another incredibly impressive film for director Akira Kurosawa who certainly knows how to tell a story and get every bit of suspense out of it . The first two hours of this movie is a pure masterpiece, although for me it started to slag during the final twenty-minutes. The pay off to the film really didn't work for me and I'd also add that the whole Dope Alley sequence didn't work either. That still doesn't mean people shouldn't check out this film because the first two hours among some of the most suspenseful moments I've seen from any thriller. The way Kurosawa constructs the action and dialogue sequence is masterfully done and this includes the opening sequence where the father is playing the businessman and laying down certain morals on how a company should make its products. It's even more interested seeing how his morals come into play when he thinks it's his son who has been kidnapped and how those morals change when he finds out it's someone else's. Even more interesting in this first hour are how the police are more interested in the father who has the money instead of the father who's son is actually missing. I think there's a strong message of greed and its evils but also the differences between how the rich and poor can go about such tense situations. The second hour, dealing with the police looking for the kidnapper, is just as interesting, although not as suspenseful. I thought the structure of how the police would do their job was even more interesting because of one of the first sequences where we see all the detectives gathered in a room and talking about the evidence they have gathered in their small parts of the case. Kurosawa's direction is masterful throughout but the performances also deserve a lot of credit. I become more and more obsessed with Mifune each and every time I see him and there's no doubt he's one of the greatest actors to have every appeared in a movie. The way he shows the anger, grief and confusion of his situation is just a marvel to watch and he kept pushing it further and further as the situation continued to grow. Tatsuya Nakadai, Jyoke Kagawa, Tatsuya Mihashi and the rest of the supporting cast are very impressive as well. There's one scene where the detectives turn their backs on Mifune, which had me wondering if it was a homage to 12 ANGRY MEN. Either way, this is an incredibly well made movie that certainly ranks as one of the greatest thrillers out there even with the weak final sequence."
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw2222262",
      "warningSpoilers": true,
      "date": "16 March 2010",
      "rate": "7",
      "helpful": "5 out of 11 found this helpful.",
      "title": "Absorbing Crime Drama.",
      "content": "I hope no one is put off by the fact that this was directed by Akira Kurosawa and has Japanese subtitles. Kurosawa, true, directed some atmospheric stuff. Who can forget the ghost scene in \"Throne of Blood\"? But for all that, his films always packed a commercial wallop.This one will keep you in your seat with your eyes open. It's anything but artsy. What with the overwrought style of acting -- the pacing, the gritting of teeth, the outraged shouting, the sly sneaking about on crowded streets -- this particular atmosphere practically crackles with tension.The opening third introduces us to Toshiro Mifune, the self-made millionaire, who has secretly borrowed all the money he can to buy a controlling interest in National Shoes so that he can make quality products. Naturally the Board of Directors want to make junk shoes and turn a profit -- period. Mifune is not an especially generous or likable guy. He's honest and fair but gruff with his family and employees.Then -- chaos. Some kidnappers have taken his six-year-old son and are demanding 30M yen, which is to say everything that Mifune owns or has borrowed. So far the usual kidnap-for-ransom formula is followed: put the money in unmarked bills in two satchels, don't contact the police, wait for further instructions, and so forth. Mifune immediately agrees but, as is also part of the formula, he contacts the police who sneak into his house and record the calls he gets from the evildoers. We've seen this before, of course, will Glenn Ford or Mel Gibson doing the honors.Then it turns more interesting. By mistake, the kidnappers have taken, not Mifune's son, but that of his devoted chauffeur, who's been a lifelong playmate of Mifune's own boy. A call from the kidnappers confirms the accident but still demands the money.Now what? Should Mifune go broke and reduce him and his family to a state of poverty? In order to save the life of a boy who isn't his own? Interesting dilemma. It's easy for the viewer to say, yes, pay the two dollars. But suppose we were in Mifune's shoes? Wouldn't we be in a state of trichotillomania, caught between Kant's hypothetical imperatives (what's in it for me?) and his categorical imperatives (what's the right thing to do?)? Someone brought that word, trichotillomania, to my attention and I just threw it in for the hell of it. It means a compulsion to pull one's hair out. I'd have had to wait two or three more lifetimes for such an opportunity.Okay. I don't suppose it's necessary to spell out what Mifune decides. He gulps and eats it.That's the first third of the movie, and it's not uninteresting. But then the pace picks up immediately. The miscreants are really clever and manage to outwit the police during the exchange of money and child. But the cops are no dopes either, and we get a rather longish story of their tracking the criminal. It reminded me less of the kind of detective work we see in the kinds of movies sometimes called \"noirs,\" with Humphrey Bogart or Clint Eastwood on the trail, than it did of \"Day of the Jackal,\" made with a European cast and crew. And maybe Fritz Lang's \"M\".Nice scenes aboard one of the famous Bullet Trains. The tempo drops a bit when the now-busted Mifune drops from sight and the police begin trailing the chief suspect. There's a lot of slinking around in sleazy juke joints and junkie alleys and at times I was a little lost about just what was going on. I had to wait for the police report to bring me up to date.The ending, although dramatic enough, was something of a let-down too. I was waiting for the malefactor to turn out to be Mifune's estranged younger brother or something. It had been pointed out more than once that the motive was not just pecuniary but a personal desire to torment Mifune. Instead, though, it was resolved as a matter of complex status envy, with a stranger on the other end.I suppose, though, that that's what the title is meant to reflect -- the difference between the enormously wealthy and the druggies and burn-outs on the louche streets. The symbolism, if that's what it is, is realized concretely in the distinction between Mifune's mansion high on a hill and the shabby apartment of the kidnapper below, stifling in the heat and industrial smog.Kurosawa admitted that he didn't provide many answers in his movies but that the same question seemed to run through his work: Why can't people be happy? He was in a good position to ask, since he evidently suffered from a major mood disorder."
    },
    {
      "username": "Anonymous_Maxine",
      "userUrl": "https://www.imdb.com/user/ur0562732",
      "reviewLink": "https://www.imdb.com/review/rw0083633",
      "warningSpoilers": true,
      "date": "7 August 2001",
      "rate": "10",
      "helpful": "7 out of 14 found this helpful.",
      "title": "Akira Kurosawa uses his tremendous filmmaking talents to analyze the difference between different layers of the social and class structure.",
      "content": "As the title suggests, High and Low deals a lot with class structure and it's finite importance. This film seems to say that there are times when financial success must be set aside for the compassionate preservation of endangered human life. Kingo Gondo is a high powered executive in a prestigious Japanese shoe company, and he is approached by a group of other executives who have a plan to produce different shoes that would bring in more profits. Gondo refuses, because the proposed shoes are cheaply made and fall apart easily. He kicks them out of his house and, very soon after, he gets a call saying that his son has been kidnapped for ransom. It turns out that the kidnappers accidentally kidnapped his chauffeur's son, yet they still demand the ransom.(spoilers) Gondo has borrowed money on everything he owns (including his beautiful house), so that he can buy enough stock to own National Shoes, the company for which he works. He has compiled 50 million yen, and the kidnapper is demanding 30 million yen, an amount that will ruin Gondo's chance to own National Shoes, and will also cost him virtually everything that he owns. At first he refused to pay because it would ruin him and his family, but realizing that he would be hated by the whole country for not paying, he arranges to pay the ransom, and Shinichi, the boy who was kidnapped, is returned. Shinichi's retrieval is followed by an elaborate investigation into the kidnapping case, and the kidnapper is eventually captured and given the death sentence because, in addition to the kidnapping, he also killed three people, two of whom were accomplices in the kidnapping itself.There is also some excellent characterization in high and Low, as is usually the case with Kurosawa's work. Kenjiro Ishiyama, the stocky, bald-headed detective, for example, isa very developed character. When we first see him, he is at Gondo's house, participating in the investigation. It almost seems that he is just a character to fill a place as an investigator, but we later learn a lot more about him. First of all, in a later scene where he is in a car with another investigator, he mentions that Gondo is a nice enough guy, even though he didn't like him when they first met. He said that he can't stand these rich people who feel like they are better than other people, but in this scene it he suggests that he has changed his mind about that. We are able to learn a bit more about him as an individual this way, but it is the scene in which Shinichi is recovered that we really see a new side of him. After the briefcases with the money are thrown out of the train, Shinichi is left by the tracks and the kidnappers take the money and flee. When Gondo and the investigators arrive to retrieve Shinichi, it is Ishiyama who, although briefly, breaks into tears upon his safe recovery. This adds a whole new level to his character that was not seen before.Kurosawa's films are also quite often peppered with examples of irony that are significant to the meaning of the film, and High and Low is clearly no exception. 1.) Gondo fears that if he pays the ransom, he will be ruined financially and professionally, yet when he does pay it, he becomes a national hero and soon has control over a different (although smaller) shoe company which is sure to succeed because of his skyrocketing popularity. 2.)If Gondo pays the ransom, he will lose all power in National Shoes, yet when actually preparing to pay, it is his shoemaking skills that come in handy to insert a tracking device in the cases which are to carry the money. 3.) As mentioned above, the tough, bald-headed detective, who didn't even like Gondo at first, is the one to break into tears when Shinichi is safely retrieved. Kurosawa employs a very subtle filmmaking technique in High and Low, but it was very different from his technique in Kagemusha and Ran. Here, there were many more cuts and there was a lot more motion with the camera, but this was all done in a realistic way, he did not use the camera to alter reality to any real extent. For example, there are numerous panning shots that take place in Gondo's home, but these are mainly just to follow characters as they move about. Another good example is the camerawork that is taken on the train. As they are looking out the window, there are very shaky point of view shots that are very realistic because the investigators are trying to photograph the kidnappers from the train, and this shakiness is what it would look like in real life. Unlike Ran and Kagemusha, High and Low has a very romantic ending. As a matter of fact, most of the film is pretty highly romanticized. Three kidnappers kidnap Shinichi, they get the ransom, Gondo is glorified for his tremendous act of humanity, one kidnapper kills the other two to keep the money himself, Shinichi is returned safely, the kidnapper is eventually caught and sufficiently punished, and Gondo even gets back the vast majority of the ransom money. In the end, the kidnapper gets the death sentence, Gondo gets his money back, and Shinichi is returned safely to his father. This ending is not entirely realistic, but it is a feel good ending that is put on the movie in order to emphasize the various important messages that were communicated throughout the film. Indeed, this seems to be the only way that Kurosawa, as the director, intruded into the story to make his point, which is a characteristic of his subtle genius."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw5169087",
      "warningSpoilers": false,
      "date": "7 October 2019",
      "rate": "10",
      "helpful": "2 out of 3 found this helpful.",
      "title": "Superb: great police-drama mixed with an interesting social and moral angle",
      "content": "A wealthy businessman is told his son has been kidnapped and he will have to pay a very large sum for him to be returned safely. It is then discovered that his son is safe at home: the kidnapper took his chauffeur's son by accident. The kidnapper says this makes no difference: pay up or the child dies. This leaves him with a moral dilemma, as he really needs the money to conclude a very important business deal.Written and directed by Akira Kurosawa, High and Low is superb. It mixes crime/police drama with human drama incredibly seamlessly. As a police drama it is about as perfect as they come: shows the deductive reasoning, hunches and meticulous grunt work required in a criminal investigation. Incredibly engaging as you follow the police chase down their leads.That alone would have made this a 10/10, but the greatness of this movie doesn't end there. We have the moral dilemma the businessman must face: whether to pay to have his chauffeur's son released or use the money to conclude the business deal of a lifetime (with the added incentive that, if the deal doesn't go ahead, his career is over). Interesting social commentary too, especially when the kidnapper's motives are revealed.Might be nearly 2½ hours long but certainly doesn't feel like it, it's so engrossing."
    },
    {
      "username": "Shilo_R_A",
      "userUrl": "https://www.imdb.com/user/ur130729929",
      "reviewLink": "https://www.imdb.com/review/rw7158671",
      "warningSpoilers": false,
      "date": "24 July 2021",
      "rate": "7",
      "helpful": "6 out of 9 found this helpful.",
      "title": "7.5/10 - Maybe I Missed Something?",
      "content": "I mean, I did like it, it was decent, but...I mean, it's rated 9/10 on letterboxd as of now, and I don't really get it. Maybe I miss something.Anyway, High and Low is the first Akira Kurosawa film I've watched. Kurosawa is probably one of the most critically acclaimed japanese directors of all time, and this is one of his most highly regarded films.It tells the story of Gondo, a wealthy executive that tries to take over the shoe company in which he's an executive, National Shoes. He mortgaged everything in order to be able to by enough shares to vote his rivals out, but the night before the deal is closed - his chauffeur's son get kidnapped. The kidnapper calls and demands a ransom of 30 million yen (which, if paid, can cost Gondo his deal and make him lose his job) , or else - the kid dies. The first half of this film is about the dillema and its consequences, and the second half follows the police in their search for the kidnapper.I do like some things about this film. The cinematography is quite decent, and it gives everything weight during the first half and urgency during the final act. I like some subtle ideas that were communicated to the viewer throughout the film (\"all we got is time\", and later the watch in the living room - if you got it you got it), and the kidnapper has interesting personality and motives. The score isn't bad either, and I do like almost everything about the final act. The cinematography there is definitely in its peak for this film, and the story kept me interested throughout it all. The final scene is really great and thought-provoking too. The score is pretty abstract, but it feels very on-point as well.BUT. I just didn't feel it throughout the whole film. I didn't have this spark, this click with the film. Especially during the search for the kidnapper, I feel like this movie can be quite exhausting. Not bad, just a bit slow. It's like those mind-battles in Death Note - it wasn't SUPER boring, but yet, at times, it was exhausting to watch.So, yeah, maybe it doesn't feel that based, but these are my thoughts and feelings, and I did watch the film twice before writing the review, just in case I've missed something, and I do thing that I understand it and its moral take pretty well, but yet, the pacing around the middle of this film brings it down a little for me. I'm feeling a 7.5/10 on this one."
    }
  ],
  "errorMessage": ""
}