{
  "imDbId": "tt0060827",
  "title": "Persona",
  "fullTitle": "Persona (1966)",
  "type": "Movie",
  "year": "1966",
  "items": [
    {
      "username": "howard.schumann",
      "userUrl": "https://www.imdb.com/user/ur0491610",
      "reviewLink": "https://www.imdb.com/review/rw0094926",
      "warningSpoilers": true,
      "date": "21 October 2002",
      "rate": "",
      "helpful": "321 out of 381 found this helpful.",
      "title": "A very powerful personal experience",
      "content": "Ingmar Bergman's mystifying masterpiece, Persona, opens with an image of light from the lamp of a film projector and then the film running through the spools. This is followed by a series of images that includes a spider, a montage from silent comedies, a spike being driven through a man's hand, and faces in a morgue. The film then cuts to an enigmatic picture of a young boy watching women's faces appear on a giant screen directly in front of him. Are these strange images reminding us that we are only observing a film, not reality? As Persona begins, Sister Alma (Bibi Andersson), a nurse, is assigned to care for an actress, Elizabeth Vogler (Liv Ullman) who suddenly ceases to speak in the middle of a performance of Electra. Alma learns that there is nothing physically or psychologically wrong with Elizabeth. She just refuses to communicate verbally. Alma and Elizabeth retreat to the head physician's summer cottage on a small island to complete her recuperation. Although Alma is the only one who talks, the relationship grows and Alma is happy that she has found someone who will listen to her sympathetically. She begins to share with Elizabeth some of her most vulnerable moments. A high point in the film is Alma's detailed description of a sexual encounter she had with two teenage boys while sunbathing on a beach in the nude. Elizabeth appears to be an attentive listener who, by facial expression, encourages Alma to reveal more and more personal details. Alma, however, is deeply hurt when she opens Elizabeth's unsealed letter to her doctor. In the letter, Elizabeth reveals how she is using Alma as a \"study\" and finds her infatuation \"charming\". Feeling betrayed Alma lashes out in anger, first berating her patient, then begging for forgiveness. As soon as physical and emotional violence is depicted, Bergman stops the narrative and repeats images from the opening sequence, adding a close-up of an eye as if to remind us again that we are merely prying observers. The relationship of the two women now becomes a struggle of wills. Alma grows more desperate as Elizabeth gets stronger and more dominant. Sensing this new power, Elizabeth seems to transfer her personality to the weaker Alma. Every nuance of emotion is unforgettably conveyed in the facial expressions of these two remarkable actresses. Persona is filled with surreal images and dream sequences in which it is very difficult to distinguish between illusion and reality. In one scene, Alma sees Elizabeth entering her room at night, then exiting. When Alma asks her the next morning if she was in her room, Elizabeth shakes her head no. We do not know if she is simply not telling the truth, or the event did not occur. Bergman does not offer help. The same is true for scenes when Mr. Vogler appears or when Elizabeth looks at a picture of her son that she tore up at the beginning of the film. Being left on our own to make sense of these discontinuous elements, we are forced to discard thinking in traditional linear ways. I can't say that I fully understood Persona. It may be suggesting that the persona we assume is merely a mask to cover our fears and insecurities? It seems that Elizabeth is playing a role as actress, wife, and mother. She wants to abandon this inauthentic role by refusing to speak. Alma, on the other hand, acts like a dutiful wife and supportive nurse, but secretly yearns to be what she perceives Elizabeth to be: strong, independent, and self-reliant. In a memorable scene, the faces of the two women are morphed into one composite in a classic overlapping shot, an image that says to me that underneath the roles we play, we are all the same. After successive viewings, however, I realized that Persona's greatness does not lie in understanding, but in its unbearably intimate and poetically realized images, magnificently conveyed by cinematographer Sven Nykvist. The raw power of this film totally drew me in and allowed me to get in touch with my own feelings of hurt and desperation in trying to reach people in my own life who cannot or will not respond. Persona is not just a classic I objectively admired, but a very powerful personal experience."
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw0094961",
      "warningSpoilers": true,
      "date": "18 June 2004",
      "rate": "10",
      "helpful": "234 out of 285 found this helpful.",
      "title": "'The human face is the great subject of the cinema. Everything is there'",
      "content": "When talking of Bergman, critics and viewers usually name Wild Strawberries, The Seventh Seal, Cries and Whispers ahead of Persona. While those films are all amazing and stay very high on my list of all time favorites, for me, the truly unique and inspirational s 'Persona' - Bergman's enigmatic masterpiece.The story is seemingly simple: \"A nurse, Alma (Bibi Andersson), has been assigned to care for a famous actress, Elizabeth (Liv Ullman), who suddenly stopped speaking during a performance of Electra and has remained silent ever since. When they go to stay in a seaside house owned by Alma's psychiatrist colleague, the apparently self-confident nurse gradually reveals more and more of herself in the face of Elizabeth's silence, and is shocked to read a letter the actress has written implying that Alma is an interesting case-study. The two women seem almost to exchange identities, or to become one (strikingly expressed visually in a famous shot); in a dream sequence (or perhaps fantasy), Elizabeth's husband comes to visit and seems to think that Alma is his wife. Finally Alma, back in her nurse's uniform, catches a bus to go home, leaving the almost-mute Elizabeth alone.\"Whether Alma was able to get her identity back remains one of the film's many questions. What is absolutely wonderful in the film  performances from two actresses. Anderson is the one who has to carry almost the entire dialog, her voice is one of the film's priceless treasures while Ullman is equally powerful in expressing hundreds of emotions through her face and eyes. Sven Nykvist's camera, the third star of the film makes two stars shine so bright.Each scene in 81 minutes long film is memorable, some of them just unforgettable. For instance, the long scene where Alma reveals her most intimate memories of a sexual encounter with two boys while sunbathing nude with another girl on an empty beach, is infinitely more erotic to listen to than it would have been to see in flashback. There is so much to think about in Persona. One major question concerns Elizabeth's silence: is it elective, as happens in Tarkovsky's \"Andrei Rublyov\" , or is it some kind of mental breakdown?. The documentaries about the war horrors that Elizabeth watches on TV suggest the former; the fact that it suddenly happens during a stage performance of \"Electra\" suggests the latter. I keep thinking about it. Why \"Electra\" of all plays? The story of the daughter who hated her mother and wanted her dead  does it reflect the accusation brought up by Alma that Elizabeth did not love her deformed son and wanted him dead? Did Elizabeth become so overwhelmed by guilt realizing that her life reminded so much of Electra's story? We don't know for sure, and Bergman does not help. The identical monologue in which Alma is accusing Elizabeth is the film's resolution. We hear it twice: first time, camera is concentrating on Elizabeth's face, second time  on Alma's. Is Alma talking about Elizabeth or herself or both? After that encounter on the beach, Alma became pregnant and had an abortion. The monologue may reflect her feelings of guilt and emptiness as well as Elizabeth's. Does it really happen? Is Elizabeth a vampire sucking the life out of her victims only to use them as characters for her acting roles? Is that the ultimate price the artist is paying for being a great artist? Does he need lives and souls of others to be able to create? Can he/she love the ones who utterly depend on them and need their love? This film and later Autumn Sonata (1978) with Ingrid Bergman as a concert pianist show famous stars as selfish women who can't and don't love their children. The same question was brought up also in the earlier \"Through a Glass Darkly (1961)\" - in the relationship of the writer and his daughter. Then there is the question of whether there are really two women at all; could the whole film be played out as a fantasy of one of them, or indeed of somebody else? Is there a sexual attraction between the two women? It might be or might be not. I believe, David Lynch has watched \"Persona\" very carefully, thought about it and used some of its ideas in his own \"Mullholland Dr.\" There are so many questions in this incredible film that are left unanswered. For almost forty years, viewers and filmmakers alike have been trying to find the answers. One thing is obvious  this is one of the films you want to watch over and over again. I think it should be seen by any viewer. If you've seen it already  see it again. You'll learn something new. If you have not seen it  you are in for a great experience. See it for Sven Nykvist's camera work, for Liv's face, for Bibi's voice, for the unique and mysterious world that is Ingmar Bergman's universe."
    },
    {
      "username": "gftbiloxi",
      "userUrl": "https://www.imdb.com/user/ur1592694",
      "reviewLink": "https://www.imdb.com/review/rw1064918",
      "warningSpoilers": false,
      "date": "21 April 2005",
      "rate": "10",
      "helpful": "210 out of 262 found this helpful.",
      "title": "A Masterpiece",
      "content": "PERSONA may well be Ingmar Bergman's most complex film--yet, like many Bergman films, the story it tells is superficially simple. Actress Elizabeth Volger has suddenly stopped speaking in what appears to be an effort to cease all communication with the external world. She is taken to a hospital, where nurse Alma is assigned to care for her. After some time, Elisabeth's doctor feels the hospital is of little use to her; the doctor accordingly lends her seaside home to Elisabeth, who goes there with Alma in attendance. Although Elisabeth remains silent, the relationship between the women is a pleasant one--until a rainy day, too much alcohol, and Elisabeth's silence drives Alma into a series of highly charged personal revelations.It is at this point that the film, which has already be super-saturated with complex visual imagery, begins to create an unnerving and deeply existential portrait of how we interpret others, how others interpret us, and the impact that these interpretations have upon both us and them. What at first seemed fond glances and friendly gestures from the silent Elisabeth are now suddenly open to different interpretations, and Alma--feeling increasingly trapped by the silence--enters into a series of confrontations with her patient... but these confrontations have a dreamlike quality, and it becomes impossible to know if they are real or imagined--and if imagined, in which of the women's minds the fantasy occurs.Ultimately, Bergman seems to be creating a situation in which we are forced to acknowledge that a great deal of what we believe we know about others rests largely upon what we ourselves project upon them. Elisabeth's face and its expressions become akin to a blank screen on which we see our own hopes, dreams, torments, and tragedies projected--while the person behind the face constantly eludes our understanding. In this respect, the theme is remarkably well-suited to its medium: the blankness of the cinema screen with its flickering, endless shifting images that can be interpreted in infinite ways.Bergman is exceptionally fortunate in his actresses here: both Liv Ullman as the silent Elisabeth and Bibi Anderson as the increasingly distraught Alma offer incredible performances that seem to encompass both what we know from the obvious surface and what we can never know that exists behind their individual masks. Ullman has been justly praised for the power of her silence in this film, and it is difficult to imagine another actress who could carry off a role that must be performed entirely by ambiguous implications. Anderson is likewise remarkable, her increasing levels of emotional distress resounding like the waves upon the rocks at their seaside retreat. And Bergman and his celebrated cinematographer Sven Nykvist fill the screen with a dreamlike quality that is constantly interrupted by unexpected images ranging from glimpses of silent films to a moment at which the celluloid appears to burn to images that merge Ullman and Anderson's faces into one.As in many of his films, Bergman seems to be stating that we cannot know another person, and that our inability to do is our greatest tragedy. But however the film is interpreted, it is a stunning and powerful achievement, one that will resonate with the viewer long after the film ends.Gary F. Taylor, aka GFT, Amazon Reviewer"
    },
    {
      "username": "dromasca",
      "userUrl": "https://www.imdb.com/user/ur0547823",
      "reviewLink": "https://www.imdb.com/review/rw4863171",
      "warningSpoilers": false,
      "date": "18 May 2019",
      "rate": "8",
      "helpful": "21 out of 25 found this helpful.",
      "title": "the enigmas of 'Persona'",
      "content": "'Persona' is one of the most enigmatic movies in the history of cinema. Those who read the chronicles written right after the 1966 release of the film or the articles dedicated to it in the books of cinema history will encounter as many interpretations as authors. The same happens if we read the opinions written by film lovers on sites like IMDB, or we discuss the film between us. Ingmar Bergman had the inspiration not only of not talking a lot about this film (even less than about his other films) but he also avoided sharing too much of his personal thoughts or ideas even with the actresses or the other members of the production team. The result is an enigma. Each of us who sees or sees again this movie has his own Persona'.The ambitions are clear from the way the film is 'packaged' using the classic projection room effects. Short sequences from classical films emphasize the effect of declaring 'here we have a work of cinema'. The prelude sets up an atmosphere that could be defined as a dream, we are clearly in a world that resembles the real world but which exists only in the eyes and souls of the spectators, built with materials put together by the creator of the film from his own thoughts and dreams about the world. The 'story' could be told in few words, even if it is not a banal story. This is where the interpretations begin. What do we actually see on the screen? An ambiguous relationship between two women, evolving from a patient-care relationship to an attraction that starts to look as a melding of one into the other? Are the two characters the symbols of the two facets of the human personality - the soul and the character - as interpreted by some experts in the psychoanalysis theories? Is there a hint (or more) to a lesbian relationship? Maybe there is an element of class struggle, between the actress active on the intellectual level and the country girl whose strongest emotions are on the erotic plane? Are we dealing with a horror story, a thriller in which there is a physical threat and a struggle between the two women to gain control one over the other? Why did the actress stop talking - personal traumas, maternity failure? What is the connection between the horrors of the outside world (wars, the Holocaust) and the inner storms concealed by the Scandinavian calm? These are just a few of the questions that can be asked and of the possible interpretations.Comprehensive and ambitious cinematographic constructions involve risks. More than 50 years after the film, the Vietnam War is no longer actuality but history, closer to the Holocaust which is also quoted by the famous photograph of the terrorized little boy in the Warsaw ghetto. The black and white image also gains aesthetic significance, not necessarily obvious and intentional at the time the film was made. Acting is gorgeous, Bergman's two preferred actresses (and lovers), Bibi Andersson and Liv Ullmann are building on the screen two versions of femininity that at some point merge one into the other, two variants of the director's fascination with women for which he created the most generous roles in his films. Seen for the first time or seen again today, 'Persona' is a cinematic art concentrate and an intellectual challenge that continues to attract and fascinate through its open character and enigmas."
    },
    {
      "username": "davidmvining",
      "userUrl": "https://www.imdb.com/user/ur110212703",
      "reviewLink": "https://www.imdb.com/review/rw5280465",
      "warningSpoilers": true,
      "date": "25 November 2019",
      "rate": "10",
      "helpful": "34 out of 43 found this helpful.",
      "title": "Complex, beautiful, and difficult. It's also incredibly worthwhile.",
      "content": "Four-fifths of the way into my second viewing of Persona within a week, I placed my hands on my head and exclaimed, \"I got it!\"Out of all the Ingmar Bergman films I've seen, Persona is easily the most difficult. Others have difficult subject matters or portray difficult situations with clarity, but Persona is the first where I thought I understood what was happening both literally and thematically but I simply could not connect with it. What convinced me to give it a second try so soon after my first foray into it on this Bergman odyssey (I had seen it once before in college) was the film's reputation as a masterpiece and one of Bergman's best. If the movie didn't have that reputation, I would have pumped out a 3-star review and called it quits. Instead, I insisted on a second viewing, which I am very glad that I did. Because, you know, I got it.In between my first and second viewings, I read a bit about Persona. I read the essay included with the Criterion Collection box set and I read Roger Ebert's Great Movie review. Neither did the work of convincing me on their own that what I had watched was a masterpiece, but Ebert's in particular gave me advice on how to watch.The thing about Persona is that it is unbelievably dense. Every word, image, and cut betrays some meaning. That density invites a host of different, often conflicting, interpretations which is a lot to process when the audience isn't quite sure what they're even looking at to begin with.Alright, enough of that, what's the story?An actress, Elisabet Vogler, stopped speaking in the middle of a performance of Electra and has been admitted to a hospital. A young nurse, Sister Alma, has been assigned to Elisabet, but Alma has doubts about her ability in the face of what she sees to be an obviously difficult task. The two end up sent to a remote house on the Swedish coast where they spend some time together. Alma continues to speak almost endlessly to the point that she confesses to an infidelity against her fiancé in rather explicit detail. The two women steadily look more and more alike and Alma seems to change. There's a scene where Elisabet enters Alma's room at night and the two seem to merge. There's another where Elisabet's husband arrives and confuses Alma for Elisabet to the point that they (probably) make love. It all comes to a head in a scene that actually plays twice in a row. Alma finds Elisabet with a torn image of the actress's son, and Alma cuts deeply into Elisabet's past and identifying exactly how Elisabet feels about her son (all while Elisabet had never said a word about it).My \"I got it!\" moment came in that scene.Bergman's always been about people more than anything else. His topic and the focus of his lens is the human face. He wasn't going to abandon that the second he decided to use an experimental montage to open his film. I referenced something that Roger Ebert wrote that helped open up the movie for me, and it was this (paraphrased): Read the movie literally. So, I watched the movie as literally as possible. I shoved aside the idea that the two women might actually be one (something that may still be possible) or everything about dreams (I take those scenes as literally happening), and I saw the story of two women finding a way to connect.Both try to connect with the other for different reasons. Alma wants to connect with Elisabet in order to discover how to convince the patient to speak again. Elisabet wants to connect with Alma as research for a part. Neither can understand the other at first. They look different, dress differently, and (even considering Elisabet's silence) they interact with the world differently. Quickly, once they reach the coast, they begin to dress alike. First it's a pair of hats that are of similar styles (Alma's extends down implying a more limited view while Elisabet's brim is flat implying that she's looking further out), then their clothes begin to resemble each other. There's one point where Alma leans over with Elisabet in the background, and it's impossible to discern where the shirt of one begins and the other ends.When we finally get to the scene where Alma reveals Elisabet's core issue, it suddenly became obvious. We are watching two women trying to understand each other at the deepest levels, and the only way to make that happen is to inhabit the other person completely. There's the core of the film. There's the emotional center that drives the stylistic and visual nuances throughout the film (in particular the moment the two women's faces are superimposed over each other). The framing device is part of that as well. The framing device is filled with images of early cinema and finally a boy trying to touch a large face behind a glass. This implies that there will always be a barrier between people on the two sides of a screen, meaning that we, the audience, can only ever get so close to the people we are watching.My breakthrough on the film would actually work quite well with the idea that there is only one woman and that the whole movie is actually just a split-second of time where Elisabet was frozen in the middle of a performance. I haven't thought through the idea, though. Another viewing could bring that more to the forefront.And that's the other key to Persona's power. It's so rich that it allows for this kind of exploration across multiple viewings. I remember reading a comment from someone on a message board about how a movie that didn't grab him on a first viewing was unworthy of a second. I'm so glad I don't subscribe to that line of thinking. If I did, I would have seen Persona once in college, not understood it, and never bothered to revisit it at all, much less twice in one week more than a decade later."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2669168",
      "warningSpoilers": false,
      "date": "5 September 2012",
      "rate": "10",
      "helpful": "23 out of 31 found this helpful.",
      "title": "A brilliant film, but is not for everybody I don't think",
      "content": "I can understand the viewpoints of those who loved and were moved by Persona and those who were confused or frustrated by it. I personally love it, but I was underwhelmed by it first time. Persona is definitely not the most accessible of Ingmar Bergman's films, Wild Strawberries and The Magic Flute were much more in that regard, and it is also not an easy film to talk about or review. I have seen those who didn't like Persona finding that the story structure is disjointed. In a way it is, but what also made it fascinating in my view was how it explored the nature of art and reality in an ever thought-provoking(by Bergman standards) manner. Sven Nykvist's cinematography is fantastic, the melting frame was an interesting and well-done technique here, as is the scenery, and it is not a Bergman film with a memorable image or two. Persona definitely has those, with the disturbing and somewhat daring images at the start, the immortal image of the two main characters' faces becoming an entity and the more retrospective one with Alma reminiscing with the sexual encounter. The score is hauntingly beautiful, and the way it's written Persona comes across(like Cries and Whispers) as emotionally complex, somewhat disturbing and very moving, and as ever thoughtful also. The inclusion of off-screen voices are well-incorporated. Bergman's direction I cannot fault, and it's the same with the two leading ladies. Liv Ullman proves that a performance where actions and gestures speak louder than words can still move you, and she does that splendidly. But for me it is Bibbi Andersson's film, she is just heart-breaking in her loyalty and compassion. Overall, a brilliant film but understandably not the easiest of films to watch or review. 10/10 Bethany Cox"
    },
    {
      "username": "nycritic",
      "userUrl": "https://www.imdb.com/user/ur0384847",
      "reviewLink": "https://www.imdb.com/review/rw1026086",
      "warningSpoilers": true,
      "date": "22 February 2005",
      "rate": "10",
      "helpful": "132 out of 185 found this helpful.",
      "title": "Who Am I?",
      "content": "When I viewed PERSONA recently, I didn't know what exactly to make of it: what was it telling me, what was its intentions, its ultimate meaning. Not being a conventional director by far, I felt that Bergman had deliberately left all this 81 minute of storytelling to me to figure out... and I may have been right, but I either wasn't getting it or this was too much of an abstract film to merit any analysis, so my review was at face value and even ended with the sentence \"this is exactly how Bergman wants it.\" Seeing it later more emerges, and the deeper story takes place even if it still seems linear: Elisabeth Vogler (Liv Ullmann) loses her speech midway through Electra and will not speak again (except once throughout the entire film, and in an imagined sequence). There is no apparent reason as to why she has lost her speech, and the only hint is the horror she witnesses on the television as war, genocide, and destruction rage on. Other than that it is never alluded to, her muteness.Into the picture comes Alma (Bibi Andersson), the nurse who is put to her care by the suggestion of a psychiatrist. Both retreat to an isolated home. Seeing that Elisabeth will not talk, Alma fills space and time with her own erratic ramblings that take shape and form, a need to fill a void, and that void is of course, Elisabeth, who listens and listens and listens impassively yet with interest. Alma's stories are a form of confession: if Elisabeth is the mute who bears the scars of the world, Alma is the conveyor who purges inner traumas and erotic experiences, hurtful on a lesser scale. The fact she has been laid so naked to the woman she is trying to rehabilitate and the fact she learns this very woman considers her an interesting subject suddenly shocks her: from being caring, she turns vindictive. A shard of glass left deliberately to have Elisabeth step over is the catalyst: the images break, abstract images take place again, and the story re-starts. But one wonders, what if Elisabeth stepped over the glass with equal deliberateness? After all, she does need Alma. And she is an actress foremost. This moment is the one that amps up the tension between the women and even then they become closer, so close Elisabeth's husband thinks Alma is her as Elisabeth quietly allows this to happen. Is Elisabeth re-living some form of event through Alma? Is Alma the only way another secret involving Elisabeth's child can come through? Whatever the reason, Alma is clearly a conduit for Elisabeth to come forth and the merging of their similar faces is the culmination of this haunting psycho-drama that goes beyond its cinematic boundaries. No clear resolutions except the almost casual references that explain both women's return to their own sense of normalcy, but this somehow inconclusive ending is what gives it the weight of a great story and excellent Bergman. Reality here is what is so common to us: who we see ourselves as, how others see us, how self-identification becomes self-preservation through the experiences of others, good or bad or a combination of both. Pain and ecstasy are a part of our make-up, and PERSONA is the best example of the merging of the two."
    },
    {
      "username": "ackstasis",
      "userUrl": "https://www.imdb.com/user/ur10334028",
      "reviewLink": "https://www.imdb.com/review/rw1856202",
      "warningSpoilers": false,
      "date": "12 April 2008",
      "rate": "7",
      "helpful": "47 out of 64 found this helpful.",
      "title": "\"Your hiding place isn't watertight. Life trickles in from the outside, and you're forced to react.\"",
      "content": "Ingmar Bergman's 'Persona (1966)' opens with a bewildering montage of sounds and images, a frenzied newsreel of sex, death, cinema and comedy. The sequence is so far removed from my previous experience with the director that its effect is jarring, shocking; I momentarily wondered if I'd hit a wrong button and started playing Buñuel's 'Un chien andalou (1929)' by mistake. I question Bergman's motives for including such an uncharacteristic opening, for it appears to have very little to do with the narrative that follows. Is this montage - an account of the sickening and concealed horrors and desires of society - a possible explanation for Elisabeth's continued silence? Even so, it all seems somewhat exploitative, as though Bergman was simply going for shock-value, obliterating any notions of subtlety with which I had begun to associate him {though I'll admit that the strength of 'The Seventh Seal (1957)' arose from its not-so-subtle representation of Death}. The opening scene concludes with a young boy awakening in the morgue, his hand outstretched towards the vague image of a woman's face. Elisabeth's unloved child? Alma's aborted fetus?An endless line of critics, it seems, have celebrated 'Persona' as a masterpiece, and among the greatest films ever made. I'd hate to be the lone voice of dissent, but the film is certainly the lesser of the three Bergmans I've hitherto seen, if only due to the noticeable absence of the good-natured humour to be found in both 'The Seventh Seal (1957)' and 'Wild Strawberries (1957)'. If, indeed, I were to describe 'Persona' as a masterpiece, it would be in regards to the visuals, which, photographed by long-time Bergman collaborator Sven Nykvist, are beyond description in their detail and intimacy. The film takes particular interest in the human face, and entire conversations of words and emotions are played out through the communication of the eyes, and the glimmering hint of a smile on the lips. There is one immortal moment in the film when Bergman juxtaposes the faces of each woman onto the screen, merging Elisabeth (Liv Ullmann) and Alma (Bibi Andersson) into a single entity.Persona also includes one of the most vivid depictions of sex that I've ever seen. Though the film shows us nothing, Alma's whispered description of an intimate encounter on the beach is staggering in its effectiveness; her words allow the viewer to formulate their own visuals, every emotion and nuance perfectly incorporated from the rich story we are being told. Though I may exhaust hours spouting the merits of Ingmar Bergman's film, I can't escape the fact that watching 'Persona' felt very much like a chore. The film boasts a relatively short running time, but it never seems to attain any comfortable sense of rhythm, and, by the film's end, I was left wondering just what the film was trying to get at. Bergman includes various allusions to Bertolt Brecht's \"Verfremdungseffekt\" effect  highlighting the inherent artificiality of the cinematic medium  with the film at one point appearing to burn; but, unlike in Fellini's '8½ (1963),' these self-referential flourishes seem to serve little foreseeable purpose. Am I looking too far into this film for meaning? Or am I not looking far enough? Even just hours afterwards, another layer of meaning has unfurled itself. Maybe it'll get better."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1014649",
      "warningSpoilers": false,
      "date": "5 February 2005",
      "rate": "10",
      "helpful": "89 out of 138 found this helpful.",
      "title": "The most ambiguous, inviting, surreal, whatever-you-can-think philosophical experiment by Bergman",
      "content": "Writing from a hospital bed (as he did with Wild Strawberries, two of these being films strung out from anguish), Ingmar Bergman put down almost anything that was in his head to start with (the first five minutes- some of the most startling and thoroughly symbolic minutes he's ever directed), then transposed into a story of two women, or one. This was one of the landmark 'art-films' of the 1960's, with hints of the horrors of war (in one memorable scene, Elisabeth looks at a television screen at images of death), introspection regarding sex and identity, existentialism, and what it means to be an actor. Some of the more famous directors in history have a kind of 'notorious' film, by which many people who may not know the bulk of their works know them by one particular work (with Hitchcock it could be Psycho, Lucas' Star Wars, Bunuel with Un chien Andalou, Breathless). This could, arguably, be the one for Bergman, despite a couple of others likely also holding claim to that title. In other words, this could be a good place to start with the director if you're not familiar with his films, or it might not be. But keep this in mind- it's one of his most unique departures as a filmmaker.Two of his leading ladies (and, ahem, loves), Bibi Andersson and 25 year-old Liv Ullmann, star as a nurse and an actress, who for the bulk of the film are at a Doctor's cottage as the nurse tries to help and likely cure Elisabeth of her ailment (froze on stage, silent but incredibly observant). In the meantime, Alma the nurse, in a role that gives Andersson more talking-points than any other film she's been in, goes through some hurtful parts of her past, and just tries to understand her counter-part. At one point, a vein of existentialism is ruptured thoughtfully, when Alma gets Elisabeth to say \"No, don't\", when she threatens her. When I first saw this film, I knew this scene would come after reading Roger Ebert's review. But I had no idea it would hit me like it did. There is such a great, compelling tension between these two that Andersson and Ullmann convey that it is what makes the film work. Any lessor actresses might fumble up the whole lot of it.While it isn't my favorite Bergman film (though it is unfair to pick favorites sometimes when it comes to someone as huge in the cine-consciousness as him), there are many things that had me come back to it after being a little awe-struck on my first viewing last year. For one thing, there's Sven Nykvist, with one of the strongest, most varying eyes in all of European cinema. In the first five minutes, of course, there is some fascinating stuff, but even in the scenes of long dialog and monologue (i.e. the unforgettable speech about being on the beach from Alma), where the lighting is so delicate and sharp with the shadows that you really feel like the weight of this situation is closing in on the characters. Or, of course, when the two actresses' faces are super-imposed, which can be interpreted in more ways than one (either as a grand statement, or as pretension, or something else). I was also very moved by the pace of the film, how it fills each minute (it's not a long movie) in ways that some movies just float minutes by.Now, this is the kind of Bergman film that can't be turned on any time (not to make it sound un-watchable, it certainly isn't). But it does ask to be viewed when in a certain frame of mind- if you're looking for a movie to show off to your friends, like it's the Euro/avant-garde version of Fight Club minus the violence, look away. It poses a good many questions for a viewer, especially one who knows of Bergman's themes he's explored before and after this film's release. How do we feel, or know we're feeling? What keeps us closed in? Why do we hurt? And are we only one person at a time? It's all the more puzzling that Bergman's climax isn't a very easy one (not as doomed as with Seventh Seal but not as cheerful as Fanny and Alexander), as Alma has another monologue with Elisabeth, about her son she hasn't seen in a long while- this famously seen from two different angles, one after the other. Furthermore, it is arguably Bergman's most self-conscious film to date (the commentary on the DVD carries it well), however it may not be as off-putting as with some of Godard.To put it another way, there are two sides to the subject matter, the film, the director, and the audience."
    },
    {
      "username": "Lechuguilla",
      "userUrl": "https://www.imdb.com/user/ur2420383",
      "reviewLink": "https://www.imdb.com/review/rw1800391",
      "warningSpoilers": false,
      "date": "14 January 2008",
      "rate": "",
      "helpful": "58 out of 81 found this helpful.",
      "title": "The Art Of Bergman",
      "content": "From its opening, seemingly random B&W images, Ingmar Bergman's \"Persona\" screams intellectualism. The film is cold, clinical, and abstract. It induces deep, philosophical questions that lack answers, or questions that provide for a multiplicity of emotionally unsatisfying answers.About eight minutes into the film, the story begins. In a hospital, young Nurse Alma (Bibi Andersson) is assigned to care for Elisabeth Vogler (Liv Ullmann), an actress who, for no apparent reason, has ceased speaking. Concluding that there is nothing physically or mentally wrong with Elisabeth, the hospital exports her to a seaside cottage, where she is to be cared for by Nurse Alma. Most of the rest of the film is set at the cottage, where the two women get to know each other. But throughout, Elisabeth does not speak. She communicates only with facial expressions and body gestures.For all of Elisabeth's silence, the film's script is remarkably talky. Nurse Alma talks in long monologues: asking, probing, recalling. She tries to build a relationship with Elisabeth, by vocalizing her own memories and emotional pains in life. Certainly, the film's curious narrative has a lot to \"say\" about the art, or rather the artificiality, of human communication.The best element of the film is the artistic, B&W cinematography by Sven Nykvist. Lighting trends toward high contrast, with stark boundaries between light and darkness, a feature that contributes to the film's cold, intellectual tone. There are lots of close-up shots, even extreme close-ups, of the two women. The film's production design is ascetic, unadorned, austere. And this, too, enhances the analytic, abstract feel of the film.Bergman conceived \"Persona\" while he was confined to a hospital. And I am inclined to think that the film is a cinematic expression of his own inward psychological struggles during that period of his life.In other words, \"Persona\" communicates to us as much about Bergman's mindset, and his ideas of suffering and reality, as it does about any deep, universal questions in a post-modern world, although to some extent, the two dimensions intersect and overlap. Bergman is telling us that, ultimately, the film is not real. It is \"nothing\". It is an artificial human construct. That is, it is art, a perception that approximates, but does not replace, what we experience as reality."
    },
    {
      "username": "reelreviewsandrecommendations",
      "userUrl": "https://www.imdb.com/user/ur140941989",
      "reviewLink": "https://www.imdb.com/review/rw8685742",
      "warningSpoilers": false,
      "date": "20 November 2022",
      "rate": "7",
      "helpful": "21 out of 24 found this helpful.",
      "title": "Intriguing, Abstract & Unique",
      "content": "There are few directors whose films have sparked as much rumination and analysis as Ingmar Bergman. His cinematic creations, utterly unique in style and tone, have been and shall continue to be debated and critiqued for decades. Many consider him the master of minimalism, whose work subtly exposes the truth of the human condition, while others hail his films as unnecessarily abstruse and pretentious. Whatever one's feelings on Bergman, it must be said that his films are certainly intriguing; and perhaps none more so than 'Persona.''Persona' follows Alma, a nurse, who is put in charge of Elisabet, an actress who has been inexplicably rendered mute. It is determined that Elisabet may better recover in an environment other than the hospital, and she and Alma travel to a cottage on a remote island for respite. While there, a strange metamorphosis occurs, and the identities of Alma and Elisabet become blurred in relation to one another; as repressed memories are brought to light and motivations questioned.'Persona' tells this story in a manner most abstract, relying heavily on Sven Nykvist's powerful cinematography and the expressionistic talents of Liv Ullmann and Bibi Andersson to forward the narrative as much as Bergman's screenplay and dialogue. It is a strange, sinister film seeped in a mysterious aura of despondency that challenges and offers the viewer no quarter. Through its' examinations of jealously, sex and identity, the film holds a mirror up to the human condition; the reflection of which is most affecting and raises many questions.Just what is the film about? Is it some kind of Scandinavian Jekyll and Hyde story about doubling and the duality of man? Does it fit in with Jung's notion of persona, or could it be a psychological interrogation of female sexuality? Is it a critique of theatre and the notion of performance in itself? The film is open to interpretation, and many readings can be given as to its' meaning. Whether or not this appeals to the viewer is entirely subjective; though those who enjoy stories of abstraction will certainly find it an interesting, unique experience.As mentioned above, much of the film's impact is due to Sven Nykvist's cinematography, which is spellbinding. The film begins with a bizarre montage of distorted images, ever-increasing in strangeness and emotional intensity from there. Under Bergman's direction, Nykvist captures what Herzog refers to as the drama of the landscape masterfully, as well as making excellent use of the close-up; adding immeasurable power to scenes. Nykvist's collaboration with Bergman was one of the most fruitful in cinematic history; as the striking images in 'Persona' prove yet again.'Persona' stars Liv Ullmann and Bibi Andersson, both delivering fascinatingly impassioned performances as Elisabet and Alma, respectively. Ullmann does the bulk of her acting silently, utilizing her impressive expressionistic talents to convey the emotion and feelings of her character, which she does in a manner most efficacious and affecting. Andersson displays remarkable versatility, intensity and emotional perspicuity, creating in Alma a remarkably multi-faceted character that one does not easily forget. The two of them work together wonderfully, showcasing a chemistry both electric and genuine.Having said all that, it's easy to see why many viewers feel the film isn't worthy of its' reputation as a motion picture magnum opus. It is an intentionally difficult film, one which forces the viewer to think and doesn't offer much entertainment value in the traditional sense. The story and its themes are Delphic and the characters are hard to warm to, and- though undeniably powerful- the irregularity of the cinematography can be occasionally confounding. It is not unjust to say that some may feel the film underwhelming and incomprehensible; though many more may find its obscurities intoxicating.Ingmar Bergman's 'Persona' is a captivating film, one which continues to perplex and puzzle. Strongly acted and beautifully shot by Sven Nykvist, the film is somewhat recherché, and its meaning and value will likely be hotly contested by film buffs for years to come. Intriguing, abstract and unique, it is not exactly a movie one will say they enjoyed; it is too calculated and cold a film for that. Rather, it is a film one experiences; and 'Persona' makes for a very memorable experience."
    },
    {
      "username": "Vincentiu",
      "userUrl": "https://www.imdb.com/user/ur13017201",
      "reviewLink": "https://www.imdb.com/review/rw1594407",
      "warningSpoilers": false,
      "date": "9 February 2007",
      "rate": "10",
      "helpful": "68 out of 112 found this helpful.",
      "title": "Liv Ulmann's smile",
      "content": "Profound studie of the human psyche. Honest story about nooks of existence and vain hopes. Anatomy of helplessness and deep solitude. Life as convention, mask for feelings and expectations.Another room of Bergman's universe. Same cruel instruments, game of flash-backs and dream sequences, visions and memories. Fight between two women as screen for interior struggle. Impact of consciences and lights of sin. Illness like armour against fake images and empty future. Confesions like way to be yourself. Like cries suffocates by silence of the other.Story about refuse and cages. About dreams and disillusions. About chaotic values and flavour of extinction. People as rabbits for experiments. The other like sign of salvation. And the question of soul.\"Persona\" is an act of confrontation between Ingmar Bergman and God. The silence, the cruelty of letters, the cries and the confessions of Alma are only guns in a strange and ambiguous war. So, any film of this great director is a religious personal answer to permanent subtle fear. In this case, the shadow of divine presence is the Liv Ulmann smile."
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw8863333",
      "warningSpoilers": false,
      "date": "10 February 2023",
      "rate": "9",
      "helpful": "10 out of 13 found this helpful.",
      "title": "Persona is a women's' picture in the best sense of the term.",
      "content": "This is one of the most studied and challenging films in history, inviting analysis from historians, critics and psychiatrists. I find it not dramatically different from other Ingmar Bergman films. The internal dialogue, frank discussions on sex, confusion about one's place in the universe, brutally harsh judgements of the artist - these were present before Persona, and after. When asked about the film, Bergman said he trusted audiences to form their own conclusions. An answer I found refreshing. I don't think Bergman, who also wrote the screenplay, was out to create a puzzle that must be \"solved\". There's no gamesmanship.I admire the film's aesthetic, the impeccable chemistry between Liv Ullmann and Bibi Andersson, and its humanity. There's warmth and comfort in the writing. I go back to the bedroom confessional: Liv Ullmann's Elisabet, the actress who mysteriously stopped speaking, sitting on the bed; Andersson's Alma, the nurse charged with Elisabet's care, at the other end of the room. Alma vividly recalls a sexual experience on the beach, with a couple of voyeurs, salaciously detailing everything, subverting the image Elisabet may have had of her, as a prude. In that scene, the patient, Elisabet, transforms to therapist, and Alma becomes the patient. A rich irony."
    },
    {
      "username": "zennokangae",
      "userUrl": "https://www.imdb.com/user/ur3655790",
      "reviewLink": "https://www.imdb.com/review/rw0980108",
      "warningSpoilers": true,
      "date": "17 December 2004",
      "rate": "10",
      "helpful": "141 out of 187 found this helpful.",
      "title": "Not Beyond Intepretation",
      "content": "I've studied Bergman's films and have seen all of them, yet Persona stands alone as his most brilliant and indeed, the most visually striking (thanks to the genius of Sven Nykvist).The story concerns a cracked actress (Liv Ullmann-Bergman's long-time lover), in hospital for treatment under the guise of a rather insecure nurse (Bibi Andersson). As the tale of care- giver and patient plays out, the nurse, Sister Alma, fills the void left by Liv Ullmann's complete silence and regression by offering a series of confessions on her own life. These confessions, most poignantly, consist of Alma's infidelities to her husband, a secret abortion and a unwanted pregnancy to please her husband. Through the course of the movie, set mainly in a summer retreat, the two women, left in seclusion, seem to drift into one another's personae. However, Bergman's dialogue turns more to first person confessional and not a tale of two women. Eventually, the viewer comes to the realization that the two women are actually two sides of the same person. Liv Ullmann represents, in pop-Freudian terms, the superego as Bibi Andersson is the ego or in other words, the 'actress' is actually the nurse and Liv Ullmann, the caretaker/observer.Elisabet Vogler is actually Bibi Andersson's persona; the one who answers to the external world, whilst shutting out the sensitive, introspective and broken inner persona, Liv Ullmann. The movie comes to a sad conclusion, wherein the actress wins out over the delicate, fractured woman deep within. As the lines in the movie say, they agree to \"nothing\", keeping the facade intact to the rest of her reality and keeping distant from her older husband and abandoning any attempt to love her son, born to please her husband.A line in the movie states blatantly that everyone has two personae; the one external and the one internal. This movie is one of the greatest human dramas with a psychological force rarely, if ever, seen today. Along with Casavetes' \"A Woman on the Verge\" and Lynch's \"The Elephant Man\", Bergman and Nykvist commit to film one of the most introspective studies of mortality, sanity and the human condition.A masterpiece."
    },
    {
      "username": "preppy-3",
      "userUrl": "https://www.imdb.com/user/ur0463200",
      "reviewLink": "https://www.imdb.com/review/rw2177070",
      "warningSpoilers": false,
      "date": "19 December 2009",
      "rate": "5",
      "helpful": "25 out of 41 found this helpful.",
      "title": "If I knew WHAT I was watching I might have liked it more",
      "content": "A nurse (Bibi Andersson) is hired to take care of an actress (Liv Ullmann) who has stopped speaking. They are all alone on an isolated island and begin to become each other...or something. To be totally honest I haven't a clue on what I just saw! I'm not a Bergman fan but I have nothing against him either. I like some of his movies but find others boring, obvious and wildly overrated (like \"Wild Strawberries\"). This falls somewhere in between. It has some wonderful moments but the narrative seems to completely overhaul itself at least three times during the film. Just as it seems to be making sense something happens and you're flung into another version of the story with the same actors! Some people may find this intriguing but I found it annoying. Also some of the psychological points Bergman makes here are laughably obvious...but I suppose they were considered profound in 1966. Also there's one long monologue that is delivered TWICE! Yes--it lets us know what's going on but twice???? Complaints aside it was beautifully acted by Andersson and Ullmann and there were a few very interesting moments but the vague plot got maddening. Also I'm surprised that Bergman actually got a shot of an erect penis in the movie--that HAD to be quite daring for 1966. So, as it stands, I can only give this a 5."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1114040",
      "warningSpoilers": true,
      "date": "28 June 2005",
      "rate": "3",
      "helpful": "86 out of 168 found this helpful.",
      "title": "Huh???!!!!",
      "content": "To quote Colin Mochrie of Whose Line is it Anyway, \"it's CRAP\"!!! To put this into perspective, I love foreign films--and I'd rather see them than most Hollywood films. I have seen perhaps as many as two thousand foreign films--and most of the \"must see\" films of directors such as Bergman, Truffaut, De Sica, Kurasawa, Fellini, Bunuel, etc. So, my strong opinion is not without some experience--I am not just some jerk who knocks Bergman's films because they don't have explosions or toga parties!!!! My contention is that SOME of this wonderful directors (or at least some of their films) are incredibly overrated, and are seemingly above criticism. Well, not from me--I love to stir the pot of controversy and call it like I see it. Check out some of my other reviews--I had ADORED some foreign films (such as The Umbrellas of Cherbourg) or directors (Akira Kurasawa) yet been unimpressed by other films (Such as several of Fellini's films--Satyricon and Juliet of the Spirits).So, on to Bergman. My favorite film he made is The Seventh Seal. It wasn't exactly my favorite when I first watched it, but found that the more I thought about it (with its originality and intense performances), the more I was impressed. Scenes from a Marriage, Through a Glass Darkly, Fanny and Alexander and other movies of his were excellent, but not great films, as they had flaws which prevented them getting higher ratings.Persona is the only Bergman film which I gave a really BAD rating. It is hopelessly bleak, choppy (when it purports to be artsy by including repellent seemingly random images in portions of the movie) and silly. The mentally ill central character (Liv Ullmann) does not talk throughout the movie but the dialog is spoken by her nurse (Bibi Andersson)--who increasingly becomes irritated with Ullmann for her silence. I felt much the same way about half way through the film. All this excitement(?) is set in a seaside vacation home. I guess many found it shocking or sophisticated--all I felt was bored and amazed with how unimpressive the film was.So, maybe you should see it for yourself and make your own decision. Maybe all the critics are right and I am just a hopeless crank! My wife would tend to agree (that I am a bit of a crank, that is)!!"
    },
    {
      "username": "eibon09",
      "userUrl": "https://www.imdb.com/user/ur0605857",
      "reviewLink": "https://www.imdb.com/review/rw0094914",
      "warningSpoilers": false,
      "date": "19 September 2000",
      "rate": "",
      "helpful": "69 out of 113 found this helpful.",
      "title": "Love Poem to Liv Ullmann",
      "content": "There are few motion pictures that rely on bodily expression and imagery as most films depend too much on dialogue and speech. Persona(1966) is one of those raw movies that succeeds almost on a metaphysical level. Its about the relationship between an actress who broke down during a stage performance and the nurse who is assigned to take care of her. Bergman's camera has a fascination with Ullmann's figure as most of the film's closeup shots are on her. Liv Ullmann does an outstanding job in playing a character that hardly utters a line of dialogue. There are a few scenes where the image dominates the screen in a manner that hasn't been done successfully since the silent film period. The director, Ingmar Bergman did an excellent job in presenting powerful images with the use of natural sound. Persona(1966) is a triumph of acting because both Bibi Andersson and Liv Ullmann are terrific in their perspective roles. There is hardly any movie music and this adds to the tension between the two women. Its a film that was deserving of a Oscar for Best Foreign Film in 1966. One scene that was wonderful is when Alma describes her life to her patient. Another excellent scene is when Mr. Vogler mistakes Alma for his wife(its as if he too has suffered a breakdown and has failed to recognize his own wife). Finally, the sequence where Alma and Mrs. Vogler's image blends together to form one person. Its an errie image because they cease to exist as individual people. Persona(1966) would influence Robert Altman very greatly when he directed the film, Three Women(1977)."
    },
    {
      "username": "truebatmantd",
      "userUrl": "https://www.imdb.com/user/ur157186888",
      "reviewLink": "https://www.imdb.com/review/rw9046193",
      "warningSpoilers": false,
      "date": "10 May 2023",
      "rate": "1",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Stop glorifying garbage",
      "content": "This is another example of a terrible movie getting glorified by psuedo-intelligent class because they heard from their college professors that this is a masterpiece so they feel obligated to call it a masterpiece because god forbid people are able to form their own opinion. All the sheeple can't help but sing praises of this movie because critics and college professors praise it and most of them also praise it because they want to appear smart because our society is in such a terrible place that people think they will appear smart by praising terrible movies.I've seen YouTube videos and high school plays way better than this thing. I don't even want to call this thing a \"movie\" because it isn't. Stop calling garbage masterpiece.There is no acting, no plot, no character development, nothing that makes a great movie yet we are being told this is a masterpiece because the society is run by morons these days. Einstein was right when he said there is no limit to human stupidity. This \"movie\" is your proof."
    },
    {
      "username": "sc8031",
      "userUrl": "https://www.imdb.com/user/ur2826075",
      "reviewLink": "https://www.imdb.com/review/rw1917542",
      "warningSpoilers": false,
      "date": "24 July 2008",
      "rate": "5",
      "helpful": "62 out of 93 found this helpful.",
      "title": "I am Bergman! Hear me bore!",
      "content": "I was hesitant to write anything about this film at first because I wasn't sure if my negative reaction was from moodiness or the result of disappointed expectations. I haven't seen too many Bergman films, but most of the ones I've seen present interesting ideas, but as though they were the most earth-shattering profound concepts ever conceived. It can be a bit much. Okay, so here we have a movie that deals with similar themes as his later, better film, \"Hour of the Wolf\". Liv Ullman plays a popular actress who goes mute in the middle of a stage performance. A nurse, played by Bibi Andersson, is assigned to care for her. Eventually the two take a vacation to a cottage out on the beach (a typical Swedish method of recovery?) where a series of interactions begins to take their toll on their personalities. Here the film seems to investigate the line that is blurred between people's identities who are in close proximity over long periods of time.It seems the characters are established exclusively in order to explore Bergman's philosophical meanderings and musings, which involve the significance of the interior and exterior views of the self. Elizabeth (Ullman) seems to be someone who recognizes her lack of a strong internal identity. Alma (Andersson) is the opposite and manifests a strong internal sense of self but a weak external influence. Maybe Bergman is also saying something about the role of the artist -- that their persona is stolen by so much giving, so much internal conjuration and performance. That over time, society consumes the artist's inner world by making their gifts into novelties and taking the inner spirit for granted. But I don't really know and that's the problem. Many people say this movie is open to interpretation and that's what makes it so deep. But I think such an explanation only proves that this film is too broad or vague and relies too much on hind-sight and art-house praise. On some level it becomes too self-indulgent to really be enjoyable. I really suspect that many individuals like this movie because they view it with the same self-impressed state of mind as Bergman did when he made it.I can certainly credit Bergman with having a knack for writing decent dialog and for being inspired in his film-making. He really is empowered to make films. But he also seems obsessed with his own perceptions, making complicated and fractured works about feelings and ideas that could be presented more concretely. But then again, many people like him for that, or his aesthetic, or a variety of other reasons that I haven't mentioned here. I enjoy some of his works, but this one didn't interest me too much."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1176140",
      "warningSpoilers": true,
      "date": "19 September 2005",
      "rate": "8",
      "helpful": "37 out of 64 found this helpful.",
      "title": "A modernist masterpiece...",
      "content": "In the early '60s, Bergman's visual and narrative style became ever more austere in focusing on tormented souls seeking guidance and comfort from an empty heaven, thus paving the way for a stark foray into extreme close-up in the enigmatic \"Persona.\" A modernist masterpiece, the film initiated an introspective trilogy about the ivory towers built by artists as a defense against the horror of existence It was Bergman's first completely innovative work, acknowledging itself as artifice through the regular insertion of non-narrative images such as projectors burning, film breaking, fragment of silent movies \"Persona\" depicts the vampiric relationship between a talkative nurse and an actress who refuses to speak or work after a traumatic realization of the futility of creation in a loveless world surrounded by war Psychology, philosophy and social comment are mixed to brilliant effect in a complex, clear interrogation both of filmic illusion and of the illusory values of modern life"
    },
    {
      "username": "in1984",
      "userUrl": "https://www.imdb.com/user/ur0311101",
      "reviewLink": "https://www.imdb.com/review/rw2749539",
      "warningSpoilers": false,
      "date": "6 February 2013",
      "rate": "5",
      "helpful": "29 out of 45 found this helpful.",
      "title": "A definitive art school film and little more",
      "content": "If I were to repeat that summary again and what you're reading now, merely changing the order of the words, so that you had to read it over and over again for 15 minutes, you'd understand one of the significant failures of this film.For it's time, it was somewhat new and shocking, and because of its setting, it doesn't obviously date itself other than in the black & white film technology and clothing.The film really would work far better as a short in a collection of shorts about society and women's changing roles in society. The most significant parts of it can easily be reduced to 15-30 minutes.Sadly, it appears to be shown to a small audience of art/film history students who have very little film viewing experience and the feeling they must rate it highly for a teacher equally sheltered from film reality. We can see that by the number of reviews/rankings alone. If this were shown regularly on cable like some more popular movies, it would be ranked for what it is: an interesting artistic experiment, but far from one of the greatest films ever."
    },
    {
      "username": "zetes",
      "userUrl": "https://www.imdb.com/user/ur0391152",
      "reviewLink": "https://www.imdb.com/review/rw0094913",
      "warningSpoilers": false,
      "date": "18 September 2000",
      "rate": "10",
      "helpful": "57 out of 117 found this helpful.",
      "title": "Rambling on...",
      "content": "I don't know what to say about Persona, but I know I have to say something. I can say straight out that I did not fully grasp it, nor do I believe that it is fully able to be grasped. Like my favorite film, 2001, Persona allows for a plethora of interpretations, none of which can ever be said to be correct. But I know now that I do not understand everything. And I love that about it. Jesus, it needs to be released on DVD. Criterion, are you listening??? Screw everything else for the moment, do a DVD edition of Persona complete with scholarly commentary (and not the same scholar who commented on your edition of The Seventh Seal, because he did not answer my questions). Not that I want anybody to tell me definitively what anything means, because I doubt anyone can do that. I just want some people to share my thoughts with. I want to watch and rewatch this film dozens of times. With a DVD, a nice one, I could scrutinize it extremely carefully, as I have thankfully been able to do with such great films as The Seventh Seal, The Third Man, Nashville, etc, etc, etc. Watch a scene, quickly rewind, watch it again and memorize each and every word and motion. I'm starting to feel like the main character from Antonini's Blowup! I rented this film two days ago and have watched it twice. If I had not been so tired the first night, I surely would have gone through it a second time that very same night. Doubtless, I would have done it again later. And I still have it for a couple of days, the rest of my life be damned!All I can really comment on is the artistry of Sven Nykvist, the cinematographer, always been one of the very best, and on the acting skills of Liv Ulmann and especially Bibi Andersson, who gives one of the bravest and most powerful performances I've ever seen in a movie. I would compare her skill in this film to my favorite performance of all time (that I've seen): Marlon Brando in Last Tango in Paris. It seemed to me that she was becoming extremely involved in her character. And this is where I need to just engulf myself in this film. While I cannot exactly \"get\" this film from a narrative angle entirely, the important thing, and the aspect of the film which will no doubt bring me back time after time (as long as I can someday get it on DVD, because, as far as I'm concerned, VHS is only for rental anymore) is the emotional aspect. While my intellect had a somewhat difficult time holding on to the text of the film, my emotions were right with the characters. It was an extraordinarily gut-wrenching film for me, and I felt, well, some weird feelings after it ended (part of which certainly had to do with the fact that certain parts of the movie boggled my mind). So my final score is without a doubt a 10/10. Few movies compare."
    },
    {
      "username": "fedor8",
      "userUrl": "https://www.imdb.com/user/ur7059410",
      "reviewLink": "https://www.imdb.com/review/rw1796072",
      "warningSpoilers": true,
      "date": "8 January 2008",
      "rate": "",
      "helpful": "22 out of 42 found this helpful.",
      "title": "More fodder for desperate film students...",
      "content": "A 5 out of 10 means this is by far the best Bergman film I've seen so far (I've seen about 10). There is an effective music score - for a change - and a scene or two were eerie. It is certainly a first for me, to experience an emotion other than boredom while watching Bergman's typically downbeat material.The movie starts off pretentiously enough with a collage of almost random images, including a glimpse of an erect penis. This was 1966, but I guess in Sweden even then the sight of an erect penis was probably normal for most adults, and maybe even kids. What was the point of the penis? Perhaps to wake up the viewer who, expecting yet another dull mess from Bergman, might already fall into deep slumber a mere minute into the movie? Maybe the penis symbolizes Bergman's own wish to have sex with both of the movie's actresses (well, he DID have 9 children from 5 wives...). Apart from the, I'm quite quite sure, very ARTISTIC penis (i.e. no regular penis, but a Bergman penis - which counts for so so so much more in the cinema heaven), we are also shown a tarantula in this silly first \"scene\", plus the squeezing of blood from a sheep. Bergman seems to have an almost pagan/Satanic obsession with hurting animals which he indulged the most in \"Passion of Anne\". Hence I'm surprised that we weren't shown the probably edited out sequence when the tarantula gets squashed by a very excited Bergman. \"Cut! Okay, now I SQUASH this damn bug!\" Bloodlust.Oh, yeah: and a hammer gets nailed in a hand. More senseless violence. Ts, ts...Sure, the movie is about depression, sadness, missed opportunities, regrets, errors of the past - and other such \"deep\" Bergmanian themes - but at least there is nothing about suicide this time around. Right...? Wrong! 19 minutes into the movie, just as I was thinking \"well, at least no-one has tried to top themselves yet\", there it was: suicide was mentioned. For an entire 19 minutes I thought Bergman had gone crazy and forgotten about his favourite theme! At the end of the movie, sure enough, one of the two females, Bibi, tries to kill herself by biting into her own vein. (How poetic.) Guess how Liv reacts to this? She starts sucking her blood. (Read this sentence as Bela Lugosi would.) What was the point of that? Was Liv trying to save her life, or does the scene symbolize (there's that word again...) Liv's selfish misusing of Bibi for her own strange, insane purposes? Who cares... The whole thing isn't \"deep\" enough by a long shot.But let's go back to the basic plot. Liv is a tortured genius star actress (is there such a thing? apparently Bergman thinks so) who for absolutely no reason decides not to speak anymore. The tests show that she is not insane, and perfectly healthy in every way. Bibi plays a talkative, star-struck nurse who takes care of her. This set-up is every woman's dream, when one thinks about it: \"I talk, while you listen\". And that's exactly what happens; Bibi finds herself in a sort of female heaven, being able to talk uninterrupted - for hours - while her monologue companion listens attentively. Bibi spills out her guts to Liv, her innermost fears and secrets, until one day Bibi finds a letter in which Liv betrays her by writing to the doctor about Bibi's orgy episode.The orgy in question is a little Scandinavian porn yarn Bibi relates to Liv earlier on. It's about how Bibi had sex with two male strangers, while frolicking on a beach (naked, of course: we're in Sweden) with her equally horny female friend, who masturbated after Bibi's first sexual partner came inside her. No joke. This is what Bergman actually gives us as \"food for thought\". (But it turns out to be merely food for fat Ebert; more on that later.) Naturally, there were far less explicit ways to portray the core of Bibi's character, but Bergman chose a mere silly porn story - the kind you find in any sex-shop or XXX channel - which made me grin rather than anything else.It is interesting to mention at this point that Roger Ebert, that ballooned-up intellectual movie gourmet (he eats movie reels which is why he loves films), says in his review that the sex story is one of the most \"erotic sequences in movie history\". Naturally, if the same story was told, word-for-word, in a Bruce Willis action film then Ebert would have thought it tasteless and dumb.\"Persona\" is supposed to be about how those two women eventually switch identities. Frankly, I don't see it. Liv is still silent, not uttering a word, so how has she become like Bibi? Bibi's defining characteristic is that she's a blabber-mouth: she literally does not stop talking. Likewise, I don't really see any evidence that Bibi has become like Liv: after all, Bibi still talks a lot, and besides, we are given very little insight into Liv's mind, so it's hard to know what she was really like hence if Bibi became like her or not. The only major insight we get is that long monologue about Liv's rejected child. In fact, this monologue is then REPEATED straight away, almost word-for-word, in what must be one of the most pointless scenes in a Bergman film (and that's saying a lot).I was annoyed by how Bergman tries to present thespians, namely as exalted thinkers, suffering artists - and he really ought to know better.The political clips are irrelevant and predictable. The burning monk scene: why?? PRETENTIOUS. As for the Nazi reel: that's rich coming from a man who himself had ties to the Nazis at one point... Go look it up.Plenty of senseless dialogue in the last scenes."
    },
    {
      "username": "valleyjohn",
      "userUrl": "https://www.imdb.com/user/ur19998007",
      "reviewLink": "https://www.imdb.com/review/rw6621677",
      "warningSpoilers": false,
      "date": "21 February 2021",
      "rate": "5",
      "helpful": "6 out of 8 found this helpful.",
      "title": "A Film student's wet dream",
      "content": "'m sure Ingmar Bergman's Persona has been written about and discussed by movie aficionados and film students , hundreds of thousands of times . It's obviously highly regarded in those circles but I'm not buying it .I don't have the patience or quite frankly the intelligence to pick the bones out of this film . As far as I could tell it's about anxiety and fear but that's as far as I'm going to go with any explanation because to me , it made very little sense .I love the look of Bergman's films and that , along with its very high rating on Letterboxd are the reasons I watched it . Sadly , I don't think I'll be in a massive hurry to watch his back catalogue on this showing."
    }
  ],
  "errorMessage": ""
}