{
  "imDbId": "tt0075314",
  "title": "Taxi Driver",
  "fullTitle": "Taxi Driver (1976)",
  "type": "Movie",
  "year": "1976",
  "items": [
    {
      "username": "BA_Harrison",
      "userUrl": "https://www.imdb.com/user/ur0945066",
      "reviewLink": "https://www.imdb.com/review/rw3214800",
      "warningSpoilers": true,
      "date": "5 April 2015",
      "rate": "7",
      "helpful": "190 out of 226 found this helpful.",
      "title": "A classy character study of a disturbed individual-but what is the point?",
      "content": "Insomniac Vietnam veteran Travis Bickle (Robert De Niro) takes a job driving a New York taxi cab, becomes obsessed with beautiful political campaigner Betsy (Cybill Shepherd), who gives him the cold shoulder after he tries to take her to a skin flick on a date. Bickle then becomes obsessed with underage hooker Iris (Jodie Foster), buys lots of guns, and goes trigger happy on her pimp (Harvey Keitel).As a fan of gritty 70s movie-making, I find it hard to believe that, until now, I hadn't seen Martin Scorsese's Taxi Driver; I think perhaps the problem was that, having heard so many good things about the film, I didn't want to risk disappointment. Unfortunately, that's precisely what I felt when I finally got around to watching the film.It's not that it's a bad movie by any stretch of the imagination-on the contrary, it's a skilfully assembled character study of a self-destructive loose cannon that boasts excellent cinematography, great music, and superb performances-BUT in the end it just didn't grab me as much as I would have liked. The story progresses very slowly, which in itself isn't a massive issue for me, but the payoff simply isn't as satisfying as I felt it needed to be given all that has gone before.After all of his stalking, inane rambling and meticulous planning, Travis Bickle's rampage is over in a flash, after which he is proclaimed a hero and freed to roam the streets once more (unless you prescribe to the theory that everything after the shootout is in Bickle's mind as he slowly bleeds to death). Perhaps Scorsese's point was to show us just how easy it is for a dangerous loony like Bickle to be overlooked by society until its too late-but it sure felt like a letdown to me.6.5 out of 10, rounded up to 7 for Keitel's hair."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw1291137",
      "warningSpoilers": false,
      "date": "13 February 2006",
      "rate": "",
      "helpful": "188 out of 232 found this helpful.",
      "title": "A wonderfully engaging and convincing slide into a modern madness from a director and actor showing some of their best form",
      "content": "Travis Bickle is a Vietnam veteran who cannot sleep at night and just ends up travelling around. To try and use the time effectively he becomes a taxi driver. Things start to look up for him as he works nights and slowly starts to live a little bit. He meets a girl, Betsy, and arranges to see her a few times despite the fact that he is a little bit out of the ordinary  a quality that seems to interest her. His connection to the night allows him to see young prostitute Iris being bullied by her pimp Matthew and he begins to see his role to perhaps save her  him playing his part in cleaning up the sewer that he feels New York has become. However when his view of normal life puts Betsy off him he starts to retreat more and more into the night, looking for meaning in his life and growing more and more outraged by the world he is part of.Hardly the most uplifting of films it is engaging and impressive and truly deserves the reputation it has. Martin Scorsese and Paul Schrader have produced a film that convincingly portrays a man cut out of society who has the slightest connection to normality before finding it eroded away. The script is brilliant because the detail is engaging but it is this descent into a very modern type of madness that drives the film forward. Travis has just enough about him that is recognisable that it makes it so easy to go along with the rest of his madness. A major part of this is getting the feeling right about living in a cesspit; a city that seems to have forgotten its way morally  New York is the strongest example but elements of it could be parts of any city I suspect. In painting this world in such a real way, Scorsese has made Travis all the more convincing and, to a point, all the easier to follow in his fall. Like I said it is not a film to morally uplift you but one that is depressingly fair. There is no redemption in this modern world and although it appears that the violence at the end somehow redeems Travis in reality by showing \"society\" accepting his action it drags the rest of us down nearer the world that he hates and has become part of. I love King of Comedy for the same reason albeit in a different world.Scorsese injects a real understanding of the place and a real sense of foreboding into even the earliest scenes. He inserts clever and meaningful shots into scenes that other directors might just have filmed straight and his choice of scene and shot compliments the script is depicting Travis descending into madness. What makes the film even better is De Niro showing the type of form that makes his recent form such a major disappointment. He is outstanding as he moves Travis from being relatively normal to being eaten up from the inside out. His eventual implosion is impressive but it is only as impressive as the gradual slide he depicts over the course of the film. Although he dominates it, others impress as well. Foster stands out in a small role, while Keitel makes a good impression as the pimp. Shepherd is not quite as good but her character was not as well written as the others so it isn't all down to her. Regardless, the film belongs to De Niro and although the quotable scenes are the ones that are remembered it is in the quieter moments where he excels and shows genuine talent and understanding.Overall an impressive and morally depressing film that deserves its place in cinematic history. The portrayal of a city and a man slipping into moral insanity is convincing and engaging and it shows how well to \"do\" modern madness and the effects of the moral void of parts of society. Scorsese directs as a master despite this being at an early stage in his career and De Niro is chillingly effective as he simply dominates the film in quiet moments and quotable moments alike. I rarely use phrases like \"modern classic\" because I think they are lazy but this is one film that certainly deserves such a label."
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0150574",
      "warningSpoilers": true,
      "date": "20 November 2003",
      "rate": "10",
      "helpful": "181 out of 225 found this helpful.",
      "title": "Ladies and gentlemen: Mr. Robert De Niro!",
      "content": "Taxi Driver, the classic that made Robert DeNiro Robert DeNiro. It's amazing to see how far this man has come in cinema, some of my friends ask me questions about films and advice, one of my friends had asked if they wanted to see where Bobby got the big notice I usually recommend Taxi Driver, granted he was in The Godfather Part 2 and was incredible, but Taxi Driver made him stand out as a strong lead actor. Taxi Driver is just all together a great film that is absolutely perfection. Martin Scorcesse who also was just really starting out made this movie that brought us back to the film noir genre. He made this great classic and I don't even think he realized how much it would stand against the test of time, to this day we still know this film and even if you don't know it, you know the infamous speech \"You talking' to me?\". This is a film about isolation, loneliness, and self destruction at it's worst.Travis Bickle who claims to be an honorably discharged Marine it is implied that he is a Vietnam veteran is a lonely and depressed young man of 26. He settles in Manhattan, where he becomes a night time taxi driver due to chronic insomnia. Bickle spends his restless days in seedy porn theaters and works 12 or 14 hour shifts during the evening and night time hours carrying passengers among all five boroughs of New York City. Bickle becomes interested in Betsy, a campaign volunteer for New York Senator Charles Palantine. She is initially intrigued by Bickle and agrees to a date with him after he flirts with her over coffee and sympathizes with her own apparent loneliness. On their date, however, Bickle is clueless about how to treat a woman and thinks it would be a good idea to take her to a sex film. Offended, she leaves him and takes a taxi home alone. The next day he tries to reconcile with Betsy, phoning her and sending her flowers, but all of his attempts are in vain. Rejected and depressed, Bickle's thoughts begin to turn violent. Disgusted by the petty street crime that he witnesses while driving through the city, he now finds a focus for his frustration and begins a program of intense physical training. He buys a number of pistols from an illegal dealer and practices a menacing speech in the mirror, while pulling out a pistol that he attached to a home-made sliding action holster on his right arm \"You talking' to me?\". Bickle is revolted by what he considers the moral decay around him. One night while on shift, Iris, a 12-year-old child prostitute, gets in his cab, attempting to escape her pimp. Shocked by the occurrence, Bickle fails to drive off and the pimp, Sport, reaches the cab. Later seeing Iris on the street he pays for her time, although he does not have sex with her and instead tries to convince her to leave this way of life behind. But after her rejection as well, Travis decides to take things into his own hands, \"Pow!\".This is one of the most memorable movies of all time and has really stood it's ground. It's personally one of my favorites and made me fall in love with Robert DeNiro all over again. The script to Taxi Driver is just so incredibly powerful and the performances were just perfect. Jodie Foster, this little girl at the time was such a presence on screen, she pulls in what was a very tricky performance and was hauntingly beautiful. Cybill Sheppard was also very beautiful and I was absolutely in love with her character and felt so bad for her. Everything about Taxi Driver is just great, I don't know how much I could go on about the love I have for this film. It's a film that you will never forget and trust me, if you haven't seen it, go out and rent it immediately, you won't regret it. It's bloody, it's twisted, it's crazy, but it's one of the best films of all time.10/10"
    },
    {
      "username": "andrew7",
      "userUrl": "https://www.imdb.com/user/ur0482520",
      "reviewLink": "https://www.imdb.com/review/rw0150412",
      "warningSpoilers": true,
      "date": "17 November 1999",
      "rate": "10",
      "helpful": "623 out of 716 found this helpful.",
      "title": "Disturbing, powerful, relevant, important",
      "content": "A towering classic of American cinematic power. Martin Scorsese teams up with one of the most intense actors of that time to create a masterpiece of urban alienation. Paul Schrader's magnificent script paints a portrait of loneliness in the largest city of the world. Travis never once enters into a meaningful relationship with any character anywhere in the film. He is the most hopelessly alone person I've ever encountered on film.He is alone with his thoughts, and his thoughts are dark ones. The film fools you on a first viewing. Is Travis an endearing eccentric? Sure, he's odd, but he's so polite, and he's got a quirky sense of humor. His affection for Betsy is actually rather endearing. But on a second view, you see it for what it is. The audience comes to see Travis's psychosis gradually, but there's actually far less development than one might think. When he talks about cleaning up the city, the repeat viewer knows he doesn't mean some sort of Giuliani-facelift. This is less a film about a character in development as it is a kind of snapshot. To be sure, it takes the stimulus to provoke the response, but does that imply some kind of central change in the character?Tremendous supporting roles are brought to life through vivid performances by Keitel and Foster especially. Shepard's character, Betsy, is little more than a foil to highlight Travis's utter alienation from society, but she is still impeccably portrayed. With only two scenes that don't center on Travis, it is unavoidably De Niro's show. The life with which the supporting cast imbues their characters is a credit to themselves, and to the director's willingness to let the film develop from the intersection of diverse ideas and approaches. What would the plot lose by eliminating the Albert Brooks character (Tom)? Nothing at all. He makes almost no impact on Travis's life, which is where the plot lives. But his inclusion makes the film as a whole much richer and fuller.As a piece of American cinema history, this film will live forever. But far more important than that, this film will survive as a universal, ever-relevant examination of the workings of the alienated mind. The story doesn't end when the credits roll. We know Travis will snap again. But the story doesn't end with Travis either. It continues today in the cities and in the schools. The film is about the brutal power of the disaffected mind.This film didn't cause the incidents in Colombine, or Hawaii, or Seattle, or wherever you care to look, even with all of its disturbing images of violence. It didn't cause those things. It predicted them."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2366494",
      "warningSpoilers": false,
      "date": "9 January 2011",
      "rate": "10",
      "helpful": "102 out of 128 found this helpful.",
      "title": "Still has the power to shock...",
      "content": "Not only one of Scorsese's best films, but one of the best of the 70s. It is very hard hitting, dark and still has the resonance and power to shock. The cinematography is measured and chilly, yet very atmospheric, while Bernard Hermann's swansong score is superb, yet more proof at how amazing a composer he was. The story is unsettling but wonderfully told, and the script is brilliantly written. Scorcese also directs impeccably, while the acting is just excellent. Robert DeNiro gives one of his best performances, the whole film is worth watching just for his performance, that's how good it is, but that's not to dismiss Jodie Foster, Harvey Keitel and Cybill Sheppard in the supporting cast for they are just as good while Scorsese's own cameo is genuinely frightening. There you have it, another one of Scorsese's best with a brilliant atmosphere and mesmerising central performance. 10/10 Bethany Cox"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2864089",
      "warningSpoilers": false,
      "date": "5 September 2013",
      "rate": "9",
      "helpful": "35 out of 42 found this helpful.",
      "title": "Disturbing Look into a Disturbed Mind",
      "content": "Travis Bickle (Robert DeNiro) is a disturbed ex-Marine Vietnam vet. He's suffering from insomnia, and spends his nights driving a cab. He's sexually perverted, and obsessed with Betsy (Cybill Shepherd). On top of it all, he wants to save 12 year old prostitute Iris (Jodie Foster).DeNiro delivered one of the iconic performances of all times. Travis Bickle is one of the standards by which all performances are judged. Martin Scorsese is making a disturbing movie. It can be hard to watch at times. Scorsese uses his camera to maximum effect. As Bickle's mind drift from his co-workers, Scorsese's camera drift into the antacid fizzling in his glass. The grittiness of '70s NY is all there. Jodie Foster is shocking. Trying to watch Bickle can be a very trying experience. It isn't an easy movie. But it is a masterpiece."
    },
    {
      "username": "lost-in-limbo",
      "userUrl": "https://www.imdb.com/user/ur3071695",
      "reviewLink": "https://www.imdb.com/review/rw0954253",
      "warningSpoilers": false,
      "date": "30 October 2004",
      "rate": "10",
      "helpful": "226 out of 298 found this helpful.",
      "title": "Excellent",
      "content": "A lonely Vietnam veteran who has insomnia spends his nights as a taxi driver in the dirty streets of New York, where he encounters a young prostitute who he tries to help make a difference. This is a very good film and one of Martin Scorsese best (Goodfellas being my fave). An excellent portrayal from Robert De Niro as Travis Bickle the cabbie and good performances from Jodie Foster as the child prostitute Iris Steensman, Cybill Shepherd, Peter Boyle and Harvey Keitel as a pimp called Sport. You actually get drawn into the isolation and anger that Travis is feeling towards these lowlifes and because of that you really feel sympathy for him. Though after a while the loneliness and the city really starts to haunt Travis's mind, causing violent instincts and paranoia. This film is filled with such memorable lines e.g.Travis Bickle 'You talking to me? Well I'm the only one here.' and the many powerful scenes that stay in your head after it's finished. The hypnotic cinematography is a standout, as if your seeing the harsh & gritty New York streets and twisted people through the eyes of Travis when he is driving his cab. A great screenplay, a stunning score by Bernard Herrmann and a superb atmosphere created. This is a brutally compelling and bleak look at a decaying and corrupt society of the 70's. An unsettling gem of a film. 5/5"
    },
    {
      "username": "MamadNobari97",
      "userUrl": "https://www.imdb.com/user/ur45507551",
      "reviewLink": "https://www.imdb.com/review/rw6899253",
      "warningSpoilers": false,
      "date": "10 May 2021",
      "rate": "6",
      "helpful": "243 out of 318 found this helpful.",
      "title": "Did I Miss Something?",
      "content": "Did I miss something or this movie doesn't have any purpose?Do people just call this a masterpiece just for the sake of it?I've seen old movies like Clockwork Orange that people consider \"weird\" and liked it and even find this one weirder than that! And the only reason I'm giving a 6 and not a 5 is because of De Niro's acting.With all the \"masterpiece\", \"such a great film\" \"revolutionary masterpiece of a film\" I heard about it I was expecting to be blown away by the story and dialogue, but there's near to no story here other than an incel's journey to being a hero!The dialogue is bafflingly bad and empty, I was expecting great dialogue from this one but it's just not there. Just go and watch the scene with Travis talking to the other taxi driver on the street and see what I mean. It's a 5 minute of nothing. The whole dialogue is \"well I mean.... It's just.... I mean.... well.... yeah.... you know...\". Like what!?The interaction of characters with each other is just awkward.The movie is also a little boring, and don't use that word about movies lightly because I've seen a handful of long movies with stretched scenes and long dialogue scenes and wasn't boring for me but this one is just on another level.And what was that ending? Is Travis supposed to be the hero now? Really?What an utter disappointment this movie was, all these years hearing about it and thinking it's one of the classics and then finally watching it like this..."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3577529",
      "warningSpoilers": true,
      "date": "9 November 2016",
      "rate": "10",
      "helpful": "35 out of 44 found this helpful.",
      "title": "An incredibly dark thriller with an exceptional central performance",
      "content": "Quite rightly regarded as one of the best films of all time, TAXI DRIVER is without a doubt compelling viewing. What the film lacks in plot it makes up for in characterisation: De Niro is with us from the start, we follow on his journey as he slides into extreme violence and becomes a vigilante. Although it's obvious that this man is disturbed from the very beginning - a man who considers pornography to be \"just another movie\", who is always at breaking point. You can't really blame him though. After all, his empty life is forever surrounded by people who don't deserve to live, who don't deserve to populate this planet, and nobody is doing anything about it. It's up to Bickle to do the dirty work himself. He is the new rain coming down on the streets to clear away all the garbage.Just about everyone involved here is extremely lucky in not putting a foot wrong. Martin Scorsese basks in his finest hour, even later classics like GOODFELLAS just can't hold a candle to match the intensity and complexity of this film. Check out the clever cameo where he plays a passenger spying on his cheating wife. The film focuses on De Niro's character, meaning that a lot of other roles are underwritten; Cybill Shepherd appears only fleetingly as a kind of idealistic fantasy figure. Jodie Foster excels as a child prostitute, hard and yet fragile at the same time, and Harvey Keitel is suitably slimy as a no-good pimp. In small roles are Peter Boyle and Joe Spinell. However it's De Niro who commands the screen, this is his film, we see things through his eyes. I don't think his quiet, brooding darkness here has ever been matched.There are countless moments to enjoy. Bickle talking to a 'secret service' man, a deliciously pleasant conversation full of deceit and lies; the infamous ad-libbed sequence in front of the mirror, where \"You talking' to me?\" became a classic movie quote; the almost tragic conversations with Iris. The ending itself is a shock, a total bloodbath made all the more horrific because the violence has been relatively tame up to then. Only three people are killed, but each shot and stabbed a number of times; fingers a blown off, necks spray blood, faces riddled with holes, heads splattering over walls. And then the ironic ending, where Bickle is revered as a hero instead of a cold-blooded killer; a more telling portrait of today's society there couldn't be. For a study of the reasons a person is driven to extreme violence, you couldn't do much better than this."
    },
    {
      "username": "PyroSikTh",
      "userUrl": "https://www.imdb.com/user/ur5261700",
      "reviewLink": "https://www.imdb.com/review/rw6621655",
      "warningSpoilers": true,
      "date": "21 February 2021",
      "rate": "7",
      "helpful": "20 out of 23 found this helpful.",
      "title": "Not Quite Sure on the Acclaim",
      "content": "Taxi Driver, if you weren't aware, follows a New York City taxi driver called Travis Bickle as he descends into a state of masculine madness. Along the way he courts Betsy, a member of a local campaign for a presidential candidate, continuously runs into Iris, an underage prostitute, sits on the outside of his cab-driving colleagues, and has his worldview shaped by the men and women he ferries all over the city. Spoilers; it's not a very healthy worldview at all. Taking on the night shift leaves him with a darkened view of a world run by pimps, junkies, thieves, and murderers. He suffers crippling insomnia which leaves him either alone in his apartment fantasising about the man he wants to be, or huddled in a porno theatre, the irony completely lost on him.Taxi Driver is, at its core, a character study of a lonely and unstable young man. Coupled with its 70s style of filmmaking, this results in it being a super slow movie, far slower than I anticipated. In truth, this is a big reason why it was so hard for me to really get into. Half the movie is spent watching the debacle between Travis and Betsy play out, as he stalks her, awkwardly asks her out, promptly loses her after taking her to watch a porno on their first date (an act so seeped in Travis' own disillusion that it's painful to watch), and desperately trying to contact her to get a second chance. The function of all of this is essential, painting up not only how socially awkward and disconnected Travis is, but also really hammering in his loneliness, as the final straw that causes him to snap. Problem is, as I mentioned, this takes up half the movie. It's a catalyst to his descent into madness and the crippling loneliness he endures, but it doesn't portray either of things directly. If he had just taken her to a normal movie theatre or for an innocent dinner, he probably would've won her heart and enjoyed a fruitful relationship that helped him turn his life around. But this movie isn't so much about what could've been, and for the catalyst to take up so much screentime just slows the pacing of the movie right down. It also takes remarkably too long for Iris to even be introduced, and once she is she disappears again for large portions of the movie (likewise, Betsy is almost completely absent after the breakup). I can certainly get behind Travis becoming obsessed with someone he sees in quick, short bursts, but when he only shows that obsession when she's physically there before him, it results in her presence being almost entirely diminished in between.Of course I fully recognise that both those points are about characters that this movie strictly isn't about. Betsy and Iris are ultimately just plot devices put in there to drive Travis' character and giving him the motivation to do whatever he chooses to do as the movie goes along. His anger eventually reaches a boiling point, and his first target is Senator Palantine, the presidential candidate Betsy works for, if for no other reason than getting back at Betsy. However he's discouraged at the last minute and instead points his anger as the trio of pimps Iris works for. One thing I did really like about this movie was the juxtaposition between those two choices. Travis needs to take his anger out on someone, and he's sick of the \"filth\" he sees lining the streets every night, and takes it upon himself to clean it up. If he had assassinated Palantine as he originally intended, he'd have been prosecuted as a villain with a political agenda, despite being horrifically naïve of the politics around him. Instead he's hailed as a hero for taking out delinquents and criminals. And this is where the film's biggest commentary on society as a whole comes in. To him, both Palantine and the criminals represent the same issues, but because he took out his anger on the undesirables of the city, he ends up celebrated. The local newspapers have no problems in branding this unstable, unhinged vigilante as a hero.The film becomes a direct mockery of the hero complex. Violent, angry men are praised for cleaning up the world and saving the damsel because what they do is ultimately seen as good, when really they're just deranged sociopaths who are unable to express themselves any other way. This is all fantastic, but this late in my life it's nothing new. I guarantee I'd have felt differently back in 1976, and no doubt that's why it's earned as much acclaim as it has. But now, today, I've seen this story a hundred times. I've seen this examination of the hero complex a hundred times. I've seen the anti-hero myth torn apart and put back together so many times I don't even know what's being clever or just riffing off other stories any more. While watching Taxi Driver, I instantly saw all manner of other characters in Travis Bickle, from Batman or Joker, to Punisher or Rorschach, from American Psycho to Nightcrawler or You Were Never Really Here. So ultimately the question boils down to which ones did it better? And honestly Taxi Driver doesn't feature all that high up for me. Just because it was the first doesn't mean it's the best.Don't get me wrong, I'm not saying Taxi Driver doesn't deserve the acclaim it continues to receive. I didn't like how slow and somewhat badly paced it was, nor did I like Bernard Herrman's score which feels misplaced and repetitive, but it's not a bad movie by any means. The dialogue is real and relatable, De Niro' performance is next level stuff, the camera work is often creative and interesting, creating imagery that'll stick with you forever, and no matter how many times the general story of a lonely, angry, unstable individual going on violent killing sprees and carefully toeing the line between hero and villain has been told, it'll never be one to ignore. I give Taxi Driver a decent 7/10. Go ahead and tell me why I'm wrong, or what I've clearly missed, because I'm nearly tearing my hair out trying to figure out why this movie is quite as highly regarded as it is."
    },
    {
      "username": "francheval",
      "userUrl": "https://www.imdb.com/user/ur1325213",
      "reviewLink": "https://www.imdb.com/review/rw1291228",
      "warningSpoilers": true,
      "date": "13 February 2006",
      "rate": "10",
      "helpful": "336 out of 398 found this helpful.",
      "title": "Diary of a madman",
      "content": "The script of \"Taxi Driver\" is built like a diary, the diary of a very ordinary guy who gets hired as a night taxi driver back from Vietnam, because he can't sleep at night. A very ordinary guy who tries to break his isolation, but can't, while violence accumulates inside him. One of those unnoticed people with dark things on their mind, one of those who break up the news one day with some extraordinary outburst of rage, to fall back immediately into anonymity.The gradual transformation of man into beast in this movie is chilling. It's still funny and pathetic when the hero threatens himself in front of the mirror (\"you're talking to me?\"), but when he comes out with a mohawk hairdo and dark glasses, it is obvious that nasty stuff is going to take place. As in \"A Clockwork Orange\", violence is recuperated by society depending on what purpose it is used for. Whereas he was about to murder the candidate for presidency, \"god's lonely man\" fails and instead kills a vicious pimp who exploits teenage prostitutes. The potential criminal becomes a hero for a day.Such stories happen everywhere of course, but it seems that the bewildering atmosphere of New York City's summer night was the best choice. \"Taxi Driver\" gives us a very realistic approach of New York, in a way that is not seen on screen so often, at least not anymore, whilst that city is probably the one in the world that has been filmed the biggest number of times.Most of the movie takes place at night. The credits open on the blazing lights of the yellow taxi cab moving slowly in the dark rainy streets. A kaleidoscope of neonlight appears through the dripping windows as the driver's eyes blink in the front mirror. The night is the hero's universe, it's the time when \"all the animals come out\", as he says. By contrast, the few daylight scenes look somewhat off-key, but this was definitely intentional.The final scene still appears today as extremely violent, but at least, it shows murder for what it is. Brutal, ugly, crude. It is something one tends to forget about after seeing so many police series where people get shot so often that it gets casual. Real violence is not casual when you face it, and here is a film that makes you face it.The directing is first class and deservedly made path for Scorsese as a world renowned artist. Some techniques he used here are unusual for American cinema, like focusing on details for a few seconds. The movie is enhanced by an excellent music soundtrack by jazz composer Bernard Herrman who died before the picture was even released.Two of the actors also deservedly made it to stardom. Robert de Niro plays a very unglamorous character, but his presence on screen is so intense that it's no wonder it made such an impression. As for Jodie Foster, she already appeared in films as a child, but playing a teenage prostitute was certainly not an easy challenge, and probably it was that role that really turned her into a major actress.\"Taxi Driver\" was a big hit when it came out, both for the public and the critics. It won the Palme d'Or in Cannes, and served as a trend setter for many later films, like for instance Quentin Tarantino's and Abel Ferrara's. But even today, the original model seems difficult to emulate, probably because achieving a masterpiece is a rare thing, by definition."
    },
    {
      "username": "scorkery-762-655265",
      "userUrl": "https://www.imdb.com/user/ur45790803",
      "reviewLink": "https://www.imdb.com/review/rw5975338",
      "warningSpoilers": false,
      "date": "8 August 2020",
      "rate": "9",
      "helpful": "14 out of 14 found this helpful.",
      "title": "One scene that has stuck with me for 44 yrs...",
      "content": "Just a little side note, an observation from one scene that has stayed with me since I first saw this movie nearly 45 yrs ago. It's the middle of the movie when Travis is going thru his metamorphosis from simple-minded taxi driver to full on psychotic protector/vigilante; the iconic \"You talkin' to me?\" scene. He's in his drab apartment watching American Bandstand and as Jackson Browne's achingly beautiful song \"Late For The Sky\" plays, the AB dancers sway slowly to the beat, holding each other close...teenagers in love having a tender moment. Travis' face shows how desperately lonely he is; how he's probably never even danced with a girl in his life, much less had a normal relationship with one and how he needs to make a love connection with the Jodie Foster or Cybill Shepherd characters in a most sensational way. To me, a crystallizing scene that moves the story along to its' inevitable shocking end."
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw2036776",
      "warningSpoilers": false,
      "date": "13 March 2009",
      "rate": "",
      "helpful": "50 out of 71 found this helpful.",
      "title": "A Masterpiece",
      "content": "Taxi Driver (1976) **** (out of 4) Scorsese's masterpiece is a raw, powerful and nerve wrecking look at depression and loneliness. The film centers on taxi driver Travis Bickle (Robert De Niro), a man clearly with his own demons who finds a purpose in life when he meets a 12-year-old hooker (Jodie Foster) who he plans on saving from her pimp (Harvey Keitel). To me this is one of the richest films ever made and it's one that can easily be overlooked in some circles if you don't really connect to what the film is trying to say. I didn't care too much for the movie the first few times I watched it because I was too young to really understand depression and loneliness. After I understood what those things could do to a person is when I fully became aware of the power in this film and today it remains one of the most powerful films ever made. To me the entire film is pretty much about Travis trying to find someone to fit in with but of course it never really happens until he meets the hooker. He tries fitting in with the Cybill Shepherd character but falls flat on his face. He tries fitting in with his co-workers but that doesn't work out too well. No matter what Travis tries he keeps ending up alone and as he put it, he's God's lonely man. This film works on so many levels but I think the psychological one is where it's best at. Getting us into the mind of Travis works for many reasons but the biggest keys are the direction by Scorsese, the brilliant music score by Bernard Herrmann and DeNiro's groundbreaking performance. Putting those three things together is what makes this a classic but we can also throw in the screenplay by Paul Schrader, which rightfully gives the movie the time and patience to let the Travis character grow right in front of our eyes. DeNiro's performance is certainly one for the ages, although I think he would get even better with Scorsese's RAGING BULL, which would follow in four years. His performance here is nothing short of amazing because you can't help but be terrified by this guy because of the look in DeNiro's eyes. You can't help but feel sorry for him at the same time because there are countless moments where he embarrasses himself because he simply doesn't know how to fit in. The word anti-hero gets used a lot and perhaps that's a good term but I think it's something much deeper than that. DeNiro hits all the right marks without a false note anywhere. Foster is also impressive in her few scenes in the film as is Keitel as the pimp. Shepherd is also good as his Albert Brookes and the underrated Peter Boyle who has one of the best scenes in the movie where he's trying to talk some sense into Travis. The visual look of the film is mighty impressive and Scorsese's directing style is nothing short of amazing. The slimy looking streets and the dark atmosphere are one of a kind and something many films tried to copy but could never get it as perfect as it is here. This here remains one of the greatest American films ever made and I'm really not sure any movie could top it in showing the effects that loneliness can have on a person."
    },
    {
      "username": "Infofreak",
      "userUrl": "https://www.imdb.com/user/ur0381265",
      "reviewLink": "https://www.imdb.com/review/rw0150462",
      "warningSpoilers": false,
      "date": "4 June 2002",
      "rate": "",
      "helpful": "165 out of 248 found this helpful.",
      "title": "Best movie of the Seventies, and one of the greatest of all time.",
      "content": "So much has been written and talked about 'Taxi Driver' that it seems almost redundant to add anything more. But watching it again the other night for the nth time I was, as I have been every single time I've seen it, struck by just how perfect this movie is. It is as powerful and disturbing now as it was twenty-five years ago. It has not only NOT aged, it gets better and more relevant every year. This is without doubt a modern classic, and one of the handful of truly great, timeless movies.Scorsese and Schrader went on to make other great movies after this, both separately ('The King Of Comedy', 'Light Sleeper') and together ('Raging Bull', 'The Last Temptation Of Christ'), but this is easily the best movie of their careers. And Robert De Niro's too. He has yet to top his stunning performance here as the deeply disturbed and alienated Vietnam veteran Travis Bickle, cabbie and would be assassin. This character has not surprisingly entered movie legend. Scorsese surrounds De Niro with a first rate supporting cast, including small but effective roles from Harvey Keitel ('Reservoir Dogs'), Peter Boyle ('Hardcore'), the underrated Victor Argo ('The King Of New York') and Joe Spinell ('Maniac'). Albert Brooks and Jodie Foster are also very good, and even Cybil Shepherd, the butt of many jokes, is fine as Bickle's obsession. When you combine these actors, Schrader's outstanding script, and Scorsese's brilliant direction, with the stunning cinematography (Michael Chapman) and haunting score (Hitchcock fave Bernard Herrmann's final effort), you have yourself a truly unforgettable cinematic experience. If you haven't seen 'Taxi Driver' I urge you to do so immediately. It is a masterpiece, pure and simple."
    },
    {
      "username": "DaveDiggler",
      "userUrl": "https://www.imdb.com/user/ur14069613",
      "reviewLink": "https://www.imdb.com/review/rw1899039",
      "warningSpoilers": true,
      "date": "25 June 2008",
      "rate": "9",
      "helpful": "96 out of 122 found this helpful.",
      "title": "A Descent Into Madness",
      "content": "\"Taxi Driver\" starts off with a beautiful and perfectly fitting score from composer, Bernard Hermann, as we see the blurred city of New York as the fast paced lights from cars and signs are distorted and put into slow motion. \"Taxi Driver\" is one of Martin Scorsese' finest achievements as he teams up with Robert De Niro. Travis Bickle (De Niro) is the title character. The acting as a whole is exceptional. Harvey Keitel has an extremely small part as a pimp named Sport, and he brings a forgettable character to center stage. Keitel is so good in this you wish you would get to see more from his character. Jodie Foster plays the prostitute under Sports rule. Iris, is 12 years old, and for a 14 year old actress (at the time), Foster deals with some heavy and extremely adult material, and she handles it incredibly well. Keitel and Foster have a scene together where Sport holds her and slowly dances with her as he whispers into her ear about how lucky he is to have a woman like her. It's an utterly repulsive scene. The look on his face mixed with the calm and safe look on the face of Iris, is pretty disgusting. It's extremely well acted even though it's a pretty quick and minor scene. In this one scene we see the type of control Sport has over the young, impressionable child that he abuses and takes advantage of. These are the kinds of things that set Travis Bickle off. The film is a classic that dissects the fallout of one mans loneliness and his thirst for acceptance, recognition and notice. The editing is very good, the direction is great, but it's carried by a magnificent script from Paul Schrader and a great lead performance. This probably stands as De Niro's second best work to \"Raging Bull,\" and among the finest acting performances of all time. Travis Bickle is the self proclaimed, \"God's lonely man.\" Bickle walks amongst the people on the filthy, crowded streets of New York City. Wherever he goes, he goes unnoticed; like a ghost meandering through life's morbid boredom of repetitiveness as each day endlessly runs into the next. Bickle suffers from an inability to sleep so he goes to the porno theaters after 12 hour shifts. His mind is constantly racing as he takes various forms of pills and abuses alcohol. The former Vietnam Veteran has a damaged psyche that continues to get worse and worse as the disgust for the lowlifes of New York eat away at his consciences. The first act of the films starts with a normal looking man, with a regular hair cut and regular job in an irregular city. We watch Bickle go through everyday routines and his work habit is the main focus to derive attention away from his bloodlust. We don't see much wrong with him other than some signs of frustration and restlessness. He decides that his body needs some fine tuning as he reverts back to his days as a Marine. He meets up with a gun dealer and buys three pistols and a .44 magnum. He's ready for war, and the table is set. The ending of the film is controversial for its vagueness and its inability to state a clear purpose of reality or fantasy. The film strongly suggests a dream-like state as we watch with a long running overhead shot (possibly signifying Bickle's departure from the world?) of the carnage left in Bickle's wake. Then there's the music of a dream inducing state at the end of the scene, which is the strongest hint towards a dream like state. What we do know is that Travis Bickle takes the lives of lowlifes, degenerates, and the scum of the earth. He's treated as the hero and glorified by the media for his actions. This is a slap in the face to the media for finding that a vigilante did the right thing because it was for a good cause: Kill 5 scumbags, save 1. The final scene of the film is also controversial. We see Betsy for the first time since their big fight and she's no longer disgusted with Travis. Now the media has changed her opinion of him too. Travis has reverted back to the same look he spouted in the first act of the film. He's quiet, reserved and humble. He looks harmless. As the ride home goes along we find out that Palantine has won the nomination. After, Travis drops Betsy off, he leaves without taking her money and with a smile on his face he gives her a simple, \"So long.\" As Travis drives off, he menacingly looks back into the mirror, representing a problem still exists, then we fade back to the start of the film. With the symbolic scenes throughout the film depicting Bickle's brooding, boiling, rage within; symbolizing the fact that nothing has changed. The near death experience doesn't cure him. The accolades from the media and the recognition from everyday people doesn't make it any better. He's still ready for war."
    },
    {
      "username": "TomC-5",
      "userUrl": "https://www.imdb.com/user/ur0488157",
      "reviewLink": "https://www.imdb.com/review/rw0150411",
      "warningSpoilers": false,
      "date": "2 November 1999",
      "rate": "10",
      "helpful": "305 out of 403 found this helpful.",
      "title": "Scorsese's dark masterpiece of urban alienation",
      "content": "Despite what some might see as limited by technical flaws and/or as an overly simplistic plot, Taxi Driver deserves its critical reputation as a cinematic masterpiece. Some 23 years later, the existential plight of Travis Bickle, \"God's lonely man,\" continues to pack a hard emotional punch. In fact, it's hard to know where to begin when praising the elements of this film - such elements as the dark location shots of a (now gone) seedy Times Square, the cinema verite settings of the cabbies and campaign workers, the magnificent Bernard Hermann score, Paul Schrader's fine script, the memorable performances of Jodie Foster, Harvey Keitel, and Peter Boyle all must be mentioned. However, the brilliance of this film is primarily a result of the brilliance of De Niro and Scorsese, one of the greatest actor-director teams in movie history. This is an unforgettable film and rates a 10 out of 10, in my estimation."
    },
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw4609021",
      "warningSpoilers": false,
      "date": "27 January 2019",
      "rate": "",
      "helpful": "17 out of 23 found this helpful.",
      "title": "portrait of loneliness",
      "content": "One of powerful, for its profound honesty, films. A man lost in its loneliness. Desiring love, without social abilities, example of schizoidy and full of noble intentions. Robert de Niro gives more than the role of his life but a precise, realistic portrait of a social victim. A great film."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1332847",
      "warningSpoilers": false,
      "date": "3 April 2006",
      "rate": "10",
      "helpful": "53 out of 83 found this helpful.",
      "title": "An Unforgettable Movie and Lead Character",
      "content": "\"Travis Bickle\" has to be one of the most fascinating characters ever put on film, and this has to still rank as one of the best post-film noir era \"noirs\" ever made.Yeah the story is a bit seedy but it's an incredibly interesting portrait of a mentaly unbalanced cab driver (Bickle, played by Robert De Niro) and his obsessions with \"cleaning up\" New York City.In addition to De Niro's stunning performance, we see a young and gorgeous Cybill Shepherd and a very, very young (12 years old) Jodie Foster. I've always wondered what kind of parents would allow their 12-year-old daughter to play a role like this, but that's another subject. Albert Brooks, Harvey Keitel (with shoulder-length hair!) and Peter Boyle all lend good supporting help.Bickle's transformation from a \"disturbed\" cabbie to a fully-deranged assassin is fantastic to watch, and includes one of the classic scenes in all film history: Bickle talking to the mirror and repeating the question, \"You talking' to me?\" That scene, and seeing De Niro in a Mohawk haircut later at a political rally are two scenes I'll never forget.The more times I've watched this, the more I appreciate the cinematography and the music in here. There are some wonderful night shots of the city's oil and rain-slicked streets. Also, Bernard Herrmann eerie soundtrack is an instrumental part of the success of this film and should never be neglected in discussing this film. Director Martin Scorcese has made a number of well-known (but not particularly box-office successful) films, and I still think this early effort of his was his best. He's never equaled it, although I think he and De Niro almost pulled it off five years later with another whacked-out character, \"Rupert Pupkin\" In \"The King Of Comedy.\" In any case, there is no debate that Scorcese and De Niro are a great team and that Taxi Driver is one of the most memorable movies of the Seventies."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw1604805",
      "warningSpoilers": false,
      "date": "22 February 2007",
      "rate": "9",
      "helpful": "16 out of 22 found this helpful.",
      "title": "Gut Wrenching",
      "content": "It's interesting to read the reviews by people who really disliked this film. Can we dislike virtually every character in a movie and yet keep watching it, even respect it? I don't have a definitive answer to this, but I was captivated by this film. I get this feeling every time I see films that glorify organized crime. DeNiro's performance so surpasses any doubt as to the content of this film that I couldn't take my eyes off him. Contrary to the critics, his every expression reveals his skill as an actor. While his motivations are confusing, they are his motives. He is an unbalanced war survivor who can't tolerate the cesspool the world has become. I mean, \"What did I fight for?\" His social skills are wasted. When he goes on the date, it's one of the most uncomfortable moments I've ever spent in a theater. The efforts to save a small part of his world is met with disdain and resistance. So he flips out and decides to clean it up himself. He is suspicious of politicians and authority figures. He becomes his own man and takes matters into his own hands. The key thing is that he is true to himself and even though he is a frightening figure, he gets his way. I guess most think he should have been killed. That's not a valid criticism. See this, but be prepared to keep changing positions in your seat."
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw0150564",
      "warningSpoilers": true,
      "date": "22 September 2003",
      "rate": "9",
      "helpful": "71 out of 117 found this helpful.",
      "title": "Explains What It`s Like To Be Male",
      "content": "***** SPOILERS *****How would anyone be able to relate to Travis Bickle ? He`s a freak show , a fantasist and a loner who watches porn films in cinemas with a cola in one hand and a candy bar in another and to all intents and purposes is an assassin and a stalker , but he also strikes a cord with any man who`s been angry and young and rejected . He`s an outsider that society has turned its back on : \" Why won`t you talk to me \" is the heartbreaking question every young angry man screams at the world when he`s very alone Scorsese directs Paul Schrader`s low concept script on a shoestring budget - That`s not a criticism , quite the reverse because this leads to a hyper-realism and it`d be impossible to think that a major Hollywood studio would produce something like this nowadays where everything is about making money while playing it safe : A character study of a disturbed loner ? 12 year old prostitutes ? Vigilante executions ? Too controversial , not enough explosions , not enough CGI . If there`s a flaw in the screenplay it`s at the end where Travis wipes out the pimp business and becomes a hero which left me confused . Doesn`t society punish murderers even if they kill scum that use 12 year olds as prostitutes ? Even if he was cleared by the jury surely Travis would still have stood trial for murder ? but this is never referred to in the closing scenes , but I guess this is a comment on how society can quickly make a hero out of a villain and how a nobody can become the talk of the town , but still it seems to go against the grain of the script where we - Or at least the young males in the audience - recognise that an uncaring society is the villain where as Travis is the hero all along Despite the flawed ending of the screenplay ( Which is superb untill the last ten minutes ) this is still a movie masterpiece with Scorsese getting an acting tour de force from his cast . Jodie Foster as a child who sells her body on the streets of New York , a totally disturbing , brilliant performance , and DeNiro and Keitel in the same movie ! I`ve no idea if this is just hype but I heard all the stage schools in the USA were swamped at the time by applications from applicants in Compton , Hell`s Kitchen , South Central and The Bronx who`d seen DeNiro and Keitel in the \" I`m hip \" scene ( A scene that was totally adlibbed by the actors ) and decided that acting could be cool and macho after all . As I said I don`t know how true this is but the performances of these two actors has given a massive amount of credibility to the acting profession and it really is sad to see the DeNiro of today churn out so much garbage . This his greatest performance . I also rate it as Scorsese`s best movie As a footnote may I recommend to all the angry young men reading this review to track down the albums of Matt Johnson aka The The especially the mid 80s albums SOUL MINING and INFECTED which have lyrics that could have been written by Travis himself . Matt is a great fan of Scorsese and it shows"
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw3304283",
      "warningSpoilers": true,
      "date": "24 August 2015",
      "rate": "8",
      "helpful": "17 out of 24 found this helpful.",
      "title": "Bleak and Depressive",
      "content": "The former marine Travis Bickle (Robert DeNiro) is insomniac and decides to work as taxi driver in the night shift. Travis is a lonely uneducated man that spends his leisure time watching porn films in the theaters. When Travis sees the gorgeous Betsy (Cybill Shepherd) working as a volunteer in the campaign for president of Senator Charles Palantine (Leonard Harris), he has a crush on her. He invites Betsy to drink coffee with him and later he dates her. However he takes her to see a porn Swedish movie and she feels offended and leaves him. Travis unsuccessfully sends flowers for her but she rejects him. Travis meets the young prostitute Iris (Jodie Foster) that is trying to flee from her pimp Sport (Harvey Keitel) in his taxi but Sport takes her from the car. Travis also buys several weapons from a dealer and practices shooting. When he meets Iris again, he is resolute to help her. Will Travis succeed in his intent?\"Taxi Driver\" is a bleak and depressive film directed by Martin Scorsese about lowlifes and losers in New York. The lead character is an unstable taxi driver poorly educated and capable to bring his date to watch porn film since he does not know any other genre. Robert DeNiro has magnificent performance and Jodie Foster is amazing in the role of a twelve year-old prostitute. My vote is eight.Title (Brazil): \"Taxi Driver\""
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw1183988",
      "warningSpoilers": true,
      "date": "1 October 2005",
      "rate": "10",
      "helpful": "33 out of 51 found this helpful.",
      "title": "Notes from Above Ground.",
      "content": "Somewhere in the shadows of the night, hidden within the restraints of his taxicab, a lonely man watches with disgust. His eyes survey the streets with all the malice and passion of a burning fire, his large pupils an open doorway leading into his soul. The demons haunt him; voices in his head convince him that the world is closing in and the only way out is through some form of moral redemption; a physical and emotional catharsis.The stranger's name is Travis Bickle and he is God's Lonely Man: a discharged Vietnam veteran who wanders the streets at night in a permanent state of confusion and self-loathing.Travis takes a job as a cab driver to keep out of the porn theaters that have been occupying his time  deciding he might as well get paid for roaming since he does it anyway.But Travis' filtered input and odd output seems to suggest something is dreadfully wrong. The mild insanity of our protagonist begins to escalate. He approaches an attractive political campaign adviser, Betsy (Cybill Shepherd), and asks her out to dinner. She agrees, but the date is cut short when Travis takes her to an X-rated film.Travis soon meets a young underage prostitute named Iris (a fourteen-year-old Jodie Foster), whom he feels a desire  nay, a need -- to rescue from slavery. Iris' pimp, Sport (Harvey Keitel), becomes another of Travis' demons.Taxi Driver was released in 1976 to split praise. Some critics hailed it as a masterpiece, whilst others were a great deal more reserved in their accolade. In Newsweek, Jack Kroll wrote \"( ) in their eagerness to establish rich and moral ambiguities, the Catholic Scorsese and the Calvinist Schrader have flubbed their ending. It's meant to slay you with irony, but it's simply incredible.\" Some critics just hated the film in general and felt the entire runtime was a mess of pretentious storytelling and depressing, gritty themes.Depressing? Yes. Gritty? Yes. Brilliant? Most definitely. Scorsese does not merely address Travis as a character; he puts us inside his head. And even so, there are instances of abnormality in Scorsese's camera work that suggest paranoia and schizophrenia; moments of displaced subjectivity in which we are neither looking quite through the eyes of Travis nor through those around him, but more at length to his side yet it seems that his body (primarily his hands) are below us, at the side of the frame, indicating an altered version of the traditional P.O.V.Scorsese's movie is structured using diverse narrative elements  one of the most prominent being dramatic irony rooted in Greek tragedy (in this case, many set-up and pay-off moments). When Travis exits the brothel for the first time, a Mafioso figure says, \"Come back any time.\" Travis responds, \"I will.\" We know he will, too, and when he does, that's the pay-off.Above all else the film is rooted in the basic existentialism philosophies of Berdyaev, Heidegger and Nietzsche. Scorsese later admitted this his toying of genres and philosophy was entirely incidental (\"It just felt right \") but one can't help but imagine Schrader may have been influenced by Fyodor Dostoevsky's Notes from the Underground, in which our narrator begins, \"I am a sick man I am a spiteful man.\" This brings to mind the scene in which Bickle dictates his journal entries to us and delivers an ultimatum to the \"filth\" on the streets, preceded by senseless introspective rambling.Moving on, the ultimate puzzle of the film: Does our hero live or die? After Travis is shot in the climactic battle, he lies on a sofa, presumably dying, and makes a gesture with his fingers, pretending to shoot himself in the head. The camera pulls up, overhead, and exits the brothel. It then pulls back across the street and up into the heavens, surveying the crowd below.In the next scene, Travis is alive and well, presented to the world as a hero through the media. Yet as Travis pulls away from the curb at the end of the film, Herrman's familiar four notes (the same ones as used for the final shot of Psycho, implemented when Norman Bates' lack of absolute sanity is finally revealed) come into play. A bell rings. Travis looks in his rearview mirror, as if maybe something caught his eye And then, suddenly, the movie ends.Taxi Driver's ending cannot be resolved further more than conjecture and opinion. Scorsese himself says on the DVD making-of documentary that he believes the ending is open for analysis. Did Travis live? Did he die? Are the demons on the street still haunting him? Are we meant to sympathize with him and believe he is a hero, or are we meant to refuse him as one? (Or is this our natural reaction against Scorsese's own wishes -- which would explain the negative reviews in '76?) But it is ultimately the haunting image of Bickle drifting through the endless hordes of nameless people on the streets of Manhattan that lingers with us after the film has ended, and remains the most prescient today. How effortlessly this man can disappear into the multitudes  God's Lonely Man once again alone, alienated and betrayed by the world he has come to loathe. That, above all else, is the most poignant aspect of Taxi Driver."
    },
    {
      "username": "tilismconcepts",
      "userUrl": "https://www.imdb.com/user/ur30260360",
      "reviewLink": "https://www.imdb.com/review/rw6651604",
      "warningSpoilers": true,
      "date": "1 March 2021",
      "rate": "10",
      "helpful": "12 out of 12 found this helpful.",
      "title": "A film open to interpretations even after decades",
      "content": "What I take from this movie might be completely different than what others do. This is one of those masterpieces which appeal to each individual in a completely different way. While most people I know believe that de Niro's character actually died and the end was his imagination before he died, and Scorsese explained it was all literal, the common ground I find and I think that makes more sense is that most of the movie was his imagination except for its end. I think it was in his imagination he fell in love and tried to help Jodie Foster, while in reality he remained an ordinary Taxi Driver. In the last scene however he actually meets the girl he imagined he was in love with, and he only realizes that after she gets out of his cab. He doesn't charge her because for some strange reason which even he doesn't understand he likes her. And just as he moves away from her he realizes this was the girl he imagined. Before she leaves, she calls him by his name and most viewers would think she knows him from the past, but I think she doesn't. She just reads his name written close to the meter on his taxi. Just like the senator figured out his name. What the film in my opinion is actually trying to tell is how a taxi driver dreams of being a hero according to his own understanding of his surroundings."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw2414702",
      "warningSpoilers": true,
      "date": "16 April 2011",
      "rate": "9",
      "helpful": "16 out of 23 found this helpful.",
      "title": "\"Here is a man who would not take it anymore\".",
      "content": "In a calculated exercise, I watched \"Raging Bull\" and \"Taxi Driver\" back to back today. Two classics, and two films generally recognized by critics and fans to be among the best of all time. Personally, I think Bull was the better showcase for both De Niro and director Scorsese as the four years between films allowed both to improve on their respective crafts. In terms of favorites, that might be a moot point, as both are darkly disturbing and violent films, with main characters that aren't particularly honorable, much less likable.Indeed, both characters, the fictional Travis Bickle and the real life Jake La Motta were haunted by personal demons that manifested as forms of mental illness. La Motta's brand of violence was legal inside the ring, what he carried into his personal life resulted in a lifetime of unintended consequences. The outcomes of fictional characters can be manipulated to suit the priority of the writer or director, so in the case of \"Taxi Driver\", the protagonist winds up as sort of a hero, at least to the parents of twelve year old hooker Iris. I'm not sure if the point of the film had anything to do with showing how one's life can turn on a second's notice or not. However when Bickle's assassination attempt on Palantine (Leonard Harris) was foiled, the succeeding events could have led to his own demise. Instead he's reborn, sort of. One could sequel the story after Betsy (Cybil Shepherd) gets a cab ride from Travis at the end of the picture, but it's probably better left to the viewer's imagination.A tiny detail caught my eye in both pictures today which I'm sure I would never have considered had I seen them days or weeks apart. In the carnage of the shootout scene, when the cops make their presence in the doorway of the rented room, Bickle puts a bloody finger to his head simulating a gunshot, and two drops of blood drip from his finger. Scorsese used the same device again in \"Raging Bull\", when Jake La Motta is badly bloodied in his final fight against Sugar Ray Robinson. As the boxer sags against the ring ropes, the camera focuses on the top rope a few inches away from La Motta's outstretched arm. Two drops of blood fall from the rope to the canvas to further intensify La Motta's defeat. At the time, I couldn't say why I found that to be so fascinating, but now I do."
    },
    {
      "username": "Ghenghy",
      "userUrl": "https://www.imdb.com/user/ur1305623",
      "reviewLink": "https://www.imdb.com/review/rw0150484",
      "warningSpoilers": true,
      "date": "21 August 2002",
      "rate": "2",
      "helpful": "195 out of 307 found this helpful.",
      "title": "Still don't get it?",
      "content": "Just forced myself to watch this film again for the third time thinking maybe I had some Natural Born Killer prejudice against this movie, which I kicked, but after painfully sitting through this thing again for the last time all I can say is I'm tired, depressed, and befuddled at the high praise for this darkly disturbing film. Or maybe that's the alure for some people. If you look at the votes for this thing people either love it or hate it. I'm mostly indifferent. The problem I have with Taxi Driver is that there are too many unanswered questions about Travis' background, experience in the Marine Corp, etc. We know he was discharged while Vietnam was winding down but we don't have a clue what the source of his \"instability\" is! Are we to assume that he had suffered some sort of trauma during the war...did he ever see any action...was he really discharged because of his instability? In fact, the guy seems perfectly normal other than a slightly obsessive compulsive complex which 70% of society is sporting, and he can't sleep. Awwww, poor thing. Well neither can I, and a lot of people can't sleep at nights. Does that alone make Travis a candidate for the nuthouse? Nope. The truth is, we don't know what his problems stem from and that is a major problem with this movie. His descent is so spontaneous when Betsy reacts about being dragged to an adult film, and he just snaps, we don't know why?!? (spoiler alert) Next thing you know the guy is buying guns like there's no tomorrow to feed his all-of-a-sudden John Wayne complex that springs from a source we can't as an audience connect with. Good performances overall don't salvage the many holes that litter the canvas of this highly overrated drama. And somebody please explain to me all this talk about Travis searching for \"redemption\", from WHAT>?>? Jeez! The final shootout is a little too reminiscent of the Wild Bunch where spurting blood and bad editing wooed critics all around. Amazing. 6/10"
    }
  ],
  "errorMessage": ""
}