{
  "imDbId": "tt0119698",
  "title": "Princess Mononoke",
  "fullTitle": "Princess Mononoke (1997)",
  "type": "Movie",
  "year": "1997",
  "items": [
    {
      "username": "zetes",
      "userUrl": "https://www.imdb.com/user/ur0391152",
      "reviewLink": "https://www.imdb.com/review/rw0426392",
      "warningSpoilers": false,
      "date": "7 November 1999",
      "rate": "10",
      "helpful": "334 out of 391 found this helpful.",
      "title": "one of the best films i've ever had the chance to see",
      "content": "Princess Mononoke is, without a doubt, one of the best films I have ever witnessed. There has never been an animated film even close to this -- I kept thinking after I left the theater, how can Disney even have the guts to make another film after seeing this? Even live action movies pale in comparison to Princess Mononoke. There has never been a film to pay such close attention to details. Watch for the magnificent and subtle flying insects throughout the film, especially in the ancient forest, where bioluminescent dragonflies glide gently around the screen. There are thousands of subtleties such as this. You'd have to see it a dozen times to appreciate this film fully. Aside from it being the most beautiful film I've ever seen, it also has an enormously powerful script. The characters are some of the the most well rounded in all film. Ashitaka especially, the main character of the film, is so nuanced that he has become in my mind one of the great characters in film, up there with Charles Foster Kane and Jake LaMotta. I would compare him to Freder, the main character of Fritz Lang's Metropolis. His role in the film is a mediator between the forces of humans and the gods of nature. Both sides comment several times that Ashitaka must be on the other side, when he is trying desperately to convince everyone that there are no sides. Peace is the way. There is a little to be desired in the American voice talent. Claire Daines was certainly a wrong choice for San (Princess Mononoke), and Billy Bob Thornton just could not hide his southern accent, which made the character of Jigo seem more comical than he was probably supposed to be. Gillian Anderson's voice clashed with her character, the wolf god Moro, a bit. It hardly affected my passion. The film was so spectacular and beautiful that James Earl Jones could have voiced San and it would have detracted little. Definitely, though, I'm praying that they release the DVD with subtitle options. Anyway, Princess Mononoke is the best film of 1999, the best film of the 1990's, and, in my personal top ten list, no lower than #5, but closer to #2. 12 hours later and my heart is still beating with the power of Princess Mononoke! America: SEE IT!"
    },
    {
      "username": "TanjBennett",
      "userUrl": "https://www.imdb.com/user/ur2068165",
      "reviewLink": "https://www.imdb.com/review/rw0426522",
      "warningSpoilers": false,
      "date": "15 April 2003",
      "rate": "10",
      "helpful": "354 out of 380 found this helpful.",
      "title": "Allegory on the balance between humans and nature",
      "content": "This seems to be Miyazake's most personal work, clearly a serious design. It is set in an imaginary time which blends the time of the ancient gods (Shinto style, gods of place and nature) with the settlement of humans and the coming of metalworking and war. The world is not in balance, and a distant conflict between industry and nature has wounded one of the gods of the forest, which is then killed by a sentry boy as it rampages into farmland he guards. The evil controlling it transfers to him, beginning a slow takeover, and he must journey to the origin of the conflict to find a way to cure himself and incidentally, as he will learn, to try to restore balance. But this is not a simplistic tale, he finds there are other characters in play, and there is good and evil in everyone, and no easy balance. The Princess (Hime) of the story is a mysterious human who has been raised by wolves (which are themselves powerful forest gods, a little reminiscent of the Amerindian Coyote myth), who becomes both his ally and his enemy. The story is not easy to understand. It has many Japanese mythic elements but even then, it is a work of Miyazake's unique imagination, and is not intended to be simple or to have a clean resolution.The animation is spectacular, and unusual, with new elements even for Miyazake and marks a new departure for style which you can see continued in his next film, Sen to Chihiro - more nature, more wild, more jamming on elements from Japanese myth and folklore. And, continuing the trend to be more personal, concerned with ethics and character, and less sci-fi. There are at least half a dozen well developed characters threaded through the story, and their animation is wonderful in displaying subtle character.The original Japanese soundtrack has some amazing singing and draws upon some of the best talent available for voices - in Japan, Miyazake is universally known and this was a masterpiece carefully crafted. Japanese television documented a lot of the production. The English translation drew on some good talent but they seem not to have \"gotten it\" quite so intensely as the Japanese crew.If you haven't seen Miyazake, give it a try (but maybe look at Sen to Chihiro first, or even Laputa or Kiki's Delivery Service, for easier and lighter introduction to his work). Some say he is the Japanese Disney, but I don't like that. His work has a depth and sophistication that goes beyond Disney cute. There is no other animation like it. This is truly an adult work: children might like some of the visuals, but I doubt that many kids below teen age will have any idea what it is all about, and even adults will get more out of this each time you see it again."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2106359",
      "warningSpoilers": false,
      "date": "4 August 2009",
      "rate": "10",
      "helpful": "45 out of 53 found this helpful.",
      "title": "Absolutely breathtaking!",
      "content": "Princess Mononoke is one of the best animated movies I have seen in a long time, and is up there with Studio Ghibli's best along with Spirited Away. I will say I am probably biased, as I am a huge Studio Ghibli fan, and love all of their films, I even like Cat Returns, which along with PomPoko is considered as one of the weaker Ghibli efforts. The animation in Princess Mononoke is absolutely stunning, with rich detailed backgrounds and brilliant character animation. The image of the Stag actually made my jaw drop. The music is fantastic as well, and although environmentalism is a subject matter very difficult to get right, what the filmmakers succeeded in doing was making a highly intriguing story that was not only original but succeeded in not being preachy at all. The film is also helped by the high calibre vocal talents of Minnie Driver, Claire Danes, Billy Bob Thornton et al (voicing quite remarkable characters) and a strong script. True, some of the images like the Demon Worm, may frighten younger viewers, but it is fair to say they were very powerful. All in all, Princess Mononoke is breathtaking and I recommend it highly. 10/10 Bethany Cox"
    },
    {
      "username": "JTurner82",
      "userUrl": "https://www.imdb.com/user/ur4989916",
      "reviewLink": "https://www.imdb.com/review/rw1043060",
      "warningSpoilers": true,
      "date": "20 March 2005",
      "rate": "10",
      "helpful": "63 out of 73 found this helpful.",
      "title": "Breathtaking. Watch with \"eyes unclouded.\"",
      "content": "In its theatrical Japanese release of 1997, PRINCESS MONONOKE was the hugest box office grossing movie of all time in the land of the Rising Sun until it was overtaken by James Cameron's TITANIC, and, four years later, director Hayao Miyazaki's own SPIRITED AWAY. No wonder. This movie, like an earlier project of Miyazaki's, NAUSICAA OF THE VALLEY OF THE WIND, explores man's relationship with nature, hatred causing destruction, and, more importantly, real characters (in other words, no real \"hero\" or \"villain\") trying to get by in a world continually torn by war.This is not a movie for young children, as there are disturbing shots of decapitations, amputations, and occasional blood spurts. Sometimes these elements of violence turn squeamish viewers away from Anime (especially when they're done gratuitously), but Hayao Miyazaki presents it not to sicken people but to show it for the horror that it is (plus, in this film, the violence is not overdone). Take, for example, the scene where the protagonist, Prince Ashitaka of the Emishi Tribe, possessed by a curse he received from killing a Demon God (in trying to protect his village), tries to stop samurai attacking innocent people, and in doing so shoots the arms off of one man, and, later, takes off a man's head with two arrows. The sight is horrifying to see, but the deed also increases Ashitaka's demon mark on his arm, which is slowly preparing to take his life. This is a truly horrible depiction about the dangers of violence.Also worth noting is Princess Mononoke herself, a human girl named San raised by the Animal Gods, and her struggle against Lady Eboshi of Iron Town, who is destroying the forest merely for her people's own good (the folks are outcasts, including lepers and prostitutes). San distrusts and despises all humans, and is especially determined to destroy them all (particularly Eboshi)... or die trying. When she's rescued by Ashitaka, however, a conflict within her begins to surface: are *all* humans evil, or is there at least one who is trustworthy? If there is any character who could be considered a villain, it would be the monk, Jigo, who wants the head of the Spirit of the Forest to bring to the Emperor. Such a deed would destroy the entire forest (as we find out in the film's chilling climactic scenes) but even Jigo has his own motives, too. He is not so much evil as much as he is just \"trying to get by\". This pretty much sums up the conflicts between all our characters here.PRINCESS MONONOKE may not have enjoyed similar box office success here in America, but at least a lot of work and care went into the translation. As with Disney's other English language tracks for Miyazaki's films, this one is very, very well done. Acclaimed writer Neil Gaiman worked on the script, rewording it only to a) fit the mouth flaps, and b) make it understandable to a non-Japanese audience who would probably not comprehend a lot of the cultural nuances found in this film. Added to which, the voice cast includes a commendable list of stars; Billy Crudup is perfect as Ashitaka, eliciting just the right amount of warmth, kindness, compassion, wisdom, and courage, while Claire Danes delivers passionately angry, conflicted turmoil to San. (Folks said she was miscast, but I beg to differ; her character is *required* to be outraged and aggressive, and Danes does have a strong voice to carry such emotions.) The rest of the cast includes Billy Bob Thornton as Jigo (a grossly underrated performance; his Southern drawl adds to the character), Minnie Driver (elegant choice!) as Lady Eboshi, Gillian Anderson as the Wolf-Goddess Moro, and Jada Pinkett-Smith as the friendly (if no-nonsense style) worker Toki. The translation flows smoothly to those who are not familiar with Japanese folk tales, and the story succeeds in making its point, too.This movie may not be for everybody, as it is the kind of film that may disturb young children, but older audiences will find themselves absorbed in the artwork, which showcases gorgeous, unmatched imagination, from the finely detailed forests to the cute little Tree Spirits who appear and disappear at will to the Forest Spirit itself -- a huge deer who makes plants grow with each step he takes. And at night he becomes a ghostly specter known as the Nightwalker, traveling higher than the trees. Such images warrant the purchase of this film. Better yet, its message is not too preachy, and rarely do animated movies (save those from Japan) showcase characters portrayed as, well, human beings."
    },
    {
      "username": "morphion2",
      "userUrl": "https://www.imdb.com/user/ur6176268",
      "reviewLink": "https://www.imdb.com/review/rw1258146",
      "warningSpoilers": false,
      "date": "7 January 2006",
      "rate": "10",
      "helpful": "43 out of 50 found this helpful.",
      "title": "Enthralling and Artistic",
      "content": "Studio Ghibli has been Japan's leading anime Production Company since the 1980's, when legendary anime director Hayao Miyazaki released his first feature film \"Nausicaä of the Valley of Wind\" (1984). From the very beginning, it was clear that the Japanese director had a fantastic flair for animated film, and the uncanny ability to engross his audiences beyond the normal movie-experience that makes him the King of Escapism. Over ten years later, it seems that Miyazaki is still just as good, if not better, as he invites the world into his latest visionary fantasy, the cult classic \"Princess Mononoke\".The film is set in Japan, during the Muromachi Era, and begins in the quiet peaceful township of the Emishi tribe, when young Prince Ashitaka (Yôji Matsuda), the last of the Emishi royalty, is wounded slaying a demon in an unexpected attack. When the tribe's wise-woman tells Ashitaka that the wound is a curse of hatred that will eventually kill him, he sets out on a journey to the west to discover the origins of the demon. What he finds is a war being waged between the villagers of Iron town, an industrious Iron-works fort led by the ruthless Lady Eboshi (Yûko Tanaka), and the beasts of the forest, represented by the beautiful Princess Mononoke (Yuriko Ishida), a human girl raised by wolves, with whom the cursed prince falls in love. Soon Ashitaka's efforts to make peace are put to the test by each side's bid for allegiance.\"Princess Mononoke\" is a fantastic work of art on many fronts, and arguably Miyazaki's best film to date. While some of his other projects have had the same enchantment and excitement, \"Mononoke\" has an intriguingly dark and infinitely more mature feel, established by the bloody battle-scenes and sensitive color treatment, and solidified by a complex plot and rich, interesting characters. The most obvious illustrative trait of the film is the ambiguity of the characters' nature; the lack of distinction between good and bad. The ruthless lady Eboshi, while caring nothing for the forest or its inhabitants, is very compassionate towards the underdogs of her own community, such as the brothel girls and the lepers. And the wild wolf-princess, while desperate to defend her fellow forest-dwellers and protect the forest spirit, has a deep-seated mistrust of humans that even steeps into self-loathing at times. These interesting character traits make the film a lot more rewarding than many of Ghibli's other works, which were aimed mostly at children.Of course, all these intriguing themes and characters are only a part of the film's wonder, because Miyazaki's true gift lies in imagery. The detailed animation of \"Princess Mononoke\" is astounding, drawing its audience into its environments, from lush forest to open fields to crowded marketplace and more; the team of animators that poured their hearts and souls into this film should take utmost pride in their accomplishments. Using minimal and tasteful CGI, the movie stays very warm and inviting even when the subject matter and mood is less-than-friendly. This is also owed to the audio aspects of the picture; the voice talents involved are highly engaging and enjoyable, even in the English dubbed version, which features such big western names as Billy Bob Thornton, Minnie Driver, Billy Crudup, Clare Danes and Gillian Anderson. Joe Hisaishi's music is also a rather splendid complement to the film.Overwhelming success of the anime production in Japan alone stands as a testament to its fine quality. Breaking a 15 year record held by Spielberg's \"E.T.\", \"Princess Mononoke\" became Japan's No. 1 movie of all time in the year of its release, as well as taking the title of best-selling video/DVD of all time. It is also the most expensive animated Japanese feature in history, reaching a budget of 2.4 billion. Outside of its home-country, however, the film continues to inspire and engage audiences from all corners of the globe, taking a well-deserved place in the list of cult-favorites for film-lovers everywhere."
    },
    {
      "username": "misty6767",
      "userUrl": "https://www.imdb.com/user/ur2072125",
      "reviewLink": "https://www.imdb.com/review/rw0426569",
      "warningSpoilers": false,
      "date": "14 August 2004",
      "rate": "10",
      "helpful": "253 out of 286 found this helpful.",
      "title": "Very touching movie!",
      "content": "The first time I saw Princess Mononoke I was completely moved and surprised. Since it was a Studio Ghibli film dubbed by Disney I liked the fact that it wasn't a \"they all lived naively ever after\" film. There were no complete \"good\" or \"bad\" guys. Even Lady Eboshi the most antagonist character in the movie had a reasonable motive for trying to get rid of the animal gods and cutting down the forest. Although it her actions were environmentally damaging and wrong in general, she did it to help her people survive which is what all the species on Earth strive for. Another wonderful aspect of the plot is that it sends a message - Protect the Earth and all will survive in peace - a message either discreetly or strongly portrayed in many of Miyazaki's films. Perhaps the portrayal of this message (and the tiny hint of San and Ashitaka's romance and Moro's views on nature) was what made the film so touching to me.Like many Miyazaki movies, the animation (as always) is wonderful and nicely detailed which is also another quality that genuine Disney films lack (thank goodness for Studio Ghibli). The music was beautiful and well suited to the movie.The only predicament to the movie is that it is a bit downbeat and does not contain much happy laughter (oh well, I can watch My Neighbor Totoro - also a good movie - for happy laughter.).10/10 - And my favourite movie of all time."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6195896",
      "warningSpoilers": false,
      "date": "22 October 2020",
      "rate": "9",
      "helpful": "18 out of 22 found this helpful.",
      "title": "Palm Oil Forest Demons...",
      "content": "... and arable desert dust bowl aliens. It seems our intent to unbalance, upset, bias, distort and thoroughly irritate Mother Nature knows no bounds. I'm curious of the curses and phantasms this great animator would conjure against Homo Ignorantia in todays world, spectral beasts perhaps, to unite alongside the current pandemic sent to warn us off the path we're so resolutely set on taking.As engaging a narrative and animation as any you'll come across, with enough to keep you pessimistically in despair of the curse the people of the world are to the lifeforms we share resources with on this planet we call home."
    },
    {
      "username": "Rectangular_businessman",
      "userUrl": "https://www.imdb.com/user/ur13538926",
      "reviewLink": "https://www.imdb.com/review/rw2263379",
      "warningSpoilers": true,
      "date": "12 June 2010",
      "rate": "10",
      "helpful": "20 out of 26 found this helpful.",
      "title": "A masterpiece",
      "content": "Ever since I was a kid, I was fascinated by animation, I watched way too many cartoons and would often drawn them myself. I never thought of animation as \"real art\" or anything fancy, just one of life's simple pleasures. Sure Disney had made some ground-breaking animated features, and technology was allowing for more and more detailed and intricate animation techniques, but no animated film had ever moved me as much as a Godfather or Unforgiven or Dr. Strangelove, that is until one fine day in 1999. I was in high school, and Princess Mononoke was premiering at the Coolidge Theater in Brookline, I was pumped as I really enjoyed Castle in the Sky and Totoro, so I went to the theater with a few friends and was absolutely clown away for this. This film is so spectacular in almost every way and every piece comes together perfectly. The animation is top-notch, not that shoddy 1980's anime style, but the mind-blowing animation techniques that made Miyazaki the maestro his is today. The score by Joe Hisaishi is tremendous, though at times it may seem a bit overly dramatic (I mean this is an animated feature, not Lawrence of Arabia), but this is the ultimate animated epic, so it fits in well. The plot is dense and the characters are well-developed, there are no true \"good\" or \"bad\" guys in this film...and Miyazaki includes his favorite underlying theme of Man vs. Nature throughout. Some may argue that Spirited Away was Miyazaki's crowning achievement, but I believe that Mononoke Hime is his true Masterpiece."
    },
    {
      "username": "alvaradj",
      "userUrl": "https://www.imdb.com/user/ur0593798",
      "reviewLink": "https://www.imdb.com/review/rw0426438",
      "warningSpoilers": false,
      "date": "1 February 2000",
      "rate": "10",
      "helpful": "384 out of 425 found this helpful.",
      "title": "A true work of art that takes animation to an entirely new level",
      "content": "I saw Mononoke Hime on its USA release back in late December 1999 under its U.S. title Princess Mononoke. I had read quite a bit about this film and its director but was still totally overwhelmed by the beauty and brutality of this movie. The complexity of this movie is something never seen in the United States in an animated movie and even exceeds that of most live action movies as well. It combines love and hate, war and romance, nobility and deception in ways rarely seen in movies today. Lines of good and evil are anything but clear cut and in the end is hope but no guarantees, no promises. This is truly an adult movie but my children, ages 12 to 15 all loved it and talked about it for days later. Even my wife who holds a strong prejudice against Japanese animation enjoyed this movie.Go and see this movie. You won't be disappointed."
    },
    {
      "username": "baumhenrik",
      "userUrl": "https://www.imdb.com/user/ur80388571",
      "reviewLink": "https://www.imdb.com/review/rw4762278",
      "warningSpoilers": false,
      "date": "4 April 2019",
      "rate": "10",
      "helpful": "15 out of 18 found this helpful.",
      "title": "One of the best in history",
      "content": "When I first saw 'Princess Mononoke' on Christmas eve back in 2006 I was 10 years old and couldn't really follow the story since I was quite disturbed from the explicit graphic content. Especially the giant pig suffering of a demonic disease scared the hell out of me back than. But never less is knew that this movie is something special, something I have never seen before. Since then I became a huge fan of Studio Ghibli and watched nearly everything they have produced. But still 'Princess Mononoke' stands out to me as their best work and to me is Hayao Miyazakis masterpiece. The topic of this movie is just as simple as complex. It's the fight between human culture coming with the technologic industry versus the nature and its variety of animals living in it and to this day it's a pretty relevant topic. The way both sides are portraied in this movie is just beautiful. Miyazaki manages to show both sides with all their strength and weaknesses. There's no good side or bad side. Instead every side can be understood by the viewer and even if you don't agree with their opinions you still are able to see why each side acts like they do. The visual work is top notch like always with Studio Ghibli. I love how they create a feeling for nature as one whole organism. I really recommend everyone to go watch this movie. To me this is one of the best movies ever created."
    },
    {
      "username": "TheMovieDiorama",
      "userUrl": "https://www.imdb.com/user/ur67902729",
      "reviewLink": "https://www.imdb.com/review/rw4076886",
      "warningSpoilers": false,
      "date": "28 February 2018",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Princess Mononoke is Miyazaki's masterpiece.",
      "content": "I've found it, I've finally found it. Studio Ghibli's magnum opus. The greatest anime feature film I've ever seen. Possibly the best fantasy film I've seen as well. This, this is absolutely incredible. Flawless. The story involves a young warrior who is injured with a supernatural curse. He leaves his remote village in search of a remedy but is caught in the midst of a battle between humans and divine beasts. Depicting the clash between the natural ecological system and the modern urbanisation of mankind. Two opposing ideals and environments that struggle to cohabit in unison. An important environmental statement: be good to nature and nature will be good to you. A fundamental statement that doesn't at all feel preachy, but yet it's ever so present throughout every artistic scene. Strip away the fantasy elements and you are still left with a poignant plot that consistently engages throughout its runtime. Every scene matters, every scene builds upon each other like a stack of bricks to then culminate for an epic third act. The animation is stunning. A work of art. The imagination and creativity that is portrayed on screen is a wonder to behold, and will appeal to everyone. The English dub was well done, all the voice actors suited their roles. San's voice did take some time for me to warm to, but by the end I was on board. Surprisingly, this is an emotional journey. Towards the end where there are a few deaths, I actually felt saddened. The biggest impact of them all was actually the destruction of the environment, Miyazaki somehow creates a personality out of the forest to which I connected to it on an emotional level. Masterful work, it really is. Also, the musical score was mesmerising. Slight warning, its rated a PG but I think it will too much for younger viewers. Lots of severed limbs and bloody imagery that I'm sure will invoke nightmares. Princess Mononoke is the best Studio Ghibli animation I've seen, it's an epic masterpiece that everyone should watch. For that reason it gets the perfect rating."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw1744991",
      "warningSpoilers": false,
      "date": "12 October 2007",
      "rate": "8",
      "helpful": "20 out of 29 found this helpful.",
      "title": "Riveting and marvelous cartoon movie by the genius Hayao Miyazaki",
      "content": "This magnificent cartoon movie concerns Japanese legends , it begins when Ashikata, a prince warrior is wounded by a cursed giant boar . He attempts to encounter some way to heal incurable curse inflicted . Ashikata saddled in his red deer goes to the east, where finds the Iron Town , ruled by Lady Ebosi confronting Sam , the princess Mononoke, a human girl raised by wolves . Ashikata encounters in the middle of fighting among the forest animals : large wolves, giant boars and humans : emperor Mikado soldiers , Lady Ebosi soldiers and Shogun army . Furthermore, in the forest finds the deer god and spirits called Kodamas .This wonderful film is plenty of fantasy , adventures, drama, spectacular combats and with ecological message . The picture is narrated with sensibility and sense of wonder and quite entertaining, though isn't apt for small kids but contains graphic violence . It's a deep critical about nature exploiting and killing the forests for the encroaching civilization represented by an iron mining town that cause a damage environment . This stunning film, though a bit too long, converted the first of any kind to gross over the box office in Japan and around the world. The motion picture was splendidly realized by Hayao Miyazaki , he personally corrected or redrew more than 80,000 of the film's 144,000 animation cels . Being accompanied by sensitive music score composed by his usual musician , Joe Hisaishi. Miyazaki also directed other excellent cartoon movies as ¨Howl's moving castle¨ , ¨Chihiro¨ , ¨Porco Rosso¨ and ¨My neighbour Tororo¨ . Rating : Sensational and fantastic , it's a masterpiece cartoon movie."
    },
    {
      "username": "Boba_Fett1138",
      "userUrl": "https://www.imdb.com/user/ur1416505",
      "reviewLink": "https://www.imdb.com/review/rw2636833",
      "warningSpoilers": false,
      "date": "3 July 2012",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "A beautiful blend of an adventure and fairytale.",
      "content": "You really don't have to be into anime to appreciate some of the movies that the genre has to offer. Some of them are being simply so good and captivating that basically everybody should be able to get grabbed by it. And I feel that this is one of those movies, that is being a great blend of adventure and fairytale elements.It's really a movie that speaks to your imagination. It's set in a fantasy world, that still feels and looks a lot like our world and the movie is literally loaded with some great and impressive looking fantasy creatures, with the one even bigger and more amazing than the other. In essence this is a mankind versus nature type of movie, in which nature does a lot of fighting back! I can definitely see how \"Avatar\" got 'inspired' by this movie and it features some similar themes and at times also a similar type of atmosphere in it. And I should say though that I liked this movie far better than \"Avatar\"! The themes worked out better and were overall more effective and as a whole the story of this movie worked out more pleasantly.I should admit though that the movie can get quite hard to follow at times, will all of its things that are happening and characters that are in it. But this is a 'problem' I have with basically every anime and it very rarely ever ruins the movie experience for me, so it's no complaint or problem really. The movie has some great strong characters in it that can hold their own, amidst all of the great and powerful looking creatures in this movie. And there really are a whole bunch of characters in this movie but this never becomes anything distracting and the movie also never looses its focus. All thanks to some great storytelling skills of course, by Hayao Miyazaki.The animations are absolutely great looking and help to give the movie a great and effective fantasy atmosphere. What I also like about it is that's being such an easy thing to exaggerated things when your animation it, especially all of the action but everything in this movie feels 'real' and doesn't goes over-the-top with things, despite the presence of lots of fantasy elements and characters in it.Another thing worth mentioning is the musical score by Joe Hisaishi. Some great stuff!Whether you like anime or not, this is a great fantasy-adventure movie for everybody, everywhere!9/10http://bobafett1138.blogspot.nl/"
    },
    {
      "username": "Gresh854",
      "userUrl": "https://www.imdb.com/user/ur40127150",
      "reviewLink": "https://www.imdb.com/review/rw4249295",
      "warningSpoilers": false,
      "date": "22 July 2018",
      "rate": "9",
      "helpful": "10 out of 12 found this helpful.",
      "title": "Studio Ghibli Fest 2018",
      "content": "I'm so thrilled that I decided to watch Princess Mononoke for the first time ever on the big screen. Studio Ghibli is just nonstop in terms of their animated quality (leaving most animated studios in the dust) even in times like the 90s when this film was released. The action sequences are crafted with such care and such brutality that it's hard not to be remarkably energized by them. The characters surrounding the movie are so engaging and iconic which immensely supports a deeply fleshed-out and powerfully thought-provoking story. Princess Mononoke is a breathtakingly painted tale of a man on a quest to balance two opposite ends of a war filled with hatred, greed, and violence. The conflict of siding between two teams is quite apparent in the film, and it's resolutions are as beautiful as they are significantly important in the real world throughout human history and especially today. (Verdict: A)"
    },
    {
      "username": "HeyMrPiccolo",
      "userUrl": "https://www.imdb.com/user/ur0797877",
      "reviewLink": "https://www.imdb.com/review/rw0426227",
      "warningSpoilers": false,
      "date": "24 July 2000",
      "rate": "10",
      "helpful": "157 out of 188 found this helpful.",
      "title": "This film has \"raised the bar\" in the world of animation.",
      "content": "I have seen many many animated features, but none compare to the talent that is shown in this anime. After seeing this for the first time, I could see why so many animators (especially disney animators) consider Mr. Miazaki a GOD! His animation style has the best \"flowing motion\" I have ever seen.The American dubbing team, whoever they are did an excellent job picking voices, they got top notch actors to do the job right (unlike most animes today). They even took on the hair-pulling task of RE-ANIMATING the mouth movements to match!This is by far one of the best films I have ever seen."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1390667",
      "warningSpoilers": false,
      "date": "11 June 2006",
      "rate": "10",
      "helpful": "17 out of 25 found this helpful.",
      "title": "mind-shattering anime; my favorite of Miyazaki's films",
      "content": "Some might watch Princess Mononoke and find ambiguity at times. It's goes beyond formula into something that challenged me, the interplay between the forces of nature where sometimes the seemingly 'good' side is not what it seems, until the bigger, darker picture comes into view. It's a purely imaginative effort, with a level of dramatic- more over cinematic- power that I'd compare with Kurosawa on a level. Princess Mononoke, in its uncompromising way, details the violence without pulling away while also being rather anti-violent in the process. It is also hard to pinpoint on any one level. Visually it's got so much going on to practically experience the abstractions that Hayao Miyazaki folds up into the rest of the story. The story itself trails along with the best of epic fantasy, with this crucial, earth-shattering quest that works on that level of action-adventure (possibly more for adults despite the PG-13 rating here in the States) as well as the mythological side of things. Some have written that it is a bit of a complex film in structure and storytelling, bordering on confusing. I would disagree, though I can see what they mean- you have to pay closer attention than usual of more American films. But on a more profound level, if one could call it such, it's really not hard to follow.The hero of the film, interesting enough, is the type of tragic hero, though with one clear sight amid the chaos on the two sides he encounters- peace. He is cursed by a sort of wormy-jelly demon that runs unyielding in the darker recesses of the world. He searches for something to rid him of his scars while on the human side at some points (mostly dominated by the women impressed- or against- his skills), and with those of the wolves on the other side. The title character is part of the latter, though also human, bringing a little more of the underlying symbolism with a character. Then there are also the boars ready to destroy the humans, even to their demise. Amid the battles that rage on, leading to the significance of a certain 'Deer God' as the centerpiece of the balance of the forests and civilizations, not too much is made explicit. At the same time, the side taken by the cursed hero is even questioned by one character, and with that part connected with the others the story trumps what could have been a kind of smothering over-symbolic representation into what is necessary and spectacular about the film.In fact, I would estimate on just the near bravery of what Miyazaki is achieving in the film, it's one of the best films of its kind. And 'of its kind' in this case is the animated film that breaks conventions and the typical 'good vs. evil' logic. Many times the suddenness of things had me wide-eyed, and each creature or little variance on the creations- both good and evil- are elaborated with out compromise. The digitally-animated worm-Jelly type monsters are some of the more memorable ones, to be sure, as they book-end the picture in different extraordinary ways (the climax in particular probably ranks with the best of the last decade or so). The tiny bobble-headed alien creatures are also a delight as they rattle and gather and multiply and flee all around; this is the kind of scene that is dream-like to a truly weird and bright sensibility. And many scenes that have more of that samurai-movie quality to them (again, Kurosawa) are extremely well-done on their own as then they become mixed around again with the fantasy elements.To say that the film is really a 'family' film might be not entirely accurate, as some of the battle and attack footage is pretty graphic in its own ways, if not as much as other more adult anime like Fist of the North Star or Ninja Scroll. There are even moments I would say that, had I been little and watching some of the more twisted and macabre scenes, I might have cried from it. But this is a credit to Miyazaki and his Studio Ghibli; for older kids this could mark as something that is, indeed, foreign to their expectations, at least American ones. It is a work of art, not just animation, that takes chances and isn't afraid to go for the right twists and leaps of creation and at the same time keeping its message noticeable but not overbearing. It's a film I can't wait to see again, and likely my favorite of the filmmaker's too, with the same cinematic drive as in the other works I've seen but reaching the ambitious heights it intends."
    },
    {
      "username": "seamas",
      "userUrl": "https://www.imdb.com/user/ur0199603",
      "reviewLink": "https://www.imdb.com/review/rw0426442",
      "warningSpoilers": false,
      "date": "11 January 1999",
      "rate": "10",
      "helpful": "149 out of 177 found this helpful.",
      "title": "Stunning and sharp (in any language)",
      "content": "I saw this film in Japan, in Japanese with no sub-titles, I don't speak a word of the language and I was still enthralled! It is Miyazaki most visually intense (surpassing, at long last, Nausicaa) and is alive with color and movement the like not yet seen in anime.The story is complex, and after talking with Japanese friends, it is clear that much of it went over my head (particularly that relating to specific Japanese myths), but the important elements came through. Miyazaki's long infatuation with technology verses nature and man's relation to God (or gods) weave throughout the film as does his trend for strong women characters. Even with the language barrier, the film is of such intense emotion that it caries you through to the end. The change in dynamic between the crashing fight scenes and the quiet scenes of healing by the lake is so broad and so well paced that I can't remember a film where my emotional state was so expertly varied.If you have a chance to see this film, in any language, I recommend you do."
    },
    {
      "username": "jzappa",
      "userUrl": "https://www.imdb.com/user/ur8625456",
      "reviewLink": "https://www.imdb.com/review/rw1482360",
      "warningSpoilers": false,
      "date": "24 September 2006",
      "rate": "9",
      "helpful": "6 out of 7 found this helpful.",
      "title": "A Film Animal Lovers Will Love: Respect Nature For It Can Destroy You.",
      "content": "Princess Mononoke is a grand, beautifully animated, heartfelt epic. It's a historical fantasy adventure, it's a melodrama, it's a race against time. Its pace is wonderful, taking us climactically through the all-embracing, outspread scope of the story. It has heart, it has violence, it has visual beauty, it has internal conflict.What I like the most about Princess Mononoke is beyond all of these wonderfully delivered elements of a great movie. It's a movie about compassion and understanding towards animals. Yes, these animals are represented by gargantuan, violent beasts, but the movie is about human headstrong influence vs. animal outlook, sense, and behaviorism. It's about how astonishingly much more acute and attuned an animal's understanding is of the world's natural order than that of a human's.I think Princess Mononoke, while being a beautifully made action-adventure, it's an important film, especially for Miyazaki's younger fans. It's important that they take the message of the film seriously."
    },
    {
      "username": "jose-cruz53",
      "userUrl": "https://www.imdb.com/user/ur36494160",
      "reviewLink": "https://www.imdb.com/review/rw2684407",
      "warningSpoilers": false,
      "date": "6 October 2012",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Holy sh*t!",
      "content": "*Note: for fully imersing oneself in this film one has to watch it in Japanese. Do not watch in English unless you want to watch with with kids under the age of 10 (well, when I was 10 I was already watching everything subtitled, people should not be afraid of subtitles).The most powerful experience I ever had watching anything (be either a film, a TV series, theater or a show) was the second time that I watched this film. The first time I didn't really give respect this film deserves (I though it was a childish cartoon and I watching it for a guilty pleasure) and actually failed to really get it. After watching several other movies I remembered this film and I noticed it was truly better than anything else I had watched lately, so I decided to watch it again, this time really paying attention to it: The first few minutes were already better than the last five films I had watched put together. When it ended I cried and was unable to sleep for 5-6 hours, thinking about how freaking awesome this film was.This film features the most powerful score ever. I would call it truly a heavy score, like Black Sabbath, but more epic and without distortion. Most film scores are just background noise that serves to convey emotion, but here the score has a life of its own. Indeed, the score alone makes this film better than 90% of all other movies.Edit: Today a viewed this film for the third time. It became BETTER than the second time. I also viewed 2001: A Space Odyssey for the third time in the same day, and this film totally destroyed 2001 and I consider 2001 one of the best films ever made, but this film made it look like an episode of Family Guy by comparison."
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6641366",
      "warningSpoilers": false,
      "date": "27 February 2021",
      "rate": "7",
      "helpful": "8 out of 10 found this helpful.",
      "title": "princess mononoke",
      "content": "Not the best studio Ghibli films, but it is a wonderful film. I enjoyed watching the film very much, but the duration of the film was a great negative. The film was sometimes very fast in showing some events and very slow in showing other events. This matter made me feel a little bored, the story of the film was talking about the relationship of man to nature This is an excellent thing, especially since the film is directed to children. This was shown to them. It was an excellent choice by the Ghibli studio. I could not love any character in the film despite my understanding of their goals until I could not get attached to them, the drawing of natural scenes in this film was impressive, I enjoyed very much Watching the movie and I recommend watching it"
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw3161014",
      "warningSpoilers": true,
      "date": "12 January 2015",
      "rate": "8",
      "helpful": "5 out of 6 found this helpful.",
      "title": "\"The Forest Spirit gives life and takes life away\".",
      "content": "A difficult story to follow and decidedly scary animation at times makes this more an adult film than one for younger fans. It's not too hard to follow in the early going but when the hero Ashitaki makes his way East to the land of the Forest Spirit he's faced with choices that put him on questionable sides of relationships already formed. While trying to save his own life endangered by a poisonous encounter with the boar demon Nago, his overriding mission is to 'see with eyes unclouded by hate'. For this he must valiantly strive to understand the motivations and prerogatives of those he meets, including monk Jigo, Lady Eboshi of Irontown and the wolf princess San, a human raised by wolves. In turn, each of these individuals comes to understand that good and evil are not mutually exclusive character traits, but exist in all to varying degrees. The way this all plays out can be confusing and is not made easier by the depiction of characters like Moro, the large threatening white wolf who by design one would consider a male, but in actuality is the mother of San. It's an intricately woven tale and loyal fans of anime will find it spellbinding, though I must admit, for myself it took a concerted effort to follow and understand."
    },
    {
      "username": "Ashitaka137",
      "userUrl": "https://www.imdb.com/user/ur96002443",
      "reviewLink": "https://www.imdb.com/review/rw4747682",
      "warningSpoilers": false,
      "date": "27 March 2019",
      "rate": "10",
      "helpful": "10 out of 13 found this helpful.",
      "title": "The greatest movie i will ever see in my lifetime.",
      "content": "I watched this movie for the first time 20 years ago, and i still think its the greatest movie i will ever see in my lifetime."
    },
    {
      "username": "neil-476",
      "userUrl": "https://www.imdb.com/user/ur7813355",
      "reviewLink": "https://www.imdb.com/review/rw2530909",
      "warningSpoilers": true,
      "date": "11 December 2011",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Excellent, but not for everyone",
      "content": "Princess Mononoke, like most of Studio Ghibli's output, has a Japanese sensibility which is quite alien to a western audience which has grown up on Disney and Looney Tunes. The story hardly matters - the striking visuals rule.The story is perfectly fine, though: its vague ecological message survives the other-wordly weirdness of demons, forest gods, and warring factions kept apart by a pair of unlikely peace brokers.But it looks terrific - character design, backgrounds and animation are all first rate. And its weirdness is part of its appeal. There's no guarantee that you will enjoy it but, if you give it a chance, there is a lot to enjoy here."
    },
    {
      "username": "Red-Barracuda",
      "userUrl": "https://www.imdb.com/user/ur1616919",
      "reviewLink": "https://www.imdb.com/review/rw3128094",
      "warningSpoilers": false,
      "date": "21 November 2014",
      "rate": "7",
      "helpful": "3 out of 3 found this helpful.",
      "title": "A beautifully executed film from Studio Ghibli",
      "content": "Animals, their gods and humans clash in this fantasy adventure from famed Japanese animator Hayao Miyazaki. Consequently, nature vs humanity is a strong theme throughout Princess Mononoke, meaning that this is an animated movie with a definite message. Most of the humans, after all, are from a mining village who rape the earth, while the sympathetic people are Ashitaka, a boy who fights to bring peaceful co-existence between the opposing forces and Princess Mononoke who actively sides with the animal world and lives amongst them. It's quite clear, therefore, where the film's sympathies lie, although the ecological message is never delivered in a trite obvious manner and there are many shades of grey throughout.The tone overall is decidedly more mature than most animation and is one of the films from Studio Ghibli that goes for an older adult audience as opposed to the usual family friendly one. It's even quite violent in places, including several decapitations. But irrespective of the darker material it resembles Ghibli anime quite clearly. In any case this renowned animation studio had already released adult fare beforehand, anyone who has seen the harrowing Grave of the Fireflies will understand this. But in terms of visual artistry Princess Mononoke fits right in to the whole Ghibli cannon perfectly. In fact, this one has to be one of their greatest achievements on this front. The forest scenery is stunningly rendered and the invented creatures are consistently interesting. Of note are the wild boars, the night monkeys and the wolf god Moror but most spectacular of all is the deer-like god Shishigami - the colossal nightwalker. This latter being stalks the land in the twilight and generates a strange atmosphere and ambiance all of its own. The scenes towards the end involving it, illustrate the sheer imagination that Ghibli is famed for. The plot-line is not especially great if I am honest but it allows for the film to cover its themes successfully, while integrating them into a wonderfully rendered fantasy world. Like all Ghibli, it benefits considerably too from evolving unashamedly and organically from Japanese culture and mythology; this ensures that from a western perspective, it consistently remains unpredictable and fascinating."
    },
    {
      "username": "aprisoneroftoday",
      "userUrl": "https://www.imdb.com/user/ur14026891",
      "reviewLink": "https://www.imdb.com/review/rw1586291",
      "warningSpoilers": false,
      "date": "29 January 2007",
      "rate": "10",
      "helpful": "85 out of 100 found this helpful.",
      "title": "Yet another 10 for Miyazaki",
      "content": "Im a Big fan of Miyazaki... This movie is Definitely in his top 3... Princess Mononoke's story is very in depth and it grabs your attention. Time after time. You may have to watch it a couple times to catch everything but you will fall in love with the characters and story every time you sit down to watch itAs for the art... Its Visually stunning yet again. Everything is depicted so well in Miyazaki's artwork from the humans to the Forest gods and everything in betweenthis definitely worth watching.And if you like it you should definitely check out some of his others like Castle In The Sky, Howls Moving Castle and Spirited Away"
    }
  ],
  "errorMessage": ""
}