{
  "imDbId": "tt0119698",
  "title": "Princess Mononoke",
  "fullTitle": "Princess Mononoke (1997)",
  "type": "Movie",
  "year": "1997",
  "language": "en",
  "titleInLanguage": "Princess Mononoke",
  "url": "https://en.wikipedia.org/wiki/Princess_Mononoke",
  "plotShort": {
    "plainText": "Princess Mononoke (Japanese: もののけ姫, Hepburn: Mononoke-hime) is a 1997 Japanese animated epic historical fantasy film written and directed by Hayao Miyazaki and animated by Studio Ghibli for Tokuma Shoten, Nippon Television Network and Dentsu. The film stars the voices of Yōji Matsuda, Yuriko Ishida, Yūko Tanaka, Kaoru Kobayashi, Masahiko Nishimura, Tsunehiko Kamijo, Akihiro Miwa, Mitsuko Mori, and Hisaya Morishige.\r\nPrincess Mononoke is set in the late Muromachi period of Japan (approximately 1336 to 1573 AD), but it includes fantasy elements. The story follows a young Emishi prince named Ashitaka, and his involvement in a struggle between the gods (kami) of a forest and the humans who consume its resources. The film deals with themes of Shintoism and environmentalism. The term mononoke (物の怪), or もののけ, is not a name, but a Japanese word for supernatural, shape-shifting beings that possess people and cause suffering, disease, or death.\r\nThe film was released in Japan on July 12, 1997 by Toho, and in the United States on October 29, 1999. This was the first Studio Ghibli film in the United States to be rated PG-13 by the MPA. It was a critical and commercial blockbuster, becoming the highest-grossing film in Japan of 1997, and also held Japan's box office record for domestic films until 2001's Spirited Away, another Miyazaki film. It was dubbed into English with a script by Neil Gaiman and initially distributed in North America by Miramax, where it sold well on DVD and video, despite a poor box office performance. The film greatly increased Ghibli's popularity and influence outside Japan.",
    "html": "<p>Princess Mononoke (Japanese: もののけ姫, Hepburn: Mononoke-hime) is a 1997 Japanese animated epic historical fantasy film written and directed by Hayao Miyazaki and animated by Studio Ghibli for Tokuma Shoten, Nippon Television Network and Dentsu. The film stars the voices of Yōji Matsuda, Yuriko Ishida, Yūko Tanaka, Kaoru Kobayashi, Masahiko Nishimura, Tsunehiko Kamijo, Akihiro Miwa, Mitsuko Mori, and Hisaya Morishige.</p><p>Princess Mononoke is set in the late Muromachi period of Japan (approximately 1336 to 1573 AD), but it includes fantasy elements. The story follows a young Emishi prince named Ashitaka, and his involvement in a struggle between the gods (kami) of a forest and the humans who consume its resources. The film deals with themes of Shintoism and environmentalism. The term mononoke (物の怪), or もののけ, is not a name, but a Japanese word for supernatural, shape-shifting beings that possess people and cause suffering, disease, or death.</p><p>The film was released in Japan on July 12, 1997 by Toho, and in the United States on October 29, 1999. This was the first Studio Ghibli film in the United States to be rated PG-13 by the MPA. It was a critical and commercial blockbuster, becoming the highest-grossing film in Japan of 1997, and also held Japan's box office record for domestic films until 2001's Spirited Away, another Miyazaki film. It was dubbed into English with a script by Neil Gaiman and initially distributed in North America by Miramax, where it sold well on DVD and video, despite a poor box office performance. The film greatly increased Ghibli's popularity and influence outside Japan.</p>"
  },
  "plotFull": {
    "plainText": "Princess Mononoke (Japanese: もののけ姫, Hepburn: Mononoke-hime) is a 1997 Japanese animated epic historical fantasy film written and directed by Hayao Miyazaki and animated by Studio Ghibli for Tokuma Shoten, Nippon Television Network and Dentsu. The film stars the voices of Yōji Matsuda, Yuriko Ishida, Yūko Tanaka, Kaoru Kobayashi, Masahiko Nishimura, Tsunehiko Kamijo, Akihiro Miwa, Mitsuko Mori, and Hisaya Morishige.\r\nPrincess Mononoke is set in the late Muromachi period of Japan (approximately 1336 to 1573 AD), but it includes fantasy elements. The story follows a young Emishi prince named Ashitaka, and his involvement in a struggle between the gods (kami) of a forest and the humans who consume its resources. The film deals with themes of Shintoism and environmentalism. The term mononoke (物の怪), or もののけ, is not a name, but a Japanese word for supernatural, shape-shifting beings that possess people and cause suffering, disease, or death.\r\nThe film was released in Japan on July 12, 1997 by Toho, and in the United States on October 29, 1999. This was the first Studio Ghibli film in the United States to be rated PG-13 by the MPA. It was a critical and commercial blockbuster, becoming the highest-grossing film in Japan of 1997, and also held Japan's box office record for domestic films until 2001's Spirited Away, another Miyazaki film. It was dubbed into English with a script by Neil Gaiman and initially distributed in North America by Miramax, where it sold well on DVD and video, despite a poor box office performance. The film greatly increased Ghibli's popularity and influence outside Japan.\r\nPlot\r\nIn the Muromachi period, in Japan; an Emishi village is attacked by a hideous demon. The last Emishi prince, Ashitaka, kills it before it reaches the village, but it manages to grasp his arm and curse him before its death. The curse grants him superhuman strength, but it also causes him pain and will eventually kill him. The villagers discover that the demon was a boar god (boar kami), corrupted by an iron ball lodged in his body. The village's wise woman tells Ashitaka that he may find a cure in the western lands that the demon came from, and that he cannot return to his homeland.\r\nHeading west, Ashitaka meets Jigo, an opportunistic monk who tells Ashitaka he may find help from the Great Forest Spirit, a deer-like animal god by day and a giant Night Walker by night. Nearby, men on a cliffside herd oxen to their home of Iron Town, led by Lady Eboshi, and repel an attack by a wolf pack led by the wolf goddess Moro, whom Eboshi wounds with a gun shot. Riding one of the wolves is San, a human girl. Down below, Ashitaka encounters San and the wolves, who rebuff his greeting. He then manages to rescue two of the men fallen from the cliff and transports them back through the forest, where he briefly glimpses the Great Forest Spirit.\r\nAshitaka and the survivors arrive at Iron Town, where he is greeted with fascination. Iron Town is a refuge for outcasts and lepers employed to process iron and create firearms, such as hand cannons and matchlock muskets. Ashitaka learns that the town was built by clearcutting forests to mine the iron, leading to conflicts with Asano, a local daimyō, and a giant boar god named Nago. Eboshi admits that she shot Nago, incidentally turning him into the demon that attacked Ashitaka's village. She also reveals that San, dubbed Princess Mononoke, was raised by the wolves and hates humankind.\r\nSan infiltrates Iron Town to kill Eboshi. Ashitaka intervenes and quickly subdues Eboshi and San while they are locked in combat. Amidst the hysteria he is shot by a villager, but the curse gives him strength to carry San out of the village. San awakens and prepares to kill the weakened Ashitaka, but hesitates when he tells her that she is beautiful. She decides to trust him after the Forest Spirit heals his bullet wound that night. The next day, a boar clan led by the blind god Okkoto plans to attack Iron Town to save the forest. Eboshi sets out to kill the Forest Spirit with Jigo; Eboshi intends to give the god's head to the Emperor (who believes it will grant him immortality) in return for protection from Lord Asano, while Jigo desires the large reward being offered.\r\nAshitaka recovers and finds Iron Town besieged by Asano's samurai. The boar clan has been annihilated in battle, and Okkoto is badly wounded. Jigo's men trick Okkoto into leading them to the Forest Spirit. San tries to stop Okkoto but is swept up as his pain corrupts him into a demon. As everyone clashes at the pool of the Forest Spirit, Ashitaka saves San while the Forest Spirit euthanizes Moro and Okkoto. As it begins to transform into the Night Walker Eboshi decapitates it. Jigo steals the head, while the Forest Spirit's body bleeds ooze that spreads over the land and kills anything it touches. The forest and kodama (木霊, tree spirits) begin to die; Moro's head briefly comes alive and bites off Eboshi's right arm, but she survives. Enraged, San attempts to kill Eboshi again, but is stopped by Ashitaka, who consoles her and encourages her not to give up.\r\nAfter Iron Town is evacuated, Ashitaka and San pursue Jigo and retrieve the head, returning it to the Forest Spirit. The Spirit dies but its form washes over the land, healing it and lifting Ashitaka's curse. Ashitaka stays to help rebuild Iron Town, but promises San he will visit her in the forest. Grateful to Ashitaka and San, Eboshi vows to build a better town. The forest begins to regrow as a single kodama emerges from the brush.\r\nCast and characters\r\nYōji Matsuda voices Prince Ashitaka (アシタカ), the last Ainu prince of the Emishi tribe whose traveling companion is Yakul (ヤックル, Yakkuru), a red elk (アカシシ, Akashishi), a fictional species of elk that Miyazaki created for the film. Novelist Ali Shaw has described Yakul as being more similar to a red Lechwe than an elk. Miyazaki called Ashitaka a \"melancholic boy who has a fate\" and stated that Ashitaka's curse \"is similar to the lives of people\". Ashitaka's English voice actor Billy Crudup stated that he liked Ashitaka as \"an unexpected hero. He's not your usual wild, brave guy. He's really just a young, earnest man who's trying to lead a valuable life and protect his village.\"\r\nYuriko Ishida voices San (サン), a young woman who was raised by the wolves and feels hatred for humans, but eventually comes to care for Ashitaka. In the English version, San is voiced by Claire Danes.Ishida also voices Kaya (カヤ), Ashitaka's bride-elect who breaks the rules of the village to gift him her dagger to remember her by. Tara Strong provides her voice in the English version, where she is referred to as his younger sister due to the translation.\r\nIshida also voices Kaya (カヤ), Ashitaka's bride-elect who breaks the rules of the village to gift him her dagger to remember her by. Tara Strong provides her voice in the English version, where she is referred to as his younger sister due to the translation.\r\nYūko Tanaka provides the voice of Lady Eboshi (エボシ御前, Eboshi Gozen), the ruler of Irontown who continually clears the forest. Miyazaki stated that Eboshi was supposed to have a traumatic past, although it is not specifically mentioned in the film. Miyazaki said that Eboshi has a strong and secure personality, evident in the fact that she let Ashitaka move freely through the settlement unescorted, despite his unclear motives. He also said that Eboshi does not acknowledge the Emperor's authority in Irontown, a revolutionary view for the time, and displays an atypical attitude for a woman of that era in that she wouldn't hesitate to sacrifice herself or those around her for her dreams. Miyazaki also said that Eboshi resembles a shirabyōshi. Eboshi's English voice actress Minnie Driver stated that she was interested in \"the challenge of playing woman who supports industry and represents the interests of man, in terms of achievement and greed.\" Driver viewed Eboshi as \"a warrior, an innovator and a protector.\"\r\nKaoru Kobayashi provides the voice of Jiko-bō (ジコ坊, called \"Jigo\" in the English version), a monk and mercenary who befriends Ashitaka on his journey to the west. Miyazaki was unsure whether to make Jiko-bō a government spy, a ninja, a member of a religious group or \"a very good guy.\" He eventually decided to give him elements of all of the above groups. In the English version, Jigo is voiced by Billy Bob Thornton.\r\nMasahiko Nishimura voices Kohroku (甲六, Kōroku), an ox driver; John DeMita voices Kohroku in the English version. Miyazaki wrote Kohroku to be \"an ordinary guy didn't do anything heroic, right to the end\", something he stated was contrary to films he'd made up to that point.\r\nTsunehiko Kamijō provides the voice of Gonza (ゴンザ), Eboshi's short-tempered but loyal bodyguard; he is voiced by John DiMaggio in the English version.\r\nAkihiro Miwa voices Moro (モロの君, Moro no Kimi), a giant wolf god and San's adopted mother; Gillian Anderson provides her voice in the English version.\r\nMitsuko Mori provides the voice of Hii-sama (ヒイ様), the wise woman of Ashitaka's village. In the English version, Hii-sama is voiced by Debi Derryberry.\r\nHisaya Morishige provides the voice of Okkoto-nushi (乙事主, called \"Okkoto\" in the English version), a blind boar god. In the English version, Okkoto is voiced by Keith David, who also voices the narrator in the film's opening sequence.\r\nThe cast also includes:\r\nAkira Nagoya as the cattleman leader (牛飼いの長, Ushikai no Osa);\r\nKimihiro Reizei as a Jibashiri (ジバシリ);\r\nTetsu Watanabe as a mountain wolf (山犬, Yamainu);\r\nMakoto Sato as Nago (ナゴの守, Nago no Mori), a wild boar turned into a demon who curses Ashitaka when he attacks the Emishi village, voiced by John DiMaggio in the English version;\r\nand Sumi Shimamoto as Toki (トキ), Kohroku's wife, a former prostitute, and the leader of Eboshi's women, voiced by Jada Pinkett Smith in the English version.\r\nProduction\r\nIn the late 1970s, Miyazaki drew sketches of a film about a princess living in the woods with a beast. Miyazaki began writing the film's plotline and drew the initial storyboards for the film in August 1994. He had difficulties adapting his early ideas and visualisations, because elements had already been used in My Neighbor Totoro and because of societal changes since the creation of the original sketches and image boards. This writer's block prompted him to accept a request for the creation of the On Your Mark promotional music video for the Chage and Aska song of the same title. According to Toshio Suzuki, the diversion allowed Miyazaki to return for a fresh start on the creation of Princess Mononoke. In April 1995, supervising animator Masashi Ando devised the character designs from Miyazaki's storyboard. In May 1995, Miyazaki drew the initial storyboards. That same month, Miyazaki and Ando went to the ancient forests of Yakushima, of Kyushu, an inspiration for the landscape of Nausicaä of the Valley of the Wind, and the mountains of Shirakami-Sanchi in northern Honshu for location scouting along with a group of art directors, background artists and digital animators for three days. Animation production commenced in July 1995. Miyazaki personally oversaw each of the 144,000 cels in the film, and is estimated to have retouched parts of 80,000 of them. The final storyboards of the film's ending were finished only months before the Japanese premiere date.\r\nInspired by John Ford, an Irish-American director best known for his Westerns, Miyazaki created Irontown as a \"tight-knit frontier town\" and populated it with \"characters from outcast groups and oppressed minorities who rarely, if ever, appear in Japanese films.\" He made the characters \"yearning, ambitious and tough.\" Miyazaki did not want to create an accurate history of Medieval Japan, and wanted to \"portray the very beginnings of the seemingly insoluble conflict between the natural world and modern industrial civilization.\" The landscapes appearing in the film were inspired by Yakushima. Despite being set during the Muromachi period, the actual time period of Princess Mononoke depicts a \"symbolic neverwhen clash of three proto-Japanese races (the Jomon, Yamato and Emishi).\"\r\nPrincess Mononoke was produced with an estimated budget of ¥2.35 billion (approximately US$23.5 million). It was mostly hand-drawn, but incorporates some use of computer animation in approximately ten percent of the film. The computer animated parts are designed to blend in and support the traditional cel animation, and are mainly used in images consisting of a mixture of computer generated graphics and traditional drawing. A further 10 minutes uses inked-and-painted, a technique used in all subsequent Studio Ghibli films. Most of the film is colored with traditional paint, based on the color schemes designed by Miyazaki and Michiyo Yasuda. However, producers agreed on the installation of computers to successfully complete the film prior to the Japanese premiere date. Telecom Animation Film Company and Oh! Production helped animate the film. Toei Animation and DR Movie helped with the painting process.\r\nTwo titles were originally considered for the film. One, ultimately chosen, has been translated into English as Princess Mononoke. The other title can be translated into English as The Legend of Ashitaka (アシタカ𦻙記, Ashitaka Sekki), and it contains an uncommon kanji 𦻙 that represents \"a legend passed down from ear to ear without being recorded in official history\", according to Miyazaki. In a Tokyo Broadcasting System program, televised on November 26, 2013, Toshio Suzuki mentioned that Miyazaki had preferred The Legend of Ashitaka as the title while Suzuki himself favoured Princess Mononoke, though the former title was eventually reused for the first song on the soundtrack. The English dub contains minor additional voice overs to explain nuances of Japanese culture to western audiences.\r\nThemes\r\nEnvironment\r\nA central theme of Princess Mononoke is the environment. The film centers on the adventure of Ashitaka as he journeys to the west to undo a fatal curse inflicted upon him by Nago, a boar turned into a demon by Eboshi. Michelle J. Smith and Elizabeth Parsons said that the film \"makes heroes of outsiders in all identity politics categories and blurs the stereotypes that usually define such characters\". In the case of the deer god's destruction of the forest and Tataraba, Smith and Parsons said that the \"supernatural forces of destruction are unleashed by humans greedily consuming natural resources\". They also characterized Eboshi as a businesswoman who has a desire to make money at the expense of the forest, and also cite Eboshi's intention to destroy the forest to mine the mountain \"embodies environmentalist evil\". Deirdre M. Pike writes that Princess Mononoke is simultaneously part of nature and part of the problem. Mononoke represents the connection between the environment and humans, but also demonstrates that there is an imbalance in power between the two.\r\nSexuality and disability\r\nTwo other themes found in the plot of Princess Mononoke are sexuality and disability. Speaking at the International Symposium on Leprosy / Hansen's Disease History in Tokyo, Miyazaki explained that he was inspired to portray people living with leprosy, \"said to be an incurable disease caused by bad karma\", after visiting the Tama Zenshoen Sanatorium near his home in Tokyo. Lady Eboshi is driven by her compassion for the disabled, and believes that blood from the Great Forest Spirit could allow her to \"cure poor lepers\". Michelle Jarman, Assistant Professor of Disability Studies at the University of Wyoming, and Eunjung Kim, Assistant Professor of Gender and Women's Studies at the University of Wisconsin–Madison, said the disabled and gendered sexual bodies were partially used as a transition from the feudal era to a hegemony that \"embraces modern social systems, such as industrialization, gendered division of labor, institutionalization of people with diseases, and militarization of men and women.\" They likened Lady Eboshi to a monarch. Kim and Jarman suggested that Eboshi's disregard of ancient laws and curses towards sex workers and lepers was enlightenment reasoning and her exploitation of disabled people furthered her modernist viewpoints. Kim and Jarman conclude that Lady Eboshi's supposed benevolence in incorporating lepers and sex workers into her society leverages the social stigma attached to marginalized groups, pointing out that the hierarchical structures within Irontown still support the stigmatization of lepers and sex workers.\r\nDevelopment versus preservation\r\nAn additional theme is the morally ambiguous conflict between humankind's growth and development and Nature's need for preservation. According to the Chicago Sun-Times's Roger Ebert, \"It is not a simplistic tale of good and evil, but the story of how humans, forest animals and nature gods all fight for their share of the new emerging order.\" Billy Crudup, who provided the English voice for Ashitaka, said \"The movie was such an entirely different experience; it had a whole new sensibility I had never seen in animation. It also had something profound to say: that there has to be a give and take between man and nature. One of the things that really impressed me is that Miyazaki shows life in all its multi-faceted complexity, without the traditional perfect heroes and wicked villains. Even Lady Eboshi, who Ashitaka respects, is not so much evil as short-sighted.\" Minnie Driver, the English voice actress for Lady Eboshi, commented similarly: \"It's one of the most remarkable things about the film: Miyazaki gives a complete argument for both sides of the battle between technological achievement and our spiritual roots in the forest. He shows that good and evil, violence and peace exist in us all. It's all about how you harmonize it all.\" Anime historian Susan Napier said there is no clear good vs. evil conflict in Princess Mononoke, unlike other films popular with children. Based on the multiple points of view the film adopts, San and Lady Eboshi can simultaneously be viewed as heroic or villainous. San defends the forest and viewers empathize with her. But she also attacks innocent people, complicating how we evaluate her. Opposed to San, Eboshi tries to destroy the forest and could be considered a villain. But everything she does is out of a desire to protect her village and see it prosper. San and Lady Eboshi survive until film's end, defying the usual convention of good triumphing over evil with the antagonist defeated. Napier concluded that the resolution of the conflict is left ambiguous, implying that Lady Eboshi and San will be able to come to some sort of compromise. The ambiguity suggests that there are no true villains or heroes.\r\nNature vs Culture\r\nIn many stories and myths, we are often presented with a situation in which nature (what is not made by humans) is contrasted with culture (anything that is made by us). Myth often presents us with a need to balance the two: too much nature and we have barbarism & no civilization; too much civilization and we have a dehumanized, mechanized bureaucracy. Princess Mononoke is a captivating, animated film by Hayao Miyazaki that vividly explores and represents the conflict between nature and culture. The film depicts a clash between human civilization and the natural world, where humans exploit resources and destroy the environment to build their cities and wage wars. The movie also highlights the consequences of this behavior, as the spirits of the forest fight back, resulting in a battle for the survival of both sides. As the colonizers destroy the spirit of the forest, they must come to accept the consequences as it destroys the world and landscape around them. In a specific scene during the film, the tribe of boars are led by their leader Queen Okkoto and Nago who attack Irontown because they feel that the humans have taken over their natural habitat. (Miyazaki, 1997) This attack represents the wild environment of the natural world and its fierce resistance to human interference, while humans represent the force of industrialization and civilization, which seeks to conquer and dominate the natural world. Suggesting to the viewer that the preservation of nature is necessary to maintain a peaceful functioning society, and if one abuses the other, destruction will ensue. Princess Mononoke portrays a thought-provoking and visually stunning narrative on the importance of preserving nature and coexisting with the world around us. Overall, the film does not give a simple answer or resolution to this conflict. Rather, it highlights the importance of balance, cooperation, and respect between humans and the natural world.\r\nLoss of innocence\r\nDan Jolin of Empire said that a potential theme could be that of lost innocence. Miyazaki attributes this to his experience of making his previous film, Porco Rosso, and the wars in the former Yugoslavia, which he cites as an example of mankind never learning, making it difficult for him to go back to making a film such as Kiki's Delivery Service, where he has been quoted as saying \"It felt like children were being born to this world without being blessed. How could we pretend to them that we're happy?\"\r\nDuality\r\nDuality is central to Eboshi's characterization. Benjamin Thevenin, Assistant Professor of Theater and Media Arts at Brigham Young University, said Eboshi does not fully understand the harm she does to the spirits. Her focus is on creating a safe home for her people. She holds no malicious intent toward nature and its spirits until they begin attacking her people. Once nature attacks, she gathers her soldiers to protect the inhabitants of her town, a place where all are welcome. Irontown is a haven for former sex workers and lepers. She brings them to Irontown and gives them jobs, hospitality, and a kindness that they have never experienced before. The same treatment goes for all Irontown's inhabitants, not just the sickly and the scorned. Lady Eboshi treats everyone equally, no matter the race, sex, or history of the individual, creating a caring community. While Eboshi hates San and the forest spirits, she keeps a garden in her town. Her care for the garden implies that her intention is not to ravage nature to no end, but rather to help her own people. Thevenin concluded that although Eboshi can be seen as the film's villain, she is also a hero to the citizens of Irontown and to humankind in general.\r\nNon-duality\r\nAt first glance Lady Eboshi and Princess Mononoke suggest a very dualistic and dichotomous view of life. Lady Eboshi works for the survival of humankind and San for the survival of nature. But Miyazaki, through the character of Ashitaka, argues that we should accept a non-dualistic view of living, accepting that nature and humans coexist. Ashitaka acts as a healer, mediating between humanity and nature. Ashitaka's curse, obtained while defending his people from a demonized boar god, ultimately symbolizes the destructive force of life, forcing him to recognize the commonalities present in the conflict between industrialized society and nature. Ashitaka’s quest for a cure by the Great Forest Spirit symbolizes humanity’s quest to find a way to live on earth that accepts the interbeing of all of earth's creatures. Ashitaka takes responsibility for the preservation and restoration of nature when he returns the Great Forest Spirit’s head, transferring the guardianship of nature from the now dead Great Forest Spirit to humanity. With guardianship of nature delegated to humanity, the dichotomy between humanity and nature is dismantled and the two forces are tasked with recognizing their coexistence.\r\nIndividualism and conformity\r\nAnother theme in this film is between individualism and societal conformity. According to University of Bristol professors Christos Ellinas, Neil Allan and Anders Johansson, this struggle can be seen between San, a strong individualistic force, and Eboshi, the leader of a great society. San has fully committed to living with the wolves in the forest and to renouncing her association with the human race. Eboshi has vowed to sustain her society of Irontown by any means including destroying the environment. The people of Irontown have a cohesive ideology and agree with Eboshi to protect Irontown at the cost of the environment's destruction. This conformity can be found within their society, because “even though there is an envisioned culture at which an organization abides to, achieving coherence at lower aggregation levels (e.g. individuals) is increasingly challenging due to its emergent nature”.\r\nKarma\r\nThe Buddhist principle of karma is at work in the characters of Lady Eboshi and Ashitaka with different results for each. Lady Eboshi destroys the forest to ensure the livelihood of her people and also for her own personal gain. This selfish personal quest ends up having ramifications that reveal themselves at the film's end. Lady Eboshi, taken from the earth with no regard for the damage she inflicts, turns against her when she ends up losing one of her arms. Lady Eboshi seems to learn from this, becoming more in tune with nature and using that karmic lesson to better herself and Iron Town. Ashitaka works in an opposite way to Eboshi. Ashitaka does not go out of his way to damage nature though at the start of the film he does kill the demon boar in order to save his village. When as a result Ashitaka is cursed, he does not take his anger out on nature and still treats all living things with respect. He also protects life in general, doing the right thing for all whom he meets and mediating between others in order to prevent further violence. Having this mindset despite the affliction he is suffering from and being able to overcome his curse shows that he is a pure soul who will be rewarded for his actions. Smith, Michelle, 2012, Animating child activism: Environmentalism and class politics in Ghibli's Princess Mononoke (1997) and Fox's FernGully (1992), Taylor & Francis Online. Animating child activism: Environmentalism and class politics in Ghibli's Princess Mononoke (1997) and Fox's FernGully (1992): Continuum: Vol 26, No 1 (tandfonline.com)\r\nHope\r\nIn Greek literature elpis (ἐλπίς) has a parallel with the Buddhist concept of non-duality--hope is a positive because it enables mortals to survive the calamaties that life presents them with. Hope also has a negative aspect, keeping mortals from acting in their own best interest because they have blind faith that their lives will improve without any effort on their part. Professor Jack Kwong at Appalachian State University believes that to have genuine hope you must be able to conceive, however tentatively, the intermediate steps that bridge the gap between us and the outcome and allow us to move forward to the outcome. Likewise in Princess Mononoke hope plays a central role. For instance, San is someone who has hope that her family in the forest can beat the humans, even though that’s impossible with the development of guns. That doesn't deter her from her hope and determination to win. San also exhibits this when Okkoto starts to turn. San continues to try and save Okkoto even though he’s already started the process of turning into a demon and can't be saved. Eboshi also exhibits this through her desire to protect her people from Lord Asano's samurai. Eboshi doesn't fully trust Jigo in their deal that the emperor will help protect Iron Town from Asano, but she still goes along with his plan to take the forest guardian spirit head in hope that he’s telling the truth. Ashitaka, the mediator between these two opposed sides, exhibits the theme of hope the most. Faced with extreme difficulties, Ashitaka maintains hope that both humans and the inhabitants of the forest will find a way to walk down a path of peace. Even though the two sides are constantly battling against each other, Ashitaka still strives to bring an end to their conflict. This is best seen when Jigo and Eboshi decapitate the forest spirit. Ashitaka works with hope toward a future that recognizes the interbeing of all.\r\nRelease\r\nPrincess Mononoke was released theatrically in Japan on July 12, 1997. The film was extremely successful in Japan and with both anime fans and arthouse moviegoers in English-speaking countries. Since Walt Disney Studios had made a distribution deal with Tokuma Shoten for Studio Ghibli's films in 1996, it was the first film from Studio Ghibli along with Kiki's Delivery Service and Castle in the Sky to have been dubbed into English by Disney; in this case, subsidiary Miramax Films was assigned to release the movie in the US on October 29, 1999. In response to demands from Miramax chairman Harvey Weinstein to edit the film, one of Miyazaki's producers sent Weinstein a samurai sword with the message: \"No cuts.\" Promotion manager, Steve Alpert, revealed that Weinstein had wanted to trim the film down from 135 minutes to 90 minutes \"despite having promised not to do so.\" When Alpert informed him that Miyazaki would not agree to these demands, Weinstein flew into one of his infamous rages and threatened Alpert that he would \"never work in this...industry again\". Weinstein hired Neil Gaiman to write the English script, and he chose to simplify some of the Japanese terminology for this dub, with words like Jibarashi becoming \"Mercenary\" and Shishigami becoming \"Forest Spirit\". According to him at one of the American screenings of the dub, the release was somewhat delayed because the original recordings deviated from the English script as written. Despite Gaiman's independent fame as an author, his role as scriptwriter for the dub was not heavily promoted: Studio Ghibli requested that Miramax remove some executives' names from the poster for the film, but the executives (Harvey Weinstein, Bob Weinstein, and Scott Martin) decided that Gaiman's name was contractually expendable.\r\nOn April 29, 2000, the English-dub version of Princess Mononoke was released theatrically in Japan along with the documentary Mononoke hime in U.S.A. The documentary was directed by Toshikazu Sato and featured Miyazaki visiting the Walt Disney Studios and various film festivals. The film had a limited theatrical re-release in the United States during July 2018, and again during April 2022 for the 25th anniversary of its original Japanese release.\r\nBox office\r\nPrincess Mononoke was the highest-grossing Japanese film of 1997, earning ¥11.3 billion in distribution rental earnings. It became the highest-grossing film in Japan, beating the record set by E.T. in 1982, but was surpassed several months later by Titanic. The film earned total domestic gross receipts of ¥20.18 billion.\r\nIt was the top-grossing anime film in the United States in January 2001, but the film did not fare as well financially in the country when released in October 1999. It grossed $2,298,191 for the first eight weeks. It showed more strength internationally, where it earned a total of $11 million outside Japan, bringing its worldwide total to $159,375,308 at the time. On December 6, 2016, GKIDS announced that it would screen the film in US cinemas on January 5 and January 9, 2017, to celebrate its 20th anniversary, bundled with the On Your Mark short. The film's limited US re-release in 2018 grossed $1,423,877 over five days, bringing its US total to $3,799,185 and worldwide total to $160,799,185. As of 2020, the film has grossed $194.3 million.\r\nFor its 25th anniversary, Princess Mononoke was screened in 35mm at New York City's Japan Society on July 22, 2022.\r\nHome media\r\nIn Japan, the film was released on VHS by Buena Vista Home Entertainment on June 26, 1998. A LaserDisc edition was also released by Tokuma Japan Communications on the same day. The film was released on DVD by Buena Vista Home Entertainment on November 21, 2001, with bonus extras added, including the international versions of the film as well as the storyboards. By 2007, Princess Mononoke sold 4.4 million DVD units in Japan. At an average retail price of ¥4,700, this is equivalent to approximately ¥20,680 million ($259.18 million) in Japanese sales revenue as of 2007.\r\nIn July 2000, Buena Vista Home Entertainment via Miramax Home Entertainment announced plans to release the film on VHS and DVD in North America on August 29. Initially, the DVD version of Princess Mononoke wasn't going to include the Japanese-language track at the request of Buena Vista's Japan division. Because the film hadn't been released on DVD in Japan yet, there were concerns that \"a foreign-released DVD containing the Japanese language track will allow for the importation of such a DVD to Japan, which could seriously hurt the local sales of a future release of the\". The fansite Nausicaa.net organized an email campaign for fans to include the Japanese language track, while DVD Talk began an online petition to retain the Japanese language track. The DVD release of Princess Mononoke was delayed as a result. Miramax Home Entertainment released the DVD on December 19, 2000 with the original Japanese audio, the English dubbed audio and extras including a trailer and a documentary with interviews from the English dub voice actors. The film was released on Blu-ray disc in Japan on December 4, 2013.\r\nWalt Disney Studios Home Entertainment released Princess Mononoke on Blu-ray Disc on November 18, 2014. In its first week, it sold 21,860 units; by November 23, 2014, it had grossed $502,332. It was later included in Disney's \"The Collected Works of Hayao Miyazaki\" Blu-ray set, released on November 17, 2015. GKIDS re-issued the film on Blu-ray and DVD on October 17, 2017. As of October 2020, the film has grossed $9,232,906 from Blu-ray sales in the United States. In total, Mononoke's video releases in Japan and the United States grossed an estimated $268 million in physical sales.\r\nIn the United Kingdom, the film's Studio Ghibli anniversary release appeared several times on the annual lists of best-selling foreign language film on home video, ranking number six in 2015 (below five other Studio Ghibli anime films), number ten in 2016, number five in 2018 (below four other Japanese films), and number three in 2019 (below Spirited Away and My Neighbor Totoro).\r\nTelevision\r\nThe film was aired on Nippon TV (NTV) in Japan, on 22 January 1999. It became NTV's most-watched film up until then with a 35.1% audience rating, surpassing the 28.4% record previously set by Tsuribaka Nisshi 4 in 1994. In turn, Princess Mononoke was later surpassed by Spirited Away, when it aired in 2003.\r\nReception\r\nCritical response\r\nAs of August 2022, on the review aggregator website Rotten Tomatoes, 93% of 114 critic reviews are positive for Princess Mononoke, with an average rating of 8/10. The website's consensus reads, \"With its epic story and breathtaking visuals, Princess Mononoke is a landmark in the world of animation.\" According to Metacritic, which assigned an average score of 76 out of 100 based on 29 reviews, the film received \"generally favorable reviews\".\r\nThe Daily Yomiuri's Aaron Gerow called the film a \"powerful compilation of Miyazaki's world, a cumulative statement of his moral and filmic concerns.\" Leonard Klady of Variety said that Princess Mononoke \"is not only more sharply drawn, it has an extremely complex and adult script\" and the film \"has the soul of a romantic epic, and its lush tones, elegant score by Joe Hisaishi and full-blooded characterizations give it the sweep of cinema's most grand canvases\". Roger Ebert of the Chicago Sun-Times called Princess Mononoke \"a great achievement and a wonderful experience, and one of the best films of the year. You won't find many Hollywood love stories (animated or otherwise) so philosophical.\" Ty Burr of Entertainment Weekly called the film \"a windswept pinnacle of its art\" and that it \"has the effect of making the average Disney film look like just another toy story\". Kenneth Turan of the Los Angeles Times said that the film \"brings a very different sensibility to animation, a medium views as completely suitable for straight dramatic narrative and serious themes.\" In his review, Dave Smith from Gamers' Republic called it \"one of the greatest animated films ever created, and easily one of the best films of 1999.\"\r\nRoger Ebert placed Princess Mononoke sixth on his top ten movies of 1999. In 2001, the Japanese magazine Animage ranked Princess Mononoke 47th in their list of 100 Best Anime Productions of All Time. It ranked 488th on Empire's list of the 500 greatest films. Time Out ranked the film 26th on 50 greatest animated films. It also ranked 26 on Total Film's list of 50 greatest animated films.\r\nJames Cameron cited Princess Mononoke as an influence on his 2009 film Avatar. He acknowledged that it shares themes with Princess Mononoke, including its clash between cultures and civilizations, and cited Princess Mononoke as an influence on the ecosystem of Pandora.\r\nAccolades\r\nPrincess Mononoke is the first animated feature film to win the Japan Academy Prize for Best Picture. For the 70th Academy Awards ceremony, Princess Mononoke was the Japanese submission to be nominated for the Academy Award for Best Foreign Language Film, but was not successfully nominated. Hayao Miyazaki was also nominated for an Annie Award for his work on the film.\r\nSoundtrack\r\nThe film score of Princess Mononoke was composed and performed by Joe Hisaishi, the soundtrack composer for nearly all of Miyazaki's productions, and Miyazaki wrote the lyrics of the two vocal tracks, \"The Tatara Women Work Song\" and its title song. The music was performed by Tokyo City Philharmonic Orchestra and conducted by Hiroshi Kumagai. The soundtrack was released in Japan by Tokuma Japan Communications on July 2, 1997, and the North American version was released by Milan Records on October 12, 1999.\r\nThe titular theme song was performed by counter-tenor Yoshikazu Mera. For the English adaptation, Sasha Lazard sang the song. During the movie Hisaishi makes use of a few known classical pieces and quotes them, such as Dmitri Shostakovich's 5th symphony. As with other Studio Ghibli films, additional albums featuring soundtrack themes in alternative versions have been released. The image album features early versions of the themes, recorded at the beginning of the film production process, and used as source of inspiration for the various artists involved. The symphonic suite features longer compositions, each encompassing several of the movie themes, performed by the Czech Philharmonic Orchestra conducted by Mario Klemens.\r\nStage adaptation\r\nIn 2012, it was announced that Studio Ghibli and British theatre company Whole Hog Theatre would be bringing Princess Mononoke to the stage. It is the first stage adaptation of a Studio Ghibli work. The contact between Whole Hog Theatre and Studio Ghibli was facilitated by Nick Park of Aardman Animations after he sent footage of Whole Hog performances to Studio Ghibli's Toshio Suzuki. The play features large puppets made out of recycled and reclaimed materials.\r\nThe first performances were scheduled for London's New Diorama Theatre and sold out in 72 hours, a year in advance. In March 2013, it was announced that the show would transfer to Japan after its first run of shows in London. A second series of performances followed in London after the return from Tokyo. The second run of London performances sold out in four and half hours. The play received positive reviews and was one of Lyn Gardner's theatre picks in The Guardian. On April 27, 2013, the play was presented at Nico Nico Douga's Cho Party and was streamed online in Japan.",
    "html": "<p>Princess Mononoke (Japanese: もののけ姫, Hepburn: Mononoke-hime) is a 1997 Japanese animated epic historical fantasy film written and directed by Hayao Miyazaki and animated by Studio Ghibli for Tokuma Shoten, Nippon Television Network and Dentsu. The film stars the voices of Yōji Matsuda, Yuriko Ishida, Yūko Tanaka, Kaoru Kobayashi, Masahiko Nishimura, Tsunehiko Kamijo, Akihiro Miwa, Mitsuko Mori, and Hisaya Morishige.</p><p>Princess Mononoke is set in the late Muromachi period of Japan (approximately 1336 to 1573 AD), but it includes fantasy elements. The story follows a young Emishi prince named Ashitaka, and his involvement in a struggle between the gods (kami) of a forest and the humans who consume its resources. The film deals with themes of Shintoism and environmentalism. The term mononoke (物の怪), or もののけ, is not a name, but a Japanese word for supernatural, shape-shifting beings that possess people and cause suffering, disease, or death.</p><p>The film was released in Japan on July 12, 1997 by Toho, and in the United States on October 29, 1999. This was the first Studio Ghibli film in the United States to be rated PG-13 by the MPA. It was a critical and commercial blockbuster, becoming the highest-grossing film in Japan of 1997, and also held Japan's box office record for domestic films until 2001's Spirited Away, another Miyazaki film. It was dubbed into English with a script by Neil Gaiman and initially distributed in North America by Miramax, where it sold well on DVD and video, despite a poor box office performance. The film greatly increased Ghibli's popularity and influence outside Japan.</p><br/><h3>Plot</h3><p>In the Muromachi period, in Japan; an Emishi village is attacked by a hideous demon. The last Emishi prince, Ashitaka, kills it before it reaches the village, but it manages to grasp his arm and curse him before its death. The curse grants him superhuman strength, but it also causes him pain and will eventually kill him. The villagers discover that the demon was a boar god (boar kami), corrupted by an iron ball lodged in his body. The village's wise woman tells Ashitaka that he may find a cure in the western lands that the demon came from, and that he cannot return to his homeland.</p><p>Heading west, Ashitaka meets Jigo, an opportunistic monk who tells Ashitaka he may find help from the Great Forest Spirit, a deer-like animal god by day and a giant Night Walker by night. Nearby, men on a cliffside herd oxen to their home of Iron Town, led by Lady Eboshi, and repel an attack by a wolf pack led by the wolf goddess Moro, whom Eboshi wounds with a gun shot. Riding one of the wolves is San, a human girl. Down below, Ashitaka encounters San and the wolves, who rebuff his greeting. He then manages to rescue two of the men fallen from the cliff and transports them back through the forest, where he briefly glimpses the Great Forest Spirit.</p><p>Ashitaka and the survivors arrive at Iron Town, where he is greeted with fascination. Iron Town is a refuge for outcasts and lepers employed to process iron and create firearms, such as hand cannons and matchlock muskets. Ashitaka learns that the town was built by clearcutting forests to mine the iron, leading to conflicts with Asano, a local daimyō, and a giant boar god named Nago. Eboshi admits that she shot Nago, incidentally turning him into the demon that attacked Ashitaka's village. She also reveals that San, dubbed Princess Mononoke, was raised by the wolves and hates humankind.</p><p>San infiltrates Iron Town to kill Eboshi. Ashitaka intervenes and quickly subdues Eboshi and San while they are locked in combat. Amidst the hysteria he is shot by a villager, but the curse gives him strength to carry San out of the village. San awakens and prepares to kill the weakened Ashitaka, but hesitates when he tells her that she is beautiful. She decides to trust him after the Forest Spirit heals his bullet wound that night. The next day, a boar clan led by the blind god Okkoto plans to attack Iron Town to save the forest. Eboshi sets out to kill the Forest Spirit with Jigo; Eboshi intends to give the god's head to the Emperor (who believes it will grant him immortality) in return for protection from Lord Asano, while Jigo desires the large reward being offered.</p><p>Ashitaka recovers and finds Iron Town besieged by Asano's samurai. The boar clan has been annihilated in battle, and Okkoto is badly wounded. Jigo's men trick Okkoto into leading them to the Forest Spirit. San tries to stop Okkoto but is swept up as his pain corrupts him into a demon. As everyone clashes at the pool of the Forest Spirit, Ashitaka saves San while the Forest Spirit euthanizes Moro and Okkoto. As it begins to transform into the Night Walker Eboshi decapitates it. Jigo steals the head, while the Forest Spirit's body bleeds ooze that spreads over the land and kills anything it touches. The forest and kodama (木霊, tree spirits) begin to die; Moro's head briefly comes alive and bites off Eboshi's right arm, but she survives. Enraged, San attempts to kill Eboshi again, but is stopped by Ashitaka, who consoles her and encourages her not to give up.</p><p>After Iron Town is evacuated, Ashitaka and San pursue Jigo and retrieve the head, returning it to the Forest Spirit. The Spirit dies but its form washes over the land, healing it and lifting Ashitaka's curse. Ashitaka stays to help rebuild Iron Town, but promises San he will visit her in the forest. Grateful to Ashitaka and San, Eboshi vows to build a better town. The forest begins to regrow as a single kodama emerges from the brush.</p><br/><h3>Cast and characters</h3><ul><li>Yōji Matsuda voices Prince Ashitaka (アシタカ), the last Ainu prince of the Emishi tribe whose traveling companion is Yakul (ヤックル, Yakkuru), a red elk (アカシシ, Akashishi), a fictional species of elk that Miyazaki created for the film. Novelist Ali Shaw has described Yakul as being more similar to a red Lechwe than an elk. Miyazaki called Ashitaka a \"melancholic boy who has a fate\" and stated that Ashitaka's curse \"is similar to the lives of people\". Ashitaka's English voice actor Billy Crudup stated that he liked Ashitaka as \"an unexpected hero. He's not your usual wild, brave guy. He's really just a young, earnest man who's trying to lead a valuable life and protect his village.\"</li><li>Yuriko Ishida voices San (サン), a young woman who was raised by the wolves and feels hatred for humans, but eventually comes to care for Ashitaka. In the English version, San is voiced by Claire Danes.Ishida also voices Kaya (カヤ), Ashitaka's bride-elect who breaks the rules of the village to gift him her dagger to remember her by. Tara Strong provides her voice in the English version, where she is referred to as his younger sister due to the translation.</li><li>Ishida also voices Kaya (カヤ), Ashitaka's bride-elect who breaks the rules of the village to gift him her dagger to remember her by. Tara Strong provides her voice in the English version, where she is referred to as his younger sister due to the translation.</li><li>Yūko Tanaka provides the voice of Lady Eboshi (エボシ御前, Eboshi Gozen), the ruler of Irontown who continually clears the forest. Miyazaki stated that Eboshi was supposed to have a traumatic past, although it is not specifically mentioned in the film. Miyazaki said that Eboshi has a strong and secure personality, evident in the fact that she let Ashitaka move freely through the settlement unescorted, despite his unclear motives. He also said that Eboshi does not acknowledge the Emperor's authority in Irontown, a revolutionary view for the time, and displays an atypical attitude for a woman of that era in that she wouldn't hesitate to sacrifice herself or those around her for her dreams. Miyazaki also said that Eboshi resembles a shirabyōshi. Eboshi's English voice actress Minnie Driver stated that she was interested in \"the challenge of playing woman who supports industry and represents the interests of man, in terms of achievement and greed.\" Driver viewed Eboshi as \"a warrior, an innovator and a protector.\"</li><li>Kaoru Kobayashi provides the voice of Jiko-bō (ジコ坊, called \"Jigo\" in the English version), a monk and mercenary who befriends Ashitaka on his journey to the west. Miyazaki was unsure whether to make Jiko-bō a government spy, a ninja, a member of a religious group or \"a very good guy.\" He eventually decided to give him elements of all of the above groups. In the English version, Jigo is voiced by Billy Bob Thornton.</li><li>Masahiko Nishimura voices Kohroku (甲六, Kōroku), an ox driver; John DeMita voices Kohroku in the English version. Miyazaki wrote Kohroku to be \"an ordinary guy didn't do anything heroic, right to the end\", something he stated was contrary to films he'd made up to that point.</li><li>Tsunehiko Kamijō provides the voice of Gonza (ゴンザ), Eboshi's short-tempered but loyal bodyguard; he is voiced by John DiMaggio in the English version.</li><li>Akihiro Miwa voices Moro (モロの君, Moro no Kimi), a giant wolf god and San's adopted mother; Gillian Anderson provides her voice in the English version.</li><li>Mitsuko Mori provides the voice of Hii-sama (ヒイ様), the wise woman of Ashitaka's village. In the English version, Hii-sama is voiced by Debi Derryberry.</li><li>Hisaya Morishige provides the voice of Okkoto-nushi (乙事主, called \"Okkoto\" in the English version), a blind boar god. In the English version, Okkoto is voiced by Keith David, who also voices the narrator in the film's opening sequence.</li></ul><p>The cast also includes:</p><ul><li>Akira Nagoya as the cattleman leader (牛飼いの長, Ushikai no Osa);</li><li>Kimihiro Reizei as a Jibashiri (ジバシリ);</li><li>Tetsu Watanabe as a mountain wolf (山犬, Yamainu);</li><li>Makoto Sato as Nago (ナゴの守, Nago no Mori), a wild boar turned into a demon who curses Ashitaka when he attacks the Emishi village, voiced by John DiMaggio in the English version;</li><li>and Sumi Shimamoto as Toki (トキ), Kohroku's wife, a former prostitute, and the leader of Eboshi's women, voiced by Jada Pinkett Smith in the English version.</li></ul><br/><h3>Production</h3><p>In the late 1970s, Miyazaki drew sketches of a film about a princess living in the woods with a beast. Miyazaki began writing the film's plotline and drew the initial storyboards for the film in August 1994. He had difficulties adapting his early ideas and visualisations, because elements had already been used in My Neighbor Totoro and because of societal changes since the creation of the original sketches and image boards. This writer's block prompted him to accept a request for the creation of the On Your Mark promotional music video for the Chage and Aska song of the same title. According to Toshio Suzuki, the diversion allowed Miyazaki to return for a fresh start on the creation of Princess Mononoke. In April 1995, supervising animator Masashi Ando devised the character designs from Miyazaki's storyboard. In May 1995, Miyazaki drew the initial storyboards. That same month, Miyazaki and Ando went to the ancient forests of Yakushima, of Kyushu, an inspiration for the landscape of Nausicaä of the Valley of the Wind, and the mountains of Shirakami-Sanchi in northern Honshu for location scouting along with a group of art directors, background artists and digital animators for three days. Animation production commenced in July 1995. Miyazaki personally oversaw each of the 144,000 cels in the film, and is estimated to have retouched parts of 80,000 of them. The final storyboards of the film's ending were finished only months before the Japanese premiere date.</p><p>Inspired by John Ford, an Irish-American director best known for his Westerns, Miyazaki created Irontown as a \"tight-knit frontier town\" and populated it with \"characters from outcast groups and oppressed minorities who rarely, if ever, appear in Japanese films.\" He made the characters \"yearning, ambitious and tough.\" Miyazaki did not want to create an accurate history of Medieval Japan, and wanted to \"portray the very beginnings of the seemingly insoluble conflict between the natural world and modern industrial civilization.\" The landscapes appearing in the film were inspired by Yakushima. Despite being set during the Muromachi period, the actual time period of Princess Mononoke depicts a \"symbolic neverwhen clash of three proto-Japanese races (the Jomon, Yamato and Emishi).\"</p><p>Princess Mononoke was produced with an estimated budget of ¥2.35 billion (approximately US$23.5 million). It was mostly hand-drawn, but incorporates some use of computer animation in approximately ten percent of the film. The computer animated parts are designed to blend in and support the traditional cel animation, and are mainly used in images consisting of a mixture of computer generated graphics and traditional drawing. A further 10 minutes uses inked-and-painted, a technique used in all subsequent Studio Ghibli films. Most of the film is colored with traditional paint, based on the color schemes designed by Miyazaki and Michiyo Yasuda. However, producers agreed on the installation of computers to successfully complete the film prior to the Japanese premiere date. Telecom Animation Film Company and Oh! Production helped animate the film. Toei Animation and DR Movie helped with the painting process.</p><p>Two titles were originally considered for the film. One, ultimately chosen, has been translated into English as Princess Mononoke. The other title can be translated into English as The Legend of Ashitaka (アシタカ𦻙記, Ashitaka Sekki), and it contains an uncommon kanji 𦻙 that represents \"a legend passed down from ear to ear without being recorded in official history\", according to Miyazaki. In a Tokyo Broadcasting System program, televised on November 26, 2013, Toshio Suzuki mentioned that Miyazaki had preferred The Legend of Ashitaka as the title while Suzuki himself favoured Princess Mononoke, though the former title was eventually reused for the first song on the soundtrack. The English dub contains minor additional voice overs to explain nuances of Japanese culture to western audiences.</p><br/><h3>Themes</h3><h4>Environment</h4><p>A central theme of Princess Mononoke is the environment. The film centers on the adventure of Ashitaka as he journeys to the west to undo a fatal curse inflicted upon him by Nago, a boar turned into a demon by Eboshi. Michelle J. Smith and Elizabeth Parsons said that the film \"makes heroes of outsiders in all identity politics categories and blurs the stereotypes that usually define such characters\". In the case of the deer god's destruction of the forest and Tataraba, Smith and Parsons said that the \"supernatural forces of destruction are unleashed by humans greedily consuming natural resources\". They also characterized Eboshi as a businesswoman who has a desire to make money at the expense of the forest, and also cite Eboshi's intention to destroy the forest to mine the mountain \"embodies environmentalist evil\". Deirdre M. Pike writes that Princess Mononoke is simultaneously part of nature and part of the problem. Mononoke represents the connection between the environment and humans, but also demonstrates that there is an imbalance in power between the two.</p><h4>Sexuality and disability</h4><p>Two other themes found in the plot of Princess Mononoke are sexuality and disability. Speaking at the International Symposium on Leprosy / Hansen's Disease History in Tokyo, Miyazaki explained that he was inspired to portray people living with leprosy, \"said to be an incurable disease caused by bad karma\", after visiting the Tama Zenshoen Sanatorium near his home in Tokyo. Lady Eboshi is driven by her compassion for the disabled, and believes that blood from the Great Forest Spirit could allow her to \"cure poor lepers\". Michelle Jarman, Assistant Professor of Disability Studies at the University of Wyoming, and Eunjung Kim, Assistant Professor of Gender and Women's Studies at the University of Wisconsin–Madison, said the disabled and gendered sexual bodies were partially used as a transition from the feudal era to a hegemony that \"embraces modern social systems, such as industrialization, gendered division of labor, institutionalization of people with diseases, and militarization of men and women.\" They likened Lady Eboshi to a monarch. Kim and Jarman suggested that Eboshi's disregard of ancient laws and curses towards sex workers and lepers was enlightenment reasoning and her exploitation of disabled people furthered her modernist viewpoints. Kim and Jarman conclude that Lady Eboshi's supposed benevolence in incorporating lepers and sex workers into her society leverages the social stigma attached to marginalized groups, pointing out that the hierarchical structures within Irontown still support the stigmatization of lepers and sex workers.</p><h4>Development versus preservation</h4><p>An additional theme is the morally ambiguous conflict between humankind's growth and development and Nature's need for preservation. According to the Chicago Sun-Times's Roger Ebert, \"It is not a simplistic tale of good and evil, but the story of how humans, forest animals and nature gods all fight for their share of the new emerging order.\" Billy Crudup, who provided the English voice for Ashitaka, said \"The movie was such an entirely different experience; it had a whole new sensibility I had never seen in animation. It also had something profound to say: that there has to be a give and take between man and nature. One of the things that really impressed me is that Miyazaki shows life in all its multi-faceted complexity, without the traditional perfect heroes and wicked villains. Even Lady Eboshi, who Ashitaka respects, is not so much evil as short-sighted.\" Minnie Driver, the English voice actress for Lady Eboshi, commented similarly: \"It's one of the most remarkable things about the film: Miyazaki gives a complete argument for both sides of the battle between technological achievement and our spiritual roots in the forest. He shows that good and evil, violence and peace exist in us all. It's all about how you harmonize it all.\" Anime historian Susan Napier said there is no clear good vs. evil conflict in Princess Mononoke, unlike other films popular with children. Based on the multiple points of view the film adopts, San and Lady Eboshi can simultaneously be viewed as heroic or villainous. San defends the forest and viewers empathize with her. But she also attacks innocent people, complicating how we evaluate her. Opposed to San, Eboshi tries to destroy the forest and could be considered a villain. But everything she does is out of a desire to protect her village and see it prosper. San and Lady Eboshi survive until film's end, defying the usual convention of good triumphing over evil with the antagonist defeated. Napier concluded that the resolution of the conflict is left ambiguous, implying that Lady Eboshi and San will be able to come to some sort of compromise. The ambiguity suggests that there are no true villains or heroes.</p><h4>Nature vs Culture</h4><p>In many stories and myths, we are often presented with a situation in which nature (what is not made by humans) is contrasted with culture (anything that is made by us). Myth often presents us with a need to balance the two: too much nature and we have barbarism & no civilization; too much civilization and we have a dehumanized, mechanized bureaucracy. Princess Mononoke is a captivating, animated film by Hayao Miyazaki that vividly explores and represents the conflict between nature and culture. The film depicts a clash between human civilization and the natural world, where humans exploit resources and destroy the environment to build their cities and wage wars. The movie also highlights the consequences of this behavior, as the spirits of the forest fight back, resulting in a battle for the survival of both sides. As the colonizers destroy the spirit of the forest, they must come to accept the consequences as it destroys the world and landscape around them. In a specific scene during the film, the tribe of boars are led by their leader Queen Okkoto and Nago who attack Irontown because they feel that the humans have taken over their natural habitat. (Miyazaki, 1997) This attack represents the wild environment of the natural world and its fierce resistance to human interference, while humans represent the force of industrialization and civilization, which seeks to conquer and dominate the natural world. Suggesting to the viewer that the preservation of nature is necessary to maintain a peaceful functioning society, and if one abuses the other, destruction will ensue. Princess Mononoke portrays a thought-provoking and visually stunning narrative on the importance of preserving nature and coexisting with the world around us. Overall, the film does not give a simple answer or resolution to this conflict. Rather, it highlights the importance of balance, cooperation, and respect between humans and the natural world.</p><h4>Loss of innocence</h4><p>Dan Jolin of Empire said that a potential theme could be that of lost innocence. Miyazaki attributes this to his experience of making his previous film, Porco Rosso, and the wars in the former Yugoslavia, which he cites as an example of mankind never learning, making it difficult for him to go back to making a film such as Kiki's Delivery Service, where he has been quoted as saying \"It felt like children were being born to this world without being blessed. How could we pretend to them that we're happy?\"</p><h4>Duality</h4><p>Duality is central to Eboshi's characterization. Benjamin Thevenin, Assistant Professor of Theater and Media Arts at Brigham Young University, said Eboshi does not fully understand the harm she does to the spirits. Her focus is on creating a safe home for her people. She holds no malicious intent toward nature and its spirits until they begin attacking her people. Once nature attacks, she gathers her soldiers to protect the inhabitants of her town, a place where all are welcome. Irontown is a haven for former sex workers and lepers. She brings them to Irontown and gives them jobs, hospitality, and a kindness that they have never experienced before. The same treatment goes for all Irontown's inhabitants, not just the sickly and the scorned. Lady Eboshi treats everyone equally, no matter the race, sex, or history of the individual, creating a caring community. While Eboshi hates San and the forest spirits, she keeps a garden in her town. Her care for the garden implies that her intention is not to ravage nature to no end, but rather to help her own people. Thevenin concluded that although Eboshi can be seen as the film's villain, she is also a hero to the citizens of Irontown and to humankind in general.</p><h4>Non-duality</h4><p>At first glance Lady Eboshi and Princess Mononoke suggest a very dualistic and dichotomous view of life. Lady Eboshi works for the survival of humankind and San for the survival of nature. But Miyazaki, through the character of Ashitaka, argues that we should accept a non-dualistic view of living, accepting that nature and humans coexist. Ashitaka acts as a healer, mediating between humanity and nature. Ashitaka's curse, obtained while defending his people from a demonized boar god, ultimately symbolizes the destructive force of life, forcing him to recognize the commonalities present in the conflict between industrialized society and nature. Ashitaka’s quest for a cure by the Great Forest Spirit symbolizes humanity’s quest to find a way to live on earth that accepts the interbeing of all of earth's creatures. Ashitaka takes responsibility for the preservation and restoration of nature when he returns the Great Forest Spirit’s head, transferring the guardianship of nature from the now dead Great Forest Spirit to humanity. With guardianship of nature delegated to humanity, the dichotomy between humanity and nature is dismantled and the two forces are tasked with recognizing their coexistence.</p><h4>Individualism and conformity</h4><p>Another theme in this film is between individualism and societal conformity. According to University of Bristol professors Christos Ellinas, Neil Allan and Anders Johansson, this struggle can be seen between San, a strong individualistic force, and Eboshi, the leader of a great society. San has fully committed to living with the wolves in the forest and to renouncing her association with the human race. Eboshi has vowed to sustain her society of Irontown by any means including destroying the environment. The people of Irontown have a cohesive ideology and agree with Eboshi to protect Irontown at the cost of the environment's destruction. This conformity can be found within their society, because “even though there is an envisioned culture at which an organization abides to, achieving coherence at lower aggregation levels (e.g. individuals) is increasingly challenging due to its emergent nature”.</p><h4>Karma</h4><p>The Buddhist principle of karma is at work in the characters of Lady Eboshi and Ashitaka with different results for each. Lady Eboshi destroys the forest to ensure the livelihood of her people and also for her own personal gain. This selfish personal quest ends up having ramifications that reveal themselves at the film's end. Lady Eboshi, taken from the earth with no regard for the damage she inflicts, turns against her when she ends up losing one of her arms. Lady Eboshi seems to learn from this, becoming more in tune with nature and using that karmic lesson to better herself and Iron Town. Ashitaka works in an opposite way to Eboshi. Ashitaka does not go out of his way to damage nature though at the start of the film he does kill the demon boar in order to save his village. When as a result Ashitaka is cursed, he does not take his anger out on nature and still treats all living things with respect. He also protects life in general, doing the right thing for all whom he meets and mediating between others in order to prevent further violence. Having this mindset despite the affliction he is suffering from and being able to overcome his curse shows that he is a pure soul who will be rewarded for his actions. Smith, Michelle, 2012, Animating child activism: Environmentalism and class politics in Ghibli's Princess Mononoke (1997) and Fox's FernGully (1992), Taylor & Francis Online. Animating child activism: Environmentalism and class politics in Ghibli's Princess Mononoke (1997) and Fox's FernGully (1992): Continuum: Vol 26, No 1 (tandfonline.com)</p><h4>Hope</h4><p>In Greek literature elpis (ἐλπίς) has a parallel with the Buddhist concept of non-duality--hope is a positive because it enables mortals to survive the calamaties that life presents them with. Hope also has a negative aspect, keeping mortals from acting in their own best interest because they have blind faith that their lives will improve without any effort on their part. Professor Jack Kwong at Appalachian State University believes that to have genuine hope you must be able to conceive, however tentatively, the intermediate steps that bridge the gap between us and the outcome and allow us to move forward to the outcome. Likewise in Princess Mononoke hope plays a central role. For instance, San is someone who has hope that her family in the forest can beat the humans, even though that’s impossible with the development of guns. That doesn't deter her from her hope and determination to win. San also exhibits this when Okkoto starts to turn. San continues to try and save Okkoto even though he’s already started the process of turning into a demon and can't be saved. Eboshi also exhibits this through her desire to protect her people from Lord Asano's samurai. Eboshi doesn't fully trust Jigo in their deal that the emperor will help protect Iron Town from Asano, but she still goes along with his plan to take the forest guardian spirit head in hope that he’s telling the truth. Ashitaka, the mediator between these two opposed sides, exhibits the theme of hope the most. Faced with extreme difficulties, Ashitaka maintains hope that both humans and the inhabitants of the forest will find a way to walk down a path of peace. Even though the two sides are constantly battling against each other, Ashitaka still strives to bring an end to their conflict. This is best seen when Jigo and Eboshi decapitate the forest spirit. Ashitaka works with hope toward a future that recognizes the interbeing of all.</p><br/><h3>Release</h3><p>Princess Mononoke was released theatrically in Japan on July 12, 1997. The film was extremely successful in Japan and with both anime fans and arthouse moviegoers in English-speaking countries. Since Walt Disney Studios had made a distribution deal with Tokuma Shoten for Studio Ghibli's films in 1996, it was the first film from Studio Ghibli along with Kiki's Delivery Service and Castle in the Sky to have been dubbed into English by Disney; in this case, subsidiary Miramax Films was assigned to release the movie in the US on October 29, 1999. In response to demands from Miramax chairman Harvey Weinstein to edit the film, one of Miyazaki's producers sent Weinstein a samurai sword with the message: \"No cuts.\" Promotion manager, Steve Alpert, revealed that Weinstein had wanted to trim the film down from 135 minutes to 90 minutes \"despite having promised not to do so.\" When Alpert informed him that Miyazaki would not agree to these demands, Weinstein flew into one of his infamous rages and threatened Alpert that he would \"never work in this...industry again\". Weinstein hired Neil Gaiman to write the English script, and he chose to simplify some of the Japanese terminology for this dub, with words like Jibarashi becoming \"Mercenary\" and Shishigami becoming \"Forest Spirit\". According to him at one of the American screenings of the dub, the release was somewhat delayed because the original recordings deviated from the English script as written. Despite Gaiman's independent fame as an author, his role as scriptwriter for the dub was not heavily promoted: Studio Ghibli requested that Miramax remove some executives' names from the poster for the film, but the executives (Harvey Weinstein, Bob Weinstein, and Scott Martin) decided that Gaiman's name was contractually expendable.</p><p>On April 29, 2000, the English-dub version of Princess Mononoke was released theatrically in Japan along with the documentary Mononoke hime in U.S.A. The documentary was directed by Toshikazu Sato and featured Miyazaki visiting the Walt Disney Studios and various film festivals. The film had a limited theatrical re-release in the United States during July 2018, and again during April 2022 for the 25th anniversary of its original Japanese release.</p><h4>Box office</h4><p>Princess Mononoke was the highest-grossing Japanese film of 1997, earning ¥11.3 billion in distribution rental earnings. It became the highest-grossing film in Japan, beating the record set by E.T. in 1982, but was surpassed several months later by Titanic. The film earned total domestic gross receipts of ¥20.18 billion.</p><p>It was the top-grossing anime film in the United States in January 2001, but the film did not fare as well financially in the country when released in October 1999. It grossed $2,298,191 for the first eight weeks. It showed more strength internationally, where it earned a total of $11 million outside Japan, bringing its worldwide total to $159,375,308 at the time. On December 6, 2016, GKIDS announced that it would screen the film in US cinemas on January 5 and January 9, 2017, to celebrate its 20th anniversary, bundled with the On Your Mark short. The film's limited US re-release in 2018 grossed $1,423,877 over five days, bringing its US total to $3,799,185 and worldwide total to $160,799,185. As of 2020, the film has grossed $194.3 million.</p><p>For its 25th anniversary, Princess Mononoke was screened in 35mm at New York City's Japan Society on July 22, 2022.</p><h4>Home media</h4><p>In Japan, the film was released on VHS by Buena Vista Home Entertainment on June 26, 1998. A LaserDisc edition was also released by Tokuma Japan Communications on the same day. The film was released on DVD by Buena Vista Home Entertainment on November 21, 2001, with bonus extras added, including the international versions of the film as well as the storyboards. By 2007, Princess Mononoke sold 4.4 million DVD units in Japan. At an average retail price of ¥4,700, this is equivalent to approximately ¥20,680 million ($259.18 million) in Japanese sales revenue as of 2007.</p><p>In July 2000, Buena Vista Home Entertainment via Miramax Home Entertainment announced plans to release the film on VHS and DVD in North America on August 29. Initially, the DVD version of Princess Mononoke wasn't going to include the Japanese-language track at the request of Buena Vista's Japan division. Because the film hadn't been released on DVD in Japan yet, there were concerns that \"a foreign-released DVD containing the Japanese language track will allow for the importation of such a DVD to Japan, which could seriously hurt the local sales of a future release of the\". The fansite Nausicaa.net organized an email campaign for fans to include the Japanese language track, while DVD Talk began an online petition to retain the Japanese language track. The DVD release of Princess Mononoke was delayed as a result. Miramax Home Entertainment released the DVD on December 19, 2000 with the original Japanese audio, the English dubbed audio and extras including a trailer and a documentary with interviews from the English dub voice actors. The film was released on Blu-ray disc in Japan on December 4, 2013.</p><p>Walt Disney Studios Home Entertainment released Princess Mononoke on Blu-ray Disc on November 18, 2014. In its first week, it sold 21,860 units; by November 23, 2014, it had grossed $502,332. It was later included in Disney's \"The Collected Works of Hayao Miyazaki\" Blu-ray set, released on November 17, 2015. GKIDS re-issued the film on Blu-ray and DVD on October 17, 2017. As of October 2020, the film has grossed $9,232,906 from Blu-ray sales in the United States. In total, Mononoke's video releases in Japan and the United States grossed an estimated $268 million in physical sales.</p><p>In the United Kingdom, the film's Studio Ghibli anniversary release appeared several times on the annual lists of best-selling foreign language film on home video, ranking number six in 2015 (below five other Studio Ghibli anime films), number ten in 2016, number five in 2018 (below four other Japanese films), and number three in 2019 (below Spirited Away and My Neighbor Totoro).</p><h4>Television</h4><p>The film was aired on Nippon TV (NTV) in Japan, on 22 January 1999. It became NTV's most-watched film up until then with a 35.1% audience rating, surpassing the 28.4% record previously set by Tsuribaka Nisshi 4 in 1994. In turn, Princess Mononoke was later surpassed by Spirited Away, when it aired in 2003.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>As of August 2022, on the review aggregator website Rotten Tomatoes, 93% of 114 critic reviews are positive for Princess Mononoke, with an average rating of 8/10. The website's consensus reads, \"With its epic story and breathtaking visuals, Princess Mononoke is a landmark in the world of animation.\" According to Metacritic, which assigned an average score of 76 out of 100 based on 29 reviews, the film received \"generally favorable reviews\".</p><p>The Daily Yomiuri's Aaron Gerow called the film a \"powerful compilation of Miyazaki's world, a cumulative statement of his moral and filmic concerns.\" Leonard Klady of Variety said that Princess Mononoke \"is not only more sharply drawn, it has an extremely complex and adult script\" and the film \"has the soul of a romantic epic, and its lush tones, elegant score by Joe Hisaishi and full-blooded characterizations give it the sweep of cinema's most grand canvases\". Roger Ebert of the Chicago Sun-Times called Princess Mononoke \"a great achievement and a wonderful experience, and one of the best films of the year. You won't find many Hollywood love stories (animated or otherwise) so philosophical.\" Ty Burr of Entertainment Weekly called the film \"a windswept pinnacle of its art\" and that it \"has the effect of making the average Disney film look like just another toy story\". Kenneth Turan of the Los Angeles Times said that the film \"brings a very different sensibility to animation, a medium views as completely suitable for straight dramatic narrative and serious themes.\" In his review, Dave Smith from Gamers' Republic called it \"one of the greatest animated films ever created, and easily one of the best films of 1999.\"</p><p>Roger Ebert placed Princess Mononoke sixth on his top ten movies of 1999. In 2001, the Japanese magazine Animage ranked Princess Mononoke 47th in their list of 100 Best Anime Productions of All Time. It ranked 488th on Empire's list of the 500 greatest films. Time Out ranked the film 26th on 50 greatest animated films. It also ranked 26 on Total Film's list of 50 greatest animated films.</p><p>James Cameron cited Princess Mononoke as an influence on his 2009 film Avatar. He acknowledged that it shares themes with Princess Mononoke, including its clash between cultures and civilizations, and cited Princess Mononoke as an influence on the ecosystem of Pandora.</p><h4>Accolades</h4><p>Princess Mononoke is the first animated feature film to win the Japan Academy Prize for Best Picture. For the 70th Academy Awards ceremony, Princess Mononoke was the Japanese submission to be nominated for the Academy Award for Best Foreign Language Film, but was not successfully nominated. Hayao Miyazaki was also nominated for an Annie Award for his work on the film.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Recipient</th><th>Result</th></tr><tr><td rowspan=\"6\">1997</td><td rowspan=\"3\">52nd <span class=\"mw-redirect\">Mainichi Film Awards</span></td><td><span>Best Film</span></td><td><i>Princess Mononoke</i></td><td rowspan=\"9;\" style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Animation Film</span></td><td><i>Princess Mononoke</i></td></tr><tr><td>Japanese Movie Fans' Choice</td><td><i>Princess Mononoke</i></td></tr><tr><td rowspan=\"2\">10th <span>Nikkan Sports Film Awards</span></td><td><span>Best Director</span></td><td>Hayao Miyazaki</td></tr><tr><td><span>Yūjirō Ishihara Award</span></td><td><i>Princess Mononoke</i></td></tr><tr><td>1st <span>Japan Media Arts Festival</span></td><td>Grand Prize</td><td><i>Princess Mononoke</i></td></tr><tr><td rowspan=\"3\">1998</td><td rowspan=\"1\">21st <span class=\"mw-redirect\">Japan Academy Awards</span></td><td><span class=\"mw-redirect\">Picture of the Year</span></td><td><i>Princess Mononoke</i></td></tr><tr><td rowspan=\"1\">40th <span>Blue Ribbon Awards</span></td><td><span class=\"mw-redirect\">Special Award</span></td><td><i>Princess Mononoke</i></td></tr><tr><td rowspan=\"1\">22nd <span>Hochi Film Awards</span></td><td>Special Award</td><td><i>Princess Mononoke</i></td></tr><tr><td rowspan=\"2\">2000</td><td rowspan=\"1\"><span>28th Annie Awards</span></td><td>Outstanding Individual Achievement for Directing <br> in an Animated Feature Production</td><td><span>Hayao Miyazaki</span> <br> (English language version)</td><td rowspan=\"2;\" style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"1\"><span>4th Golden Satellite Awards</span></td><td>Best Animated or Mixed Media Film</td><td><i>Princess Mononoke</i></td></tr><tr><td rowspan=\"1\">2001</td><td rowspan=\"1\"><span>27th Saturn Awards</span></td><td>Best Home Video Release</td><td><i>Princess Mononoke</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><br/><h3>Soundtrack</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Princess Mononoke: Music from the Motion Picture</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\"><span>Joe Hisaishi</span></div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">July 2, 1997 (Japan)<br>October 12, 1999 (North America)</td></tr><tr><th scope=\"row\" class=\"infobox-label\">Recorded</th><td class=\"infobox-data plainlist\">1997</td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">65</span>:<span class=\"s\">05</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\">Tokuma Japan Communications (Japan)<br><span>Milan</span> (North America)</td></tr></tbody></table><p>The film score of Princess Mononoke was composed and performed by Joe Hisaishi, the soundtrack composer for nearly all of Miyazaki's productions, and Miyazaki wrote the lyrics of the two vocal tracks, \"The Tatara Women Work Song\" and its title song. The music was performed by Tokyo City Philharmonic Orchestra and conducted by Hiroshi Kumagai. The soundtrack was released in Japan by Tokuma Japan Communications on July 2, 1997, and the North American version was released by Milan Records on October 12, 1999.</p><p>The titular theme song was performed by counter-tenor Yoshikazu Mera. For the English adaptation, Sasha Lazard sang the song. During the movie Hisaishi makes use of a few known classical pieces and quotes them, such as Dmitri Shostakovich's 5th symphony. As with other Studio Ghibli films, additional albums featuring soundtrack themes in alternative versions have been released. The image album features early versions of the themes, recorded at the beginning of the film production process, and used as source of inspiration for the various artists involved. The symphonic suite features longer compositions, each encompassing several of the movie themes, performed by the Czech Philharmonic Orchestra conducted by Mario Klemens.</p><br/><h3>Stage adaptation</h3><p>In 2012, it was announced that Studio Ghibli and British theatre company Whole Hog Theatre would be bringing Princess Mononoke to the stage. It is the first stage adaptation of a Studio Ghibli work. The contact between Whole Hog Theatre and Studio Ghibli was facilitated by Nick Park of Aardman Animations after he sent footage of Whole Hog performances to Studio Ghibli's Toshio Suzuki. The play features large puppets made out of recycled and reclaimed materials.</p><p>The first performances were scheduled for London's New Diorama Theatre and sold out in 72 hours, a year in advance. In March 2013, it was announced that the show would transfer to Japan after its first run of shows in London. A second series of performances followed in London after the return from Tokyo. The second run of London performances sold out in four and half hours. The play received positive reviews and was one of Lyn Gardner's theatre picks in The Guardian. On April 27, 2013, the play was presented at Nico Nico Douga's Cho Party and was streamed online in Japan.</p><br/>"
  },
  "errorMessage": ""
}