{
  "imDbId": "tt0087843",
  "title": "Once Upon a Time in America",
  "fullTitle": "Once Upon a Time in America (1984)",
  "type": "Movie",
  "year": "1984",
  "items": [
    {
      "publisher": "The A.V. Club",
      "author": "Keith Phipps",
      "link": "https://www.avclub.com/once-upon-a-time-in-america-dvd-1798198644",
      "rate": "100",
      "content": "A film of fatally flawed heroes, oversized passions, nation-building, and, inevitably, violence, America follows its characters from childhood to old age by way of the kind of grand-scale filmmaking that wouldn't be seen again until Martin Scorsese's Gangs Of New York. [2014 re-release]"
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "100",
      "content": "It’s a funny, rousing, brilliant piece of work."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/once-upon-a-time-in-america-1984",
      "rate": "100",
      "content": "An epic poem of violence and greed."
    },
    {
      "publisher": "Empire",
      "author": "Adam Smith",
      "link": "https://www.empireonline.com/movies/reviews/upon-time-america-review/",
      "rate": "100",
      "content": "While The Godfather delivers certainty and a comforting dramatic resolution, Once Upon A Time In America delivers a profound kind of mystery. While Coppola's film delivers answers, Leone's asks questions. It lingers and plays on the mind; its meanings shift and change like a faded memory or a half-remembered dream."
    },
    {
      "publisher": "",
      "author": "Entertainment Weekly",
      "link": "https://ew.com/article/1994/12/09/reviews-two-sergio-leone-epics-laserdisc/",
      "rate": "100",
      "content": "A brilliantly detailed Lower East Side Jewish version of The Godfather."
    },
    {
      "publisher": "IGN",
      "author": "",
      "link": "",
      "rate": "90",
      "content": "Watching the film takes some patience. You have moments where there's 10 seconds or more of silence in between dialogue. When it gets violent, it's not the psychotic glee we're used to from Quentin Tarentino and his acolytes, it's simply the way things were in that life, unvarnished and brutally honest."
    },
    {
      "publisher": "",
      "author": "BBC",
      "link": "https://www.bbc.co.uk/films/2003/06/18/once_upon_a_time_in_america_1984_dvd_review.shtml",
      "rate": "80",
      "content": "A film as epic and rich as Sergio Leone's imagination, Once Upon a Time in America sits at the head table of gangster movies."
    },
    {
      "publisher": "LarsenOnFilm",
      "author": "Josh Larsen",
      "link": "http://www.larsenonfilm.com/once-upon-a-time-in-america",
      "rate": "75",
      "content": "Once Upon a Time in America paints a portrait of the United States as a land of shadows and violence, yet one that nevertheless has an irresistible, romantic pull. [2014 re-release]"
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "https://www.csmonitor.com/1984/0816/081644.html",
      "rate": "67",
      "content": "Although substantially shortened for its United States release, this violent drama still has the feel of an epic, as director Sergio Leone explores the seamiest byways of urban Americana through the story of two gangsters who start their partnership as Brooklyn kids in 1921 and tragically end it in the late '60s. Yet the story has gaps and many of the incidents have a flatness which suggest deeper flaws than cutting and trimming probably account for. [U.S. theatrical release]"
    },
    {
      "publisher": "The Irish Times",
      "author": "Donald Clarke",
      "link": "https://www.irishtimes.com/culture/film/once-upon-a-time-in-america-review-a-fistful-of-misogyny-1.2237264",
      "rate": "60",
      "content": "Once Upon a Time in America remains the most “problematic” of Leone’s major pictures. It is enveloping, operatic and slightly mad. We can forgive the confusion and the non- synchronised dialogue. But to this day the misogyny remains indigestible. [2014 re-release]"
    }
  ],
  "errorMessage": ""
}