{
  "imDbId": "tt0087843",
  "title": "Once Upon a Time in America",
  "fullTitle": "Once Upon a Time in America (1984)",
  "type": "Movie",
  "year": "1984",
  "items": [
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw2900651",
      "warningSpoilers": false,
      "date": "6 November 2013",
      "rate": "10",
      "helpful": "358 out of 408 found this helpful.",
      "title": "Last, butchered, unappreciated, work from one of the greatest...",
      "content": "... Directors of all time. Let's start with a story. Many years ago, when your grandfather was still a boy, a failed, beaten-down actor named Clint Eastwood packed up his horse and saddle (speaking metaphorically here), left Hollywood forever (or so he thought) and headed out to Europe to pick up cash wherever he could. He ended up doing a film in Italy for an almost-unknown director named Sergio Leone and an almost-unknown sound guy named Ennio Morricone. The film was (as history would later record) an \"Italian Western,\" that is, as the iconic western drama was all but disappearing in the US, it was being \"re-imagined\" by Italian writers and directors, and then filmed in Italy, using mainly Italian actors. On the set, Eastwood spoke in English and everyone else spoke in Italian. (Dubbing later fixed all that). Filming now over, Eastwood took his cash and left. Weeks later, in a bar in another part of Europe, he overheard mention that a certain film was the leading box office attraction on the continent. The name sounded familiar but, frankly, during production, a final name for the film he'd just done had not even been selected. He investigated. Yes, this was the film he had just completed, now titled A FISTFUL OF DOLLARS. The rest is history. Sort of. Two sequels were done with Eastwood playing the same character. Monster hits.By this point the critics began to acknowledge not only Clint, but also the man behind the camera, Leone, who was one of the most promising directors of the era. HE DID THINGS WITH THE CAMERA THAT NO ONE HAS DONE BEFORE OR SINCE, especially his use of closeups, especially his ability to match powerful emotional orchestrals to key scenes. The fourth film in the series, done by Leone but by this time lacking Eastwood, was ONCE UPON A TIME IN THE WEST. (Eastwood meanwhile had returned to America as a major celebrity, formed his own production company, Malpaso, and over time became a director as well as the #1 box office star. Over the course of his career, Eastwood subtly voiced his distaste for Leone's work by scrupulously avoiding all Leone's trademark camera angles, even in his westerns!)Back to Leone. While he lent his name to a handful of oddball productions, the last passionate work he left behind as his legacy was this film. OMG. What a film. Showcasing not only Leone's talent behind the camera, but also his musical magic as well as his ability to tell a complex tale like no one before him. It was by and large produced in obscure locations in NA, and the performances of the players, especially James Woods, and also de Niro, could possibly rank even today as the best they have ever given. (Also a performance from a young and charismatic Jennifer Connolly that by itself is worth the price of the ticket)The film is magical. But here is the catch. Very few people have ever seen it. Even people who \"think\" they have seen it, really have not. The studio behind the film went berserk when they saw the length and, fearful of losing dollars when they could be changing reels and selling more tickets, they brought in a butcher to shorten it. Now maybe the new editor was not a butcher by trade, but he was sure one by disposition. The late Roger Ebert said that, in his career, this was the most abusive re-edit he had ever seen. The actual film, the one that Leone left, was not seen until years later when the director's version surfaced. It is astounding. It is magical. It is one of the best films ever made. It is a must see. ((Designated \"IMDb Top Reviewer.\" Please check out my list \"167+ Nearly-Perfect Movies (with the occasional Anime or TV miniseries) you can/should see again and again (1932 to the present))"
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0213687",
      "warningSpoilers": false,
      "date": "21 September 2002",
      "rate": "",
      "helpful": "65 out of 76 found this helpful.",
      "title": "A wonderful epic that is really only about one man's regret - excellent",
      "content": "Noodles returns to the New York of his youth in response to an invitation to come and meet. His return is his first for half his life having fled New York to avoid being killed for ratting out his gangster friends. His return is mysterious and he doesn't know why he has been summoned. His return sparks memories of his childhood and adulthood growing up in the area with his friends and eventual business partners.A three and a half hour movie may not be everyone's idea of fun. On the other hand, many people who see a running time over 180 minutes immediately assume it is an epic that must be `the greatest film ever made'. In this case the time is worth the effort, even if it a little luxurious and overlong. The plot is too sweeping to go into detail, encompassing 30 years in the main part and a further 30 by way of suggestion. Basically it comes down to Noodles memories of his life when he was growing up, up till the point we find him now, as an old man with little but those memories. As a story this is moving and involving. There are maybe too many lingering shots of Noodles staring into the distance but these don't feel as lazy as they have in other films.Noodles past and the misery of him now is involving enough, but the main thread is Noodle's past, both childhood and adulthood in crime and love. The sheer detail that must be covered is well done. The film not only includes many major events but also minor things like the scene where the boy is tempted to eat a cream cake! This mix is very rewarding and makes it feel a lot more detailed than it actually is. The story is a real feel of several generations of crime and is very involving.The cast make the film and hold the attention during the scenes that are longer than they should be etc. De Niro convinces as youth and bitter old man and holds the eye easily as both. Woods is much better than usual even if his character is the same. McGovern is good considering she has a minor role, but as an `old woman' she looks the same as she was when she was young. Actors like Williams, Aiello, Forsythe, Hayden etc easily fill out the gangster etc roles without falling into cliché or caricature. Just as rewarding are the child actors who carry the first hour of the film. Not only do they actually look like the actors in question, but they also do a very good job. There are some bum notes but they do mange the innocence of youth with the emotional basis for the rest of the film.The direction is excellent  both gritty streets but with an affectionate slant of Noodles' memories. The direction is made almost perfect by the use of Ennio Morricone's score. It is at once haunting but slightly warming and `Debra's theme' has become one of my favourite tunes. The overall effect is one of a rich tapestry that eventually weaves into a very personal epic of regret and loss.An excellent film that deserves to be recognised as both one of the great crime epics but also a personal and moving film."
    },
    {
      "username": "philip_vanderveken",
      "userUrl": "https://www.imdb.com/user/ur3922673",
      "reviewLink": "https://www.imdb.com/review/rw0213795",
      "warningSpoilers": false,
      "date": "19 September 2004",
      "rate": "10",
      "helpful": "918 out of 1,127 found this helpful.",
      "title": "Make sure you get the director's cut!",
      "content": "Many people compare \"Once Upon a Time in America\" with \"The Godfather\". In my opinion these two movies can't be compared. Both are masterpieces in their own way, but each of them has a different style. You don't compare a Picasso to Michelangelo's Sixteen Chapel either, do you?What is it that makes this movie a masterpiece? Well, first of all there is the director. Sergio Leone is a real master when it comes to creating a special atmosphere, full of mystery, surprises and drama... He's one of the few directors who understands the art of cutting a movie in such a way that you stay focused until the end. The way the movie was cut is also the reason why a lot of Americans don't think this movie is very special. There are three versions, but only the European version is how the director imagined it to be. He didn't want his movie to be shown in chronological order (1910's - 1930's - 1960's), but wanted to mix these three periods of time. The studio cut the movie in chronological order, loosing a lot of its originality and therefor getting a lot of bad critics. If you want to see this film the way Sergio Leone saw it, you have to make sure you get the director's cut. The second reason why this movie is so great is the music. Ennio Morricone, who is seen as the greatest writer of film music ever, did an excellent job. Together with the images, the music speaks for itself in this movie. From time to time there isn't said a word, but the music and the images on their own tell the story. He understood perfectly what Sergio Leone wanted and composed most of the music even before the movie was shot.Last but not least there is also the acting and the script. The actors all did an excellent job. But what else can you expect from actors like Robert De Niro, Joe Pesci... They helped making this movie as great as it is by putting there best effort in it. The script helped them with it. It took twelve years to complete, but it hasn't left any detail untouched. The writers really thought of everything when creating it.I can really recommend this movie to everyone, but especially to people who like the gangster genre. When you want to see the movie, you better be sure that you will have the time for it. This isn't a movie that is finished after 90 minutes. You'll have to be able to stay focused during 3 hours and 47 minutes, which will certainly not be easy during the first 20 to 30 minutes. Some scenes at the beginning only make sense when you have seen the end of the movie. But when you are able to stay focused, you'll find this one of the best movies you've ever seen. I certainly did and I rewarded it with a well deserved 10/10."
    },
    {
      "username": "w-71474",
      "userUrl": "https://www.imdb.com/user/ur110513836",
      "reviewLink": "https://www.imdb.com/review/rw5738686",
      "warningSpoilers": false,
      "date": "15 May 2020",
      "rate": "10",
      "helpful": "15 out of 15 found this helpful.",
      "title": "Once a street teenager",
      "content": "Years later, the desperate noodles returned to New York. In the bar of an old friend, loyal and foolish, he slowly asked him: \"How have you lived in these 35 years?\" Quietly answered: \"I just go to bed every morning.\" It's hard to say a word, full of vicissitudes. His temples were covered with white hair. He was no longer a gangster on the street, and he was no longer a gangster in the sky. He was just a calm, stumbling old man. He had nothing but memories ...His life was about several brothers who were born and died, and a beautiful girl; about friendship and dreams, about youth and love, and about loyalty and betrayal. In those years, when a person was silently displaced and traveled far away, what was he holding in his heart? Is it the betrayal of the ringing phone reminder after years? Is it a girl who is ignorant of the angelic dance peeping through the teenager's doorway? Years later, he finally realized that he had been guilty for 35 years, which was originally pure loyalty and friendship; the brother he devoted to and maintained for life had deceived him for 35 years.There is nothing new under the sun, and the key to good movies lies in the way they tell stories. The yellowish color of the film seems to be covered with a layer of mist, so that each lens is like an old yellowed picture; the high and distant pan flute is awkward. The music and the plot blended together to complement each other, and several transitions were made to happen. In the four-hour movie, the plot is clear when you see the second pass. If you watch it a few times, you will find that almost every shot is instructive and indispensable. The people behind the camera used Noodles to vent the concept: the void of the void, everything is the void."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0213746",
      "warningSpoilers": false,
      "date": "19 October 2003",
      "rate": "10",
      "helpful": "168 out of 245 found this helpful.",
      "title": "A sprawling, deliberately paced, and generally a superbly crafted piece of work",
      "content": "It's been said that when one watches a \"spaghetti\" western (one of the \"Man with no name\" films with Clint Eastwood) filmmaker Sergio Leone's trademark cinema style and flair for clear storytelling is instantly recognizable. This is no truer than in his most ambitious effort, Once Upon a Time in America, in which his usage of close-ups, concise camera movement, sound transitions and syncs, and the sudden change in some scenes from tenderness to violence. And, he pulls it off without making the viewer feel dis-interested. Of course, it's hard to feel that way when watching the cast he has put together; even the child actors (one of which a young Jennifer Connelly as the young Deborah) are believable. Robert De Niro projects his subtitles like a pro, with his occasional outburst in the right place; James Woods gives one of his first great performances as Max; Elizabeth McGovern is the heart of the film; and Joe Pesci should've had more than just a one scene appearance, thought it's still good. It's a story of life-long friends, in the tradition of the Godfather movies with obvious differences, and the story cuts back and forth to Noodles (De Niro) in his old age returning from exile, looking back on his childhood in Brooklyn, his rise to power with his partners, and the twists come quite unexpectedly. The pace is slow, but not detrimental, and it gives the viewer time to let the emotions sink in. The story is also non-linear, and yet doesn't give away facts to the viewer- this is something that more than likely influenced Tarantino (and many others) in style. By the end, every detail that has mounted up makes the whole experience rather fulfilling, if not perfect. Finally, I'd like to point out the exceptional musical score. Ennio Morricone, as it says on this site, has scored over four hundred films in forty years, including Leone's movies. This would have to be, arguably, one of his ten best works- his score is equally lively, saddened, intense, and perhaps majestic for a gangster epic. Overall, it's filled with the same spirit Leone had in directing the picture, and it corresponds beautifully- there are some scenes in this film that would simply not work without the strings. Grade: A"
    },
    {
      "username": "zeki-4",
      "userUrl": "https://www.imdb.com/user/ur13142207",
      "reviewLink": "https://www.imdb.com/review/rw5426003",
      "warningSpoilers": false,
      "date": "21 January 2020",
      "rate": "9",
      "helpful": "25 out of 28 found this helpful.",
      "title": "Probably the best movie I have ever seen",
      "content": "Make sure you watch the 220 minute version which is perfect. The butchered 139 minute version should never have been released and the added faded clips in the much longer 269 minute version aren't worth it.It's not an easy watch. The story builds patiently and jumps back and forth in time, spanning three generations. It's not the usual gangster flick, but a tale of forgiveness, betrayal, greed and nostalgia. The sets, the fantastic score by Morricone, De Niro at the pinnacle of his career.A beautiful epic swan song by the master Sergio Leone this is."
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0213735",
      "warningSpoilers": true,
      "date": "19 August 2003",
      "rate": "10",
      "helpful": "183 out of 275 found this helpful.",
      "title": "On par with \"The Godfather\" and \"Goodfellas\"...",
      "content": "\"Once Upon a Time in America\" is a film set free of time; it spans many different years and, like \"Citizen Kane,\" never tells the audience where it is. As many times as I watch it, I can never guess what is going to happen next.And watching \"Once Upon a Time in America\" on the new extended DVD is like revisiting an old friend, finally seeing a masterpiece in its entirety. Many people complained of the choppiness in the three-hour-version of the film originally released in 1984 - and the new four hour version puts all the pieces together and is truly marvelous to behold.This is the dirty, gritty version of \"The Godfather.\" It has an incredible amount of violence, especially for a film made almost twenty years ago. I'm not sure how much violence, sexual content and so on was in the original cut, but this extended version is pretty close to an NC-17 rating.The film stars Robert De Niro in one of his most memorable yet forgotten roles. He plays Noodles, a gangster operating sometime during the 1930s. Noodles grew up during the early 1900s, and on the streets he and four other kids started their own crime operation. After a local crime lord named Bugsy gets jealous and murders the youngest member of Noodles' operation, Noodles returns the favor and kills Bugsy. Apprehended by police, Noodles is sent to jail for years.Sometime, years later, Noodles is released into the free world. He isn't a changed man, either. His old crime buddy Max (James Woods) picks him up and introduces him to the old gang members. Soon they are back in business, working for Frankie (Joe Pesci). This is the truest definition of an epic. \"Once Upon a Time in America\" is one of the most forgotten gangster films, and yet it is ironically one of the best. It took director Sergio Leone almost ten years to get this motion picture to the screen. Sergio's original script treatment - the outline for the story - was 200 pages long. Just the outline. Soon he employed numerous writers to redo the script, and they bounced it up to 400 pages. There is a saying that for every page in a film script, there is one minute of screen-time. You do the math. After the long scriptwriting process, they then had to get permission to film the movie, from the author of the novel this film is based upon. Then, after that struggle, there came the film itself. How to turn such a bold narrative into a compelling film? What techniques should be used? Where to start?The beginning of the film opens up during the 1930s or sometime around then, fast-forwards to the 1960s, then flashbacks to the early 1900s. It skips around a lot. This makes the viewer active, trying to figure out where and when they are. It is an element that gives a film rewatchability. Roger Ebert pointed out that \"Citizen Kane\" is set free of chronology, and the same goes for \"Once Upon a Time in America.\" Sergio Leone is the master of extreme close-ups and wide frame shots, seen in \"Fistful of Dollars\" and here with wide shots of busy streets. In one scene a young girl (pre-stardom Jennifer Connelly) walks along a street, and Leone pulls the camera up, up, up and back, back, back, revealing the entire street. Soon she is lost in the crowd. The same thing is done with De Niro's character as a child, and we lose image of him in the crowd, but then Sergio uses an almost invisible dissolve and we come back upon him.The acting by De Niro is superb. His character, Noodles, is probably the character in this film who is most in-touch with his feelings. We often feel for him, but numerous times in the film he does things disturbing and sickening and we are repulsed. One scene extended in the DVD is the controversial rape scene between De Niro and Elizabeth McGovern. After it is all over, Noodles climbs out of the back seat of the car and walks to the side of the road, standing there, looking into the distance. Many people say this is guilt because he knows what he has done and is ashamed. I don't think so. During the film he rapes numerous women and doesn't seem to mind at all. I think the point Leone was trying to make is that De Niro's character has no idea how to treat or respect women. His entire life he grew up around women who were treated as objects (such as the young prostitute who lived in his apartment complex). So when Noodles stands by the side of the road, this is not from the guilt of what he has done - it is from the guilt of not knowing how to treat a woman, not knowing what to say, not knowing what to do. Not knowing how to respect her. His entire life he was taught that women were just there for pleasure, but when he stands by the road this is a sign that Noodles is starting to think this may all be wrong. It is the guilt of naivety, not self-awareness.\"Once Upon a Time\" is the master of gangster flicks. Two other tremendous gangster flicks, \"The Godfather\" and \"Goodfellas,\" have gotten the respect they rightfully deserve over the years - but \"Once Upon a Time in America\" has been seemingly ignored - up until know. I hope that this DVD sparks a newfound interest in the film, because no one should go a lifetime without seeing this moving motion picture."
    },
    {
      "username": "DrLenera",
      "userUrl": "https://www.imdb.com/user/ur2666204",
      "reviewLink": "https://www.imdb.com/review/rw1171425",
      "warningSpoilers": false,
      "date": "13 September 2005",
      "rate": "",
      "helpful": "81 out of 109 found this helpful.",
      "title": "Not simply the greatest of gangster movies,but one of the greatest movies ever,a multi-layered,melancholic masterpiece that demands repeated viewings",
      "content": "Once Upon A Time In America is the crowning achievement of director Sergio Leone. It's nearly four hours long,and demands total concentration from beginning to end. However,those willing to submit will find it more than worth it.Reminiscent at times of some very old gangster films such as The Roaring Twenties,one will find almost every gangster movie cliché one can find-one can imagine Leone half remembering bits and pieces from films he saw as a youth. However,he never glamourises his protagonists-he may dare us to like Robert De Niro's 'Noodles'-a murderous thug and rapist who always seems to make the wrong decisions-but that's different from glamourising him. The notorious rape scene is all the more hard to watch because its painful to watch Noodles try to destroy himself and his girlfriend by going through with it.What really makes this film different is it's overwhelming melancholy. Leone's favourite loyalty/betrayal theme is there,but the film is also a study of memory,of a lost soul coming to terms with his past. Therefore,starting in mid-plot in the 1930s,than flashing back and forth in time,was the right choice {if initially confusing!}. This is the culmination of Leone's increasing interest in the flashback structure-think especially of the parallel story told in A Fistful of Dynamite's flashbacks.There is action,but it's mostly quick and brutal,and there is also humour,such as a very funny scene set to Rossini's Thieving Magpie where the gangsters are loose in a hospital filled with babies. However,the broody,melancholic tone never really goes away,and towards the end,the film grinds to a virtual halt. Be warned,there is no action climax,just a series of somewhat oblique dialogue scenes and revelations.The expected Leone flamboyancy is hardly to be found,but the film still often soars most when dialogue is kept to a minimum and Ennio Morricone's gorgeous music takes over. Some of the most brilliant scenes just consist of Noodles seeing and reflecting. In one especially effective and poignant scene near the end,an old Noodles is leaving his love Deborah as her achingly sad theme plays,and he sees her son,who is the spitting image of,well,I try to avoid spoilers! As the music changes into the still sad but more majestic main theme,the camera slowly zooms,as it often does,into Noodles' sad eyes. We go to what is initially a blur,until we realise it's curtains. The person who holds the key to all this appears,like a ghost,through the curtains and goes onto a balcony,from where he sees the same 'son' with a girlfriend. Sheer brilliance,and not a gun in sight! Of course De Niro is great,but he's obviously very restrained and reflective. It's James Woods who really dominates,so dynamic here,this should have made him a big star. One must also mention Tonni Delli Colli,who photographs three time periods with slightly different hues but still subtly.Leone's original cut was five hours and if you want to be picky there are holes in the plot. Leone leaves a great many things ambiguous,but shouldn't all great art ask questions? Once Upon A Time In America is not necessarily easy viewing,but it IS great art,the final statement of one of the best filmmakers of all time."
    },
    {
      "username": "darth_sidious",
      "userUrl": "https://www.imdb.com/user/ur0518740",
      "reviewLink": "https://www.imdb.com/review/rw0213634",
      "warningSpoilers": false,
      "date": "3 January 2001",
      "rate": "",
      "helpful": "31 out of 40 found this helpful.",
      "title": "Masterpiece",
      "content": "My title sums up the film, albeit cliche, the film is a masterpiece. The story of a gang's rise from the prohibition years to the 60s. The film's main 2 character's are the focus of the picture. Without trying to spoil it, the film addresses 3 distinct eras in their lives.The film explores the heart, Noodles soul. A man struggling with himself, someone who plays evil acts, a man who sees the pure in his childhood sweetheart. A man never at peace.The film is directed by Leone, a master of his art. I'm a huge fan of his work. Each of his films got better and better, and Once Upon A time In America was a picture which had all the experience which he achieved in the 60s. It's almost a gift to himself.The film's locations are stunning, authentic and dirty.The screenplay is excellent, but the direction makes the film. Maybe one or two characters were underwritten, but it seems that the director wanted us to talk about the picture, discuss the possible loose ends, make up our own minds. Leone's methodical pacing is stunning.The acting is tremendous, can't praise James Woods and Robert De Niro enough, awesome!The photography is beautiful, it lacks colour giving it a gritty look, perfection!Morricone delivers another masterpiece, his score adds further depth and backups the director's story.See it wide-screen, this film is a stunning piece of cinema. Leone, you were the master!"
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0213744",
      "warningSpoilers": true,
      "date": "2 October 2003",
      "rate": "",
      "helpful": "106 out of 163 found this helpful.",
      "title": "The Very Definition of a Tortured Masterpiece.",
      "content": "\"Once Upon a Time in America\" is probably the most difficult film I have ever encountered in terms of completing an overall accurate cinematic criticism. This movie just grows in myth and debate as the years come and go. Co-writer/director Sergio Leone (who became an international success with \"A Fistful of Dollars\", \"For a Few Dollars More\" and \"The Good, the Bad and the Ugly\" in the late-1960s) could not really figure out what to do with the complicated novel \"Hoods\" when adapted to the silver screen. He struggled through with writes, re-writes and several versions of this production. Every version seemingly has more questions than the one before. There are six screenwriters credited. In the end the final product (the very long running 229-minute version) is one of those films that cannot really be talked about. If you try to talk about this production with someone unfamiliar with it, you will leave them dumb-founded and completely confused. Elements of time, situations, heart of the story and characterization get mixed up into a long and winding road of a movie that is extremely deep and definitely complicated. An elderly Jewish man in the 1960s (Robert DeNiro with heavy makeup) comes back to his old New York neighborhood and goes on a quiet and sad journey of remembrance and personal loss. Flashbacks to the early-1920s start quickly as we see a young group of Jewish adolescents in New York (Scott Tiler, Rusty Jacobs, Adrian Curran and Brian Bloom among them) run around town and take advantage of hard-core criminal syndicates and dim-witted beat police officers. The group is wise beyond their years. They have street-smarts that put them into a high class of law-breakers. Early problems develop and brutal multiple murders take place by Tiler. He is sent to prison for the better part of the 1920s and returns in the 1930s in the form of Robert DeNiro. The other youngsters have grown up to become James Woods (in his first legitimate screen role), William Forsythe and James Hayden. DeNiro's reunion comes and goes like a lightning strike and the group gets back to old crime basics. By this time Prohibition is a way of life for the gangsters of major U.S. metropolitan areas and the quartet takes full advantage of that opportunity to run wild around the city and create immense profits for themselves. Killing men in their way and even at times raping women in their path becomes a norm as the production advances. Other characters leave almost as fast as they appear. Joe Pesci, Burt Young, Treat Williams and Danny Aiello make such short runs that if you are not paying attention closely you might miss them. The women make more pronounced impressions. Youngster Jennifer Connelly grows to become Elizabeth McGovern (DeNiro's childhood love who has aspirations of acting and singing professionally) and Woods finds companionship with the ultra-erotic and smart-mouthed Tuesday Weld (doing her best work by a mile). As the movie continues, DeNiro and Weld develop a bond of hate that turns into mutual respect and eventually they even become the oddest of friends. Woods and DeNiro have a mutual unspoken brotherly love that translates into one of the most important relationships in the history of the movies (DeNiro and Al Pacino would later share a similar bond in the vastly under-rated \"Heat\" some 11 years later). As all this happens though we begin to wonder if all we are seeing is the true reality. A dream-like beginning (which supposedly shows the fates of the four criminals) does not always fit with an amazingly strange final 30 minutes that seems to defy convention, time constraints for the characters and major cinematic screen-writing principles. Symbolism that has always been prevalent in the Italian cinema also comes into play here and these symbols may indeed hold the true answers to the mysteries within. And then again, maybe not. \"Once Upon a Time in America\" was Sergio Leone's final film and it grows in myth and legend due to that fact. Much like similar movies like \"Giant\" (James Dean's final performance) and \"Eyes Wide Shut\" (Stanley Kubrick's hypnotic final production), this movie just seems to go into a higher stratosphere of Hollywood that totally ignores the typical norms that are always in association with other big-name movie products. James Hayden even died of an apparent drug overdose shortly after this film was initially released while performing on Broadway. And thus the legends grow and multiply. Overall in the end I do believe that \"Once Upon a Time in America\" is arguably the finest movie of the 1980s. It is definitely a unique production that stands near the paramount of a decade that was mired in stupid comedies, teen flicks and endless horror movie installments. DeNiro is truly a revelation once again here and he dominates most in a production of seemingly endless wonderful performances. The movie is one of those that should be studied and analyzed over and over by those who really want to get to the root of cinematic history and development. Much like its running time, the excellence of \"Once Upon a Time in America\" is nearly immeasurable. 5 stars out of 5."
    },
    {
      "username": "murtaza_mma",
      "userUrl": "https://www.imdb.com/user/ur19117722",
      "reviewLink": "https://www.imdb.com/review/rw2507262",
      "warningSpoilers": false,
      "date": "23 October 2011",
      "rate": "10",
      "helpful": "52 out of 70 found this helpful.",
      "title": "A Potpourri of Vestiges Review: Leone's magnum opus and a testament to the free spirit of Art",
      "content": "In order to cater to their everlasting lust for making money, the movie production studios have always endorsed the motto of quid pro quo – \"A favor in return of another\". Every movie-maker capable enough to be called an auteur—by the virtue of his knack for eccentricity and novelty—has had to borne the brunt of this naked opportunism: be it D.W. Griffith, Charles Chaplin, Orson Welles or Stanley Kubrick. Sergio Leone too had to pay collaterally by having to make five Westerns in order to get funding for his dream project, Once Upon a time in America (OUTA). OUTA is a masterpiece of epic proportions and is consummate on almost every level. The uniqueness of the movie is such that it can be looked upon from various angles with each perspective adding immensely to movie's substance and profundity. The movie not only transcends genres by making simultaneous forays into the realms of Crime, Drama, Mystery, Suspense and Fantasy, but also crosses on several occasions the fine line that separates Dream from Reality. At the beginning of his career, Leone got widely proclaimed as a master of technique and style as he added new dimensions to cinematography and screenplay. Leone's directorial debut was 'A Fistful of dollars'. Movie's success was marred when Akira Kurosawa sued the production house for plagiarizing Yojimbo. Leone bounced back with 'For a Few More Dollars'. He single-handedly reinvented the Western genre by providing a completely different perspective to the Old West, which was hitherto portrayed as the battle ground for the epic battle of virtue versus vice in the backdrop of chivalry and machismo. With 'The Good, the Bad and the Ugly', Leone perpetuated what would become his trademark: Spaghetti Western. Leone's distinctive style included juxtapositions, super close- ups, long continuous shots, and the rotating camera shots. Leone's collaboration with master-composer Ennio Morricone gave cinema some of its most mellifluous compositions. Once Upon a Time in the West elevated Leone from the position of a showman to a serious movie-maker—an auteur capable of much profound works. Leone refused a multitude of projects, including the opportunity to direct 'The Godfather', in a bid to realize his dream project.OUTA is an epic crime saga based on the lives of Jewish gangsters from their humble childhood in the ghettos of New York to their rise in world of organized crime. 'Noodles', 'Patsy', 'Cockeye', and little Dominic struggle as street kids in the East Side of Manhattan in the early 1920s. They work for 'Bugsy', a local gangster, until they meet 'Max' and decide to start an independent operation, triggering a series of incidents which changes their lives for ever. Robert De Niro as 'Noodles' gives one of the most subtle performances of his career. James Woods is chillingly menacing as 'Max'. Young 13-year-old Jennifer Connelly as 'Deborah' serves as a pulchritudinous delight for the sour eyes, and I say this as a testament to her ethereal, nymphean charm that was evident even at such a tender age. The rest of the cast gives a great support to the actors in lead with special mention of Elizabeth McGovern, James Hayden and Joe Pesci. The music is composed by Leone's long-time collaborator Ennio Morricone, who once again works his magic by creating music that is so plaintively divine that even Mozart would be proud of it. The film poignantly explores the themes of love, lust, friendship, greed, betrayal and loss of innocence in the backdrop of the 20th century America. For the European release, Leone cut down his original version to 229 minutes to appease the distributors. However, for the US release, OUTA was ignominiously edited down to 139 minutes by the muddle-headed studio personnel against the director's wishes. In this short version, the flashback narrative was omitted as the scenes were put back in the chronological order. Many of the movie's most beautiful shots are not present in the shorter version, including the nigh magical sequence in which time-switching is indicated by the conjuration of a Frisbee. Movie's abysmal show in the US is attributed to this sabotage. Leone was reportedly heartbroken by the American cut, and never made another film again.The dreamlike screenplay of OUTA gives it a lyrical, almost hypnotic feel. OUTA is a tapestry of highly complex mesh work: the story depicts the lives of same individuals across three different timelines. The time-switching techniques used in the movie are so effective that the switching seems absolutely seem-less. The mystical ringing tone that the viewer gets to hear in the beginning of the movie provides a great subterfuge in unison with the dream-like finale, and adds surrealistic elements to the movie by raising doubts that the events depicted in the movie could well have been a part of a drug-induced dream that Noodles would have been experiencing under the hypnotic effect of opium. The movie has a multitude of unforgettable moments, which can be cherished again and again with the same levels of indulgence. The sequence in which little Dominic—caught between the want to satiate his newly attained puberty and the fundamental urges—buys a pastry to charm a neighborhood girl, but succumbs to the universal temptation and ends up eating it himself is pure gold. The scene which depicts Robert De Niro molesting his childhood love represents cinema at its most macabre. The make-up, set designing and costume designing are all top- notch. The make-up artists have gone about their business with such meticulousness that the actors seem to genuinely represent their character's age in each era. Overall, OUTA is a testament to Sergio Leone's dedication to the free spirit of Art. It succeeds at multiple levels and makes the viewer go through an entire gamut of emotions, keeping him engaged throughout. It is sanguinary and is surfeited with blood-cuddling violence that makes it unsuitable for the weak-hearted. OUTA, however, is as a must for the enthusiasts of the genre and the cineastes worldwide. 10/10http://www.apotpourriofvestiges.com/"
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1224988",
      "warningSpoilers": false,
      "date": "26 November 2005",
      "rate": "8",
      "helpful": "150 out of 247 found this helpful.",
      "title": "Leone's \"Godfather\" Version, And About As Good",
      "content": "This Godfather-type film was done by Sergio Leone, of spaghetti-western fame, so you know you will see and experience several of his trademarks. Namely: (1) a lot of facial closeups; (2) some slow-motion or slow-moving dramatic scenes; (3) good overall photography and (4) a unique soundtrack.The period sets here are magnificent. You get a real feel of the time, whether it's 1910, 1933 or 1967. The colors are awash in blacks, browns and grays and the DVD brings all these out very well, especially considering the film is over 20 years old.Despite some of Leone's slow moments, this is a fascinating film to watch for the story, too. There are numerous memorable scenes, some of them involving some downright shocking violence, even for today's movies. However, the amount of violence is less than what you see today.The movie also sports an interesting twist near the end involving the two major characters, played by Robert De Niro and James Woods. The story is not always clear, either, so be prepared to be possibly confused about a few things....at least on the first viewing. Confused or not, this film always is fascinating to view, especially with intense actors such as the two men just mentioned, along with Elizabeth McGovern, Tuesday Weld, Joe Pecsi, Burt Young, Treat Williams and more.The child actors in here take up almost half the movie and are excellent. What an injustice they don't receive any publicity for their acting, especially the kids who played De Niro and Woods as youngsters. One of the girls has become a famous adult actress: Jennifer Connelly. She was 12 years old in this film and was already alluring.This is Godfather-type crime movie that ranks right up there with that famous film, not taking a back seat to it at all."
    },
    {
      "username": "PCT1970",
      "userUrl": "https://www.imdb.com/user/ur99519886",
      "reviewLink": "https://www.imdb.com/review/rw4837130",
      "warningSpoilers": false,
      "date": "8 May 2019",
      "rate": "8",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Leone Doing What He Does Best",
      "content": "Leone helms a virtuous epic film in the crime / drama genre. This film has excellent direction, screenplay, editing, cinematography, score and acting. There are many famous artists involved in this film and they deliver superlative and realistic performances. De Niro and Woods in particular are superb. The plot revolves around a former gangster, Noodles, who returns to New York after disappearing four decades earlier to start a new life and for other reasons. The plot initially hints as to why Noodles left New York, but after his return we learn the entire story as seen through his own flashbacks. We see Noodles and his friends growing up in a Jewish slum in New York's Lower East Side. Noodles, a natural leader, rises to bootlegger and ultimately a Mafia boss. This does not come without violence, betrayal and remorse. The film does a magnificent job examining all of the characters and what makes them tick. The plot is gripping, intense, violent, gritty, bloody, duplicitous and has a cathartic ending. This is a sprawling story and thus turns into a lengthy and entertaining film which Leone is known for to begin with. It is a masterful work of art, memorable, timeless and a classic. This film takes a different path, as far as the storyline, than most traditional gangster films which is refreshing. This viewer has revisited this film many times and in my opinion it is bravura in it's genre and holds it's own with the other celebrated gangster / mob films."
    },
    {
      "username": "goggy turk",
      "userUrl": "https://www.imdb.com/user/ur0498263",
      "reviewLink": "https://www.imdb.com/review/rw0213633",
      "warningSpoilers": false,
      "date": "25 December 2000",
      "rate": "10",
      "helpful": "21 out of 24 found this helpful.",
      "title": "Beautiful, elegaic storytelling",
      "content": "I decided, on Christmas Eve, to reacquaint myself with an old friend- Sergio Leone's heavyweight gangster epic, which I had previously watched in two sittings, 10 years previously, at Uni.I was rewarded with a movie of tremendous vision and creative style as well as emotional integrity. When you take an idiosyncratic, brilliant, stylish director like Leone, his composer counterpart, Morricone, and a cast including two of the foremost actors of their generation (de Niro and Woods) then you have an idea of the kind of quality this film has. In fact, the only gangster movie(s) I've seen that match it are the first two Godfathers (in fact Leone almost directed those too... now that would have been interesting).In contrast to earlier Leone Westerns, the characters are more fully developed- although the detachment of the characters in these movies made for a more rollercoaster, loose style of cinema, no one was ever going to win an award appearing in one, although they were all great movies.Although I could tell I was in a Leone movie almost from the beginning, what was different was the inner lives of the characters dictated the way the plot flowed in a pleasing way. I also think that the performance de Niro put in was the best of any film I've seen him in, and that includes any Scorcese picture. To make the audience actually care about a character who does such evil (including raping the woman he loves) is a towering achievement. The apparent effortlessness with which he achieves this is a mark of true greatness. Leone's style of filmmaking, with its long silences and pauses and (in this case) slow pace suit de Niro's style of acting perfectly. It's a real pity that they never had the chance to work together again.I think this a great film, and, at 3 3/4 hours, it kept me at least interested and often gripped all the way through. Why are Hollywood studios scared of movies like this? Some people out there love them."
    },
    {
      "username": "petra_ste",
      "userUrl": "https://www.imdb.com/user/ur15445210",
      "reviewLink": "https://www.imdb.com/review/rw3060312",
      "warningSpoilers": true,
      "date": "31 July 2014",
      "rate": "8",
      "helpful": "14 out of 18 found this helpful.",
      "title": "Dark Leone",
      "content": "Sergio Leone made epic cinema - he understood events resonate only when you set them up properly.In the 4 hours extended edition of Once Upon a Time in America, it's forty minutes before the first flashback to the initial storyline kicks in, with the protagonists as members of a teenage gang roaming the streets of early 20th century New York; it's a whole hour before Noodles (played as a child by Scott Tiler, as an adult by Robert De Niro in one of his iconic performances) meets Max (Rusty Jacobs / James Woods, never better), his criminal partner.Leone's darkest movie - where his trademark male friendships are betrayed and broken - Once Upon a Time in America has a complex structure jumping back and forth in time, following Noodles' meteoric rise and fall during the Prohibition era as he poisons the relationships with his best friend Max and the only woman he loves, Deborah (Jennifer Connelly in a great cinematic debut / Elizabeth McGovern).As an aside, while I loathe sexual violence in movies, the rape scene in this film, although highly disturbing, is among the rare ones not included for cheap sleazy drama but necessary character-wise: Noodles has become so accustomed to violence, he cannot cope with Deborah's refusal and hurts one of the few people he genuinely cares about. The criminal life brings the wealth with which he attempts to win her over, but eventually ruins her life and turns Noodles himself into a miserable, lonely man full of regrets.Classic Leone themes - like the inherent violence of civilized society in general and of business in particular - are given a darker spin. Max morphs into a businessman / politician involved in the higher spheres of crime, someone who doesn't get his hands dirty (like Morton in Once Upon a Time in the West), severing his ties with Noodles until he chooses his own karmic comeuppance.Or is the whole story an opium-induced hallucination by Noodles as a young man? It's possible, but besides the point: the ending is a way to show Noodles trapped into his own self-inflicted nightmare of violence and betrayal."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2366475",
      "warningSpoilers": false,
      "date": "9 January 2011",
      "rate": "10",
      "helpful": "29 out of 45 found this helpful.",
      "title": "Extraordinary crime drama",
      "content": "I have seen many movies, good and bad. One thing for certain, Once Upon a Time in America is more than good. It is amazing, a true milestone in the crime drama genre. The cinematography, images, scenery and locations are all superb and quite sweeping, while Ennio Morricone's score ranks up there with his very best. While the film clocks in at nearly four hours long, it never feels boring to me while the pace is quite elegiac everything else just compels you. I will admit, this is another film you need to see more than once to understand/appreciate it.Sergio Leone's direction is also superb, the story is always compelling and rich and the dialogue is very thought-provoking. The characters are wonderful if different. Unlike The Godfather(not a bad thing by the way), Once Upon a Time in America doesn't make you feel sympathy for its characters, these characters are actually quite nasty people but the way they are written and acted makes them compelling too. The two rape scenes are very shocking and perhaps brutal, but again that's no flaw in any way, because this slant on crime and the like is quite realistic if you put it in perspective.The acting is another strong asset. Robert DeNiro and James Woods, both are great actors, and both give brilliant performances. So overall, extraordinary, not only of its genre but of film full-stop. 10/10 Bethany Cox"
    },
    {
      "username": "mark-whait",
      "userUrl": "https://www.imdb.com/user/ur22397912",
      "reviewLink": "https://www.imdb.com/review/rw2412685",
      "warningSpoilers": true,
      "date": "12 April 2011",
      "rate": "10",
      "helpful": "33 out of 43 found this helpful.",
      "title": "Leone classic will live on for decades",
      "content": "Master of the Western Sergio Leone swapped Clint Eastwood for Robert DeNiro, Cowboys for Gangsters and the Wild West for an even wilder New York, with this seminal masterpiece. It was Leone's last film before his tragically early death at just 60, and although he was working on a big budget World War II film at the time of his demise, in a way that is tragically fitting as no film could have topped this one. Of course, whilst Leone naturally made his name in the sixties with the infamous Spaghetti western, the sheer sprawling grandeur of OUATIA is an unforgettable experience that attacks the senses. From the opening image of Robert DeNiro's opium filled body to the final scene some 229 minutes later, the sensation carries on throughout and hits home more powerfully than any cheroot-chewing Clint or twanging Morricone soundtrack ever did. DeNiro plays 'Noodles', a young man who grew up with his compatriots in Prohibition America, who then returns to his old haunts three decades later to reflect on his life as a hard-bitten gangster. Every scene is pitch perfect, and whilst there are some caps doffed to the likes of The Godfather, Leone doesn't hold back with scenes of rape, murder and brutality that give the film an edge sharper than a month's worth of Eastwood stubble. It's amazing in that Leone was returning to the helm of a movie for the first time in over a decade - there is no let up in the brilliance and certainly no signs of rustiness. And legendary collaborator Morricone is also back in tandem. Morricone delivers one of his most mesmerising scores and it was reported that DeNiro demanded some music be pre-written for scenes and then played back whilst they were being shot just so he could pitch the mood of his character. It's hard to say that this is Morricone's best work because his career is generously decorated with brilliant soundtracks, but it's also the case that 'Deborah's Theme', for example, is even played at funerals these days, such is the power of the music. Even Lennon and McCartney's 'Yesterday' gets an airing. James Woods and Elizabeth McGovern provide faultless support from the cast, but this is a movie of colossal brilliance and will rightfully live on for many decades to come."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw1301222",
      "warningSpoilers": false,
      "date": "26 February 2006",
      "rate": "10",
      "helpful": "27 out of 42 found this helpful.",
      "title": "Sergio Leone's grand ambition.",
      "content": "After so many years of westerns, Sergio Leone made \"Once Upon a Time in America\", about several friends forced to abandon their loyalty as they age. This is one of those movies that's too hard to simply describe; you really have to see it to understand it. And you may be disappointed if you expect something exactly like \"The Godfather\"; they are gangsters, but they're Jewish, so that changes things a little.If absolutely nothing else, this disproves the notion that we have nowadays that historical epics are always pieces of drudgery (blame \"Alexander\" for that stereotype). \"OUATIA\" is the sort of movie that could only star people like Robert DeNiro. It also stars James Woods, Joe Pesci, Elizabeth McGovern, Treat Williams, and Jennifer Connelly (in her debut), and they all do a great job. This movie is a masterpiece in every way. But don't take my word for it; see for yourself."
    },
    {
      "username": "BA_Harrison",
      "userUrl": "https://www.imdb.com/user/ur0945066",
      "reviewLink": "https://www.imdb.com/review/rw3367400",
      "warningSpoilers": false,
      "date": "6 December 2015",
      "rate": "9",
      "helpful": "16 out of 23 found this helpful.",
      "title": "Leone's gangster masterpiece.",
      "content": "Director Sergio Leone is best known for his classic spaghetti westerns, but for my money, his final movie, gangster epic Once Upon A Time In America, is his most accomplished work. With a running time of 229 minutes (more if you're watching the Extended Director's Cut), it's longer than either Once Upon A Time in the West or The Good The Bad and The Ugly, and it's pacing is just as measured (some might say 'slow'), but the time passes far less painfully, so engaging are the characters and the drama that unfolds.Spanning decades, the story is truly monumental: it opens in the late 1960s with ageing gangster Noodles (Robert De Niro) returning to the Lower East Side of Manhattan after thirty-five years in hiding, and then proceeds to cut back and forth between the present and the past to show his life as a young boy in an impoverished Jewish ghetto, as a tough gangster during the Prohibition period, and as an old man reacquainting himself with old friends. This skillful technique helps to keep the viewer engrossed long after their bum has gone numb, but fine performances from a stellar cast (which includes James Woods, Joe Pesci, Danny Aiello, and a young Jennifer Connelly), excellent cinematography, and some brilliantly executed scenes of brutal violence, all accompanied by a wonderfully haunting pan flute score by the brilliant Ennio Morricone, help to ensure that nodding off is unlikely."
    },
    {
      "username": "sauravjoshi85",
      "userUrl": "https://www.imdb.com/user/ur47100167",
      "reviewLink": "https://www.imdb.com/review/rw6859251",
      "warningSpoilers": false,
      "date": "28 April 2021",
      "rate": "9",
      "helpful": "12 out of 16 found this helpful.",
      "title": "A classic by one of the greatest director of all time the great Late Sergio Leone",
      "content": "Once upon a time in America is an epic crime drama movie directed by Late Sergio Leone and stars Robert De Niro, James Woods, Elizabeth McGovern, Joe Pesci, Burt Young, Tuesday Weld, James Hayden, William Forsythe and Treat Williams with Larry Rapp.This movie must be termed as another Gem by the great Leone and in this movie he depicts the from early to middle of 20th Century pure perfectly be it the vehicles, dressing style or buildings the changes has been depicted superbly.The movie showcases the life of two friends, their friendship, their rise, fall, betrayal and greed for power. The characters are introduced very nicely by the director and since the movie is 3.49 hours long the director has ample time to showcase all the details and trust me neither the movie nor the direction or the screenplay will disappoint you.Acting is superb and once again Robert De Niro steals the show in the character of Noodles, he is a talented actor and a seasoned director like Leone has just adored the talent. James Woods has also been quite effective, rest of the cast were equally impressive.Screenplay of the movie is slow but effective and will not loose the grip from the movie, most of the scenes are so beautifully shot that it looks realistic. Climax of the movie is strong. Another strong aspect of the Leone's movie is it's music and the music in this movie is quite amazing.This was the final movie directed by the great Sergio Leone and we can witness the greatness of his work till the last movie he directed. The great Leone is now not between us but he will always be immortal with his stupendous work. My tribute to him."
    },
    {
      "username": "boardertrash",
      "userUrl": "https://www.imdb.com/user/ur34364708",
      "reviewLink": "https://www.imdb.com/review/rw7479728",
      "warningSpoilers": false,
      "date": "25 October 2021",
      "rate": "9",
      "helpful": "29 out of 36 found this helpful.",
      "title": "Ignore the bad reviews, I was once one of those",
      "content": "You know what, I have to eat humble pie here because once upon a time, when I first saw this film as a young adult I didn't think much of it.I'd have reviewed it saying it was overly long, not enough action and a bit boring.How times have changed! Where once I'd have rated Goodfellas was the better film I now most definitely think otherwise. Don't get me wrong GF is a great film but it's not one of the greats, I think Goodfellas is more of a quick gangster fix, definitely the first of a modern breed of blunt instrument Gangland films, ones which are full of brash characters, lots of gruesome killing and a hit parade soundtrack.Once upon a time in America is the opposite, a carefully crafted and honed (near) masterpiece of cinematic character storytelling. You feel part of what you're watching, transported back to a different era. Just half a step behind The Godfather in my estimation.This is a joy to watch again and no doubt I'll watch it many more times. Ignore the negative reviews stating it's boring, no doubt mainly Millennials with the attention span of a Gnat."
    },
    {
      "username": "RobertCartland",
      "userUrl": "https://www.imdb.com/user/ur0576805",
      "reviewLink": "https://www.imdb.com/review/rw0213604",
      "warningSpoilers": false,
      "date": "17 January 2000",
      "rate": "10",
      "helpful": "300 out of 422 found this helpful.",
      "title": "A Profound Expression of Truth Regarding Friendship andBetrayal",
      "content": "This film is a profound expression of truth regarding friendship and betrayal. Noodles, played by Robert De Niro and Scott Tiler (during childhood), is a simple man and a thug with one credo: you can battle the entire world but you never betray a friend. During the course of this film we experience various pieces of Noodles's life, from childhood, through young adulthood and old age. We learn what happens to his friends, his foes and the love of his life, Deborah. The time span considered is long, including Noodles's childhood shortly after the turn of the century, through the prohibition era, and finally the 1960's.The film is about relationships; the many years Noodles spends away from his friends receive only a cursory mention. The film, like life and memories, unfolds slowly and reflectively. Sergio Leone's cuts are long and each scene is beautifully amplified my Ennio Morricone's haunting score. The story is not told chronologically. Instead, the chapters of the story are slowly revealed like pieces of a great jigsaw puzzle. Each delicious piece might make us laugh, or cry, or smile, or feel shock. But, as each piece falls into place, a mystery unfolds. When the final piece is revealed, the true essence of the story becomes clear and a sad and beautiful tapestry comes into view.This film is a true masterpiece, expressing a profound statement about friendship and betrayal, with fantastic acting, writing, directing and music. There is a shortened, two-and-a-half-hour version of the film released that is a disaster. It is like trying to understand a jigsaw puzzle with half of the pieces missing. The original four-hour film can be viewed and enjoyed several times and each time the viewer will see something new."
    },
    {
      "username": "oldguybc",
      "userUrl": "https://www.imdb.com/user/ur4547644",
      "reviewLink": "https://www.imdb.com/review/rw0997403",
      "warningSpoilers": false,
      "date": "11 January 2005",
      "rate": "10",
      "helpful": "544 out of 791 found this helpful.",
      "title": "A masterpiece and an atrocity!",
      "content": "This movie was a masterpiece. It ranks as one of the very best in film history, if not the best. At Cannes people yelled and screamed, couldn't believe just how good it was. The profound atrocity was a combination of two completely brainless acts, the first being Zack Stienberg's hatchet job for US release, supposedly requested by either Warner Bros or The Ladd Company (one blames the other now) and the second was the lack of anyone (and everyone)to post anything in this great film for Academy Award consideration, of which probably as many as 14 nominations and 4 sure- fire Oscars went down the toilet. These atrocities were perpretrated, I believe, with two reasons in mind, the first to preserve the dim hope of \"The Killing Fields\" (Daly & Semel's baby) of garnering any awards... and second, to try to boost up the non- foreign chances. Warner Bros knew just how good it was, that goes without saying. The problem was... they already had their share of cash cows and they wanted a real star- studded showpiece to point at. The small minds already had their showpiece but, alas, it was an \"eye- tallyan\" flick with a producer/director who didn't communicate well. The hatchet job was carefully planned, I believe... the so- called \"sneak preview\" was done in Canada and not well received, probably due to the fact that the sound system was over- amped and the film 'broke' 3 or 4 times during the showing, what a farce! The awards snub started with the GGs and carried right thru. What a myriad of stupid and utterly pointless decisions! Must have literally tore Leone's heart out when he learned what they had done. Morricone's score was a sure- thing Oscar, no question about it. DeNiro and maybe even Woods would have fought it out for best actor, Tuesday Weld as supporting actress, any one of 4 or 5 other supporting actors & actresses, most notably William Forsythe, cinematography, film editing, the list goes on & on... (best picture...Amadeus???? give me a break!!) Just what in the hell were they thinking? Saw it in a theater 20 years ago and then again on TV about 1998 and finally in its correct format(on DVD) about two years ago and again last week at a friend's house. Stirred up all those angry thoughts all over again... sorry about that, getting' old & crotchety."
    },
    {
      "username": "chron",
      "userUrl": "https://www.imdb.com/user/ur0200029",
      "reviewLink": "https://www.imdb.com/review/rw0213632",
      "warningSpoilers": false,
      "date": "19 November 2000",
      "rate": "10",
      "helpful": "13 out of 17 found this helpful.",
      "title": "Complex and Gripping. The Definitive Gangster Movie",
      "content": "This is an exceptional movie. The progression throughout the lives of these people makes for a compelling, well-written movie. The acting and direction are fantastic.Most people consider \"The Godfather\" to be a definitive gangster movie, but I liked this more. It was a more interesting story and considerably more violent.If you look for this movie, ensure that you get the long version. The American version cut out several minutes and ordered the story in chronological order. The long version requires more from the audience to track what is going on, but makes for a more interesting movie.Why isn't this out on DVD!?!"
    },
    {
      "username": "thetyvonlesure",
      "userUrl": "https://www.imdb.com/user/ur99708365",
      "reviewLink": "https://www.imdb.com/review/rw5062225",
      "warningSpoilers": false,
      "date": "16 August 2019",
      "rate": "8",
      "helpful": "8 out of 9 found this helpful.",
      "title": "A Mob Movie Art Piece",
      "content": "Sergio Leone's Once Upon a Time in America (3 hour and 49 minute version) is a beautifully paced art piece. The film jumps between time periods, masterfully blending three different zeitgeists. The detail placed in this film is brilliant. The story takes its' time to get where it needed to be. While the film is long, it feels as if there's more than one movie within this film. Leone makes the film feel like a trilogy or bilogy of sorts, when he tells different stories from multiple eras. The set/environments of the film are very stylish. The set and environment expand and become more vibrant with the story overtime. Leone successfully transitions us from a period of immigrants in New York in the early 1900s, to the prohibition era, to a more modern period. The film tells a different story of America for a specific group. As these characters grow, so does the country and its' conflict. The characters within this film are very relatable, in the sense that their lives represent our elevation or descent into our later years. Despite their deplorable actions, the characters are all charismatic and engaging. The dialogue between characters is natural. The acting in this film is great. The younger cast and their older counterparts transition these characters in a cohesive manner. It's as if you're actually watching the younger cast grow into their older selves. Robert De Niro and James Woods do a fantastic job in their roles. Their acting is phenomenal. The cinematography is great, with shots that feel as if they were ripped from a Picasso painting or a Michelangelo sculpture. The shots in this film are masterful, with few exceptions. The storytelling keeps you engaged for the most part. The only exception is after the intermission. After the intermission, the film feels a little boring and fruitless at times. It could have been done in a manner of ease, however it feels crammed in with the rest of the film. The film is very long (depending on what version you watch). However, it's a great film. Overall, Once Upon a Time in America is a classic mob movie that encompasses an artistic vision with timeless storytelling."
    }
  ],
  "errorMessage": ""
}