{
  "imDbId": "tt0087843",
  "title": "Once Upon a Time in America",
  "fullTitle": "Once Upon a Time in America (1984)",
  "type": "Movie",
  "year": "1984",
  "language": "en",
  "titleInLanguage": "Once Upon a Time in America",
  "url": "https://en.wikipedia.org/wiki/Once_Upon_a_Time_in_America",
  "plotShort": {
    "plainText": "Once Upon a Time in America (Italian: C'era una volta in America) is a 1984 epic crime film co-written and directed by Italian filmmaker Sergio Leone and starring Robert De Niro and James Woods. The film is an Italian–American venture produced by The Ladd Company, Embassy International Pictures, PSO Enterprises, and Rafran Cinematografica, and distributed by Warner Bros. Based on Harry Grey's novel The Hoods, it chronicles the lives of best friends David \"Noodles\" Aaronson and Maximilian \"Max\" Bercovicz as they lead a group of Jewish ghetto youths who rise to prominence as Jewish gangsters in New York City's world of organized crime. The film explores themes of childhood friendships, love, lust, greed, betrayal, loss, broken relationships, together with the rise of mobsters in American society.\r\nIt was the final film directed by Leone before his death five years later, and the first feature film he had directed in 13 years. It is also the third film of Leone's Once Upon a Time Trilogy, which includes Once Upon a Time in the West (1968) and Duck, You Sucker! (1971). The cinematography was by Tonino Delli Colli, and the film score by Ennio Morricone. Leone originally envisaged two three-hour films, then a single 269-minute (4 hours and 29 minutes) version, but was convinced by distributors to shorten it to 229 minutes (3 hours and 49 minutes). The American distributors, The Ladd Company, further shortened it to 139 minutes (2 hours and 19 minutes), and rearranged the scenes into chronological order, without Leone's involvement.\r\nThe shortened version was a critical and commercial flop in the United States, and critics who had seen both versions harshly condemned the changes that were made. The original \"European cut\" has remained a critical favorite and frequently appears in lists of the greatest films of all time, especially in the gangster genre.",
    "html": "<p>Once Upon a Time in America (Italian: C'era una volta in America) is a 1984 epic crime film co-written and directed by Italian filmmaker Sergio Leone and starring Robert De Niro and James Woods. The film is an Italian–American venture produced by The Ladd Company, Embassy International Pictures, PSO Enterprises, and Rafran Cinematografica, and distributed by Warner Bros. Based on Harry Grey's novel The Hoods, it chronicles the lives of best friends David \"Noodles\" Aaronson and Maximilian \"Max\" Bercovicz as they lead a group of Jewish ghetto youths who rise to prominence as Jewish gangsters in New York City's world of organized crime. The film explores themes of childhood friendships, love, lust, greed, betrayal, loss, broken relationships, together with the rise of mobsters in American society.</p><p>It was the final film directed by Leone before his death five years later, and the first feature film he had directed in 13 years. It is also the third film of Leone's Once Upon a Time Trilogy, which includes Once Upon a Time in the West (1968) and Duck, You Sucker! (1971). The cinematography was by Tonino Delli Colli, and the film score by Ennio Morricone. Leone originally envisaged two three-hour films, then a single 269-minute (4 hours and 29 minutes) version, but was convinced by distributors to shorten it to 229 minutes (3 hours and 49 minutes). The American distributors, The Ladd Company, further shortened it to 139 minutes (2 hours and 19 minutes), and rearranged the scenes into chronological order, without Leone's involvement.</p><p>The shortened version was a critical and commercial flop in the United States, and critics who had seen both versions harshly condemned the changes that were made. The original \"European cut\" has remained a critical favorite and frequently appears in lists of the greatest films of all time, especially in the gangster genre.</p>"
  },
  "plotFull": {
    "plainText": "Once Upon a Time in America (Italian: C'era una volta in America) is a 1984 epic crime film co-written and directed by Italian filmmaker Sergio Leone and starring Robert De Niro and James Woods. The film is an Italian–American venture produced by The Ladd Company, Embassy International Pictures, PSO Enterprises, and Rafran Cinematografica, and distributed by Warner Bros. Based on Harry Grey's novel The Hoods, it chronicles the lives of best friends David \"Noodles\" Aaronson and Maximilian \"Max\" Bercovicz as they lead a group of Jewish ghetto youths who rise to prominence as Jewish gangsters in New York City's world of organized crime. The film explores themes of childhood friendships, love, lust, greed, betrayal, loss, broken relationships, together with the rise of mobsters in American society.\r\nIt was the final film directed by Leone before his death five years later, and the first feature film he had directed in 13 years. It is also the third film of Leone's Once Upon a Time Trilogy, which includes Once Upon a Time in the West (1968) and Duck, You Sucker! (1971). The cinematography was by Tonino Delli Colli, and the film score by Ennio Morricone. Leone originally envisaged two three-hour films, then a single 269-minute (4 hours and 29 minutes) version, but was convinced by distributors to shorten it to 229 minutes (3 hours and 49 minutes). The American distributors, The Ladd Company, further shortened it to 139 minutes (2 hours and 19 minutes), and rearranged the scenes into chronological order, without Leone's involvement.\r\nThe shortened version was a critical and commercial flop in the United States, and critics who had seen both versions harshly condemned the changes that were made. The original \"European cut\" has remained a critical favorite and frequently appears in lists of the greatest films of all time, especially in the gangster genre.\r\nPlot\r\nIn 1933, three thugs search for a man named \"Noodles\", torturing people for information. They enter a wayang theater, where the proprietors slip into a hidden opium den within the building and warn Noodles. He is apathetic, drugged and grasping a newspaper featuring the demise of bootleggers Patrick Goldberg, Philip Stein and Maximilian Bercovicz. He recalls observing police removing their corpses, Max's burned beyond recognition. Noodles evades capture and leaves the city alone and penniless.\r\nIn 1918, David \"Noodles\" Aaronson and his friends \"Patsy\" Goldberg, \"Cockeye\" Stein and Dominic struggle as street kids in Manhattan's Lower East Side, committing petty crimes for local boss Bugsy. Max foils one of their robberies but has the booty stolen from him by a corrupt police officer, Whitey. Later, they blackmail the officer, catching him having sex with Peggy, a prostitute, and the five youngsters start a gang with the same level of police protection as Bugsy. Max and Noodles become best friends.\r\nThe group rises through the ranks after implementing Noodles' idea to hide bootleg liquor. They stash half their earnings in a railway station locker, giving the key to \"Fat Moe\", a friend not directly involved in their activities. Noodles is in love with Moe's sister, Deborah, who dreams of becoming a dancer and actress. Bugsy, now a rival, eventually ambushes the boys and shoots Dominic, who dies in Noodles' arms. In a fit of rage, Noodles kills Bugsy and injures a police officer, and is sentenced to prison.\r\nNoodles is released in 1930 and rejoins his friends, now prosperous bootleggers during Prohibition. His first job with them is a diamond heist using a jewelry employee and occasional prostitute named Carol as their informant. During the robbery, Carol goads Noodles into hitting her, after which he rapes her; she later goes on to become Max's moll. That the job had been commissioned by a Syndicate figure to eliminate the competition sits badly with Noodles who, unlike Max, dislikes hierarchy and lacks political ambition. The gang provides protection for Teamsters' union boss Jimmy O'Donnell, but Noodles later rejects Max's plan to deepen those ties.\r\nSeeking to form a genuine intimacy with Deborah, Noodles takes her on a lavish date, where she reveals her plans to pursue a career in Hollywood. On their drive back, a frustrated Noodles rapes her in the limousine. He is later met with Deborah's aloofness when he watches her board the train to California.\r\nThe gang's success ends with the 1933 repeal of Prohibition. Max suggests a New York Federal Reserve Bank heist, which Noodles and Carol deem a suicide mission. Carol convinces Noodles to inform the police about a lesser offense, hoping brief incarceration will cool off Max's ambition. After Noodles calls the police, Max knocks him out during a seemingly impromptu argument. This leads to the events shown in the prologue: upon regaining consciousness and learning that Max, Patsy, and Cockeye have been killed by the police, a guilt-ridden Noodles hides in the opium den. He saves Moe but finds out that his new girlfriend Eve has been murdered and the railway locker money has disappeared. With his gang killed and himself hunted by Syndicate thugs, Noodles settles in Buffalo under an alias.\r\nIn 1968, Noodles is belatedly informed that the Beth Israel Cemetery is being redeveloped, and asked to rebury any loved ones. Upon inquiry, the rabbi who had sent the letter informs him that the bodies of his three dead friends have since been relocated to Riverdale. Realizing that someone has deduced his identity, Noodles returns to Manhattan and stays with Moe. Inside the Riverdale mausoleum, Noodles finds a key to the railway locker. The caption on the commemorative plaque falsely states that the mausoleum was erected by Noodles himself.\r\nThe locker reveals a suitcase full of money, and a note stating this is a downpayment on his next job. Noodles watches news of an assassination attempt on controversial U.S. Secretary of Commerce Christopher Bailey. The report shows Jimmy O'Donnell, still a Teamsters boss, distancing himself from the Bailey corruption scandal. Noodles finds Carol in a retirement home run by the Bailey Foundation. She tells him that Max manipulated them into tipping him off to the police and opened fire first, wishing to die young rather than in an insane asylum like his father.\r\nAfter spotting her in the retirement home's dedication photo, Noodles tracks down Deborah, still an actress. He tells her about his invitation to a party at Bailey's mansion. Deborah admits to being Bailey's lover and begs Noodles to leave before he is confronted with hurtful revelations. Ignoring Deborah's advice, Noodles sees Bailey's son just outside, who evidently looks like a younger Max.\r\nAt the party, Noodles meets Bailey, who reveals he is actually Max and that he faked his death with the help of the police and Syndicate, stole the gang's money and reinvented himself as a self-made, Teamsters-connected politician. He confirms that he made Deborah his mistress years earlier. Faced with ruin and the specter of a Teamster assassination, Max reveals the job he has for Noodles is to kill him. Noodles, obstinately referring to him by his Bailey identity, refuses, explaining that in his eyes, Max died with the gang. As Noodles leaves the estate, a garbage truck starts up and a man, presumably Max, walks from the entrance toward Noodles until the truck passes between them. Noodles sees the truck's auger conveyor grinding garbage, but the man is nowhere to be seen.\r\nThe epilogue returns to 1933 with Noodles entering the opium den after his friends' deaths, taking the drug and broadly grinning.\r\nCast\r\nRobert De Niro as Noodles Scott Tiler as Young Noodles\r\nScott Tiler as Young Noodles\r\nJames Woods as Max Rusty Jacobs as Young Max/David Bailey\r\nRusty Jacobs as Young Max/David Bailey\r\nElizabeth McGovern as Deborah Jennifer Connelly as Young Deborah\r\nJennifer Connelly as Young Deborah\r\nJoe Pesci as Frankie Minaldi\r\nBurt Young as Joe\r\nTuesday Weld as Carol\r\nTreat Williams as Jimmy O'Donnell\r\nDanny Aiello as Police Chief Aiello\r\nRichard Bright as Chicken Joe\r\nJames Hayden as Patsy Brian Bloom as Young Patsy\r\nBrian Bloom as Young Patsy\r\nWilliam Forsythe as Cockeye Adrian Curran as Young Cockeye\r\nAdrian Curran as Young Cockeye\r\nDarlanne Fluegel as Eve\r\nLarry Rapp as Fat Moe Mike Monetti as Young Fat Moe\r\nMike Monetti as Young Fat Moe\r\nRichard Foronjy as Whitey\r\nRobert Harper as Sharkey\r\nDutch Miller as Van Linden\r\nGerard Murphy as Crowning\r\nAmy Ryder as Peggy Julie Cohen as Young Peggy\r\nJulie Cohen as Young Peggy\r\nEstelle Harris as Peggy's mother\r\nThe cast also includes Noah Moazezi as Dominic, James Russo as Bugsy, producer Arnon Milchan as Noodles' chauffeur, Marcia Jean Kurtz as Max's mother, Joey Faye as an \"Adorable Old Man\", and Olga Karlatos as a wayang patron. Frank Gio, Ray Dittrich and Mario Brega (a regular supporting actor in Leone's Dollars Trilogy) respectively appear as Beefy, Trigger and Mandy, a trio of gangsters who search for Noodles. Frequent De Niro collaborator Chuck Low and Leone's daughter Francesca respectively make uncredited appearances as Fat Moe and Deborah's father, and David Bailey's girlfriend. In the 2012 restoration, Louise Fletcher appears as the Cemetery Directress of Riverdale, where Noodles visits his friends' tomb in 1968.\r\nProduction\r\nDevelopment\r\nDuring the mid-1960s, Sergio Leone had read the novel The Hoods by Harry Grey, a pseudonym for the former gangster-turned-informant whose real name was Harry Goldberg. In 1968, after shooting Once Upon a Time in the West, Leone made many efforts to talk to Grey. Having enjoyed Leone's Dollars Trilogy, Grey finally responded and agreed to meet with Leone at a Manhattan bar. Following that initial meeting, Leone met with Grey several times throughout the remainder of the 1960s and 1970s, having discussions with him to understand America through Grey's point of view.\r\nIntent on making another trilogy about America consisting of Once Upon a Time in the West, Duck, You Sucker! and Once Upon a Time in America, Leone turned down an offer from Paramount Pictures to direct The Godfather in order to pursue his pet project. Elements of Norman Mailer's first two drafts of a commissioned screenplay that was later drafted would appear in the film.\r\nFilming\r\nThe filming of Once Upon a Time in America started in June 1982 and eventually ended in April the next year. The locations where the shooting took place were in and around US, Canada, Italy, and France, with a focal point in New York City. Interior scenes were mostly filmed at the Cinecittà Studios in Rome.\r\nThe beach scene, where Max unveils his plan to rob the Federal Reserve, was shot at The Don CeSar in St. Pete Beach, Florida. The New York's railway \"Grand Central Station\" scene in the thirties flashbacks was filmed in the Gare du Nord in Paris. The interiors of the lavish restaurant where Noodles takes Deborah on their date were shot in the Hotel Excelsior in Venice, Italy.\r\nEditing\r\nBy the end of filming, Leone had ten hours worth of footage. With his editor, Nino Baragli, Leone trimmed this to almost six hours, and he originally wanted to release the film in two parts. The producers refused, partly because of the commercial and critical failure of Bernardo Bertolucci's two-part 1900, and Leone was forced to further shorten it. The film was originally 269 minutes (4 hours and 29 minutes), but when the film premiered out of competition at the 1984 Cannes Film Festival, Leone had cut it to 229 minutes (3 hours and 49 minutes) to appease the distributors, which was the version shown in European cinemas.\r\nMusic\r\nThe musical score was composed by Leone's longtime collaborator Ennio Morricone. \"Deborah's Theme\" was written for another film in the 1970s but was rejected. The score is also notable for Morricone's incorporation of the music of Gheorghe Zamfir, who plays a pan flute. Zamfir's flute music was used to similar effect in Peter Weir's Picnic at Hanging Rock (1975). Morricone also collaborated with vocalist Edda Dell'Orso on the score.\r\nBesides the original music, the film used source music, including:\r\n\"God Bless America\" (written by Irving Berlin, performed by Kate Smith – 1943) – Plays over the opening credits from a radio in Eve's bedroom and briefly at the film's ending.\r\n\"Yesterday\" (written by Lennon–McCartney – 1965) – A Muzak version of this piece plays when Noodles first returns to New York in 1968, examining himself in a train station mirror. An instrumental version of the song also plays briefly during the dialogue scene between Noodles and \"Bailey\" towards the end of the film.\r\n\"Summertime\" (written by George Gershwin – 1935) An instrumental version of the aria from the opera Porgy and Bess is playing softly in the background as Noodles, just before leaving, explains to \"Secretary Bailey\" why he could never kill his friend.\r\n\"Amapola\" (written by Joseph Lacalle, American lyrics by Albert Gamse – 1923) – Originally an opera piece, several instrumental versions of this song were played during the film; a jazzy version, which was played on the gramophone danced to by young Deborah in 1918; a similar version played by Fat Moe's jazz band in the speakeasy in 1930; and a string version, during Noodles' date with Deborah. Both versions are available on the soundtrack.\r\nPart of the third theme from the overture to La gazza ladra (Gioachino Rossini – 1817) – Used during the baby-switching scene in the hospital.\r\n\"Night and Day\" (written and sung by Cole Porter – 1932) – Played by a jazz band during the beach scene before the beachgoers receive word of Prohibition's repeal, and during the party at the house of \"Secretary Bailey\" in 1968.\r\n\"St. James Infirmary Blues\" is used during the Prohibition \"funeral\" at the gang's speakeasy.\r\nA soundtrack album was released in 1984 by Mercury Records. This was followed by a special-edition release in 1995, featuring four additional tracks.\r\nRelease\r\nOnce Upon a Time in America premiered at the 1984 Cannes Film Festival on May 20, 1984. It received a raucous, record-breaking ovation of nearly 20 minutes after the screening (reportedly heard by diners at restaurants across the street from the Palais), at a time in Cannes's history before marathon applause became a regular occurrence. In the United States, a heavily edited version of the film received a wide release in 894 theaters on 1 June 1984, and grossed $2.4 million during its opening weekend. It ended its box office run with a gross of just over $5.3 million on a $30 million budget, and became a box office flop.\r\nNumerous women at the film's premiere reacted furiously, mostly due to the two rape sequences. One among them later confronted Robert De Niro in a press conference and made harsh comments to the film's depiction, describing it as \"blatant, gratuitous violence.\" In general, the rape scenes specifically were controversial. Richard Godden defended Leone's representation of rape that it \"articulates the dysfunction between bodies in images and bodies themselves.\" Elizabeth McGovern supported Godden's claim and said that Leone didn't intend to glamorize any \"violent sex\". In his book, Leone scholar Christopher Frayling argues that the movie's central gang are all emotionally stunted: \"... like small boys obsessed with their equipment who have no idea how to relate to flesh-and-blood women.\"\r\nVersions\r\nU.S. version\r\nThe film was shown in limited release and for film critics in North America, where it was slightly trimmed to secure an \"R\" rating. Cuts were made to two rape scenes and some of the more graphic violence at the beginning. Noodles' meeting with Bailey in 1968 was also excised. The film gained a mediocre reception at several sneak premieres in North America. Because of this early audience reaction, the fear of its length, its graphic violence, and the inability of theaters to have multiple showings in one day, The Ladd Company cut entire scenes and removed approximately 90 minutes of the film, without the supervision of Sergio Leone.\r\nThis American wide release (1984, 139 minutes) was drastically different from the European release, as the non-chronological story was rearranged into chronological order. Other major cuts involved many of the childhood sequences, making the adult 1933 sections more prominent. Noodles' 1968 meeting with Deborah was excised, and the scene with Bailey ends with him shooting himself (with the sound of a gunshot off screen) rather than the garbage truck conclusion of the 229-minute version. Sergio Leone's daughter, Raffaella Leone, said that Leone had dismissed the US version as not his own movie.\r\nUSSR\r\nIn the Soviet Union, the film was shown theatrically in the late 1980s, with other Hollywood blockbusters such as the two King Kong films. The story was rearranged in chronological order and the film was split in two, with the two parts shown as separate movies, one containing the childhood scenes and the other comprising the adulthood scenes. Despite the rearranging, no major scene deletions were made.\r\nRestored original\r\nIn March 2011, it was announced that Leone's original 269-minute version was to be re-created by a film lab in Italy under the supervision of Leone's children, who had acquired the Italian distribution rights, and the film's original sound editor, Fausto Ancillai, for a premiere in 2012 at either the Cannes Film Festival or Venice Film Festival.\r\nThe restored film premiered at the 2012 Cannes Film Festival, but because of unforeseen rights issues for the deleted scenes, the restoration had a runtime of only 251 minutes. However, Martin Scorsese (whose Film Foundation helped with the restoration) stated that he was helping Leone's children gain the rights to the final 24 minutes of deleted scenes to create a complete restoration of Leone's envisaged 269-minute version. On 3 August 2012, it was reported that after the premiere at Cannes, the restored film was pulled from circulation, pending further restoration work.\r\nHome media\r\nIn North America, a two-tape VHS was released by Warner Home Video with a runtime of 226 minutes in February 1985 and 1991. The U.S. theatrical cut was also released at the same time in February 1985. A two-disc special edition was released on 10 June 2003, featuring the 229-minute version of the film. This special edition was re-released on 11 January 2011, on both DVD and Blu-ray. On 30 September 2014, Warner Bros. released a two-disc Blu-ray and DVD set of the 251-minute restoration shown at the 2012 Cannes Film Festival, dubbed the Extended Director's Cut. This version was previously released in Italy, on 4 September 2012.\r\nCritical reception\r\nThe initial critical response to Once Upon a Time in America was mixed, because of the different versions released worldwide. While internationally the film was well received in its original form, American critics were much more dissatisfied with the 139-minute version released in North America. This condensed version was a critical and financial disaster, and many American critics who knew of Leone's original cut attacked the short version.\r\nSome critics compared shortening the film to shortening Richard Wagner's operas, saying that works of art that are meant to be long should be given the respect they deserve. In his 1984 review, Roger Ebert gave the uncut version four stars out of four and wrote that it was \"an epic poem of violence and greed\", but described the American theatrical version as a \"travesty\". Furthermore, he gave the American theatrical version one star out of four, calling it \"an incomprehensible mess without texture, timing, mood, or sense.\" Ebert's television film critic partner Gene Siskel considered the uncut version to be the best film of 1984 and the shortened, linear studio version to be the worst film of 1984. Vincent Canby of The New York Times criticized the nonlinear narrative that is structured throughout the film.\r\nIt was only after Leone's death and the subsequent restoration of the original version that critics began to give it the kind of praise displayed at its original Cannes showing. The uncut original film is considered to be far superior to the edited version released in the U.S. in 1984. Ebert, in his review of Brian De Palma's The Untouchables, called the original uncut version of Once Upon a Time in America the best film depicting the Prohibition era. James Woods, who considers it to be Leone's finest film, mentioned in the DVD documentary that one critic dubbed the film the worst of 1984, only to see the original cut years later and call it the best of the 1980s. Some were critical towards the movie's graphic violence and cruelty, with Donald Clarke of The Irish Times condemning it as a \"fistful of misogyny\" and offensively \"sexist\".\r\nOn the review aggregator website Rotten Tomatoes, Once Upon a Time in America has an approval rating of 87% based on 55 reviews, with an average score of 8.50/10. The website's critic consensus reads, \"Sergio Leone's epic crime drama is visually stunning, stylistically bold, and emotionally haunting, and filled with great performances from the likes of Robert De Niro and James Woods.\" On Metacritic, the film has a weighted average score of 75 out of 100 based on reviews from 20 critics, indicating \"generally favorable reviews\".\r\nThe film has since been ranked as one of the best films of the gangster genre. When Sight & Sound asked several UK critics in 2002 what their favorite films of the last 25 years were, Once Upon a Time in America placed at number 10. In 2015, the film was ranked at number nine on Time Out's list of the 50 best gangster films of all time, while in 2021, The Guardian cited it as the fourth greatest mobster film ever made.\r\nAccolades\r\nUnlike its modern critical success, the initial American release did not fare well with critics and received no Academy Award nominations. The film's music was disqualified from Oscar consideration for a technicality, as the studio accidentally omitted the composer's name from the opening credits when trimming its running time for the American release.\r\nInterpretations\r\nAs the film begins and ends in 1933, with Noodles hiding in an opium den from syndicate hitmen, and the last shot of the film is of Noodles in a smiling, opium-soaked high, the film can be interpreted as having been a drug-induced dream, with Noodles remembering his past and envisioning the future. In an interview by Noël Simsolo published in 1987, Leone lent support to this interpretation, saying that the scenes set in the 1960s could be seen as an opium dream of Noodles'. In the DVD commentary for the film, film historian and critic Richard Schickel states that opium users often report vivid dreams, and that these visions have a tendency to explore the user's past and future.\r\nThe ending in which Max appears as Noodles is leaving Bailey's mansion and then suddenly disappears behind a truck only for Noodles to see the blades of the truck spinning, was reportedly left ambiguous on purpose. James Woods, who played Max, stated that he does not know if Max jumped in the truck or just disappeared. Critic Carlo Affatigato described this twist as a \"paradox,\" postulating that the whole film is about how Noodles spends the second half of his life seeking out the truth of what happened, only to discover it, not accept it, and not investigate what happens to Max in the end. Noodles only wants to believe the reality he has created for himself, not an objective one. Affatigato also believes this could point to it all being the imagination of Noodles.\r\nMany people (including Schickel) assume that the 1968 Frisbee scene, which has an immediate cut and gives no further resolution, was part of a longer sequence. Ebert stated that the purpose of the flying disc scene was to establish the 1960s time frame and nothing more.",
    "html": "<p>Once Upon a Time in America (Italian: C'era una volta in America) is a 1984 epic crime film co-written and directed by Italian filmmaker Sergio Leone and starring Robert De Niro and James Woods. The film is an Italian–American venture produced by The Ladd Company, Embassy International Pictures, PSO Enterprises, and Rafran Cinematografica, and distributed by Warner Bros. Based on Harry Grey's novel The Hoods, it chronicles the lives of best friends David \"Noodles\" Aaronson and Maximilian \"Max\" Bercovicz as they lead a group of Jewish ghetto youths who rise to prominence as Jewish gangsters in New York City's world of organized crime. The film explores themes of childhood friendships, love, lust, greed, betrayal, loss, broken relationships, together with the rise of mobsters in American society.</p><p>It was the final film directed by Leone before his death five years later, and the first feature film he had directed in 13 years. It is also the third film of Leone's Once Upon a Time Trilogy, which includes Once Upon a Time in the West (1968) and Duck, You Sucker! (1971). The cinematography was by Tonino Delli Colli, and the film score by Ennio Morricone. Leone originally envisaged two three-hour films, then a single 269-minute (4 hours and 29 minutes) version, but was convinced by distributors to shorten it to 229 minutes (3 hours and 49 minutes). The American distributors, The Ladd Company, further shortened it to 139 minutes (2 hours and 19 minutes), and rearranged the scenes into chronological order, without Leone's involvement.</p><p>The shortened version was a critical and commercial flop in the United States, and critics who had seen both versions harshly condemned the changes that were made. The original \"European cut\" has remained a critical favorite and frequently appears in lists of the greatest films of all time, especially in the gangster genre.</p><br/><h3>Plot</h3><p>In 1933, three thugs search for a man named \"Noodles\", torturing people for information. They enter a wayang theater, where the proprietors slip into a hidden opium den within the building and warn Noodles. He is apathetic, drugged and grasping a newspaper featuring the demise of bootleggers Patrick Goldberg, Philip Stein and Maximilian Bercovicz. He recalls observing police removing their corpses, Max's burned beyond recognition. Noodles evades capture and leaves the city alone and penniless.</p><p>In 1918, David \"Noodles\" Aaronson and his friends \"Patsy\" Goldberg, \"Cockeye\" Stein and Dominic struggle as street kids in Manhattan's Lower East Side, committing petty crimes for local boss Bugsy. Max foils one of their robberies but has the booty stolen from him by a corrupt police officer, Whitey. Later, they blackmail the officer, catching him having sex with Peggy, a prostitute, and the five youngsters start a gang with the same level of police protection as Bugsy. Max and Noodles become best friends.</p><p>The group rises through the ranks after implementing Noodles' idea to hide bootleg liquor. They stash half their earnings in a railway station locker, giving the key to \"Fat Moe\", a friend not directly involved in their activities. Noodles is in love with Moe's sister, Deborah, who dreams of becoming a dancer and actress. Bugsy, now a rival, eventually ambushes the boys and shoots Dominic, who dies in Noodles' arms. In a fit of rage, Noodles kills Bugsy and injures a police officer, and is sentenced to prison.</p><p>Noodles is released in 1930 and rejoins his friends, now prosperous bootleggers during Prohibition. His first job with them is a diamond heist using a jewelry employee and occasional prostitute named Carol as their informant. During the robbery, Carol goads Noodles into hitting her, after which he rapes her; she later goes on to become Max's moll. That the job had been commissioned by a Syndicate figure to eliminate the competition sits badly with Noodles who, unlike Max, dislikes hierarchy and lacks political ambition. The gang provides protection for Teamsters' union boss Jimmy O'Donnell, but Noodles later rejects Max's plan to deepen those ties.</p><p>Seeking to form a genuine intimacy with Deborah, Noodles takes her on a lavish date, where she reveals her plans to pursue a career in Hollywood. On their drive back, a frustrated Noodles rapes her in the limousine. He is later met with Deborah's aloofness when he watches her board the train to California.</p><p>The gang's success ends with the 1933 repeal of Prohibition. Max suggests a New York Federal Reserve Bank heist, which Noodles and Carol deem a suicide mission. Carol convinces Noodles to inform the police about a lesser offense, hoping brief incarceration will cool off Max's ambition. After Noodles calls the police, Max knocks him out during a seemingly impromptu argument. This leads to the events shown in the prologue: upon regaining consciousness and learning that Max, Patsy, and Cockeye have been killed by the police, a guilt-ridden Noodles hides in the opium den. He saves Moe but finds out that his new girlfriend Eve has been murdered and the railway locker money has disappeared. With his gang killed and himself hunted by Syndicate thugs, Noodles settles in Buffalo under an alias.</p><p>In 1968, Noodles is belatedly informed that the Beth Israel Cemetery is being redeveloped, and asked to rebury any loved ones. Upon inquiry, the rabbi who had sent the letter informs him that the bodies of his three dead friends have since been relocated to Riverdale. Realizing that someone has deduced his identity, Noodles returns to Manhattan and stays with Moe. Inside the Riverdale mausoleum, Noodles finds a key to the railway locker. The caption on the commemorative plaque falsely states that the mausoleum was erected by Noodles himself.</p><p>The locker reveals a suitcase full of money, and a note stating this is a downpayment on his next job. Noodles watches news of an assassination attempt on controversial U.S. Secretary of Commerce Christopher Bailey. The report shows Jimmy O'Donnell, still a Teamsters boss, distancing himself from the Bailey corruption scandal. Noodles finds Carol in a retirement home run by the Bailey Foundation. She tells him that Max manipulated them into tipping him off to the police and opened fire first, wishing to die young rather than in an insane asylum like his father.</p><p>After spotting her in the retirement home's dedication photo, Noodles tracks down Deborah, still an actress. He tells her about his invitation to a party at Bailey's mansion. Deborah admits to being Bailey's lover and begs Noodles to leave before he is confronted with hurtful revelations. Ignoring Deborah's advice, Noodles sees Bailey's son just outside, who evidently looks like a younger Max.</p><p>At the party, Noodles meets Bailey, who reveals he is actually Max and that he faked his death with the help of the police and Syndicate, stole the gang's money and reinvented himself as a self-made, Teamsters-connected politician. He confirms that he made Deborah his mistress years earlier. Faced with ruin and the specter of a Teamster assassination, Max reveals the job he has for Noodles is to kill him. Noodles, obstinately referring to him by his Bailey identity, refuses, explaining that in his eyes, Max died with the gang. As Noodles leaves the estate, a garbage truck starts up and a man, presumably Max, walks from the entrance toward Noodles until the truck passes between them. Noodles sees the truck's auger conveyor grinding garbage, but the man is nowhere to be seen.</p><p>The epilogue returns to 1933 with Noodles entering the opium den after his friends' deaths, taking the drug and broadly grinning.</p><br/><h3>Cast</h3><ul><li>Robert De Niro as Noodles Scott Tiler as Young Noodles</li><li>Scott Tiler as Young Noodles</li><li>James Woods as Max Rusty Jacobs as Young Max/David Bailey</li><li>Rusty Jacobs as Young Max/David Bailey</li><li>Elizabeth McGovern as Deborah Jennifer Connelly as Young Deborah</li><li>Jennifer Connelly as Young Deborah</li><li>Joe Pesci as Frankie Minaldi</li><li>Burt Young as Joe</li><li>Tuesday Weld as Carol</li><li>Treat Williams as Jimmy O'Donnell</li><li>Danny Aiello as Police Chief Aiello</li><li>Richard Bright as Chicken Joe</li><li>James Hayden as Patsy Brian Bloom as Young Patsy</li><li>Brian Bloom as Young Patsy</li><li>William Forsythe as Cockeye Adrian Curran as Young Cockeye</li><li>Adrian Curran as Young Cockeye</li><li>Darlanne Fluegel as Eve</li><li>Larry Rapp as Fat Moe Mike Monetti as Young Fat Moe</li><li>Mike Monetti as Young Fat Moe</li><li>Richard Foronjy as Whitey</li><li>Robert Harper as Sharkey</li><li>Dutch Miller as Van Linden</li><li>Gerard Murphy as Crowning</li><li>Amy Ryder as Peggy Julie Cohen as Young Peggy</li><li>Julie Cohen as Young Peggy</li><li>Estelle Harris as Peggy's mother</li></ul><p>The cast also includes Noah Moazezi as Dominic, James Russo as Bugsy, producer Arnon Milchan as Noodles' chauffeur, Marcia Jean Kurtz as Max's mother, Joey Faye as an \"Adorable Old Man\", and Olga Karlatos as a wayang patron. Frank Gio, Ray Dittrich and Mario Brega (a regular supporting actor in Leone's Dollars Trilogy) respectively appear as Beefy, Trigger and Mandy, a trio of gangsters who search for Noodles. Frequent De Niro collaborator Chuck Low and Leone's daughter Francesca respectively make uncredited appearances as Fat Moe and Deborah's father, and David Bailey's girlfriend. In the 2012 restoration, Louise Fletcher appears as the Cemetery Directress of Riverdale, where Noodles visits his friends' tomb in 1968.</p><br/><h3>Production</h3><h4>Development</h4><p>During the mid-1960s, Sergio Leone had read the novel The Hoods by Harry Grey, a pseudonym for the former gangster-turned-informant whose real name was Harry Goldberg. In 1968, after shooting Once Upon a Time in the West, Leone made many efforts to talk to Grey. Having enjoyed Leone's Dollars Trilogy, Grey finally responded and agreed to meet with Leone at a Manhattan bar. Following that initial meeting, Leone met with Grey several times throughout the remainder of the 1960s and 1970s, having discussions with him to understand America through Grey's point of view.</p><p>Intent on making another trilogy about America consisting of Once Upon a Time in the West, Duck, You Sucker! and Once Upon a Time in America, Leone turned down an offer from Paramount Pictures to direct The Godfather in order to pursue his pet project. Elements of Norman Mailer's first two drafts of a commissioned screenplay that was later drafted would appear in the film.</p><h4>Filming</h4><p>The filming of Once Upon a Time in America started in June 1982 and eventually ended in April the next year. The locations where the shooting took place were in and around US, Canada, Italy, and France, with a focal point in New York City. Interior scenes were mostly filmed at the Cinecittà Studios in Rome.</p><p>The beach scene, where Max unveils his plan to rob the Federal Reserve, was shot at The Don CeSar in St. Pete Beach, Florida. The New York's railway \"Grand Central Station\" scene in the thirties flashbacks was filmed in the Gare du Nord in Paris. The interiors of the lavish restaurant where Noodles takes Deborah on their date were shot in the Hotel Excelsior in Venice, Italy.</p><h4>Editing</h4><p>By the end of filming, Leone had ten hours worth of footage. With his editor, Nino Baragli, Leone trimmed this to almost six hours, and he originally wanted to release the film in two parts. The producers refused, partly because of the commercial and critical failure of Bernardo Bertolucci's two-part 1900, and Leone was forced to further shorten it. The film was originally 269 minutes (4 hours and 29 minutes), but when the film premiered out of competition at the 1984 Cannes Film Festival, Leone had cut it to 229 minutes (3 hours and 49 minutes) to appease the distributors, which was the version shown in European cinemas.</p><h4>Music</h4><p>The musical score was composed by Leone's longtime collaborator Ennio Morricone. \"Deborah's Theme\" was written for another film in the 1970s but was rejected. The score is also notable for Morricone's incorporation of the music of Gheorghe Zamfir, who plays a pan flute. Zamfir's flute music was used to similar effect in Peter Weir's Picnic at Hanging Rock (1975). Morricone also collaborated with vocalist Edda Dell'Orso on the score.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Once Upon a Time in America</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\"><span>Ennio Morricone</span></div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\"><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1126788409\"><div class=\"plainlist\"><ul><li>1 June 1984</li><li>17 October 1995 <small>(Special edition)</small></li></ul></div></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Recorded</th><td class=\"infobox-data plainlist\">December 1983</td></tr><tr><th scope=\"row\" class=\"infobox-label\">Studio</th><td class=\"infobox-data plainlist\"><span>Forum Studios</span>, Rome</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span>Contemporary classical</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span>Mercury Records</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Producer</span></th><td class=\"infobox-data hlist\">Ennio Morricone</td></tr><tr><td colspan=\"2\" class=\"infobox-below\"><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1066479718\"></td></tr><tr><th colspan=\"2\" class=\"infobox-header\" style=\"background: gainsboro\">Special Edition cover</th></tr><tr><td colspan=\"2\" class=\"infobox-full-data\"><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1066479718\"></td></tr><tr style=\"display:none\"><td colspan=\"2\"></td></tr></tbody></table><p>Besides the original music, the film used source music, including:</p><ul><li>\"God Bless America\" (written by Irving Berlin, performed by Kate Smith – 1943) – Plays over the opening credits from a radio in Eve's bedroom and briefly at the film's ending.</li><li>\"Yesterday\" (written by Lennon–McCartney – 1965) – A Muzak version of this piece plays when Noodles first returns to New York in 1968, examining himself in a train station mirror. An instrumental version of the song also plays briefly during the dialogue scene between Noodles and \"Bailey\" towards the end of the film.</li><li>\"Summertime\" (written by George Gershwin – 1935) An instrumental version of the aria from the opera Porgy and Bess is playing softly in the background as Noodles, just before leaving, explains to \"Secretary Bailey\" why he could never kill his friend.</li><li>\"Amapola\" (written by Joseph Lacalle, American lyrics by Albert Gamse – 1923) – Originally an opera piece, several instrumental versions of this song were played during the film; a jazzy version, which was played on the gramophone danced to by young Deborah in 1918; a similar version played by Fat Moe's jazz band in the speakeasy in 1930; and a string version, during Noodles' date with Deborah. Both versions are available on the soundtrack.</li><li>Part of the third theme from the overture to La gazza ladra (Gioachino Rossini – 1817) – Used during the baby-switching scene in the hospital.</li><li>\"Night and Day\" (written and sung by Cole Porter – 1932) – Played by a jazz band during the beach scene before the beachgoers receive word of Prohibition's repeal, and during the party at the house of \"Secretary Bailey\" in 1968.</li><li>\"St. James Infirmary Blues\" is used during the Prohibition \"funeral\" at the gang's speakeasy.</li></ul><p>A soundtrack album was released in 1984 by Mercury Records. This was followed by a special-edition release in 1995, featuring four additional tracks.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Side one</caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Once Upon a Time in America\"</td><td class=\"tracklist-length\">2:11</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Poverty\"</td><td class=\"tracklist-length\">3:37</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Deborah's Theme\"</td><td class=\"tracklist-length\">4:24</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Childhood Memories\"</td><td class=\"tracklist-length\">3:22</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Amapola\"</td><td class=\"tracklist-length\">5:21</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Friends\"</td><td class=\"tracklist-length\">1:34</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Prohibition Dirge\"</td><td class=\"tracklist-length\">4:20</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Side two</caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Cockeye's Song\"</td><td class=\"tracklist-length\">4:20</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"Amapola, Part II\"</td><td class=\"tracklist-length\">3:07</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Childhood Poverty\"</td><td class=\"tracklist-length\">1:41</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Photographic Memories\"</td><td class=\"tracklist-length\">1:00</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"Friends – Reprise\"</td><td class=\"tracklist-length\">1:23</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Friendship &amp; Love\"</td><td class=\"tracklist-length\">4:14</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Speakeasy\"</td><td class=\"tracklist-length\">2:21</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"Deborah's Theme – Amapola\"</td><td class=\"tracklist-length\">6:13</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Bonus tracks (1995 Special Edition)</caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"Suite from Once Upon a Time in America (Includes Amapola)\"</td><td class=\"tracklist-length\">13:32</td></tr><tr><th id=\"track17\" scope=\"row\">17.</th><td>\"Poverty (Temp. Version)\"</td><td class=\"tracklist-length\">3:26</td></tr><tr><th id=\"track18\" scope=\"row\">18.</th><td>\"Unused Theme\"</td><td class=\"tracklist-length\">4:46</td></tr><tr><th id=\"track19\" scope=\"row\">19.</th><td>\"Unused Theme (Version 2)\"</td><td class=\"tracklist-length\">3:38</td></tr></tbody></table><br/><h3>Release</h3><p>Once Upon a Time in America premiered at the 1984 Cannes Film Festival on May 20, 1984. It received a raucous, record-breaking ovation of nearly 20 minutes after the screening (reportedly heard by diners at restaurants across the street from the Palais), at a time in Cannes's history before marathon applause became a regular occurrence. In the United States, a heavily edited version of the film received a wide release in 894 theaters on 1 June 1984, and grossed $2.4 million during its opening weekend. It ended its box office run with a gross of just over $5.3 million on a $30 million budget, and became a box office flop.</p><p>Numerous women at the film's premiere reacted furiously, mostly due to the two rape sequences. One among them later confronted Robert De Niro in a press conference and made harsh comments to the film's depiction, describing it as \"blatant, gratuitous violence.\" In general, the rape scenes specifically were controversial. Richard Godden defended Leone's representation of rape that it \"articulates the dysfunction between bodies in images and bodies themselves.\" Elizabeth McGovern supported Godden's claim and said that Leone didn't intend to glamorize any \"violent sex\". In his book, Leone scholar Christopher Frayling argues that the movie's central gang are all emotionally stunted: \"... like small boys obsessed with their equipment who have no idea how to relate to flesh-and-blood women.\"</p><h4>Versions</h4><h4>U.S. version</h4><p>The film was shown in limited release and for film critics in North America, where it was slightly trimmed to secure an \"R\" rating. Cuts were made to two rape scenes and some of the more graphic violence at the beginning. Noodles' meeting with Bailey in 1968 was also excised. The film gained a mediocre reception at several sneak premieres in North America. Because of this early audience reaction, the fear of its length, its graphic violence, and the inability of theaters to have multiple showings in one day, The Ladd Company cut entire scenes and removed approximately 90 minutes of the film, without the supervision of Sergio Leone.</p><p>This American wide release (1984, 139 minutes) was drastically different from the European release, as the non-chronological story was rearranged into chronological order. Other major cuts involved many of the childhood sequences, making the adult 1933 sections more prominent. Noodles' 1968 meeting with Deborah was excised, and the scene with Bailey ends with him shooting himself (with the sound of a gunshot off screen) rather than the garbage truck conclusion of the 229-minute version. Sergio Leone's daughter, Raffaella Leone, said that Leone had dismissed the US version as not his own movie.</p><h4>USSR</h4><p>In the Soviet Union, the film was shown theatrically in the late 1980s, with other Hollywood blockbusters such as the two King Kong films. The story was rearranged in chronological order and the film was split in two, with the two parts shown as separate movies, one containing the childhood scenes and the other comprising the adulthood scenes. Despite the rearranging, no major scene deletions were made.</p><h4>Restored original</h4><p>In March 2011, it was announced that Leone's original 269-minute version was to be re-created by a film lab in Italy under the supervision of Leone's children, who had acquired the Italian distribution rights, and the film's original sound editor, Fausto Ancillai, for a premiere in 2012 at either the Cannes Film Festival or Venice Film Festival.</p><p>The restored film premiered at the 2012 Cannes Film Festival, but because of unforeseen rights issues for the deleted scenes, the restoration had a runtime of only 251 minutes. However, Martin Scorsese (whose Film Foundation helped with the restoration) stated that he was helping Leone's children gain the rights to the final 24 minutes of deleted scenes to create a complete restoration of Leone's envisaged 269-minute version. On 3 August 2012, it was reported that after the premiere at Cannes, the restored film was pulled from circulation, pending further restoration work.</p><h4>Home media</h4><p>In North America, a two-tape VHS was released by Warner Home Video with a runtime of 226 minutes in February 1985 and 1991. The U.S. theatrical cut was also released at the same time in February 1985. A two-disc special edition was released on 10 June 2003, featuring the 229-minute version of the film. This special edition was re-released on 11 January 2011, on both DVD and Blu-ray. On 30 September 2014, Warner Bros. released a two-disc Blu-ray and DVD set of the 251-minute restoration shown at the 2012 Cannes Film Festival, dubbed the Extended Director's Cut. This version was previously released in Italy, on 4 September 2012.</p><br/><h3>Critical reception</h3><p>The initial critical response to Once Upon a Time in America was mixed, because of the different versions released worldwide. While internationally the film was well received in its original form, American critics were much more dissatisfied with the 139-minute version released in North America. This condensed version was a critical and financial disaster, and many American critics who knew of Leone's original cut attacked the short version.</p><p>Some critics compared shortening the film to shortening Richard Wagner's operas, saying that works of art that are meant to be long should be given the respect they deserve. In his 1984 review, Roger Ebert gave the uncut version four stars out of four and wrote that it was \"an epic poem of violence and greed\", but described the American theatrical version as a \"travesty\". Furthermore, he gave the American theatrical version one star out of four, calling it \"an incomprehensible mess without texture, timing, mood, or sense.\" Ebert's television film critic partner Gene Siskel considered the uncut version to be the best film of 1984 and the shortened, linear studio version to be the worst film of 1984. Vincent Canby of The New York Times criticized the nonlinear narrative that is structured throughout the film.</p><p>It was only after Leone's death and the subsequent restoration of the original version that critics began to give it the kind of praise displayed at its original Cannes showing. The uncut original film is considered to be far superior to the edited version released in the U.S. in 1984. Ebert, in his review of Brian De Palma's The Untouchables, called the original uncut version of Once Upon a Time in America the best film depicting the Prohibition era. James Woods, who considers it to be Leone's finest film, mentioned in the DVD documentary that one critic dubbed the film the worst of 1984, only to see the original cut years later and call it the best of the 1980s. Some were critical towards the movie's graphic violence and cruelty, with Donald Clarke of The Irish Times condemning it as a \"fistful of misogyny\" and offensively \"sexist\".</p><p>On the review aggregator website Rotten Tomatoes, Once Upon a Time in America has an approval rating of 87% based on 55 reviews, with an average score of 8.50/10. The website's critic consensus reads, \"Sergio Leone's epic crime drama is visually stunning, stylistically bold, and emotionally haunting, and filled with great performances from the likes of Robert De Niro and James Woods.\" On Metacritic, the film has a weighted average score of 75 out of 100 based on reviews from 20 critics, indicating \"generally favorable reviews\".</p><p>The film has since been ranked as one of the best films of the gangster genre. When Sight & Sound asked several UK critics in 2002 what their favorite films of the last 25 years were, Once Upon a Time in America placed at number 10. In 2015, the film was ranked at number nine on Time Out's list of the 50 best gangster films of all time, while in 2021, The Guardian cited it as the fourth greatest mobster film ever made.</p><h4>Accolades</h4><p>Unlike its modern critical success, the initial American release did not fare well with critics and received no Academy Award nominations. The film's music was disqualified from Oscar consideration for a technicality, as the studio accidentally omitted the composer's name from the opening credits when trimming its running time for the American release.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee</th><th>Result</th></tr><tr><td rowspan=\"5\"><span>38th British Academy Film Awards</span></td><td><span>Best Costume Design</span></td><td><span>Gabriella Pescucci</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Best Film Music</span></td><td><span>Ennio Morricone</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Direction</span></td><td><span>Sergio Leone</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress in a Supporting Role</span></td><td><span>Tuesday Weld</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Tonino Delli Colli</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>42nd Golden Globe Awards</span></td><td><span>Best Director</span></td><td>Sergio Leone</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Score</span></td><td>Ennio Morricone</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>8th <span>Japan Academy Film Prize</span></td><td><span>Outstanding Foreign Language Film</span></td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">–</div></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>10th Los Angeles Film Critics Association Awards</span></td><td><span>Best Film</span></td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">–</div></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td>Sergio Leone</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Music Score</td><td>Ennio Morricone</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><br/><h3>Interpretations</h3><p>As the film begins and ends in 1933, with Noodles hiding in an opium den from syndicate hitmen, and the last shot of the film is of Noodles in a smiling, opium-soaked high, the film can be interpreted as having been a drug-induced dream, with Noodles remembering his past and envisioning the future. In an interview by Noël Simsolo published in 1987, Leone lent support to this interpretation, saying that the scenes set in the 1960s could be seen as an opium dream of Noodles'. In the DVD commentary for the film, film historian and critic Richard Schickel states that opium users often report vivid dreams, and that these visions have a tendency to explore the user's past and future.</p><p>The ending in which Max appears as Noodles is leaving Bailey's mansion and then suddenly disappears behind a truck only for Noodles to see the blades of the truck spinning, was reportedly left ambiguous on purpose. James Woods, who played Max, stated that he does not know if Max jumped in the truck or just disappeared. Critic Carlo Affatigato described this twist as a \"paradox,\" postulating that the whole film is about how Noodles spends the second half of his life seeking out the truth of what happened, only to discover it, not accept it, and not investigate what happens to Max in the end. Noodles only wants to believe the reality he has created for himself, not an objective one. Affatigato also believes this could point to it all being the imagination of Noodles.</p><p>Many people (including Schickel) assume that the 1968 Frisbee scene, which has an immediate cut and gives no further resolution, was part of a longer sequence. Ebert stated that the purpose of the flying disc scene was to establish the 1960s time frame and nothing more.</p><br/>"
  },
  "errorMessage": ""
}