{
  "imDbId": "tt0253474",
  "title": "The Pianist",
  "fullTitle": "The Pianist (2002)",
  "type": "Movie",
  "year": "2002",
  "items": [
    {
      "publisher": "Washington Post",
      "author": "Desson Thomson",
      "link": "",
      "rate": "100",
      "content": "Polanski, himself a survivor of Nazi-occupied Poland, has created a near-masterpiece."
    },
    {
      "publisher": "Boston Globe",
      "author": "Ty Burr",
      "link": "",
      "rate": "100",
      "content": "There are three Poles in The Pianist -- Szpilman, Polanski, and Frederic Chopin. Of the three, fittingly, Chopin speaks the loudest."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Lisa Schwarzbaum",
      "link": "",
      "rate": "91",
      "content": "The result is a movie, and Cannes Palme d'Or winner, of riveting power and sadness, a great match of film and filmmaker -- and star, too."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "90",
      "content": "The results are masterful, admirably unsentimental, and never boring, if also a little stodgy."
    },
    {
      "publisher": "Newsweek",
      "author": "David Ansen",
      "link": "https://www.msnbc.com/",
      "rate": "90",
      "content": "This powerful, precision-made movie offers hope as well -- an act of kindness from a German officer that saves the pianists life, the music that sustains his soul."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Manohla Dargis",
      "link": "https://www.latimes.com/entertainment-arts",
      "rate": "90",
      "content": "Never before has a fiction film so clearly and to such devastating effect laid out the calculation of the Nazi machinery of death and its irrationality."
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Marc Savlov",
      "link": "https://www.austinchronicle.com/events/film/",
      "rate": "89",
      "content": "Szpilman takes to performing sonatas in thin air, eyes closed, those jittery fingers stroking nothing but air. It's a wonderful moment in a wonderful, ghastly film, and one of the most moving arguments for the redemptive powers of art ever made."
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "Ken Fox",
      "link": "https://www.tvguide.com/?MI=44053",
      "rate": "80",
      "content": "Polanski's film is an unqualified success both dramatically and artistically."
    },
    {
      "publisher": "The New Republic",
      "author": "Stanley Kauffmann",
      "link": "",
      "rate": "80",
      "content": "To name only one of its predecessors -- for me, the towering one -- doesn't \"Schindler's List\" do everything that Polanski achieves and more?"
    },
    {
      "publisher": "The A.V. Club",
      "author": "Scott Tobias",
      "link": "http://survey-smiles.com/",
      "rate": "70",
      "content": "Through Brody's remarkably controlled, self-effacing performance, Polanski succeeds in making his hero an invisible man, but the sights he conjures are surprisingly artless and ordinary, familiar from a dozen other Holocaust dramas. Among the casualties in The Pianist is a great director's imagination."
    }
  ],
  "errorMessage": ""
}