{
  "imDbId": "tt0253474",
  "title": "The Pianist",
  "fullTitle": "The Pianist (2002)",
  "type": "Movie",
  "year": "2002",
  "items": [
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0955497",
      "warningSpoilers": false,
      "date": "1 November 2004",
      "rate": "10",
      "helpful": "461 out of 512 found this helpful.",
      "title": "Excellent, depressing, but excellent",
      "content": "Man, I can not get this film out of my head. It is so rare that a movie can affect me the way \"The Pianst\" did. The last movie that did that was \"Casino\". I was really tired when I was watching the movie. It was almost midnight, so I was thinking that I'll start watching and I'll finish it in the morning. Did I? No, indeed I did not stop watching. I couldn't stop it. I just wanted to see what would happen next. I cried during \"Schindler's List\", I sobbed in this film. Everything that happens in this film is so sad. Adrien Brody does a remarkable job of acting in this film. I would very highly recommend this film. Especially if you are a history buff. Please, I think this film should be in the top 10 best films of all time.I looked on the message boards you know and some other user comments that didn't enjoy this film much, they criticized Adrien Brody's performance and say that he was boring and only showed emotions that are easy to act. Please, you have got to be kidding me. This man portrayed the total feeling of hopelessness, being alone, being hated. I one time had an audition in high school like this to see if I could improvise, and the way I imagined this feeling is like in dodgeball where you have no one else on your team and you're the only one left standing, yet on the other team there is 20 big men that are just waiting to wack that ball at you. Adrien couldn't have done a better job, I was so frightened for him and cried for him during the whole film while he was one the run.Roman Polanski as the director, he himself escaped the terrors of being a prisoner in The Holocaust, yet he lost his mother and other family members. Yes, I'm sure this film must have been hard to re create for him, but he was probably the only director that could have done this movie as brilliantly as he did. He created this story and made it so effective, I called up my mom and told her that I loved her so much because we take so many things for granted. True, this isn't the 1930's or 40's, and we are in America. But it's still frightening to think that human beings are capable of that much hate and being so brutal to another human. World War II is one of the most frightening wars in history, if you read more about The Holocaust, you get more into it and you should. If you are not interested, then watch this film. It's a must see, otherwise how else will we learn from our mistakes? The Pianist is a beautiful and extremely dark tale about a man and the struggle to survive. The ending is so powerful and moving to know that sometimes one man can make a difference in a crowd of so many and I'm not talking about Adrien Brody's character. You'll see what I mean.10/10"
    },
    {
      "username": "baumer",
      "userUrl": "https://www.imdb.com/user/ur0355122",
      "reviewLink": "https://www.imdb.com/review/rw0746617",
      "warningSpoilers": false,
      "date": "27 March 2003",
      "rate": "",
      "helpful": "605 out of 669 found this helpful.",
      "title": "A haunting film, one that you won't forget",
      "content": "I can remember when this film came out I was adamantly against seeing it. I had my preconceived notions that it would be some other heroic Jewish Holocaust film where good triumphs over evil and in between we would see some brutal atrocities committed by the Germans to add some flavour.How wrong I was.This is one of the best films I have ever seen and what it did to me I cannot describe in words. But in a nutshell, it moved me, made me cry, made me feel like I was in the Polish ghetto in 1940, and ultimately made me kiss the sidewalks as I walked out of the theater and thanked God that I live in the free society that I do. Roman Polanski has proved that he is a great director with films like Chinatown and Rosemary's Baby but this is his crowning achievement. I think the fact that this won the awards that it did at this years Oscars goes a long way to validate the brilliance of this film. I believe that the Oscar's are rigged for the most part and films and actresses and such win based more on their pedigree or business associations than anything else, so when it won best actor and director and adapted screenplay this year, it tells you that it should have won best picture but the Weinsteins seem to have a spell over everyone, hence a charlatan like Chicago takes top prize. Sorry for the digression here but when you compare a \"film\" like Chicago to a masterpiece like The Pianist, there really is one clear cut winner. They handed out the statue to the wrong movie.The Pianist follows up and coming piano player Wlad Spielzman from his days as a local hero to a prisoner of war to his time in the ghettos, surviving only by the kindness of strangers. I think many people have touched on this before but what makes this film so amazing and well crafted is because Spielzman is a man that we can all relate to. He is not a hero, he is not a rebel and he is not a kamikaze type that wants and lusts after revenge. He is a simple man that is doing everything in his power to stay alive. He is a desperate man and fears for his life and wants to stay as low as he can. Only from the succor he receives from others does he manage to live and breathe and eat and hide. And this is how I related to him. If put in his position, how would I react? Exactly the way he did. This is a man that had everything taken from him. His livelihood, his family, his freedom and almost his life. There is no time for heroics here. Adrien Brody embodies the spirit of Spielzman and his win at this years Oscars was one of the happiest moments I have had watching the festivities. His speech was even better but that is a topic for another time.Ultimately it is his gift of music that perhaps saves his life and the final scene that he has with the German soldier is one of the most emotionally galvanizing scenes I've witnessed. With very little dialogue, it is in the eyes, the face, the mouth and the sounds that chime throughout their tiny space that tell you all you need to know. I think it is this scene that won Brody his Oscar. This is one of the all time great performances.I think Polanski spoke from the heart here. He has taken a palette of memories and amalgamated them with what he has read and given us one of the best films of our generation and any other. I think The Pianist will go down as one of the best films of this century and when all is said and done, Chicago will be forgotten the way Ordinary People was forgotten and when people talk about the film The Pianist, they will do so with reverence and respect. This is a cinematic masterpiece.10 out of 10"
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw2865991",
      "warningSpoilers": false,
      "date": "9 September 2013",
      "rate": "10",
      "helpful": "122 out of 136 found this helpful.",
      "title": "A Masterpiece. Awesome acting by Brody.",
      "content": "This is a truly heart-wrenching story of one man whose family gets perished in the Holocaust and about his survival over solitude, deprivation, starvation and terror while in hiding during the Nazi occupation. In my opinion it is one of the finest depictions of the holocaust. This movie came close to Schindlers list in depicting the horrors of Holocaust. Brody puts in a marvelous and utterly touching performance. The story depicts the emotional and cultural breakdown of persecuted Jewish community as Nazi policy tightens around them. Excellent acting by Brody."
    },
    {
      "username": "FilmOtaku",
      "userUrl": "https://www.imdb.com/user/ur2339662",
      "reviewLink": "https://www.imdb.com/review/rw0746680",
      "warningSpoilers": false,
      "date": "28 April 2003",
      "rate": "8",
      "helpful": "322 out of 388 found this helpful.",
      "title": "An astonishing film",
      "content": "The Pianist is the true story of Wladyslaw Szpilman, at the time Poland's most acclaimed pianist whose life is transformed during the Nazi occupation of Warsaw beginning in 1939. The film spans several years and maps his many personal trials in addition to providing the perspectives of his family, rebel factions and sympathizers.Brilliantly directed by Roman Polanski and starring an amazing Adrien Brody, The Pianist is bound to garner comparisons to Schindler's List, for obvious reasons. However similar the subject matter, the approach is different. While Schindler's List was filmed in a beautiful, crisp black and white that offered many incredible images, The Pianist was filmed with almost muted color. Schindler's List featured what has been argued as a complicated hero. Oskar Schindler did save many Jews, but not without battling his own materialistic demons first. The Pianist's Szpilman is a sympathetic character throughout. His plight was desperate, and the demons he fought were over his own guilt in surviving a fight that eventually turns into a primal will to live.Polanski does not spare the viewer any grief with his film. The horrific scenes between the Nazis and the Warsaw Jews were more terrifying and horrible than any horror/suspense movie I have seen in some time, possibly ever. The humiliation and complete loss is wrenching. In several scenes, Jews are lined up in the middle of the night and subjected to either torture or death. In one case, a woman asks of a Nazi officer, \"What will happen to us?\" and is promptly shot point blank in the head. The camera does not flinch or subdue any of these atrocities.A mention must be made of Brody's performance. Having only previously seen Brody in two other films, Spike Lee's \"Summer of Sam\" and Terrence Malick's \"The Thin Red Line\" (a part that was supposed to be his launch into stardom before his part was unfortunately cut drastically) I knew his potential was great. After his Oscar win, I viewed this movie with more criticism than I normally would have and he certainly did not disappoint. He transcended my expectations. His physical transformation was amazing, but more importantly, he conveyed the sorrow of this man shockingly well - in both verbal and non-verbal contexts. It will be very interesting to see what kind of opportunities this role will afford him, and the kinds of roles he will accept.Something worth mentioning is the affect this movie had on the audience with whom I viewed this film. Normally, when a film ends, the regular hardcore filmsters like myself will stay and watch the credits in their entirety. The rest of the audience stands up and leaves, usually to the chagrin of the remaining enthusiasts. This was one of the few times I have seen a film at a theater where not one person stood to leave during the final credits. It wasn't until the house lights came up at the end did people begin to disperse. Personally, I hightailed it out of the theater the second the lights came on because not only was my face a mess from crying during the film (Tammy Faye comes to mind) but I had this overwhelming need for an emotional release, so when I reached my car I sat and wept for about five minutes. It has been years since I have watched a film that upset me to that extent. Conversely, while discussing this film with my brother, (someone who loves movies as much and has similar tastes as I do) he mentioned that while he thought the movie was excellent, he wasn't as profoundly emotionally effected as I was. After thinking about this for a couple of days, I realized the difference: The music. As a classical music enthusiast and erstwhile musician, the thought of not being able to enjoy, much less play the music you love is a tragic one. Then the emotional outpouring that comes when you return to it - there aren't words to describe how intense that is. Not having the same appreciation for this musical genre, one will be able to sympathize with the physical and emotional tribulations, but perhaps not in the musical sense.The Pianist was truly an astonishing film. I was riveted from start to finish and so emotionally affected that I couldn't even consider writing a review until a week later. Having said that, I am filing this away with my list of movies which include Schindlers List and Philadelphia, as films that I love but cannot rewatch for a long time after due to their intensely emotional content.--Shelly"
    },
    {
      "username": "jotix100",
      "userUrl": "https://www.imdb.com/user/ur1406078",
      "reviewLink": "https://www.imdb.com/review/rw0746487",
      "warningSpoilers": false,
      "date": "21 January 2003",
      "rate": "10",
      "helpful": "183 out of 233 found this helpful.",
      "title": "To hell and back.",
      "content": "The Pianist is an incredible film in many aspects. Roman Polanski's account of the survival of the pianist, Wladyslaw Szpilman, is a document about how one man can overcome the worst possible situations in a world gone completely mad around him.The only fault one can find with the adaptation of Mr. Szpilman's story by playwright Ronald Harwood, is the fact that we never get to know the real Wladyslaw Szpilman, the man, as some of the comments made to this forum also have indicated.There is a very interesting point raised by the the pianist's father who upon reading something in the paper, comments about how the Americans have forgotten them. Well, not only the Americans, but the rest of the world would not raise a finger to do anything for the people that were being imprisoned and made to live in the confined area of Warsaw. The exterminating camps will come later. What is amazing in the film, is the frankness in which director Polanski portrays the duplicity of some Jews in the ghetto. The fact that Jews were used to control other Jews is mind boggling, but it was a fact, and it's treated here matter of factly. Had this been made by an American director, this aspect would have never surfaced at all. Yet, Mr. Polanski and Mr. Harewood show us that all was not as noble and dignified as some other films have treated this ugly side of war. Wladyslaw Szpilman, as played by Adrien Brody, is puzzling sometimes, in that we never get to know what's in his mind. He's a man intent in not dying, but he's not a fighter. He accepts the kindness extended to him. He never offers to do anything other than keep on hiding, which is a human instinct. He will never fight side by side with the real heroes of the ghetto uprising. His role is simply to witness the battle from his vantage point in one of the safe houses across the street from where the action takes place.Adrien Brody is an interesting actor to watch. As the pianist of the story he exudes intelligence. There is a scene where Szpilman, in one of the safe houses he is taken, discovers an upright piano. One can see the music in his head and he can't contain himself in moving his fingers outside the closed instrument playing the glorious music from which he can only imagine what it will sound in his mind.The supporting cast is excellent. Frank Findlay, a magnificent English actor is the father of the pianist and Maureen Lipman, another veteran of the stage, plays the mother with refined dignity.In watching this film one can only shudder at the thought of another conflict that is currently brewing in front of our eyes. We wonder if the leaders of the different factions could be made to sit through a showing of The Pianist to make them realize that war is hell."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0746412",
      "warningSpoilers": false,
      "date": "16 January 2003",
      "rate": "10",
      "helpful": "148 out of 195 found this helpful.",
      "title": "Stoic, haunting tale of survival",
      "content": "The Pianist tells the story of such a man in war time Poland, played by Adrien Brody, who from start to finish sees his life literally getting worse and worse and worse- starts off with new rules from the Nazis, then the stars on the arms, followed by the Warsaw ghetto, and while there he could play in the restaurant, that too soon ended, as the trains arrived and took his family and anyone else he knew away. During this he narrowly escapes, and from then on the film in a sense almost becomes not exactly a holocaust film, but more like a cross of that as the element and the basic structure of something a-la in Cast Away: this includes stretches of scenes showing Brody simply trying to keep out of view of the Germans, either in a small apartment provided by helpful Polish Christians/Jewish resistance, or as a scavenger in the abandoned sections of the ghetto, all while feeling the old rhythm of the piano in his head and fingertips. This is the kind of magnificent filmmaking that shows a director not only being as true to the story given to him (that of Painist Szpilman, based on his autobiography) but to his past as well- Roman Polanksi faced similar conditions as a boy in the early 40's, and has found the best line to show, never crossed or mis-stepped, in representing the characters and the period. There aren't any hints of tightened suspense, no clues as to where the film could veer to, it just is. The big difference to be seen between a film like this and Schindler's List is not just in the people and situations (Schindler's List was a film about two people, Schindler and Goeth, in the foreground while the Pianist is a total first person tale), yet also in the filmmaking qualities being here surely European. And while the accents on the Polish-Jewish actors sounds a bit too British, that is quite forgivable considering the scope of the project (thank heavens he didn't put in English speaking Germans).In conclusion, Brody turns in a superb performance, and this indeed is in with Polanski's best, a deserved of 2002's Palme D'Or. Great music too. A+"
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw2747794",
      "warningSpoilers": true,
      "date": "3 February 2013",
      "rate": "10",
      "helpful": "35 out of 43 found this helpful.",
      "title": "\"You musicians don't make good conspirators.\"",
      "content": "Fortunately, I'm able to keep my personal feelings about Roman Polanski compartmentalized enough to say that this was a remarkable film. I've read many comparisons between \"The Pianist\" and \"Schindler's List\" on this board, and even though the films are quite different, the overpowering portrayals of Man's inhumanity against Man will leave the viewer forever affected. Adrien Brody's Best Actor award was stunningly achieved here, as his character arcs through an incredible series of circumstances to barely survive life in the Warsaw Ghetto during World War II. What little I knew of director Polanski outside of his marriage to Sharon Tate, the grisly Manson murders, and his rape conviction in the late 1970's, was put into an entirely different perspective when I learned about his own life in the Polish Ghetto. Much of what we see in the film must emanate from his own unique experience as a child during the War and experiencing Nazi atrocity first hand. I don't envy anyone who survived that experience enduring the painful daily memories of those times.Given the film's title, I guess I was somewhat surprised by the paucity of musical sequences, though what was offered was artistically presented. Particularly poignant was the scene when Wladyslaw Szpilman (Brody) was left to hide in an apartment where a piano was available, and he mimed his way through a selection from memory by the need to maintain silence.Many years following the end of World War II, a single film cannister simply marked \"The Ghetto\" was discovered, revealing valuable insight into how the Nazi propaganda machine attempted to manipulate public opinion about 'rich' Jews who lived in luxury alongside fellow Jews in squalid conditions. Even more intimate details of life in the Warsaw Ghetto are presented in \"Shtikat Haarchion\" (A Film Unfinished), describing conditions that are even more horrific than those depicted in \"The Pianist\" or \"Schindler's List\", if that can even be imagined. These movies exist for a higher calling as a constant reminder that the term \"Never Again\" be one to constantly take seriously in an ever increasingly dangerous world."
    },
    {
      "username": "dtb",
      "userUrl": "https://www.imdb.com/user/ur0292400",
      "reviewLink": "https://www.imdb.com/review/rw0746880",
      "warningSpoilers": false,
      "date": "9 January 2004",
      "rate": "10",
      "helpful": "160 out of 198 found this helpful.",
      "title": "Adrien Brody's Minimalist Acting Packs Maximum Emotional Punch",
      "content": "This wrenching yet ultimately uplifting fact-based drama won Adrien Brody his Academy Award and finally made him a star (along with his gracious yet heartfelt Oscar speech and That Kiss :-) -- rightly so, since title character Wladyslaw Szpilman is a challenging role in so many ways! It's not easy to command the screen when your character often has to be passive, deliberately trying not to draw attention to himself to keep from falling into Nazi hands in war-torn Poland, but Brody pulls it off. It helps that Brody is absolutely stellar at acting with his eyes, plus his body language speaks volumes; these fill in the emotional cracks, especially in scenes where Szpilman, alone and in hiding, can't speak or even move around much for fear of giving himself away. (Brody is the youngest actor to date to win the Best Actor Oscar, BTW, having gotten his little gold man only a month before his 30th birthday.) While there's no lack of haunting scenes, thanks to the deservedly Oscar-winning work of director Roman Polanski and screenwriter Ronald Harwood, the one that always gets me is the one where Szpilman discovers the apartment serving as his latest `safe house' has a piano. We see Szpilman sit at the piano; we see him in a head-and-shoulders shot, shoulders moving; we hear piano music and gasp as we fear his love and longing for music is about to give him away -- and then we see his hands moving in the air just above the keyboard and realize, with both relief and a pang of regret, that the music is only in Szpilman's head. Terrific as the other 2002 Best Actor nominees were, now that I've seen THE PIANIST (as well as the fascinating making-of documentary on the DVD's flip side, showing what a physically and emotionally grueling experience Brody's job often was), I'd be really p***ed off if anybody but Adrien Brody had won! (Besides, the rest of the 2002 Best Actor nominees already won Oscars -- this time it was dark horse Brody's turn! :-)"
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1167092",
      "warningSpoilers": true,
      "date": "6 September 2005",
      "rate": "10",
      "helpful": "68 out of 92 found this helpful.",
      "title": "Definitively an inspiring epic...",
      "content": "'The Pianist' is definitively an inspiring epic that celebrates the tenacity and fortitude of the human spirit... It is a remarkable tale of human survival sensitively brought to life by Polanski... The film carries us to the horrible reign of terror, where condemned people wearing the emblem of humiliation and oppression, are deprived of their rights, their human values and dignity, before being shipped to 'labor camps.' In Polanski's movie all the conventional elements of the drama are at peaks of excellence: Family union: When a father has to bargain to buy a single piece of caramel and divide it in six pieces to share it with each member of his family...Starvation: When a ghetto inhabitant assaults a helpless woman for a bowl of soup... Confusion: When a distraught woman wails on a platform because she smothered the cries of her baby with her hand...Love: When a young musician turns to his younger sister and utters with sad regret, \"I wish I knew you better.\" Survival: When one man observes the war through his hide-outs around the city...Cruelty: When an old man in a wheelchair is thrown off the balcony by the Nazis because he failed to stand upon their entrance...Fear: When a talented musician sits down at the old piano, and pretends to play his music, keeping his fingers flowing with control above the vertical ivories...Discrimination: When bored Nazi guards entertain themselves by forcing grotesquely mismatched old and sick couples to dance to a Jewish street band by the ghetto gate...Horror: When condemned Jewish workers lie face-down in the street, while one SS guard walks down the line, shooting without remorse each one in the back of the head... Isolation: When a fugitive emerges from his harrowing hiding place and walks through a field of deserted ruins exactly like the last man alive on Polish soil..Adrien Brody gives an absolutely moving performance (based on descriptive facial expressions) as the Polish composer and pianist who stays alive as a Jew, and remains true to his ideals... Brody captures the character's desperation, his anger and grief, his willpower and perseverance, his passion and love of music... Polanski gives us the chance to better know his shock and disbelief, his ordeal and tragedy, his hope for fairness and humanity...Nominated for seven Academy Awards, this captivating drama went on to win three Oscars, including Best Director, Best Actor, and Best Adapted Screenplay... Once Brody took the stage to accept his Oscar, he was so overwhelmed with happiness, that he swept the gorgeous Academy Award-winning Halle Berry off her feet with a long, steamy kiss..."
    },
    {
      "username": "baba44713",
      "userUrl": "https://www.imdb.com/user/ur4119395",
      "reviewLink": "https://www.imdb.com/review/rw1055519",
      "warningSpoilers": false,
      "date": "7 April 2005",
      "rate": "9",
      "helpful": "200 out of 264 found this helpful.",
      "title": "terrific movie, if relentlessly gritty and realistic",
      "content": "I remember seeing \"Schindler's list\" about ten years ago, and I remember how weird I felt for being almost completely unmoved by it. Although it showed the horrors of holocaust quite realistically, somehow it all seemed just a bit too fake and exaggerated. Characters were a bit off (I still can't decide who was more over the top, Schindler or Goeth), fake sentimentalism was all over the place, . While it was a work of art and an important reminder of true events that shouldn't be forgotten, on emotional level it just somehow failed to deliver.Enter \"The Pianist\". With no Spielberg around to put his trademark sappy material, we finally have a movie that shows the true horror and tragedy of Jewish people in World War II. The story is told through the eyes of one man - Wladislaw Szpielman, Jewish pianist who works in a radio station in Warsaw during the German occupation of Poland. Together with him we watch his world getting torn apart, witness his family being taken away, his existence being reduced to bare essentials. Brody gives a subtle yet spectacular performance, his best work yet. And never once are we reminded that we are watching a movie. Everything is shown from Szpielman's point of view, and it is all very gritty and realistic. While Spielberg's rendition of German atrocities always had a slightly staged feel to augment their dramatic purpose, here they are so true to life there impact is much greater - you watch and are being reminded in horror that this things actually happened.While being very hard to watch sometimes, this is a movie that \"Schindler's List\" was supposed to be. This movie doesn't judge anybody, or tries to explain anything - it shows historical events as a reflection of one man's fate, making a powerful testimony that stays with you long after the beautiful last shot and the end credits are over."
    },
    {
      "username": "Xanan",
      "userUrl": "https://www.imdb.com/user/ur1085159",
      "reviewLink": "https://www.imdb.com/review/rw0746503",
      "warningSpoilers": false,
      "date": "20 January 2003",
      "rate": "10",
      "helpful": "359 out of 425 found this helpful.",
      "title": "10 out of 10",
      "content": "The Pianist is an account of the true life experience of a Polish pianist during WW2, in the context of the deportation of the Jewish community to the Ghetto of Warsaw, a setting virtually absent from all films inspired on WW2. Polanski (himself a child survivor of the Krakow and Warsaw ghettos) could have described in more detail the legendary, desperate fighting of the Jewish resistance in the ghetto of Warsaw, or the horrific mass extermination in concentration camps. Instead, the film gains in intensity by displaying the war from the pianist's own point of view (through windows, half-opened doors, holes in the walls - with big emphasis on the use of \"point of view shooting\" by the cameraman). One cannot help feeling disturbed by the most enthralling scenes of the film, as the isolated pianist tries to ensure his survival in the ghetto and ruins of Warsaw, hiding and fleeing, moving from one bombed house to the next, gradually becoming a shadow of his former self, hungry and afraid (merit largely attributed to the extraordinary performance by Adrien Brody, who visibly loses half of his weight throughout the film).Does the pianist raise any sympathy from the audience? Not immediately, in my view. The pianist is more than often a drifting character, almost a witness of other people's and his own horrors. He seems to float and drift along the film like a lost feather, with people quickly appearing and disappearing from his life, some helping generously, others taking advantage of his quiet despair, always maintaining an almost blank, dispassionate demeanour. One may even wonder why we should care in the least about this character. But we do care. That is, I believe, the secret to this film's poetry.In one of the strongest scenes, towards the end, a German officer forces the pianist to play for his life, in an episode that suddenly brings a much lighter, beautifully poetic shade to the film (this German officer will be probably compared to Schindler, although his philanthropy does not quite share the same basis).This is also a wonderful tribute to Polish artists, through Chopin's music, with the concert at the very end of the film and the opening performance by the pianist at the local radio station (with the sound of bomb explosions in the background) forming an harmonious link between the beginning and end of the film (following Polanski's usual story-frame).Overall, The Pianist is one of the most detailed and shocking accounts of the treatment of the Jews by the Nazis, with the atmosphere in Warsaw well captured and believable. Quite possibly, The Pianist will remain in the history of film-making as the most touching and realistic portraits of the holocaust ever made.Polanski's film deserves a strong presence in the 2003 Oscar nominations, including a nomination for Adrien Brody's amazing performance, Polanski's sublime direction, best adapted screenplay and, obviously, best picture. This could be, at last, Polanski's long awaited, triumphal comeback to the high and mighty Hollywood."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3688500",
      "warningSpoilers": true,
      "date": "19 April 2017",
      "rate": "9",
      "helpful": "12 out of 15 found this helpful.",
      "title": "Heartfelt and enthralling",
      "content": "THE PIANIST is a film that takes a dark and disturbing subject matter - the persecution of the Warsaw Jews by Nazis in the Second World War - and turns it into a spellbinding, enthralling journey of a movie. Roman Polanski could easily have made this maudlin and sentimental like Spielberg's SCHINDLER'S LIST, but he thankfully avoids that temptation and the result is the much better movie of the two.This film contains a documentary-style realism in its depiction of the various atrocities carried out by the uncaring Germans. It gets dark and darker as it goes on, and yet the viewer is unable to tear his eyes off the screen because it's all so well-realised and realistic. Adrien Brody plays the eyes and ears of the viewer in a subdued manner, yet delivers his greatest and most believable performance as a result. The story has a lot of darkness and violence, but Polanski's expert camera-work and endless style stops the subject matter ever becoming depressing; instead there's enough tension to keep you involved and wanting to find out what's next. Things build to a suitably touching and poignant climax that doesn't disappoint."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw2125003",
      "warningSpoilers": false,
      "date": "10 September 2009",
      "rate": "10",
      "helpful": "17 out of 23 found this helpful.",
      "title": "Tour de Force",
      "content": "There have been so many fine films that deal with the Holocaust. Each shows the atrocities of the Germans, their random cruelty, their ruthlessness. This film has all that, but it also has Adrien Brody. This is a film that gets us inside the human being, the person who must run, whose iron will propels him forward. The thing is, though, he is not necessarily a hero in the traditional sense. We sense the fatigue of his character as he runs from situation to situation, just trying to stay alive. There are good people around him, many are good Germans. While we watch people shot in the head, beaten to the ground, mutilated, we see him moving aimlessly toward something (the thing is we don't know what that something is). He hears rumors about the Russians liberating Poland but he can't let up for a second. He watches as the underground makes sacrifice after sacrifice, their building burned, their people sent up in flames. He sees himself as a coward. He thinks about being dead, but his will to live drives him on. The title, of course, is him--the pianist--a nationally known classical pianist, suddenly dehumanized. We see his weaknesses and his strengths. We also get a more balanced though terrifying view of the situation in the Polish ghetto. This is a film we should all see."
    },
    {
      "username": "ashcoounter",
      "userUrl": "https://www.imdb.com/user/ur1291471",
      "reviewLink": "https://www.imdb.com/review/rw0746526",
      "warningSpoilers": false,
      "date": "1 February 2003",
      "rate": "9",
      "helpful": "144 out of 185 found this helpful.",
      "title": "Brilliantly Narrated, Visually Stunning!",
      "content": "Polanski has depicted the gory details of the holocaust without much restraint. But, the most wonderful aspect of the film is that the director has not lost focus of his story and instead of focusing too much on the holocaust horror he has weaved the true-life narrative of survival around devillish happenings.Every single act of escapade Szpilman goes through is depicted like a drop of water on a barren desert. However, the Oasis in the driest desert comes in the end and it is here that Polanski captures the essence of human emotion. I had this very strong urge of jumping into the theater screen and magically adopting a character in the movie and doing something about the helplesness portrayed so convincingly.Overall, Polanski has given a stunning visual narrative of the cold war. Survival indeed is a privilege though it is taken for granted today. Performances by Brody, Kretschmann deserve applause.Pawel Edelman's camera work is moving and he has brilliantly captured the dark sadness in the visual canvas in an effective way. The lighting is amazing. Pre-dawn shooting schedule could have helped a great deal.Hervé de Luze's editing work has ensured that the narrative does not slip away from focus. Most notable is the scene where the human bodies are lit on fire and the camera raises to show the smoke. The darkness of the smoke is enhanced and is used effectively to fade the scene out.The scene where Brody's fingers move as he rests his hands on the bars of the tram handle only goes to show the brilliance of Polanski as a film-maker.Great film that will be in the running for this year's Oscars. I will give it a 9 Out of 10."
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw1866580",
      "warningSpoilers": true,
      "date": "30 April 2008",
      "rate": "8",
      "helpful": "18 out of 27 found this helpful.",
      "title": "Survivor",
      "content": "Film makers have to step carefully when dealing with issues like the Nazi extermination program. There have been equally brutal programs of ethnic cleansing in places like Southeast Asia and Rwanda, in which hundreds of millions died, but nothing like this in Europe since the Middle Ages. The victims here were not only Jews but Gypsies, the mentally ill, homosexuals, socialists, communists, and political undesirables. The Nazis eliminated not six million but some uncountable number between 12 and 15 million. An event like that can't be treated lightly and milked for easy tears, or the event itself is cheapened.Fortunately, the films that have explored the subject have been uniformly well done, as Roman Polanski's \"The Pianist\" is well done. Polanski himself suffered in much the same way as the protagonist, Vlad Szpilman (Adrien Brody). Polanski has a habit of embellishing his tales but there's no question that in this instance he knows what he's talking about.Szpilman is a well-known young pianist on Warsaw radio but the German occupation puts the station out of business. He and his family are herded into the Warsaw ghetto where they are subject to constant abuse and occasional murder. Szpilman barely escapes being sent to Treblinka with the rest of his family. And for the last half of the film, with the help of some friends who endanger themselves by lending him aid, he scuttles rat-like from one hiding place to another, each more dismal and perilous than the last. He suffers jaundice, his hair and beard grow long, his clothes turn to tatters, his food disappears, he's half frozen, and he seems to shrink.He's reduced to living in the attic of a nearly demolished apartment building and is ecstatic to discover a gallon can of pickles overlooked on the top shelf of a kitchen cabinet. The can falls out of his hands while he tries to open it and rolls across the floor to come to rest at the boots of a German officer, Captain Hosenfeld (Thomas Kretschmann). The only Germans we've seen so far have been brutes -- ridiculing the insane, executing Jews who ask simple questions, or simply shooting people chosen at random.We expect nothing from Hosenfeld except a quick shooting. But Hosenfeld is a human being and, having discovered that Szpilman \"is\" -- or rather \"was\" -- a pianist, he asks him to play a piano left in one of the flats. Szpliman has been unable to play for years and when he seats himself we worry that he might not bring it off and, indeed, his first chords are tentative, uncertain. Then his playing becomes automated, the old habits return, and he dashes off a dramatic and exquisitely executed piece of Chopin. Hosenfeld has been leaning back, enjoying the music, then leaves Szpilman quietly to his attic. He returns a few times later, before the Germans withdraw before the Russians, and unceremoniously hands him a few packages of food and, finally, his overcoat. The matter-of-fact compassion shown by Hosenfeld, and Szpilman's desperate need for contact with another human, are very moving.When the Russian troops finally arrive, Szpilman stumbles out of his hovel to greet them, but seeing his overcoat the Russians open fire on him. Szpilman finally convinces them that he is a Pole, not a German, and one of the befuddled soldiers asks, \"Then why the ****ing coat?\" Szpilman is trembling with fear but manages to gulp, \"I was cold.\" An epilogue tells us that Szpilman went on with his career and Hosenfeld wound up in a Soviet prison camp where he died in 1952, despite Szpilman's attempt to find him. Under the end credits, a smiling Szpilman plays a lively, sparkling composition by Chopin.It's a remarkable film. Polanski is no longer the Wunderkind but a mature film maker. Nothing is excessive. We need only as much as we need to know to understand Szpilman's travails -- one tragedy following another. There are no sentimental speeches at the final parting of Szpilman and his family. Szpilman himself never breaks down. He simply does what needs to be done to survive. And Adrien Brody captures what Szpilman must have been like. (From some angles he resembles the young Arthur Rubenstein.) Kretschmann gets Hosenfeld down pat as well. In their scenes together we sense their respective positions -- one man with nothing left to lose, the other with nothing left to gain. The story, and the historical facts it's based on, raise many questions about human nature, of course. I'm not at all sure that if we could find the answers to those questions we would like what we found.One of the better films of the year."
    },
    {
      "username": "johnharapa",
      "userUrl": "https://www.imdb.com/user/ur67115472",
      "reviewLink": "https://www.imdb.com/review/rw7473955",
      "warningSpoilers": false,
      "date": "23 October 2021",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Harrowing Performance by Adrian Brody",
      "content": "Some reviews I've read here, have found this movie too detached, lacking urgency. I believe, that impassive quality reflects exactly what Polanski wants to say this extraordinary jewel.By showing Wladyslaw Szpilman as a survivor but not a fighter or a hero--as a man who does all he can to save himself, but would have died without enormous good luck and some kindness from a few non-Jews--Polanski is reflecting, I believe, his own deepest feelings: that he survived, but need not have, and that his mother died and left a wound that had never properly healed.Adrian Brody's performance was utterly mesmerising. I doubt that we'll see him act like that - EVER.Little wonder he was awarded Best Male Actor at the Oscars.Polanski too was awarded Best Director - ironic Brody was the youngest recipient of an Oscar and Polanski was the oldest until Clint Eastwood won it several years later."
    },
    {
      "username": "KineticSeoul",
      "userUrl": "https://www.imdb.com/user/ur22171966",
      "reviewLink": "https://www.imdb.com/review/rw2386595",
      "warningSpoilers": false,
      "date": "16 February 2011",
      "rate": "7",
      "helpful": "29 out of 47 found this helpful.",
      "title": "Lacks a bit of character development and not as powerful as I expected it to be",
      "content": "This is a well crafted movie that deserves some praise, but I still felt the film is a bit overrated. I guess it's cause I was expecting a phenomenal and amazing movie, but what I got was a pretty good movie. It just wasn't as powerful or compelling as I thought it would be. Adrien Brody was almost perfect for this role, his transition from being a prideful musician to a broken down man was done really well. This film just wasn't all that challenging, the plot is basically based on a true story of Władysław Szpilman(Adrien Brody). And his struggle to survive during the Holocaust. The thing is the whole thing seems a bit conventional a lot of aspect of this movie just seemed to narrow at times and straightforward which isn't necessarily a good thing and lack depth. The film also seemed to drag a bit because of the direction it kept going, it's a good movie and I agree with some of the positive feedback this film has been getting. It just isn't a powerful or amazing film I was looking forward to seeing, not one of those movies I feel I need to see again someday after it's finished. It really isn't a masterpiece like come critics claim it to be.7.8/10"
    },
    {
      "username": "csab-39797",
      "userUrl": "https://www.imdb.com/user/ur84902328",
      "reviewLink": "https://www.imdb.com/review/rw4655624",
      "warningSpoilers": false,
      "date": "13 February 2019",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Adrien Brody at his best. A True heartbreaking story!",
      "content": "Everything about this movie is made in perfect detail; the clothes, the buildings etc. The audience gets to see how the Jewish population in Warsaw started out as normal everyday citizens and how the German government slowly brought them to their deaths. The acting is not over the top it's completely realistic and Adrien Brody is MAGNIFICANT! If you don't shed a tear or get chills watching this true story then you have no soul!"
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6213177",
      "warningSpoilers": false,
      "date": "28 October 2020",
      "rate": "7",
      "helpful": "17 out of 27 found this helpful.",
      "title": "Warsaw Fact...",
      "content": "Around 30% of Warsaw's population was Jewish in 1939, about 375,000 people; with refugees, the population of the ghetto rose to 450,000 - over 80,000 perished in it; deportations to Treblinka began in July 1942 (Yad Vashem).I would rather have seen this film in the languages of those it portrays using actors from the countries and regions where these despicable, heinous and unforgivable events took place. It would have made an already immensely powerful reflection even more so."
    },
    {
      "username": "Buddy-51",
      "userUrl": "https://www.imdb.com/user/ur0375636",
      "reviewLink": "https://www.imdb.com/review/rw0746745",
      "warningSpoilers": false,
      "date": "14 June 2003",
      "rate": "",
      "helpful": "14 out of 22 found this helpful.",
      "title": "gripping though flawed drama",
      "content": "`The Pianist' is a bit like `Schindler's List' as seen from the inside out. The one flaw in that earlier film always seemed to be that, by choosing to make a Gentile  Oskar Schindler - the protagonist in his film, Spielberg turned the Jews themselves almost into background players in their own story. That doesn't happen with `The Pianist' since the hero in this case happens to be himself a Jew  the real life Polish pianist and composer Wladyslaw Szpilman - who managed, through strength, determination and the assistance of a number of brave and caring individuals, to survive the horrors of that darkest and most inexplicable chapter in 20th Century history.This is not to say that `The Pianist' is a better film than `Schindler's List'  far from it. For while this latest work from Roman Polanski is a fascinating tale of survival in its own right, the film lacks the moral and psychological resonance that made Spielberg's work such a universally acclaimed masterpiece. Because Schindler was an outsider looking in, he was forced to make the kind of moral choices that Szpilman never really faces in the situations in which he finds himself. In fact, the one time that the protagonist is confronted with such an option  having to decide whether or not to betray his people by joining the Jewish police whose job it is maintain order in the Warsaw ghetto  Szpilman flat out declines the offer. This may, indeed, be the way circumstances played themselves out in real life, but this elimination of any kind of psychological depth makes `The Pianist' seem frustratingly superficial at times.Although the film isn't as rich and powerful as it might have been, `The Pianist' is still exceptional on a lot of different levels. First of all, Polanski and his screenwriter, Ronald Hardwood, both of whom won Oscars for their work here, capture the brutality and sadism of the Nazi regime with frightening candor and almost `reportorial' objectivity. As in `Schindler's List,' people in this film die in very believable, very graphic ways. Particularly interesting are the early sections of the film in which we witness the gradual steps leading up to the eventual deportation and extermination of the Warsaw Jews, beginning with the curtailment of Jewish civil rights, then to the branding of them with stars of David on their clothing, then to their imprisonment in the Warsaw ghetto, and, finally, to the inexorable walk to the gas chamber. `The Pianist' doesn't take us that far on screen, but we sure sense the presence of those death camps in the loss of Szpilman's entire family. `The Pianist' brilliantly recreates this shameful era in recent human history and does so without becoming sentimental and pretentious in the process. Adrian Brody won the Best Actor Oscar for his performance here, and he is very good indeed, especially given the fact that the role calls for him to be more of a reactor to the events around him than a catalyst. Polanski and Hardwood have provided this fine young actor with a veritable tour de force assignment that he executes with a great deal of skill and aplomb. Unfortunately, a number of the other characters - particularly those who go out of their way to help him - remain stubbornly enigmatic throughout.`The Pianist' is an honorable addition to the list of fine films that have attempted to come to grips with the subject of the holocaust. But, for my money, the best still remains `The Shop on Main Street,' the Oscar-winning Best Foreign Language film of 1965. This superb Czech film does what `The Pianist' is never quite able to do, which is to find a way to involve us in the momentous moral dilemmas that undoubtedly faced many of the people involved in this life-and-death event. `The Pianist,' by making its tale strictly a story of survival and not a study of human psychology, fails to illuminate much of what we really need to know about that time. And about ourselves."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw1977291",
      "warningSpoilers": false,
      "date": "18 November 2008",
      "rate": "8",
      "helpful": "11 out of 17 found this helpful.",
      "title": "Intense biography about a Polish pianist named Szpilman during the Warsaw ghetto",
      "content": "This is an emotionally tale and very decent drama about a pianist named Szpilman from luxurious life until terrible ending in the Warsaw ghetto. Polanski correctly directs a spellbinding portrait about the holocaust with his personal knowledge and proper experience on his childhood . Adrien Brody is excellent in a complicate and suffering role. Besides splendid actors, Frank Finlay,Jessica Meyer, Emilia Fox and Thomas Kretschman as a good Nazi officer who helps him. Evocative cinematography by cameraman Pawel Edlman, Polanski's usual. Musical score by Wojciech Kilar with brilliant piano sounds. Academy Award for best director Roman Polanski, Actor, Adrien Brody and adapted script by Ronald Harwood based on Wladyslaw Szpilman memories.Adding more details over largely described on the movie referred 'the Warsaw ghetto uprising', the events happened on the following manner : In 1939, after the invasion of Poland, Reinhard Heydrich chief of Gestapo began to place all Polish Jews in ghettos, where they could slowly die of hunger and disease. The campaign was to be administered by the Waffen-SS the party's military formations that fought as integral units in the armed forces. The Warsaw ghetto was the largest of these segregated areas established by the Nazis in Poland. In 1940 Heydrich, using the excuse that the spread of typhus had to be contained, set up a special section 11 miles in circumference enclosed by a brick wall 10 feet high. The cost was paid by the Judenrat, the Jewish Council of twenty-four-members, which was in charge of Jewish affairs inside the ghetto. In 1940 more than 80.000 gentile Poles living in the infected area were ordered to leave, and the next month about 140,000 living elsewhere in the city were moved in which the 240,000 still live in the ghetto. Some 360.000 Jews, a third of Warsaw's population, were herded into a 3,5-square-mile area. Meanwhile, Gestapo agents removed all Jews from the economic and cultural life of the city, from factories,shops, theaters, and libraries. On November 15,1940, the ghetto was sealed and its twenty-two entrances closed. No one was allowed to leave or enter, there was to be contact with the outside world.The situation soon became critical,Jews fought for jobs in the ghetto, including work with the labor battalions organized by the Nazis. Those unable to find work tried to exist by selling jewels,clothing, or anything else to obtain food. From 300 to 400 died daily in the Warsaw trap. More than 43.000 starved to death during the first year. Children crazed by hunger crawled through the sewers to the non-Jewish sectors of the city to smuggle in a bit of food. People were no longer moved by the sight of men and women falling dead on the streets. The Nazi authorities began intensified measure on July 22, 1942. As a memorial to Heydrich, Heirich Himmler ordered all Jews except those already in concentration camps to be deported .The ghetto and all labor camps would then be destroyed. Mass deportations to the gas chambers of Treblinka began. In two months 300.000 Jews were eliminated. The Judenrat was ordered to deliver 6.000 Jews daily for deportation. Each day thousands were driven by guards through the gates.Young Zionists, pioneers training to go to Palestine, mobilized first to be followed by members of the Polish workers party . On July 28, 1942, the Jewish Combat organization consisting about 1.000 men and boys was formed. All resolved to kill as many of their tormentors as they could before they died.The Jews fighting from rooftops, cellars, and attics,Poles outside the ghetto now began to send in more revolvers, grenades, and dynamite. In 1943 the guerrillas divided into twenty-two groups built an intricate network underground cellars and tunnels ,linked with command posts . In April 19,1943 German troops moved in on the ghetto to send all who were left to Treblinka in a final action. First came the armed trucks, tanks, and armored cars. The ghetto fighters poured a hail of bullets, grenades and bombs, the fighting went on for twenty-eight days. The guerrillas fought to the last. Many committed suicide at the moment before capture. The Germans dragged survivors from the cellars and rubble. Fewer than 100 escaped, the last 60000 Jews had been exterminated or killed in the explosions and fires.Polish sources reported that the fighters had killed 300 Germans and wounded 1000. From Warsaw Jewish resistance moved to swamps and forests."
    },
    {
      "username": "dbdumonteil",
      "userUrl": "https://www.imdb.com/user/ur1219578",
      "reviewLink": "https://www.imdb.com/review/rw1249882",
      "warningSpoilers": false,
      "date": "29 December 2005",
      "rate": "10",
      "helpful": "12 out of 19 found this helpful.",
      "title": "Spilzman? What a beautiful name for a pianist...",
      "content": "In March 2003, Roman Polanski's \"the Pianist\" (2002) pocketed three Oscars including best actor (Adrien Brody) and best director (Roman Polanski). One month earlier, the ceremony of the French Oscars showered the movie with praise by attributing to it and his author similar prizes. Earlier in May 2002, the festival of Cannes crowned it of the most prestigious prize: the deservedly Golden Palm. Already in 2002 and chiefly throughout 2003, awards rained on Polanski's deeply moving piece of work and rightly so. It is a true return to form for him after an uneven career which started after the spooky \"the Tenant\" (1976) and wildly oscillated between duds (Pirates, 1986, Frantic, 1988) and palatable but not peerless works (Death and the Maiden, 1994, the Ninth Gate, 1999). \"The Pianist\" helped to rekindle the flame that made such treasures, hallmarks in their own domains (the wonderful \"Rosemary's Baby\", 1968 in the fantastic or the fabulous \"Chinatown\", 1974 in the film noir) and could be a stalwart success in the movie with the Second World War as the backdrop. It is perhaps Polanski's most personal film to date and the one he has always wanted to shot, surely to exorcise traumatic memories haunting him since his childhood. Like his main protagonist, Wladyslaw Szpilman, he experienced the horror of the ghetto of Warsaw.To get his demons out of his head, he preferred to adapt for the screen Spilzman's memories, a genius pianist and a man who bit by bit lost his family and friends on whom he could rely, a man who was deprived of his piano and thus of his \"raison d'être\". As Stefan Zweig says: \"to read is to live\", well for him \"to play is to live\". Even when he has the opportunity to play, he has to refrain himself. See the scene in which he has settled down to his flat. Before leaving him, the owner says to him: \"please, don't make noise\". Polanski makes us share his craving for playing by putting his main protagonist in front of the sacred instrument ans plays us the music in Spilzman's head without the latter touches the keys. He was also a man who saw sorrow, pain and the unthinkable (the sequences in which German officers and soldiers kill Jewish people give goose pimples because they're precisely unthinkable). Throughout his sufferings, chance didn't totally relinquish him: he was rescued at the last minute by a Polish policeman (and a fellow of his brother) who stopped him from going up in the train of death to Auschwitz. At this moment, he was saved from death but he lost his family. Then, he had to rely on his courage to survive and enjoyed the help of some fellows even if they absconded (the woman Spilzman made the acquaintance at the beginning of the film and her husband who found him a flat). At last, the German officer at the end of the film, was his ultimate glimmer of hope.Roman Polanski shot his film with a classic but startling directing for the sake of detail and realism. It has a linear but inevitable progression which has the look of a downward spiral: the tightening of the restrictions on Jewish people which become increasingly harsher (the armband to distinguish the Jewish from other peoples, then the delimitation and the encircling of the ghetto, the Jews chased away from their neighborhood and deported to the extermination camps) and the least sign of certainty is nearly automatically blighted: \"we have work certificates at last\" sighs Spilzman's father. Alas! Hopes blighted since just as he pronounces these words, a German officer asks them with other people to go outside. Some of them are killed while the others (including Spilzman's family) have to wait on a large square with thousands of others. Polanski also relates notable events with a minimum of means (the fight and shooting sequences are often perceived from a balcony or a window).The second part of the film strongly recalls Polanski's murkiest hours extracted from his masterworks. For example, in his flat, Spilzman tries to be as quiet as possible and while searching for food in his kitchen and drops crockery. The noise makes his neighbor intervene and by giving the alarm in the building obliges him to flee once again. At this moment, we find one of Polanski's trademarks: the eerie neighbor who has a harmful influence on the hero and contributes to his or her fall (the Castevet in \"Rosemary's Baby\", the offbeat inhabitants of the building in \"the Tenant\". In another extent, when Spilzman has to lurk in the destroyed ghetto (the distant shot where we can see him trudging in the ruins of this apocalyptic landscape deserves to rank among Polanski's most notable shots in all his filmography), Polanski really places us amid a \"in camera\" in spite of the sprawling scenery.The filmmaker should also be thanked for having chosen Adrien Brody in the main role. He works wonders in a part which seemed to be tailor-made for him, a far cry from his cardboard character in M Night Shyamalan's \"the Village\" (2004). He can act several persona in himself: a smart young man as well as a dirty and bearded tramp. His angular face, his acute and melancholic countenance stay with us for a long time. As for the German officers, they are often caricatured but ultimately Polanski eschews the trap of Manicheism which seemed to pervade the whole film thanks to the last sequences with the sympathetic German officer. Not all Nazis were beasts...Interspersed with either unbearable, either excruciating or either moving sequences and with striking shots, \"the Pianist\" has its place on the podium of Polanski's towering achievements. See it any costs! Unfortunately it would seem that the flame began to flicker again given the lukewarm critics \"Oliver Twist\" met this year. The slump again? Only time will tell..."
    },
    {
      "username": "orangeisthenewawesome",
      "userUrl": "https://www.imdb.com/user/ur10615203",
      "reviewLink": "https://www.imdb.com/review/rw2389056",
      "warningSpoilers": false,
      "date": "21 February 2011",
      "rate": "10",
      "helpful": "20 out of 28 found this helpful.",
      "title": "Unforgettable",
      "content": "My husband and I decided to watch this on netflix one night as we had heard it was good. Neither of us had any expectations and figured if it won a couple of Oscars it must be decent. I had no idea it was an absolute masterpiece. This may be one of the best movies I have seen to date. Days after I saw this movie I cannot stop visualizing the images and feeling the emotions conveyed in the film. The cinematography is breathtaking. The beauty of pre-devastation Warsaw is sharply contrasted with the bleakness of the ghetto, and it would be understatement to say how haunting the visuals of Warsaw after the bombings were. The acting here is tremendous. Brody (who I had really not seen in anything else significant prior to this) carries the entire movie on his wan shoulders. He conveys so much with pain, anguish, hope, and loss with just his eyes. It is quite the actor who causes the viewer to feel the pain he is experiencing as a character. This was an extremely well deserved acting Oscar.This movie is extremely depressing considering the subject matter but it is told and portrayed with grace and power by Polanski. So many scenes are powerful and haunting. To me, in many ways this is a perfect movie. Yes, I know this review is filled with hyperbole, but I simply cannot remember the last time I was so moved and impressed by a film as I was with the Pianist. See it at least once."
    },
    {
      "username": "zetes",
      "userUrl": "https://www.imdb.com/user/ur0391152",
      "reviewLink": "https://www.imdb.com/review/rw0746771",
      "warningSpoilers": false,
      "date": "6 July 2003",
      "rate": "8",
      "helpful": "14 out of 23 found this helpful.",
      "title": "Good, but imdb voters are overrating it",
      "content": "The Pianist is far from Roman Polanski's best film or his `most personal work,' as the back of the DVD case says. In fact, it's easily the least personal film I've seen from him; any director who has enough clout to secure the funding for the production could have made this film and had it turn out just as well. As a director, it is a small achievement. Likewise, the screenplay writes itself; in fact, it did write itself, as it's based on a true story. I must admit I have a bias against films dealing with WWII and especially the Jewish experience in Europe. Affecting the audience is as simple as snapping one's fingers. Or, more specifically, executing a Jew. Whenever the audience starts to get a little comfortable, all the filmmaker has to do is have a Nazi shoot a Jew in the head. It's all too easy. Any film with that subject matter is automatically deemed important in the minds of critics and audiences, which makes it difficult for anyone to propose any criticism against it. Truth be told, The Pianist is a very good film. It's well done, and, while I don't think it's Polanski's best work, he does a good job. But it's too easy, I think, to overpraise something like this. It was very entertaining that this movie caused so many upsets at the Oscars, but, after seeing the film, it doesn't surprise me. This is the kind of movie that impresses the Academy most, because it's easy. The three awards it won were not deserved, at least in my opinion. If I weren't so familiar with the Academy and their thought processes, it would really shock me that Polanski beat Scorsese, who made an original picture with verve and passion, and that Brody (I haven't mentioned him, and he is good) beat Daniel Day-Lewis, who, as I've just said above, creates a character that will live forever. As for the screenplay, Ronald Harwood (and/or Polanski) could have made the film much more than just one of ten thousand tales of survival. There are a lot of moments when more substance could have been found. I like how Szpilman has to constantly watch the action while locked up in a room, yearning to be able to do something about it, but always relegated to the spectator's role. They do do well when they introduce the character of the Nazi soldier trying to make good by helping Szpilman, but they don't do very much. Of course, I think part of the point is that this man appeared and disappeared without much pomp or circumstance. In fact, it would have been more powerful if they had never revealed that Szpilman discovered who this man was. Of course, that might have been disrespectful.I have now seen all five Best Picture nominees from last year, and I would rank them as follows: 1) The Hours; 2) Gangs of New York; 3) The Pianist; 4) Lord of the Rings: The Two Towers; 5) Chicago. That I rank the actual winner last shouldn't raise eyebrows, because, to tell you the truth, I don't rank The Pianist and The Two Towers that much higher. The first two were original, intelligent, and challenging. The last three were much simpler, and it's no big surprise that they are more beloved. 8/10."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8833476",
      "warningSpoilers": false,
      "date": "28 January 2023",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "It's a captivating film.",
      "content": "Polish musician Wladyslaw Szpillman tries to cope with life in Naxi occupied Warsaw.I only recently watched Schindler's list, and was so moved, IMDb recommended The Pianist, and I was not disappointed, this was an incredibly powerful, moving, but upsetting movie.It charts the sequence of events, first the Polish Jews are moved from their homes, robbed, and placed into ghettos, made to wear a star of David, then finally moved into Concentration Camps.It just amazes me to think how and why these atrocities actually happened, still in living memory for some, surely one of the most shocking times in human history. You see the violence ramp up as the film progresses.It's an incredibly well made film, it looks terrific, people look very much of that time, surely a consideration the casting director used.Several things that always stayed with me, someone begging with a corpse laying on the ground that was one moment, another being the elderly man in the wheelchair, harrowing sequences.I thought Adrien Brody was excellent as Szpillman, a very understated performance, totally sincere, incredibly believable. Ed Stoppard, Frank Findlay, Maureen Lipman and others all so good.It's a long film, but incredibly rewarding.10/10."
    }
  ],
  "errorMessage": ""
}