{
  "imDbId": "tt1454029",
  "title": "The Help",
  "fullTitle": "The Help (2011)",
  "type": "Movie",
  "year": "2011",
  "items": [
    {
      "publisher": "Orlando Sentinel",
      "author": "Roger Moore",
      "link": "",
      "rate": "88",
      "content": "Davis and Spencer give faces and fully-fleshed out lives to women who must have been more than what they did for a living as The Help."
    },
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "https://www.rollingstone.com/tv-movies/tv-movie-reviews/the-help-125037/",
      "rate": "88",
      "content": "A deeply touching human story filled with humor and heartbreak is rare in any movie season, especially summer. That's what makes The Help an exhilarating gift."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/2011/film/reviews/the-help-1117945766/",
      "rate": "80",
      "content": "A stirring black-empowerment tale aimed squarely at white audiences, The Help personalizes the civil rights movement through the testimony of domestic servants working in Jackson, Miss., circa 1963."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Michael Phillips",
      "link": "",
      "rate": "75",
      "content": "Davis is reason No. 1 the film extracted from Kathryn Stockett's 2009 best-seller improves on its source material."
    },
    {
      "publisher": "The New Yorker",
      "author": "David Denby",
      "link": "",
      "rate": "70",
      "content": "The Help is, in some way, crude and obvious, but it opens up a broad new swath of experience on the screen, and parts of it are so moving and well acted that any objections to what's second-rate seem to matter less as the movie goes on. [15 & 22 August 2011, p. 96]"
    },
    {
      "publisher": "Arizona Republic",
      "author": "Bill Goodykoontz",
      "link": "https://help.azcentral.com/",
      "rate": "70",
      "content": "The acting is uniformly excellent, and the cause - dragging the beginnings of civil rights into Jackson, Miss., at great risk - couldn't be nobler. What the film lacks is a strong point of view."
    },
    {
      "publisher": "Boston Globe",
      "author": "Wesley Morris",
      "link": "",
      "rate": "63",
      "content": "The movie is too pious for farce and too eager to please to comment persuasively on the racial horrors of the Deep South at that time."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Kirk Honeycutt",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/help-film-review-219915/",
      "rate": "60",
      "content": "Taylor does capture the Jim Crow era and its anxieties well, but his characters tend toward the facile and his white heroine is too idealized."
    },
    {
      "publisher": "Boxoffice Magazine",
      "author": "Sara Maria Vizcarrondo",
      "link": "https://www.boxofficepro.com/",
      "rate": "40",
      "content": "A chick flick for do-gooders, The Help suffers from a malady common to the discrimination drama: its treatment of inequality is more condescending than the prejudice it aims to remedy."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Andrew Schenker",
      "link": "",
      "rate": "25",
      "content": "High school creative-writing-class ironies of all kinds abound in The Help."
    }
  ],
  "errorMessage": ""
}