{
  "imDbId": "tt1454029",
  "title": "The Help",
  "fullTitle": "The Help (2011)",
  "type": "Movie",
  "year": "2011",
  "language": "en",
  "titleInLanguage": "The Help (film)",
  "url": "https://en.wikipedia.org/wiki/The_Help_(film)",
  "plotShort": {
    "plainText": "The Help is a 2011 period drama film written and directed by Tate Taylor and based on Kathryn Stockett's 2009 novel of the same name. The film features an ensemble cast, including Emma Stone, Viola Davis, Bryce Dallas Howard, Octavia Spencer, Jessica Chastain, Allison Janney and Sissy Spacek. The film and novel recount the story of a young white woman and aspiring journalist Eugenia \"Skeeter\" Phelan. The story focuses on her relationship with two black maids, Aibileen Clark and Minny Jackson, during the Civil Rights Movement in 1963 Jackson, Mississippi. In an attempt to become a legitimate journalist and writer, Skeeter decides to write a book from the point of view of the maids, exposing the racism they face as they work for white families. Black domestic workers in 1960s America were referred to as \"the help\", hence the title of the journalistic exposé, the novel and the film. \"The Help\" brings to light the challenges and discrimination that African American people faced.\r\nDreamWorks Pictures acquired the screen rights to Stockett's novel in March 2010 and quickly commissioned the film with Chris Columbus, Michael Barnathan, and Brunson Green as producers. The film's casting began later that month, with principal photography following four months after in Mississippi. The film is an international co-production between companies based in the United States, India, and the United Arab Emirates.\r\nThe Help premiered at Beverly Hills on August 9, 2011 and went into general theatrical release in North America on August 10 by Touchstone Pictures. The film was a critical and commercial success, grossing $216 million worldwide and receiving positive reviews from critics, who mostly praised the acting (particularly that of Davis, Spencer and Chastain), though the film's depiction of race drew some criticism as having a white savior narrative. The Help received four Academy Award nominations including Best Picture, Best Actress for Davis, and Best Supporting Actress for both Chastain and Spencer, with the latter winning the award. The film also won the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture.",
    "html": "<p>The Help is a 2011 period drama film written and directed by Tate Taylor and based on Kathryn Stockett's 2009 novel of the same name. The film features an ensemble cast, including Emma Stone, Viola Davis, Bryce Dallas Howard, Octavia Spencer, Jessica Chastain, Allison Janney and Sissy Spacek. The film and novel recount the story of a young white woman and aspiring journalist Eugenia \"Skeeter\" Phelan. The story focuses on her relationship with two black maids, Aibileen Clark and Minny Jackson, during the Civil Rights Movement in 1963 Jackson, Mississippi. In an attempt to become a legitimate journalist and writer, Skeeter decides to write a book from the point of view of the maids, exposing the racism they face as they work for white families. Black domestic workers in 1960s America were referred to as \"the help\", hence the title of the journalistic exposé, the novel and the film. \"The Help\" brings to light the challenges and discrimination that African American people faced.</p><p>DreamWorks Pictures acquired the screen rights to Stockett's novel in March 2010 and quickly commissioned the film with Chris Columbus, Michael Barnathan, and Brunson Green as producers. The film's casting began later that month, with principal photography following four months after in Mississippi. The film is an international co-production between companies based in the United States, India, and the United Arab Emirates.</p><p>The Help premiered at Beverly Hills on August 9, 2011 and went into general theatrical release in North America on August 10 by Touchstone Pictures. The film was a critical and commercial success, grossing $216 million worldwide and receiving positive reviews from critics, who mostly praised the acting (particularly that of Davis, Spencer and Chastain), though the film's depiction of race drew some criticism as having a white savior narrative. The Help received four Academy Award nominations including Best Picture, Best Actress for Davis, and Best Supporting Actress for both Chastain and Spencer, with the latter winning the award. The film also won the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture.</p>"
  },
  "plotFull": {
    "plainText": "The Help is a 2011 period drama film written and directed by Tate Taylor and based on Kathryn Stockett's 2009 novel of the same name. The film features an ensemble cast, including Emma Stone, Viola Davis, Bryce Dallas Howard, Octavia Spencer, Jessica Chastain, Allison Janney and Sissy Spacek. The film and novel recount the story of a young white woman and aspiring journalist Eugenia \"Skeeter\" Phelan. The story focuses on her relationship with two black maids, Aibileen Clark and Minny Jackson, during the Civil Rights Movement in 1963 Jackson, Mississippi. In an attempt to become a legitimate journalist and writer, Skeeter decides to write a book from the point of view of the maids, exposing the racism they face as they work for white families. Black domestic workers in 1960s America were referred to as \"the help\", hence the title of the journalistic exposé, the novel and the film. \"The Help\" brings to light the challenges and discrimination that African American people faced.\r\nDreamWorks Pictures acquired the screen rights to Stockett's novel in March 2010 and quickly commissioned the film with Chris Columbus, Michael Barnathan, and Brunson Green as producers. The film's casting began later that month, with principal photography following four months after in Mississippi. The film is an international co-production between companies based in the United States, India, and the United Arab Emirates.\r\nThe Help premiered at Beverly Hills on August 9, 2011 and went into general theatrical release in North America on August 10 by Touchstone Pictures. The film was a critical and commercial success, grossing $216 million worldwide and receiving positive reviews from critics, who mostly praised the acting (particularly that of Davis, Spencer and Chastain), though the film's depiction of race drew some criticism as having a white savior narrative. The Help received four Academy Award nominations including Best Picture, Best Actress for Davis, and Best Supporting Actress for both Chastain and Spencer, with the latter winning the award. The film also won the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture.\r\nPlot\r\nIn 1963, narrator Aibileen Clark is an African-American domestic worker in Jackson, Mississippi. She works for socialite Elizabeth Leefolt, raising her two-year-old daughter Mae Mobley, whom Elizabeth emotionally neglects. Aibileen's best friend, Minny Jackson, works for Mrs. Walters and her manipulative daughter Hilly Holbrook, who leads the women's socialite group.\r\nElizabeth and Hilly's mutual friend Eugenia \"Skeeter\" Phelan is an aspiring writer and unmarried, recent graduate of Ole Miss who has been rejected by a New York publishing house. After securing a local job writing a housekeeping column, she grows increasingly aware of the city’s systemic racism and the demeaning treatment of maids, including Hilly's insistence on installing separate bathrooms, a practice she wants enshrined in building code. Skeeter’s mother, Charlotte, informs her that the family’s maid, Constantine, quit, but Skeeter does not believe her and decides to write a book of interviews with the maids to shed light on their experiences.\r\nMinny is soon fired by Hilly for defiantly using an indoor bathroom during a tornado that causes multiple fatalities. Hilly vindictively renders Minny unemployable by telling other housewives that Minny has stolen from her, forcing her teenaged daughter to quit school and take a job as a maid. Aibileen overhears that Celia Foote, a housewife ostracized by the socialites, seeks a maid. Celia, encumbered by a large, inherited house in Madison and limited cooking skills, gratefully hires Minny without telling her husband Johnny, Hilly's former love interest. Celia suffers a miscarriage, and reveals to Minny that she was engaged to Johnny after becoming pregnant, then miscarried. Celia and Minny discuss Hilly's jealousy of Celia and unrequited love for Johnny. Celia cares for a black eye Minny's husband has given her.\r\nAibileen agrees to Skeeter's interview after a dynamic sermon from her pastor, as does Minny. Elaine Stein, Skeeter's editor at Harper & Row, tells her that she needs more than two maids' stories to write a book but fear of violent retribution or job loss prevents other maids from coming forward. Aibileen tells Skeeter about her struggle to cope with the death of her only son, who died of negligent care by his foreman after an on-the-job accident. Skeeter slow-walks a piece in the Junior League newsletter on the \"separate but equal\" bathrooms for Hilly, instead creating a misprint that embarrasses her.\r\nHilly refuses to advance money to her new maid, Yule May Davis, who asks for $75 so she can send her twin sons to Tougaloo College. Yule May discovers a lost ring under a sofa, pawns it, and is violently arrested after Hilly reports her. This incident and the assassination of Medgar Evers inspire more maids to tell Skeeter their stories.\r\nSkeeter, Aibileen, and Minny fear the maids' stories will be recognized. Minny reveals the \"terrible awful\" as a form of insurance: after her termination, Minny brought Hilly her famous chocolate pie but explains – after Hilly had finished two slices – that she had baked her own excrement into it; Hilly later forced her mother into a nursing home for laughing at her during the incident.\r\nSkeeter confronts her mother about Constantine's departure. Charlotte confesses that during a Daughters of America luncheon at her home, she fired Constantine because Constantine's daughter Rachel disobeyed her order to enter the house through the kitchen. Rachel subsequently moved a heartbroken Constantine to Chicago, where she later died. Learning this, Skeeter bursts into tears and runs from the room.\r\n\"The Help\" is published anonymously and read widely by black and white communities of Jackson. Skeeter divides the proceeds among the maids, who receive the equivalent of several weeks' pay each, with \"more to come.\" Skeeter's boyfriend, Stuart, deduces she has written the book and breaks up with her because it is disruptive. Minny reveals the \"terrible awful\" to Celia, who writes a check to a Junior League cause, made out to \"Two Slice Hilly\". Increasingly panicked, Hilly threatens to sue Skeeter for libel, but backs down when Skeeter reminds her that she would have to publicly admit to the pie story. Charlotte intervenes, showing that she knows about the \"terrible awful\", and orders Hilly off the property. Skeeter and her mother reconcile.\r\nJohnny tells Minny he knows she has been working at his house, and that she has permanent job security because of her compassion for Celia and excellent cooking. The promise of future employment makes it possible for Minny and her children to leave her abusive husband. Members of Aibileen's church honor her for her leadership in the publication, and town members sign books for Skeeter and Aibileen. Minny and Aibileen encourage Skeeter to take a job offer in New York because she has burned bridges by publishing the book.\r\nSeeking revenge, Hilly pressures Elizabeth to fire Aibileen, claiming she has stolen silverware. Aibileen stands up to Hilly, who storms out in tears, and Elizabeth orders Aibileen to leave. Aibileen bids farewell to Mae, pleading with Elizabeth to love her daughter; seeing her daughter's tearful response to \"Aibie's\" departure, Elizabeth cries. Walking away from the house, Aibileen reflects on the events, retires from domestic work and plans her future as a writer.\r\nCast\r\nEmma Stone as Eugenia \"Skeeter\" Phelan\r\nViola Davis as Aibileen Clark\r\nOctavia Spencer as Minerva \"Minny\" Jackson\r\nJessica Chastain as Celia Rae Foote\r\nBryce Dallas Howard as Hillary \"Hilly\" Walters Holbrook\r\nAllison Janney as Charlotte Phelan\r\nAhna O'Reilly as Elizabeth Leefolt\r\nEmma and Eleanor Henry as Mae Mobley Leefolt\r\nSissy Spacek as Mrs. Walters\r\nChris Lowell as Stuart Whitworth\r\nMike Vogel as Jonathan \"Johnny\" Foote\r\nWes Chatham as Carlton Phelan\r\nCicely Tyson as Constantine Jefferson\r\nAnna Camp as Jolene French\r\nAshley Johnson as Mary Beth Caldwell\r\nBrian Kerwin as Robert Phelan\r\nAunjanue Ellis as Yule May Davis\r\nMary Steenburgen as Elaine Stein\r\nLeslie Jordan as Mr. Blackly\r\nDavid Oyelowo as Preacher Green\r\nDana Ivey as Grace Higginbotham\r\nShane McRae as Raleigh Leefolt\r\nCarol Sutton as Cora\r\nNelsan Ellis as Henry The Waiter\r\nLaChanze as Rachel\r\nProduction\r\nIn December 2009, Variety reported that Chris Columbus, Michael Barnathan, and Mark Radcliffe would produce a film adaptation of The Help, under their production company 1492 Pictures. Brunson Green of Harbinger Productions also co-produced. The film was written and directed by Tate Taylor, who optioned film rights to the book before its publication. The novel's film rights were obtained by DreamWorks in March 2010. Reliance Entertainment and Participant Media co-produced the film.\r\nThe first casting news for the production came in March 2010, when it was reported that Stone was attached to play the role of Eugenia \"Skeeter\" Phelan. Other actors were since cast, including Davis as Aibileen; Howard as Hilly Holbrook, Jackson's racist, town ringleader; Janney as Charlotte Phelan, Skeeter's mother; and Lowell as Stuart Whitworth, Skeeter's boyfriend and a senator's son. Leslie Jordan appears as the editor of the fictional local newspaper, The Jackson Journal. Mike Vogel plays the character Johnny Foote. Octavia Spencer portrays Minny. Spencer inspired the character of Minny in Stockett's novel and voiced her in the audiobook version.\r\nFilming began in July 2010 and extended through October. The town of Greenwood, Mississippi, was chosen to portray 1960s-era Jackson, and producer Green said he had expected to shoot \"95 percent\" of the film there. Parts of the film were also shot in the real-life Jackson, as well as in nearby Clarksdale and Greenville. One of the few real locations in the book and the film is Brent's Drugs, which dates to 1946. Other locations that can still be found in Jackson include the New Capitol Building and the Mayflower Cafe downtown. Scenes set at the Jackson Journal office were shot in Clarksdale at the building which formerly housed the Clarksdale Press Register for forty years until April 2010.\r\nThe Help was the most significant film production in Mississippi since O Brother, Where Art Thou? (2000) \"Honestly, my heart would be broken if it were set anywhere but Mississippi,\" Stockett wrote in an e-mail to reporters. In order to convince producers to shoot in Greenwood, Tate Taylor and others had previously come to the town and scouted locations; at his first meeting with DreamWorks executives, he presented them with a photo album of potential filming spots in the area. The state's tax incentive program for filmmakers was also a key enticement in the decision.\r\nMusic\r\nTwo soundtracks were released for The Help: an original soundtrack and an original score. Geffen Records released the soundtrack album on August 4, 2011. It remained authentic to the 60s period. The 12-track collection, collated by music supervisor Jennifer Hawks, features songs from the likes of Johnny Cash, Frankie Valli and Ray Charles. As a collective, the songs spotlight the peak of the fight for equality in the United States during the civil rights movement. Mary J. Blige's \"The Living Proof\" is the only original track. She composed it after a second viewing of the film. In an interview with Fandom Entertainment in 2011, Blige said she was \"moved in so many ways\". Her raw emotions inspired her to compose the lone song for the film. The score album, featuring original cues composed and conducted by Thomas Newman was released by Varèse Sarabande on September 6, 2011.\r\nRelease\r\nTheatrical run\r\nWalt Disney Studios Motion Pictures distributed The Help worldwide through the studio's Touchstone Pictures banner. On October 13, 2010, Disney gave the film a release date of August 12, 2011. On June 30, 2011, the film's release date was rescheduled two days earlier to August 10, 2011.\r\nHome media\r\nThe film was released by Touchstone Home Entertainment on Blu-ray Disc, DVD, and digital download on December 6, 2011. The release was produced in three different physical packages: a three-disc combo pack (Blu-ray, DVD, and Digital Copy); a two-disc combo pack (Blu-ray and DVD); and a single-disc DVD. It was also released as a digital download option in both standard and high definition. The DVD version includes two deleted scenes and \"The Living Proof\" music video by Mary J. Blige. The digital download version includes the same features as the DVD version, plus one additional deleted scene. Both the two-disc and three-disc combo packs include the same features as the DVD version, as well as \"The Making of 'The Help': From Friendship to Film\", \"In Their Own Words: A Tribute to the Maids of Mississippi\", and three deleted scenes with introductions by director Taylor.\r\nReception\r\nBox office\r\nThe Help earned $169,708,112 in North America and $46,931,000 in other territories for a worldwide total of $216,639,112.\r\nIn North America, on its opening day (Wednesday, August 10, 2011), it topped the box office with $5.54 million. It then added $4.33 million on Thursday, declining only 21 percent, for a two-day total of $9.87 million. On its first weekend, the film grossed $26 million, coming in second place behind Rise of the Planet of the Apes. However, during its second weekend, the film jumped to first place with $20 million, declining only 23 percent, the smallest drop among films playing nationwide. The film crossed the $100 million mark on its 21st day of release, becoming one of only two titles in August 2011 that achieved this. On its fourth weekend (Labor Day three-day weekend), it became the first film since Inception (2010), to top the box-office charts for three consecutive weekends. Its four-day weekend haul of $19.9 million was the fourth largest for a Labor Day weekend. Notably, The Help topped the box office for 25 days in a row. This was the longest uninterrupted streak since The Sixth Sense (35 days), which was also a late summer release, in 1999.\r\nTo promote the film, TakePart hosted a series of three writing contests. Rebecca Lubin, of Mill Valley, California, who has been a nanny for nearly two decades won the recipe contest. Darcy Pattison's \"11 Ways to Ruin a Photograph\" won \"The Help\" Children's Story Contest with her story about a tenacious young girl who refuses to take a good photograph while her father is away \"soldiering\". After being chosen by guest judge and children's-book author Lou Berger, the story was professionally illustrated. The final contest was about \"someone who inspired you\". Genoveva Islas-Hooker charmed guest judge Doc Hendley (founder of Wine to Water) with her story, A Heroine Named Confidential. A case manager for patients with HIV, Islas-Hooker was consistently inspired by one special individual who never gave up the fight to live.\r\nCritical response\r\nThe Help received mostly positive reviews from critics. Review aggregator Rotten Tomatoes reported that 76% of 232 professional critics gave the film a positive review, with an average score of 7.00/10. The website's critical consensus reads: \"Though arguably guilty of glossing over its racial themes, The Help rises on the strength of its cast – particularly Viola Davis, whose performance is powerful enough to carry the film on its own.\" Metacritic, a review aggregator which assigns a weighted average score out of 100 to reviews from mainstream critics, gives the film a score of 62 based on 41 reviews. CinemaScore polls reported that the average grade moviegoers gave the film was a rare \"A+\" on an A+ to F scale.\r\nTom Long from The Detroit News remarked about the film: \"Appealling, entertaining, touching and perhaps even a bit healing, The Help is an old-fashioned grand yarn of a film, the sort we rarely get these days.\" Connie Ogle of Miami Herald gave the film three out of four stars and said it \"will make you laugh, yes, but it can also break your heart. In the dog days of August moviegoing, that's a powerful recommendation.\"\r\nA more mixed review from Karina Longworth of The Village Voice said: \"We get a fairly typical Hollywood flattening of history, with powerful villains and disenfranchised heroes.\" Rick Groen of The Globe and Mail, giving the film two out of four stars, said: \"Typically, this sort of film is an earnest tear-jerker with moments of levity. Instead, what we have here is a raucous rib-tickler with occasional pauses for a little dramatic relief.\" Referring to the film as a \"big, ole slab of honey-glazed hokum\", The New York Times noted that \"save for Ms. Davis's, however, the performances are almost all overly broad, sometimes excruciatingly so, characterized by loud laughs, bugging eyes and pumping limbs.\"\r\nSome of the negative reviews criticized the film for its inability to match the quality of the book. Chris Hewitt of the St. Paul Pioneer Press said about the film: \"Some adaptations find a fresh, cinematic way to convey a book's spirit but The Help doesn't.\"\r\nMany critics praised the performances of Davis and Spencer. Wilson Morales of Blackfilm.com gave the movie three out of four stars and commented, \"With powerful performances given by Viola Davis and scene stealer Octavia Spencer, the film is an emotionally moving drama that remains highly entertaining.\" David Edelstein of New York magazine commented, \"The Help belongs to Viola Davis.\"\r\nIda E. Jones, the national director of the Association of Black Women Historians, released an open statement criticizing the film, stating \"espite efforts to market the book and the film as a progressive story of triumph over racial injustice, The Help distorts, ignores, and trivializes the experiences of black domestic workers.\" The ABWH accused both the book and the film of insensitive portrayals of African-American vernacular, a nearly uniform depiction of black men as cruel or absent, and a failure to acknowledge the sexual harassment many black women endured in their white employers' homes. Jones concluded: \"The Association of Black Women Historians finds it unacceptable for either this book or this film to strip black women's lives of historical accuracy for the sake of entertainment.\"\r\nRoxane Gay of literary web magazine The Rumpus argues the film might be offensive to African Americans, saying the film uses racial Hollywood tropes like the Magical Negro character. In 2014, the movie was one of several discussed by Keli Goff in The Daily Beast in an article concerning white savior narratives in film.\r\nAccolades\r\nAt the 84th Academy Awards, Octavia Spencer won the Academy Award for Best Supporting Actress for her role in this film. The film also received three other Academy Award nominations: Academy Award for Best Picture, Academy Award for Best Actress for Viola Davis, and Academy Award for Best Supporting Actress for Jessica Chastain.\r\nHistorical accuracy\r\nThe Help focuses on maids during the Civil Rights Movement in 1963. It brings light to Medgar Evers, an African-American activist and NAACP leader, who worked toward gaining rights for African-Americans at the time, as well as aiding in the fight to end segregation. In the film, Skeeter and the two maids are seen watching Evers' address. The moment where the news of Evers' assassination is transmitted drives Skeeter to interview the maids for their stories.\r\nIn the original novel, Pascagoula, the Phelan family's maid, is the one watching the Medgar Evers address, introducing her into the narrative, whereas, in the film, Skeeter is at the forefront, placing her as the primary audience of civil rights news. This aspect of the narrative has brought forth some criticism towards the film. In an interview with The New York Times, Viola Davis mentioned that she regretted playing the role of Aibileen: \"I just felt that at the end of the day that it wasn't the voices of the maids that were heard.\"\r\nFilm historian Alison Graham writes about this in her article \"We Ain't Doin' Civil Rights\", commenting that \"The (con)fusion of fictional and historical events begin to operate under a different narrative license.\"\r\nIn criticizing the film, Valerie Smith claims in \"Black Women's Memories and The Help\" that the trivialization of systemic racism during the 1960s in the film makes the plot \"more accessible to contemporary readers and viewers\".\r\nLegacy\r\nViola Davis has repeatedly expressed regret over starring in The Help, claiming she feels like she \"betrayed myself and my people\" and that the film was \"created in the filter and the cesspool of systemic racism\". Bryce Dallas Howard has also mentioned that she would not agree to star in the film today, acknowledging that it was \"told through the perspective of a white character and was created by predominantly white storytellers\".\r\nAfter Jessica Chastain's Oscar Best Actress win in 2022, there was much interest in the fact that five of the leading actresses - Octavia Spencer, Viola Davis, Emma Stone, Allison Janney, and Chastain - won competitive Oscars since starring in The Help. Additionally, Mary Steenburgen and Sissy Spacek won competitive Oscars in 1980, Cicely Tyson was nominated for a competitive Oscar in 1973 and won an Academy Honorary Award in 2018, and Aunjanue Ellis was nominated for a competitive Oscar in 2022.\r\nJessica credited Tate Taylor: \"I think that's actually a testament to Tate Taylor and his incredible skills at casting...I think you can see that in the careers that the women have had since his films, when you look back at what we've made and put out in 2011, many of us were at the very, very beginning of our careers. So yeah, I thank Tate Taylor for that.\" Bryce Dallas Howard is the remaining leading lady who has yet to win an Oscar.",
    "html": "<p>The Help is a 2011 period drama film written and directed by Tate Taylor and based on Kathryn Stockett's 2009 novel of the same name. The film features an ensemble cast, including Emma Stone, Viola Davis, Bryce Dallas Howard, Octavia Spencer, Jessica Chastain, Allison Janney and Sissy Spacek. The film and novel recount the story of a young white woman and aspiring journalist Eugenia \"Skeeter\" Phelan. The story focuses on her relationship with two black maids, Aibileen Clark and Minny Jackson, during the Civil Rights Movement in 1963 Jackson, Mississippi. In an attempt to become a legitimate journalist and writer, Skeeter decides to write a book from the point of view of the maids, exposing the racism they face as they work for white families. Black domestic workers in 1960s America were referred to as \"the help\", hence the title of the journalistic exposé, the novel and the film. \"The Help\" brings to light the challenges and discrimination that African American people faced.</p><p>DreamWorks Pictures acquired the screen rights to Stockett's novel in March 2010 and quickly commissioned the film with Chris Columbus, Michael Barnathan, and Brunson Green as producers. The film's casting began later that month, with principal photography following four months after in Mississippi. The film is an international co-production between companies based in the United States, India, and the United Arab Emirates.</p><p>The Help premiered at Beverly Hills on August 9, 2011 and went into general theatrical release in North America on August 10 by Touchstone Pictures. The film was a critical and commercial success, grossing $216 million worldwide and receiving positive reviews from critics, who mostly praised the acting (particularly that of Davis, Spencer and Chastain), though the film's depiction of race drew some criticism as having a white savior narrative. The Help received four Academy Award nominations including Best Picture, Best Actress for Davis, and Best Supporting Actress for both Chastain and Spencer, with the latter winning the award. The film also won the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture.</p><br/><h3>Plot</h3><p>In 1963, narrator Aibileen Clark is an African-American domestic worker in Jackson, Mississippi. She works for socialite Elizabeth Leefolt, raising her two-year-old daughter Mae Mobley, whom Elizabeth emotionally neglects. Aibileen's best friend, Minny Jackson, works for Mrs. Walters and her manipulative daughter Hilly Holbrook, who leads the women's socialite group.</p><p>Elizabeth and Hilly's mutual friend Eugenia \"Skeeter\" Phelan is an aspiring writer and unmarried, recent graduate of Ole Miss who has been rejected by a New York publishing house. After securing a local job writing a housekeeping column, she grows increasingly aware of the city’s systemic racism and the demeaning treatment of maids, including Hilly's insistence on installing separate bathrooms, a practice she wants enshrined in building code. Skeeter’s mother, Charlotte, informs her that the family’s maid, Constantine, quit, but Skeeter does not believe her and decides to write a book of interviews with the maids to shed light on their experiences.</p><p>Minny is soon fired by Hilly for defiantly using an indoor bathroom during a tornado that causes multiple fatalities. Hilly vindictively renders Minny unemployable by telling other housewives that Minny has stolen from her, forcing her teenaged daughter to quit school and take a job as a maid. Aibileen overhears that Celia Foote, a housewife ostracized by the socialites, seeks a maid. Celia, encumbered by a large, inherited house in Madison and limited cooking skills, gratefully hires Minny without telling her husband Johnny, Hilly's former love interest. Celia suffers a miscarriage, and reveals to Minny that she was engaged to Johnny after becoming pregnant, then miscarried. Celia and Minny discuss Hilly's jealousy of Celia and unrequited love for Johnny. Celia cares for a black eye Minny's husband has given her.</p><p>Aibileen agrees to Skeeter's interview after a dynamic sermon from her pastor, as does Minny. Elaine Stein, Skeeter's editor at Harper & Row, tells her that she needs more than two maids' stories to write a book but fear of violent retribution or job loss prevents other maids from coming forward. Aibileen tells Skeeter about her struggle to cope with the death of her only son, who died of negligent care by his foreman after an on-the-job accident. Skeeter slow-walks a piece in the Junior League newsletter on the \"separate but equal\" bathrooms for Hilly, instead creating a misprint that embarrasses her.</p><p>Hilly refuses to advance money to her new maid, Yule May Davis, who asks for $75 so she can send her twin sons to Tougaloo College. Yule May discovers a lost ring under a sofa, pawns it, and is violently arrested after Hilly reports her. This incident and the assassination of Medgar Evers inspire more maids to tell Skeeter their stories.</p><p>Skeeter, Aibileen, and Minny fear the maids' stories will be recognized. Minny reveals the \"terrible awful\" as a form of insurance: after her termination, Minny brought Hilly her famous chocolate pie but explains – after Hilly had finished two slices – that she had baked her own excrement into it; Hilly later forced her mother into a nursing home for laughing at her during the incident.</p><p>Skeeter confronts her mother about Constantine's departure. Charlotte confesses that during a Daughters of America luncheon at her home, she fired Constantine because Constantine's daughter Rachel disobeyed her order to enter the house through the kitchen. Rachel subsequently moved a heartbroken Constantine to Chicago, where she later died. Learning this, Skeeter bursts into tears and runs from the room.</p><p>\"The Help\" is published anonymously and read widely by black and white communities of Jackson. Skeeter divides the proceeds among the maids, who receive the equivalent of several weeks' pay each, with \"more to come.\" Skeeter's boyfriend, Stuart, deduces she has written the book and breaks up with her because it is disruptive. Minny reveals the \"terrible awful\" to Celia, who writes a check to a Junior League cause, made out to \"Two Slice Hilly\". Increasingly panicked, Hilly threatens to sue Skeeter for libel, but backs down when Skeeter reminds her that she would have to publicly admit to the pie story. Charlotte intervenes, showing that she knows about the \"terrible awful\", and orders Hilly off the property. Skeeter and her mother reconcile.</p><p>Johnny tells Minny he knows she has been working at his house, and that she has permanent job security because of her compassion for Celia and excellent cooking. The promise of future employment makes it possible for Minny and her children to leave her abusive husband. Members of Aibileen's church honor her for her leadership in the publication, and town members sign books for Skeeter and Aibileen. Minny and Aibileen encourage Skeeter to take a job offer in New York because she has burned bridges by publishing the book.</p><p>Seeking revenge, Hilly pressures Elizabeth to fire Aibileen, claiming she has stolen silverware. Aibileen stands up to Hilly, who storms out in tears, and Elizabeth orders Aibileen to leave. Aibileen bids farewell to Mae, pleading with Elizabeth to love her daughter; seeing her daughter's tearful response to \"Aibie's\" departure, Elizabeth cries. Walking away from the house, Aibileen reflects on the events, retires from domestic work and plans her future as a writer.</p><br/><h3>Cast</h3><ul><li>Emma Stone as Eugenia \"Skeeter\" Phelan</li><li>Viola Davis as Aibileen Clark</li><li>Octavia Spencer as Minerva \"Minny\" Jackson</li><li>Jessica Chastain as Celia Rae Foote</li><li>Bryce Dallas Howard as Hillary \"Hilly\" Walters Holbrook</li><li>Allison Janney as Charlotte Phelan</li><li>Ahna O'Reilly as Elizabeth Leefolt</li><li>Emma and Eleanor Henry as Mae Mobley Leefolt</li><li>Sissy Spacek as Mrs. Walters</li><li>Chris Lowell as Stuart Whitworth</li><li>Mike Vogel as Jonathan \"Johnny\" Foote</li><li>Wes Chatham as Carlton Phelan</li><li>Cicely Tyson as Constantine Jefferson</li><li>Anna Camp as Jolene French</li><li>Ashley Johnson as Mary Beth Caldwell</li><li>Brian Kerwin as Robert Phelan</li><li>Aunjanue Ellis as Yule May Davis</li><li>Mary Steenburgen as Elaine Stein</li><li>Leslie Jordan as Mr. Blackly</li><li>David Oyelowo as Preacher Green</li><li>Dana Ivey as Grace Higginbotham</li><li>Shane McRae as Raleigh Leefolt</li><li>Carol Sutton as Cora</li><li>Nelsan Ellis as Henry The Waiter</li><li>LaChanze as Rachel</li></ul><br/><h3>Production</h3><p>In December 2009, Variety reported that Chris Columbus, Michael Barnathan, and Mark Radcliffe would produce a film adaptation of The Help, under their production company 1492 Pictures. Brunson Green of Harbinger Productions also co-produced. The film was written and directed by Tate Taylor, who optioned film rights to the book before its publication. The novel's film rights were obtained by DreamWorks in March 2010. Reliance Entertainment and Participant Media co-produced the film.</p><p>The first casting news for the production came in March 2010, when it was reported that Stone was attached to play the role of Eugenia \"Skeeter\" Phelan. Other actors were since cast, including Davis as Aibileen; Howard as Hilly Holbrook, Jackson's racist, town ringleader; Janney as Charlotte Phelan, Skeeter's mother; and Lowell as Stuart Whitworth, Skeeter's boyfriend and a senator's son. Leslie Jordan appears as the editor of the fictional local newspaper, The Jackson Journal. Mike Vogel plays the character Johnny Foote. Octavia Spencer portrays Minny. Spencer inspired the character of Minny in Stockett's novel and voiced her in the audiobook version.</p><p>Filming began in July 2010 and extended through October. The town of Greenwood, Mississippi, was chosen to portray 1960s-era Jackson, and producer Green said he had expected to shoot \"95 percent\" of the film there. Parts of the film were also shot in the real-life Jackson, as well as in nearby Clarksdale and Greenville. One of the few real locations in the book and the film is Brent's Drugs, which dates to 1946. Other locations that can still be found in Jackson include the New Capitol Building and the Mayflower Cafe downtown. Scenes set at the Jackson Journal office were shot in Clarksdale at the building which formerly housed the Clarksdale Press Register for forty years until April 2010.</p><p>The Help was the most significant film production in Mississippi since O Brother, Where Art Thou? (2000) \"Honestly, my heart would be broken if it were set anywhere but Mississippi,\" Stockett wrote in an e-mail to reporters. In order to convince producers to shoot in Greenwood, Tate Taylor and others had previously come to the town and scouted locations; at his first meeting with DreamWorks executives, he presented them with a photo album of potential filming spots in the area. The state's tax incentive program for filmmakers was also a key enticement in the decision.</p><br/><h3>Music</h3><p>Two soundtracks were released for The Help: an original soundtrack and an original score. Geffen Records released the soundtrack album on August 4, 2011. It remained authentic to the 60s period. The 12-track collection, collated by music supervisor Jennifer Hawks, features songs from the likes of Johnny Cash, Frankie Valli and Ray Charles. As a collective, the songs spotlight the peak of the fight for equality in the United States during the civil rights movement. Mary J. Blige's \"The Living Proof\" is the only original track. She composed it after a second viewing of the film. In an interview with Fandom Entertainment in 2011, Blige said she was \"moved in so many ways\". Her raw emotions inspired her to compose the lone song for the film. The score album, featuring original cues composed and conducted by Thomas Newman was released by Varèse Sarabande on September 6, 2011.</p><br/><h3>Release</h3><h4>Theatrical run</h4><p>Walt Disney Studios Motion Pictures distributed The Help worldwide through the studio's Touchstone Pictures banner. On October 13, 2010, Disney gave the film a release date of August 12, 2011. On June 30, 2011, the film's release date was rescheduled two days earlier to August 10, 2011.</p><h4>Home media</h4><p>The film was released by Touchstone Home Entertainment on Blu-ray Disc, DVD, and digital download on December 6, 2011. The release was produced in three different physical packages: a three-disc combo pack (Blu-ray, DVD, and Digital Copy); a two-disc combo pack (Blu-ray and DVD); and a single-disc DVD. It was also released as a digital download option in both standard and high definition. The DVD version includes two deleted scenes and \"The Living Proof\" music video by Mary J. Blige. The digital download version includes the same features as the DVD version, plus one additional deleted scene. Both the two-disc and three-disc combo packs include the same features as the DVD version, as well as \"The Making of 'The Help': From Friendship to Film\", \"In Their Own Words: A Tribute to the Maids of Mississippi\", and three deleted scenes with introductions by director Taylor.</p><br/><h3>Reception</h3><h4>Box office</h4><p>The Help earned $169,708,112 in North America and $46,931,000 in other territories for a worldwide total of $216,639,112.</p><p>In North America, on its opening day (Wednesday, August 10, 2011), it topped the box office with $5.54 million. It then added $4.33 million on Thursday, declining only 21 percent, for a two-day total of $9.87 million. On its first weekend, the film grossed $26 million, coming in second place behind Rise of the Planet of the Apes. However, during its second weekend, the film jumped to first place with $20 million, declining only 23 percent, the smallest drop among films playing nationwide. The film crossed the $100 million mark on its 21st day of release, becoming one of only two titles in August 2011 that achieved this. On its fourth weekend (Labor Day three-day weekend), it became the first film since Inception (2010), to top the box-office charts for three consecutive weekends. Its four-day weekend haul of $19.9 million was the fourth largest for a Labor Day weekend. Notably, The Help topped the box office for 25 days in a row. This was the longest uninterrupted streak since The Sixth Sense (35 days), which was also a late summer release, in 1999.</p><p>To promote the film, TakePart hosted a series of three writing contests. Rebecca Lubin, of Mill Valley, California, who has been a nanny for nearly two decades won the recipe contest. Darcy Pattison's \"11 Ways to Ruin a Photograph\" won \"The Help\" Children's Story Contest with her story about a tenacious young girl who refuses to take a good photograph while her father is away \"soldiering\". After being chosen by guest judge and children's-book author Lou Berger, the story was professionally illustrated. The final contest was about \"someone who inspired you\". Genoveva Islas-Hooker charmed guest judge Doc Hendley (founder of Wine to Water) with her story, A Heroine Named Confidential. A case manager for patients with HIV, Islas-Hooker was consistently inspired by one special individual who never gave up the fight to live.</p><h4>Critical response</h4><p>The Help received mostly positive reviews from critics. Review aggregator Rotten Tomatoes reported that 76% of 232 professional critics gave the film a positive review, with an average score of 7.00/10. The website's critical consensus reads: \"Though arguably guilty of glossing over its racial themes, The Help rises on the strength of its cast – particularly Viola Davis, whose performance is powerful enough to carry the film on its own.\" Metacritic, a review aggregator which assigns a weighted average score out of 100 to reviews from mainstream critics, gives the film a score of 62 based on 41 reviews. CinemaScore polls reported that the average grade moviegoers gave the film was a rare \"A+\" on an A+ to F scale.</p><p>Tom Long from The Detroit News remarked about the film: \"Appealling, entertaining, touching and perhaps even a bit healing, The Help is an old-fashioned grand yarn of a film, the sort we rarely get these days.\" Connie Ogle of Miami Herald gave the film three out of four stars and said it \"will make you laugh, yes, but it can also break your heart. In the dog days of August moviegoing, that's a powerful recommendation.\"</p><p>A more mixed review from Karina Longworth of The Village Voice said: \"We get a fairly typical Hollywood flattening of history, with powerful villains and disenfranchised heroes.\" Rick Groen of The Globe and Mail, giving the film two out of four stars, said: \"Typically, this sort of film is an earnest tear-jerker with moments of levity. Instead, what we have here is a raucous rib-tickler with occasional pauses for a little dramatic relief.\" Referring to the film as a \"big, ole slab of honey-glazed hokum\", The New York Times noted that \"save for Ms. Davis's, however, the performances are almost all overly broad, sometimes excruciatingly so, characterized by loud laughs, bugging eyes and pumping limbs.\"</p><p>Some of the negative reviews criticized the film for its inability to match the quality of the book. Chris Hewitt of the St. Paul Pioneer Press said about the film: \"Some adaptations find a fresh, cinematic way to convey a book's spirit but The Help doesn't.\"</p><p>Many critics praised the performances of Davis and Spencer. Wilson Morales of Blackfilm.com gave the movie three out of four stars and commented, \"With powerful performances given by Viola Davis and scene stealer Octavia Spencer, the film is an emotionally moving drama that remains highly entertaining.\" David Edelstein of New York magazine commented, \"The Help belongs to Viola Davis.\"</p><p>Ida E. Jones, the national director of the Association of Black Women Historians, released an open statement criticizing the film, stating \"espite efforts to market the book and the film as a progressive story of triumph over racial injustice, The Help distorts, ignores, and trivializes the experiences of black domestic workers.\" The ABWH accused both the book and the film of insensitive portrayals of African-American vernacular, a nearly uniform depiction of black men as cruel or absent, and a failure to acknowledge the sexual harassment many black women endured in their white employers' homes. Jones concluded: \"The Association of Black Women Historians finds it unacceptable for either this book or this film to strip black women's lives of historical accuracy for the sake of entertainment.\"</p><p>Roxane Gay of literary web magazine The Rumpus argues the film might be offensive to African Americans, saying the film uses racial Hollywood tropes like the Magical Negro character. In 2014, the movie was one of several discussed by Keli Goff in The Daily Beast in an article concerning white savior narratives in film.</p><h4>Accolades</h4><p>At the 84th Academy Awards, Octavia Spencer won the Academy Award for Best Supporting Actress for her role in this film. The film also received three other Academy Award nominations: Academy Award for Best Picture, Academy Award for Best Actress for Viola Davis, and Academy Award for Best Supporting Actress for Jessica Chastain.</p><br/><h3>Historical accuracy</h3><p>The Help focuses on maids during the Civil Rights Movement in 1963. It brings light to Medgar Evers, an African-American activist and NAACP leader, who worked toward gaining rights for African-Americans at the time, as well as aiding in the fight to end segregation. In the film, Skeeter and the two maids are seen watching Evers' address. The moment where the news of Evers' assassination is transmitted drives Skeeter to interview the maids for their stories.</p><p>In the original novel, Pascagoula, the Phelan family's maid, is the one watching the Medgar Evers address, introducing her into the narrative, whereas, in the film, Skeeter is at the forefront, placing her as the primary audience of civil rights news. This aspect of the narrative has brought forth some criticism towards the film. In an interview with The New York Times, Viola Davis mentioned that she regretted playing the role of Aibileen: \"I just felt that at the end of the day that it wasn't the voices of the maids that were heard.\"</p><p>Film historian Alison Graham writes about this in her article \"We Ain't Doin' Civil Rights\", commenting that \"The (con)fusion of fictional and historical events begin to operate under a different narrative license.\"</p><p>In criticizing the film, Valerie Smith claims in \"Black Women's Memories and The Help\" that the trivialization of systemic racism during the 1960s in the film makes the plot \"more accessible to contemporary readers and viewers\".</p><br/><h3>Legacy</h3><p>Viola Davis has repeatedly expressed regret over starring in The Help, claiming she feels like she \"betrayed myself and my people\" and that the film was \"created in the filter and the cesspool of systemic racism\". Bryce Dallas Howard has also mentioned that she would not agree to star in the film today, acknowledging that it was \"told through the perspective of a white character and was created by predominantly white storytellers\".</p><p>After Jessica Chastain's Oscar Best Actress win in 2022, there was much interest in the fact that five of the leading actresses - Octavia Spencer, Viola Davis, Emma Stone, Allison Janney, and Chastain - won competitive Oscars since starring in The Help. Additionally, Mary Steenburgen and Sissy Spacek won competitive Oscars in 1980, Cicely Tyson was nominated for a competitive Oscar in 1973 and won an Academy Honorary Award in 2018, and Aunjanue Ellis was nominated for a competitive Oscar in 2022.</p><p>Jessica credited Tate Taylor: \"I think that's actually a testament to Tate Taylor and his incredible skills at casting...I think you can see that in the careers that the women have had since his films, when you look back at what we've made and put out in 2011, many of us were at the very, very beginning of our careers. So yeah, I thank Tate Taylor for that.\" Bryce Dallas Howard is the remaining leading lady who has yet to win an Oscar.</p><br/>"
  },
  "errorMessage": ""
}