{
  "imDbId": "tt2278388",
  "title": "The Grand Budapest Hotel",
  "fullTitle": "The Grand Budapest Hotel (2014)",
  "type": "Movie",
  "year": "2014",
  "items": [
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3519137",
      "warningSpoilers": false,
      "date": "5 August 2016",
      "rate": "9",
      "helpful": "104 out of 115 found this helpful.",
      "title": "A hotel well worth revisiting more than once",
      "content": "That it was directed by Wes Anderson (who has a unique style that really fascinates, but admittedly not everybody will like or warm to his style) and that the cast is so stellar were reasons enough to see 'The Grand Budapest Hotel' in the first place, as well as its many accolades and critical acclaim.While it isn't quite flawless, and it is easy to see why a number of people don't like or will not like it (due to a lot of the cast's roles being pretty short, only Gustave and Zero being fully fleshed out of the characters and those who have a problem with Anderson's style), 'The Grand Budapest Hotel' is a visually stunning, hugely entertaining, wonderfully weird and impeccably cast and acted film.It really stuns visually, with cinematography that is not only clever in technique but also gorgeous in aesthetic and tight, fluid editing. The costumes, production design and hair and make-up richly deserved their Oscar/Academy Award wins, the costume and production design have a lusciously colourful fairy-tale feel while also given substance by the bleakly atmospheric quality that reflects the crime drama aspect of the story brilliantly.Alexandre Desplat also received an Oscar, and with its hauntingly hypnotic and entrancing tones it richly deserved it as to me it was by far the best score of those nominated. Anderson directs superbly, the story balances darkness and quirkiness to great effect (the prison scene is unforgettable) and it's never too simplistic or convoluted (though of course the visuals, dialogue and performances make much more of an impact) and the screenplay is a sublime mixture of the dark, the quirky, the witty and the subtle delivered with rapid-fire.'The Grand Budapest Hotel' boasts an impeccable cast and pretty much everybody does a splendid job, though many of the roles are short. My only criticism of the film is that Harvey Keitel and Saoirse Ronan are underused and just get lost amongst everything else, an unrecognisable Tilda Swinton also has little to do but still gives a bat-out-of-hell performance.Bill Murray, F. Murray Abraham, Jeff Goldblum, Jason Schwartzman and Owen Wilson give very entertaining performances, while Edward Norton is delightfully droll and Adrien Brody and especially Willem Dafoe bring sinister foreboding to the film. Some may say that Tony Revolori is overshadowed by the more experienced cast members (being the only newcomer in a large cast of big names), but to me he more than holds his own and effectively plays it straight. The film belongs to Ralph Fiennes, in what is essentially the heart of the film, while he has always been a fine actor he has not given a performance this brilliant in years, never knew he could be so riotously funny.In conclusion, a wonderful film and a hotel well worth revisiting more than once if to one's taste. 9/10 Bethany Cox"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw3034571",
      "warningSpoilers": false,
      "date": "15 June 2014",
      "rate": "8",
      "helpful": "80 out of 89 found this helpful.",
      "title": "Strange and pretty much impossible to describe.",
      "content": "Wes Anderson's films are really hard to describe or define. Suffice to say that he is unique in his style--very unique. This uniqueness is what makes \"The Grand Budapest Hotel\" worth seeing. It's an odd story where a story is told within a story--and it's filled with famous actors making lots of odd cameos. And, like Anderson's other films, it's full of odd characters, unusual dialog and brisk-paced editing. And, not surprisingly, it's NOTHING like other films by other directors.The bottom line is that all these weird factors work together to make a film that you'll probably enjoy--but, like me, you won't be exactly sure why!"
    },
    {
      "username": "rubenm",
      "userUrl": "https://www.imdb.com/user/ur2121650",
      "reviewLink": "https://www.imdb.com/review/rw2979784",
      "warningSpoilers": true,
      "date": "15 March 2014",
      "rate": "8",
      "helpful": "473 out of 558 found this helpful.",
      "title": "Absurd, funny, exciting, violent and colourful",
      "content": "Can a film be absurd, funny, exciting, violent and colourful at the same time? Yes. 'The Grand Budapest Hotel' combines all those elements. And I didn't even mention the most important characteristic: it is visually wonderful.In this film, director Wes Anderson creates his own universe, full of colourful characters, old-world charm and witty one-liners. The nice thing about creating your own universe is that you can make it look perfect. Every shot, every little detail and every set is flawless. From lead character Gustave H.'s purple jacket to the title of the newspaper announcing the war (The Trans-Alpine Yodel) - Anderson has given thought and attention to everything.The story is not very important, because it is merely a vehicle for the stunning visuals, the dark humour and the rapid-fire dialogue. It's all about a hotel concierge, Gustave H., who is being chased by various villains for stealing a painting. All this is set against the backdrop of the Nazis invading Central Europe (although in Anderson's fantasy world they are not called Nazis of course). Some of the scenes are very funny, but there is always a darker tone because of the looming war. Anderson doesn't shy away from extreme violence, but he shows it in an offbeat and almost comical manner.My favourite scene, in which it all comes together, shows concierges in hotels all over Europe, calling each other to help Gustave H. Each of them is shown in his hotel (with a wonderful fantasy name of course), busy doing some important job like tasting the soup or giving first aid to an unconscious hotel guest, when he is being called away to the telephone. Each hands the job over to his assistant, and answers the phone. This fast succession of little scenes is done so perfectly, it's a great joy to watch.Ralph Fiennes steals the show as the sophisticated Gustave H., who never despairs, even in the most unfavourable circumstances. He is supported by a large number of star actors, who are sometimes almost unrecognizable. Because of the amount of support actors, some of them are a bit underused. Tilda Swinton gets rather little screen time, as does Harvey Keitel.The film moves forward at a breakneck speed. You have to be very alert in order not to miss something. The plot is not always very easy to follow, and the dialogue is fast. And there are the great camera angles and the wonderful detailed sets to pay attention to. I think by seeing the film a second time you can discover lots of things you didn't notice the first time."
    },
    {
      "username": "lastliberal-853-253708",
      "userUrl": "https://www.imdb.com/user/ur23944958",
      "reviewLink": "https://www.imdb.com/review/rw3176994",
      "warningSpoilers": false,
      "date": "4 February 2015",
      "rate": "8",
      "helpful": "60 out of 74 found this helpful.",
      "title": "Keep your hands off my lobby boy!",
      "content": "The Grand Hotel Budapest is a zany, colorful and fascinating journey through old postcard Europe, such as only Hollywood can think of. With his old, almost square picture format Wes Anderson pays tribute to recent days, but with the whole movie. In addition to his brilliant humor and endearing characters, this film captures gems with seemingly small details and meticulous compositions. For me, now one of the funniest and most original movies of 2014.The style is unique. You will either like it or you won't. There is no middle ground here.With too many great actors to mention, they all gave outstanding performance that will keep you enchanted."
    },
    {
      "username": "corrosion-2",
      "userUrl": "https://www.imdb.com/user/ur7024406",
      "reviewLink": "https://www.imdb.com/review/rw2957606",
      "warningSpoilers": false,
      "date": "8 February 2014",
      "rate": "",
      "helpful": "256 out of 325 found this helpful.",
      "title": "A Grand Adventure",
      "content": "Wes Anderson is one of the most original film makers working today. None of his films can be categorized into any particular genre. His latest, The Grand Budapest Hotel, which opened the Berlin Film Festival, continues that trend. It is a tale within a tale within another tale. Whilst every shot has been meticulously arranged as though a work of Art hanging in a museum, story wise Anderson has let his imagination run wild. Though the tale (with Tom Wilkinson as the author of the story) and the tale within the tale (with Jude Law as the young author & F Murray Abraham as the mysterious owner of THe Grand Budapest Hotel) have straightforward narratives, the tale within the tale within the tale, which comprises the bulk of the film and is set in the years preceding the Second World War, is a wild uproarious train ride of story telling. It also boasts the cast of a life time: Ralph Fiennes, Tilda Swinton, Edward Norton, Adrien Brody, Willem Dafoe, Harvey Keitel, Jeff Goldblum, Bill Murray, Owen Wilson & countless cameos. It will delight Anderson fans but is more likely destined for Art house cinemas as it is too off center for mainstream audiences. The production design and music are outstanding and even the end credits are imaginatively done (and received another ovation from the audience)."
    },
    {
      "username": "bob-the-movie-man",
      "userUrl": "https://www.imdb.com/user/ur49208568",
      "reviewLink": "https://www.imdb.com/review/rw2978454",
      "warningSpoilers": false,
      "date": "12 March 2014",
      "rate": "8",
      "helpful": "164 out of 221 found this helpful.",
      "title": "A brilliantly entertaining fantasy outing by Wes Anderson",
      "content": "The Grand Budapest Hotel is the latest from Wes Anderson, and what great fun it is. My review of Monuments Men pointed out that putting the likes of George Clooney, Matt Damon, Cate Blanchett, Jean Dujardin, Bill Murray and Hugh Bonneville in the same film was no guarantee of a good film. Following that logic, what should we make of the following turning up together: Ralph Fiennes, Bill Murray, F. Murray Abraham, Adrien Brody, Willem Defoe, Jeff Goldblum, Jude Law, Edward Norton, Tom Wilkinson, Saoirse Ronan, Owen Wilson and (a wonderfully made up) Tilda Swinton? The answer is a near masterpiece of cameos that add up to a highly entertaining and memorable film.In a complex serious of flashbacks, Tom Wilkinson plays an author remembering his younger self (Jude Law) being recounted, a number of years before, the life story of The Grand Budapest's mysterious elderly guest Zero Moustafa, played by Abraham. (Are you still with me?) Featuring strongly in this life story, Ralph Fiennes plays hotel concierge and lothario Gustave H., seducer of his elderly and wealthy guests. He is supported in this role – for everything outside the bedroom that is – by trainee Bellboy, and Gustave's protégé, Zero (in the younger form of Tony Revolori).Following the murder of one such guest (Tilda Swinton), Gustave is not surprised to feature strongly in her will, awarded a priceless Renaissance painting – Boy with Apple. This is much to the displeasure of her son Dimitri (Adrien Brody) and his evil henchman Jopling (Willem Defoe). What follows is a madcap pursuit across snowy landscapes, various grisly murders, a couple of civil wars, some disconnected fingers, a prison break and a downhill ski chase.All the cast seem to enjoy themselves immensely, but it is the production design and cinematography that really shines through: every single shot of the film is just a joy to look at, from the bright pastel colours of some scenes to the oak-panelled finery of the elderly lady's mansion. Beautifully crafted, beautifully lit,beautifully costumed, beautifully filmed. Bringing a film out so early in the new Oscar-year must be risky: but one can only hope that the voting members have a long enough memory to recognise this movie in these sorts of categories.There are some interesting crossovers to recent films: both 'The Book Thief' and 'The Monuments Men' were filmed – as this was – in Studio Babelsberg in Potsdam. No coincidence then that the steam train chugging through the East European countryside looked startlingly similar to that in the opening scenes of 'The Book Thief'; and if you have Bill Murray and Bob Balaban in town for Monuments Men, then why not stick them together for this film too? Simples! Alexandre Desplat turns up AGAIN with another quirky and fitting score.All in all, if you like the quirky style of films of the likes of Moulin Rouge then you'll love this. Highly recommended.(If you enjoyed this review, please check out my archive of other reviews and while there sign up to \"Follow the Fad\"! Thanks!)."
    },
    {
      "username": "jan_kalina",
      "userUrl": "https://www.imdb.com/user/ur23172671",
      "reviewLink": "https://www.imdb.com/review/rw3004516",
      "warningSpoilers": false,
      "date": "25 April 2014",
      "rate": "10",
      "helpful": "278 out of 349 found this helpful.",
      "title": "\"There are still faint glimmers of civilization left in this barbaric slaughterhouse that was once known as humanity... He was one of them. \"",
      "content": "Wes Anderson is one of the last directors -auteurs- who's got complete control on the film set and has the power to make whatever kind of film he desires. His distinct visual style is apparent since his 1996 debut Bottle Rcoket. But that was just a start, with every film he made he was perfecting his technique more and more. This marvelous attention to detail, the way he composes his shots( tracking shots, the symmetry, the characters running in slow-motion), chase scenes, love story, nostalgia, explanatory montages, the colourful set design and the prevalent theme of every one of his films: family. This all adds up to the reason why the audience enjoys Anderson's film so much. This all is brought to perfection in Grandhotel Budapest. Through complex narrative framework, which itself is a mockery of all these films that are being narrated by someone and is also being an excuse for not being too realistic, we get to a story of a young lobby boy named Zero Moustafa and Gustave H. (Ralph Fiennes)the concierge of the Grandhotel Budapest. Many of the female guests of the hotel mainly come to enjoy Gustave's company. When one of these ladies passes away, Gustave grabs Zero and boards a train for her mansion. Soon he's blamed for her murder and hunted by police led by Edward Norton and a grim-faced assassin played by Willem Dafoe. There also is a love story between two young teens - Zero and Agatha (Saoirse Ronan) who has a birthmark in the shape of Mexico.I frankly don't understand how can this film be successful in the USA. This film is just so typically European, that I guess some aspects of the film Americans just aren't familiar with. Some of the humor reminded of old French, Italian and Czech comedies. Wes Anderson remains to be a stand-out filmmaker who never disappoints with any of his creations and is a safe bet to rely on his qualities. You won't want to return to the real world when the credits start to roll."
    },
    {
      "username": "runamokprods",
      "userUrl": "https://www.imdb.com/user/ur6981752",
      "reviewLink": "https://www.imdb.com/review/rw3069414",
      "warningSpoilers": false,
      "date": "15 August 2014",
      "rate": "9",
      "helpful": "47 out of 61 found this helpful.",
      "title": "Funny, sweet, inventive and wonderfully acted",
      "content": "A wonderfully funny fable of the adventures of world's greatest hotel concierge (a brilliant, inventive and hilarious performance by Ralph Fiennes) and the friendship he strikes up with the hotel's new lobby boy (a strong debut by newcomer Tony Revolori). The story goes in many unexpected directions, every one entertaining and eccentric, and the cast is full of first rate highly comic performances by F. Murray Abraham, Adrien Brody, Willem Dafoe, Jeff Goldblum, with terrific cameos by Bill Murray, Harvey Keitel, Edward Norton, Tilda Swinton, Jason Schwartzman, Tom Wilkinson, Owen Wilson, Jude Law and others I feel bad for forgetting here. While not Anderson's most profound film, it may be his most joyful. I don't think I stopped smiling from first frame to last, and I laughed out loud quite a few times. And yet, as in any good fable, there is some real poignancy as well. A top notch marriage of a lovingly crafted art-film and a wacky human comedy, something rarely pulled off with such panache. Even my friends who don't enjoy Anderson's work in general had nothing but good things to say. The sweetest treat of the movie year so far."
    },
    {
      "username": "edgereviews",
      "userUrl": "https://www.imdb.com/user/ur40204638",
      "reviewLink": "https://www.imdb.com/review/rw2979299",
      "warningSpoilers": false,
      "date": "14 March 2014",
      "rate": "9",
      "helpful": "268 out of 339 found this helpful.",
      "title": "Wes Anderson's Best?",
      "content": "I would consider myself a Wes Anderson fan, however in saying that, I have only seen a handful of his movies. I was very excited for The Grand Budapest Hotel, because of its excellent cast, the fact it's directed by Wes Anderson and just by how unique it looked. After watching The Grand Budapest Hotel, I can confidently say that it's my new favourite Wes Anderson film, and probably his best.As I was hoping, the story to The Grand Budapest Hotel is very original and unique, some may even say strange. And as the movie goes on, the story only gets wilder and wilder. The film is often very hilarious, with some seriously funny dark humour thrown in there as well. Characters are extremely well written, with the bond between Gustave and Zero being the backbone of the whole movie as it's so well written. The Grand Budapest Hotel features an odd narrative structure that works very well for the film, again adding to the uniqueness and freshness of it. I wasn't exactly sure how the story would play out, as I purposely avoided all promotional materiel so I would know as little as possible before watching. This was a great benefit to my viewing experience as I loved everything I saw, and felt as though nothing was spoiled from watching too many trailers.I haven't been a huge fan of most of Ralph Fiennes' work since his phenomenal performance in 1993′s \"Schindler's List\", but this is easily his best performance since then. He proves he can do comedy just as well as he can do drama, providing a perfect balance of both. Newcomer Tony Revolori is excellent as well. I won't get into the whole supporting cast because there's so many who were all so great, but I was particularly impressed by Willem Dafoe, Adrien Brody, Harvey Keitel, Jude Law and Saoirse Ronan.The Grand Budapest Hotel is definitely a Wes Anderson film, down to its very core. If you know his style, then you known what to expect, as this movie is full of it. Thankfully though, it's not a case of style over substance, with a great story to accompany the gorgeous visuals. The colour palette is beautiful; it's nice to see lot's of bright colours when so many other films are so dark and dreary. The set design and costumes are perfect, and there's so much attention to detail within the sets. The cinematography is phenomenal, and I really like how the film was presented in different aspect ratios.You really can't go wrong with this film. It's probably Wes Anderson's best film, it has gorgeous visuals, excellent acting and a wonderful story. If you're a fan of Wes Anderson's previous work, you cannot miss this, and even if you're not a fan you should go and see it anyway."
    },
    {
      "username": "rogerdarlington",
      "userUrl": "https://www.imdb.com/user/ur1911738",
      "reviewLink": "https://www.imdb.com/review/rw2980286",
      "warningSpoilers": false,
      "date": "16 March 2014",
      "rate": "",
      "helpful": "6 out of 6 found this helpful.",
      "title": "A cinematic chocolate box",
      "content": "Rarely has a movie looked so good: the compositions and colours make each shot a minor work of art. Rarely has a film had such a constellation of stars: in a fun exercise of 'spot the actor', you should be able to identify a dozen, although one will prove harder than the rest (clue: it's an elderly woman). But then this is a work from the idiosyncratic Wes Anderson who wrote, produced and directed.The structure is a story within a story within a story and at the heart of this Russian doll is a tale set in a mythical Middle European nation called Zubrowka between the two world wars and focused on Gustave H (Ralph Fiennes), the dedicated but eccentric concierge of the eponymous hotel, and his aspiring young bell boy Zero Mustapha (Tony Revolori). In a wonderful cast full of exquisite performances, Fiennes is a revelation. The man who chilled us in \"Schindler's List\" here shows a remarkable skill in comedic acting.In a twisting plot of deceit and murder, above all this is a whimsical work from the opening views of the hotel to the final credits (when a little Russian character does a dance). Shot entirely in Germany, most of the scenes were filmed on the stages of the Babelsberg Studios."
    },
    {
      "username": "xcal321",
      "userUrl": "https://www.imdb.com/user/ur6622868",
      "reviewLink": "https://www.imdb.com/review/rw2983765",
      "warningSpoilers": false,
      "date": "21 March 2014",
      "rate": "10",
      "helpful": "521 out of 633 found this helpful.",
      "title": "A perfect holiday without leaving home.",
      "content": "My heart is still rolling from the escape to 30's Europe this afternoon, and without jet lag. This movie is an inspiration, a dream, a walk through a painting and a study of humanity. Ralph Fiennes﻿ is a phenomenon as M. Gustave. his interactions with every cast member and especially newcomer Tony Revolori are fantastic. The later holds his own weight beyond belief and the entire film is an amazing adventure with James Bond style chases, a large murder mystery, the best placed cussing and of course the sensational cinematography. The sets, models, angles and even the most nondescript characters come to life each on their own and together as a symphony of beauty. It's freaking brilliant; The Grand Budapest Hotel."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3055082",
      "warningSpoilers": false,
      "date": "23 July 2014",
      "rate": "9",
      "helpful": "16 out of 22 found this helpful.",
      "title": "A new high for Wes Anderson",
      "content": "The Grand Budapest Hotel is an old relic in the eastern European former republic of Zubrowka. In 1985, the author of the book Grand Budapest Hotel (Tom Wilkinson) recounts how in 1968 he (Jude Law) got the story from Mr. Zero Moustafa (F. Murray Abraham). He talks about his early life as Lobby Boy (Tony Revolori) with the original concierge M. Gustave H. (Ralph Fiennes) in 1932 who was willed a priceless painting by Madame Celine Villeneuve Desgoffe und Taxis (Tilda Swinton) setting off a battle with the woman's family led by her son Dimitri (Adrien Brody) and the violent Jopling (Willem Dafoe). Gustave is arrested for Madame D's murder. Agatha (Saoirse Ronan) is the girl of purity who's in love with Zero. Kovacs (Jeff Goldblum) is the executor of the will.This is a new high for Wes Anderson. He's filled this with his usual unique visual style and his quirky characters. In addition, he has used it in an exciting thriller with a bit of mystery. There are some really dangerous bad guys. There is real tension that isn't always there for a Wes Anderson film. He always had the quirky, the fascinating and the unique. This has so much more than that. It's a pretty fun thrilling ride."
    },
    {
      "username": "zetes",
      "userUrl": "https://www.imdb.com/user/ur0391152",
      "reviewLink": "https://www.imdb.com/review/rw2984945",
      "warningSpoilers": true,
      "date": "23 March 2014",
      "rate": "10",
      "helpful": "54 out of 85 found this helpful.",
      "title": "Simply wonderful",
      "content": "An extraordinary cinematic confection and probably Wes Anderson's greatest film. Ralph Fiennes plays the concierge at the Grand Budapest Hotel in the 1930s, which exists in a fictional European country in the Alpine range. He has a habit of keeping some of the old women who stay at the hotel company. When one (Tilda Swinton) leaves him the valuable painting Boy with Apple, Swinton's evil son (Adrien Brody) frames Fiennes for the murder. Fiennes' closest companion, the hotel lobby boy Zero (Tony Revolori), and his girlfriend (Saorsie Ronan) conspire to free Fiennes from prison and sell the painting for loads of money, hopefully enabling them to leave the country, which is being overtaken by fascists. The story isn't much more than fluff (though there is a nice tinge of poignancy), but it's enormously amusing fluff. The highly amusing trailer did give away many of the film's best gags, but this is a laugh a minute movie. The visuals are absolutely delightful. Sure, it's all nothing you haven't seen before from Anderson, but I found it his most perfect accomplishment. The film is loaded with great cameos and little roles (the woman behind me almost had an orgasm when Bill Murray appeared), but my favorite was Willem Dafoe as a toothless heavy."
    },
    {
      "username": "Figgy66-915-598470",
      "userUrl": "https://www.imdb.com/user/ur50423587",
      "reviewLink": "https://www.imdb.com/review/rw2983775",
      "warningSpoilers": false,
      "date": "21 March 2014",
      "rate": "8",
      "helpful": "118 out of 178 found this helpful.",
      "title": "Entertaining, slightly farcical, tale of dark deeds and friendship",
      "content": "21 March 2014 Film of Choice at The Plaza Tonight - The Grand Budapest Hotel. I really had no idea what this film was about, having seen only one trailer which in the event, bore no relation to the plot whatsoever. However, my interest was piqued so this evening found me watching a splendid little film packed to the rafters with stars. This was the tale of Gustave H, the legendary and infamous Concierge of The Grand Budapest Hotel, a rather glamorous edifice perched atop a mountain and his protégé and most trusted friend Zero, The Lobby Boy. This is a tale of friendship, murder, revenge and deep dark plotting. There were some completely ridiculous moments which were quite refreshing and several, what I like to call Guffaw moments where several members of the audience emit a loud blast of laughter followed by slightly hysterical giggling that you find yourself joining in with. As I said a host of stars in this film ranging from Ralph Fiennes, Jeff Goldblum, Jude Law and Bill Murray to Tilda Swinton, Owen Wilson and Harvey Keitel to name a few, but one of the outstanding performances must go to Tony Revolori, a relatively unknown young actor who plays Zero, who is In almost every scene. An entertaining film, worth watching."
    },
    {
      "username": "vincentlynch-moonoi",
      "userUrl": "https://www.imdb.com/user/ur23887409",
      "reviewLink": "https://www.imdb.com/review/rw2992381",
      "warningSpoilers": true,
      "date": "4 April 2014",
      "rate": "7",
      "helpful": "143 out of 258 found this helpful.",
      "title": "A funny thing happened to me on the way to the Grand Budapest Hotel",
      "content": "After seeing the previews several times, I thought I would enjoy a delightful almost-fantasy-like film. But, at age 64, after going to the movies literally hundreds of times in my lifetime, I did something today that I've only ever done 3 times previously -- I walked out of a movie halfway through the picture. I didn't blame Wes Anderson, because clearly his films have a following...but I thought it must be an acquired taste...that I had not acquired. I admitted that it was a uniquely visually pleasing film, but I wondered why so many fine actors agreed to what were rather small parts. At the time I said that this film bored me even more than \"Moonrise Kingdom\". The the other night it was on cable. I thought I would give it another try, but I fully expected to turn it off at home, also. Perhaps it helped that rather than watch it all in one setting, I broke it into roughly 30 minute segments with breaks in between. Guess what. This time I liked it. I'm not saying I loved it. But I did like it. What did I see this time that I didn't see before. Well, perhaps the tongue-in-cheek attitude of the film. The chance to see Ralph Finnes be downright silly instead of his typical dramatic role. The wonderful photography and special effects. The skill of young actor Tony Revolori. The pleasure of seeing F. Murray Abraham again. And, this time enjoying the many \"cameo\" shots.I still think it dragged on a bit too long (at 100 minutes there are still a few small bits that could have been edited more tightly or even eliminated). And, I'm still not a raving fan of it. But, this time around I did \"like\" it. But it won't end up on my DVD shelf, and I doubt I'll watch it again. But, bravo...good (not great) job!"
    },
    {
      "username": "PadmeAgnes",
      "userUrl": "https://www.imdb.com/user/ur30329898",
      "reviewLink": "https://www.imdb.com/review/rw2980074",
      "warningSpoilers": true,
      "date": "15 March 2014",
      "rate": "9",
      "helpful": "66 out of 94 found this helpful.",
      "title": "\"He retained the illusion with remarkable grace.\"",
      "content": "A former lobby boy, Zero Moustafaw tells a story to a writer, who tells this tale of a hotel, it's guests and the outstanding concierge Monsieur Gustav H to us. It's about (blind) loyalty, duty beyond the required, greed, stupidity, love for women in any age ... and the power of influence when treating persons with the grace of that person's beauty. It's (black) comedy at its best. The ridiculous becomes brilliant through cleverly constructed dialog, impeccable executed timing and timbre change. Many camera shots are little art pieces like in Moonrise Kingdom, beautifully constructed with cuts that ad to the timing, visually. The production design takes you from the shabby to over-the-top kitsch to breath taking wooden interiors and mountains. The CGI reminds me of Monty Python, deliberately unrealistic which is part of the humor yet makes it at the same time oddly believable.Never thought of Ralph Fiennes as a comedic actor. He convinced me here. Tony Revolori as young Zero Saoirse Ronan as Agatha are remarkable. And then there were: F. Murray Abraham, Jude Law, Tilda Swinton, Adrien Brody, Willem Defoe, Jeff Goldblum, Edward Norton, Léa Seydoux, Harvey Keitel, Tom Wilkinson, Bill Murray, Owen Wilson, (I think I saw George Cloony for 2 sec)... Just to be able to get all these heavy weights to sign up for minor roles, demands respect. To get them all set their mark in a few minutes, is awesome.\"He retained the illusion with remarkable grace.\" is one of the last lines in the movie. It describes both the main character and also the heart of the movie. This is a real 9 - beauty combined with dirt, great cinematography with dry jokes and art with silliness. If you like to be amazed, see something out of the ordinary, are able to go with a flow, you will LOVE this movie."
    },
    {
      "username": "skepticskeptical",
      "userUrl": "https://www.imdb.com/user/ur22563365",
      "reviewLink": "https://www.imdb.com/review/rw3308633",
      "warningSpoilers": false,
      "date": "31 August 2015",
      "rate": "6",
      "helpful": "41 out of 66 found this helpful.",
      "title": "Lots of Star Power and Style, Lacking in Substance",
      "content": "I gather that I was supposed to be thrilled by the \"artful\" use of color, costumes and props--especially color--in this production. And I did find it pleasant for what it was worth. It was also fun spotting celebrity cameos in nearly every scene. They were everywhere! A sort of \"Where's Waldo?\" in film form, with the hidden characters being Hollywood stars. The budget of this film must have been astronomical. But is it a great work of art?I am afraid that I disagree with the reviewers who are raving about The Grand Budapest Hotel. It was somewhat fun to watch, but the story, let us be frank, is rather banal and a weird mishmash of genres. Some may call that \"high art\" but to me it is more like a big glob of clichés from all of the different genres mixed together into one big pot. A mystery? A comedy? A romance? A drama? A slasher crime film (Dafoe plays a psycho professional killer)?This creation ends up being a lot of color and good props and an exercise in style, but it lacks the overall coherence and brilliance of a masterpiece. Star power and style are good, of course, but they do not alone suffice.Would I watch this film a second time? Probably not."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw3427222",
      "warningSpoilers": false,
      "date": "6 March 2016",
      "rate": "",
      "helpful": "6 out of 8 found this helpful.",
      "title": "Delightfully whimsical comedy adventure, with great design and fun performances",
      "content": "I watch a lot of short films and you can tell that Wes Anderson has very much made an impact on up and coming filmmakers due to how often you see people trying to make what they call 'a Wes Anderson style film'. Watching these film is mostly interesting because of how often these efforts fall short. It is a reminder to me of how hard it actually is to do 'whimsy'. To make it work, you not only need to make it happen, but you also need to do it in a way that gets the audience into the space they need to be in so as to be able to enjoy it; without this it is often just annoying.I was thinking of this because GBH is a great example of this working. This is not to say it is brilliant cinema, because in the end it is a whimsical piece but it does do it really well. The structure itself tells you where you are, because this is a film that opens with a girl paying respects at the bust of a dead author, who we then jump to as he starts to tell the story that was told to him by another man – a story which is also that of a story being told – and it is this story which we see for the most part. It is a structure that allows for the exaggeration and elaboration of all told stories, and it allows us to go with the sheer silliness of the tale. I say silliness, but actually the film keeps a lot which actually engages in the adventure plot, but yet at the same time delivers enough decadence and invention to allow us to enjoy it as a piece of fun.The cast match this. In many films it would be a real distraction to have so many famous faces in one film, however here it works – again because the audience are mostly positioned just to go with whatever. Fiennes is the beating heart of the film, and if he does not make his character work then the whole thing would struggle; as it is, he makes it work really well, with such color and flourish. Revolori is equally good, and needs to be since the friendship and his link to the presence (or plural) is also critical to making it work. The rest of the cast contain so many famous names doing small but enjoyable turns that it is pointless to name them all – but they all add to the whimsy rather than overwhelm it. Technically the film is a beauty, with great shots, great design through, and a sense of second-hand wonder which fits the story-telling structure.All told, it is a quite wonderful piece of silly adventure. It works because it knows itself, and it delivers itself really well in a way that draws the viewer into the space we need to be in to really go with it. This is not easy to do, and Anderson does it really well here."
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw3183721",
      "warningSpoilers": false,
      "date": "14 February 2015",
      "rate": "",
      "helpful": "21 out of 38 found this helpful.",
      "title": "A lot of Style but Little Substance",
      "content": "The Grand Budapest Hotel (2014)** (out of 4) Wes Anderson's critically acclaimed film tells the story of concierge M. Gustave (Ralph Fiennes) who befriends a young lobby boy and goes on an adventure dealing with a priceless stolen painting.THE GRAND BUDAPEST HOTEL has gotten some of the greatest reviews of the year and it even managed to pick up several Oscar-nominations but it just didn't work for me. Every once in a while a film will come along that I watch and I can understand why so many people love it but it just doesn't sit well with me. This film is a perfect example because there's no question that the film has some very good performance, has it's own look, feel and style and there's also no doubt that it's really unlike anything you've seen before. With that said, the film just felt like all style and very little actual substance.There's no question that Anderson is one of the most interesting director's working today and he often creates films that are just so original and fresh that they seem to take place in some weird, alternate universe. This film certainly fits into that category because visually speaking it's quite remarkable and it seems like each shot must have taken hours to set up in order to get right. The miniatures used in the film are obviously miniatures but it's clear they were shown like this for a purpose. It builds atmosphere. There color and set design is another major plus working for the film and especially the lay-out of the hotel.Another thing that works are the performances with each actor doing a very good job. Not only do we have Fiennes but there's also F. Murray Abraham, Jude Law, Jeff Goldblum, Bill Murray, Edward Norton, Tilda Swinton and Adrien Brody and Willem Dafoe, both who easily steal the show. There's certainly nothing to complain about in regards to the performances as everyone steps up and comes across with very original characters.Having said all of that, I just never once connected with the film and this is certainly not good when watching something. Obviously many people love this movie and it's a hit with most critics but to me there just wasn't much here to keep me entertained."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw3044679",
      "warningSpoilers": false,
      "date": "4 July 2014",
      "rate": "7",
      "helpful": "17 out of 30 found this helpful.",
      "title": "Another Original and Weird Movie by Wes Anderson",
      "content": "A writer (Jude Law) travels to the decadent Grand Budapest Hotel in the mountains of the Republic of Zubrowka and he meets the owner Mr. Zero Moustafa (F. Murray Abraham), who is a very simple man. Zero invites the author to have dinner with him and he tells his story and how he became the owner of the hotel. In 1932, in the glorious days of the Grand Budapest Hotel, Zero Moustafa (Tony Revolori) is hired to work as lobby boy under the command of the legendary concierge Monsieur Gustave H (Ralph Fiennes) that becomes his friend. Gustave manages the hotel and staff and also attends the sexual needs of the old ladies lodged at the hotel. He spends one night with Madame Céline Villeneuve \"Madame D\" Desgoffe und Taxis (Tilda Swinton) and soon he learns that she was found dead at home. Gustave summons Zero to travel with him to the funeral and he learns that he has inherited the valuable painting Boy with Apple. Madame D's son Dimitri (Adrian Brody) and her family do not accept that a concierge may have inherited the painting and Gustave and Zero steal it and return to the Grand Budapest Hotel to hide the painting. Gustave promises Zero that he would be his heir for helping him. But Gustave is falsely accused of murdering Madame D and is arrested and imprisoned. Will his friend Zero leave him die in the prison?\"The Grand Budapest Hotel\" is another original and weird movie by Wes Anderson with his usual bizarre characters. The story is funny and entertaining and it is impressive the number of stellar cameos along 100 minutes running time. Tilda Swinton is unrecognizable in the role of an old lady. My vote is seven.Title (Brazil): \"O Grande Hotel Budapeste\" (\"The Grand Budapest Hotel\")"
    },
    {
      "username": "cloud_nine",
      "userUrl": "https://www.imdb.com/user/ur1619514",
      "reviewLink": "https://www.imdb.com/review/rw2979657",
      "warningSpoilers": true,
      "date": "14 March 2014",
      "rate": "7",
      "helpful": "53 out of 82 found this helpful.",
      "title": "The Plot Simply Doesn't Gel",
      "content": "Interesting sets, beautifully locations, wooden characters. Too much of the story takes places in trains, a prison and the countryside. I really wish more of the plot had taken place in the hotel. Following a confusing beginning (there is a double flashback), the story took off without any real direction or reason. When the movie ended, many people in the audience applauded. My feeling was \"that's it?\" All the ingredients were there but the cake didn't rise.Still, I'm not sorry I saw the movie. It was different and that's always refreshing in a time of cookie-cutter plots.At one point I noticed that the movie was no longer being shown in widescreen but more of a television aspect ratio. Once the movie returned to 1985 or the present, it was widescreen. Weird."
    },
    {
      "username": "george.schmidt",
      "userUrl": "https://www.imdb.com/user/ur0937743",
      "reviewLink": "https://www.imdb.com/review/rw2975624",
      "warningSpoilers": true,
      "date": "7 March 2014",
      "rate": "10",
      "helpful": "13 out of 22 found this helpful.",
      "title": "Finally the first Must See Film of 2014!",
      "content": "THE GRAND BUDAPEST HOTEL (2014) **** Ralph Fiennes, Tony Revolori, F. Murray Abraham, Mathieu Amalric, Adrien Brody, Willem Dafoe, Jeff Goldblum, Harvey Keitel, Jude Law, Bill Murray, Edward Norton, Saoirse Ronan, Jason Schwartzman, Tilda Swinton, Tom Wilkinson, Owen Wilson, Larry Pine, Lea Seydoux,Giselda Volodi, Florian Lukas, Bob Balaban, Fisher Stevens, Wallace Wolodarsky, Waris Ahluwalia. Wunderkind filmmaker Wes Anderson continues to outdo himself in all matters of whimsy in this mirth-filled mischievous romp set in a fictional European country in flashback 1932 with bisexual bon vivant Fiennes (having a field day) as the concierge of the eponymous posh establishment taking a new 'lobby boy' (newcomer Revolori) under his wing as mentor/protégé and embroiled in an inheritance battle of wits involving a priceless painting, thuggish vulgarians and a dash of sharp-witted observations thrown in for good measure. Resplendent production design by Adam Stockhausen, Robert D. Yeoman's picture perfect cinematography and a cheeky screenplay by Anderson and Hugo Guinness inspired by Stefan Zweig's canon the film is a well-oiled machinery enmeshed with a crazy quilt more-than-a-cameo filled cast of Who's Who all relishing their moments however brief of irreverency and tact(less) behavior. Fun, funny and surprisingly poignant with a hint of historical nostalgia of what could've/should've been. Finally the first Must See Film of 2014!"
    },
    {
      "username": "perica-43151",
      "userUrl": "https://www.imdb.com/user/ur89494061",
      "reviewLink": "https://www.imdb.com/review/rw4217817",
      "warningSpoilers": false,
      "date": "27 June 2018",
      "rate": "9",
      "helpful": "12 out of 17 found this helpful.",
      "title": "A fun movie with a lot of Wes Anderson wit",
      "content": "If you like Wes Anderson, you will love this movie. Witty, entertaining and pleasant, it is a comedy in his unique style, that hits all the tones and notes that make him a unique and original director."
    },
    {
      "username": "Turfseer",
      "userUrl": "https://www.imdb.com/user/ur0225436",
      "reviewLink": "https://www.imdb.com/review/rw3166962",
      "warningSpoilers": true,
      "date": "20 January 2015",
      "rate": "4",
      "helpful": "14 out of 23 found this helpful.",
      "title": "In the Anderson oeuvre, there's a lot to see, but he has hardly anything to say",
      "content": "Wes Anderson is back at it again with another one of his quirkfests, this time entirely convincing most critics that he's crafted a masterpiece. Most are mesmerized by the production design, which truly deserves an Academy Award. Anderson opted to use miniatures for wide shots of the hotel and did extensive research for the interiors. The Görlitzer Warenhaus, a defunct German department store which survived World War II, was a stand-in for the Grand Budapest's lobby. Anderson's cinematography, which features all kinds of shots from unusual angles was probably another reason the critics were so impressed with the film (take note of the prison escape scene in particular). But I believe critic Stephanie Zacharek of The Village Voice gets it right when she concludes that Anderson's narrative, is wholly one-note in nature: \"This meticulously appointed doll house of a movie just went on and on, making me want to smash many miniature plates of plaster food in frustration.\"The narrative begins when a famous author in 1985 recounts a visit he made to the then decaying Grand Budapest Hotel in 1968; he then met the owner, Moustafa (F. Murray Abraham), who recounts his days as a lobby boy at the hotel in 1932. The hotel is located in the fictional Republic of Zubrowka, a remnant of the old Austro-Hungarian Empire. One is reminded of the Marx Brother's take on their own fictional Balkan Republic, \"Freedonia,\" but alas in Anderson's \"homage,\" there are no laughs!Ralph Fiennes plays M. Gustave, the concierge at the hotel, who takes Zero, the young lobby boy (who is the narrator of the story in his old age), under his wing. Gustave, an admitted bisexual, has been having a very brief affair with the elderly owner of the hotel, \"Madame D,\" who soon dies under mysterious circumstances. She bequeaths a rare painting, \"Boy with Apple,\" which enrages the Madame's son, Dmitri (Adrian Brody), who insists Gustave is not entitled to it. Despite Dmitri's opposition, Gustave steals the painting anyway (aided by Zero), and returns it to the Grand Budapest Hotel, where he places it in the hotel safe. Gustave makes Zero his heir, in return for his help.The Madame's secretary, Serge X, is forced into accusing Gustave of murdering the old lady and Gustave ends up in prison. Gustave remarks that he earned the respect of hardened criminals by \"beating the sh-t out of one of them for challenging his \"virility.\" To make a long story short, Gustave digs his way out of prison using tools hidden in cakes baked by Zero's fiancée, Agatha. He and Zero are pursued by an assassin hired by Dmitri, Jopling (William Dafoe) who ends up murdering Serge. Jopling gets his comeuppance at the hands of Zero, who pushes him off a cliff. If this isn't enough, there's also a gunfight with Dmitri and the discovery of a second will inside the painting, proving Gustave's innocence. The reason, most of this hokum isn't funny, is because Anderson's antagonists are unlikeable. Take for example Dmitri—when he first encounters Gustave he calls him a \"fagg-t\" and slaps him in the face. While Anderson attempts to lighten the scene up when other characters start hitting each other in the face, the damage cannot be undone: Dmitri remains an unpleasant villain throughout. In real farce, we experience the outrage without the consequences. But there are consequences aplenty when Serge is murdered up at the rectory. Even Gustave's death during the epilogue, at the hands of those fascist-like soldiers on the train, sounds the wrong note for a film that should be light-hearted (just like \"Duck Soup\"). And why all those anachronistic expletives throughout the movie? Why must the elegant Gustave say things that he beat the \"sh-t\" out of that prisoner? Anderson relies on these out-of-character remarks, to obtain a few cheap laughs.Dana Stevens wonders in Slate Magazine, what Anderson is really trying to say here: \"As played with a melancholy rakishness by the handsomer-than-ever Fiennes, M. Gustave is one of Anderson's more memorable creations—but he's stranded in a movie that, for all its gorgeous frills and furbelows (including a lush musical score by Alexandre Desplat and a surfeit of charming cameos from Anderson regulars like Jason Schwartzman, Ed Norton, and Bill Murray), never seemed to me to be quite sure what it was about. Youth, age, rivalry, and mentorship? Nostalgia for a lost way of life? The ineluctable slaughterhouse of 20th-century European history? These are big, dark themes, ideas that the director (who also wrote the screenplay, with a story assist from his friend Hugo Guinness) seems both obsessed by and game to explore. But somehow Anderson never quite lets himself (or his characters, or by extension, us) get to the deepest, darkest places those paths might lead.\" Stevens gets it right when she concludes that with Anderson \"everything remains in that familiar register of chilly, stylish remove.\"Ultimately, one can never care for any of Anderson's characters. They are written intentionally not to be taken seriously. Take Agatha and her death from \"the Prussian Grippe.\" Not only does Agatha die but so does her infant son. Agatha is supposed to be one of the sympathetic characters, but here Anderson bumps her off too with a cheap aside.Why do so many people find Anderson's vision so enchanting? Perhaps it's the pleasure they feel when his quirky misfits triumph over a coterie of reactionaries (as the evil Dmitri fails to deprive Gustave of his inheritance). Underneath all the slapstick, is standard melodrama (the bad guys getting their comeuppance), mixed with a touch of black humor. In the Anderson oeuvre, there's a lot to see, but he has hardly anything to say."
    },
    {
      "username": "michaelRokeefe",
      "userUrl": "https://www.imdb.com/user/ur0449021",
      "reviewLink": "https://www.imdb.com/review/rw3078001",
      "warningSpoilers": true,
      "date": "30 August 2014",
      "rate": "7",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Lunacy, witty and pure fantasy!",
      "content": "A Wes Anderson fanciful farce. Anderson directs, shares story writing and is in charge of the screenplay. This is a maniac fantasy that takes place between the world wars in the Republic of Zubrowka. Gustave H(Ralph Fiennes) is the eclectic concierge at the prestigious European Grand Budapest Hotel, who takes a bellboy named Zero(Tony Revolori)under his wing and preps him to become a trusted friend and protégé. Mr. H caters to his guest and even makes clandestine visits to some of the most snooty and wealthiest older ladies. And on occasion the richest of men. Gustave and Zero find themselves embroiled deeply in a heated battle for a family fortune. The meticulous concierge is accused of art theft and even murder, making for riotously and hilarious flight from the authorities. Mr. H and Zero, while on the run, contemplate a logical conclusion. Playful, witty, quirky and near impeccable story telling using a backdrop of flashbacks.Packed full of stars for sure: F. Murray Abraham, Willem Dafoe, Adrian Brody, Jude Law, Saoirse Ronan, Edward Norton, Harvey Keitel, Jeff Goldblum, Bill Murray, Jason Schwartzman, Tom Wilkinson and Tilda Swinton."
    }
  ],
  "errorMessage": ""
}