{
  "imDbId": "tt0114369",
  "title": "Se7en",
  "fullTitle": "Se7en (1995)",
  "type": "Movie",
  "year": "1995",
  "items": [
    {
      "username": "preppy-3",
      "userUrl": "https://www.imdb.com/user/ur0463200",
      "reviewLink": "https://www.imdb.com/review/rw1819666",
      "warningSpoilers": false,
      "date": "14 February 2008",
      "rate": "9",
      "helpful": "52 out of 55 found this helpful.",
      "title": "Very grim and disturbing but you can't stop watching",
      "content": "Detective Lt. William Somerset (Morgan Freeman) is about to retire. He is teamed up with a young new detective David Mills (Brad Pitt). Together they try to find a serial killer who uses the seven deadly sins as his M.O. Meanwhile Mills' wife Tracy (Gwyneth Paltrow) fears for her husband's life and is very depressed.Dark and depressing but just fascinating. Director David Fincher shots the entire film in dim light and shoves the victims mutilated bodies in our face. The grimness of the tone wears you down but that's appropriate considering the subject matter. No humor either. It all leads to a truly harrowing ending. There was supposed to be a happy ending but they (wisely) chose not to do it. Freeman and Pitt work very well together and both give excellent performances. I even thought Paltrow (who I hate) was good! Kevin Spacey is very good too in a small role.If you have trouble with blood, gore and disturbing subject matter stay far away from this movie. But if you can handle that, watch this one. It's depressing and unpleasant but riveting."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2251710",
      "warningSpoilers": false,
      "date": "18 May 2010",
      "rate": "10",
      "helpful": "93 out of 107 found this helpful.",
      "title": "A brilliant postmodern film noir that is grim, intelligent and disturbing",
      "content": "From David Fincher, Se7en is a compelling and brilliant postmodern film noir. It is grim and disturbing but it is also very intelligent and daring. What I did love about Se7en especially is that it is incredibly stylish, beautiful dark cinematography and dazzling landscapes really do add to the atmosphere. Very little of the murders are shown but we are appalled and shocked by what we hear of them, the action is tense and the climax is shattering. There is also an intelligent screenplay, a clever plot telling of a vicious serial killer who murders his victims in a gruesome way to atone for the sins(gluttony, greed, sloth, lust, pride, envy and wrath)he deems them to have committed and excellent direction. The acting is also superb, Morgan Freeman gives another brilliant performance as the disillusioned detective and Brad Pitt is great as Mills in a more meatier role than he has ever done. Gwyneth Paltrow makes a small yet significant appearance as Mill's uneasy wife, while Kevin Spacey superbly delivers equally superb dialogue as John Doe despite the fact he isn't in the film much. Overall, a brilliant film, with adept performances, direction, style and ambition. 10/10 Bethany Cox"
    },
    {
      "username": "Boba_Fett1138",
      "userUrl": "https://www.imdb.com/user/ur1416505",
      "reviewLink": "https://www.imdb.com/review/rw0370863",
      "warningSpoilers": false,
      "date": "30 April 2004",
      "rate": "10",
      "helpful": "312 out of 371 found this helpful.",
      "title": "Dark and disturbing thriller that will stay with you for ever.",
      "content": "Rarely there has been a movie with such a good dark and chilling atmosphere. I even see this movie more as an horror movie than as a thriller because of that. \"Se7en\" is unique in many ways. The movies mood is already set right from the beginning on. The movie starts dark, intense, chilling and mysterious, a mood that is present throughout the entire movie. It's very depressing to watch and I mean that in a positive way of the meaning of the word. The mood is set by good camera work and lighting, or better said, the lack of it. The music from acclaimed composer Howard Shore also adds to the chilling atmosphere. Unlike many other movies from the same genre, the movie is slow paced and takes it time to develop the characters without falling into some obvious cliché's. The two main characters played by Morgan Freeman and Brad Pitt are presented as an unlikely police-couple that are different in many ways from each other but in a way that is also what makes them such a great couple. Brad Pitt for once has the opportunity to play more than just the pretty boy and he does it with success. Kevin Spacey truly plays a bone chilling character, almost just as legendary and chilling as Hannibal Lecter. I would very much like to see the two of them put in the same room, just to see who would make it out alive. Further more it was great to see R. Lee Emrey again as the police captain. The movie is filled with some truly gross, sickening and horrifying scene's, this seriously ain't no kids stuff! The movie has some of the most sickening murders I have ever seen featured in a movie. But it aren't just only the gross scene's that are good, there are also some scene's that are made with lot's of beauty and profession such as the library scene. Dark and chilling movie that you will never forget also thanks to the ending which I will not spoil for you. A real must see. 10/10"
    },
    {
      "username": "tomgillespie2002",
      "userUrl": "https://www.imdb.com/user/ur3741220",
      "reviewLink": "https://www.imdb.com/review/rw2971735",
      "warningSpoilers": false,
      "date": "1 March 2014",
      "rate": "10",
      "helpful": "33 out of 36 found this helpful.",
      "title": "Still manages to astound after 20 years of repeat viewings",
      "content": "After his calamitous experience working on his début film Alien 3 (1992), David Fincher took on a small genre picture that, little did he know, would revitalise his career and become one of the greatest films of the 1990's. Se7en appears to begin as your typical detective neo- noir, with the cynical veteran and the naive rookie taking on an elusive serial killer seemed hell-bent on turning the sin against the sinner. But, set in an unnamed and permanently drizzly American city, Se7en is a meditation on evil and a pessimist's depiction on the modern world, climaxing in one of the bravest and most memorable endings in Hollywood history.Detective Somerset (Morgan Freeman) is on the verge of retirement, where he plans to leave his inner-city life behind him after years of fighting on the side of good. His replacement is the brash Detective Mills (Brad Pitt), an optimistic young recruit eager to learn, who Somerset takes under his wing. Their first homicide investigation involves an obese man who has been fed at gunpoint to the point of causing his stomach to rupture. With Somerset ready to leave the force, Mills takes on his first solo case in the murder of a rich attorney, a man forced to cut a pound of flesh from his own body. The murder scene has the words 'greed' written in blood. Somerset eventually finds the word 'gluttony' etched in grease in the apartment of the first victim, and he becomes convinced the murders are connected, and that the killer is murdering under the guidance of the seven deadly sins.The genius of Se7en is rooted in the way the movie keeps the audience as clueless as the detectives. Normally in genre pictures such as this, we either know who the killer is and eagerly wait for the investigators to put the pieces together, or we have a line-up of suspects and red herrings to decide from. Here, apart from brief glimpses during a thrilling chase scene, we are devoid of clues. The killer is always one step ahead of Somerset and Mills, alluding to the idea that the mysterious 'John Doe' is indeed having his work guided by a higher power. Of course, he is not, he is merely a man, but this helps gives Se7en dramatic weight, rather than it becoming a nihilistic exercise in cruelty.When, three-quarters of the movie in, the killer hands himself in, the movie becomes a masterclass in writing, slowly building into one of the greatest climaxes in film. Somerset, a decent man who has devoted his life to the side of good but has had the fight slowly drained out of him, meets his nemesis in John Doe (Kevin Spacey). But as they talk, Doe's reasoning becomes clear and, shockingly, almost sympathetic. \"Wanting people to listen, you can't just tap them on the shoulder anymore, you have to hit them with a sledgehammer,\" he says. It's about a world gone to s**t, a view shared by Mills' wife Tracy (Gwyneth Paltrow), who talks to Somerset in a diner about allowing a baby to be born into the world after discovering she is pregnant. Cerebral and Gothic, Se7en transcends the genre on so many levels thanks to some bleak yet stylish direction by Fincher, and it still manages to astound after almost 20 years of repeat viewings.www.the-wrath-of-blog.blogspot.com"
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw1833320",
      "warningSpoilers": true,
      "date": "4 March 2008",
      "rate": "10",
      "helpful": "68 out of 81 found this helpful.",
      "title": "He's experienced about as much pain and suffering as anyone I've encountered, give or take, and he still has Hell to look forward to.",
      "content": "Seven is directed by David Fincher and written by Andrew Kevin Walker. It stars Morgan Freeman, Brad Pitt, Gwyneth Paltrow, Kevin Spacey and R. Lee Ermey. Music is scored by Howard Shore and cinematography by Darius Khondji.An unnamed US city and two cops are on the trail of a serial killer who kills his victims according to which one of the seven deadly sins they have committed.Having been stung by the studio interference and negative fall out regarding his directorial debut feature film, Alien 3, David Fincher waited three years before committing to a project that he had control over. The result was Seven, a dark masterpiece of unremitting creeping dread that showcased the work of a clinically excellent director. Seven is not just a movie, it's an experience, an assault on the senses, a jolt to the brain, a trawl through the dark recess of some sick city where it always rains and the darkness holds many fears. This is no boorish slasher movie, it's psychological discord 101, we only see the aftermath of crimes, the discussions of which forces us to delve deep into our own imagination to fill in the blanks, forcing us to go where we don't want to go, you sense the director is somewhere gleefully pulling our strings.\"But that's the point. We see a deadly sin on every street corner, in every home, and we tolerate it. We tolerate it because it's common, it's trivial. We tolerate it morning, noon, and night. Well, not anymore. I'm setting the example. What I've done is going to be puzzled over and studied and followed... forever\"Seven is very much an ultimate horror film, really is there anything more scary than a serial killer who is smarter than the cops chasing him? Not only that but they are, oblivious as they be, part of the master plan. This killer is not only unstoppable in perpetrating his violent crimes, he is, as Freeman's weary retirement bound Detective Somerset says, methodical and patient. It's going to end bad, the cops know it and so do we, and that's when Fincher and Walker stick their hands into our guts and pull out the last semblance of solids to deliver one of the greatest endings of modern cinema. An ending fit to grace any noir, neo-noir or smart ass psychological horror movie from across the ages. With each viewing of Seven there's the repeating wave of bleak emotions that come as the reversed end credits roll, desolation and disbelief, sadness and shock, our trip through earthly hell is over, but only in the psychical sense!Faultless cast performances, no doubt eked out by what we now know is a task-master director, photography that brilliantly brings to \"light\" the melancholic sheen of a decaying society and a Howard Shore score that crawls out of the speakers and cloaks your body like some evil Incubus or Succubus. Seven, a masterpiece of unease and evil wrung out by a master director. 10/10"
    },
    {
      "username": "chvylvr80",
      "userUrl": "https://www.imdb.com/user/ur1628323",
      "reviewLink": "https://www.imdb.com/review/rw0370894",
      "warningSpoilers": false,
      "date": "15 October 2003",
      "rate": "10",
      "helpful": "574 out of 690 found this helpful.",
      "title": "Probably the greatest murder story ever",
      "content": "Seven's quality puts it so far beyond most of the \"cops on trail of deranged killer\" genre that it comes out as a true jewel of cinema. Everything about seven is perfect. It is art captured on film. This movie is a bright spot for all of the stars who worked on it. Brad Pitt never gets the credit he deserves for his acting because he's a pretty boy and the press is a lot more interested about how he and Jennifer are doing. That's a shame because he is a talented actor that isn't afraid to take chances with both the roles that he picks and the characters that he plays. That is quite rare in the A-list world. Morgan Freeman is a great actor. You can always count on him to do what he does best which is play a wise veteran that has seen it all. Kevin Spacey is another great actor that has great range and really puts life and personality into his characters. The real talent of this movie, excluding the actors that brought it to life, is the director David Fincher and the writer Andrew Kevin Walker. Fincher's talents for making a visually stunning film are now well known and he often brings a dark patina to his work. Andrew Kevin Walker must have some incredible demons living inside him. Either that or one hell of an imagination for bringing the intricate story of Seven and the plan of John Doe to life. John Doe's plan really is twisted and I won't be spoiling it here. Suffice to say I have never seen so evil and complicated a plan in a movie before or since. The cinematography of the film is dark but beautiful and throughout the film it is either night or raining or both except for two very brief moments. It is such an emotional movie that you can't keep from being caught up in what is happening. Do you understand and sympathize with what John Doe is doing or do you think him a mad killer that must be stopped.Bottom Line: If you haven't had the opportunity to see Seven yet then you must at least rent it. It is so damn good that I know you will like it. The only reason you wouldn't is because you're just too damn fragile to take something this hardcore."
    },
    {
      "username": "RedRoadster",
      "userUrl": "https://www.imdb.com/user/ur20047343",
      "reviewLink": "https://www.imdb.com/review/rw2062484",
      "warningSpoilers": true,
      "date": "6 May 2009",
      "rate": "10",
      "helpful": "301 out of 337 found this helpful.",
      "title": "A dark and disturbing masterpiece.",
      "content": "It is a rarity for a film to be completely unsettling and yet unrelentingly gripping.David Fincher's story takes place in a bleak and constantly raining city (never named) where urban decay and sleaze in all forms are rampant. Coming up to his retirement from the police force is Detective Lieutenant Somerset (Morgan Freeman) who is tasked with breaking in his replacement, Detective Sergeant Mills (Brad Pitt) before leaving. Somerset is world weary, under no illusions about the futility of the daily role he plays and (initially) wants nothing more than to escape the grime and violence of the city. Mills on the other hand is convinced that he is going to make a real difference having voluntarily transferred to this precinct, bringing his wife to the city with him. Before Somerset can move on, a homicide comes in which he and Mills are assigned to investigate. But its only the first of a string of ritual murders that will be committed by a killer who is basing his crimes on the seven deadly sins as depicted in Dante's \"The divine comedy\".To begin with, Se7en appears to be a standard \"cops on the trail of a killer\" story which shouldn't be too difficult for the audience to get comfortable with. But as we descend along with the characters into the merciless, brutal world without hope that they inhabit, you are left reeling at the events that unfold.The two detectives enjoy an uneasy relationship with no real friendship ever striking up between them. The older Somerset is educated, astute and gives the impression of being emotionally burnt out. Mills, who has no respect for Somersets methodical investigating gets excited at the thought of solving a murder and firmly believes that the good guys will win eventually. The further we get into the action, the might of the evil that they face pushes both men beyond their limits.This film draws heavily on biblical themes and you can certainly see similarities with such films as \"The Seventh Seal\" (1957). Both films show the price that good men have to pay when they fight evil and the unsettling truth that the rule book goes straight out the window when you are dealing with something so diabolical that it has no boundaries or limits at all.Se7en shows us a world which has been destroyed by its own sins, a wasteland in which values are minimal. The killer, having nothing but contempt for this world, sees it as his mission to expose the faults and show everyone what they have become. It is a fascinating twist that when the killers motives become clearer, Somerset with his greater understanding actually feels some degree of empathy with him. This is lost on Mills though, whose level of clarity never reaches the same point.A previous reviewer mentioned that you begin to expect the unexpected whilst watching Se7en and i completely agree. Eventually if you think of the most obvious outcome in any situation and predict that the opposite will happen, it usually does. Even the finale itself became kind of predictable because by then you are conditioned not to have any hope. This is a minor flaw though because the story is so well and so shockingly told.Director David Fincher didn't pick up another script for 18 months, such was his exhaustion and frustration following the completion of Alien 3. Apparently he agreed to direct se7en after one reading of Andrew Kevin Walkers screenplay because he was drawn to its hard hitting delivery about inhumanity. He stated: \"It's psychologically violent. It implies so much, not about why you did but how you did it\". For the camera work specially altered film stock was used to make the visuals look as dark and unsettling as possible which is complemented well by Howard Shores music score.The Most disturbing message that Se7en puts across, is that the fight against evil is destined to be a Pyrrhic victory. But regardless the only thing we can do is fight on whatever the cost. We have no other choice.\"The World is a fine place and worth fighting for.\" I agree with the second part."
    },
    {
      "username": "mjw2305",
      "userUrl": "https://www.imdb.com/user/ur3174947",
      "reviewLink": "https://www.imdb.com/review/rw1009892",
      "warningSpoilers": true,
      "date": "30 January 2005",
      "rate": "10",
      "helpful": "51 out of 63 found this helpful.",
      "title": "Top Serial Killer Movie",
      "content": "Somerset, (Morgan Freeman) a deeply Intellectual Detective, with barely a week left until his retirement and Mills, (Brad Pitt) the new cop in town, who is a pretty weak detective, are thrown together to investigate what at first appears to be another Homicide.After a second Victim is found, Somerset realises that this is no open and shut case, and requests that he is relieved, in light of his impending retirement. Mills gladly takes over the case and plunges himself in way over his head.As the work of a Crimally insane genius continues, Mills grows more and more erratic, and Somerset simply has to remain, to guide his young partner through the case, which ultimately leads to one of the finest climax's in movie history.With Wonderful Performances from both Freeman and Pitt and a really dark and morbid direction from David Fincher, the movie is crammed with suspense, intrigue and Excitement.My Favourite scene is John Doe (Kevin Spacey) tearing into Mills in the car, driving towards the Climax, the acting is simply perfect as Pitt's character is torn apart by the genius of the Criminally insane, and Freeman interjects with insightful rationality, demonstrating his superior mind. The Scene Carries such intensity, and at the same time encapsulates the primary characters basic elements. Most actors can't achieve this level of character depth, but these are three of the finest actors of our time. 10/10"
    },
    {
      "username": "winner55",
      "userUrl": "https://www.imdb.com/user/ur4627372",
      "reviewLink": "https://www.imdb.com/review/rw1746146",
      "warningSpoilers": false,
      "date": "14 October 2007",
      "rate": "9",
      "helpful": "152 out of 201 found this helpful.",
      "title": "one of the best-made films of its era and genre",
      "content": "Despite clichés, and a very depressing finale, this is one of the best-made films of its era and genre.The strengths of the film include an odd relationship between the two lead cops, who seem loosely based on the two lead cops of the \"Lethal Weapon\" series, but who (thankfully) never play for laughs, and never really become \"buddies\" - the young cop is too arrogant, and the older cop has too much experience, which the young cop refuses to acknowledge. The two characters are also brilliantly acted by Morgan Freeman and Brad Pitt (probably his best performance).There's one odd flaw in the film - about half-way through, I found that I had learned to \"expect the unexpected\" from the film, which meant that the rest of the film was predictable in a bizarre way - simply decide where the expected move would be, and then expect the unexpected move instead. The most obvious instance of this is in the finale itself, which could be guessed at least 5 minutes ahead of time.Normally, this would be a formula for disaster - but fortunately, the high quality of the film-making twists the film into an edge-of-the-seat suspenseful waiting game as we watch with horror the one cop's encounter with the insanity of pure evil.I didn't want to admire this film (to be honest, I dislike Brad Pitt something fierce), but I'm afraid I must - very professionally made, it delivers its promised suspense all the way."
    },
    {
      "username": "johnmbale",
      "userUrl": "https://www.imdb.com/user/ur4830672",
      "reviewLink": "https://www.imdb.com/review/rw1155255",
      "warningSpoilers": true,
      "date": "21 August 2005",
      "rate": "10",
      "helpful": "132 out of 161 found this helpful.",
      "title": "Stand out Thriller thanks to Fine Cast.",
      "content": "A stand out film dealing with a particularly unpleasant Serial Killer, \"Se7en\" (along with \"Silence of the Lambs\"), is something of a milestone in this genre. An intelligent script, and admirable actors including the excellent Morgan Freeman, Prad Pitt, Gwenth Paltrow and Kevin Spacey, with a cinema noir style, and very grisly murders representing the Seven Deadly Sins. It is the performances however that lifts this movie above the average, Morgan Freeman as the older world wise detective, Pitt almost manic as his young enthusiastic sidekick, Poltrow plays the wife with a fine degree of sensitivity, and Spacey does his usual brilliant psycho routine. There is a pivotal scene with Freeman and Paltrow in a café which shows the depth of performances here. They are believable characters in a dark disturbing world wherein it always seems to be raining. An effective thriller with tight direction and atmospheric photography."
    },
    {
      "username": "tsatsas",
      "userUrl": "https://www.imdb.com/user/ur1782228",
      "reviewLink": "https://www.imdb.com/review/rw0370771",
      "warningSpoilers": false,
      "date": "20 June 2002",
      "rate": "10",
      "helpful": "375 out of 455 found this helpful.",
      "title": "Modern Masterpiece!!",
      "content": "Gothic, shocking, suspenseful, disturbing and clever, `Seven' marked a new beginning for director David Fincher's career. This dark tale of murder and crime revolves around two detectives in present New York city played by two brilliant actors `Brad Pitt' and `Morgan Freeman' who are paired together to solve a puzzle of murder that is at the hands of a man who kills regarding to the seven deadly sins. Both actors displayed striking performances that are so sharp and realistic sometimes you have to remind yourself that's its all acting. David Fincher's masterpiece really gives us an opportunity of a lifetime, maybe it's one that we don't all wish to share, but by seeing this movie you will experience a glimpse of the horrors that this world is filled with, and a small piece of mind of a man who you only prey you never have to meet.Brad Pitt successfully proves to us that he's not just a pretty face on screen, and that he sinks into his character so well, that you can walk off after the film finishes classifying him as a pretty darn good actor.You wouldn't expect anything else from Morgan Freeman because it's perfectly obvious that this guy was born to play the roles of the smart detective.David Fincher's timeless directing and memorable filming captures all the goods that this film has to offer and will undoubtedly leave you shocked and begging for more films like this. Seven is a step into the harsh realities of life, a realistic portrayal of two detectives investigation into the un-describable horrific world murder, and the darkest realms of the human soul.We can only prey for more classic memorable work from Mr. Fincher and for those future directors who are intent on making a gothic, psychological thriller, make sure you sit down and watch Seven with a pen and paper ready to take notes."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8737627",
      "warningSpoilers": false,
      "date": "15 December 2022",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "An out and out classic.",
      "content": "A retiring Detective and a young rookie are hunting down a serial killer, a killer with a dark MO, murdering his victims using the seven deadly sins.As I watch this, it's coming up to its thirtieth anniversary, and it's as fresh now as it was back in 1995, it's an intensely macabre take, crimes that are infinitely macabre and depraved, and intensely twisted.The combination of Freeman and Pitt is incredible, they work immensely well together, we have the fresh zest of Mills, and the unshakable, but battle weary Somerset. Paltrow and Spacey are excellent in support.Two hours flashed past, there is no lull, no moment to switch off and boil the kettle, the intensity is immediate, the pacing designed to keep you glued.I have always thought there is a shade of Alfred Hitchcock about this movie, such is the intelligence of the plot.Very good visuals, the macabre and gruesome bodies look shocking still, nothing is spared or hidden away.10/10."
    },
    {
      "username": "pooch-8",
      "userUrl": "https://www.imdb.com/user/ur0197287",
      "reviewLink": "https://www.imdb.com/review/rw0370406",
      "warningSpoilers": false,
      "date": "16 August 1999",
      "rate": "",
      "helpful": "143 out of 184 found this helpful.",
      "title": "Superbly crafted drama delves into darkest corners of the psyche",
      "content": "David Fincher's bleak, relentless, and ultimately terrifying crime thriller Seven transcends other films of the genre with incredible plotting (the sort Hitchcock might employ were he alive and making films in the 1990s) and scalding intelligence. With only a small handful of minor flaws -- the overly familiar retiring cop/young cop pairing; the awful \"I'm taking you off the case!\" cliche seemingly required by the genre; one giant lapse in logic in the downward spiral toward the conclusion that cannot be revealed without ruining the script's gruesome surprise -- Seven typically keeps its viewers imprisoned in their seats with a combination of morbid fascination and abject fear. Despite attempts by studio executives to alter Andrew Kevin Walker's ending, the filmmaking team prevailed and audiences experienced that rare treat of mainstream cinema: an uncompromising vision."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0370671",
      "warningSpoilers": false,
      "date": "29 March 2002",
      "rate": "",
      "helpful": "45 out of 59 found this helpful.",
      "title": "Simply one of the darkest and best thrillers of the 1990's  but don't let anyone spoil it for you.....",
      "content": "`Days from retirement' Detective Somerset is teamed with new-to-the-city Detective Mills to investigate a murder that quickly becomes a series. Somerset realises that the killer must be smart and is using classic literature to model his killings on the seven deadly sins, however Mills finds to hard to see him as anything other than a crazy man. With the killer close to completing his work, Mills and Somerset begin to close in on him. However nothing is as it seems in a dark depressing city full of moral degradation and apathy.When David Fincher came onto the scene with his debut feature Alien3 the world only paused to scorn a film that didn't fit in with the Alien franchise. Yes it wasn't a great film  but I loved the sense of mood, the dark the tension in the shadows that Fincher created. Years later we have Se7en, Fight Club, The Game, and at people are getting Fincher!Se7en was his major break through  where his dark visions also reaped box-office gold. The story doesn't sound like much  mismatched partners (one young, cocky and reckless  the other a few days from retirement) go after a serial killer who is carrying out a series of twisted murders ..it sounds like Lethal Weapon meets a straight to video thriller. But happily it rises above that by so much it's unbelievable .it certainly shows how a story put in good hands can work out. From the start we are entombed in mood  the city where it always rains, the uncaring people etc. The we begin to find murders  but Fincher doesn't show us the murders, he lets us see the aftermath in the shadows and lets us imagine the rest  Genius!What you don't see is more gory than what you do. Meanwhile the tension is cranked up to fever pitch as the race to catch the killer is accelerated. When we meet the killer, the film just gets better right up to an ending that is simply one of the most logical, emotional and gripping endings I've ever seen. I promise you'll leave the cinema shell shocked.Freeman is excellent as Somerset  so good that it's a role he's tried to do again in `Kiss the girls' etc. But here he is the perfect foil for both Mills and the killer. Brad Pitt is also superb....he isn't allowed to trade on his looks here and does very well in a film that has little opportunity for him to pander to his female fans  he spends a lot of it looking beaten up. Paltrow is OK with what she has  but this isn't really a film that focuses on female roles. R. Lee Ermey is as good as ever and it's a sign of how good the cast is that actors of the stature of Charles Dutton and John C McGinley are basically in roles that barely count as cameos.However the best performance is from Kevin Spacey in the years before he became an Oscar lovie and stopped doing bad guys or dark characters. He is only on screen for a small portion of the film but his dialogue is superb and he delivers it faultlessly. In the scene where he shares a car ride with Mills and Somerset you literally hang on his every word. However alongside Spacey Fincher stands triumphant with his dark vision given the perfect story and perfect actors.At heart this is a cop thriller  but excellent performances, excellent mood and a moral lesson from an excellent Spacey make this quite simply the most jaw-droppingly excellent thriller of the 1990's."
    },
    {
      "username": "illbebackreviews",
      "userUrl": "https://www.imdb.com/user/ur28221379",
      "reviewLink": "https://www.imdb.com/review/rw2728543",
      "warningSpoilers": true,
      "date": "31 December 2012",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "Fincher's Se7en is a classic crime story which can rival the likes of Silence of the Lambs",
      "content": "Remember the Silence of the Lambs which is regarded as the greatest Crime/Thriller film of all time. Well, Fincher's Se7en can rival that masterpiece.Se7en contains everything that a film should contain. It has a superbly created soundtrack by Howard Shore who rightfully, deserved an Oscar for this work. The correct casting is given for Dt. Somerset as Morgan Freeman and Dt. Mills as Brad Pitt. This really begun Pitt's career as a great actor. The two, on screen, share incredible chemistry that automatically bonds them together well. The story itself is remarkable and easy to follow. It follows the story of a serial killer who uses the Seven Deadly Sins to kill seven of his enemies in order to complete his masterpiece and in order for the world to remember and respect the seven sins. The film has that mysterious tone to it and gives certain creeps. The characters in this film are quite memorable and they themselves boost the film. The acting in the film is just sensational, the directing and pacing is just brilliant and there really wasn't a slow part of the film. All characters were enjoyable and so, the film seemed more enjoyable. Kevin Spacey did a fantastic job at playing John Doe. The first time we see John Doe as he shoots the detectives, we don't believe him as such a threat but later on in the film, as he reveals himself to the detectives, we understand the mastermind he really is. This character, more and more, reminds me of Hannibal Lecter. The ending contains such a brilliant turn of events that the film itself becomes better.****SPOILER****When Somerset warns Mills not to shoot John Doe due to his outrage at John killing his wife due to the sin 'Envy' and Mills himself finishes John's mastermind, and therefore John wins, as Mills commits the seventh and final sin, Wrath at losing his beloved. ***END OF SPOILER***Therefore, comes the end of my review to one of the greatest movies ever made...PERIOD!"
    },
    {
      "username": "dommercaldi",
      "userUrl": "https://www.imdb.com/user/ur96338646",
      "reviewLink": "https://www.imdb.com/review/rw6023917",
      "warningSpoilers": false,
      "date": "24 August 2020",
      "rate": "9",
      "helpful": "16 out of 18 found this helpful.",
      "title": "David Fincher Strikes Again, With An Unwavering Thriller That Strikes Straight To The Heart",
      "content": "Pros: 1. The score is beautifully ominous which only deepens the thrilling and unsettling atmosphere. 2. Brad Pitt (Mills), Morgan Freeman (Somerset), and Kevin Spacey (John Doe) give amazing performances. 3. The colour palette being dark and monotone helps to cement the gloomy and grim tone. 4. The gore and practical effects are immense and they still stand up 25 years later. The sloth, lust, and gluttony murders, in particular, stick in mind. 5. The great cinematography knows when to pull the camera back, as well as to draw it close for great effect. 6. Both Morgan Freeman and Brad Pitt have great chemistry together. 7. The back-and-forth between Somerset, Mills, and John Doe in the police car is one of the most intense and captivating scenes in the history of cinema. 8. The movie presents the interesting and complex moral quandary of: is it immoral to kill the immoral? Even if those immoral people adversely affect other people? And who gets to decide who is immoral, and what punishment should be meted out to them? 9. Despite the underdeveloped character of Tracy (Gwyneth Paltrow), the conclusion is still one of the hardest hitting and iconic endings ever created.Cons: 1. Tracy is a severely underdeveloped character, with her pregnancy-confessing scene to Somerset feeling lazily forced to add weight to the final scene."
    },
    {
      "username": "Howlin Wolf",
      "userUrl": "https://www.imdb.com/user/ur1046557",
      "reviewLink": "https://www.imdb.com/review/rw1800068",
      "warningSpoilers": true,
      "date": "14 January 2008",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Se7en gruesome chapters of a killer's manifesto...",
      "content": "\"Se7en\" is unique because of the extraordinary sympathy it manages to foster for its two main characters; it's unique because of its bleak, hopeless environment that serves as a symptom of civilization's general decline. It's strengthened by its brilliant performances capturing mostly decent people struggling to survive in the sewer without becoming tainted by it. The fictional John Doe would most likely agree with all these theoretical snapshots of despair - the difference comes in his psychopathic desire to come up with a plan that he thinks will solve it.Few forms of popular entertainment manage to afford the villain his say whilst still maintaining a sensible distance from his horrific acts. What I like best is the film's depressing contention that there isn't as much distinction as we think between the good guys and the bad guys. We're all affected by the distasteful aspects of society, but do we just hope that our own positive contributions will be enough to offset them - or in extreme situations, when we stare into the abyss, will the abyss stare back at us? Some may well be upset that the killer's justification contains reasoned objections. It is really only by resorting to crime that he reveals himself as a madman. Rather than be outraged, though, I prefer to celebrate good writing that allows us to see hidden facets of an issue, however unpalatable the resultant consequences of such a viewpoint may turn out to be."
    },
    {
      "username": "Twins65",
      "userUrl": "https://www.imdb.com/user/ur1773017",
      "reviewLink": "https://www.imdb.com/review/rw3661272",
      "warningSpoilers": true,
      "date": "13 March 2017",
      "rate": "9",
      "helpful": "8 out of 8 found this helpful.",
      "title": "20+ years later, I watched it again",
      "content": "...and it was STILL STELLAR! Fincher's mid-90's crime drama SE7EN got a whole bunch of hype when it first came out, and deservedly so. Pitt was still on the upswing of his career, \"Gwyn\" was still not yet a household name (which was a good thing for this role), and of course Freeman was at the top of his game (see SHAWSHANK, UNFORGIVEN, OUTBREAK, etc.) once again playing the voice of reason to perfection. And throw in Spacey, who was still in the last stages of being a THAT GUY (albeit, one of the very best THAT GUYS-- he would pick up a Supporting Actor Oscar the next year for THE USUAL SUSPECTS), and you've got one helluva cast.But it wouldn't have all mattered if the story wasn't any good, and this one, written by Andrew Kevin Walker, is top notch. I guess my only real beef is that we wait too long until we actually get involved visually with Spacey's John Doe. But once he shows, the movie is even more riveting down the stretch. The chase scene and then finally the car ride scene are tremendous, as is the final showdown which I won't spoil here but I think every movie buff is familiar with by now.WATCH IT AGAIN WHEN YOU CAN!"
    },
    {
      "username": "namashi_1",
      "userUrl": "https://www.imdb.com/user/ur8503729",
      "reviewLink": "https://www.imdb.com/review/rw3322662",
      "warningSpoilers": false,
      "date": "24 September 2015",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Fincher At His Finest!",
      "content": "David Fincher has made remarkable films throughout his career, but 'Se7en' finds him at his FINEST! This neo-noir psychological-thriller, is an astonishing piece of Cinema. I was mesmerized. 'Se7en' Synopsis: Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his modus operandi.'Se7en' is a Masterstroke from start to end. A dark, moody, violent & utterly gripping story, that keeps you at the edge-of-your-seat. There isn't a single dull moment in this blockbuster, in fact, the tale gets more & more intriguing as it progresses.Andrew Kevin Walker's Screenplay is Ace. It's a spine-chilling tale about two heroes out to get a psychotic killer. The Writing grips you from the moment it begins & refuses to let you go. Fincher's Direction is incredible. The way he has handled this twisted story, deserves an ovation. Darius Khondji's Cinematography is flawlessly done. Richard Francis-Bruce's Editing is tight. Action-Sequences are mind-blowing. Howard Shore's Score is perfect.Performance-Wise: Morgan Freeman is at his understated best. The Oscar-Winning Legend delivers a master-class act here, that ranks amongst his finest to date. Brad Pitt is in terrific form, adding depth & anger to his part. Kevin Spacey is loathsome to the core in his creepy portrayal of the wicked villain. Gwyneth Paltrow is wonderful in a brief, yet important role. On the whole, 'Se7en' is a film to die for. Two Big Thumbs Up!"
    },
    {
      "username": "Sergeant_Tibbs",
      "userUrl": "https://www.imdb.com/user/ur11148131",
      "reviewLink": "https://www.imdb.com/review/rw1615104",
      "warningSpoilers": true,
      "date": "10 March 2007",
      "rate": "10",
      "helpful": "48 out of 68 found this helpful.",
      "title": "One Of The Greatest Thrillers Of All-Time",
      "content": "In 1995 David Fincher released a perfectly constructed modern masterpiece; Se7en. One of the most exhilarating experiences of all-time and a classic to come.A cop; Detective David Mills (Brad Pitt) has just moved into the city with his wife, Tracy (Gwyneth Paltrow) in hope of finally settling down. Mills will take over the job of Detective Lt. William Somerset (Morgan Freeman) an old cop who has seven days until his retirement begins. Both are dedicated to the badge. They are put together on the case of an obesity murder, in which a man has been forced to 'eat till he bursts'. This then leads to another murder scene in which a lawyer has bled to death, although the murderer didn't actually use the knife; he made the lawyer do it. This is just the beginning of a mass murder masterpiece crafted by the insane John Doe, brilliantly played by Kevin Spacey.Whatever you do while watching it, do not see it as hollow. Se7en is far from it. Many scenes study civilisation; present civilisation. And its evil. Our society isn't a pleasant one. The film concentrates mainly on the cops search; when it comes to the mystery part in finding the killer, we discover the policemen's differences in methods, and how the most obvious one does not actually work. Of course, its Somerset, the one with the most experience who has the best way. He tries to find out why. Why some man is killing these people using a specific punishment. While Mills tries, unsuccessfully, to find out how; by studying the crime scene for clues. He ends up bored. With the help of the library, Somerset gets closer to the murderer. It may seem as though the role of Tracey is a pointless part, but she is more important than anything. She is the one who brings the men to being more personal with each other. Notice how in the dinner scene she is the one to introduce them by name. All making the climax tense and difficult.Mills is the kind of guy to pull his gun out before his torch. He has an arrogant sense of things though is 'by the book' and works. Somerset has never even fired his weapon. He sees the evil round him. And he wants to leave it. Though he is a cop so he has the permission to do something about it. But the problem is, he isn't doing anything about it. John Doe is. The reason why society is evil is because we are allowed to sin. There is now nothing stopping us. It has become a common factor of life. And there should be. That is why John Doe thinks his behaviour is OK. But the problem is he is being stopped instead of the crime out there. This is the harsh reality we live in.There are seven deadly sins. Gluttony. Greed. Sloth. Pride. Lust. Envy. Wrath. And seven ways to die.Kevin Spacey is amazing as John Doe, portraying insanity perfectly. One of the greatest supporting performances of all-time already. And he's only in it for half an hour. Brad Pitt delivers a kind of forced performance which adds to the Hollywood effect of the film though I couldn't imagine anyone else for the part. Morgan Freeman played his role with the greatest concentration. Throughout he needed a look of woe on his face. And he did just that.The writing is extraordinary. The genius, Andrew Kevin Walker took an interesting subject and created an instant classic. But most credit has to go to Fincher. Who took aspects you wouldn't even think of looking at and filming it. Together they project a deep film on our screens that no-one should miss. In one scene near the end, he makes it so when a word is spoken we cut to a character as that gives us clues to their fate. A feast for the brain. One of the most imaginative scripts of the 90s. Fincher also knows exactly how to shoot the film. Whether it be steady-cam for the slow and easy parts or the hand-held camera for the adrenalin pumping scenes.The cinematography is what makes this an excellent movie. Everything is dark. The world out there is rough, raw, grim and gritty. It does just that. The effect it makes is astounding and truly works. The sinister music that is added keeps the heart pounding throughout and keeps the audience uncomfortable, in a good way. As that's what the film tries to achieve. The opening credits are upon the greatest segment of film I have ever seen. The jumpiness makes you feel uneasy yet intrigued to keep watching. Every scene, due to the effort put in it, is masterful and is what makes the film a joy to watch and observe.Se7en reveals the best glimpse we have seen of the disturbing underworld. One of my favourites and always will be.10/10"
    },
    {
      "username": "ackstasis",
      "userUrl": "https://www.imdb.com/user/ur10334028",
      "reviewLink": "https://www.imdb.com/review/rw1730174",
      "warningSpoilers": true,
      "date": "15 September 2007",
      "rate": "9",
      "helpful": "24 out of 32 found this helpful.",
      "title": "\"This isn't going to have a happy ending.\"",
      "content": "After years of experiencing dull, formulaic, clichèd so-called thrillers, it's always satisfying when a genuinely great movie comes along. I have absolutely no hesitation in proclaiming 'Se7en' to be such a film, with director David Fincher  after achieving a somewhat mixed result in his cinematic debut, 'Alien³'  firmly proclaiming his place as one of the 1990's most promising new talents. It's somewhat surprising that the movie had managed to elude me for so long, since I'd been wanting to see it for a while, and it was only last week that I managed to get my hands on a DVD copy. And so, without further ado, I invited over a friend, who has an equal partiality towards good thrillers, and enthusiastically promised him one of the best of its decade. 'Se7en' didn't disappoint.The film takes place in a dark, gritty, unnamed metropolis, where it is always raining and danger looms ominously from every alleyway. Reserved and hardened Detective Lt. William Somerset (Morgan Freeman) has seen it all in his lifetime, and is finally preparing to retire to the country, away from the madness of the city. His replacement, impulsive Detective David Mills (Brad Pitt), has transferred here at his own request, and is eager to make his mark, even though his career choice could be harming the wellbeing of his lonely and vulnerable wife, Tracy (Gwyneth Paltrow). Both detectives are soon drawn into the case of a serial killer, John Doe, who is ritualistically murdering his victims according to the Seven Deadly Sins: gluttony, greed, sloth, lust, pride, envy and wrath. As the murders begin piling up, the two detectives' investigation becomes an obsession, and the inevitable outcome will drastically change the lives of both. Throughout the film, Brad Pitt provides most of the comic relief, none of which detracts at all from the horrors we are witnessing on screen.David Fincher has a unique visual style that is simply thrilling to watch. Despite the thematically dark tone of the story, the film itself is positively brimming with invigorating and vibrantly-contrasted colour and lighting. The graphic murder scenes appear to splash out of the screen, before our very eyes, enhancing the feelings of dread and repulsion that accompany John Doe's horrific acts of murder. The rich, highly-stylised use of colour also helps create a memorable atmosphere of sheer foreboding; the imagery is sure to stay with you for many years to come. Even as 'Se7en' abandons the gritty setting of the city for the final act  shifting the action to a starkly-lit open field beside a trail of electric power-lines  the film loses none of its potency, the isolation of the climactic arena seemingly leaving our main protagonists even more helpless and vulnerable than before.Our villain is anonymously titled John Doe, and is played with delightful creepiness by Kevin Spacey, who only agreed to the part under the condition that he remain unbilled in the promotion and opening credits of the film. Unlike your typical serial killer, John Doe is not a crazy, impulsive and stupid mad-man, but something rather more terrifying: he is intelligent, patient and methodical. In one particularly ghastly crime, he keeps a convicted drug dealer chained to his bed for an entire year, removing his hands and his tongue, and regularly paying his rent so as to not arouse any suspicions. John Doe's entire life has been dedicated to Mankind's obsession with committing sin, and, through orchestrating his crimes, he wishes to preach to the society of their transgressions. John Doe, rather uniquely, is given a large portion of the film's final half-hour, and so he becomes a character that we come to know very well, as opposed to the half-constructed serial killers who usually turn up in the final five minutes only to be shot by the hero. Spacey is very good in the role, though I can't help but feel that his performance would have been even more effective had I not been familiar with much of his later film work.The most exciting scene in the film is undoubtedly the hectic foot-chase that ensues when John Doe arrives home to his apartment, only to find Detectives Somerset and Mills waiting patiently outside his door. However, the film's climax is also well worth mentioning: though many interpretations have been floating around, my view is that the final two victims are John Doe himself (\"Envy\") and David Mills (\"Wrath\"). In order to prevent himself from being labeled a hypocrite, as Mills had suggested during the car-ride, Doe allowed his own deadly sin - envy - to result in the death of Tracy, and so enticed Mills to shoot him, simultaneously becoming the sixth victim and prompting Mills to commit the seventh sin. Some have argued that, since Mills didn't die, he can't be perceived as one of Doe's victims, but is being left alive in these circumstances perhaps even a more diabolical punishment?"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3239081",
      "warningSpoilers": false,
      "date": "15 May 2015",
      "rate": "9",
      "helpful": "12 out of 15 found this helpful.",
      "title": "beautiful darkness",
      "content": "Somerset (Morgan Freeman) is a wearied homicide detective. Mills (Brad Pitt) worked hard to transfer to the troubled precinct. He's married to Tracy (Gwyneth Paltrow). There is a serial killer on the loose delivering his sermon on the Seven Deadly Sins. Somerset is tired of the city. Mills is eager to investigate.Director David Fincher has filled with beautiful darkness. It's more than just the gruesome murders. It's the rain, the music score and the grungy setting. Fincher has weaved together an artistic masterpiece. Freeman is the perfect grizzled veteran. Brad Pitt is a terrific eager newcomer. There are surprising comedy sprinkled in. The final twist is simply cinematic history. The big line is awesome. Pitt delivers it perfectly with so much heart aching pleading. Some do deride its grotesque gloom but that's like complaining about a movie being too funny or too exciting. This is suppose to be dark and it achieves it."
    },
    {
      "username": "sandnair87",
      "userUrl": "https://www.imdb.com/user/ur19892172",
      "reviewLink": "https://www.imdb.com/review/rw3207579",
      "warningSpoilers": false,
      "date": "24 March 2015",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Se7en is a Sinfully Enthralling Thriller!",
      "content": "Se7en is a nerve-jangling thriller, hauntingly shot by visionary director David Fincher, who crafts one of the most iconic films of all time.Se7en tells the tale of a grisly serial killer who is twisted on delivering a sermon against modern depravity. He murders his victims to atone for the sins he deems them to have committed; his crimes echo the seven deadly sins namely gluttony, greed, sloth, envy, pride, wrath and lust. Tracking this gruesome killer (played with a quiet insanity that makes your flesh crawl, by an actor par excellence – no spoilers here!) is a cliché pair of cops. There's the jaded veteran Detective Lieutenant Somerset (Morgan Freeman who brings great depth and dignity to the part) who is in the last week of his employ with the police department. Partnering him is a young, eager-to-kick-some-evil-butt cop Detective Mills (Brad Pitt whose callowness works perfectly for his character). After killing an overweight man by force-feeding him to death in the name of gluttony and bleeding to death a lawyer for greed, the anonymous killer is now turning his attention to the five remaining deadly sins. As the two men investigate, the gulf between their respective world-views begins to inform everything about how they respond to the savagery of these crimes.It is impossible to deny the potency and artistry with which Fincher executes the material. Although very little of each murder is shown, the director expertly allows suggestion to lead the appalled viewer towards the truly cataclysmic climax. Fincher's sepia-toned gloom successfully lends the film the knock-out punch it intends to. Purposely draining his landscapes of color, and setting all the tense action against rain-washed streets and under-lit interiors, Fincher evokes an atmosphere of nightmarish proportions as he unfolds a gripping tale of urban horror. Se7en is riveting in a gut-twisting way. It plays out at an engaging pace destined to entrance you with its abject horror. The film is as dark and brutal as a film can be, without showing much actual violence. Most of the stuff in the film is implied, but it's so damn disturbing that you feel like you actually saw it. And that is the beauty of Se7en!"
    },
    {
      "username": "Insipid_Shell",
      "userUrl": "https://www.imdb.com/user/ur1669095",
      "reviewLink": "https://www.imdb.com/review/rw0370669",
      "warningSpoilers": false,
      "date": "25 March 2002",
      "rate": "10",
      "helpful": "737 out of 832 found this helpful.",
      "title": "\"Se7en is well crafted and ingeniously clever, making it one of the greatest films of the 90's\"",
      "content": "The movie, \"Se7en\", starring Brad Pitt, Morgan Freeman, and Gwyneth Paltrow, is by far one of the most inventive, well-written, and cerebral films in recent history. The film, blending a well put together combination of dark visual style, intense plot development, and polished acting, remains tight and focused throughout, from beginning to end, never straying outwards into unimportant issues, or resorting to typical Hollywood clichés. Se7en is uniquely on its own for suspense dramas as it both fuels the need of the audience to be drawn in and entertained by the events unfolding, and remain uncompromising and shocking, thus satisfying the initial vision of the director, David Fincher.The story surrounds the hunt for a serial killer, who, inspired by Dante Alighieri's seven deadly sins from \"The Divine Comedy\", sets out to, \"preach\" about man's impurity, and does so by targeting victims, then torturing them by pitting their own underlining sins against them. Se7en seemingly starts out as a typical cat and mouse detective story, however, it quickly develops into of a sort of modern-myth, with good and evil taking centre stage. The story is original on all counts, and thrilling on all levels. The most important aspect of Se7en, however, is that it keeps the audience numerous steps behind its story, as oppose to other thrillers, which become predictable and bland by the end. By keeping the audience in the dark, the film remains fresh and original as it progresses. Se7en even dramatically turns the tide at one point, just as the audience is finally getting comfortable and asserted into the gloomy atmosphere, thus creating as much as fear and uncertainty in the audience as it is with the characters involved. By the film's conclusion, the audience is as much apart of the film as the characters themselves, and arrive at Se7en's surprise ending without a single clue of it, prior to it occurring. Se7en's poetic ending(which will not be given away) says a lot for the people behind the movie, showing they are not afraid of going against the grain. A rarity with films so nowadays.Directed brilliantly by David Fincher, and skillfully written by Andrew Kevin Walker, Se7en is well crafted and ingeniously clever, making it one of the greatest films of the 90's. While Se7en may not have garnered critical acclaim as such films as Silence of the Lambs, Se7en is, undoubtedly, as influential as any film to date.Score 10/10"
    },
    {
      "username": "Screen_Blitz",
      "userUrl": "https://www.imdb.com/user/ur24623283",
      "reviewLink": "https://www.imdb.com/review/rw3358468",
      "warningSpoilers": false,
      "date": "20 November 2015",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Dark, grisly, and highly intelligent edge-of-your-seat thriller",
      "content": "David Fincher has been one of most thoughtful directors in Hollywood for many years, and his ingenious filmmaking all started in the mid- 1990s with this grim, but intelligently crafted psychological thriller. This film follows David Mills (played by Brad Pitt), a newly transferred police detective in an unnamed crime-ridden metropolitan city, who is partner with an old veteran detective William Somerset (played by Morgan Freeman) who is on the verge of retirement, to investigate a string of gruesome murders all around the city. These murders happen to correlate with the seven deadly sins which include: gluttony, greed, sloth, lust, pride, envy, and wrath. Mills and Somerset take in matters in their own hands to hunt down the sadistic serial killer (played by an actor who I'm gonna keep a secret) responsible for the grisly murders, only to be faced with a scarring truth about his intentions.This David Fincher masterpiece is not a horror film, but it certainly sits directly at the borderline of one. Complete with eerie visuals and near non-stop suspense from start to finish, this film pulls audience into an unflinchingly grim atmosphere that leaves shivers down their spine and rarely lightens up. To add more to the dark tone, it rain in nearly every scene taking place outside to give them a more somber look. As the plot progresses, the audience are treated with nauseating afterviews of the serial killer's murder. But instead of having the camera linger over the gory details of the victims, we are giving heavy implications of how they particularly occurred. These scenes do just enough without the suspenseful music score to leave viewers at the edge of their seats. Then there is the serial killer himself who is portrayed as very sadistic, almost Lecter Hannibul-like, and creepy in appearance. His way of outwitting the main characters are quite shocking. The actor who plays him does an incredible job on his portrayal. As the story continues on, it builds up to one of the most haunting conclusions ever put to film, an ending that really pushes the boundaries. Ultimately, it works pretty well.Se7en is one of the well-crafted and twisted thrillers I've ever seen and one of the spine-chilling films Hollywood has to offer, thanks to the incredible camera-work, brilliant direction by David Fincher and fantastic script by Andrew Kevin Walker. Brad Pitt and Morgan Freeman who play the main characters show amazing chemistry on screen together and their performances work pretty well. While the film is really great, it is definitely not recommended for the faint of heart."
    }
  ],
  "errorMessage": ""
}