{
  "imDbId": "tt0114369",
  "title": "Se7en",
  "fullTitle": "Se7en (1995)",
  "type": "Movie",
  "year": "1995",
  "language": "en",
  "titleInLanguage": "Seven (1995 film)",
  "url": "https://en.wikipedia.org/wiki/Seven_(1995_film)",
  "plotShort": {
    "plainText": "Seven (stylized as Se7en) is a 1995 American crime thriller film directed by David Fincher and written by Andrew Kevin Walker. It stars Brad Pitt, Morgan Freeman, Gwyneth Paltrow, and John C. McGinley. Set in an unnamed, crime-ridden city, Seven's plot follows disenchanted, near-retirement detective William Somerset (Freeman) and his newly transferred partner David Mills (Pitt) as they attempt to stop a serial killer before he can complete a series of murders based on the seven deadly sins.\r\nWalker, an aspiring writer, based Seven on his experiences of moving from a suburban setting to New York City during a period of rising crime and drug addiction in the late 1980s. His script was optioned by an Italian film company that underwent financial difficulties and sold the rights to New Line Cinema. Executives were opposed to the script's bleak ending and mandated a more-mainstream, upbeat outcome. Fincher, who was eager to prove himself after the failure of his first feature-film project Alien 3, read Walker's original script—which he was sent by mistake—and agreed to direct the project provided the ending remained. The studio continued trying to change the ending but faced opposition from Fincher and the cast. On a $33–$34 million budget, principal photography took place mainly on location in Los Angeles. Rob Bottin headed the special effects team responsible for realizing the elaborate murders using makeup and prosthetics.\r\nSeven received middling test audience results; it was not expected to perform well due to its violent and mature content but it earned $327.3 million worldwide, becoming a surprise success and one of the highest-grossing films of the year. Contemporaneous reviews were mixed; critics praised Freeman's performance but criticized the film's dark cinematography, explicit and implied violence, and bleak ending. Seven revitalized Fincher's career and helped Pitt move from roles based on his appearance to more serious, dramatic roles.\r\nIn the years since its release, consensus on the movie has shifted; Seven is now regarded as one of the best thriller, crime, and mystery films ever made. It remains influential in filmmaking, inspiring many imitators of its aesthetic, style, and premise of detectives investigating serial killers with distinctive methods and motives. The film's title sequence, which depicts the killer preparing for his actions later in the film, is considered an important design innovation and has also influenced later credit sequences, while the film's twist ending has been named as one of the best in cinematic history.",
    "html": "<p>Seven (stylized as Se7en) is a 1995 American crime thriller film directed by David Fincher and written by Andrew Kevin Walker. It stars Brad Pitt, Morgan Freeman, Gwyneth Paltrow, and John C. McGinley. Set in an unnamed, crime-ridden city, Seven's plot follows disenchanted, near-retirement detective William Somerset (Freeman) and his newly transferred partner David Mills (Pitt) as they attempt to stop a serial killer before he can complete a series of murders based on the seven deadly sins.</p><p>Walker, an aspiring writer, based Seven on his experiences of moving from a suburban setting to New York City during a period of rising crime and drug addiction in the late 1980s. His script was optioned by an Italian film company that underwent financial difficulties and sold the rights to New Line Cinema. Executives were opposed to the script's bleak ending and mandated a more-mainstream, upbeat outcome. Fincher, who was eager to prove himself after the failure of his first feature-film project Alien 3, read Walker's original script—which he was sent by mistake—and agreed to direct the project provided the ending remained. The studio continued trying to change the ending but faced opposition from Fincher and the cast. On a $33–$34 million budget, principal photography took place mainly on location in Los Angeles. Rob Bottin headed the special effects team responsible for realizing the elaborate murders using makeup and prosthetics.</p><p>Seven received middling test audience results; it was not expected to perform well due to its violent and mature content but it earned $327.3 million worldwide, becoming a surprise success and one of the highest-grossing films of the year. Contemporaneous reviews were mixed; critics praised Freeman's performance but criticized the film's dark cinematography, explicit and implied violence, and bleak ending. Seven revitalized Fincher's career and helped Pitt move from roles based on his appearance to more serious, dramatic roles.</p><p>In the years since its release, consensus on the movie has shifted; Seven is now regarded as one of the best thriller, crime, and mystery films ever made. It remains influential in filmmaking, inspiring many imitators of its aesthetic, style, and premise of detectives investigating serial killers with distinctive methods and motives. The film's title sequence, which depicts the killer preparing for his actions later in the film, is considered an important design innovation and has also influenced later credit sequences, while the film's twist ending has been named as one of the best in cinematic history.</p>"
  },
  "plotFull": {
    "plainText": "Seven (stylized as Se7en) is a 1995 American crime thriller film directed by David Fincher and written by Andrew Kevin Walker. It stars Brad Pitt, Morgan Freeman, Gwyneth Paltrow, and John C. McGinley. Set in an unnamed, crime-ridden city, Seven's plot follows disenchanted, near-retirement detective William Somerset (Freeman) and his newly transferred partner David Mills (Pitt) as they attempt to stop a serial killer before he can complete a series of murders based on the seven deadly sins.\r\nWalker, an aspiring writer, based Seven on his experiences of moving from a suburban setting to New York City during a period of rising crime and drug addiction in the late 1980s. His script was optioned by an Italian film company that underwent financial difficulties and sold the rights to New Line Cinema. Executives were opposed to the script's bleak ending and mandated a more-mainstream, upbeat outcome. Fincher, who was eager to prove himself after the failure of his first feature-film project Alien 3, read Walker's original script—which he was sent by mistake—and agreed to direct the project provided the ending remained. The studio continued trying to change the ending but faced opposition from Fincher and the cast. On a $33–$34 million budget, principal photography took place mainly on location in Los Angeles. Rob Bottin headed the special effects team responsible for realizing the elaborate murders using makeup and prosthetics.\r\nSeven received middling test audience results; it was not expected to perform well due to its violent and mature content but it earned $327.3 million worldwide, becoming a surprise success and one of the highest-grossing films of the year. Contemporaneous reviews were mixed; critics praised Freeman's performance but criticized the film's dark cinematography, explicit and implied violence, and bleak ending. Seven revitalized Fincher's career and helped Pitt move from roles based on his appearance to more serious, dramatic roles.\r\nIn the years since its release, consensus on the movie has shifted; Seven is now regarded as one of the best thriller, crime, and mystery films ever made. It remains influential in filmmaking, inspiring many imitators of its aesthetic, style, and premise of detectives investigating serial killers with distinctive methods and motives. The film's title sequence, which depicts the killer preparing for his actions later in the film, is considered an important design innovation and has also influenced later credit sequences, while the film's twist ending has been named as one of the best in cinematic history.\r\nPlot\r\nIn an unnamed city overcome with violent crime and corruption, disillusioned police detective William Somerset is one week from retirement. He is partnered with David Mills, a short-tempered, idealistic detective who recently relocated to the city with his wife, Tracy. One Monday, Somerset and Mills investigate an obese man who was forced to eat until his stomach burst, killing him. The detectives find the word \"gluttony\" written on a wall. Somerset, considering the case too extreme for his last investigation, asks to be reassigned to another case but his request is refused. The following day, another victim, who had been forced to cut one pound (0.45 kg) of flesh from his body is found; the crime scene is marked \"greed\". Clues at the scene lead Somerset and Mills to the sloth victim, a drug-dealing pederast who they find emaciated and restrained to a bed. Photographs reveal the victim was restrained for exactly one year. Somerset surmises the murders are based on the biblical concept of the seven deadly sins.\r\nTracy invites Somerset to share supper with her and Mills, helping the detectives overcome their mutual hostility. On Friday, Tracy meets privately with Somerset because she has no other acquaintances in the city. She reveals her unhappiness at moving there, especially after learning she is pregnant, and believes the city is an unfit place to raise a child. Somerset sympathizes with Tracy, having persuaded his former girlfriend to abort their child for similar reasons and regretting it ever since; he advises Tracy to inform Mills only if she intends to keep the child.\r\nA comment by Mills inspires Somerset to research libraries for anyone checking out books based on the seven deadly sins, leading the pair to the apartment of John Doe. Doe unexpectedly returns home and is pursued by Mills, who is incapacitated after Doe strikes him with a tire iron. Doe momentarily holds Mills at gunpoint but soon flees. The police investigate Doe's apartment, finding a large amount of cash, hundreds of notebooks revealing Doe's psychopathy, and photographs of some of his victims; the cache includes images of Somerset and Mills by a person they believed was an intrusive journalist at the sloth crime scene. Doe calls the apartment and speaks of his admiration for Mills.\r\nOn Saturday, Somerset and Mills investigate the fourth victim, lust, a prostitute who has been raped with a custom-made, bladed strap-on by a man held at gunpoint. The following day, the pride victim is found; she is a model whom Doe facially disfigured and died by suicide rather than live without her beauty. As Somerset and Mills return to the police station, Doe arrives and surrenders himself. He threatens to plead insanity at his trial, potentially escaping punishment, unless Mills and Somerset escort him to an undisclosed location where they will find the envy and wrath victims. During the drive, Doe says he believes God has chosen him to send a message about the ubiquity of, and apathy toward, sin. Doe has no remorse for his victims, believing the shocking murders will force society to pay him attention.\r\nDoe leads the detectives to a remote location, where a delivery van approaches. Somerset intercepts the vehicle, whose driver was instructed to deliver to Mills a package at this specific time. Somerset is horrified at the package's contents and tells Mills to put down his gun. Doe reveals he himself represents envy because he envied Mills' life with Tracy, and implies the package contains her severed head. He urges Mills to become wrath, telling him Tracy begged for her life and that of her unborn child, and takes pleasure in realizing Mills was unaware of the pregnancy. Despite Somerset's pleas, Mills, distraught and enraged, shoots Doe dead, completing Doe's plan. Police remove the catatonic Mills, and Somerset tells his captain he will \"be around\". Somerset says in voiceover: \"Ernest Hemingway once wrote: 'The world is a fine place, and worth fighting for'. I agree with the second part\".\r\nCast\r\nBrad Pitt as David Mills: A well-meaning but impulsive homicide detective\r\nMorgan Freeman as William Somerset: A veteran police officer disillusioned with his job\r\nGwyneth Paltrow as Tracy Mills: Detective Mills' pregnant wife\r\nR. Lee Ermey as Police Captain: The detectives' grizzled superior\r\nJohn C. McGinley as California: A SWAT team leader\r\nKevin Spacey as John Doe: A serial killer inspired by the seven deadly sins\r\nRichard Roundtree as Martin Talbot: The district attorney\r\nSeven also features Julie Araskog as Mrs. Gould, John Cassini as Officer Davis, Reg E. Cathey as Doctor Santiago, Peter Crombie as Doctor O'Neil, Richard Portnow as Doctor Beardsley, Richard Schiff as Mark Swarr, and Mark Boone Junior as a \"greasy FBI man\". Hawthorne James appears as George the library night guard, Michael Massee portrays \"man in massage parlor booth\", Leland Orser plays \"crazed man in massage parlor\", Pamala Tyson portrays a thin vagrant outside Doe's apartment, and Doe's delivery man is played by Richmond Arquette.\r\nDoe's victims include: Bob Mack as gluttony, a morbidly obese man who is force-fed until his stomach bursts; Gene Borkan as greed, a criminal attorney who is forced to cut off his own flesh; and Michael Reid MacKay as the sloth victim Theodore \"Victor\" Allen, a drug dealer and child abuser. Cat Mueller portrays the lust victim, a sex worker who is impaled with a bladed sex toy, and Heidi Schanz appears as model Rachel Slade, pride, who Doe disfigures. Writer Andrew Kevin Walker makes a cameo appearance as a corpse Somerset investigates during the film's opening scene; Morgan Freeman's son Alfonso appears as a fingerprint technician; and columnist George Christy portrays the police department janitor scraping Somerset's name from his door.\r\nProduction\r\nWriting\r\nIn 1986, aspiring screenwriter Andrew Kevin Walker moved from the suburbs of Pennsylvania to New York City, and described the \"culture shock\" of living in a city undergoing significant rises in crime and drug abuse. While working as a sales assistant for Tower Records in 1991, Walker began writing a spec script called Seven, which is set in an unnamed, bleak and gloomy city that was inspired by his \"depressing\" time in New York. Walker said; \"it's true that if I hadn't lived there I probably wouldn't have written Seven ... I think it's that way for anything—the right time and the right mood, and the right inspiration, whatever inspiration is. That's what's so scary about writing\". Film studios were eager for high concept spec scripts; Walker believed his thriller about police officers pursuing a serial killer driven by the seven deadly sins would attract attention and help begin a professional writing career.\r\nWalker intended to leave the script's narrative open to interpretation to avoid invalidating the opinions of the prospective audience. He wanted to defy audience expectations, and leave them feeling \"violated and exhausted\" by the conclusion. According to Walker, \"there's lots of evil out there, and you're not always going to get the satisfaction of having any sort of understanding of why that is. That's one of the things that scares people the most about serial killers\". For inspiration for writing the killer, Walker recounted his own experiences of walking down city streets, and observing crimes and sins being openly committed on every corner, and asking what would happen if someone specifically focused on these sins. He had Doe surrender himself to the police because it would rob the audience and characters of the anticipated satisfaction, and make them uncomfortable before the finale.\r\nIn the early 1990s, Italian company Penta Film, under manager Phyllis Carlyle, optioned the script. Walker was paid the minimum fee allowed by the Writers Guild of America, which he described as not being \"fuck you money\" but enough to quit his job, relocate to Los Angeles, and work on Seven.\r\nDevelopment\r\nTo lead the project, Penta Film hired director Jeremiah S. Chechik, who had recently directed the successful comedy film National Lampoon's Christmas Vacation (1989) and was looking for a more serious project. Chechik and Penta Film mandated several script changes, including the removal of the bleak \"head-in-the-box\" ending, in which Tracy's severed head is delivered in a box. Given the option to refuse the requests and risk being replaced or the project canceled, Walker acquiesced and wrote a more-mainstream ending in which the detectives confront Doe in a church that is described as either on fire or burned out. In the revised version of the script, Doe embodies the sin of envy and kills Mills before being shot dead by Somerset, while a pregnant Tracy leaves the city. In a 2017 interview, Walker said he felt he was ruining his script and should have left the project. In total, he wrote thirteen drafts to meet the studio's demands. The project failed to progress; because the option was expiring and Penta Film was experiencing financial difficulties—eventually dissolving in 1994—the studio sold the rights to producer Arnold Kopelson, who took it to New Line Cinema. Chechik also left the project, and Guillermo del Toro and Phil Joanou were approached to replace him; Joanou rejected the offer because he found the story too bleak.\r\nDavid Fincher was mainly known for directing popular music videos, such as \"Vogue\" and \"Who Is It\". His only feature film, Alien 3 (1992), had been a negative experience and the film was edited by its studio against Fincher's intent. Fincher disowned the film, saying \"I'd rather die of colon cancer than make another movie\". His agent, however, brought him the Seven script. Fincher was uninterested in the police procedural aspects but found himself drawn in by the gradual revelation of Doe's plans, saying; \"I found myself getting more and more trapped in this kind of evil ... and even though I felt uncomfortable about being there, I had to keep going.\" He determined the script matched his own creative sensibilities, particularly its \"meditation on evil and how evil gets on you and you can't get it off\", and uncompromising ending in which \" been dead for hours and there's no bullshit chase across town and the guy driving on sidewalks to get to the woman, who's drawing a bath while the serial killer sneaks in the back window\". Fincher expressed his interest to the studio, which realized he had been sent Walker's original script. New Line Cinema sent Fincher an up-to-date draft in which Tracy survives but Walker would only agree to direct the original script. He met with New Line Cinema's president of production Michael De Luca, who also preferred the original script, and they agreed to start filming that version in six weeks, believing further delay risked executives noticing and interfering with their plan.\r\nKopelson and studio executives made efforts to lighten Seven's tone and change the ending. Fincher was resistant to any changes, and was unwilling to compromise his creative control and vision. De Luca remained supportive of Fincher, and the original ending gained further backing as the project secured prominent actors, including Freeman, Pitt, and Spacey. Pitt said he joined Seven on condition the head-in-the-box ending was retained, and that Mills \" the killer in the end. He doesn't do the 'right' thing, he does the thing of passion.\" Pitt was upset the original ending to his previous film Legends of the Fall (1994) had been cut in response to negative test-audience responses. Kopelson was persuaded to support Fincher after being reassured the severed head would not be shown, saying \"it needed this horrendous event to kick off the last sin, wrath\" that would be discussed for decades. Walker said; \"there's nothing wrong with endings, it's just that the dark ending of Seven was what it was about. To change the ending to something else was to remove the very heart of the story.\"\r\nWalker refined the script; his change included extending a chase sequence depicting Mills cautiously pursuing Doe, aiming to avoid typical cinematic chases in which characters frantically pursue their target. He said; \"I always thought, 'God, if someone was shooting at me, I would be terrified to turn any corner!' \" A shooting script was completed by August 1994.\r\nCasting\r\nPitt had established himself as a credible film star following successes with Interview with the Vampire (1994) and Legends of the Fall, but Fincher had not considered him to portray Mills because \"I'd never seen Mills as particularly accomplished, and I was concerned that seemed too together. But when I met him, I thought, this guy is so likable he can get away with murder—he can do anything and people will forgive him for it\". Kopelson was aware of Pitt's popularity and importance to Seven's potential success; he shortened the pre-production schedule from twelve weeks to five to fit Pitt's schedule. Pitt rejected several offers from other films because he wanted to escape his typecasting as a romantic lead character in favor of something with a more \"documentary feel\" with urban settings and a focus on dialogue, akin to thriller films such as The Conversation (1974). He said; \"I just wanted to escape the cheese ... I came to find out had a lactose intolerance as well, so I was very happy about it\". Pitt described Mills as a well-intentioned \"idiot\" who \"speaks before he really knows what he's talking about\". He cut his hair for the role and lost weight to reduce the muscle he developed for Legends of the Fall. Sylvester Stallone and Denzel Washington rejected the role.\r\nWalker named the character Somerset after writer W. Somerset Maugham. Walker envisioned William Hurt playing the character but Fincher cast Freeman; the studio was concerned pairing a black detective with a white one would make Seven seem derivative of the action film Lethal Weapon (1987). Robert Duvall, Gene Hackman, and Al Pacino rejected the role. The script was further modified after Pitt's and Freeman's castings to better match their acting styles; Mills was made more verbose and Somerset's dialogue was reduced, and made more precise and direct. Robin Wright auditioned for the role of Tracy and Christina Applegate rejected it before Paltrow was cast. Pitt had recommended Paltrow after being impressed by her audition for Legends of the Fall. Fincher also preferred Paltrow but those involved told him she would not be interested in a \"dark\" film like Seven. Fincher auditioned about 100 people before Pitt contacted Paltrow to meet with them. Fincher said Tracy is \"so important because it's the only sunshine we have in the film. This is the feel-bad movie of ... we needed someone who could take those little seconds she gets and fill them with soul, and that's what I'd always seen in performances\".\r\nFincher and Walker wanted Ned Beatty to play John Doe because of his resemblance to the 1969 composite sketch of the Zodiac Killer; Beatty declined, describing the script as the \"most evil thing I've ever read\". Michael Stipe, lead vocalist of the rock band R.E.M., was considered but filming dates conflicted with the band's tour. Val Kilmer declined the role; R. Lee Ermey auditioned but Fincher said his portrayal was \"completely unsympathetic\" and without depth. Kevin Spacey was preferred by Pitt but executives refused to pay his salary. Doe's scenes were initially filmed with an unknown actor portraying Doe; the filmmakers quickly decided to replace them and Pitt helped negotiate Spacey's involvement. Spacey, who filmed his scenes in twelve days, said; \"I got a call on a Friday night, and on Monday morning I was on a plane to Los Angeles, shooting on Tuesday\". Spacey wanted his name omitted from the film's marketing and opening credits to ensure the killer's identity remained secret. He said:\r\nI'd just done Swimming With Sharks (1994), The Usual Suspects, and Outbreak (both 1995) ... I knew that if any of those movies did well, my profile would be ... different. How would that affect my billing in Se7en? If I'm the third-billed actor in a movie where the top two billings are trying to find somebody and they don't find that somebody until the last reel, then it's obvious who that somebody is. It was a bit of a shit-fight for a couple of days, but I felt very strongly that it was the right thing to do for the movie. We finally won because it was a deal-breaker; I was either going to be on a plane to shoot the movie or I wasn't.\r\nThe 480 lb (220 kg) actor Bob Mack made his film debut as gluttony, who was described as a \"very heavy guy face down in spaghetti\". Gene Borkan was cast to play the greed victim because the filmmakers wanted someone who resembled lawyer Robert Shapiro. He did not realize his character would already be dead and refused a request to perform nude, telling Fincher; \"I'll be naked if you're naked. Otherwise, you don't get that.\" On the set, when he realized what his scene entailed, Borkan renegotiated his salary, receiving \"five times\". Michael Reid MacKay's audition for the sloth victim involved him portraying a corpse that slowly turned his head towards the camera; his performance was deemed \"creepy\" enough. Set decorator Cat Mueller portrayed the lust victim after Fincher's assistant said she had the personality and body to portray a \"dead hooker\". She received $500 for six hours of filming over two days but described being nude in front of Pitt as a perk. Model Heidi Schanz was cast as the pride victim after the previous actor dropped out. Fincher, who was running low on time, wanted a model with existing headshots and pictures that could be displayed in the character's apartment. She said; \"even though I'm dead, I think it's the most glamorized murder\". The film's content made casting and crewing Seven difficult; Gary Oldman turned down an unspecified role, Fincher's former costume designer declined to work on the film, and talent agents refused to pass offers on to their clients, describing Seven as \"evil and misogynistic\".\r\nFilming\r\nPrincipal photography began on December 12, 1994, and concluded on March 10, 1995. Assistant director Michael Alan Kahn recalled the start of filming: \"I went up to Fincher and I said, 'Look at this! Look! It's here! We're here! You did it! We're shooting a movie ... isn't this amazing? ...' And he looked at me as though I were from outer space and said, 'No, it's awful ... now I have to get what's in my head out of all you cretins.' \" Walker was on set throughout filming to provide suggestions or on-spec rewrites but did not give Fincher much input, believing he should adapt the script as he wanted.\r\nLocation filming took place entirely in downtown Los Angeles. Fincher wanted to film in Oakland, California, because it had \"beautiful clapboard houses\" but the schedule would not allow for this. Rain often fell during filming; Fincher decided to film in rain to avoid continuity errors and because Pitt was only available for fifty-five days before he began filming 12 Monkeys (1995). Fincher also said the rain introduced an inescapable element for the characters because conditions were bad inside and outside, and that the rain made the film's city appear less like Los Angeles, which is associated with sunny weather.\r\nSeven's aesthetic was influenced by films such as All That Jazz (1979), The Silence of the Lambs (1991), and The French Connection (1971), as well as the \"vulnerable\", over-the-shoulder viewpoint of documentary television show Cops. Cinematographer Darius Khondji named the crime thriller Klute (1971), as a significant influence because of its \"use of toplight ... widescreen compositions for intimacy rather than big vistas, the way that vertical strips of the city are shown in horizontal mode, the fragments of faces and bodies ... the look of Se7en has this heightened sense of realism—a realism that's been kicked up several notches and becomes its own style.\" Fincher chose one scene in Klute in which the only illumination is the character's flashlight, saying he disliked other films in which characters state visibility is low but the audience can clearly see the scene. Khondji used a mixture of lighting, using the warm light of Chinese lanterns to represent the past and present, and the cold light of Kino Flos to represent the future.\r\nThe studio was unhappy with the darkness of the dailies; Khondji suggested printing the footage brighter but Fincher refused to compromise. Available footage was made into a well-received promotional showreel for the theater-owner convention ShoWest, after which complaints about the darkness ceased. Khondji used Panavision Primo lenses, which offered a sharp image with good contrast, and Kodak film stocks that could capture the \"gritty\" interiors and deep blacks for night-time exteriors.\r\nKhondji described the scene in which Mills pursues Doe as one of the most-difficult scenes to film due to its length, fast camera movements in rain, and tight, barely lit interior spaces. One segment had to be re-filmed because the location was too dark for the camera to capture Freeman's face. Pitt insisted on performing his own stunts for the scene; he slipped on a rain-slicked car bonnet, crashing through the windshield and sustaining injuries including cut tendons and nerves in his left hand; Fincher said he saw exposed bone. Pitt returned to the set a few days later, having received stitches and a forearm cast, which had to be written into later scenes. For scenes set prior to the chase, Pitt would keep his hand in his pocket or otherwise obscured to hide the injury. Pitt said he regretted not disrobing for a separate scene of Mills and Somerset shaving their chests to wear concealed listening devices. He disliked the public attention given to his body but later came to believe taking off his shirt off would have conveyed the growing partnership between Mills and Somerset.\r\nThe crew had to clear used condoms and crack pipes from the location of the sloth victim sequence, replacing them with prop crack pipes and air fresheners. The actors were not told the sloth victim was a person in costume; McGinley's shock at the body's movement is real. Lights with green color gels were shone through the window from the adjacent building to impart the scene with a green tint. Leland Orser, who portrays the man who is forced to kill the lust victim, deprived himself of sleep to achieve a \"deranged mindset\"; his scene was postponed so he stayed awake another night. He breathed rapidly between scenes to make himself hyperventilate on camera. The ending was scripted to take place directly beneath transmission towers, a location Doe selects to interfere with the police communications; the towers, however, interfered with the film crew's radios and the actors had to use cell phones to communicate with the crew from afar.\r\nEnding and post-production\r\nThe film's ending remained a point of contention between New Line Cinema and the filmmakers; Fincher, intending to stun the audience, wanted to follow Mills shooting of Doe with a sudden cut to black but executives believed this would alienate audiences. Fincher instructed staff at a test screening to keep off the lights following the cut to black so the audience could take it in but his instructions were not followed. Afterward the screening, one female audience member walking by Fincher said; \"the people who made that movie should be killed\". According to Fincher, the screening invitation said; \"Would you like to see a new movie starring Brad Pitt and Morgan Freeman?\", both of whom were known for films very different in tone to Seven; Fincher said; \"I don't know what the fuck they thought they were gonna see ... but I'm telling you, from the reaction of the people in there, they were bristling. They couldn't have been more offended.\" Executives wanted a mainstream conclusion in which Mills and Somerset pursue Doe and a kidnapped Tracy, who would survive. According to Pitt; \" 'You know, he would be much more heroic if he didn't shoot John Doe—and it's too unsettling with the head in the box. We think maybe if it was dog's head in the box.' \" Freeman preferred a storyboarded sequence of Somerset killing Doe, sparing Mills from losing his career as well, but Pitt believed Mills had to kill Doe and test audiences preferred that version. Another alternative ending depicted Mills shooting Somerset to stop him killing Doe first. Fincher and Pitt refused to compromise on the head-in-the-box ending but settled for a longer epilogue showing Mills being arrested and Somerset delivering a concluding narration, offering some optimism.\r\nPitt and Fincher were unhappy with the car-ride scene leading into the ending because the dialogue had to be overdubbed because too much ambient sound had been picked up during filming. Pitt believed this caused the scene to \"lose its breath\", affecting the pacing and emotion. The helicopter scenes were also filmed in post-production because there was no time during principal photography; the studio agreed extra time and funding if the scenes were deemed necessary. Because these scenes were filmed several months later that the rest of the film, the green ground had turned brown and the ground-based scenes had to be color-corrected to match the new footage. The opening credits were scripted to be set over footage of Somerset visiting a countryside home he intended to purchase for his retirement, taking a piece of the wallpaper he would carry through the film, before returning to the city by train. This was intended to create a stark contrast between the countryside and the darkness of the city but there was insufficient budget to film it. As a result, scenes of Somerset looking at the wallpaper piece had to be cut.\r\nRichard Francis-Bruce edited the 127-minute theatrical cut. His style focused on \"having a motivated cut\", believing every cut needed to be done with a specific purpose. For the finale, he introduced more rapid cuts to emphasize the tension as Doe's plan is revealed, and a brief, four-frame insert of Tracy as Mills pulls the trigger to compensate for not showing the contents of the box. To emphasize the darkness, Fincher and Khondji used an expensive, lengthy bleach bypass chemical process that retained some of the silver that would normally be removed from the film stock. The silver created a luminous effect in light tones and deeper, darker colors. Of the 2,500 prints sent to theaters, only a few hundred used the process.\r\nSeven was budgeted at $30–$31 million but Fincher persuaded studio executives to provide further funding to achieve his vision for the film, eventually pushing it $3 million over budget, to $33–$34 million, making it New Line Cinema's most expensive film at that point. A studio employee said executives \"would go into these meetings with, saying, 'Absolutely not, not a penny more' ... but he was so relentless and persuasive that they'd come out all ga-ga-eyed, and give him more money.\" About $15 million of the budget was spent on below-the-line costs.\r\nMusic and sound\r\nFincher hired Howard Shore to score Seven based on his score for The Silence of the Lambs (1991). Shore said Fincher would attend recording sessions but rarely interfered with Shore's process. The score, which was performed by an orchestra of up to 100 musicians, combines elements of brass, percussion, piano, and trumpets. \"Portrait of John Doe\" serves as the central theme with two cue notes; a rising version is used for Tracy's appearances. Shore described the film's ending as having a \"visceral, kind of primal effect on me\"; he incorporated his reaction into the sequence's score, providing little accompaniment during the dialogue between Mills, Somerset, and Doe, but using it to punctuate significant moments such as Somerset opening the box. Shore said; \"the music starts, and it turns the scene, it turns it into John Doe's perspective ... the music enters, and you realize, the look of the horror on his face, it's a chilling moment\".\r\nShore's opening theme \"The Last Seven Days\", which is described as a more-upbeat piece, was replaced with Nine Inch Nails's song \"Closer\", which was remixed by Coil and Danny Hyde. David Bowie's song \"The Hearts Filthy Lesson\" is used for the end credits. Seven features songs including \"In the Beginning\" by The Statler Brothers, \"Guilty\" by Gravity Kills, \"Trouble Man\" by Marvin Gaye, \"Speaking of Happiness\" by Gloria Lynne, \"Suite No. 3 in D Major, BWV 1068 Air\" by Stuttgarter Kammerorchester and Karl Münchinger, \"Love Plus One\" by Haircut One Hundred, \"I Cover the Waterfront\" by Billie Holiday, \"Now's the Time\" by Charlie Parker, and \"Straight, No Chaser\" by Thelonious Monk.\r\nFincher hired his friend Ren Klyce as sound designer. They inserted sounds on the outside of each frame, such as rain or screaming, to create a psychological impression that terrifying things are occurring even when the audience cannot see or escape it. Klyce and sound designer Steve Boedekker also produced the music that is heard at the entrance to the sex club where the lust victim is murdered.\r\nDesign\r\nStyle and set design\r\nFincher, Khondji, production designer Arthur Max, and costume designer Michael Kaplan collaborated on establishing a unified vision for the art direction. Fincher established the design rules for the film, saying: \"This is a world that's fucked up and nothing works\". He wanted every design to look neglected and in a state of decay. The photography of William Eggleston and Robert Frank influenced Fincher, who focused on \"coolness\", making the visuals simultaneously gritty, stylized, classic, and contemporary; Khondji said Frank's style could be seen in Seven's very bright exteriors and dark interiors. Many of the film's interior scenes were underexposed to create a stark contrast, which made the exteriors stand out more. Interior lighting was often provided by external sources, using only a few interior artificial lights. The final scene with Mills, Somserset, and Doe, has inconsistent lighting because the actors were always lit from behind by the sun regardless of their placement in the scene, which Khondji described as \"a bit of a nightmare and never realistic in terms of continuity\".\r\nFincher wanted precise staging for every scene to make the audience feel as if they were in the location. Believing it was important to create limitations to challenge himself, Fincher had sets built without removable walls, and the crew had to film within their confines. Doe's murder scenes were influenced by photography, such as the work of Joel-Peter Witkin. The \"gluttony\" set was wrapped in plastic to contain the cockroaches; a cockroach wrangler was used to help control them. The sloth scene in particular was influenced by the work of painter Edvard Munch, drawing on the green and \"claustrophobic\" imagery. The ceilings of the sex club in which the lust victim is murdered were lowered to make the space more claustrophobic, andwas sprayed on the walls to give texture and to imply they are covered in bodily fluids. A former bank was used as the library and 5,000 books, which were supplemented with fiberglass replicas, were rented to fill the space. The shaking in Mills apartment, which is caused by a passing train, was created using gas-powered engines attached to the set. Walker's script extensively described Doe's home, whose windows are painted black for privacy and a drawer is filled with empty painkiller bottles to help Doe cope with regular headaches.\r\nVictims\r\nRob Bottin led development of practical effects. He researched crime-scene photographs and police evidence files, observed an autopsy, and studied the effects of obesity to realize his designs. For the gluttony victim, Mack spent up to 10 hours a day having makeup and prosthetics applied. A scuba-like device was used to let Mack breathe while face-down in spaghetti. Mack said he was unaware he would be surrounded by live insects until reading the daily call sheet and noticing a \"cockroach wrangler\"; Pitt would flick some roaches off Mack between takes. The character's autopsy used a fiberglass replica with a deliberately enlarged penis; Fincher said after Mack spent so long in makeup for 30 seconds of screen time, he could \"at least give him a huge cock.\"\r\nBottin's team spent 11 days experimenting on the aesthetic and prosthetics for the sloth victim, who MacKay portrayed. MacKay was 5.5 ft (170 cm) tall and weighed 96 to 98 lb (44 to 44 kg) during filming, offering a slight frame for the emaciated character. The filmmakers asked him to lose more weight but he refused. The effects team made a body cast of MacKay to develop rubber prosthetics that could be applied all over his body. The appliances were painted to appear bruised and scarred, veins were airbrushed onto MacKay, and he was fitted with gelatin sores, overgrown fingernails, skeletal teeth, and matted hair. The process took up to 14 hours, requiring MacKay to begin at 5 am for filming at 8 pm. He was taken to the set in costume; Freeman said \"you don't look so good\". MacKay described filming the scene as \"real heavy-duty\", and was left \"breathing very hard and crying\". He had to remain fairly still during four hours of filming, having to limit his breathing to prevent his stomach rising and falling, and the cold on set was worsened by makeup artists repeatedly spraying his body with water. Unable to move, he tensed his muscles to warm himself. He described the moment he was permitted to cough in McGinley's inspecting face as a \"great relief\" because he could move and breathe again.\r\nFor Schanz's pride victim, Fincher added blood to her while her nose was taped to the side and her face was covered in gauze. To secure the film's release, several scenes of Bottin's effects work had to be cut. Fincher described Seven as psychologically violent, implying violence without overtly showing it. In the opening scene, Walker portrays a corpse lying in a pool of blood; he said the blood was very cold and he had a minor panic attack once in place because he was worried about moving and ruining the shot.\r\nTitle credits\r\nFollowing the removal of the planned opening train-ride scene with Somerset, Fincher needed a temporary title sequence to screen Seven for studio executives. He recruited R/GA designer Kyle Cooper and his team to assemble a montage slideshow reflecting Doe's perspective. This helped establish the character and his threat earlier in the film because Doe does not appear until Seven's final act. The sequence was set to the \"Closer\" remix at Fincher's request.\r\nThe sequence was well-received by executives, who suggested retaining it for the theatrical release. Fincher did not want to appear to be accepting their suggestion and instructed Cooper to develop a new concept; Cooper persuaded Fincher to use a more-elaborate and detailed version of his slideshow. Cooper focused on Doe's elaborate journals, which are briefly glimpsed in the film, while Fincher suggested the sequence should depict Doe. Fincher wanted Mark Romanek to direct the sequence, being a fan of his music video for \"Closer\" and sharing similar design sensibilities but Cooper secured the role because of his previous experience on similar title sequences. Fincher told Cooper; \"all I want is for the audience to want to run screaming from the theater during the title section\".\r\nThe title sequence depicts Doe's preparations and routines for his murderous plans, such as cutting off his fingertips, processing photographs in his bathtub, and making tea. This was inspired by Cooper's appreciation for the \"elegant\" way Doe stirs his tea following his surrender. The sequence focuses on Doe writing his journal and crossing out words such as \"pregnancy\" and \"marriage\", and other elements representing a \"perfect life\", which he does not believe people deserve. Fincher said; \"it was a way of introducing the evil. The idea was that you're watching title sequences from the mind of somebody who's lost it ... won't understand while they're watching it, but they'll get it later\". Clive Piercy and John Sabel made Doe's journals, which cost tens of thousands of dollars each to fill with text and images; about six complete journals were made, supplemented by blank ones on shelves. Artist Wayne Coe storyboarded the sequence, which Harris Savides filmed and Angus Wall edited. Cooper regularly conferred with Wall on ideas, and spent the night before filming locating items such as fish hooks and loose hairs from his drain, which he believed would make interesting inclusions.\r\nFilming took place over eight days, including two days filming a hand-model stand-in for Doe. Fincher was upset at the casting because the model's hands were shorter and chunkier than Spacey's. A further five weeks were spent assembling the sequence. Although digital options were available, Cooper's team chose to assemble the sequence by hand, believing any irregularities and accidents in the images would enhance the overall aesthetic, and manually added scratches, tears, and pen marks direct to the film negative. Fincher and Cooper devised a rough-looking text for the credits to appear as if written by a \"disturbed hand\". Fincher said: \"I always liked the idea that the titles would be written by Doe, hand-lettered ... wanted to have them look personal, not typeset. I liked that it wasn't slick.\" The text was etched onto a black-surfaced scratchboard and visually manipulated while being transferred to film to add a smear effect combined with variants of the same text achieved by placing the text over a light box and filming them over-exposed, creating an animation-style effect. \"Disquieting\" sounds were added throughout the sequence at a low frequency, such as barking dogs and screams. The title sequence cost $50,000.\r\nRelease\r\nContext\r\nThe theatrical box office of 1994 achieved record grosses, with nine films earning more than $100 million and the highest attendance (1.29 billion) since 1960 (1.3 billion). By 1995, however, the average cost of making and marketing a film had doubled since 1990, reaching $50.4 million, making turning a profit more difficult. The rising salary cost of actors was a contributing factor; studios vied to secure popular actors such as Harrison Ford, Jim Carrey, Tom Cruise, and Arnold Schwarzenegger who could generally guarantee a minimum level of box-office success and held broad appeal outside of the United States and Canada. If notable stars were unavailable, studios were forced to pay exorbitant salaries for less-well-known stars and pay other cast lower salaries to offset costs. In 1995, theatrical box-office revenue was falling; the first quarter was about $90 million lower than the same period in 1994. Markets outside of the U.S. and Canada were growing, accounting for 41% of a film's total revenue—including theatrical and home media profits—and outperformed the U.S. and Canadian box offices for the first time in 1994. Anticipated films such as Batman Forever, Crimson Tide, and Pocahontas were scheduled for release alongside Waterworld, the most-expensive film of its time. New Line Cinema had low expectations for Seven based on middling scores from test audiences.\r\nMarketing\r\nNew Line Cinema's marketing president Chris Pula called the advertising campaign for Seven \"risky\" because it had to \"prepare people\" for the film's dark, violent content while making it a topic of discussion among potential audiences. Early trailers and newspaper, television, and radio advertisements focused on the seven sins, presenting Seven as an \"edgy\" prestige film rather than a jumpscare-style horror. Entertainment professionals believed violent or horrific films had a limited appeal and rarely received positive reviews. Fincher's public image had been tarnished by the failure of Alien 3, and although Freeman and Pitt were proven stars who were capable of attracting audiences, New Line Cinema struggled to capitalize on Pitt's popularity. Pitt's core audience, teenage girls, were not the film's target audience and research showed young men would avoid taking a romantic partner to films featuring Pitt because they felt \"threatened\" by his appeal. The positive word-of-mouth following Seven's theatrical release led the marketing campaign to shift focus toward targeting Pitt's female fans.\r\nThe premiere of Seven took place on September 19, 1995, at the Academy of Motion Picture Arts and Sciences in Beverly Hills, California. The event was attended by over 800 guests, including Fincher, Freeman, McGinley, Spacey, Tia Carrere, Elliott Gould, Matthew Modine, Lori Petty, Lou Diamond Phillips, Michael Rapaport, Eric Roberts, Robert Rodriguez, Steven Seagal, John Singleton, Christian Slater, Quentin Tarantino, and Jennifer Tilly.\r\nBox office\r\nSeven was released in the United States and Canada on September 22, 1995. During its opening weekend, Seven earned $14 million across 2,441 theaters—an average of $5,714 per theater—making it the number-one film of the weekend, ahead of the debut of Showgirls ($8.1 million), and To Wong Foo, Thanks for Everything! Julie Newmar ($4.5 million), in its third week of release. Seven had the highest-grossing September opening weekend of its time, replacing 1991's Freddy's Dead: The Final Nightmare ($12.6 million). The successful opening was credited to the marketing campaign overcoming audience skepticism and Pitt's popularity with males and females—although a higher percentage of the opening audience were male—and the competing action films. New Line Cinema distribution executive, Mitch Goldman had preponed the release date of Seven to avoid competition and strategically opened the film in more theaters than usual to target suburban and small-town locations where Pitt's recent films had fared well.\r\nSeven remained number one in its second weekend, ahead of the debuts of Halloween: The Curse of Michael Myers ($7.3 million) and Devil in a Blue Dress ($5.4 million), and in its third weekend ahead of the debuting Assassins ($9.4 million) and Dead Presidents ($8 million). Seven remained the most-popular film until its fifth weekend, falling to number 3 behind the debuts of Get Shorty ($12.7 million) and Now and Then ($7.4 million), and was among the ten-highest-grossing films for nine weeks. Seven had grossed about $87 million by the end of December, when it received a wide re-release in select locations to raise its profile during the nomination period for the 1996 Academy Awards. The re-release helped raise Seven's box-office revenue to about $100.1 million, making it the ninth-highest-grossing film of 1995 behind Casper ($100.3 million), Jumanji ($100.5 million), GoldenEye ($106.4 million), Ace Ventura: When Nature Calls ($108.4 million), Pocahontas ($141.6 million), Apollo 13 ($173.8 million), Batman Forever ($184 million), and Toy Story ($192.5 million). According to estimates by industry experts, as of 1997, the box office returns to the studio minus the theaters' share was $43.1 million.\r\nSeven also performed well outside the U.S. and Canada, receiving positive audience reactions and successful debuts in Australia ($1.8 million), South Korea ($808,009), Seoul ($961,538), New Zealand, and the Netherlands. Seven is estimated to have earned a further $227.2 million, giving it a worldwide gross of $327.3 million, and making it the seventh-highest-grossing film worldwide behind Apollo 13 ($335.8 million), Batman Forever ($336.5 million), Pocahontas ($347.1 million), GoldenEye ($356.4 million), Toy Story ($365.3 million), and Die Hard: With a Vengeance ($366.1 million). Seven was an unexpected success and became one of the most-successful and most-profitable films of 1995.\r\nReception\r\nCritical response\r\nCritics such as Roger Ebert and Desson Howe described Seven as an intelligent, well-made film that could comfortably stand alongside other thrillers. Others compared Seven unfavorably with The Silence of the Lambs and The Usual Suspects, saying Seven lacks the other films' intelligent narrative, and takes itself too seriously as an examination of evil instead of a \"silly piece of pulp\". The Orlando Sentinel said, however, Seven offers a \"terrific film-noir atmosphere\" and excellent performances, with The Seattle Times saying the film would be \"unendurable\" without Freeman and Spacey.\r\nCritics unanimously praised Freeman's performance. Terrence Rafferty and Kenneth Turan wrote Freeman's \"exceptional\" performance is mainly responsible for making Seven watchable in spite of itself. Howe and James Berardinelli said the performance elevated Pitt's own to appear \"actorly\", although Freeman often steals every scene in which he appears, providing a fresh take on an otherwise-cliché role. Reviews of Pitt's performance were polarized between those who found it \"energetic\" and impressive and those who believed the role was beyond his acting abilities. Some reviewers said Pitt's performance continued his successful transition to more-serious roles from those based mainly on his appearance, although Howe said Pitt's presence does more for Seven than his acting. The Orlando Sentinel said what could have been a cliché role was saved by Mills not being inept or inexperienced, just out of his depth in this case. Some reviews said the character is underdeveloped, pointless, stupid, and not particularly likeable, and that Pitt's performance lacks the subtlety or effectiveness to compensate. Critics positively received Paltrow's performance, saying she made the most of her limited screentime and was generally underused while considering the character a \"flimsy contrivance\". Spacey's performance was also praised for its creepy, understated portrayal of an intelligent character who does not undermine himself with \"a moment of sheer stupidity\".\r\nFincher's directorial style was praised for its \"striking craftmanship\" and \"stunning\" visuals that often simultaneously thril and exasperate the viewer. In contrast, Rafferty said his style is less effective when stretched over the film's runtime, and that Fincher mistook darkness for profundity and chose style over coherence. Although Siskel considered Walker's script to be smartly written, several critics were less enthusiastic, finding the dialogue trite, many scenes implausible, and character motivations weak. Jami Bernard and Richard Schickel wrote Seven lacks many of the essentials prevalent in its genre such as suspense, witty dialogue and cathartic humor, and the psychological depth to match the intellectual thrills of The Silence of the Lambs.\r\nThe violent content of Seven was generally negatively received. Critics such as Berardinelli and Gene Siskel found the gore excessive and \"gratuitous\". While some found the violent visuals to be tiresome and detracting, others said Fincher skilfully avoided showing the violence that led to the deaths, preventing them from distracting from Seven's more enjoyable aspects. According to Ebert and Turan, however, Seven would be too disturbing for many viewers. Fincher responded: \"I didn't set out to piss off the people who are upset. I was told that Michael Medved wrote that the movie was evil, but I'm sure he slows down when he passes an accident just like everyone else. Death fascinates people, but they don't deal with it.\" Howe and Owen Gleiberman said the ending is \"like an act of treachery against the viewer\", undermining any hope for a positive outcome; and Barry Norman said it denies the audience \"even of the final comfort they fully deserve\". Ebert, however, found the ending to be \"satisfying\" but underwhelming compared to the film's earlier events. Audiences polled by CinemaScore gave the film an average grade of \"B\" on a scale of A+ to F.\r\nAccolades\r\nSeven received one nomination at the 68th Academy Awards for Best Editing (Richard Francis-Bruce), and Walker was nominated for Best Original Screenplay at the 49th British Academy Film Awards. At the MTV Movie Awards, Seven received three awards; Best Movie, Most Desirable Male (Pitt), and Best Villain (Spacey). New Line Cinema re-released Seven in Westwood, Los Angeles, California, on December 26 and in New York City on December 29, 1995, in an unsuccessful attempt to generate Academy Award nominations for Freeman, Pitt, and Fincher.\r\nPost release\r\nHome media\r\nSeven was released on VHS, DVD, and Laserdisc in 1996. A two-disc special edition DVD that was released in 2000 introduced additional features including a remastered picture scanned from the original film negative, extended and deleted scenes, the original opening with Somerset and cut-to-black ending, production photographs and designs, and storyboards for an alternative ending. The release also includes four commentary tracks: Pitt, Fincher, and Freeman discussing Seven; a discussion between Fincher, De Luca, Francis-Bruce, Walker, and film-studies professor Richard Dyer; Khondji, Max, Dyer, Francis-Bruce, and Fincher; and an isolated music and effects score with commentary by Shore, Klyce, Dyer, and Fincher. The film was released on Blu-ray Disc in 2010; the release features remastered visuals and contains all of the additional content in the special edition, with an additional collectible DigiBook version containing production notes and photographs.\r\nThe soundtrack of Seven was released in November 1995; the 11-track compact disc and cassette-tape release contains several of the songs used in the film such as \"Guilty\" and \"In the Beginning\", and two pieces of the score (\"Portrait of John Doe\" and \"Suite from Seven\") but omits \"Closer\" and \"The Hearts Filthy Lesson\". A bootleg recording of the score was released in the late 1990s and an official debut of the full 16-piece score was released in 2016.\r\nOther media\r\nA novelization of Seven that was written by Anthony Bruno was released alongside the film in November 1995. A seven-issue comic-book series was released between September 2006 and October 2007 by Zenescope Entertainment; serving as a prequel to the film's events of the film, the comic book focuses on Doe and the planning of his crimes.\r\nThematic analysis\r\nApathy and hope\r\nThe apathy of the film's unnamed city's inhabitants is a central theme in Seven. Somerset does not believe the city can be saved, intending to retire beyond its confines, and telling Mills women are taught to yell \"fire\" rather than \"help\" because people are more likely to pay attention if they selfishly think themselves in danger. Taubin described the city as an infection point for corruption in which signs of violence and decay are omnipresent in its dark corners and rain, television reports, fights, screams, and children in impoverished apartments. Dyer compared the near-constant rain to films such as Blade Runner (1982), as a near-inescapable presence, which in Seven can represent sin seeping into every gap. The city's bleak aesthetic implies a layer of moral decay and indifference by its inhabitants that enables Doe's plan. Somerset has not stopped caring but has become as apathetic as those around him because of the futility of his efforts. Seven reinforces this in several scenes, such as the dismissal of his concerns a child witnessed a murder, the police captain's indifference to a mugger needlessly stabbing out his victim's eyes, and the sex club manager who dislikes his role but sees no alternative. Somerset tries to spare Tracy from the influence of the city by advising her to leave with her unborn child.\r\nBoth Somerset and Doe perceive the ubiquity of sin and indifference toward it. There are parallels between the characters, both of whom live alone, are devoted to their work, and have no meaningful relationships. Although there is mention of Somerset's former partner and some degree of respect for his colleagues, he tells Tracy; \"anyone who spends a significant amount of time with me finds me disagreeable\". Doe's apartment is a reflection of his isolation from society. They differ, however, in their response to sin; Somerset has surrendered to apathy and sorrow, while Doe feels contempt for society and has assumed a role as its punisher. It is implied Somerset was once passionate about his work until he realized he could not change things; Doe is dedicated and passionate, believing wholeheartedly in the change his work will bring. Somerset has never killed anyone, and retains a spark of hope for humanity's improvement, while Doe kills freely, believing humanity is beyond saving. When Mills tells Doe he is killing innocent people, Doe replies:\r\nonly in a world this shitty could you even try to say these were innocent people and keep a straight face. But that's the point. We see a deadly sin on every street corner, in every home, and we tolerate it. We tolerate it because it's common, it's trivial. We tolerate it morning, noon, and night. Well, not anymore.\r\nMills and Somerset are contrasting characters in terms of temperament, morality, intelligence, and personal connections. Somerset is analytical, wise, experienced, and meticulous while Mills is young, messy, and inexperienced but full of potential. Mills is optimistic and relatively light-hearted, choosing to move to the city because he believes he could have a positive influence until everything is taken from him. According to Goldberg, Mills and Tracy are naïve to the city's corruption; for example, they are tricked into renting an apartment that experiences constant shaking from nearby trains. Dyer said Tracy in particular represents potential virtue but her impact is reduced because she is infrequently used to conceal her eventual fate.\r\nDoe's plan works, shocking Somerset out of his apathy, and inspiring him to defer his retirement and fight for a better future. Walker said the ending is:\r\nabout \"optimist Mills\" ... going up against this pessimistic kind of world-weary detective in Somerset ... those dramatically opposed points of view are pushing and pulling each other throughout the story. And then once pessimism is confirmed, even to the optimist who's been arguing that the fight is always worth fighting, will the pessimist in the light of confirmation of all his worst predictions, will he stay or will he walk away?\r\nRosenbaum described it as a \"touching, old-fashioned faith in the power of good to reassert itself\", tempered by the fact the hope is inspired by a self-martyred serial killer. He said Seven chose style over substance, giving the overall message we \"remain exactly where we are\". Dyer compared Doe to Hannibal Lecter in The Silence of the Lambs, in terms of ability to out-think and manipulate the authorities combined with his artistic method of arranging his murders, but that they are contrasted by their different social statuses; Lecter being an educated professional with a preference for luxury, while Doe is seemingly self taught, unemployed, and obsessed with his mission. Rosenbaum, however, said unlike The Silence of the Lambs, Seven does not \"exploit its psycho killer for cheap laughs or blind hero worship\". Nayman found Seven problematic, believing it venerates Doe as having a valid criticism of society.\r\nReligion and order\r\nSomerset describes Doe's murders as his sermons to the masses. According to Dyer and Saunders, Doe is conducting a violent crusade, demonstrating the consequences of moral decay and sinning, based on his own interpretation of Christian ideology, in a city rather than the biblical Sodom and Gomorrah. Writer Patricia Moir said theorists in the late 1990s believed a growing trend in North America resulted in the decay of social meta narratives of order that were created by religion, science and art, in turn diminishing societal norms; and that in absence of these paradigms, all that remains is the chaos of existence. Somerset tries to create order using the ticking of a metronome to disguise the disordered noise of sirens and screams outside his apartment. According to Dyer, Somerset's smashing of the metronome is him acknowledging he can no longer ignore the city's darkness. Doe creates order by filtering literature about the seven deadly sins and works by authors such as John Milton through a lens of religious fanaticism. He believes his purpose is God-given, which is reflected in the opening credits depicting Doe cutting the word \"God\" from a dollar bill; Kyle Cooper said, \"I hesitated on that one but decided to do it because John Doe took it on himself to play God\".\r\nDoe rationalizes everyone is guilty of sin or wishing ill on other sinners. According to Dyer, Doe is conscious he is also a sinner so his plan involves his own death. Goldberg said Doe is the true sin of wrath, which is evident in his violent acts; to complete his plan, however, Doe must make Mills \"become\" wrath, and gives himself the sin of \"envy\". His resigned acceptance of the sin is, according to Goldberg, because there is no other sin for him to take and he is conscious sins will not end with his death. Doe's transferring of wrath to Mills also demonstrates the infectiousness and pervasiveness of sin. Mills' killing of Doe can be considered an act of good and justice, eliminating a remorseless force of evil; Mils, however, commits the act purely for revenge. Film professor Richard Dyer says Doe does not know how to conclude his plan until meeting with Mills while disguised as a photographer, during which Mills displays his wrath. Writer Shaina Weatherhead said Seven foreshadows the importance of the wrath and envy throughout, identifying the color red as a representation of wrath and green as a representation of envy; these colors are frequently seen—Somerset has a red lamp, Mills drinks from a green mug, and there are green buildings with red address numbering in the background.\r\nSeven includes subtle references to the number seven, reinforcing the religious subtext; Doe's plan culminates on a Sunday, the seventh day of the week and the biblical day of rest, on which Doe's package for Mills is delivered at 7:01 pm. While researching Doe, Somerset references material including \"The Parson's Tale\" by Geoffrey Chaucer, which discusses penance; Dante Alighieri's Divine Comedy and its seven terraces of purgatory; a Catholic dictionary; and a reference to seven children being slain. There are also references to art such as a stack of spaghetti cans resembling Campbell's Soup Cans by Andy Warhol. Journalist Kim Newman said each of Doe's kills is arranged as an artistic piece dedicated to each sin. Commentary appears on the excesses of performance art and culture of celebrity; Mills refers to Doe as a \"movie of the week\" and a \"fucking T-Shirt\", implying his legacy will be brief before fading into obscurity. Moir said Seven provides no final answers about Doe's legacy but implies things have potentially only worsened.\r\nLegacy\r\nCritical reassessment\r\nSeven is now regarded as one of the best thriller, crime, and mystery films ever made. Some publications have listed Seven among the greatest films of all time. A 2014 poll of 2,120 entertainment industry professionals by The Hollywood Reporter ranked Seven the eighty-fifth-best film of all time. Review aggregator Rotten Tomatoes offers a 82% approval rating from the aggregated reviews of 85 critics, with an average score of 7.9/10. The website's critical consensus says: \"A brutal, relentlessly grimy shocker with taut performances, slick gore effects, and a haunting finale\". The film has a score of 65 out of 100 on Metacritic based on 22 critics' reviews, indicating \"generally favorable reviews\".\r\nRetrospective reviews have said Seven retains its appeal over its peers due to its bleak, often imitated but rarely equaled ending, and Fincher's story-focused directorial style. Critic Matt Goldberg described Seven as timeless because of its stylized reality that is not linked to any particular time or place, and its lack of popular culture references, advertisements, and focus on technology. Discussing Seven's lasting positive legacy as a thriller, Walker said:\r\nI know a lot of people hate Seven and think it's just garbage, so it's good to be humbled in that way. I'm really proud of it ... Looking back at the time that's passed, I feel extremely lucky that they never managed to make a sequel to it ... I've been lucky that they've not managed to make a prequel to it, which, in my opinion, sucks all of the kind of meaning and energy out of who and what John Doe represents. I love that it's still a standalone piece.\"\r\nSeven is included in the 2013 film reference book 1001 Movies You Must See Before You Die, and has been listed among Pitt's and Fincher's best films.\r\nCultural influence\r\nSeven helped Pitt's transition into more-serious and dramatic acting roles. He and Paltrow became romantically involved before the film's release, and Pitt would work again with Fincher on films such as Fight Club (1999). It also established Freeman as a mentor-type figure, an archetype he reprised in many later projects. After the failure of Alien 3, Seven revitalized Fincher's film career, establishing him among the most iconoclastic Hollywood directors of his generation; over the next few years, he directed The Game (1997), Fight Club, and Panic Room (2002). Walker and Shore worked with Fincher on several other projects. Describing the personal impact on himself, Walker said; \"ten years down the line, if nothing else got produced. I'd still have this great movie on video ... when I'm run out of town, living my old age, running a miniature golf shop, I can always have what I've dreamt of having since I was very young.\" In a 2022 interview, MacKay, who played the sloth victim, said he was still earning \"healthy residual payments\" for his role, and was occasionally recognized in public by fans. He said: \"people still think they used a dummy in that scene ... I get that a lot. But that was me.\"\r\nSeven inspired many filmmakers, and is considered influential on crime-based films and television shows that replicated its grim aesthetic, body horror imagery, lighting, and premise of disenchanted detectives pursuing criminals with distinctive killing methods and motivations, including Kiss the Girls (1997), The Bone Collector (1999), Along Came a Spider, The Pledge (both 2001), the Saw series (2003), and television series Prodigal Son (2019–2021). Collider said Seven caused a resurgence in faith-based horror, supernatural, and apocalyptic mystery films. The superhero film The Batman (2022) has a similar style and tone to Seven; Rolling Stone called it \"part superhero blockbuster, part 1970s-antihero homage, and part Seven remake\". Seven's use of alternative music by Nine Inch Nails is also seen as contributing to increased use of similar songs in films such as Final Destination (2000), Lara Croft: Tomb Raider (2001), and Resident Evil (2002).\r\nNew York Times called the title credit sequence for Seven \"one of the most important design innovations of the 1990s\". Art of the Title described it as the beginning of a \"renaissance in title design, particularly in the horror genre, and its influence is evident over two decades after Seven's release. In 2011, IFC ranked the sequence as the third-best-ever behind those of Vertigo (1958) and A Hard Day's Night (1964), and its style can be seen in the opening credits of films such as The Bone Collector, Red Dragon, and Taking Lives (2004).\r\nThe film's twist ending is considered one of the best in cinematic history. Pitt's line \"What's in the box?\" as he asks Somerset to confirm the contents of Doe's box, has become iconic, and is used in popular culture and memes. Walker said; \" one of the reasons I think Seven did well ... because people went in and they did not know in the first ten minutes exactly how the movie was going to end\". Although it is only implied Tracy's head is in the box, Fincher recalled an encounter with a woman who said: \" 'There is no need to make a stand in of Gwyneth Paltrow's head to find in the box. You don't need to see that.' And I said, 'Well, we didn't.' And she said, 'Oh yes, you did.' So, the imagination, if properly primed, can do more than any army of makeup artists.\" Several publications have named John Doe as one of the great cinematic villains.\r\nSequel\r\nIn 2002, New Line Cinema proposed a sequel named Ei8ht that would be based on a repurposed spec script titled Solace by Ted Griffin about a psychic serial killer who is pursued by a similarly psychic detective, Somerset. The idea was abandoned after principal Seven cast and crew, including Freeman and Pitt, expressed no intention to return for a sequel. Fincher said; \"I would be less interested in that than I would in having cigarettes put out in my eyes\". The script was made into the standalone thriller named Solace (2015), which was a critical and commercial failure.",
    "html": "<p>Seven (stylized as Se7en) is a 1995 American crime thriller film directed by David Fincher and written by Andrew Kevin Walker. It stars Brad Pitt, Morgan Freeman, Gwyneth Paltrow, and John C. McGinley. Set in an unnamed, crime-ridden city, Seven's plot follows disenchanted, near-retirement detective William Somerset (Freeman) and his newly transferred partner David Mills (Pitt) as they attempt to stop a serial killer before he can complete a series of murders based on the seven deadly sins.</p><p>Walker, an aspiring writer, based Seven on his experiences of moving from a suburban setting to New York City during a period of rising crime and drug addiction in the late 1980s. His script was optioned by an Italian film company that underwent financial difficulties and sold the rights to New Line Cinema. Executives were opposed to the script's bleak ending and mandated a more-mainstream, upbeat outcome. Fincher, who was eager to prove himself after the failure of his first feature-film project Alien 3, read Walker's original script—which he was sent by mistake—and agreed to direct the project provided the ending remained. The studio continued trying to change the ending but faced opposition from Fincher and the cast. On a $33–$34 million budget, principal photography took place mainly on location in Los Angeles. Rob Bottin headed the special effects team responsible for realizing the elaborate murders using makeup and prosthetics.</p><p>Seven received middling test audience results; it was not expected to perform well due to its violent and mature content but it earned $327.3 million worldwide, becoming a surprise success and one of the highest-grossing films of the year. Contemporaneous reviews were mixed; critics praised Freeman's performance but criticized the film's dark cinematography, explicit and implied violence, and bleak ending. Seven revitalized Fincher's career and helped Pitt move from roles based on his appearance to more serious, dramatic roles.</p><p>In the years since its release, consensus on the movie has shifted; Seven is now regarded as one of the best thriller, crime, and mystery films ever made. It remains influential in filmmaking, inspiring many imitators of its aesthetic, style, and premise of detectives investigating serial killers with distinctive methods and motives. The film's title sequence, which depicts the killer preparing for his actions later in the film, is considered an important design innovation and has also influenced later credit sequences, while the film's twist ending has been named as one of the best in cinematic history.</p><br/><h3>Plot</h3><p>In an unnamed city overcome with violent crime and corruption, disillusioned police detective William Somerset is one week from retirement. He is partnered with David Mills, a short-tempered, idealistic detective who recently relocated to the city with his wife, Tracy. One Monday, Somerset and Mills investigate an obese man who was forced to eat until his stomach burst, killing him. The detectives find the word \"gluttony\" written on a wall. Somerset, considering the case too extreme for his last investigation, asks to be reassigned to another case but his request is refused. The following day, another victim, who had been forced to cut one pound (0.45 kg) of flesh from his body is found; the crime scene is marked \"greed\". Clues at the scene lead Somerset and Mills to the sloth victim, a drug-dealing pederast who they find emaciated and restrained to a bed. Photographs reveal the victim was restrained for exactly one year. Somerset surmises the murders are based on the biblical concept of the seven deadly sins.</p><p>Tracy invites Somerset to share supper with her and Mills, helping the detectives overcome their mutual hostility. On Friday, Tracy meets privately with Somerset because she has no other acquaintances in the city. She reveals her unhappiness at moving there, especially after learning she is pregnant, and believes the city is an unfit place to raise a child. Somerset sympathizes with Tracy, having persuaded his former girlfriend to abort their child for similar reasons and regretting it ever since; he advises Tracy to inform Mills only if she intends to keep the child.</p><p>A comment by Mills inspires Somerset to research libraries for anyone checking out books based on the seven deadly sins, leading the pair to the apartment of John Doe. Doe unexpectedly returns home and is pursued by Mills, who is incapacitated after Doe strikes him with a tire iron. Doe momentarily holds Mills at gunpoint but soon flees. The police investigate Doe's apartment, finding a large amount of cash, hundreds of notebooks revealing Doe's psychopathy, and photographs of some of his victims; the cache includes images of Somerset and Mills by a person they believed was an intrusive journalist at the sloth crime scene. Doe calls the apartment and speaks of his admiration for Mills.</p><p>On Saturday, Somerset and Mills investigate the fourth victim, lust, a prostitute who has been raped with a custom-made, bladed strap-on by a man held at gunpoint. The following day, the pride victim is found; she is a model whom Doe facially disfigured and died by suicide rather than live without her beauty. As Somerset and Mills return to the police station, Doe arrives and surrenders himself. He threatens to plead insanity at his trial, potentially escaping punishment, unless Mills and Somerset escort him to an undisclosed location where they will find the envy and wrath victims. During the drive, Doe says he believes God has chosen him to send a message about the ubiquity of, and apathy toward, sin. Doe has no remorse for his victims, believing the shocking murders will force society to pay him attention.</p><p>Doe leads the detectives to a remote location, where a delivery van approaches. Somerset intercepts the vehicle, whose driver was instructed to deliver to Mills a package at this specific time. Somerset is horrified at the package's contents and tells Mills to put down his gun. Doe reveals he himself represents envy because he envied Mills' life with Tracy, and implies the package contains her severed head. He urges Mills to become wrath, telling him Tracy begged for her life and that of her unborn child, and takes pleasure in realizing Mills was unaware of the pregnancy. Despite Somerset's pleas, Mills, distraught and enraged, shoots Doe dead, completing Doe's plan. Police remove the catatonic Mills, and Somerset tells his captain he will \"be around\". Somerset says in voiceover: \"Ernest Hemingway once wrote: 'The world is a fine place, and worth fighting for'. I agree with the second part\".</p><br/><h3>Cast</h3><ul><li>Brad Pitt as David Mills: A well-meaning but impulsive homicide detective</li><li>Morgan Freeman as William Somerset: A veteran police officer disillusioned with his job</li><li>Gwyneth Paltrow as Tracy Mills: Detective Mills' pregnant wife</li><li>R. Lee Ermey as Police Captain: The detectives' grizzled superior</li><li>John C. McGinley as California: A SWAT team leader</li><li>Kevin Spacey as John Doe: A serial killer inspired by the seven deadly sins</li><li>Richard Roundtree as Martin Talbot: The district attorney</li></ul><p>Seven also features Julie Araskog as Mrs. Gould, John Cassini as Officer Davis, Reg E. Cathey as Doctor Santiago, Peter Crombie as Doctor O'Neil, Richard Portnow as Doctor Beardsley, Richard Schiff as Mark Swarr, and Mark Boone Junior as a \"greasy FBI man\". Hawthorne James appears as George the library night guard, Michael Massee portrays \"man in massage parlor booth\", Leland Orser plays \"crazed man in massage parlor\", Pamala Tyson portrays a thin vagrant outside Doe's apartment, and Doe's delivery man is played by Richmond Arquette.</p><p>Doe's victims include: Bob Mack as gluttony, a morbidly obese man who is force-fed until his stomach bursts; Gene Borkan as greed, a criminal attorney who is forced to cut off his own flesh; and Michael Reid MacKay as the sloth victim Theodore \"Victor\" Allen, a drug dealer and child abuser. Cat Mueller portrays the lust victim, a sex worker who is impaled with a bladed sex toy, and Heidi Schanz appears as model Rachel Slade, pride, who Doe disfigures. Writer Andrew Kevin Walker makes a cameo appearance as a corpse Somerset investigates during the film's opening scene; Morgan Freeman's son Alfonso appears as a fingerprint technician; and columnist George Christy portrays the police department janitor scraping Somerset's name from his door.</p><br/><h3>Production</h3><h4>Writing</h4><p>In 1986, aspiring screenwriter Andrew Kevin Walker moved from the suburbs of Pennsylvania to New York City, and described the \"culture shock\" of living in a city undergoing significant rises in crime and drug abuse. While working as a sales assistant for Tower Records in 1991, Walker began writing a spec script called Seven, which is set in an unnamed, bleak and gloomy city that was inspired by his \"depressing\" time in New York. Walker said; \"it's true that if I hadn't lived there I probably wouldn't have written Seven ... I think it's that way for anything—the right time and the right mood, and the right inspiration, whatever inspiration is. That's what's so scary about writing\". Film studios were eager for high concept spec scripts; Walker believed his thriller about police officers pursuing a serial killer driven by the seven deadly sins would attract attention and help begin a professional writing career.</p><p>Walker intended to leave the script's narrative open to interpretation to avoid invalidating the opinions of the prospective audience. He wanted to defy audience expectations, and leave them feeling \"violated and exhausted\" by the conclusion. According to Walker, \"there's lots of evil out there, and you're not always going to get the satisfaction of having any sort of understanding of why that is. That's one of the things that scares people the most about serial killers\". For inspiration for writing the killer, Walker recounted his own experiences of walking down city streets, and observing crimes and sins being openly committed on every corner, and asking what would happen if someone specifically focused on these sins. He had Doe surrender himself to the police because it would rob the audience and characters of the anticipated satisfaction, and make them uncomfortable before the finale.</p><p>In the early 1990s, Italian company Penta Film, under manager Phyllis Carlyle, optioned the script. Walker was paid the minimum fee allowed by the Writers Guild of America, which he described as not being \"fuck you money\" but enough to quit his job, relocate to Los Angeles, and work on Seven.</p><h4>Development</h4><p>To lead the project, Penta Film hired director Jeremiah S. Chechik, who had recently directed the successful comedy film National Lampoon's Christmas Vacation (1989) and was looking for a more serious project. Chechik and Penta Film mandated several script changes, including the removal of the bleak \"head-in-the-box\" ending, in which Tracy's severed head is delivered in a box. Given the option to refuse the requests and risk being replaced or the project canceled, Walker acquiesced and wrote a more-mainstream ending in which the detectives confront Doe in a church that is described as either on fire or burned out. In the revised version of the script, Doe embodies the sin of envy and kills Mills before being shot dead by Somerset, while a pregnant Tracy leaves the city. In a 2017 interview, Walker said he felt he was ruining his script and should have left the project. In total, he wrote thirteen drafts to meet the studio's demands. The project failed to progress; because the option was expiring and Penta Film was experiencing financial difficulties—eventually dissolving in 1994—the studio sold the rights to producer Arnold Kopelson, who took it to New Line Cinema. Chechik also left the project, and Guillermo del Toro and Phil Joanou were approached to replace him; Joanou rejected the offer because he found the story too bleak.</p><p>David Fincher was mainly known for directing popular music videos, such as \"Vogue\" and \"Who Is It\". His only feature film, Alien 3 (1992), had been a negative experience and the film was edited by its studio against Fincher's intent. Fincher disowned the film, saying \"I'd rather die of colon cancer than make another movie\". His agent, however, brought him the Seven script. Fincher was uninterested in the police procedural aspects but found himself drawn in by the gradual revelation of Doe's plans, saying; \"I found myself getting more and more trapped in this kind of evil ... and even though I felt uncomfortable about being there, I had to keep going.\" He determined the script matched his own creative sensibilities, particularly its \"meditation on evil and how evil gets on you and you can't get it off\", and uncompromising ending in which \" been dead for hours and there's no bullshit chase across town and the guy driving on sidewalks to get to the woman, who's drawing a bath while the serial killer sneaks in the back window\". Fincher expressed his interest to the studio, which realized he had been sent Walker's original script. New Line Cinema sent Fincher an up-to-date draft in which Tracy survives but Walker would only agree to direct the original script. He met with New Line Cinema's president of production Michael De Luca, who also preferred the original script, and they agreed to start filming that version in six weeks, believing further delay risked executives noticing and interfering with their plan.</p><p>Kopelson and studio executives made efforts to lighten Seven's tone and change the ending. Fincher was resistant to any changes, and was unwilling to compromise his creative control and vision. De Luca remained supportive of Fincher, and the original ending gained further backing as the project secured prominent actors, including Freeman, Pitt, and Spacey. Pitt said he joined Seven on condition the head-in-the-box ending was retained, and that Mills \" the killer in the end. He doesn't do the 'right' thing, he does the thing of passion.\" Pitt was upset the original ending to his previous film Legends of the Fall (1994) had been cut in response to negative test-audience responses. Kopelson was persuaded to support Fincher after being reassured the severed head would not be shown, saying \"it needed this horrendous event to kick off the last sin, wrath\" that would be discussed for decades. Walker said; \"there's nothing wrong with endings, it's just that the dark ending of Seven was what it was about. To change the ending to something else was to remove the very heart of the story.\"</p><p>Walker refined the script; his change included extending a chase sequence depicting Mills cautiously pursuing Doe, aiming to avoid typical cinematic chases in which characters frantically pursue their target. He said; \"I always thought, 'God, if someone was shooting at me, I would be terrified to turn any corner!' \" A shooting script was completed by August 1994.</p><h4>Casting</h4><p>Pitt had established himself as a credible film star following successes with Interview with the Vampire (1994) and Legends of the Fall, but Fincher had not considered him to portray Mills because \"I'd never seen Mills as particularly accomplished, and I was concerned that seemed too together. But when I met him, I thought, this guy is so likable he can get away with murder—he can do anything and people will forgive him for it\". Kopelson was aware of Pitt's popularity and importance to Seven's potential success; he shortened the pre-production schedule from twelve weeks to five to fit Pitt's schedule. Pitt rejected several offers from other films because he wanted to escape his typecasting as a romantic lead character in favor of something with a more \"documentary feel\" with urban settings and a focus on dialogue, akin to thriller films such as The Conversation (1974). He said; \"I just wanted to escape the cheese ... I came to find out had a lactose intolerance as well, so I was very happy about it\". Pitt described Mills as a well-intentioned \"idiot\" who \"speaks before he really knows what he's talking about\". He cut his hair for the role and lost weight to reduce the muscle he developed for Legends of the Fall. Sylvester Stallone and Denzel Washington rejected the role.</p><p>Walker named the character Somerset after writer W. Somerset Maugham. Walker envisioned William Hurt playing the character but Fincher cast Freeman; the studio was concerned pairing a black detective with a white one would make Seven seem derivative of the action film Lethal Weapon (1987). Robert Duvall, Gene Hackman, and Al Pacino rejected the role. The script was further modified after Pitt's and Freeman's castings to better match their acting styles; Mills was made more verbose and Somerset's dialogue was reduced, and made more precise and direct. Robin Wright auditioned for the role of Tracy and Christina Applegate rejected it before Paltrow was cast. Pitt had recommended Paltrow after being impressed by her audition for Legends of the Fall. Fincher also preferred Paltrow but those involved told him she would not be interested in a \"dark\" film like Seven. Fincher auditioned about 100 people before Pitt contacted Paltrow to meet with them. Fincher said Tracy is \"so important because it's the only sunshine we have in the film. This is the feel-bad movie of ... we needed someone who could take those little seconds she gets and fill them with soul, and that's what I'd always seen in performances\".</p><p>Fincher and Walker wanted Ned Beatty to play John Doe because of his resemblance to the 1969 composite sketch of the Zodiac Killer; Beatty declined, describing the script as the \"most evil thing I've ever read\". Michael Stipe, lead vocalist of the rock band R.E.M., was considered but filming dates conflicted with the band's tour. Val Kilmer declined the role; R. Lee Ermey auditioned but Fincher said his portrayal was \"completely unsympathetic\" and without depth. Kevin Spacey was preferred by Pitt but executives refused to pay his salary. Doe's scenes were initially filmed with an unknown actor portraying Doe; the filmmakers quickly decided to replace them and Pitt helped negotiate Spacey's involvement. Spacey, who filmed his scenes in twelve days, said; \"I got a call on a Friday night, and on Monday morning I was on a plane to Los Angeles, shooting on Tuesday\". Spacey wanted his name omitted from the film's marketing and opening credits to ensure the killer's identity remained secret. He said:</p><blockquote>I'd just done Swimming With Sharks (1994), The Usual Suspects, and Outbreak (both 1995) ... I knew that if any of those movies did well, my profile would be ... different. How would that affect my billing in Se7en? If I'm the third-billed actor in a movie where the top two billings are trying to find somebody and they don't find that somebody until the last reel, then it's obvious who that somebody is. It was a bit of a shit-fight for a couple of days, but I felt very strongly that it was the right thing to do for the movie. We finally won because it was a deal-breaker; I was either going to be on a plane to shoot the movie or I wasn't.</blockquote><p>The 480 lb (220 kg) actor Bob Mack made his film debut as gluttony, who was described as a \"very heavy guy face down in spaghetti\". Gene Borkan was cast to play the greed victim because the filmmakers wanted someone who resembled lawyer Robert Shapiro. He did not realize his character would already be dead and refused a request to perform nude, telling Fincher; \"I'll be naked if you're naked. Otherwise, you don't get that.\" On the set, when he realized what his scene entailed, Borkan renegotiated his salary, receiving \"five times\". Michael Reid MacKay's audition for the sloth victim involved him portraying a corpse that slowly turned his head towards the camera; his performance was deemed \"creepy\" enough. Set decorator Cat Mueller portrayed the lust victim after Fincher's assistant said she had the personality and body to portray a \"dead hooker\". She received $500 for six hours of filming over two days but described being nude in front of Pitt as a perk. Model Heidi Schanz was cast as the pride victim after the previous actor dropped out. Fincher, who was running low on time, wanted a model with existing headshots and pictures that could be displayed in the character's apartment. She said; \"even though I'm dead, I think it's the most glamorized murder\". The film's content made casting and crewing Seven difficult; Gary Oldman turned down an unspecified role, Fincher's former costume designer declined to work on the film, and talent agents refused to pass offers on to their clients, describing Seven as \"evil and misogynistic\".</p><h4>Filming</h4><p>Principal photography began on December 12, 1994, and concluded on March 10, 1995. Assistant director Michael Alan Kahn recalled the start of filming: \"I went up to Fincher and I said, 'Look at this! Look! It's here! We're here! You did it! We're shooting a movie ... isn't this amazing? ...' And he looked at me as though I were from outer space and said, 'No, it's awful ... now I have to get what's in my head out of all you cretins.' \" Walker was on set throughout filming to provide suggestions or on-spec rewrites but did not give Fincher much input, believing he should adapt the script as he wanted.</p><p>Location filming took place entirely in downtown Los Angeles. Fincher wanted to film in Oakland, California, because it had \"beautiful clapboard houses\" but the schedule would not allow for this. Rain often fell during filming; Fincher decided to film in rain to avoid continuity errors and because Pitt was only available for fifty-five days before he began filming 12 Monkeys (1995). Fincher also said the rain introduced an inescapable element for the characters because conditions were bad inside and outside, and that the rain made the film's city appear less like Los Angeles, which is associated with sunny weather.</p><p>Seven's aesthetic was influenced by films such as All That Jazz (1979), The Silence of the Lambs (1991), and The French Connection (1971), as well as the \"vulnerable\", over-the-shoulder viewpoint of documentary television show Cops. Cinematographer Darius Khondji named the crime thriller Klute (1971), as a significant influence because of its \"use of toplight ... widescreen compositions for intimacy rather than big vistas, the way that vertical strips of the city are shown in horizontal mode, the fragments of faces and bodies ... the look of Se7en has this heightened sense of realism—a realism that's been kicked up several notches and becomes its own style.\" Fincher chose one scene in Klute in which the only illumination is the character's flashlight, saying he disliked other films in which characters state visibility is low but the audience can clearly see the scene. Khondji used a mixture of lighting, using the warm light of Chinese lanterns to represent the past and present, and the cold light of Kino Flos to represent the future.</p><p>The studio was unhappy with the darkness of the dailies; Khondji suggested printing the footage brighter but Fincher refused to compromise. Available footage was made into a well-received promotional showreel for the theater-owner convention ShoWest, after which complaints about the darkness ceased. Khondji used Panavision Primo lenses, which offered a sharp image with good contrast, and Kodak film stocks that could capture the \"gritty\" interiors and deep blacks for night-time exteriors.</p><p>Khondji described the scene in which Mills pursues Doe as one of the most-difficult scenes to film due to its length, fast camera movements in rain, and tight, barely lit interior spaces. One segment had to be re-filmed because the location was too dark for the camera to capture Freeman's face. Pitt insisted on performing his own stunts for the scene; he slipped on a rain-slicked car bonnet, crashing through the windshield and sustaining injuries including cut tendons and nerves in his left hand; Fincher said he saw exposed bone. Pitt returned to the set a few days later, having received stitches and a forearm cast, which had to be written into later scenes. For scenes set prior to the chase, Pitt would keep his hand in his pocket or otherwise obscured to hide the injury. Pitt said he regretted not disrobing for a separate scene of Mills and Somerset shaving their chests to wear concealed listening devices. He disliked the public attention given to his body but later came to believe taking off his shirt off would have conveyed the growing partnership between Mills and Somerset.</p><p>The crew had to clear used condoms and crack pipes from the location of the sloth victim sequence, replacing them with prop crack pipes and air fresheners. The actors were not told the sloth victim was a person in costume; McGinley's shock at the body's movement is real. Lights with green color gels were shone through the window from the adjacent building to impart the scene with a green tint. Leland Orser, who portrays the man who is forced to kill the lust victim, deprived himself of sleep to achieve a \"deranged mindset\"; his scene was postponed so he stayed awake another night. He breathed rapidly between scenes to make himself hyperventilate on camera. The ending was scripted to take place directly beneath transmission towers, a location Doe selects to interfere with the police communications; the towers, however, interfered with the film crew's radios and the actors had to use cell phones to communicate with the crew from afar.</p><h4>Ending and post-production</h4><p>The film's ending remained a point of contention between New Line Cinema and the filmmakers; Fincher, intending to stun the audience, wanted to follow Mills shooting of Doe with a sudden cut to black but executives believed this would alienate audiences. Fincher instructed staff at a test screening to keep off the lights following the cut to black so the audience could take it in but his instructions were not followed. Afterward the screening, one female audience member walking by Fincher said; \"the people who made that movie should be killed\". According to Fincher, the screening invitation said; \"Would you like to see a new movie starring Brad Pitt and Morgan Freeman?\", both of whom were known for films very different in tone to Seven; Fincher said; \"I don't know what the fuck they thought they were gonna see ... but I'm telling you, from the reaction of the people in there, they were bristling. They couldn't have been more offended.\" Executives wanted a mainstream conclusion in which Mills and Somerset pursue Doe and a kidnapped Tracy, who would survive. According to Pitt; \" 'You know, he would be much more heroic if he didn't shoot John Doe—and it's too unsettling with the head in the box. We think maybe if it was dog's head in the box.' \" Freeman preferred a storyboarded sequence of Somerset killing Doe, sparing Mills from losing his career as well, but Pitt believed Mills had to kill Doe and test audiences preferred that version. Another alternative ending depicted Mills shooting Somerset to stop him killing Doe first. Fincher and Pitt refused to compromise on the head-in-the-box ending but settled for a longer epilogue showing Mills being arrested and Somerset delivering a concluding narration, offering some optimism.</p><p>Pitt and Fincher were unhappy with the car-ride scene leading into the ending because the dialogue had to be overdubbed because too much ambient sound had been picked up during filming. Pitt believed this caused the scene to \"lose its breath\", affecting the pacing and emotion. The helicopter scenes were also filmed in post-production because there was no time during principal photography; the studio agreed extra time and funding if the scenes were deemed necessary. Because these scenes were filmed several months later that the rest of the film, the green ground had turned brown and the ground-based scenes had to be color-corrected to match the new footage. The opening credits were scripted to be set over footage of Somerset visiting a countryside home he intended to purchase for his retirement, taking a piece of the wallpaper he would carry through the film, before returning to the city by train. This was intended to create a stark contrast between the countryside and the darkness of the city but there was insufficient budget to film it. As a result, scenes of Somerset looking at the wallpaper piece had to be cut.</p><p>Richard Francis-Bruce edited the 127-minute theatrical cut. His style focused on \"having a motivated cut\", believing every cut needed to be done with a specific purpose. For the finale, he introduced more rapid cuts to emphasize the tension as Doe's plan is revealed, and a brief, four-frame insert of Tracy as Mills pulls the trigger to compensate for not showing the contents of the box. To emphasize the darkness, Fincher and Khondji used an expensive, lengthy bleach bypass chemical process that retained some of the silver that would normally be removed from the film stock. The silver created a luminous effect in light tones and deeper, darker colors. Of the 2,500 prints sent to theaters, only a few hundred used the process.</p><p>Seven was budgeted at $30–$31 million but Fincher persuaded studio executives to provide further funding to achieve his vision for the film, eventually pushing it $3 million over budget, to $33–$34 million, making it New Line Cinema's most expensive film at that point. A studio employee said executives \"would go into these meetings with, saying, 'Absolutely not, not a penny more' ... but he was so relentless and persuasive that they'd come out all ga-ga-eyed, and give him more money.\" About $15 million of the budget was spent on below-the-line costs.</p><h4>Music and sound</h4><p>Fincher hired Howard Shore to score Seven based on his score for The Silence of the Lambs (1991). Shore said Fincher would attend recording sessions but rarely interfered with Shore's process. The score, which was performed by an orchestra of up to 100 musicians, combines elements of brass, percussion, piano, and trumpets. \"Portrait of John Doe\" serves as the central theme with two cue notes; a rising version is used for Tracy's appearances. Shore described the film's ending as having a \"visceral, kind of primal effect on me\"; he incorporated his reaction into the sequence's score, providing little accompaniment during the dialogue between Mills, Somerset, and Doe, but using it to punctuate significant moments such as Somerset opening the box. Shore said; \"the music starts, and it turns the scene, it turns it into John Doe's perspective ... the music enters, and you realize, the look of the horror on his face, it's a chilling moment\".</p><p>Shore's opening theme \"The Last Seven Days\", which is described as a more-upbeat piece, was replaced with Nine Inch Nails's song \"Closer\", which was remixed by Coil and Danny Hyde. David Bowie's song \"The Hearts Filthy Lesson\" is used for the end credits. Seven features songs including \"In the Beginning\" by The Statler Brothers, \"Guilty\" by Gravity Kills, \"Trouble Man\" by Marvin Gaye, \"Speaking of Happiness\" by Gloria Lynne, \"Suite No. 3 in D Major, BWV 1068 Air\" by Stuttgarter Kammerorchester and Karl Münchinger, \"Love Plus One\" by Haircut One Hundred, \"I Cover the Waterfront\" by Billie Holiday, \"Now's the Time\" by Charlie Parker, and \"Straight, No Chaser\" by Thelonious Monk.</p><p>Fincher hired his friend Ren Klyce as sound designer. They inserted sounds on the outside of each frame, such as rain or screaming, to create a psychological impression that terrifying things are occurring even when the audience cannot see or escape it. Klyce and sound designer Steve Boedekker also produced the music that is heard at the entrance to the sex club where the lust victim is murdered.</p><br/><h3>Design</h3><h4>Style and set design</h4><p>Fincher, Khondji, production designer Arthur Max, and costume designer Michael Kaplan collaborated on establishing a unified vision for the art direction. Fincher established the design rules for the film, saying: \"This is a world that's fucked up and nothing works\". He wanted every design to look neglected and in a state of decay. The photography of William Eggleston and Robert Frank influenced Fincher, who focused on \"coolness\", making the visuals simultaneously gritty, stylized, classic, and contemporary; Khondji said Frank's style could be seen in Seven's very bright exteriors and dark interiors. Many of the film's interior scenes were underexposed to create a stark contrast, which made the exteriors stand out more. Interior lighting was often provided by external sources, using only a few interior artificial lights. The final scene with Mills, Somserset, and Doe, has inconsistent lighting because the actors were always lit from behind by the sun regardless of their placement in the scene, which Khondji described as \"a bit of a nightmare and never realistic in terms of continuity\".</p><p>Fincher wanted precise staging for every scene to make the audience feel as if they were in the location. Believing it was important to create limitations to challenge himself, Fincher had sets built without removable walls, and the crew had to film within their confines. Doe's murder scenes were influenced by photography, such as the work of Joel-Peter Witkin. The \"gluttony\" set was wrapped in plastic to contain the cockroaches; a cockroach wrangler was used to help control them. The sloth scene in particular was influenced by the work of painter Edvard Munch, drawing on the green and \"claustrophobic\" imagery. The ceilings of the sex club in which the lust victim is murdered were lowered to make the space more claustrophobic, andwas sprayed on the walls to give texture and to imply they are covered in bodily fluids. A former bank was used as the library and 5,000 books, which were supplemented with fiberglass replicas, were rented to fill the space. The shaking in Mills apartment, which is caused by a passing train, was created using gas-powered engines attached to the set. Walker's script extensively described Doe's home, whose windows are painted black for privacy and a drawer is filled with empty painkiller bottles to help Doe cope with regular headaches.</p><h4>Victims</h4><p>Rob Bottin led development of practical effects. He researched crime-scene photographs and police evidence files, observed an autopsy, and studied the effects of obesity to realize his designs. For the gluttony victim, Mack spent up to 10 hours a day having makeup and prosthetics applied. A scuba-like device was used to let Mack breathe while face-down in spaghetti. Mack said he was unaware he would be surrounded by live insects until reading the daily call sheet and noticing a \"cockroach wrangler\"; Pitt would flick some roaches off Mack between takes. The character's autopsy used a fiberglass replica with a deliberately enlarged penis; Fincher said after Mack spent so long in makeup for 30 seconds of screen time, he could \"at least give him a huge cock.\"</p><p>Bottin's team spent 11 days experimenting on the aesthetic and prosthetics for the sloth victim, who MacKay portrayed. MacKay was 5.5 ft (170 cm) tall and weighed 96 to 98 lb (44 to 44 kg) during filming, offering a slight frame for the emaciated character. The filmmakers asked him to lose more weight but he refused. The effects team made a body cast of MacKay to develop rubber prosthetics that could be applied all over his body. The appliances were painted to appear bruised and scarred, veins were airbrushed onto MacKay, and he was fitted with gelatin sores, overgrown fingernails, skeletal teeth, and matted hair. The process took up to 14 hours, requiring MacKay to begin at 5 am for filming at 8 pm. He was taken to the set in costume; Freeman said \"you don't look so good\". MacKay described filming the scene as \"real heavy-duty\", and was left \"breathing very hard and crying\". He had to remain fairly still during four hours of filming, having to limit his breathing to prevent his stomach rising and falling, and the cold on set was worsened by makeup artists repeatedly spraying his body with water. Unable to move, he tensed his muscles to warm himself. He described the moment he was permitted to cough in McGinley's inspecting face as a \"great relief\" because he could move and breathe again.</p><p>For Schanz's pride victim, Fincher added blood to her while her nose was taped to the side and her face was covered in gauze. To secure the film's release, several scenes of Bottin's effects work had to be cut. Fincher described Seven as psychologically violent, implying violence without overtly showing it. In the opening scene, Walker portrays a corpse lying in a pool of blood; he said the blood was very cold and he had a minor panic attack once in place because he was worried about moving and ruining the shot.</p><h4>Title credits</h4><p>Following the removal of the planned opening train-ride scene with Somerset, Fincher needed a temporary title sequence to screen Seven for studio executives. He recruited R/GA designer Kyle Cooper and his team to assemble a montage slideshow reflecting Doe's perspective. This helped establish the character and his threat earlier in the film because Doe does not appear until Seven's final act. The sequence was set to the \"Closer\" remix at Fincher's request.</p><p>The sequence was well-received by executives, who suggested retaining it for the theatrical release. Fincher did not want to appear to be accepting their suggestion and instructed Cooper to develop a new concept; Cooper persuaded Fincher to use a more-elaborate and detailed version of his slideshow. Cooper focused on Doe's elaborate journals, which are briefly glimpsed in the film, while Fincher suggested the sequence should depict Doe. Fincher wanted Mark Romanek to direct the sequence, being a fan of his music video for \"Closer\" and sharing similar design sensibilities but Cooper secured the role because of his previous experience on similar title sequences. Fincher told Cooper; \"all I want is for the audience to want to run screaming from the theater during the title section\".</p><p>The title sequence depicts Doe's preparations and routines for his murderous plans, such as cutting off his fingertips, processing photographs in his bathtub, and making tea. This was inspired by Cooper's appreciation for the \"elegant\" way Doe stirs his tea following his surrender. The sequence focuses on Doe writing his journal and crossing out words such as \"pregnancy\" and \"marriage\", and other elements representing a \"perfect life\", which he does not believe people deserve. Fincher said; \"it was a way of introducing the evil. The idea was that you're watching title sequences from the mind of somebody who's lost it ... won't understand while they're watching it, but they'll get it later\". Clive Piercy and John Sabel made Doe's journals, which cost tens of thousands of dollars each to fill with text and images; about six complete journals were made, supplemented by blank ones on shelves. Artist Wayne Coe storyboarded the sequence, which Harris Savides filmed and Angus Wall edited. Cooper regularly conferred with Wall on ideas, and spent the night before filming locating items such as fish hooks and loose hairs from his drain, which he believed would make interesting inclusions.</p><p>Filming took place over eight days, including two days filming a hand-model stand-in for Doe. Fincher was upset at the casting because the model's hands were shorter and chunkier than Spacey's. A further five weeks were spent assembling the sequence. Although digital options were available, Cooper's team chose to assemble the sequence by hand, believing any irregularities and accidents in the images would enhance the overall aesthetic, and manually added scratches, tears, and pen marks direct to the film negative. Fincher and Cooper devised a rough-looking text for the credits to appear as if written by a \"disturbed hand\". Fincher said: \"I always liked the idea that the titles would be written by Doe, hand-lettered ... wanted to have them look personal, not typeset. I liked that it wasn't slick.\" The text was etched onto a black-surfaced scratchboard and visually manipulated while being transferred to film to add a smear effect combined with variants of the same text achieved by placing the text over a light box and filming them over-exposed, creating an animation-style effect. \"Disquieting\" sounds were added throughout the sequence at a low frequency, such as barking dogs and screams. The title sequence cost $50,000.</p><br/><h3>Release</h3><h4>Context</h4><p>The theatrical box office of 1994 achieved record grosses, with nine films earning more than $100 million and the highest attendance (1.29 billion) since 1960 (1.3 billion). By 1995, however, the average cost of making and marketing a film had doubled since 1990, reaching $50.4 million, making turning a profit more difficult. The rising salary cost of actors was a contributing factor; studios vied to secure popular actors such as Harrison Ford, Jim Carrey, Tom Cruise, and Arnold Schwarzenegger who could generally guarantee a minimum level of box-office success and held broad appeal outside of the United States and Canada. If notable stars were unavailable, studios were forced to pay exorbitant salaries for less-well-known stars and pay other cast lower salaries to offset costs. In 1995, theatrical box-office revenue was falling; the first quarter was about $90 million lower than the same period in 1994. Markets outside of the U.S. and Canada were growing, accounting for 41% of a film's total revenue—including theatrical and home media profits—and outperformed the U.S. and Canadian box offices for the first time in 1994. Anticipated films such as Batman Forever, Crimson Tide, and Pocahontas were scheduled for release alongside Waterworld, the most-expensive film of its time. New Line Cinema had low expectations for Seven based on middling scores from test audiences.</p><h4>Marketing</h4><p>New Line Cinema's marketing president Chris Pula called the advertising campaign for Seven \"risky\" because it had to \"prepare people\" for the film's dark, violent content while making it a topic of discussion among potential audiences. Early trailers and newspaper, television, and radio advertisements focused on the seven sins, presenting Seven as an \"edgy\" prestige film rather than a jumpscare-style horror. Entertainment professionals believed violent or horrific films had a limited appeal and rarely received positive reviews. Fincher's public image had been tarnished by the failure of Alien 3, and although Freeman and Pitt were proven stars who were capable of attracting audiences, New Line Cinema struggled to capitalize on Pitt's popularity. Pitt's core audience, teenage girls, were not the film's target audience and research showed young men would avoid taking a romantic partner to films featuring Pitt because they felt \"threatened\" by his appeal. The positive word-of-mouth following Seven's theatrical release led the marketing campaign to shift focus toward targeting Pitt's female fans.</p><p>The premiere of Seven took place on September 19, 1995, at the Academy of Motion Picture Arts and Sciences in Beverly Hills, California. The event was attended by over 800 guests, including Fincher, Freeman, McGinley, Spacey, Tia Carrere, Elliott Gould, Matthew Modine, Lori Petty, Lou Diamond Phillips, Michael Rapaport, Eric Roberts, Robert Rodriguez, Steven Seagal, John Singleton, Christian Slater, Quentin Tarantino, and Jennifer Tilly.</p><h4>Box office</h4><p>Seven was released in the United States and Canada on September 22, 1995. During its opening weekend, Seven earned $14 million across 2,441 theaters—an average of $5,714 per theater—making it the number-one film of the weekend, ahead of the debut of Showgirls ($8.1 million), and To Wong Foo, Thanks for Everything! Julie Newmar ($4.5 million), in its third week of release. Seven had the highest-grossing September opening weekend of its time, replacing 1991's Freddy's Dead: The Final Nightmare ($12.6 million). The successful opening was credited to the marketing campaign overcoming audience skepticism and Pitt's popularity with males and females—although a higher percentage of the opening audience were male—and the competing action films. New Line Cinema distribution executive, Mitch Goldman had preponed the release date of Seven to avoid competition and strategically opened the film in more theaters than usual to target suburban and small-town locations where Pitt's recent films had fared well.</p><p>Seven remained number one in its second weekend, ahead of the debuts of Halloween: The Curse of Michael Myers ($7.3 million) and Devil in a Blue Dress ($5.4 million), and in its third weekend ahead of the debuting Assassins ($9.4 million) and Dead Presidents ($8 million). Seven remained the most-popular film until its fifth weekend, falling to number 3 behind the debuts of Get Shorty ($12.7 million) and Now and Then ($7.4 million), and was among the ten-highest-grossing films for nine weeks. Seven had grossed about $87 million by the end of December, when it received a wide re-release in select locations to raise its profile during the nomination period for the 1996 Academy Awards. The re-release helped raise Seven's box-office revenue to about $100.1 million, making it the ninth-highest-grossing film of 1995 behind Casper ($100.3 million), Jumanji ($100.5 million), GoldenEye ($106.4 million), Ace Ventura: When Nature Calls ($108.4 million), Pocahontas ($141.6 million), Apollo 13 ($173.8 million), Batman Forever ($184 million), and Toy Story ($192.5 million). According to estimates by industry experts, as of 1997, the box office returns to the studio minus the theaters' share was $43.1 million.</p><p>Seven also performed well outside the U.S. and Canada, receiving positive audience reactions and successful debuts in Australia ($1.8 million), South Korea ($808,009), Seoul ($961,538), New Zealand, and the Netherlands. Seven is estimated to have earned a further $227.2 million, giving it a worldwide gross of $327.3 million, and making it the seventh-highest-grossing film worldwide behind Apollo 13 ($335.8 million), Batman Forever ($336.5 million), Pocahontas ($347.1 million), GoldenEye ($356.4 million), Toy Story ($365.3 million), and Die Hard: With a Vengeance ($366.1 million). Seven was an unexpected success and became one of the most-successful and most-profitable films of 1995.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Critics such as Roger Ebert and Desson Howe described Seven as an intelligent, well-made film that could comfortably stand alongside other thrillers. Others compared Seven unfavorably with The Silence of the Lambs and The Usual Suspects, saying Seven lacks the other films' intelligent narrative, and takes itself too seriously as an examination of evil instead of a \"silly piece of pulp\". The Orlando Sentinel said, however, Seven offers a \"terrific film-noir atmosphere\" and excellent performances, with The Seattle Times saying the film would be \"unendurable\" without Freeman and Spacey.</p><p>Critics unanimously praised Freeman's performance. Terrence Rafferty and Kenneth Turan wrote Freeman's \"exceptional\" performance is mainly responsible for making Seven watchable in spite of itself. Howe and James Berardinelli said the performance elevated Pitt's own to appear \"actorly\", although Freeman often steals every scene in which he appears, providing a fresh take on an otherwise-cliché role. Reviews of Pitt's performance were polarized between those who found it \"energetic\" and impressive and those who believed the role was beyond his acting abilities. Some reviewers said Pitt's performance continued his successful transition to more-serious roles from those based mainly on his appearance, although Howe said Pitt's presence does more for Seven than his acting. The Orlando Sentinel said what could have been a cliché role was saved by Mills not being inept or inexperienced, just out of his depth in this case. Some reviews said the character is underdeveloped, pointless, stupid, and not particularly likeable, and that Pitt's performance lacks the subtlety or effectiveness to compensate. Critics positively received Paltrow's performance, saying she made the most of her limited screentime and was generally underused while considering the character a \"flimsy contrivance\". Spacey's performance was also praised for its creepy, understated portrayal of an intelligent character who does not undermine himself with \"a moment of sheer stupidity\".</p><p>Fincher's directorial style was praised for its \"striking craftmanship\" and \"stunning\" visuals that often simultaneously thril and exasperate the viewer. In contrast, Rafferty said his style is less effective when stretched over the film's runtime, and that Fincher mistook darkness for profundity and chose style over coherence. Although Siskel considered Walker's script to be smartly written, several critics were less enthusiastic, finding the dialogue trite, many scenes implausible, and character motivations weak. Jami Bernard and Richard Schickel wrote Seven lacks many of the essentials prevalent in its genre such as suspense, witty dialogue and cathartic humor, and the psychological depth to match the intellectual thrills of The Silence of the Lambs.</p><p>The violent content of Seven was generally negatively received. Critics such as Berardinelli and Gene Siskel found the gore excessive and \"gratuitous\". While some found the violent visuals to be tiresome and detracting, others said Fincher skilfully avoided showing the violence that led to the deaths, preventing them from distracting from Seven's more enjoyable aspects. According to Ebert and Turan, however, Seven would be too disturbing for many viewers. Fincher responded: \"I didn't set out to piss off the people who are upset. I was told that Michael Medved wrote that the movie was evil, but I'm sure he slows down when he passes an accident just like everyone else. Death fascinates people, but they don't deal with it.\" Howe and Owen Gleiberman said the ending is \"like an act of treachery against the viewer\", undermining any hope for a positive outcome; and Barry Norman said it denies the audience \"even of the final comfort they fully deserve\". Ebert, however, found the ending to be \"satisfying\" but underwhelming compared to the film's earlier events. Audiences polled by CinemaScore gave the film an average grade of \"B\" on a scale of A+ to F.</p><h4>Accolades</h4><p>Seven received one nomination at the 68th Academy Awards for Best Editing (Richard Francis-Bruce), and Walker was nominated for Best Original Screenplay at the 49th British Academy Film Awards. At the MTV Movie Awards, Seven received three awards; Best Movie, Most Desirable Male (Pitt), and Best Villain (Spacey). New Line Cinema re-released Seven in Westwood, Los Angeles, California, on December 26 and in New York City on December 29, 1995, in an unsuccessful attempt to generate Academy Award nominations for Freeman, Pitt, and Fincher.</p><br/><h3>Post release</h3><h4>Home media</h4><p>Seven was released on VHS, DVD, and Laserdisc in 1996. A two-disc special edition DVD that was released in 2000 introduced additional features including a remastered picture scanned from the original film negative, extended and deleted scenes, the original opening with Somerset and cut-to-black ending, production photographs and designs, and storyboards for an alternative ending. The release also includes four commentary tracks: Pitt, Fincher, and Freeman discussing Seven; a discussion between Fincher, De Luca, Francis-Bruce, Walker, and film-studies professor Richard Dyer; Khondji, Max, Dyer, Francis-Bruce, and Fincher; and an isolated music and effects score with commentary by Shore, Klyce, Dyer, and Fincher. The film was released on Blu-ray Disc in 2010; the release features remastered visuals and contains all of the additional content in the special edition, with an additional collectible DigiBook version containing production notes and photographs.</p><p>The soundtrack of Seven was released in November 1995; the 11-track compact disc and cassette-tape release contains several of the songs used in the film such as \"Guilty\" and \"In the Beginning\", and two pieces of the score (\"Portrait of John Doe\" and \"Suite from Seven\") but omits \"Closer\" and \"The Hearts Filthy Lesson\". A bootleg recording of the score was released in the late 1990s and an official debut of the full 16-piece score was released in 2016.</p><h4>Other media</h4><p>A novelization of Seven that was written by Anthony Bruno was released alongside the film in November 1995. A seven-issue comic-book series was released between September 2006 and October 2007 by Zenescope Entertainment; serving as a prequel to the film's events of the film, the comic book focuses on Doe and the planning of his crimes.</p><br/><h3>Thematic analysis</h3><h4>Apathy and hope</h4><p>The apathy of the film's unnamed city's inhabitants is a central theme in Seven. Somerset does not believe the city can be saved, intending to retire beyond its confines, and telling Mills women are taught to yell \"fire\" rather than \"help\" because people are more likely to pay attention if they selfishly think themselves in danger. Taubin described the city as an infection point for corruption in which signs of violence and decay are omnipresent in its dark corners and rain, television reports, fights, screams, and children in impoverished apartments. Dyer compared the near-constant rain to films such as Blade Runner (1982), as a near-inescapable presence, which in Seven can represent sin seeping into every gap. The city's bleak aesthetic implies a layer of moral decay and indifference by its inhabitants that enables Doe's plan. Somerset has not stopped caring but has become as apathetic as those around him because of the futility of his efforts. Seven reinforces this in several scenes, such as the dismissal of his concerns a child witnessed a murder, the police captain's indifference to a mugger needlessly stabbing out his victim's eyes, and the sex club manager who dislikes his role but sees no alternative. Somerset tries to spare Tracy from the influence of the city by advising her to leave with her unborn child.</p><p>Both Somerset and Doe perceive the ubiquity of sin and indifference toward it. There are parallels between the characters, both of whom live alone, are devoted to their work, and have no meaningful relationships. Although there is mention of Somerset's former partner and some degree of respect for his colleagues, he tells Tracy; \"anyone who spends a significant amount of time with me finds me disagreeable\". Doe's apartment is a reflection of his isolation from society. They differ, however, in their response to sin; Somerset has surrendered to apathy and sorrow, while Doe feels contempt for society and has assumed a role as its punisher. It is implied Somerset was once passionate about his work until he realized he could not change things; Doe is dedicated and passionate, believing wholeheartedly in the change his work will bring. Somerset has never killed anyone, and retains a spark of hope for humanity's improvement, while Doe kills freely, believing humanity is beyond saving. When Mills tells Doe he is killing innocent people, Doe replies:</p><blockquote>only in a world this shitty could you even try to say these were innocent people and keep a straight face. But that's the point. We see a deadly sin on every street corner, in every home, and we tolerate it. We tolerate it because it's common, it's trivial. We tolerate it morning, noon, and night. Well, not anymore.</blockquote><p>Mills and Somerset are contrasting characters in terms of temperament, morality, intelligence, and personal connections. Somerset is analytical, wise, experienced, and meticulous while Mills is young, messy, and inexperienced but full of potential. Mills is optimistic and relatively light-hearted, choosing to move to the city because he believes he could have a positive influence until everything is taken from him. According to Goldberg, Mills and Tracy are naïve to the city's corruption; for example, they are tricked into renting an apartment that experiences constant shaking from nearby trains. Dyer said Tracy in particular represents potential virtue but her impact is reduced because she is infrequently used to conceal her eventual fate.</p><p>Doe's plan works, shocking Somerset out of his apathy, and inspiring him to defer his retirement and fight for a better future. Walker said the ending is:</p><blockquote>about \"optimist Mills\" ... going up against this pessimistic kind of world-weary detective in Somerset ... those dramatically opposed points of view are pushing and pulling each other throughout the story. And then once pessimism is confirmed, even to the optimist who's been arguing that the fight is always worth fighting, will the pessimist in the light of confirmation of all his worst predictions, will he stay or will he walk away?</blockquote><p>Rosenbaum described it as a \"touching, old-fashioned faith in the power of good to reassert itself\", tempered by the fact the hope is inspired by a self-martyred serial killer. He said Seven chose style over substance, giving the overall message we \"remain exactly where we are\". Dyer compared Doe to Hannibal Lecter in The Silence of the Lambs, in terms of ability to out-think and manipulate the authorities combined with his artistic method of arranging his murders, but that they are contrasted by their different social statuses; Lecter being an educated professional with a preference for luxury, while Doe is seemingly self taught, unemployed, and obsessed with his mission. Rosenbaum, however, said unlike The Silence of the Lambs, Seven does not \"exploit its psycho killer for cheap laughs or blind hero worship\". Nayman found Seven problematic, believing it venerates Doe as having a valid criticism of society.</p><h4>Religion and order</h4><p>Somerset describes Doe's murders as his sermons to the masses. According to Dyer and Saunders, Doe is conducting a violent crusade, demonstrating the consequences of moral decay and sinning, based on his own interpretation of Christian ideology, in a city rather than the biblical Sodom and Gomorrah. Writer Patricia Moir said theorists in the late 1990s believed a growing trend in North America resulted in the decay of social meta narratives of order that were created by religion, science and art, in turn diminishing societal norms; and that in absence of these paradigms, all that remains is the chaos of existence. Somerset tries to create order using the ticking of a metronome to disguise the disordered noise of sirens and screams outside his apartment. According to Dyer, Somerset's smashing of the metronome is him acknowledging he can no longer ignore the city's darkness. Doe creates order by filtering literature about the seven deadly sins and works by authors such as John Milton through a lens of religious fanaticism. He believes his purpose is God-given, which is reflected in the opening credits depicting Doe cutting the word \"God\" from a dollar bill; Kyle Cooper said, \"I hesitated on that one but decided to do it because John Doe took it on himself to play God\".</p><p>Doe rationalizes everyone is guilty of sin or wishing ill on other sinners. According to Dyer, Doe is conscious he is also a sinner so his plan involves his own death. Goldberg said Doe is the true sin of wrath, which is evident in his violent acts; to complete his plan, however, Doe must make Mills \"become\" wrath, and gives himself the sin of \"envy\". His resigned acceptance of the sin is, according to Goldberg, because there is no other sin for him to take and he is conscious sins will not end with his death. Doe's transferring of wrath to Mills also demonstrates the infectiousness and pervasiveness of sin. Mills' killing of Doe can be considered an act of good and justice, eliminating a remorseless force of evil; Mils, however, commits the act purely for revenge. Film professor Richard Dyer says Doe does not know how to conclude his plan until meeting with Mills while disguised as a photographer, during which Mills displays his wrath. Writer Shaina Weatherhead said Seven foreshadows the importance of the wrath and envy throughout, identifying the color red as a representation of wrath and green as a representation of envy; these colors are frequently seen—Somerset has a red lamp, Mills drinks from a green mug, and there are green buildings with red address numbering in the background.</p><p>Seven includes subtle references to the number seven, reinforcing the religious subtext; Doe's plan culminates on a Sunday, the seventh day of the week and the biblical day of rest, on which Doe's package for Mills is delivered at 7:01 pm. While researching Doe, Somerset references material including \"The Parson's Tale\" by Geoffrey Chaucer, which discusses penance; Dante Alighieri's Divine Comedy and its seven terraces of purgatory; a Catholic dictionary; and a reference to seven children being slain. There are also references to art such as a stack of spaghetti cans resembling Campbell's Soup Cans by Andy Warhol. Journalist Kim Newman said each of Doe's kills is arranged as an artistic piece dedicated to each sin. Commentary appears on the excesses of performance art and culture of celebrity; Mills refers to Doe as a \"movie of the week\" and a \"fucking T-Shirt\", implying his legacy will be brief before fading into obscurity. Moir said Seven provides no final answers about Doe's legacy but implies things have potentially only worsened.</p><br/><h3>Legacy</h3><h4>Critical reassessment</h4><p>Seven is now regarded as one of the best thriller, crime, and mystery films ever made. Some publications have listed Seven among the greatest films of all time. A 2014 poll of 2,120 entertainment industry professionals by The Hollywood Reporter ranked Seven the eighty-fifth-best film of all time. Review aggregator Rotten Tomatoes offers a 82% approval rating from the aggregated reviews of 85 critics, with an average score of 7.9/10. The website's critical consensus says: \"A brutal, relentlessly grimy shocker with taut performances, slick gore effects, and a haunting finale\". The film has a score of 65 out of 100 on Metacritic based on 22 critics' reviews, indicating \"generally favorable reviews\".</p><p>Retrospective reviews have said Seven retains its appeal over its peers due to its bleak, often imitated but rarely equaled ending, and Fincher's story-focused directorial style. Critic Matt Goldberg described Seven as timeless because of its stylized reality that is not linked to any particular time or place, and its lack of popular culture references, advertisements, and focus on technology. Discussing Seven's lasting positive legacy as a thriller, Walker said:</p><blockquote>I know a lot of people hate Seven and think it's just garbage, so it's good to be humbled in that way. I'm really proud of it ... Looking back at the time that's passed, I feel extremely lucky that they never managed to make a sequel to it ... I've been lucky that they've not managed to make a prequel to it, which, in my opinion, sucks all of the kind of meaning and energy out of who and what John Doe represents. I love that it's still a standalone piece.\"</blockquote><p>Seven is included in the 2013 film reference book 1001 Movies You Must See Before You Die, and has been listed among Pitt's and Fincher's best films.</p><h4>Cultural influence</h4><p>Seven helped Pitt's transition into more-serious and dramatic acting roles. He and Paltrow became romantically involved before the film's release, and Pitt would work again with Fincher on films such as Fight Club (1999). It also established Freeman as a mentor-type figure, an archetype he reprised in many later projects. After the failure of Alien 3, Seven revitalized Fincher's film career, establishing him among the most iconoclastic Hollywood directors of his generation; over the next few years, he directed The Game (1997), Fight Club, and Panic Room (2002). Walker and Shore worked with Fincher on several other projects. Describing the personal impact on himself, Walker said; \"ten years down the line, if nothing else got produced. I'd still have this great movie on video ... when I'm run out of town, living my old age, running a miniature golf shop, I can always have what I've dreamt of having since I was very young.\" In a 2022 interview, MacKay, who played the sloth victim, said he was still earning \"healthy residual payments\" for his role, and was occasionally recognized in public by fans. He said: \"people still think they used a dummy in that scene ... I get that a lot. But that was me.\"</p><p>Seven inspired many filmmakers, and is considered influential on crime-based films and television shows that replicated its grim aesthetic, body horror imagery, lighting, and premise of disenchanted detectives pursuing criminals with distinctive killing methods and motivations, including Kiss the Girls (1997), The Bone Collector (1999), Along Came a Spider, The Pledge (both 2001), the Saw series (2003), and television series Prodigal Son (2019–2021). Collider said Seven caused a resurgence in faith-based horror, supernatural, and apocalyptic mystery films. The superhero film The Batman (2022) has a similar style and tone to Seven; Rolling Stone called it \"part superhero blockbuster, part 1970s-antihero homage, and part Seven remake\". Seven's use of alternative music by Nine Inch Nails is also seen as contributing to increased use of similar songs in films such as Final Destination (2000), Lara Croft: Tomb Raider (2001), and Resident Evil (2002).</p><p>New York Times called the title credit sequence for Seven \"one of the most important design innovations of the 1990s\". Art of the Title described it as the beginning of a \"renaissance in title design, particularly in the horror genre, and its influence is evident over two decades after Seven's release. In 2011, IFC ranked the sequence as the third-best-ever behind those of Vertigo (1958) and A Hard Day's Night (1964), and its style can be seen in the opening credits of films such as The Bone Collector, Red Dragon, and Taking Lives (2004).</p><p>The film's twist ending is considered one of the best in cinematic history. Pitt's line \"What's in the box?\" as he asks Somerset to confirm the contents of Doe's box, has become iconic, and is used in popular culture and memes. Walker said; \" one of the reasons I think Seven did well ... because people went in and they did not know in the first ten minutes exactly how the movie was going to end\". Although it is only implied Tracy's head is in the box, Fincher recalled an encounter with a woman who said: \" 'There is no need to make a stand in of Gwyneth Paltrow's head to find in the box. You don't need to see that.' And I said, 'Well, we didn't.' And she said, 'Oh yes, you did.' So, the imagination, if properly primed, can do more than any army of makeup artists.\" Several publications have named John Doe as one of the great cinematic villains.</p><br/><h3>Sequel</h3><p>In 2002, New Line Cinema proposed a sequel named Ei8ht that would be based on a repurposed spec script titled Solace by Ted Griffin about a psychic serial killer who is pursued by a similarly psychic detective, Somerset. The idea was abandoned after principal Seven cast and crew, including Freeman and Pitt, expressed no intention to return for a sequel. Fincher said; \"I would be less interested in that than I would in having cigarettes put out in my eyes\". The script was made into the standalone thriller named Solace (2015), which was a critical and commercial failure.</p><br/>"
  },
  "errorMessage": ""
}