{
  "imDbId": "tt1187043",
  "title": "3 Idiots",
  "fullTitle": "3 Idiots (2009)",
  "type": "Movie",
  "year": "2009",
  "items": [
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2437714",
      "warningSpoilers": false,
      "date": "2 June 2011",
      "rate": "10",
      "helpful": "367 out of 436 found this helpful.",
      "title": "Wonderfully entertaining.",
      "content": "It's hard for me to review this film, as I have not seen a huge number of Indian films--probably no more than a couple dozen. Most of the ones I've seen were wonderfully entertaining but I am far from an expert on Bollywood. Because of this, I have a hard time knowing how good this film is relative to other films from this country. So, consider this when you read this review. This may be among the very best India has to offer or it just seems that way to me.Like so many Indian films, this is a very, very long film--with a run-time of almost three hours. When a movie is bad or just okay, this can seem like forever, but since \"3 Idiots\" is a very, very good film I loved its length. And, like most films of the genre, it has its share of the usual singing and dancing so foreign to films from other countries. One thing you should know, however, is that defining the type of film it is isn't really easy. Much of it is a comedy, but it also has many poignant moments (keep the Kleenex nearby), some existential moments where they explore the meaning of life and work and it's also a tender film about friendship. And, as my daughter pointed out when she saw the film, she loved that the men in the movie are not afraid to cry--something you rarely see in western films.As for the plot, it's very long and involved and I could recount what occurs. But I don't want to spoil a single wonderful moment, so my advice is just sit back and watch--and if you give it a chance, I can almost guarantee you'll have a great time with this poignant and funny film. Wonderful and well worth your time--with a delightful script, wonderful characters and lots of moments that made me smile...and a few that brought me to tears. See this film."
    },
    {
      "username": "donutpizza",
      "userUrl": "https://www.imdb.com/user/ur0369748",
      "reviewLink": "https://www.imdb.com/review/rw2521419",
      "warningSpoilers": false,
      "date": "20 November 2011",
      "rate": "9",
      "helpful": "477 out of 555 found this helpful.",
      "title": "Wow this American loves this movie",
      "content": "I asked my co-workers to recommend a Bollywood movie. I expected \"Dumb and Dumber\" by the title. It wasn't that at all. It is more of an inspirational comedy with some serious but good messages. A more accurate title would have been \"The Legend of Rancho\".Odd to me is that they speak in part English, part Hindi through the movie, kinda like some speak \"Spanglish\" here I suppose. I know none of the actors but the acting was good, and there was plenty of humor. The characters were believable. Most movie dancing I find a little silly but I even liked the dancing routines in the bathroom.I will be asking my co-workers for more recommendations after this one!"
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw2865978",
      "warningSpoilers": false,
      "date": "9 September 2013",
      "rate": "10",
      "helpful": "131 out of 157 found this helpful.",
      "title": "Finally a masterpiece from Bollywood. Aamir Khan is the best thing to happen to Bollywood.",
      "content": "Awesome film man. Saw this with my family in a theatre. Worth every penny n worth every minute. Never seen such an amazing film from Bollywood. What is so great about the movie is that it moves you, it gives you hope. It is a simple film, yet it has an everlasting message. The last 30 mins were beautifully shot. Very good direction by Hirani. The star cast is good n Aamir khan steals the show. The editing is top notch. U don't feel bore for even a sec. Awesome screenplay. It's hands down the best film in the history of Bollywood."
    },
    {
      "username": "pawanpunjabithewriter",
      "userUrl": "https://www.imdb.com/user/ur54077131",
      "reviewLink": "https://www.imdb.com/review/rw7033404",
      "warningSpoilers": false,
      "date": "15 June 2021",
      "rate": "10",
      "helpful": "39 out of 43 found this helpful.",
      "title": "THE BEST OF BOLLYWOOD; please sing along....",
      "content": "When I was 13, I had my first movie-love; There was nothing that compared to this movie; Nobody could eva stop me watchn this cult; It had me goin crazy, oh I was star-struck!Watched every weekend, didn't need no other work; Made me laugh made me cry made me become what I am today; Inspired me, motivated me to achieve success every day;I was choking in the crowd, it made me roar aloud; I was nowhere in my career, it made me a flourisher; I used to be havin a bad time, it took me to cloud nine; I was in pieces, it fixed me; It made me a it made me a believer, believer.I was in pieces, it fixed me.It gave me another chance, I grew up once again Na na na.... Na na na.... Na na na.... Na na nana na...."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6141121",
      "warningSpoilers": false,
      "date": "2 October 2020",
      "rate": "9",
      "helpful": "26 out of 31 found this helpful.",
      "title": "Hat-Trick Heroes x 3...",
      "content": "Like Dead Poets Society but with Robin Williams as a student and some extra tonic and spice thrown in for good measure. Serious, sad and silly, often concurrently but overwhelmingly very, very funny and engaging, as engineering students at an Indian college end up teaching as much as they learn. Who could disagree with the distinction between education and learning while recognising the often sizable gulf that exists between the two after watching this. Who would dissuade those with aspiration and passion from pursuing their dreams and goals. Weighing in not too shy of three hours you'll be shocked how quickly the time flies as your attention is vacuumed up and your view of the world turned on its head, or inverted, depending what you've learned."
    },
    {
      "username": "jack_o_hasanov_imdb",
      "userUrl": "https://www.imdb.com/user/ur55640799",
      "reviewLink": "https://www.imdb.com/review/rw7191771",
      "warningSpoilers": true,
      "date": "3 August 2021",
      "rate": "9",
      "helpful": "15 out of 17 found this helpful.",
      "title": "Don't be fooled by its name, it's a great movie",
      "content": "The film not only shows the mistakes of the education system, but also reveals how the truth should be. That life is not actually a race; reveals that this is imposed on us by the education system. Rancho, our character who opposes the order at every opportunity, cannot make sense of not talking about new ideas but grades at schools. Because he goes to school to learn, not for a diploma, he gives importance to knowing the meaning, not memorizing, he does not say \"what I learn at school stays at school\", he applies what he learns in daily life. The secret of its success; Reading the part he is passionate about."
    },
    {
      "username": "StevePulaski",
      "userUrl": "https://www.imdb.com/user/ur23483288",
      "reviewLink": "https://www.imdb.com/review/rw2730814",
      "warningSpoilers": false,
      "date": "3 January 2013",
      "rate": "10",
      "helpful": "77 out of 107 found this helpful.",
      "title": "Scarcely has a comedy provided its audience with so much insight, intelligence, and human affection",
      "content": "\"All is well,\" the three \"idiot\" heroes of 3 Idiots recite when they become frazzled or nervous, while frantically tapping their hearts. They know that reciting the oversimplifying phrase will not provide their problems with a solution, or even a catalyst, but it gives them the onset courage they desperately need at a time of uncertainty and despair. One character even tries to use the line after an amateurishly-given birth may have gone terribly wrong. It's times like that when the saying may not be so effective, even if its goal is not to provide certain relief.But all is well, as they so often say. Rajkumar Hirani's 3 Idiots, my introduction to the world of Bollywood cinema, is a comedy-drama unlike any one I've ever seen, long, but never drawn out, frantic, but never desperate, and emotional, but never manipulating. It provides us with three of the most likable characters of the last decade, and with insight to the culture of Indians and their parents. Rarely has a comedy had this big of a brain in its head and a canvas of opportunities in mind, while possessing a title not even fit for a farce.Our title characters are ambitious but stunted Farhan Qureshi (R. Madhavan), jittery, fearful Raju Rastogi (Sharman Joshi), and borderline prodigy Ranchhoddas \"Rancho\" Shamaldas Chhanchad (Aamir Khan), three close friends who attend the Imperial College of Engineering (ICE), one of India's most prestigious colleges where only the best are accepted. The young boys already are facing some of life's greatest challenges, all of them pursuing the field of engineering when the only one who seems to have a passion for the material is Rancho. Farhan was forced to become skilled in the field because of his strict father, and Raju is pursuing the field with the goal of getting his family out of poverty, with his father's expensive health bills, his mother's fragile core, and his sister's inability to marry all on the table. Rancho is studying because he feels that one should pursue passion and make a career out of it, so it doesn't feel like work. If you're passionate and devoted to your work, success will find you - yet this is only one of the countless morals and insights 3 Idiots provide its viewer with.The film chronicles their issues in college in flashback, with instances in the presence popping up to show Farhan and Raju searching for their pal Rancho, who has disappeared and avoided contact for several years now. This is not your typical flashback film, however. It uses this method much to its advantage, and doesn't feel like a narrative within a narrative. It seals both stories nicely, but it takes the viewer on a roller-coaster ride of emotions through carefully constructed events before it even arrives at those endings.One of their problems in college is the professor/dean of the campus, Viru Sahastrabuddhe (Boman Irani), who the three derogatorily call \"Virus\" when his back is turned. Virus is strict and often largely unsympathetic to the problems of his students, which allows the film to explore a dark topic one assumes a comedy wouldn't dare cross paths with and that is the issue of Indian teen suicide. One kid had his father have a stroke, rendering him unable to focus on academics for months, falling gravely behind. Virus is grossly unsympathetic to his case, denying him an extension on a project he's work so unrealistically hard on but can not perfect.If anything, we can say 3 Idiots is a message to the parents of the Indian youth and that is to stop applying pressure to an already stressed out demographic. I've read several articles articulating the point that Indian teenagers are among one of the highest in suicide rates, and that many parents put an unrealistic amount of pressure, duty, and responsibility on the child to the point of a physical and mental collapse. You're given the unalienable freedom to raise your kids with the method you choose, but not every method is perfect, and when your method is one of the ones that leads to suicide, mental health problems, and perpetuates fear and anxiety in the minds of teenagers, then you may want to reevaluate your methods.3 Idiots also provides us with the idea that many Indian children are told what to become in life early and are discouraged from exploration or even personal ambition. This I can't believe. What an unhappy, uninspiring, completely wasted life to slog through everyday doing something you loathe all because it was the lucky career choice of your parents. Yet I'm sure millions have been lead through this same life. It's the worst way of \"living through a person\" that I can imagine.The film runs ten minutes shy of three hours, which for few viewers may seem too long and uncomfortable. I was skeptical myself walking in rather blind. Almost every Bollywood film I've conducted research on seems to run an upwards of three hours, some extending and testing the waters to roughly five hours. If other Bollywood works have characters drawn along the same lines of being relatable, human, and easily accessible and not biased towards race or social class, I can't see it being a struggle to get through any of the industry's films.Through every quick-witted song and dance number, through every comedic scene, through every instance of dramatic despair, emotionally alive moment, solemnly poignant sequence, suspenseful setup, to a lovely, heartfelt conclusion, 3 Idiots is a wonderful, invaluable endeavor in the world of film. Its actors are beautifully fitting for their roles, assisted by a script so human and true to life that it is honestly hard to believe, and captured through beautifully alive cinematography to collectively give us a beautiful package not just in the figurative sense. This is arguably one of the best comedies I've ever seen."
    },
    {
      "username": "ShaukathX",
      "userUrl": "https://www.imdb.com/user/ur87058213",
      "reviewLink": "https://www.imdb.com/review/rw6872338",
      "warningSpoilers": true,
      "date": "2 May 2021",
      "rate": "10",
      "helpful": "22 out of 25 found this helpful.",
      "title": "Missed this gem for 12 years - Thanks to my wife",
      "content": "Thought provoking movie, it shows how Indian Parents force their children's. In every aspects (what to study, what to wear, where to work, so & so.Really if i had seen this movie before 12 years, my life would have been different.Must seeeee!!!!!!"
    },
    {
      "username": "deloudelouvain",
      "userUrl": "https://www.imdb.com/user/ur58525162",
      "reviewLink": "https://www.imdb.com/review/rw3409477",
      "warningSpoilers": false,
      "date": "6 February 2016",
      "rate": "7",
      "helpful": "30 out of 39 found this helpful.",
      "title": "One of the better Bollywood movies I saw",
      "content": "Because the movie had such a high rating on IMDb I was intrigued. Bollywood movies are not particularly on the top of my list I must admit. But I gave it a shot and I'm glad I did. It only has two scenes where they start singing and dancing so that was not too much. Why they start singing and dancing that I will never get. The story does not need that at all. The story itself was very pleasant to follow. Full of mixed emotions, happy ones and sad ones. The cast and the filming was great. All actors gave a good performance throughout the whole movie. Like in most American television series they want to give you a lesson in life and most of the time it makes me want to barf but in this Bollywood movie it works perfectly well. I had fun watching this and I get why I am not the only one. Certainly worth a watch."
    },
    {
      "username": "naman-avastol",
      "userUrl": "https://www.imdb.com/user/ur22236153",
      "reviewLink": "https://www.imdb.com/review/rw2179895",
      "warningSpoilers": false,
      "date": "24 December 2009",
      "rate": "9",
      "helpful": "295 out of 417 found this helpful.",
      "title": "Aal izz very, very, very, very, very Well",
      "content": "\"Whatever the problem in life is... just say to yourself 'Aal Izz Well'.. This wont solve your problems but it will give the courage to face it..\" \"Chase Excellence and success will follow\".. \" Life is not about getting marks, grades but chasing your dreams\".. These are the golden rules which 3 IDIOTS teaches you in a very light and entertaining way.. The movie makes you laugh and in the process you learn many golden rules which can alter your life in a big manner...3 actors from the path-breaking blockbuster RANG DE BASANTI( Aamir, Sharman, Madhvan) team up together with Rajkumar Hirani.. It couldn't get bigger! Loosely based on blockbuster novel ' Five Point Someone ' by Chetan Bhagat the movie deals with the present education system in India that whether getting more marks and better grades is better than gaining knowledge and is mugging up everything more useful than understanding it..The movie has many hilarious scenes and everyone in the film form Aamir to Boman Irani to Omi Vaidya were superb in their roles.. Aamir has outdone himself.. Never in the film he has looked 44 year old... Film's music sounds mediocre but when viewed on the screen then the music sounds perfect.. Cinematography is awesome and so is the direction.. Raju Hirani's screenplay(you can easily ignore a few loose points) is a masterpiece and the film will achieve cult status for engineering students in a short period of time.. It has the soul which Five Point Someone had.. It is easily Aamir Khan's finest film to date.. The film's climax is fantabulous and is a shocker.. It takes everyone by surprise...To conclude 3 IDIOTS has the potential to break all records and sweep all awards.. Watch it... You will Love it...My Rating: 9/10Thanks and Regards"
    },
    {
      "username": "MOscarbradley",
      "userUrl": "https://www.imdb.com/user/ur1683855",
      "reviewLink": "https://www.imdb.com/review/rw6126572",
      "warningSpoilers": false,
      "date": "26 September 2020",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "If this had come from Hollywood and not Bollywood it might have cleaned up at the Oscars.",
      "content": "The title may conjur up images of the 3 Stooges and the crude humour of the opening might suggest a Hindi \"Porky's\" but with a running time of almost three hours \"3 Idiots\" clearly has its mind on higher things. It's a Bollywood buddy-movie devised as an epic and determined to outdo all the competition and being a Bollywood movie is full of large-scale musical numbers as well as a lot of very broad and very funny comedy.The 3 idiots of the title meet as engineering students, become life-long friends but are separated by that old fickle finger of fate. It's also bold enough to deal with such issues as suicide and poverty and, of course, the caste system and is lifted onto an altogether higher plain by a terrific performance from Aamir Khan as 'the idiot' the other two worship and who, naturally, isn't an idiot at all but the sharpest tool in the box and he's brilliantly supported by Sharman Joshi as his potentially suicidal friend and Omi Vaidya as his number one rival. Brilliantly directed by Rajkumar Hirani this is the kind of film Hollywood could learn a lot from and which, had it been a Hollywood film, might well have swept the boards come Oscar time."
    },
    {
      "username": "sumanbarthakursmailbox",
      "userUrl": "https://www.imdb.com/user/ur20658364",
      "reviewLink": "https://www.imdb.com/review/rw2179733",
      "warningSpoilers": false,
      "date": "24 December 2009",
      "rate": "10",
      "helpful": "208 out of 342 found this helpful.",
      "title": "3 idiots is a masterpiece and easily one of the greatest Bollywood movies of all time",
      "content": "I saw the paid premiere of 3 idiots today.On the whole, 3 idiots is a winner all the way everythingwise.3 idiots suits the term 'landmark cinema' and has all it takes to help Bollywood take a giant step into world cinema with pride.3 idiots is a sparkling example of qualitative cinema.3 idiots not only entertains, it also enlightens.3 idiots is forward-thinking, but also makes you recall your roots. It promises lots of laughs and also a heartwarming message.There are movies aplenty, but very few remain etched in your memory and possess recall value. 3 idiots is one of those films. Indisputably and undeniably, this Aamir-Madhavan-Sharman outing is worth the price of the ticket and more.The film will set new records and has the merits to emerge one of the biggest hits of all times. The weekend business should be historic, the Week 1 business should be unparalleled, the lifetime gross should be amongst the biggest of all times. In short, 3 idiots has 'Blockbuster' written all over it.The story of 3 idiots has been told differently and most importantly, the story offers so many twists-n-turns that you just can't guess what would unfold next.There's so much happening in every scene and the screenplay is so gripping that you don't feel the need to look at the auditorium ceiling or at your watch at brief intervals. You aren't restless. 3 idiots demonstrates how strong film-making can enhance and elevate an already solid concept.An Aamir Khan film is nothing short of an event. The supremely talented actor acts in one film a year and no two films are ever identical in terms of plot line.To sum up, 3 idiots is commercial Hindi cinema at its best. The film has 'Hit' written all over it. Let me put it this way: Cancel whatever you're doing today and go watch 3 idiots instead.Director Rajkumar Hirani strikes a fine balance between humor and emotions. The comic portions are executed with panache, the drama is attention-grabbing and the emotional quotient is strong enough to turn you moist-eyed. The marriage of humor and emotions as also technique and content is what drives 3 idiots to the winning post."
    },
    {
      "username": "vvv832",
      "userUrl": "https://www.imdb.com/user/ur18334751",
      "reviewLink": "https://www.imdb.com/review/rw2387713",
      "warningSpoilers": true,
      "date": "19 February 2011",
      "rate": "10",
      "helpful": "189 out of 226 found this helpful.",
      "title": "^_^The best film reflecting Asia's education ever!",
      "content": "As many ordinary Chinese high school students,who have to study fourteen(14) hours every day for the college entrance examination in the final year,I was entirely shaken and moved by \"3 idiots\",sharing the same feeling with all the students from high schools and universities in China(or Asia). O(∩_∩)O Compared with mainland China,India is lucky,having less corruption in education system.This film is incredible inspiring,especially for those who are struggling or \"survived\" in high schools and colleges.I read some reviewer,some doubt whether suicide in the film is logical,which is really DISAPPOINTING! (—__—!)If you experience the life in poverty areas in Asia,you will understand what a significant role the higher educations play in their lives. Burdening great pressure from family and society,they attach great expectation and significance to the enrollment of colleges,and they intend to abandon poverty by getting higher education.Diploma means everything for them. Thus,the plot where the man committed suicide after lost the chance to graduate is reasonable."
    },
    {
      "username": "vivee003",
      "userUrl": "https://www.imdb.com/user/ur15093067",
      "reviewLink": "https://www.imdb.com/review/rw2179751",
      "warningSpoilers": false,
      "date": "24 December 2009",
      "rate": "10",
      "helpful": "201 out of 308 found this helpful.",
      "title": "Aamir has yet again chased excellence & success follows him !",
      "content": "Plot Two idiots Farhan (Madhavan) and Raju (Sharman) sets outs on a journey to find their lost friend and the 3rd idiot Rancho (Aamir).. As the journey starts off, their college life and old memories of their friendship, with a unique free-thinker Rancho who inspired them and changed their lives, are unfolded through flashbacks and followed with some twists and turns...My Views 3 Idiots looks at our educational system which pressurizes the students and does not allow to chose his destination by his own wish, in a satirical way and brings out some of the flaws in it... On parallel there is a love angle between Rancho and Pia (Kareena)... Many of the situations/characters have resemblance or inspiration to \"Five Point Someone\", blockbuster novel penned by Chetan Bhagat...Both humour and emotional quotients are amalgamated in the right proportion, full credits to Raju for that... Film offers lots of quality rib-tickling moments throughout.. The intermission point offers a twist that is totally out of the blue and keeps you hooked to the movie ! Just when you think this feel-good comic caper is leading to its culmination, there is another surprising element at the climax which is brilliantly weaved out by Hirani...Technically, it rocks with astounding and visually arresting cinematography, the aerial shots of Shimla and Ladakh are a pleasant treat for our eyes... Editing was good... Song visualizations were cool... Music was good and well placed with the flow of the narration...Coming to performances, all of them comes out with convincing portrayals, but it is Aamir Khan, the real showman of Bollywood, steals the shows with yet another stellar portrayal and will go down as one of his best performances. His looks and mannerisms as a college student was genuine and consummate.. Madhavan and Sharman adds up with commendable performances... Kareena does her part well... Among the supporting, Boman Irani as the eccentric head of the institution was too good...On the downside, there are some unbelievable filmy situations which can be excused as writer's liberty and the episode of Mona's delivery was a bit far stretched.. Still these minor negatives does not affect this wholesome entertainer ! In short the basic theme of the movie is that \"chase excellence and success will follow\".. Just like that Aamir and Raju has chased excellence and success is following them...So to sum up, Aamir and Hirani has delivered the best movie of 2009... Do yourself a favour by seeing this highly emotional and feel good comic entertainer...Verdict : THE BEST of 2009 ! Rating : 9/10for more reviews of the latest Indian movies, visit www.snehasallapam.com"
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw3847676",
      "warningSpoilers": true,
      "date": "2 November 2017",
      "rate": "9",
      "helpful": "13 out of 18 found this helpful.",
      "title": "\"Aal izz well\".",
      "content": "Never would I have thought that a movie that looked this stupid on paper could have turned out so good. Just looking at the DVD cover would have been enough to turn this film back in but it shows up in IMDb's Top #250 so I thought I'd give it a try. It didn't start out that well for me but before long the movie's magic began to take hold. Not that there's anything daringly new about it's message; it all has to do with believing in one's self and doing what you really want to do with your life after one's formal education is completed.Aamir Khan is a potent anchor for the story of three college friends attending the Imperial College of Engineering, and Rancho's ideas about success don't revolve around getting the best grades but actually learning something. I could see somebody like a younger Matthew Perry performing the role if this was an American film. I wasn't really expecting as much in the way of music from this story, but with the amount of song and dance you could almost call it a musical. The 'Zoobi Doobi' dance number was quite infectious and looked like a lot of fun.Another thing that keeps you engaged is the non-linear story telling technique. But the thing is, you never really get confused when the time line changes from ten years ago to present day. With all the humorous situations presented, this could have easily fallen into slapstick, and it did get close at times, but then the story pulled back with a poignant message or a sobering decision one of the characters had to make. Story threads are tied up that one forgets along the way and that's another cool element. I just thought it was a uniquely creative film with a neat twist at the end with the identity of Rancho. There's even a romance thrown in for our principal player, and when it was over, I had the feeling that this is what \"La La Land\" could have been but never came close."
    },
    {
      "username": "NpMoviez",
      "userUrl": "https://www.imdb.com/user/ur69508929",
      "reviewLink": "https://www.imdb.com/review/rw6863936",
      "warningSpoilers": false,
      "date": "30 April 2021",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "My most favorite movie.",
      "content": "This particular movie is my most favorite movie of all times. I don't even know where to start with. I have definitely watched over 600 movies in my life, and this happens to be the only movie which was able to have a positive impact in my life. Long story short, I have been in the place of each of Rancho, Fahran and Raju in my life. And I have always applied the principles this movie introduced whenever I have been in a tough situation. I have learned to follow after excellence rather than success. I have learned to follow my passion and care less about what society thinks about my decision.Rajkumar Hirani has always addressed a certain issue and/or has boldly hit many lame principles and ethics of the society with a perfect satire. In this movie, it's about the cliched belief that if you're a science student, then it has to be either medical science or engineering if you want to get successful. In the real world, many people have been a victim of this belief and have wasted their life. Had they not been brainwashed by the society, they would've had a better life. That's what the movie justifies and as per my experience, it makes a whole lot of sense. Another thing is, you need to worry about excellence. If you are excellent, the good grades are almost obvious. And in the end it's your excellence that matters, not the grades.Hirani tells the story in his own unique way. Just like in every single one of his movies so far, he crancks up everything to 11 to make sure that his point has reached to the audiences' mind. Many of those cranck ups do not make sense in real life, but that does not even matter because the movie doesn't want that particular cranck up to be relatable. But it does want whatever that cranck up tries to tell to be relatable. And it succeeds in that. And whether or not it makes sense or not, you'll get the point and a great dose of laughter. And there are some of the sequences which are just hilarious and over the top, and are meant just for the sake of laughter. The characters are very likable and quite different from one another. Each of them are a representative of the kind of people there are in the society and in the academic field.The movie doesn't make all kind of sense if you look at it quite literally. Even I would say it's quite nonsensical if I am to look at it literally. But it's meant to be looked at literally. Many scenes are mere representation of something else that the story wants us to know. With that regards, it's pretty good. Even if you watch it at the face value, you won't be bored at all. There will be a build up to something, and the final result will be exactly the opposite of what you expected and that will make you laugh a lot.The songs are pretty good. They aren't the strongest part of the movie by a long shot, but are still popular than many recent Bollywood songs. It's strange that a late 2000s movie had songs which are still popular. Every single actor have given their best performance till date.Rating : absolute 10/10, Grade : golden A+"
    },
    {
      "username": "cherold",
      "userUrl": "https://www.imdb.com/user/ur0011762",
      "reviewLink": "https://www.imdb.com/review/rw3810322",
      "warningSpoilers": false,
      "date": "20 September 2017",
      "rate": "9",
      "helpful": "14 out of 20 found this helpful.",
      "title": "This inspires me to watch more Bollywood movies",
      "content": "Until recently my only exposure to Indian cinema was Satyajit Ray. Like a lot of Americans, my knowledge of Bollywood was based entirely on film clips and American take-offs of lavish musical numbers.I looked on a few lists of top Bollywood films and settled on 3 Idiots, which turned out to be a wonderful decision. The movie is terrifically funny and engaging, seamlessly moving from comedy to tragedy to musical numbers.The story centers around a brilliant, iconoclastic technical student who spends the movie telling people to follow their dreams. While generally lighthearted, the movie strongly addresses the apparently terrible stresses on Indian college students. But in spite of some dark movies, overall this is about as feel-good as you can get. Feel-good to an absurd degree? Sure. But what's so bad about feeling good?When I think of Bollywood I think of big musical numbers, and there are a handful here, although they're a tiny part of the three-hour running time. Still, they are tremendous fun.To sum up, I saw a Bollywood movie, I laughed, I cried, and now I want to see more."
    },
    {
      "username": "namashi_1",
      "userUrl": "https://www.imdb.com/user/ur8503729",
      "reviewLink": "https://www.imdb.com/review/rw2180073",
      "warningSpoilers": true,
      "date": "25 December 2009",
      "rate": "9",
      "helpful": "85 out of 153 found this helpful.",
      "title": "A Must Watch!",
      "content": "Rajkumar Hirani... the name is enough to create an excitement in any cinema-fan alive. Munnabhai series have been awesome films, and his latest offering '3 Idiots' is another Masterstroke from this genius.I have no idea how 5-point-someone is, all I know is that '3 Idiots' is an amazing/awesome/inspiring film. A treat of a film! A film that is rich in emotions, A Film that leaves behind a great moral. The Youth are sure to worship this Film, and that will make this film a blockbuster. Cancel anything you're planning to do till the 31st, watch '3 Idiots', it's worth your time and money. Hirani and Joshi's script is simply superb. Through Humor how many rights and wrongs are said. I really loved the way Hirani showed us Sharman's family. A typical 1950's family, it's hilarious as well as genius.The film has Superb Performances: Aamir is fantastic as Funsok Wang Do. He's a delight every time he appears on screen and delivers his careers finest work. Maddy excels, he's astounding in the sequence when he shares his heart with his father. Sharman Joshi is good, yet again. Omi is a Masterstroke. A surprise packet, his speech sequence is sure to be remembered forever! Kareena is weak. Boman Irani is mind-blowing as the vicious head. He leaves you speechless in the scene when he awards Aamir The Pen. Mona is average.The Music is decent, with 'All Izz Well' being a complete chart-buster. The cinematography is perfect. All other departments are satisfactory.Watch this film right now..."
    },
    {
      "username": "Kicino",
      "userUrl": "https://www.imdb.com/user/ur3446880",
      "reviewLink": "https://www.imdb.com/review/rw2482856",
      "warningSpoilers": true,
      "date": "2 September 2011",
      "rate": "9",
      "helpful": "35 out of 55 found this helpful.",
      "title": "A wise person may look like an idiot: Chinese proverb",
      "content": "I missed it during the 2010 Hong Kong International Film Festival and am really glad it is released publicly.Haven't seen such a feel good movie for a long time. Excellent and inspiring plot with very positive messages and many hilarious scenes.Inspiring messages and witty lines are dotted throughout the movie, intertwined with some teary scenes: all is well if you follow your passion; chase excellence and success will follow; be brave and follow your dream; think outside the box and be flexible.It challenges our current values on education and success – that we should learn for the sake of learning but not for grades or what others want us to do. What's the point if you memorize everything but do not understand what it means and do not know how to put what you have learned into application? What an inspiring movie. It challenges your comfort thinking mode and urge you to be yourself and chase your dream/passion.Excellent acting, colorful and typical Bollywood musical scenes with uplifting songs and dance moves, not to mention the soothing natural scenery interspersed in the moving episodes of friendship, love, family and playful/stressful campus life.Every student, teacher, and parent or anyone who cares about our future should see it. What kind of world do we want to live in? What kind of person do we want our next generation to be? What kind of lives do we want to lead? This movie makes us ponder on these.Somehow the movie echoed Steve Job's quotes : \"Your time is limited, so don't waste it living someone else's life. Don't be trapped by dogma—which is living with the results of other people's thinking.\" \"Remembering that you are going to die is the best way I know to avoid the trap of thinking you have something to lose. You are already naked. There is no reason not to follow your heart.\" Both Steve and the Rancho character (Aamir Khan) are smart and creative, nice and helpful to friends and people who are willing to learn. They are true to their feelings. They dare to challenge authority and encourages others to do the same. We need more people like these in this world.Just go see it. You won't regret it."
    },
    {
      "username": "ironhorse_iv",
      "userUrl": "https://www.imdb.com/user/ur34049683",
      "reviewLink": "https://www.imdb.com/review/rw3295484",
      "warningSpoilers": true,
      "date": "11 August 2015",
      "rate": "8",
      "helpful": "9 out of 12 found this helpful.",
      "title": "All is kinda well for 3 idiots. It was mostly a great feel-good movie.",
      "content": "In a country, where over-achievement is expected & anything deem a normal life is look upon as the idiotic or lazy failure. A lot of Asians feel, that slaving away, their lives, for the chance of extraordinary wealth is the only way, to live, even if it's does not suite their personality. Indeed, the hunger for success and wealth is so engrained in Asian culture, that it's hard to escape, such burdens. It's true, that Asians societies, do put extreme pressure on its members. Often, weighting down on them to a point, that some people feel, that it's too much; causing them to common suicide. So, I can see, why people would want to see this film directed by Rajkumar Hirani. It has a more healthy and positive approach when it comes to a country's wants and don't wants, when it comes to the individual member. Set in an India academia world, 3 Idiots revolves around three students studying in the Imperial College of Engineering, in New Delhi. The first idiot, Raju Rastogi (Sharman Joshi) comes from a poor family and is desperate to pass and get a good job, but lacks the self-esteem to go with his plans. The second idiot, Farhan Qureshi (R. Madhavan), comes from a relatively better family, but has joined engineering to please his family, while he really wants to become a wildlife photographer. The last idiot, Ranchoddas Shamaldas Chanchhad (Aamir Khan) is a radical-thinking young man, who more willing to challenges the educational system at every step he takes, rather than accenting the harsh-crude teaching practices of the college, often infuriating the headmaster of the school, Viru 'The Virus' Sahastrabuddhe (Boman Irani). However, Farhan and Raju lost contact with Rancho after graduation. Ten years later, Farhan gets a call from an old enemy colleague of theirs, Chature 'Silencer' Ramalingam (Omi Vaidya) who says he has found Rancho. Abandoning everything, Chatur, Farhan and Raju set out on a road trip, to find him. But all is not as it seems. Can the idiots find their friend or will the search end up as a wild goose chase? Watch the movie, to find out! Without spoiling the movie, too much, I have to look at the film, in a western world view set and say, the Animal House style college scenes, far out-live the present day, road trip movie. I really felt, those scenes were far, more effective, even if the social message was somewhat too broad. I like that, the modern day teaching standards are called into question. It made a very interesting film. Sadly, the movie takes the often funny yet brilliant Patch Adam like, school challenges, and mixed it, with below average Bollywood film dramatics. The movie often moves into such clichés, that it become somewhat emotional jarring to watch. One minute, you're listening to a Bollywood musical dance number, and then, you cut to an emotional, over the top preachy death scene. The pacing for the film is all over the place. It really drags at times. Some of the film's greatest twist comes inappropriate mistimed. You'd know that Raju will survive his suicide attempt since he's alive and well in the present day scenes. You know, that the men will end up, being successful, regardless, what the Virus pull onto them. Don't get me wrong, the twist about Racho's past was pretty good, but the film was pretty predictable. Then, there are the unrealistic over the top scenes that are absolutely nearly implausible in any universe, like the whole stubborn baby scene. Anyways, the acting, throughout the film was pretty good. Each character had a moment to shine. My only problem with the acting is Kareen Kapoor as Pia. She was so disappointing, most of the film. I really don't get her character. Why would she still go after, Suhas (Olivier Lafont), after three-times, where characters warn her, not to!? It doesn't make sense. Plus, that noise ring, she wore, during the film was so distracting. Another thing that kinda hurts the film is the songs. Shantanu Moitra's score is a bit too gimmicky. The song, Zoobi Doobi sounds entertaining, but sounds too similar to other Bollywood songs. The song 'All Izz Well' sounds like it should had been, put in the credits than in the middle of the film. Anyways, I love the over-the-top childish humor. While, the jokes are simple and old. They work mostly within the means of the story. Chatur's engineered speech is by far, the funniest scene in the film. Still, the movie does seem, a bit, one-sided when it comes to condone misbehavior. I'm deeply surprise that the three men, wasn't kick out of the school, within the first couple of minutes in the film. Much of the film's controversy, comes from the fact, that the movie is loosely based on the novel, Five Point Someone by Chetan Bhaget. Any fan of the book, would know, that the film is way different. The suicide message of the book, get somewhat lose in the film. Yes, within the last five years, India has one of the greatest absolute numbers of suicides cases, but here is where the movie get some of the information, wrong. Other countries have the highest rates, overall. It's also untrue, that extreme pressures of academia cause most of India's suicide rates. Farmers are more likely to kill themselves, versus any other professions in India, as list by the World Health Organization. Despite that, the film is fun for the most part. The film is distinctive for featuring real inventions by little-known people. The cinematography is beautiful to look at. I love the aerial shots of Shimla and Ladakh. The film felt like a typical masala film. It's good to eat, but a bit too spicy, at same moments. No wonder, why this film is one of the highest-grossing Bollywood films ever. Overall: While it's kinda overrated. It's emotional, entertaining and enlightening. In my opinion, it was a somewhat above averaged Bollywood film."
    },
    {
      "username": "ankityadav",
      "userUrl": "https://www.imdb.com/user/ur19501058",
      "reviewLink": "https://www.imdb.com/review/rw2180081",
      "warningSpoilers": false,
      "date": "25 December 2009",
      "rate": "10",
      "helpful": "248 out of 369 found this helpful.",
      "title": "This Christmas & New Year, go gift yourselves - watch this phenomena (Not for Professors) !",
      "content": "I'm an IITian myself and hence, needless to say, was looking forward to this movie as it is based on the life in IITs. I went with my family and watched the first-day-first-show and was I pleased ? In one sentence - The best Bollywood movie ever ! If you are into movies, then this one is not to be missed unless you are the 4th idiot. I cried, I laughed and I enjoyed every moment of the 3 hours that I spent watching this gem. The songs that seemed mediocre before watching the movie, feel like perfect for the movie. They are so ideal for the situations that I just loved them.As you can understand, they could not bring the name of any IIT into the movie to avoid disputes. But trust me, whatever they have shown about the life in IITs, it's all true. Right from suicides, cold-hearted Professors to lack of encouragement and support for talents who can really bring serious change in this world. The movie successfully depicts how once inside, your life is only about meaningless grades, go get into the race before it's too late.Take my free advice and avoid any reviews or words from people who have already seen the movie. Don't let anyone spoil any scene from the movie. Rush to the nearest theater and experience the phenomenon for yourself. You'll bless me for this advice !"
    },
    {
      "username": "ahmedn32004",
      "userUrl": "https://www.imdb.com/user/ur16379678",
      "reviewLink": "https://www.imdb.com/review/rw2549675",
      "warningSpoilers": false,
      "date": "15 January 2012",
      "rate": "10",
      "helpful": "43 out of 69 found this helpful.",
      "title": "The best Indian movie ever",
      "content": "To be brief, THIS IS THE BEST Indian MOVIE EVER CREATED..... I know it is old but I just heard about it recently so I watched it yesterday. I think this movie should be one of the best 250 films in history on IMDb rating. I rated it 10/10 and believe me it worth more than this. I don't want to make spoilers in my review so that you will enjoy every minute of the movie. This movie is 2:44 hours length full of laughter, joy, tears, drama and passion. And of course, the most interesting part of the movie is GENIALITY. I loved every moment of this movie. and I hope to watch a lot of future Indian movies like this. I'm also waiting for Ferrari Ki sawari movie to watch. It is starred by one of the 3 idiots. Thank you India for giving us this brilliant movie."
    },
    {
      "username": "DICK STEEL",
      "userUrl": "https://www.imdb.com/user/ur0317399",
      "reviewLink": "https://www.imdb.com/review/rw2180829",
      "warningSpoilers": false,
      "date": "26 December 2009",
      "rate": "10",
      "helpful": "28 out of 48 found this helpful.",
      "title": "A Nutshell Review: 3 Idiots",
      "content": "When I told a friend that 3 Idiots is the best film this festive period, he told me it takes an idiot to be able to tell one, and that I saw myself in the film. If anything, I'll take that as a compliment, as the film is about self-actualization, or the simple fact that it's a wake up call in this rat race of a world that we live in, that we lose sight of things that matter in the pursuit of success. It's a wake up call that we should be pursuing Excellence instead, which in the work environment one gets easily drowned in mediocrity, or blind faith that success follows without putting in too much hard work.Set predominantly in the varsity days and told in chunks of flashback, this film will allow you to reminisce about a time where life was nothing but exams, lectures, and that paper chase, either making the grade or having to repeat. But there's also probably that one person, or a few if you're lucky, whom you'll meet on campus that will help you directly or indirectly, shape your outlook, thinking and just about forming long lasting bonds, whose interaction with will shape your character just before entering the workforce.3 Idiots tell of such a friendship, amongst 3 buddies Farhan (R. Madhavan) and Raju (Sharman Joshi), two mediocre students who just scrape through, and the one huge influence in their lives, ace student Rancho (Aamir Khan), the livewire of the trio who irks the Dean of Imperial College of Engineering (modelled after the famed Indian Institute of Technology), Professor Viru (Virus), played by Boman Irani. In fact, it's something like a Hindi equivalent of the local I Not Stupid with its critique on the educational system, but done with a lot more finesse, fun and without sledgehammering its ideals down your throat.The gist of the disparity here is the concept of learning how to learn, or teaching somebody how to fish compared to just giving the students the fish. It's a reminder that knowledge gathering goes beyond just doing so for exams, and the techniques of blindly cramming will do one not much good later on. It's about the application of knowledge for the real world than to answer papers, and the joy of acquiring such knowledge. It's the 3 Idiots versus the Professor, and their peer Chatur \"Silencer\" (Omi Vaidya who played the role with glee, as the peer bootlicker that everyone loves to hate) who throws down the gauntlet to Rancho as to who will eventually be the more successful of the lot.What made 3 Idiots work remarkably, is the excellent chemistry between the leads. Aamir Khan, the big name as he is, doesn't upstage his co-stars R. Madhavan and Sharman Joshi, as their characters get into various forms of shenanigans in college. Instead they complement one another in their roles, and thanks to makeup, look very much comfortable as their aged selves, and their younger teenage ones through closely cropped hair, and outfits. Aamir aces the role of Rancho as the boy who gets ahead of the pack without really trying and at times being perceived as both the smarty pants and the troublemaker of his cohort, though his sudden disappearance after graduation has made his good friends try to track him down, albeit unsuccessfully. The film also doesn't take itself too seriously when the time calls for it, switching quite playfully to ramp up its funny moments, even at times breaking the fourth wall when telling the story of Raju's background (in black and white melodrama no less). The jokes here worked wonders as well, as do the couple of twists that roll along in the 2nd act after the interval, which is somewhat telling of the narrative depth that the film possessed. Songs were breezy and plenty of fun, and I personally enjoyed Aal Izz Well (All Is Well) best, a chant that the Idiots adopted from Rancho, who uses it to calm his heart when it's filled with anxiety and fear. I think it works.Affairs of the heart though are kept at a bare minimum, when Rancho falls for the daughter of Professor Viru, Pia (Kareena Kapoor). While they start off in quite testy terms, things start to thaw when Pia sees Rancho for who he is, except that the secret Rancho keeps threatens to keep them permanently apart. And that is unless the other 2 pals could help it in their quest to locate Rancho. Everything falls into place at the end, especially telling of the second act when you learn of this secret at the cliffhanger prior to the interval, and this provides yet another emotional sucker punch to your gut when themes like friendship lasting forever starts entering the picture.Chase excellence and success will follow; this film lived up to that tagline in being one of the most excellent I've watched this year. Amongst all the film offerings put out this festive season, my choice for the most uplifting, the most hopeful and a jolly entertaining ride all around with elements of everything only a Bollywood film is renowned for, is this one. Don't miss it, and it goes directly, albeit a late entry, as a contender for my top films of the year!"
    },
    {
      "username": "Glock_Boy",
      "userUrl": "https://www.imdb.com/user/ur19482100",
      "reviewLink": "https://www.imdb.com/review/rw2452785",
      "warningSpoilers": false,
      "date": "3 July 2011",
      "rate": "9",
      "helpful": "28 out of 44 found this helpful.",
      "title": "Don't judge this book by its cover!",
      "content": "This movie hit on all cylinders. It was fun, funny, deep, intelligent, thought provoking, and seriously entertaining. It is not a dumb comedy, rather a very smart (and humorous) look at the struggles of engineering students in India.I thought I would have trouble with the subtitles, but after about 10- minutes I was completely 100% engrossed in the movie. The wife loved every bit of it.My single and only criticism is the length of the movie. I believe there were one or two too many situations which kind of caused the movie to drag.Otherwise I thoroughly loved it.Do not be fooled by the idiotic picture on the cover of this movie. And the first 5-minutes of the movie are not indicative of the brilliance of the rest of the film. It is not stupid humor (even though I like stupid humor).You will leave this movie being glad you watched it. Trust me."
    },
    {
      "username": "ahujarajiv",
      "userUrl": "https://www.imdb.com/user/ur4174655",
      "reviewLink": "https://www.imdb.com/review/rw2179992",
      "warningSpoilers": false,
      "date": "24 December 2009",
      "rate": "10",
      "helpful": "173 out of 288 found this helpful.",
      "title": "Best Movie of 2009! Aamir Khan reigns Supreme!!",
      "content": "We saw a sneak preview of 3 Idiots last night at Globus Cinema in Bandra, Mumbai.Brilliant. Simply, brilliant.Simple but articulate story telling laced with lots of humour and lessons from life. A wonderful experience to watch as every single actor from Sharman, Madhavan, Boman, Kareena & Aamir deliver probably the best performance in a movie this year.Sharman & Madhavan start off on a journey to seek out their friend Rancho. Together they were the 3 Idiots in college. And they take us the viewers with them on this beautiful journey with such warmth, panache, humour and love, that we don't want the journey to end.Sharman really shows why he's one actor to watch out for. His acting genes come through in every single scene. He's perfect in his role. Sharman, you rock!Madhavan as the guy who's chasing his father's dreams rather than his own is wonderful. The character who learns to laugh at life and it's ironies thanks to his friend Rancho. Madhavan shows his humorous side brilliantly savoring every scene and making it a pleasure to watch. His narration of the movie is very good.Boman Irani is probably the one actor we take most for granted just because he's so brilliant! His characterization of the control-crazy, hyper-active, hyper-competitive, almost dictator-ish, college principal, is beyond words. He plays it so so well, that you love to hate him. He's that Good.Kareena comes through in this movie as one of the finest actresses we have. No one else could have played her part and also looked so beautiful at the same time.And now take it from a hard core Amitabh Bachchan fan, Aamir Khan is the best actor in town today after AB. Period.His range is phenomenal and his characterization of 'Rancho' in this movie is positively brilliant. The small mannerisms, the walk, the smile, the attitude, the brilliance of a young person who's not restricted by the educational system, his positive attitude towards every thing in life, it's Rancho you are looking at. Not Aamir. Aamir's ability to transform himself convincingly from the super-huge well-built temporary amnesia patient on a revenge spree in Ghajini to this whacked out college student, which is half the age he played in last movie shows his prowess as a master actor to transcend age barriers to play almost every role in the book.This is THE best movie of 2009. Aamir again reigns supreme. Thank you Raju Hirani & Vidhu Vinod Chopra.Cliché word, but I have to use it - FANTASTIC !! 10/10 P.S. Don't forget to say 'Aal Izz Well'"
    }
  ],
  "errorMessage": ""
}