{
  "imDbId": "tt0109830",
  "title": "Forrest Gump",
  "fullTitle": "Forrest Gump (1994)",
  "type": "Movie",
  "year": "1994",
  "items": [
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0339201",
      "warningSpoilers": false,
      "date": "10 June 2002",
      "rate": "10",
      "helpful": "385 out of 453 found this helpful.",
      "title": "Let's see the world through the eyes of Forrest Gump",
      "content": "\"I've made about 20 films and 5 of them are pretty good\"-Tom Hanks.\"Forrest Gump\" is one of the best movies of all time, guaranteed. I really just love this movie and it has such a special place in my heart. The performances are just so unforgettable and never get out of your head. The characters, I mean the actors turned into them and that's what got to me. The lines are so memorable, touching, and sometimes hilarious.We have Forrest Gump(Tom Hanks), not the sharpest tool in the box, his I.Q. is right below the average scores. But his mama(Sally Field) believes that her boy has the same opportunities as anyone else and lets Forrest know that there's nothing that could hold him back. As a boy he is put into braces for his legs since he has a crooked back and really doesn't have too many friends. When he gets on a school bus for his first day of school, NO ONE will let him sit next to them. This scene is so heart breaking until you hear a little angel's voice \"You can sit here if you want\". Jenny, Forrest's best friend and crush, she looks so incredibly innocent and you love her because her and Forrest are like pea's and carrots. But we find out that there is an extremely unfortunate side to her life, she has a father that's \"always kissing and touching her and her sisters\". Forrest just assumes that it's a father's love since he doesn't have a dad that could show him that it's wrong.Forrest and Jenny together walk every day from school and when these kids start throwing rocks at Forrest calling him stupid, Jenny just tells Forrest \"Run, Forrest! Run!\". He miraculously breaks the braces off his legs and run like the wind blows. Forrest meets many celebrities from his life that just happened to be there: Elvis Presley visited his house before hitting it big, President Kennedy honored him with a all American football award, President Johnson who honored him with a medal of honor for his actions in Vietnam, President Nixon(in which Forrest happens to discover a problem in the Water Gate Hotel because some people seem to be flashing lights around), and John Lennon through a talk show to talk about his medal of honor.Forrest meets some interesting people along the way too that are even better than these celebrities combined; Bubba his Vietnam war friend who dreams of owning a shrimp boat one day and was born with big gums. He is just so wonderful and charming and won't stop talking about shrimp. Luteniet Dan, a leader of Forrest's army in Vietnam who gets saved by Forrest during a huge attack and looses his legs as a result. Luteniet Dan was by far my favorite character, he has so much pride and wants to die in Vietnam due to his family history tradition of dying in every single American war. He and Forrest make quite a pair. And of course there's Jenny, a very tragic figure, she gets more mean as she grows up because she knows that Forrest loves her, in some ways you can't blame her really. She was obviously abused and I think she felt that Forrest was too good for her or that he couldn't really give her the love she wanted. Robin Wright, what a beautiful and wonderful actress.This movie is incredible and should be seen by everyone. I am not kidding, \"Forrest Gump\" is a remarkable movie and inspires everyone. It's not just about someone stupid who happens to be in great places and historic events just because of being in the right place at the right time. This story is beautiful and will inspire everyone to go the distance and see the world like Forrest did and will never give up on their dreams.10/10"
    },
    {
      "username": "thomas-hardcastle-2",
      "userUrl": "https://www.imdb.com/user/ur14923871",
      "reviewLink": "https://www.imdb.com/review/rw1655766",
      "warningSpoilers": false,
      "date": "14 May 2007",
      "rate": "10",
      "helpful": "843 out of 1,012 found this helpful.",
      "title": "In my opinion, no film has touched me more than this one.....",
      "content": "Quite simply, the greatest film ever made.Humour, sadness, action, drama and a Vietnam film all rolled into one.I'm not a stone cold, heartless villain, but it takes a lot to make me cry when I watch a movie. Bambi's mother, I couldn't care less. Jimmy Stewart in, \"Oh, what a wonderful life,\" - yeah right! The Lion King, when Mufasa bites the big one - on the verge.But seriously - I bawled my big brown eyes out, on several occasions in this film. A real tear-jerker, and a wonderful character, played to perfection by Tom Hanks. Every bit as worthy for the Oscar as Rooney was to win the Premiership in 2007.I cannot say it enough: This is THE film of all time. Watch it, and you'll see."
    },
    {
      "username": "Zonieboy",
      "userUrl": "https://www.imdb.com/user/ur0989940",
      "reviewLink": "https://www.imdb.com/review/rw0339101",
      "warningSpoilers": false,
      "date": "8 April 2002",
      "rate": "10",
      "helpful": "755 out of 875 found this helpful.",
      "title": "A beautiful fable for now and the future",
      "content": "I believe everyone has a right to their opinion about films or other topics. However from a lot of the comments I have read about this film, I do not think many got the gist of the message from the author and the film maker. This film is a great modern fable, a fable in the dictionary is defined as a brief fictitious story that teaches a moral. There are many morals defined in this film but foremost is integrity and a simple goodness.I have a half brother who grew up in the Southern U.S. and on one occasion we were discussing this film and he said he felt it portrayed Southerners as dimwitted. I disagreed with him and informed him that the author himself was a native Southerner. The setting is central to this story in that it lets the tale unfold tying in factual events with the fable before us.The film is wonderfully directed by Robert Zemeckis, the film is his opus and is acted by a great cast on all levels. From the children who were Forrest Gump and Gump Jr. by Haley Joel Osment. Say what you want but I feel Tom Hanks deserved the Oscar award. Gary Sinise is synonymous with Lt.Dan whenever you hear those words. Sally Fields is the loving dutiful mother in her challenging situation. Mykelti Williamson as Bubba gives you a real sense in the story that Gump had a genuine friend, he moves you with his character. Words don't grasp the full performance of Robin Wright Penn as Jenny. Jennys' tenderness and pain are palpable as exhibited by Wright.I feel that much of Gumps' appeal is his downright sense of doing the right thing regardless of the people and situations around him and we see that in this film. That being the case maybe we all wish we could be just a little more like that, trying to maintain innate goodness and not the trade-offs we often make as we go down lifes highways.The movie has it all too,drama,comedy and it challenges societal norms as well. Then there are the almost endless quotes from the movie that have slipped into everyday speech. They are too numerous to say at this point.One of the toppers for me in the movie is when Forrest is in a quandary about life and wondering as Lt.Dan said we all have a destiny and his Mom says it is where we are all just floating around like a feather in the wind. Forrest's character terms it very well with this quote,\"I think it is a little bit of both.\" From my experiences in life it does appear to be that way. So if you have not seen the movie,see it soon you are in for a real treat. If you did not like it, give it a try again and hopefully you will see it for the great story it is!"
    },
    {
      "username": "inspectors71",
      "userUrl": "https://www.imdb.com/user/ur2257122",
      "reviewLink": "https://www.imdb.com/review/rw3472550",
      "warningSpoilers": false,
      "date": "19 May 2016",
      "rate": "9",
      "helpful": "84 out of 106 found this helpful.",
      "title": "Dropping My Keys",
      "content": "I remember John Byner, the stand-up comic and impressionist of the 1970s talking about guys crying at movies, how it's not an acceptable behavior. He advised the men in his audience to drop their keys, do something that gets them to lean forward, wipe their faces, and get things under control.I dropped my keys watching Forrest Gump. Lieutenant Dan comes over the hill at Forrest and Jenny's wedding, new legs, fiancé at his side, clean-cut and happy.Forrest states the obvious, \"Lieutenant Dan, you gawt le-eggs!\"And the water-works just started to flow.I sit up straight and clear my throat. Got 'em (the keys, that is). My wife leans over and gives me a kiss. She says, \"That's why I love you.\"Other than a few historical fussinesses and plot slickeries, none of which are worth mentioning, this is as close to a perfect, emotionally-satisfying entertainment as I have ever seen. I love this movie. I never tire of the simple story of the guy with the lowest IQ in the room being the smartest guy in the room. It's filled with a patriotic decency you can only find in The Wizard of Oz and To Kill a Mockingbird.When Dorothy is aching for home and the Wizard can't deliver, I drop my keys. When Scout points to the man behind Jem's bedroom door and says, \"Hey, Boo,\" the fob goes flying.The next time I get out my copy to show to my 11th Grade US History kids, I'll start fingering my key chain. I can't help it."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw1335559",
      "warningSpoilers": false,
      "date": "7 April 2006",
      "rate": "10",
      "helpful": "26 out of 31 found this helpful.",
      "title": "Pure Charm",
      "content": "Every once in a while, something comes along that hasn't been done before. This movie is one of those things. First of all, we have a principal character whose take on life is one where you don't judge it; you live it. I know he's a film character. It doesn't matter because we use images such as these to inspire us and to give us our own way of treating each day. Forrest lets no grass grow under his feet. He is the consummate optimist. He doesn't complain because he sees early on that it does you no good. His life is one adventure after another, in and out of the public eye, but his shyness and demeanor don't ever get to his head. He is the epitome of patience, something sadly lacking in the lives of most Americans. He is pushed around by the gusts of time and always lands on his feet. His relationship with a troubled girl is the one consistent thing in his life, and that is also shows his pugnaciousness. There are some commentators and reviewers who call this character stupid. He is a slow processor, but his stability lies in his morality and his consistency. His mother raised him well.Tom Hanks has become our new Jimmy Stewart. His roles are about human emotion and dedication. He is the everyman in many ways. Obviously, the subject matter has changed, but you can bank on his decision making when it comes to film. The other heroes are the special effects people. They are able to make this work; to create an incredible world for him to function within. The news clips are quite marvelous. I usually put this film in my top ten."
    },
    {
      "username": "kenhe",
      "userUrl": "https://www.imdb.com/user/ur2586978",
      "reviewLink": "https://www.imdb.com/review/rw0339067",
      "warningSpoilers": false,
      "date": "31 May 2004",
      "rate": "10",
      "helpful": "363 out of 450 found this helpful.",
      "title": "Purity and innocence retained",
      "content": "I have seen this movie easily a half a dozen times, and I find that the beauty of the film is how Forrest Gump not only shares his innocence and purity with others, including the audience, he also manages to retain that innocence and purity through some very difficult times. As a Viet Nam veteran, and a college graduate of the late Sixties, I could of course personally relate to the various periods that Forrest Gump endures. I would only mention that the skillful and seamless blending of music, action, and period costume was enthralling. And yet it was so perfectly understated that Forrest Gump's travels through thirty five years of the stormiest and most meaningful years of American history only became clearly defined for the viewer. Even more so than the well known chocolates quote as a metaphor for life, I felt that the remark that stupid is what you do is probably more workable for most of us."
    },
    {
      "username": "blairgallop7",
      "userUrl": "https://www.imdb.com/user/ur15148249",
      "reviewLink": "https://www.imdb.com/review/rw1781127",
      "warningSpoilers": false,
      "date": "15 December 2007",
      "rate": "10",
      "helpful": "179 out of 230 found this helpful.",
      "title": "Forrest Gump is a movie masterpiece that won't be forgotten and will continue to inspire",
      "content": "He may have been good in Philadelphia but be is excellent in Forrest Gump.Tom Hanks delivers another great performance in his career by portraying the lovable,king yet not so intelligent character Forrest Gump.It is also Tom Hanks' second straight win for the Best Actor Oscar which he becomes the second man to do said accomplishment after Spencer Tracy.Whilst not as dramatic as Philadelphia,Tom Hanks' performance is just as great in this movie and this movie could possibly be the film of Tom Hanks' career as he used to be a comedy guy who turned to drama in a way which would paved for future stars such as Jim Carrey(The Truman Show),Reese Witherspoon(Walk the Line) and Will Ferrell(Stranger Than Fiction) to name a few.Also staring in this great movie classic are Robin Wright-Penn who plays Jenny,Gary Sinise who was nominated for an Academy Award for his portrayal of Lieutenant Dan Taylor,Mykelti Williamson as Forrest's best friend and shrimper Benjamin Buford\"Bubba\" Blue and Sally Field as Mrs.Gump.This film was nominated for a total of thirteen Academy Awards but won six of them which include Best Film Editing,Best Visual Effects,Best Adapted Screenplay,Best Picture,Best Director-Robert Zemeckis and Best Actor-Tom Hanks.This is one masterpiece of a movie that will not be forgotten about in a long time.Bravo!"
    },
    {
      "username": "george.schmidt",
      "userUrl": "https://www.imdb.com/user/ur0937743",
      "reviewLink": "https://www.imdb.com/review/rw0339280",
      "warningSpoilers": true,
      "date": "13 March 2003",
      "rate": "10",
      "helpful": "162 out of 221 found this helpful.",
      "title": "Contemporary classic: one of my all-time faves",
      "content": "FORREST GUMP (1994) **** Tom Hanks, Sally Field, Robin Wright, Gary Sinise, Mykelti Williamson. Brilliantly directed and inspiring comic drama about the truly extraordinary life and times of mentally challenged Forrest Gump (Hanks in the best role of his career won his second Best Actor Oscar in back-to-back winning roles), a simple, honest, and decent man whose childlike innocence is his lucky charm through his altering experiences that span the past two decades flawlessly. Mind-boggling Oscar-winning computerized effects by Industrial Light & Magic has Gump meeting the famous and infamous. Hanks is a wonder (dare you not to get a lump in your throat when it finally registers that he has a child {yes, that's Haley Joel Osment}- watch his face!) and gets fine support especially Wright as the love of his life and Sinise as his best friend (Best Supporting Actor nominee) superior adaptation of Winston Groom's novel by Eric Roth (also an Academy Award recepient) that truly captures lightning in a bottle. Oscars also went to director Robert Zemeckis and for Best Picture. *** One of my all-time favorite flicks. I still cry, particularly Forrest telling Jenny why he loves her so much (\"You're my girl!\") and at the gravesite when the birds fly overhead."
    },
    {
      "username": "schmimic",
      "userUrl": "https://www.imdb.com/user/ur5193064",
      "reviewLink": "https://www.imdb.com/review/rw1067175",
      "warningSpoilers": true,
      "date": "23 April 2005",
      "rate": "10",
      "helpful": "207 out of 269 found this helpful.",
      "title": "Tom Hanks delivers an astounding performance as Forrest Gump.",
      "content": "Starring: Tom Hanks, Robin Wright, Gary Sinise, Sally Field This was flat out one of the best movies of 1994. It won best picture for a reason, along with a few other Academy Awards. I think one of the tag lines for the movie was, \"The world will never be the same once you've seen it through the eyes of Forrest Gump.\" How true. The movie is basically one simple man's journey through life. And what a journey.The movie opens with Forrest (Hanks) sitting at a bus stop, waiting to go see Jenny (Wright) after being apart from her for years. Who is Jenny, you ask? We'll get to that in a minute. Forrest strikes up a conversation or two with the people that come and wait for the bus with him. Or, more accurately, he keeps talking regardless of whether anybody is listening or not. The movie plays out as a flashback, with Forrest taking us through all the major events of his life and narrating them.The flashback starts when Forrest is a little boy, about six years old or so, just at about the age where he should be starting school. We get to take a look at Forrest's childhood as he gets leg braces to straighten out his back, as his momma (Field) fights (and does a few other things) to get him into public school, and as he meets for the first time the love of his life. Jenny. He meets her on the way to school, sitting next to her on the bus, and they strike up a friendship immediately.Eventually we progress to the point where Forrest and Jenny are in high school, and we travel along with Forrest as he makes it onto the football team and gets to go to college. Forrest and Jenny never date, but he's always there to protect her. Anytime he thinks she's in trouble, he rushes to the rescue, ready to beat the ever-loving snot out of anyone who even looks at his Jenny wrong. I think one of my favorite scenes in the movie is when someone is dumb enough to slap Jenny. The film goes slow motion, Forrest's eyes go wide, and he starts charging at this guy like a runaway locomotive, and has the striking force of one too. Watching him beat the crap out of that guy is hilarious.As Forrest grows up and goes through school, college, the army, a Vietnam tour, becomes a ping pong celebrity, a shrimp boat captain, and eventually one of the richest men out there, he also gets to take a few stops in history as the filmmaker gives us his own spin of how he thinks history would have happened if Forrest Gump were there. He gets to meet the President three times, he's the man who exposes the Watergate scandal, he's at the school doors when Governor George Wallace tries to get some Negroes into a white school, and so on and so forth. It's really funny the way they manipulate historical footage to insert Forrest into the events of the past.This is truly a great movie. You'd be a fool to miss it.Bottom Line: 4 out of 4 (own this movie)"
    },
    {
      "username": "john in missouri",
      "userUrl": "https://www.imdb.com/user/ur0731006",
      "reviewLink": "https://www.imdb.com/review/rw1773192",
      "warningSpoilers": false,
      "date": "1 December 2007",
      "rate": "10",
      "helpful": "237 out of 319 found this helpful.",
      "title": "Quite possibly the best movie ever made.",
      "content": "I've seen most of the top-voted 30 or 40 movies here at IMDb, and Forrest Gump probably wins my vote for the single best movie ever made.This is not a conclusion I came to the first time I saw this film, or the second. The more you understand about this movie, the more you like it. And in terms of understanding it, my wife and I both were still gaining new understanding the 5th or 6th time we watched it. (For example: Why does Jenny behave exactly as she does throughout the movie? It'll take a lot of thinking to =fully= understand her.)Just the fact that we've seen it at least half a dozen times says a lot. There are few movies that I ever even give a second viewing. Like many of the truly good movies, there are people out there who see it once and consider it to be a waste of time. Such people are usually just looking for the most \"action,\" gore and sex they can find, and haven't a clue about films that actually involve thought, ideas, and life.Did I mention the script is absolutely brilliant? There are a lot of =truly= funny moments. And the music rocks. But those are only specific aspects of a movie that has just about everything else right about it as well.See it, enjoy it, think about it, see it again. Think about it some more. Forrest Gump is one of the greatest movies -- if not THE greatest -- ever made."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2162181",
      "warningSpoilers": true,
      "date": "22 November 2009",
      "rate": "9",
      "helpful": "40 out of 54 found this helpful.",
      "title": "Beautiful film",
      "content": "Forrest Gump, I think is a beautiful film. Never too schmaltzy, but there are some genuine tearjerkers like Forrest at Jenny's grave. The cinematography is stunning, the costumes are lovely and the scenery is gorgeous. The music is also very calm and relaxing, perhaps adding to the tone of this film. The screenplay is well crafted, and the story is simple. But what made this movie was its simplicity; it never tries to be too complex and is consequently moving. The acting is just as impressive; whilst Tom Hanks's accent is a little awkward in places, my only real criticism of this movie, he gives a truly remarkable performance, though I do think Morgan Freeman deserved the Oscar more for Shawshank. Robin Wright gives possibly the best performance of her career, and Sally Field is very dignified as Forrest's mother. The scene stealer though is Gary Sinise as Lieutenant Dan, a very moving and insightful performance. Overall, an extremely good movie, I will admit I wasn't sure whether I would like it, but the simple answer is this, I do. 9/10 Bethany Cox"
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw2723405",
      "warningSpoilers": false,
      "date": "22 December 2012",
      "rate": "10",
      "helpful": "20 out of 25 found this helpful.",
      "title": "The role of innocence in positive thinking and thus success ...",
      "content": "... seems to be the theme of this film. Forrest Gump has an IQ of 70, is being raised by a single mom, lives in a remote part of the Deep South where there are few opportunities, and has legs that require that he wear braces as a child. Sounds like the recipe for a sad tale or at least a slow death from mediocrity right? No, instead, because Forrest isn't really bright enough to realize the situation he is in, he simply does what he's told to do or what occurs to him to be the right thing at the time and succeeds due to a lack of self doubt. He's told to run and he becomes the star of the Crimson Tide and an All American. When recovering from a war wound, he's taught ping-pong and winds up competing at the global level in China itself. He promises his dying friend Bubba that he'll go ahead with their plans and become a shrimp boat captain and his brand of seafood products becomes a household name.All along the way he never learns the lessons in life that tend to make the rest of us cynical.Gump's childhood sweetheart Jenny starts out with high aspirations - she wants to be like Joan Baez and fight for world peace - and instead she winds up disillusioned, drug addicted, and a near suicide before age 30. She doesn't have Forrest's childlike innocence and this leads her to self-doubt and ultimately failure. Also, fate or \"destiny\" as the film calls it, is not on her side in one big way - her own father molested her as a child, which couldn't help but play a role in the decisions she made. Now Gump does have a bunch of coincidences on his side - call it destiny if you will - the storm that beaches every shrimping vessel in the Gulf of Mexico but his, for example - but in most cases this is just the story of a man going through life without self doubt and that little voice that tells the rest of us \"You can't do that! What are the odds! You'll fail! Make the safe choice!\" To me, this is what this film is about. I think everyone sees something different in it. I highly recommend it as it is truly one of a kind. I remember when it came out it absolutely made professional reviewers crazy that people liked this film, probably because they didn't understand it."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0338909",
      "warningSpoilers": false,
      "date": "1 April 2000",
      "rate": "10",
      "helpful": "162 out of 247 found this helpful.",
      "title": "One of the best films of the 90's",
      "content": "Winston Groom's Forrest Gump was a novel that was complicated, but (Oscar winning) director Robert Zemeckis brings events together with visual effects that boggle even George Lucas. And leading the film in this odyssey of American life is Tom Hanks playing Gump (he won his second Oscar for his portrayal) in a film that shows one man who goes through many events in history to find the one he loves. Well done, well acted, and well directed to pythagorean procision. A++"
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw2206818",
      "warningSpoilers": false,
      "date": "13 February 2010",
      "rate": "10",
      "helpful": "37 out of 51 found this helpful.",
      "title": "The Hand Of An Unseen Providence",
      "content": "When Tom Hanks won his first Oscar for Philadelphia in 1993 the film received a total of five nominations. His second Oscar for Forrest Gump came in a film that received more than double that in nominations and awards. If Forrest Gump did nothing else it solidified Hanks's credentials as a serious actor. He would never be doing imitations of his Bosom Buddies character in films again.It also among other awards also won for Best Picture and Best director for Robert Zemeckis, richly deserved. The film is Huckleberry Finn like in its canny observations coming from the man who had an IQ we are told of 75. But as Forrest also tells us, \"stupid is as stupid does\". And Forrest with the hand of an unseen providence comes out a lot better than some of the clever people he meets in life.Watching the film once again it occurred to me that Mark Twain if he couldn't have written this himself would have loved the way Zemeckis handled the character of Forrest Gump. The beauty of Huckleberry Finn and the secret of its success is that Twain got into the mind of a child who recorded all the events around him, a child without too much education. What Zemeckis did was get Hanks into a child like mind who sees things with amazing clarity stripped of any veneer of pretense. Which Hanks observes in the people around him and in the events that shape America and himself from Eisenhower to Reagan.There are two prominent female parts in Forrest Gump. One is for Robin Wright who plays the abused child Julie as an adult. She is Forrest's love and best friend and she takes a different path of life one she chose with more deliberation than Hanks. Their fates though eventually entwined are radically different. The second major female role is for another two time Oscar winner Sally Field who now is playing matronly parts, a far cry from Gidget and the Flying Nun. She gives Forrest the maxims he lives by and in a crisis they turn out to be more than sound bite clichés.Another award that Forrest Gump won is for Special Effects and an award it didn't win was for Gary Sinise in the role of Lieutenant Dan Taylor, Forrest's commanding officer in Vietnam. That's something that does not compute because the special effects were to show Gary Sinise as a double amputee with both legs lost in Vietnam.It's some amazing bit of work no doubt about it, but to honor it without Sinise whose performance really brings it off is ridiculous. Sinise is the educated one who curses the fate that happened to him, but in the end by just going with the flow he does prosper in the end. Sinise lost that year in Best Supporting Actor category to Martin Landau for Ed Wood, but I think Sinise's performance has had a more lasting impact.To those Americans who serve our country it certainly has. Gary Sinise has devoted a great deal of his life and earned treasure to bring entertainment to our overseas troops in Iraq, Afghanistan, wherever, becoming a successor to Bob Hope in that regard. He's gone further than that though, setting up foundations to help civilians in both countries and contributing to numerous charities dealing with war and its aftermath. Doing that in my humble opinion Gary Sinise has become one of the great Americans of our brand new millenia, a lot more than just an actor. He's forever now known as Lieutenant Dan.In the end though the film belongs to Tom Hanks who joined with Spencer Tracy as the only two male actors to win back to back Oscars for Best Actor. Hanks fascinates us and guides us through this film and when we're done we've seen something very special.If you don't believe me about how good Forrest Gump is, then watch it for a few minutes and see if you're not sucked in. Like Forrest's mama says, the film's like life which is like a box of chocolates, you never know what you'll get until you open it.\""
    },
    {
      "username": "adinutzza2001",
      "userUrl": "https://www.imdb.com/user/ur4780563",
      "reviewLink": "https://www.imdb.com/review/rw1020839",
      "warningSpoilers": true,
      "date": "14 February 2005",
      "rate": "10",
      "helpful": "472 out of 622 found this helpful.",
      "title": "why such a low rating???",
      "content": "What I find completely ridiculous is why this movie, in my opinion one of the best ever, has such a low rating, so I've tried to figure out what some found against it.I noticed that the haters of this movie who make it have a lower rating than it actually deserves mainly argue that it promotes the government's politics of submission: the idea that \"if you're an idiot but you do what you're told then you will be rewarded, but, if you experience life then you're going to die a miserable death.\" I'm not an American myself so i don't have any intention to defend the government or anyone else, but I think that the political events witnessed by the character in the movie make many miss the whole substance of the film. I think these bits of history only add to the magic of the film, making Forrest part of a fantastic world that seems so incredibly real though. How can somebody say that Forrest is just an idiot, an ordinary person who does everything that he is told to do? It appears to me that in fact,in his innocence, Forrest does what he feels he has to do,no matter the situations and the people around him, lead only by an inner sense of right. So what actually seems to be special about Forrest is that, regardless of his intelligence, he has the capacity to discover simple truth and life values that all the others around him miss: he tries to save Bubba endangering his own life, he gives Bubba's family money and mainly displays simple goodness in everything he does. So if you haven't yet seen the movie or you were disappointed by it, try watching it without analyzing things that much and just open your heart towards that world. The brilliant humour, the hilarious yet touching acting, the special effects and the uplifting message are totally rewarding."
    },
    {
      "username": "sundrymules",
      "userUrl": "https://www.imdb.com/user/ur0728464",
      "reviewLink": "https://www.imdb.com/review/rw1107458",
      "warningSpoilers": false,
      "date": "20 June 2005",
      "rate": "10",
      "helpful": "481 out of 581 found this helpful.",
      "title": "The zen of Forrest Gump.",
      "content": "This is a powerful yet charming movie; fun for its special effects and profound in how it keeps you thinking long after it's over. Like others, I've seen this movie more than once. One comment I've never heard is that Forrest's simplicity is almost zen-like. I should read the novel to get the author's intention (I remember some people preferring the book and complaining that no one at the Academy Awards gave him any credit.) But rather than an implication that you should do what you're supposed to do and believe in God and you'll win in the end, I see it as zen-like, i.e., living in the moment and not having expectations or particular cravings (other than his loving Jenny.) So he ends up just stumbling into all the major historical events of the time. Granted, he achieves this only because he doesn't have the brains to think otherwise and actually have expectations, but so many of our problems are because we do have higher intellect and desires, which ironically makes us unhappy because we know what we are missing. We love our cats and dogs for the same simplicity and always being in the moment. There's a line in the movie wondering if everything is predestined or happens randomly or it's a combination of both. It is something to mull over for a long time."
    },
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw3378160",
      "warningSpoilers": false,
      "date": "22 December 2015",
      "rate": "",
      "helpful": "11 out of 13 found this helpful.",
      "title": "a box of chocolate",
      "content": "more than adaptation , it is a visual parable. about vulnerability and its magnificent potential. about innocence and its importance to discover the real essence of life. about love, family, fight and courage. a film like a revolution. because it propose the best manner to be yourself and to not be a victim walking on that way. more than story of Forrest Gump, it is the story of people around him. a film like a Rubick cube - many faces, each for complete right color. and a image who remains its mark - the box of chocolate, the run, the ping - pong match. it seems be the best role of Tom Hanks. in fact, it is definition of a new period after the Cold War. a pledge. about the small things."
    },
    {
      "username": "lacey_joeskip7",
      "userUrl": "https://www.imdb.com/user/ur4065258",
      "reviewLink": "https://www.imdb.com/review/rw1088679",
      "warningSpoilers": false,
      "date": "25 May 2005",
      "rate": "10",
      "helpful": "1,063 out of 1,187 found this helpful.",
      "title": "Life's Lessons in one Movie...",
      "content": "When I first saw this movie I didn't appreciate it like I do now. I think it may have been because I was so young when I first saw it. Just recently I saw the movie again. What an amazing story and moving meaning. That movie teaches you so much about life and the meaning of it. That life isn't as bad as most people make it seem. That an innocent man can impact so many lives with his innocence. The meaning of the movie to me is that everyone needs to have a better outlook on life. That we need to appreciate more of the little things and not let the big things hold us back. That truly although life may throw us trials and tribulations like a box of chocolates but that we have to just bite into it and get through it even if we don't like it. That we all need to hold true to our values and not sink into a place that feels like there's no hope... I just love this movie. And anyone who hasn't seen it or who thinks that don't like it I seriously suggest seeing it or seeing it again. It truly is amazing..."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw6588827",
      "warningSpoilers": false,
      "date": "12 February 2021",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "Mama said ...",
      "content": "Take this with a grain of salt and don't be mad about certain things. Like one of the first flashbacks to the very beginning that does not come over preachy when it talks about the Klan (Ku Klux Klan that is, just in case you think I'm talking about any other Klan). Maybe sometime in the near future there will be a disclaimer and someone giving this context. But until then, you have to be educated enough yourself to understand and comprehend certain things. And you have to have a certain sense of humor to dig all the coincidences that Gump comes across at. It's alike a marathon through many landmarks of the short US history we have behind us. Like the Watergate scandal, Vietnam War, Black Panthers and so much more.If you can dig all that and go with the flow, than the chocolate box this opens up for you, will taste quite delicious. It had been quite a while since I saw this the first time, but it still worked its charme to say the least. Great movie, great actors - you have to be in the right mind set and mood though. And be able to forgive certain things ..."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6399569",
      "warningSpoilers": false,
      "date": "25 December 2020",
      "rate": "10",
      "helpful": "19 out of 26 found this helpful.",
      "title": "Encapsulating...",
      "content": "... all that is, all that was and all that will ever be, through the life experiences of the titular character performed to perfection by Tom Hanks whose generous performance leaves us humbled and in awe of what we can achieve, how we can achieve it and why we would want that achievement in the first instance. A piece of cinematic storytelling that will perpetually resonate no matter who or what you are, where you are going or who you are going with - timeless."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8818424",
      "warningSpoilers": false,
      "date": "22 January 2023",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Thirty years on, and it's still as wonderful.",
      "content": "A very eventful time in America's history, seen through the eyes of one man, Forest Gump, a man who has a very low IQ, a score of just 75.Tom Hanks, we all know just how good an actor he is, but there is something about his performances here that's extra special, he is simply outstanding. He's given many great performances over the years, this has always stood out.Forest sees Vietnam, the moon landings, presidential changes, and experiences a tough childhood and army life, all relayed from a public bench.It's funny, it's moving, it's wonderfully quirky. I have always loved the way they placed him into historical footage, that scene with John Lennon a personal favourite. It's a long film, but it's one that simply flies by.The music is fabulous throughout, some of the best, and most memorable songs of the time, you'll hear the likes of The Mamas and Papas, Scott McKenzie and many more, it's a terrific soundtrack.I saw it aged 14 when it was first released, and maybe didn't appreciate it at the time, now though, I think it's a captivating watch.Keep on running Forest.10/10."
    },
    {
      "username": "fernandez_1989",
      "userUrl": "https://www.imdb.com/user/ur13423395",
      "reviewLink": "https://www.imdb.com/review/rw1551125",
      "warningSpoilers": false,
      "date": "22 December 2006",
      "rate": "",
      "helpful": "198 out of 314 found this helpful.",
      "title": "Tom Hanks' best performance",
      "content": "This awesome movie is about an innocent man who represents how the world should be: he's loyal, humble, honest, he would never cheat or lie. He does everything with good heart and reaches success at the most important tasks of life.Only in America he could live such an interesting life: meet Elvis Presley, President Kennedy, John Lennon... He goes to Vietnam's war and he does everything following his heart. He becomes an American hero. Gary Sinise is a great American actor in his best performance too. He served in Vietnam with Forrest and was also a hero, protecting his men and fighting for his country.All in all this is a must-see movie for everyone, specially for non-Americans, so we can enjoy American culture and icons, as well as learn some American history, which is very useful."
    },
    {
      "username": "jjacques1",
      "userUrl": "https://www.imdb.com/user/ur22775073",
      "reviewLink": "https://www.imdb.com/review/rw4395493",
      "warningSpoilers": true,
      "date": "13 October 2018",
      "rate": "10",
      "helpful": "44 out of 54 found this helpful.",
      "title": "Forrest Gump (Negative Reviewers are Missing the Point)",
      "content": "I am a long time IMDb fan and first time reviewer. When I am reading through fellow user reviews, I generally find myself gravitating towards reading reviews that hold the opposite of my opinion. If I loved a film, I read the poor reviews and vice versa on the films that didn't resonate with me. I like finding value in an opposite viewpoint.With that said, while I read through the negative reviews of Forrest Gump, I found myself thinking that a number of the reviewers might be missing what I see is a large part of the film's message.Their focus was on the characters' intelligence and lifestyle. I read things like the point of the film was that you would be successful even if you're an idiot like Forrest, as long as you walked a conservative path. If you decided to take the path Jenny's character chose, despite the fact she was more intelligent than Forest, your life would end in disaster.I think the differences between Forrest and Jenny's journeys has nothing to do with the disparity in their intelligence or lifestyle but more with the difference between someone who knows who he truly is versus someone who is searching to find out who they are.I don't think the movie is passing judgement on either person's choices. I don't see Jenny's life ending the way it does as being a failure. Her life had value and she was able to find what she was looking for. Forrest's life was incredible and his love for Jenny was his guiding star. He lived through so many experiences and met so many famous people of that era. He lucked into wealth and at a couple points in the film became famous in his own right. None of that had any real meaning to him. His purpose came from his personal relationships, protecting and doing right by those he loved and his strong sense of right and wrong.Each character's journey (again regardless of intelligence) is representative of the experiences of an entire generation of North Americans."
    },
    {
      "username": "tightspotkilo",
      "userUrl": "https://www.imdb.com/user/ur3810449",
      "reviewLink": "https://www.imdb.com/review/rw1978079",
      "warningSpoilers": true,
      "date": "19 November 2008",
      "rate": "10",
      "helpful": "47 out of 72 found this helpful.",
      "title": "An Amazing Movie",
      "content": "I saw this movie in the theaters back in 1994. When it was released on VHS I obtained that version. I've watched the movie about once every two years since then. This is an amazing movie in any number of ways. One big way it amazes me, is the way which it, as a simple and guileless little story, like a feather wafting in the breeze, nevertheless evokes raw rank hatred and eyeball-bulging, forehead vein-popping, spittle-spewing vitriol from liberals and so-called \"intellectuals\" who are absolutely certain that, like a guided missile, it is seeking them out, intentionally, personally, to insult them with rightwing thoughts and ideas, and by a nitwit character no less. Hahahaha. As if.So let's first thing pop that little pea right out of the shooter. Let's dispense with the bilge of this movie being some kind of sub rosa rightwing plot. Puh-leeeze. This is a mainstream Hollywood production. Robert Zemeckis, Tom Hanks, Sally Field, and Robin Wright Penn are all known Hollywood lefties, liberal devotees who would take the pipe long before allowing themselves to be associated with or be used by anything akin a rightwing movie, let alone be openly and voluntarily involved in making one. Bottom line, this is not a political movie. This is not a movie which is making any kind of political or social statements in any respect. People who think it is doing any of that are just working way too hard over-thinking it all. Period. It's odd because it's really not all that complicated of a thing to understand. Which leads directly to another amazing thing about this movie: it is amazing the way the simple little message the movie is actually sending just sails right over so many people's heads. Amazingly they just don't get it, and based on the comments here they still aren't getting it 14 years later and counting. So if you fall into that category let me help you out.What is the message of Forrest Gump? Stripped to its purest essence, this movie is about loyalty and devotion, particularly to the ones in our lives we love and care about. These are the human values being reinforced. Loyalty. Devotion. Forrest Gump embodies loyalty and devotion. To his mama. To his good best buddy Bubba. To the love of his life, Jenny. To his leader, Lt. Dan. And in the end to Forrest Jr. One by one and all together Forrest sticks by and takes care of his family, friends, and loved ones. This is the thread running through the entire story. This is what carries Forrest to all of the remarkable places he goes along the way.The use of a mentally challenged man as the leading man is a conceit, used to illustrate the point that loyalty and devotion are the most important things in life, trumping everything else. It drives home the point that nothing else really matters anywhere near as much. Indeed, it drives it home with blunt force. Maybe it drives it home too hard for such a simple little point. Maybe this is where the movie's detractors get themselves side-tracked. There are a number of other amazing and remarkable things about this movie. The performances. The special effects. The almost poetic simplicity of the story and the way it is told. See it for all this and more, but please, don't over-think it."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw2442544",
      "warningSpoilers": true,
      "date": "12 June 2011",
      "rate": "10",
      "helpful": "15 out of 23 found this helpful.",
      "title": "\"I just felt like running\".",
      "content": "For anyone who grew up in the turbulent Sixties, \"Forrest Gump\" delivers a clever blend of nostalgia mixed with a uniquely creative view of history as experienced by a presumed to be simpleton. While Tom Hanks' character recalls his life with a slow tangy drawl, he variously entertains and educates a host of passengers waiting for the next bus to their intended destination. Some ignore him, some show interest, one even scorns Gump's tale of getting rich in the shrimping business, only to depart before Forrest has a chance to pull out his copy of Fortune Magazine. Life can be like that for those unwilling to listen and learn, casting doubt instead of exploring the truth and keeping an open mind.I got a kick out of Forrest's string of brushes with greatness - the way he taught Elvis how to shake his hips, his unquestioning response to LBJ's inquiry about his war injury, and the way his war time experience inspired John Lennon to write 'Imagine'. There was also that ingenious sequence in which he meets President Nixon, then inadvertently tips off the Watergate scandal. However the most understated and easiest reference to miss was the clever homage paid to the 1969 film \"Midnight Cowboy\", when Forrest wheels Lieutenant Dan (Gary Sinise) across busy city traffic, and is narrowly missed by a taxi cab. Lt. Dan's response was \"Hey, I'm walkin' here\", just the way Ratso Rizzo did in that earlier film. All that with the 'Everybody Talking at Me' movie theme seamlessly woven in as so many songs of that era were utilized with other aspects of the story.For Forrest Gump, life is not a pretentious path to wealth or fame, but a never ending quest to learn and be a productive human being. Not to mention finding one's own true love. For Forrest, life long friend Jenny (Robin Wright) represents an unfulfilled ideal, one he accepts into his heart while still a young schoolboy and nurturing that relationship platonically throughout his adulthood. For her part, Jenny represents a youthful quest for experiencing life to the fullest, only to make a series of wrong choices that lead her to the brink of suicide. It's fitting that Jenny eventually realizes what Forrest knew all along, that they were made for each other even if outward appearances seemed to dictate otherwise.I've seen this film only a couple times in the past, thinking it was good, but only considering it for it's entertainment value. I guess one of the benefits of getting older is the insight one gains with experiencing life a day at a time and steady as she goes. My viewing of the picture today gave me a greater appreciation for the subtleties offered in the film, and leads me to believe the world would be a better place if there were a little more of Forrest Gump in all of us."
    }
  ],
  "errorMessage": ""
}