{
  "imDbId": "tt0109830",
  "title": "Forrest Gump",
  "fullTitle": "Forrest Gump (1994)",
  "type": "Movie",
  "year": "1994",
  "language": "en",
  "titleInLanguage": "Forrest Gump",
  "url": "https://en.wikipedia.org/wiki/Forrest_Gump",
  "plotShort": {
    "plainText": "Forrest Gump is a 1994 American epic comedy-drama film directed by Robert Zemeckis and written by Eric Roth. It is based on the 1986 novel of the same name by Winston Groom and stars Tom Hanks, Robin Wright, Gary Sinise, Mykelti Williamson and Sally Field. The film follows several decades in the life of a slow-witted and kindhearted Alabama man named Forrest Gump (Hanks) and his experiences in the 20th-century United States. The film differs substantially from the novel.\r\nPrincipal photography took place between August and December 1993, mainly in Georgia, North Carolina and South Carolina. Extensive visual effects were used to incorporate Hanks into archived footage and to develop other scenes. The soundtrack features songs reflecting the different periods seen in the film.\r\nForrest Gump was released in the United States on July 6, 1994, and received mostly positive reviews, with critical acclaim for Zemeckis's direction, performances (particularly those of Hanks and Sinise), visual effects, music, and screenplay. The film was an enormous success at the box office; it became the top-grossing film in America released that year and earned over US$678.2 million worldwide during its theatrical run, making it the second-highest-grossing film of 1994, behind The Lion King. The soundtrack sold over 12 million copies. Forrest Gump won six Academy Awards: Best Picture, Best Director, Best Actor for Hanks, Best Adapted Screenplay, Best Visual Effects, and Best Film Editing. It received many award nominations, including Golden Globes, British Academy Film Awards and Screen Actors Guild Awards.\r\nVarious interpretations have been made of the protagonist and the film's political symbolism. In 2011, the Library of Congress selected the film for preservation in the United States National Film Registry as being \"culturally, historically, or aesthetically significant\".",
    "html": "<p>Forrest Gump is a 1994 American epic comedy-drama film directed by Robert Zemeckis and written by Eric Roth. It is based on the 1986 novel of the same name by Winston Groom and stars Tom Hanks, Robin Wright, Gary Sinise, Mykelti Williamson and Sally Field. The film follows several decades in the life of a slow-witted and kindhearted Alabama man named Forrest Gump (Hanks) and his experiences in the 20th-century United States. The film differs substantially from the novel.</p><p>Principal photography took place between August and December 1993, mainly in Georgia, North Carolina and South Carolina. Extensive visual effects were used to incorporate Hanks into archived footage and to develop other scenes. The soundtrack features songs reflecting the different periods seen in the film.</p><p>Forrest Gump was released in the United States on July 6, 1994, and received mostly positive reviews, with critical acclaim for Zemeckis's direction, performances (particularly those of Hanks and Sinise), visual effects, music, and screenplay. The film was an enormous success at the box office; it became the top-grossing film in America released that year and earned over US$678.2 million worldwide during its theatrical run, making it the second-highest-grossing film of 1994, behind The Lion King. The soundtrack sold over 12 million copies. Forrest Gump won six Academy Awards: Best Picture, Best Director, Best Actor for Hanks, Best Adapted Screenplay, Best Visual Effects, and Best Film Editing. It received many award nominations, including Golden Globes, British Academy Film Awards and Screen Actors Guild Awards.</p><p>Various interpretations have been made of the protagonist and the film's political symbolism. In 2011, the Library of Congress selected the film for preservation in the United States National Film Registry as being \"culturally, historically, or aesthetically significant\".</p>"
  },
  "plotFull": {
    "plainText": "Forrest Gump is a 1994 American epic comedy-drama film directed by Robert Zemeckis and written by Eric Roth. It is based on the 1986 novel of the same name by Winston Groom and stars Tom Hanks, Robin Wright, Gary Sinise, Mykelti Williamson and Sally Field. The film follows several decades in the life of a slow-witted and kindhearted Alabama man named Forrest Gump (Hanks) and his experiences in the 20th-century United States. The film differs substantially from the novel.\r\nPrincipal photography took place between August and December 1993, mainly in Georgia, North Carolina and South Carolina. Extensive visual effects were used to incorporate Hanks into archived footage and to develop other scenes. The soundtrack features songs reflecting the different periods seen in the film.\r\nForrest Gump was released in the United States on July 6, 1994, and received mostly positive reviews, with critical acclaim for Zemeckis's direction, performances (particularly those of Hanks and Sinise), visual effects, music, and screenplay. The film was an enormous success at the box office; it became the top-grossing film in America released that year and earned over US$678.2 million worldwide during its theatrical run, making it the second-highest-grossing film of 1994, behind The Lion King. The soundtrack sold over 12 million copies. Forrest Gump won six Academy Awards: Best Picture, Best Director, Best Actor for Hanks, Best Adapted Screenplay, Best Visual Effects, and Best Film Editing. It received many award nominations, including Golden Globes, British Academy Film Awards and Screen Actors Guild Awards.\r\nVarious interpretations have been made of the protagonist and the film's political symbolism. In 2011, the Library of Congress selected the film for preservation in the United States National Film Registry as being \"culturally, historically, or aesthetically significant\".\r\nPlot\r\nIn 1981, a man named Forrest Gump recounts his life story to strangers who happen to sit next to him at a bus stop. As a boy in 1956, Forrest has an IQ of 75 and is fitted with leg braces to correct a curved spine. He lives in Greenbow, Alabama, with his mother, who runs a boarding house and encourages him to live beyond his disabilities. Among their temporary tenants is a young Elvis Presley, who plays the guitar for Forrest and incorporates the boy's jerky dance movements into his performances. On his first day of school, Forrest meets a girl named Jenny Curran, and the two become best friends. Jenny is a victim of sexual abuse at the hands of her widowed, alcoholic father, but she is later removed from his custody.\r\nBullied because of his leg braces and dimwittedness, Forrest flees from a group of children, but when his braces break off, he is revealed to be a fast runner. With this talent, he receives a football scholarship at the University of Alabama in 1962, where he is coached by Bear Bryant, becomes a top kick returner, is named to the All-American team, and meets President John F. Kennedy at the White House. In his first year at college, he witnesses Governor George Wallace's Stand in the Schoolhouse Door and returns a dropped book to Vivian Malone Jones, one of the students admitted over state resistance. He visits Jenny at her college, where the two have an awkward sexual encounter.\r\nAfter graduating from college in 1966, Forrest enlists in the U.S. Army. During basic training, he befriends a fellow soldier named Benjamin Buford Blue (nicknamed \"Bubba\"), who convinces Forrest to go into the shrimping business with him after their service. While on leave, Forrest goes to Memphis, Tennessee, to see Jenny, who was expelled from college for posing in Playboy in her college sweater, and now works as a singer in a strip club. However, he embarrasses her by attacking some patrons who were harassing her, causing the two to part on bad terms. Soon afterwards, Forrest and Bubba are sent to fight in Vietnam, serving with the 9th Infantry Division in the Mekong Delta region under Lieutenant Dan Taylor. After months of routine operations, their platoon is ambushed while on patrol, and several members of the platoon are killed in action, including Bubba. Forrest saves several others, including Lieutenant Dan, who loses both of his lower legs, while Forrest is shot \"in the buttocks.\" While recovering from his wound, Forrest develops a talent for ping pong. Taylor is embittered to have been saved as he would rather have died in combat like his ancestors, and is returned home. Forrest is awarded the Medal of Honor for his heroism by President Lyndon B. Johnson.\r\nAt an anti-war March on the Pentagon rally, Forrest meets Abbie Hoffman, encounters a Black Panther group, and reunites with Jenny, who has become a drug-addicted hippie and anti-war activist, but the two are soon parted again as she departs for San Francisco with her abusive boyfriend, the president of SDS at Berkeley. Forrest plays ping-pong in the special services, competing against Chinese teams in ping-pong diplomacy, becoming a celebrity, and earns himself an interview alongside John Lennon on The Dick Cavett Show, appearing to influence Lennon's song, \"Imagine\". Forrest spends 1972 New Year's Eve in New York City with Lieutenant Dan, who has become an alcoholic, still bitter about his disability and the government's apathy towards Vietnam War veterans. Forrest does not enjoy the company of Lt. Dan's prostitutes, because of his devotion to Jenny, and rejects their advances, leading Lt. Dan to throw them out for insulting Forrest. Forrest's ping-pong success eventually leads to a meeting with President Richard Nixon. He is given a room in the Watergate complex, where he unwittingly exposes the Watergate scandal.\r\nIn 1974, Forrest is honorably discharged from the Army, and returns to Greenbow, where he endorses a company that makes ping-pong paddles. He uses the earnings to buy a shrimping boat in Bayou La Batre, fulfilling his promise to Bubba. Lieutenant Dan joins Forrest, and they initially have little success. After their boat becomes the only one to survive Hurricane Carmen, they pull in huge amounts of shrimp and create the profitable Bubba Gump Shrimp Company. Lieutenant Dan finally thanks Forrest for saving his life. Dan invests his money in early tech companies on the stock market, which Forrest mistakes for \"some kind of fruit company\", and the two become millionaires. Forrest gives half of his earnings to Bubba's family for having inspired the shrimping venture. Forrest returns home to his mother and cares for her during her terminal illness from cancer. After she dies, Forrest spends most of his time volunteering as a gardener at the University of Alabama.\r\nIn 1976, Jenny – recovering from years of drugs and abuse – returns to Forrest. One day, the two are walking, and come across the now-abandoned house of Jenny's father, where Jenny in a rage, throws all the rocks she can find at it, until she collapses in anguish. After some time, Forrest proposes to her, but she turns him down, much to Forrest's dismay. That night she tells Forrest she does love him and they make love, though she leaves the next morning. Heartbroken, Forrest, \"for no particular reason\", starts running, embarking on a relentless cross-country marathon, becoming famous for another feat. Forrest starts to garner many followers, some of whom are struggling businessmen, whom he unwittingly gives inspiration. After a total of about three years, and two and a half months running, Forrest decides to end the run, and returns to Greenbow, much to the surprise of his followers.\r\nIn 1981, Forrest gets a letter from Jenny, asking to visit him, and it turns out that's why he's been waiting at the bus stop. An old lady informs him that the address is only five/six blocks away, and Forrest rushes off. Forrest again reunites with Jenny, who introduces him to her young son, Forrest Gump Jr., revealing that Forrest is his father. Initially shocked at the revelation, Forrest starts to bond with his son. Jenny later tells Forrest she is sick with \"some kind of virus\" and the doctors can't do anything for her. The three move back to Greenbow and Jenny and Forrest finally marry. Among their wedding guests, is Lt. Dan, now walking on titanium alloy prosthetics, with his fiancé, a Vietnamese woman named Susan. Jenny succumbs to her illness a year later. Forrest is devastated by her death but becomes a loving, devoted father to Forrest Jr. as the two engage in activities like ping pong and fishing. Forrest also buys the land that belonged to Jenny's father and has the house demolished. Lastly, Forrest sees his son off on his first day of school.\r\nCast\r\nTom Hanks as Forrest Gump: At an early age, Forrest is deemed to have a below-average IQ of 75. He has an endearing character and shows devotion to his loved ones and duties, character traits that bring him into many life-changing situations. Along the way, he encounters many historical figures and events throughout his life. Michael Conner Humphreys as young Forrest Gump: Hanks revealed in interviews that instead of having Michael copy his accent, he copied Michael's unique accented drawl into the older character's accent.\r\nMichael Conner Humphreys as young Forrest Gump: Hanks revealed in interviews that instead of having Michael copy his accent, he copied Michael's unique accented drawl into the older character's accent.\r\nRobin Wright as Jenny Curran: Forrest's childhood friend with whom he immediately falls in love, and never stops loving throughout his life. A victim of child sexual abuse at the hands of her bitterly widowed father, Jenny embarks on a different path from Forrest, leading a self-destructive life and becoming part of the hippie movement in California in the 1960s and the following Me Decade's sex and drug culture of the 1970s. She re-enters Forrest's life at various times in adulthood. Jenny eventually becomes a waitress in Savannah, Georgia, where she lives in an apartment with her (and Forrest's) son, Forrest Jr. They eventually get married, but soon afterward she dies from complications due to an unnamed disease. This unknown disease was intended by Winston Groom, the author of the original novel, to be Hepatitis C, itself an \"unknown virus\" until defined in April 1989, although some of the makers of the film have said that they intended for the unknown disease to have been HIV/AIDS.Hanna R. Hall as young Jenny Curran\r\nHanna R. Hall as young Jenny Curran\r\nGary Sinise as Lieutenant Dan Taylor: Forrest and Bubba Blue's platoon leader during the Vietnam War, whose ancestors have died in every U.S. war and who regards it as his destiny to do the same. After losing his legs in an ambush and being rescued against his will by Forrest, he is initially bitter and antagonistic toward Forrest for leaving him a \"cripple\" and denying him his family's destiny, falling into a deep depression. He later serves as Forrest's first mate at the Bubba Gump Shrimp Company, gives most of the orders, becoming wealthy with Forrest, and regains his will to live. He ultimately forgives and thanks Forrest for saving his life. By the end of the film, he is engaged to be married to his fiancée Susan and is sporting \"magic legs\" – titanium alloy prosthetics that allow him to walk again.\r\nMykelti Williamson as Benjamin Buford \"Bubba\" Blue: Bubba was originally supposed to be the senior partner in the Bubba Gump Shrimp Company, but due to his death in Vietnam, their platoon leader, Dan Taylor, took his place. The company posthumously carried his name. Forrest later gave Bubba's mother Bubba's share of the business. Throughout filming, Williamson wore a lip attachment to create Bubba's protruding lip.\r\nSally Field as Mrs. Gump: Forrest's mother. Field reflected on the character, \"She's a woman who loves her son unconditionally. ... A lot of her dialogue sounds like slogans, and that's just what she intends.\"\r\nHaley Joel Osment as Forrest Gump Jr.: Osment was cast in the film after the casting director noticed him in a Pizza Hut commercial. It was his debut feature film role.\r\nPeter Dobson as Elvis Presley: Although Kurt Russell was uncredited, he provided the voice for Elvis in the scene.\r\nDick Cavett as himself: Cavett played a de-aged version of himself in the 1970s, with makeup applied to make him appear younger. Consequently, Cavett is the only well-known figure in the film to play a cameo role rather than be represented through the use of archival footage like John Lennon or President John F. Kennedy.\r\nSam Anderson as Principal Hancock: Forrest's elementary school principal.\r\nGeoffrey Blake as Wesley: A member of the SDS group and Jenny's abusive boyfriend\r\nSiobhan Fallon Hogan as Dorothy Harris: The school bus driver who drives Forrest, and later his son, to school\r\nSonny Shroyer as Coach Paul \"Bear\" Bryant\r\nGrand L. Bush, Michael Jace, Conor Kennelly, and Teddy Lane Jr. as the Black Panthers\r\nRichard D'Alessandro as Abbie Hoffman\r\nTiffany Salerno and Marla Sucharetza as \"Cunning\" Carla and \"Long-Limbs\" Lenore: a couple of prostitutes that Forrest and Dan spend a New Year's evening with and later turn away\r\nProduction\r\nPre-production and script\r\n\"The writer, Eric Roth, departed substantially from the book. We flipped the two elements of the book, making the love story primary and the fantastic adventures secondary. Also, the book was cynical and colder than the movie. In the movie, Gump is a completely decent character, always true to his word. He has no agenda and no opinion about anything except Jenny, his mother and God.\"\r\n—director Robert Zemeckis\r\nThe film is based on the 1986 novel by Winston Groom. Both center on the character of Forrest Gump. However, the film primarily focuses on the first eleven chapters of the novel before skipping ahead to the end of the novel with the founding of Bubba Gump Shrimp Co. and the meeting with Forrest Jr. In addition to skipping some parts of the novel, the film adds several aspects to Gump's life that do not occur in the novel, such as his needing leg braces as a child and his run across the United States.\r\nGump's core character and personality are also changed from the novel; among other things, his film character is less of a savant—in the novel, while playing football at the university, he fails craft and gym but receives a perfect score in an advanced physics class he is enrolled in by his coach to satisfy his college requirements. The novel also features Gump as an astronaut, a professional wrestler, and a chess player.\r\nThe book had a bidding war regarding an adaptation even before publication, with Wendy Finerman and Steve Tisch acquiring them by joining forces with Warner Bros., where Finerman's husband Mark Canton was president of production. Groom was paid $500,000 and also wrote the first three first drafts of the screenplay, which leaned closer to the events of the novel. After Rain Man told the story of a savant, Warner lost interest in the picture, and by 1990 the project was in turnaround. Finerman contacted Columbia Pictures, who went on reject it, while hiring Eric Roth to rewrite the script. Roth and Finerman kept in contact with Groom to ensure the script was historically accurate. Roth delivered a screenplay in 1992, which Paramount executive Sherry Lansing liked enough to bring the project to her studio, who acquired the rights from Warner in exchange for the script for Executive Decision.\r\nIvan Reitman, Penny Marshall and Terry Gilliam passed on the project before Robert Zemeckis was hired. Barry Sonnenfeld was attached to the film, but left to direct Addams Family Values.\r\nCasting\r\nJohn Travolta was the original choice to play the title role and says passing on the role was a mistake. Bill Murray and Chevy Chase were also considered for the role. Sean Penn stated in an interview having been second choice for the role. Hanks revealed that he signed on to the film after an hour and a half of reading the script. He initially wanted to ease Forrest's pronounced Southern accent but was eventually persuaded by director Robert Zemeckis to portray the heavy accent stressed in the novel. Hanks also said it took him three days to learn how to play the role, and footage from that time could not be included. Winston Groom, who wrote the original novel, describes the film as having taken the \"rough edges\" off the character whom he had envisioned being played by John Goodman. Additionally, Tom's younger brother Jim Hanks is his acting double in the movie for the scenes when Forrest runs across the U.S. Tom's daughter Elizabeth Hanks appears in the movie as the girl on the school bus who refuses to let young Forrest (Michael Conner Humphreys) sit next to her. Joe Pesci was considered for the role of Lieutenant Dan Taylor, which was eventually given to Gary Sinise. David Alan Grier, Ice Cube and Dave Chappelle were offered the role of Benjamin Buford Blue, but all three turned it down. Chappelle, who said he believed the film would be unsuccessful, has been reported as saying that he regrets not taking the role. Hanks was aware of Chappelle's disappointment in missing out on the part and agreed to work with him in a future movie, which ended up being You've Got Mail. Rapper Tupac Shakur also auditioned.\r\nFilming\r\nFilming began in August 1993 and ended in December of that year. Although most of the film is set in Alabama, filming took place mainly in and around Beaufort, South Carolina, as well as parts of coastal Virginia and North Carolina, including a running shot on the Blue Ridge Parkway. Downtown portions of the fictional town of Greenbow were filmed in Varnville, South Carolina. The scene of Forrest running through Vietnam while under fire was filmed on Hunting Island State Park and Fripp Island, South Carolina. Additional filming took place on the Biltmore Estate in Asheville, North Carolina and along the Blue Ridge Parkway near Boone, North Carolina. The most notable place was Grandfather Mountain where a part of the road subsequently became known as \"Forrest Gump Curve\".\r\nThe Gump family home set was built along the Combahee River near Yemassee, South Carolina, and the nearby land was used to film Curran's home as well as some of the Vietnam scenes. Over 20 palmetto trees were planted to improve the Vietnam scenes. Forrest Gump narrated his life's story at the northern edge of Chippewa Square in Savannah, Georgia as he sat at a bus stop bench. There were other scenes filmed in and around the Savannah area as well, including a running shot on the Richard V. Woods Memorial Bridge in Beaufort while he was being interviewed by the press, and on West Bay Street in Savannah. Most of the college campus scenes were filmed in Los Angeles at the University of Southern California. The lighthouse that Forrest runs across to reach the Atlantic Ocean the first time is the Marshall Point Lighthouse in Port Clyde, Maine. Additional scenes were filmed in Arizona, Utah's Monument Valley, and Montana's Glacier National Park.\r\nVisual effects\r\nKen Ralston and his team at Industrial Light & Magic were responsible for the film's visual effects. Using CGI techniques, it was possible to depict Gump meeting deceased personages and shaking their hands. Hanks was first shot against a blue screen along with reference markers so that he could line up with the archive footage. To record the voices of the historical figures, voice actors were filmed and special effects were used to alter lip-syncing for the new dialogue. Archival footage was used and with the help of such techniques as chroma key, image warping, morphing, and rotoscoping, Hanks was integrated into it.\r\nIn one Vietnam War scene, Gump carries Bubba away from an incoming napalm attack. To create the effect, stunt actors were initially used for compositing purposes. Then, Hanks and Williamson were filmed, with Williamson supported by a cable wire as Hanks ran with him. The explosion was then filmed, and the actors were digitally added to appear just in front of the explosions. The jet fighters and napalm canisters were also added by CGI.\r\nThe CGI removal of actor Gary Sinise's legs, after his character had them amputated, was achieved by wrapping his legs with a blue fabric, which later facilitated the work of the \"roto-paint\" team to paint out his legs from every single frame. At one point, while hoisting himself into his wheelchair, his legs are used for support.\r\nThe scene where Forrest spots Jenny at a peace rally at the Lincoln Memorial and Reflecting Pool in Washington, D.C., required visual effects to create the large crowd of people. Over two days of filming, approximately 1,500 extras were used. At each successive take, the extras were rearranged and moved into a different quadrant away from the camera. With the help of computers, the extras were multiplied to create a crowd of several hundred thousand people.\r\nReception\r\nBox office\r\nProduced on a budget of $55 million, Forrest Gump opened in 1,595 theaters in the United States and Canada grossing $24,450,602 in its opening weekend. Motion picture business consultant and screenwriter Jeffrey Hilton suggested to producer Wendy Finerman to double the P&A (film marketing budget) based on his viewing of an early print of the film. The budget was immediately increased, in line with his advice. In its opening weekend, the film placed first at the US box office, narrowly beating The Lion King, which was in its fourth week of release. For the first twelve weeks of release, the film was in the top 3 at the US box office, topping the list 5 times, including in its tenth week of release. Paramount removed the film from release in the United States when its gross hit $300 million in January 1995, and it was the second-highest-grossing film of the year behind The Lion King with $305 million. The film was reissued on February 17, 1995, after the Academy Awards nominations were announced. After the reissue in 1,100 theaters, the film grossed an additional $29 million in the United States and Canada, bringing its total to $329.7 million, making it the third-highest-grossing film at that time behind only E.T. the Extra-Terrestrial and Jurassic Park, and was Paramount's biggest, surpassing Raiders of the Lost Ark. Forrest Gump held the record for being the highest-grossing Paramount film until it was taken by Titanic three years later in 1997. For 12 years, it remained as the highest-grossing film starring Tom Hanks until 2006 when it was surpassed by The Da Vinci Code. Box Office Mojo estimates that the film sold over 78.5 million tickets in the US and Canada in its initial theatrical run.\r\nThe film took 66 days to surpass $250 million and was the fastest grossing Paramount film to pass $100 million, $200 million, and $300 million in box office receipts (at the time of its release). After reissues, the film has gross receipts of $330,252,182 in the U.S. and Canada and $347,693,217 in international markets for a total of $677,945,399 worldwide. Even with such revenue, the film was known as a \"successful failure\"—due to distributors' and exhibitors' high fees, Paramount's \"losses\" clocked in at $62 million, leaving executives realizing the necessity of better deals. This has also been associated with Hollywood accounting, where expenses are inflated in order to minimize profit sharing. It is Robert Zemeckis' highest-grossing film to date.\r\nCritical reception\r\nOn the review aggregator website Rotten Tomatoes, 71% of 106 critics' reviews are positive, with an average rating of 7.5/10. The website's consensus reads: \"Forrest Gump may be an overly sentimental film with a somewhat problematic message, but its sweetness and charm are usually enough to approximate true depth and grace.\" At the website Metacritic, the film earned a rating of 82 out of 100 based on 20 reviews by mainstream critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film a rare \"A+\" grade.\r\nThe story was commended by several critics. Roger Ebert of the Chicago Sun-Times wrote, \"I've never met anyone like Forrest Gump in a movie before, and for that matter I've never seen a movie quite like 'Forrest Gump.' Any attempt to describe him will risk making the movie seem more conventional than it is, but let me try. It's a comedy, I guess. Or maybe a drama. Or a dream. The screenplay by Eric Roth has the complexity of modern fiction...The performance is a breathtaking balancing act between comedy and sadness, in a story rich in big laughs and quiet truths...What a magical movie.\" Todd McCarthy of Variety wrote that the film \"has been very well worked out on all levels, and manages the difficult feat of being an intimate, even delicate tale played with an appealingly light touch against an epic backdrop.\" In contrast, Anthony Lane of The New Yorker called the film \"Warm, wise, and wearisome as hell.\" Owen Gleiberman of Entertainment Weekly said that the film was \"glib, shallow, and monotonous\" and \"reduces the tumult of the last few decades to a virtual-reality theme park: a baby-boomer version of Disney's America.\"\r\nGump garnered comparisons to fictional character Huckleberry Finn, as well as U.S. politicians Ronald Reagan, Pat Buchanan and Bill Clinton. Peter Chomo writes that Gump acts as a \"social mediator and as an agent of redemption in divided times\". Peter Travers of Rolling Stone called Gump \"everything we admire in the American character – honest, brave, and loyal with a heart of gold.\" The New York Times reviewer Janet Maslin called Gump a \"hollow man\" who is \"self-congratulatory in his blissful ignorance, warmly embraced as the embodiment of absolutely nothing.\" Marc Vincenti of Palo Alto Weekly called the character \"a pitiful stooge taking the pie of life in the face, thoughtfully licking his fingers.\" Bruce Kawin and Gerald Mast's textbook on film history notes that Forrest Gump's dimness was a metaphor for glamorized nostalgia in that he represented a blank slate onto which the Baby Boomer generation projected their memories of those events.\r\nRe-evaluation\r\nIn the 21st century, the film became negatively re-evaluated. Writing in 2004, Entertainment Weekly said, \"Nearly a decade after it earned gazillions and swept the Oscars, Robert Zemeckis's ode to 20th-century America still represents one of cinema's most clearly drawn lines in the sand. One half of folks see it as an artificial piece of pop melodrama, while everyone else raves that it's sweet as a box of chocolates.\" On the other hand though \"Despite many, often special-effects-generated laughs, and several genuinely touching moments, one wishes that Forrest Gump were a sarcastic cautionary tale about the dangers of a simple-minded, apolitical America and not the anti-intellectual, mostly conservative fantasy it is,\"\" in other words, the film has been criticized for its perceived conservative politics. Writing for Indiewire in 2019, Eric Kohn said: \"This no-nothing white man becomes a war hero and a wealthy man simply by chugging along, participating in a country that dictates his every move. He never comprehends racism or the complexities of Vietnam; the movie portrays political activism and hippy culture as a giant cartoon beyond Forrest’s understanding, while presenting his apolitical stance as the height of all virtue.\" Furthermore, in a 2014 article for CNN discussing the film's reassessment, Brandon Griggs wrote of possible readings against the film \"Forrest, as played by Tom Hanks, is the epitome of wholesome decency: a God-fearing, All-American football player and war hero who has no use for the counterculture movements of the late '60s. Despite an IQ of 75, he achieves fame and financial success. He's even from red-state Alabama!\"\r\nIn a 2014 retrospective for the film's 20th anniversary re-release, Amy Nicholson criticized the film for being apolitical, writing \"Forrest doesn't kill anyone. He doesn't get PTSD. He doesn't even have a clue why he's in Vietnam. The film is so afraid to dredge up debate that when Abbie Hoffman hands Forrest the microphone at an antiwar rally, someone unplugs the speakers so we can't hear him — fitting for a movie with nothing to say.\" LGBTQ+ critics have criticized the \"shallow\" portrayal of the AIDS epidemic, one that \"sidesteps the significance of the disease by erasing its mere mention\". In 2015, The Hollywood Reporter polled hundreds of academy members, asking them to re-vote on past controversial decisions. Academy members said that, given a second chance, they would award the 1994 Oscar for Best Picture to The Shawshank Redemption instead.\r\nAuthor payment controversy\r\nWinston Groom was paid $350,000 for the screenplay rights to his novel Forrest Gump and was contracted for a 3 percent share of the film's net profits. However, Paramount and the film's producers did not pay him the percentage, using Hollywood accounting to posit that the blockbuster film lost money. Tom Hanks, by contrast, contracted for a percent share of the film's gross receipts instead of a salary, and he and director Zemeckis each received $40 million. In addition, Groom was not mentioned once in any of the film's six Oscar-winner speeches.\r\nGroom's dispute with Paramount was later effectively resolved after Groom declared he was satisfied with Paramount's explanation of their accounting, this coinciding with Groom receiving a seven-figure contract with Paramount for film rights to another of his books, Gump & Co. This film was never made, remaining in development hell for at least a dozen years.\r\nHome video\r\nForrest Gump was first released on VHS on April 27, 1995, and on Laserdisc the following day. The laserdisc was THX certified and released without chapters, requiring the film be watched start to finish. Film magazines of the period stated this was at the request of Zemeckis who wanted viewers to enjoy the film in its entirety. It became the best-selling adult sell-through video with sales of over 12 million. A widescreen VHS release debuted a year later on September 10, 1996. It was released in a two-disc DVD set on August 28, 2001. Special features included director and producer commentaries, production featurettes, and screen tests. The film was released on Blu-ray in November 2009. Paramount released the film on Ultra HD Blu-ray in June 2018. On May 7, 2019, Paramount Pictures released a newly remastered two-disc Blu-ray that contains bonus content.\r\nAccolades\r\nForrest Gump won Best Picture, Best Actor in a Leading Role (Hanks had won the previous year for Philadelphia), Best Director, Best Visual Effects, Best Adapted Screenplay, and Best Film Editing at the 67th Academy Awards. The film was nominated for seven Golden Globe Awards, winning three of them: Best Actor – Motion Picture Drama, Best Director – Motion Picture, and Best Motion Picture – Drama. The film was also nominated for six Saturn Awards and won two for Best Fantasy Film and Best Supporting Actor (Film).\r\nIn addition to the film's multiple awards and nominations, it has also been recognized by the American Film Institute on several of its lists. The film ranks 37th on 100 Years...100 Cheers, 71st on 100 Years...100 Movies, and 76th on 100 Years...100 Movies (10th Anniversary Edition). In addition, the quote \"Mama always said life was like a box of chocolates. You never know what you're gonna get,\" was ranked 40th on 100 Years...100 Movie Quotes. The film also ranked at number 61 on Empire's list of the 100 Greatest Movies of All Time.\r\nIn December 2011, Forrest Gump was selected for preservation in the Library of Congress' National Film Registry. The Registry said that the film was \"honored for its technological innovations (the digital insertion of Gump seamlessly into vintage archival footage), its resonance within the culture that has elevated Gump (and what he represents in terms of American innocence) to the status of folk hero, and its attempt to engage both playfully and seriously with contentious aspects of the era's traumatic history.\"\r\nAmerican Film Institute lists\r\nAFI's 100 Years...100 Movies – #71\r\nAFI's 100 Years...100 Laughs – Nominated\r\nAFI's 100 Years...100 Passions – Nominated\r\nAFI's 100 Years...100 Heroes and Villains: Forrest Gump – Nominated Hero\r\nForrest Gump – Nominated Hero\r\nAFI's 100 Years...100 Movie Quotes: \"Mama always said life was like a box of chocolates. You never know what you're gonna get.\" – #40 \"Mama says, 'Stupid is as stupid does.'\" – Nominated\r\n\"Mama always said life was like a box of chocolates. You never know what you're gonna get.\" – #40\r\n\"Mama says, 'Stupid is as stupid does.'\" – Nominated\r\nAFI's 100 Years of Film Scores – Nominated\r\nAFI's 100 Years...100 Cheers – #37\r\nAFI's 100 Years...100 Movies (10th Anniversary Edition) – #76\r\nAFI's 10 Top 10 – Nominated Epic Film\r\nSymbolism\r\nFeather\r\n\"I don't want to sound like a bad version of 'the child within'. But the childlike innocence of Forrest Gump is what we all once had. It's an emotional journey. You laugh and cry. It does what movies are supposed to do: make you feel alive.\"\r\n—producer Wendy Finerman\r\nVarious interpretations have been suggested for the feather present at the opening and conclusion of the film. Sarah Lyall of The New York Times noted several suggestions made about the feather: \"Does the white feather symbolize The Unbearable Lightness of Being? Forrest Gump's impaired intellect? The randomness of experience?\" Hanks interpreted the feather as: \"Our destiny is only defined by how we deal with the chance elements to our life and that's kind of the embodiment of the feather as it comes in. Here is this thing that can land anywhere and that it lands at your feet. It has theological implications that are really huge.\" Sally Field compared the feather to fate, saying: \"It blows in the wind and just touches down here or there. Was it planned or was it just perchance?\" Visual effects supervisor Ken Ralston compared the feather to an abstract painting: \"It can mean so many things to so many different people.\"\r\nPolitical interpretations\r\nHanks states that \"the film is non-political and thus non-judgmental\". Nevertheless, CNN's Crossfire debated in 1994 whether the film promoted conservative values or was an indictment of the counterculture movement of the 1960s. Thomas Byers called it \"an aggressively conservative film\" in a Modern Fiction Studies article.\r\nAll over the political map, people have been calling Forrest their own. But, Forrest Gump isn't about politics or conservative values. It's about humanity, it's about respect, tolerance and unconditional love.\r\n—producer Steve Tisch\r\nIt has been noted that while Gump follows a very conservative lifestyle, Jenny's life is full of countercultural embrace, complete with drug use, promiscuity, and antiwar rallies, and that their eventual marriage might be a kind of reconciliation. Jennifer Hyland Wang argues in a Cinema Journal article that Jenny's death to an unnamed virus \"symbolizes the death of liberal America and the death of the protests that defined a decade\" in the 1960s. She also notes that the film's screenwriter, Eric Roth, developed the screenplay from the novel and transferred to Jenny \"all of Gump's flaws and most of the excesses committed by Americans in the 1960s and 1970s\".\r\nOther commentators believe the film forecast the 1994 Republican Revolution and used the image of Forrest Gump to promote movement leader Newt Gingrich's traditional, conservative values. Jennifer Hyland Wang observes that the film idealizes the 1950s, as made evident by the lack of \"Whites Only\"-signs in Gump's Southern childhood, and envisions the 1960s as a period of social conflict and confusion. She argues that this sharp contrast between the decades criticizes the counterculture values and reaffirms conservatism. Wang argues that the film was used by Republican politicians to illustrate a \"traditional version of recent history\" to gear voters toward their ideology for the congressional elections. Presidential candidate Bob Dole stated that the film's message was \"no matter how great the adversity, the American Dream is within everybody's reach\".\r\nIn 1995, National Review included Forrest Gump in its list of the \"Best 100 Conservative Movies\" of all time, and ranked it number four on its \"25 Best Conservative Movies of the Last 25 Years\" list. National Review's John Miller wrote that \"Tom Hanks plays the title-character, an amiable dunce who is far too smart to embrace the lethal values of the 1960s. The love of his life, wonderfully played by Robin Wright Penn, chooses a different path; she becomes a drug-addled hippie, with disastrous results.\"\r\nProfessor James Burton at Salisbury University argues that conservatives claimed Forrest Gump as their own due less to the content of the film and more to the historical and cultural context of 1994. Burton claims that the film's content and advertising campaign were affected by the cultural climate of the 1990s, which emphasized family-values and American values, epitomized in the book Hollywood vs. America. He claims that this climate influenced the apolitical nature of the film, which allowed many different political interpretations.\r\nSome commentators see the conservative readings of Forrest Gump as indicating the death of irony in American culture. Vivian Sobchack notes that the film's humor and irony rely on the assumption of the audience's historical knowledge.\r\nSoundtrack\r\nThe 32-song soundtrack from the film was released on July 6, 1994. With the exception of a lengthy suite from Alan Silvestri's score, all the songs are previously released; the soundtrack includes songs from Bob Dylan, Elvis Presley, Creedence Clearwater Revival, Aretha Franklin, Lynyrd Skynyrd, Three Dog Night, the Byrds, the Beach Boys, the Jimi Hendrix Experience, the Doors, the Mamas & the Papas, the Doobie Brothers, Simon & Garfunkel, Bob Seger, and Buffalo Springfield among others. Music producer Joel Sill reflected on compiling the soundtrack: \"We wanted to have very recognizable material that would pinpoint time periods, yet we didn't want to interfere with what was happening cinematically.\" The two-disc album has a variety of music from the 1950s–1980s performed by American artists. According to Sill, this was due to Zemeckis' request, \"All the material in there is American. Bob (Zemeckis) felt strongly about it. He felt that Forrest wouldn't buy anything but American.\"\r\nThe soundtrack reached a peak of number 2 on the Billboard album chart. The soundtrack went on to sell twelve million copies, and is one of the top selling albums in the US. The Oscar-nominated score for the film was composed and conducted by Alan Silvestri and released on August 2, 1994.\r\nAdaptations\r\nNovel-sequel\r\nThe screenplay for the sequel was written by Eric Roth in 2001. It is based on the original novel's sequel, Gump and Co., written by Winston Groom in 1995. Roth's script begins with Forrest sitting on a bench waiting for his son to return from school. After the September 11 attacks, Roth, Zemeckis, and Hanks decided the story was no longer \"relevant.\" In March 2007, however, it was reported Paramount producers took another look at the screenplay.\r\nOn the first page of the sequel novel, Forrest Gump tells readers \"Don't never let nobody make a movie of your life's story,\" and \"Whether they get it right or wrong, it doesn't matter.\" The first chapter of the book suggests the real-life events surrounding the film have been incorporated into Forrest's storyline, and that Forrest got a lot of media attention as a result of the film. During the course of the sequel novel, Gump runs into Tom Hanks and at the end of the novel in the film's release, includes Gump going on The David Letterman Show and attending the Academy Awards.\r\nRemake\r\nThe Indian film, Laal Singh Chaddha, released in August 2022 and starring Aamir Khan in the title role, is an official remake of Forrest Gump set in India between the late 1970s and the 2010s. The film was directed by Advait Chandan and produced by Aamir Khan Productions, Viacom18 Studios and Paramount Pictures.",
    "html": "<p>Forrest Gump is a 1994 American epic comedy-drama film directed by Robert Zemeckis and written by Eric Roth. It is based on the 1986 novel of the same name by Winston Groom and stars Tom Hanks, Robin Wright, Gary Sinise, Mykelti Williamson and Sally Field. The film follows several decades in the life of a slow-witted and kindhearted Alabama man named Forrest Gump (Hanks) and his experiences in the 20th-century United States. The film differs substantially from the novel.</p><p>Principal photography took place between August and December 1993, mainly in Georgia, North Carolina and South Carolina. Extensive visual effects were used to incorporate Hanks into archived footage and to develop other scenes. The soundtrack features songs reflecting the different periods seen in the film.</p><p>Forrest Gump was released in the United States on July 6, 1994, and received mostly positive reviews, with critical acclaim for Zemeckis's direction, performances (particularly those of Hanks and Sinise), visual effects, music, and screenplay. The film was an enormous success at the box office; it became the top-grossing film in America released that year and earned over US$678.2 million worldwide during its theatrical run, making it the second-highest-grossing film of 1994, behind The Lion King. The soundtrack sold over 12 million copies. Forrest Gump won six Academy Awards: Best Picture, Best Director, Best Actor for Hanks, Best Adapted Screenplay, Best Visual Effects, and Best Film Editing. It received many award nominations, including Golden Globes, British Academy Film Awards and Screen Actors Guild Awards.</p><p>Various interpretations have been made of the protagonist and the film's political symbolism. In 2011, the Library of Congress selected the film for preservation in the United States National Film Registry as being \"culturally, historically, or aesthetically significant\".</p><br/><h3>Plot</h3><p>In 1981, a man named Forrest Gump recounts his life story to strangers who happen to sit next to him at a bus stop. As a boy in 1956, Forrest has an IQ of 75 and is fitted with leg braces to correct a curved spine. He lives in Greenbow, Alabama, with his mother, who runs a boarding house and encourages him to live beyond his disabilities. Among their temporary tenants is a young Elvis Presley, who plays the guitar for Forrest and incorporates the boy's jerky dance movements into his performances. On his first day of school, Forrest meets a girl named Jenny Curran, and the two become best friends. Jenny is a victim of sexual abuse at the hands of her widowed, alcoholic father, but she is later removed from his custody.</p><p>Bullied because of his leg braces and dimwittedness, Forrest flees from a group of children, but when his braces break off, he is revealed to be a fast runner. With this talent, he receives a football scholarship at the University of Alabama in 1962, where he is coached by Bear Bryant, becomes a top kick returner, is named to the All-American team, and meets President John F. Kennedy at the White House. In his first year at college, he witnesses Governor George Wallace's Stand in the Schoolhouse Door and returns a dropped book to Vivian Malone Jones, one of the students admitted over state resistance. He visits Jenny at her college, where the two have an awkward sexual encounter.</p><p>After graduating from college in 1966, Forrest enlists in the U.S. Army. During basic training, he befriends a fellow soldier named Benjamin Buford Blue (nicknamed \"Bubba\"), who convinces Forrest to go into the shrimping business with him after their service. While on leave, Forrest goes to Memphis, Tennessee, to see Jenny, who was expelled from college for posing in Playboy in her college sweater, and now works as a singer in a strip club. However, he embarrasses her by attacking some patrons who were harassing her, causing the two to part on bad terms. Soon afterwards, Forrest and Bubba are sent to fight in Vietnam, serving with the 9th Infantry Division in the Mekong Delta region under Lieutenant Dan Taylor. After months of routine operations, their platoon is ambushed while on patrol, and several members of the platoon are killed in action, including Bubba. Forrest saves several others, including Lieutenant Dan, who loses both of his lower legs, while Forrest is shot \"in the buttocks.\" While recovering from his wound, Forrest develops a talent for ping pong. Taylor is embittered to have been saved as he would rather have died in combat like his ancestors, and is returned home. Forrest is awarded the Medal of Honor for his heroism by President Lyndon B. Johnson.</p><p>At an anti-war March on the Pentagon rally, Forrest meets Abbie Hoffman, encounters a Black Panther group, and reunites with Jenny, who has become a drug-addicted hippie and anti-war activist, but the two are soon parted again as she departs for San Francisco with her abusive boyfriend, the president of SDS at Berkeley. Forrest plays ping-pong in the special services, competing against Chinese teams in ping-pong diplomacy, becoming a celebrity, and earns himself an interview alongside John Lennon on The Dick Cavett Show, appearing to influence Lennon's song, \"Imagine\". Forrest spends 1972 New Year's Eve in New York City with Lieutenant Dan, who has become an alcoholic, still bitter about his disability and the government's apathy towards Vietnam War veterans. Forrest does not enjoy the company of Lt. Dan's prostitutes, because of his devotion to Jenny, and rejects their advances, leading Lt. Dan to throw them out for insulting Forrest. Forrest's ping-pong success eventually leads to a meeting with President Richard Nixon. He is given a room in the Watergate complex, where he unwittingly exposes the Watergate scandal.</p><p>In 1974, Forrest is honorably discharged from the Army, and returns to Greenbow, where he endorses a company that makes ping-pong paddles. He uses the earnings to buy a shrimping boat in Bayou La Batre, fulfilling his promise to Bubba. Lieutenant Dan joins Forrest, and they initially have little success. After their boat becomes the only one to survive Hurricane Carmen, they pull in huge amounts of shrimp and create the profitable Bubba Gump Shrimp Company. Lieutenant Dan finally thanks Forrest for saving his life. Dan invests his money in early tech companies on the stock market, which Forrest mistakes for \"some kind of fruit company\", and the two become millionaires. Forrest gives half of his earnings to Bubba's family for having inspired the shrimping venture. Forrest returns home to his mother and cares for her during her terminal illness from cancer. After she dies, Forrest spends most of his time volunteering as a gardener at the University of Alabama.</p><p>In 1976, Jenny – recovering from years of drugs and abuse – returns to Forrest. One day, the two are walking, and come across the now-abandoned house of Jenny's father, where Jenny in a rage, throws all the rocks she can find at it, until she collapses in anguish. After some time, Forrest proposes to her, but she turns him down, much to Forrest's dismay. That night she tells Forrest she does love him and they make love, though she leaves the next morning. Heartbroken, Forrest, \"for no particular reason\", starts running, embarking on a relentless cross-country marathon, becoming famous for another feat. Forrest starts to garner many followers, some of whom are struggling businessmen, whom he unwittingly gives inspiration. After a total of about three years, and two and a half months running, Forrest decides to end the run, and returns to Greenbow, much to the surprise of his followers.</p><p>In 1981, Forrest gets a letter from Jenny, asking to visit him, and it turns out that's why he's been waiting at the bus stop. An old lady informs him that the address is only five/six blocks away, and Forrest rushes off. Forrest again reunites with Jenny, who introduces him to her young son, Forrest Gump Jr., revealing that Forrest is his father. Initially shocked at the revelation, Forrest starts to bond with his son. Jenny later tells Forrest she is sick with \"some kind of virus\" and the doctors can't do anything for her. The three move back to Greenbow and Jenny and Forrest finally marry. Among their wedding guests, is Lt. Dan, now walking on titanium alloy prosthetics, with his fiancé, a Vietnamese woman named Susan. Jenny succumbs to her illness a year later. Forrest is devastated by her death but becomes a loving, devoted father to Forrest Jr. as the two engage in activities like ping pong and fishing. Forrest also buys the land that belonged to Jenny's father and has the house demolished. Lastly, Forrest sees his son off on his first day of school.</p><br/><h3>Cast</h3><ul><li>Tom Hanks as Forrest Gump: At an early age, Forrest is deemed to have a below-average IQ of 75. He has an endearing character and shows devotion to his loved ones and duties, character traits that bring him into many life-changing situations. Along the way, he encounters many historical figures and events throughout his life. Michael Conner Humphreys as young Forrest Gump: Hanks revealed in interviews that instead of having Michael copy his accent, he copied Michael's unique accented drawl into the older character's accent.</li><li>Michael Conner Humphreys as young Forrest Gump: Hanks revealed in interviews that instead of having Michael copy his accent, he copied Michael's unique accented drawl into the older character's accent.</li><li>Robin Wright as Jenny Curran: Forrest's childhood friend with whom he immediately falls in love, and never stops loving throughout his life. A victim of child sexual abuse at the hands of her bitterly widowed father, Jenny embarks on a different path from Forrest, leading a self-destructive life and becoming part of the hippie movement in California in the 1960s and the following Me Decade's sex and drug culture of the 1970s. She re-enters Forrest's life at various times in adulthood. Jenny eventually becomes a waitress in Savannah, Georgia, where she lives in an apartment with her (and Forrest's) son, Forrest Jr. They eventually get married, but soon afterward she dies from complications due to an unnamed disease. This unknown disease was intended by Winston Groom, the author of the original novel, to be Hepatitis C, itself an \"unknown virus\" until defined in April 1989, although some of the makers of the film have said that they intended for the unknown disease to have been HIV/AIDS.Hanna R. Hall as young Jenny Curran</li><li>Hanna R. Hall as young Jenny Curran</li><li>Gary Sinise as Lieutenant Dan Taylor: Forrest and Bubba Blue's platoon leader during the Vietnam War, whose ancestors have died in every U.S. war and who regards it as his destiny to do the same. After losing his legs in an ambush and being rescued against his will by Forrest, he is initially bitter and antagonistic toward Forrest for leaving him a \"cripple\" and denying him his family's destiny, falling into a deep depression. He later serves as Forrest's first mate at the Bubba Gump Shrimp Company, gives most of the orders, becoming wealthy with Forrest, and regains his will to live. He ultimately forgives and thanks Forrest for saving his life. By the end of the film, he is engaged to be married to his fiancée Susan and is sporting \"magic legs\" – titanium alloy prosthetics that allow him to walk again.</li><li>Mykelti Williamson as Benjamin Buford \"Bubba\" Blue: Bubba was originally supposed to be the senior partner in the Bubba Gump Shrimp Company, but due to his death in Vietnam, their platoon leader, Dan Taylor, took his place. The company posthumously carried his name. Forrest later gave Bubba's mother Bubba's share of the business. Throughout filming, Williamson wore a lip attachment to create Bubba's protruding lip.</li><li>Sally Field as Mrs. Gump: Forrest's mother. Field reflected on the character, \"She's a woman who loves her son unconditionally. ... A lot of her dialogue sounds like slogans, and that's just what she intends.\"</li><li>Haley Joel Osment as Forrest Gump Jr.: Osment was cast in the film after the casting director noticed him in a Pizza Hut commercial. It was his debut feature film role.</li><li>Peter Dobson as Elvis Presley: Although Kurt Russell was uncredited, he provided the voice for Elvis in the scene.</li><li>Dick Cavett as himself: Cavett played a de-aged version of himself in the 1970s, with makeup applied to make him appear younger. Consequently, Cavett is the only well-known figure in the film to play a cameo role rather than be represented through the use of archival footage like John Lennon or President John F. Kennedy.</li><li>Sam Anderson as Principal Hancock: Forrest's elementary school principal.</li><li>Geoffrey Blake as Wesley: A member of the SDS group and Jenny's abusive boyfriend</li><li>Siobhan Fallon Hogan as Dorothy Harris: The school bus driver who drives Forrest, and later his son, to school</li><li>Sonny Shroyer as Coach Paul \"Bear\" Bryant</li><li>Grand L. Bush, Michael Jace, Conor Kennelly, and Teddy Lane Jr. as the Black Panthers</li><li>Richard D'Alessandro as Abbie Hoffman</li><li>Tiffany Salerno and Marla Sucharetza as \"Cunning\" Carla and \"Long-Limbs\" Lenore: a couple of prostitutes that Forrest and Dan spend a New Year's evening with and later turn away</li></ul><br/><h3>Production</h3><h4>Pre-production and script</h4><blockquote>\"The writer, Eric Roth, departed substantially from the book. We flipped the two elements of the book, making the love story primary and the fantastic adventures secondary. Also, the book was cynical and colder than the movie. In the movie, Gump is a completely decent character, always true to his word. He has no agenda and no opinion about anything except Jenny, his mother and God.\"</blockquote><p>—director Robert Zemeckis</p><p>The film is based on the 1986 novel by Winston Groom. Both center on the character of Forrest Gump. However, the film primarily focuses on the first eleven chapters of the novel before skipping ahead to the end of the novel with the founding of Bubba Gump Shrimp Co. and the meeting with Forrest Jr. In addition to skipping some parts of the novel, the film adds several aspects to Gump's life that do not occur in the novel, such as his needing leg braces as a child and his run across the United States.</p><p>Gump's core character and personality are also changed from the novel; among other things, his film character is less of a savant—in the novel, while playing football at the university, he fails craft and gym but receives a perfect score in an advanced physics class he is enrolled in by his coach to satisfy his college requirements. The novel also features Gump as an astronaut, a professional wrestler, and a chess player.</p><p>The book had a bidding war regarding an adaptation even before publication, with Wendy Finerman and Steve Tisch acquiring them by joining forces with Warner Bros., where Finerman's husband Mark Canton was president of production. Groom was paid $500,000 and also wrote the first three first drafts of the screenplay, which leaned closer to the events of the novel. After Rain Man told the story of a savant, Warner lost interest in the picture, and by 1990 the project was in turnaround. Finerman contacted Columbia Pictures, who went on reject it, while hiring Eric Roth to rewrite the script. Roth and Finerman kept in contact with Groom to ensure the script was historically accurate. Roth delivered a screenplay in 1992, which Paramount executive Sherry Lansing liked enough to bring the project to her studio, who acquired the rights from Warner in exchange for the script for Executive Decision.</p><p>Ivan Reitman, Penny Marshall and Terry Gilliam passed on the project before Robert Zemeckis was hired. Barry Sonnenfeld was attached to the film, but left to direct Addams Family Values.</p><h4>Casting</h4><p>John Travolta was the original choice to play the title role and says passing on the role was a mistake. Bill Murray and Chevy Chase were also considered for the role. Sean Penn stated in an interview having been second choice for the role. Hanks revealed that he signed on to the film after an hour and a half of reading the script. He initially wanted to ease Forrest's pronounced Southern accent but was eventually persuaded by director Robert Zemeckis to portray the heavy accent stressed in the novel. Hanks also said it took him three days to learn how to play the role, and footage from that time could not be included. Winston Groom, who wrote the original novel, describes the film as having taken the \"rough edges\" off the character whom he had envisioned being played by John Goodman. Additionally, Tom's younger brother Jim Hanks is his acting double in the movie for the scenes when Forrest runs across the U.S. Tom's daughter Elizabeth Hanks appears in the movie as the girl on the school bus who refuses to let young Forrest (Michael Conner Humphreys) sit next to her. Joe Pesci was considered for the role of Lieutenant Dan Taylor, which was eventually given to Gary Sinise. David Alan Grier, Ice Cube and Dave Chappelle were offered the role of Benjamin Buford Blue, but all three turned it down. Chappelle, who said he believed the film would be unsuccessful, has been reported as saying that he regrets not taking the role. Hanks was aware of Chappelle's disappointment in missing out on the part and agreed to work with him in a future movie, which ended up being You've Got Mail. Rapper Tupac Shakur also auditioned.</p><h4>Filming</h4><p>Filming began in August 1993 and ended in December of that year. Although most of the film is set in Alabama, filming took place mainly in and around Beaufort, South Carolina, as well as parts of coastal Virginia and North Carolina, including a running shot on the Blue Ridge Parkway. Downtown portions of the fictional town of Greenbow were filmed in Varnville, South Carolina. The scene of Forrest running through Vietnam while under fire was filmed on Hunting Island State Park and Fripp Island, South Carolina. Additional filming took place on the Biltmore Estate in Asheville, North Carolina and along the Blue Ridge Parkway near Boone, North Carolina. The most notable place was Grandfather Mountain where a part of the road subsequently became known as \"Forrest Gump Curve\".</p><p>The Gump family home set was built along the Combahee River near Yemassee, South Carolina, and the nearby land was used to film Curran's home as well as some of the Vietnam scenes. Over 20 palmetto trees were planted to improve the Vietnam scenes. Forrest Gump narrated his life's story at the northern edge of Chippewa Square in Savannah, Georgia as he sat at a bus stop bench. There were other scenes filmed in and around the Savannah area as well, including a running shot on the Richard V. Woods Memorial Bridge in Beaufort while he was being interviewed by the press, and on West Bay Street in Savannah. Most of the college campus scenes were filmed in Los Angeles at the University of Southern California. The lighthouse that Forrest runs across to reach the Atlantic Ocean the first time is the Marshall Point Lighthouse in Port Clyde, Maine. Additional scenes were filmed in Arizona, Utah's Monument Valley, and Montana's Glacier National Park.</p><h4>Visual effects</h4><p>Ken Ralston and his team at Industrial Light & Magic were responsible for the film's visual effects. Using CGI techniques, it was possible to depict Gump meeting deceased personages and shaking their hands. Hanks was first shot against a blue screen along with reference markers so that he could line up with the archive footage. To record the voices of the historical figures, voice actors were filmed and special effects were used to alter lip-syncing for the new dialogue. Archival footage was used and with the help of such techniques as chroma key, image warping, morphing, and rotoscoping, Hanks was integrated into it.</p><p>In one Vietnam War scene, Gump carries Bubba away from an incoming napalm attack. To create the effect, stunt actors were initially used for compositing purposes. Then, Hanks and Williamson were filmed, with Williamson supported by a cable wire as Hanks ran with him. The explosion was then filmed, and the actors were digitally added to appear just in front of the explosions. The jet fighters and napalm canisters were also added by CGI.</p><p>The CGI removal of actor Gary Sinise's legs, after his character had them amputated, was achieved by wrapping his legs with a blue fabric, which later facilitated the work of the \"roto-paint\" team to paint out his legs from every single frame. At one point, while hoisting himself into his wheelchair, his legs are used for support.</p><p>The scene where Forrest spots Jenny at a peace rally at the Lincoln Memorial and Reflecting Pool in Washington, D.C., required visual effects to create the large crowd of people. Over two days of filming, approximately 1,500 extras were used. At each successive take, the extras were rearranged and moved into a different quadrant away from the camera. With the help of computers, the extras were multiplied to create a crowd of several hundred thousand people.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Produced on a budget of $55 million, Forrest Gump opened in 1,595 theaters in the United States and Canada grossing $24,450,602 in its opening weekend. Motion picture business consultant and screenwriter Jeffrey Hilton suggested to producer Wendy Finerman to double the P&A (film marketing budget) based on his viewing of an early print of the film. The budget was immediately increased, in line with his advice. In its opening weekend, the film placed first at the US box office, narrowly beating The Lion King, which was in its fourth week of release. For the first twelve weeks of release, the film was in the top 3 at the US box office, topping the list 5 times, including in its tenth week of release. Paramount removed the film from release in the United States when its gross hit $300 million in January 1995, and it was the second-highest-grossing film of the year behind The Lion King with $305 million. The film was reissued on February 17, 1995, after the Academy Awards nominations were announced. After the reissue in 1,100 theaters, the film grossed an additional $29 million in the United States and Canada, bringing its total to $329.7 million, making it the third-highest-grossing film at that time behind only E.T. the Extra-Terrestrial and Jurassic Park, and was Paramount's biggest, surpassing Raiders of the Lost Ark. Forrest Gump held the record for being the highest-grossing Paramount film until it was taken by Titanic three years later in 1997. For 12 years, it remained as the highest-grossing film starring Tom Hanks until 2006 when it was surpassed by The Da Vinci Code. Box Office Mojo estimates that the film sold over 78.5 million tickets in the US and Canada in its initial theatrical run.</p><p>The film took 66 days to surpass $250 million and was the fastest grossing Paramount film to pass $100 million, $200 million, and $300 million in box office receipts (at the time of its release). After reissues, the film has gross receipts of $330,252,182 in the U.S. and Canada and $347,693,217 in international markets for a total of $677,945,399 worldwide. Even with such revenue, the film was known as a \"successful failure\"—due to distributors' and exhibitors' high fees, Paramount's \"losses\" clocked in at $62 million, leaving executives realizing the necessity of better deals. This has also been associated with Hollywood accounting, where expenses are inflated in order to minimize profit sharing. It is Robert Zemeckis' highest-grossing film to date.</p><h4>Critical reception</h4><p>On the review aggregator website Rotten Tomatoes, 71% of 106 critics' reviews are positive, with an average rating of 7.5/10. The website's consensus reads: \"Forrest Gump may be an overly sentimental film with a somewhat problematic message, but its sweetness and charm are usually enough to approximate true depth and grace.\" At the website Metacritic, the film earned a rating of 82 out of 100 based on 20 reviews by mainstream critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film a rare \"A+\" grade.</p><p>The story was commended by several critics. Roger Ebert of the Chicago Sun-Times wrote, \"I've never met anyone like Forrest Gump in a movie before, and for that matter I've never seen a movie quite like 'Forrest Gump.' Any attempt to describe him will risk making the movie seem more conventional than it is, but let me try. It's a comedy, I guess. Or maybe a drama. Or a dream. The screenplay by Eric Roth has the complexity of modern fiction...The performance is a breathtaking balancing act between comedy and sadness, in a story rich in big laughs and quiet truths...What a magical movie.\" Todd McCarthy of Variety wrote that the film \"has been very well worked out on all levels, and manages the difficult feat of being an intimate, even delicate tale played with an appealingly light touch against an epic backdrop.\" In contrast, Anthony Lane of The New Yorker called the film \"Warm, wise, and wearisome as hell.\" Owen Gleiberman of Entertainment Weekly said that the film was \"glib, shallow, and monotonous\" and \"reduces the tumult of the last few decades to a virtual-reality theme park: a baby-boomer version of Disney's America.\"</p><p>Gump garnered comparisons to fictional character Huckleberry Finn, as well as U.S. politicians Ronald Reagan, Pat Buchanan and Bill Clinton. Peter Chomo writes that Gump acts as a \"social mediator and as an agent of redemption in divided times\". Peter Travers of Rolling Stone called Gump \"everything we admire in the American character – honest, brave, and loyal with a heart of gold.\" The New York Times reviewer Janet Maslin called Gump a \"hollow man\" who is \"self-congratulatory in his blissful ignorance, warmly embraced as the embodiment of absolutely nothing.\" Marc Vincenti of Palo Alto Weekly called the character \"a pitiful stooge taking the pie of life in the face, thoughtfully licking his fingers.\" Bruce Kawin and Gerald Mast's textbook on film history notes that Forrest Gump's dimness was a metaphor for glamorized nostalgia in that he represented a blank slate onto which the Baby Boomer generation projected their memories of those events.</p><h4>Re-evaluation</h4><p>In the 21st century, the film became negatively re-evaluated. Writing in 2004, Entertainment Weekly said, \"Nearly a decade after it earned gazillions and swept the Oscars, Robert Zemeckis's ode to 20th-century America still represents one of cinema's most clearly drawn lines in the sand. One half of folks see it as an artificial piece of pop melodrama, while everyone else raves that it's sweet as a box of chocolates.\" On the other hand though \"Despite many, often special-effects-generated laughs, and several genuinely touching moments, one wishes that Forrest Gump were a sarcastic cautionary tale about the dangers of a simple-minded, apolitical America and not the anti-intellectual, mostly conservative fantasy it is,\"\" in other words, the film has been criticized for its perceived conservative politics. Writing for Indiewire in 2019, Eric Kohn said: \"This no-nothing white man becomes a war hero and a wealthy man simply by chugging along, participating in a country that dictates his every move. He never comprehends racism or the complexities of Vietnam; the movie portrays political activism and hippy culture as a giant cartoon beyond Forrest’s understanding, while presenting his apolitical stance as the height of all virtue.\" Furthermore, in a 2014 article for CNN discussing the film's reassessment, Brandon Griggs wrote of possible readings against the film \"Forrest, as played by Tom Hanks, is the epitome of wholesome decency: a God-fearing, All-American football player and war hero who has no use for the counterculture movements of the late '60s. Despite an IQ of 75, he achieves fame and financial success. He's even from red-state Alabama!\"</p><p>In a 2014 retrospective for the film's 20th anniversary re-release, Amy Nicholson criticized the film for being apolitical, writing \"Forrest doesn't kill anyone. He doesn't get PTSD. He doesn't even have a clue why he's in Vietnam. The film is so afraid to dredge up debate that when Abbie Hoffman hands Forrest the microphone at an antiwar rally, someone unplugs the speakers so we can't hear him — fitting for a movie with nothing to say.\" LGBTQ+ critics have criticized the \"shallow\" portrayal of the AIDS epidemic, one that \"sidesteps the significance of the disease by erasing its mere mention\". In 2015, The Hollywood Reporter polled hundreds of academy members, asking them to re-vote on past controversial decisions. Academy members said that, given a second chance, they would award the 1994 Oscar for Best Picture to The Shawshank Redemption instead.</p><h4>Author payment controversy</h4><p>Winston Groom was paid $350,000 for the screenplay rights to his novel Forrest Gump and was contracted for a 3 percent share of the film's net profits. However, Paramount and the film's producers did not pay him the percentage, using Hollywood accounting to posit that the blockbuster film lost money. Tom Hanks, by contrast, contracted for a percent share of the film's gross receipts instead of a salary, and he and director Zemeckis each received $40 million. In addition, Groom was not mentioned once in any of the film's six Oscar-winner speeches.</p><p>Groom's dispute with Paramount was later effectively resolved after Groom declared he was satisfied with Paramount's explanation of their accounting, this coinciding with Groom receiving a seven-figure contract with Paramount for film rights to another of his books, Gump & Co. This film was never made, remaining in development hell for at least a dozen years.</p><h4>Home video</h4><p>Forrest Gump was first released on VHS on April 27, 1995, and on Laserdisc the following day. The laserdisc was THX certified and released without chapters, requiring the film be watched start to finish. Film magazines of the period stated this was at the request of Zemeckis who wanted viewers to enjoy the film in its entirety. It became the best-selling adult sell-through video with sales of over 12 million. A widescreen VHS release debuted a year later on September 10, 1996. It was released in a two-disc DVD set on August 28, 2001. Special features included director and producer commentaries, production featurettes, and screen tests. The film was released on Blu-ray in November 2009. Paramount released the film on Ultra HD Blu-ray in June 2018. On May 7, 2019, Paramount Pictures released a newly remastered two-disc Blu-ray that contains bonus content.</p><h4>Accolades</h4><p>Forrest Gump won Best Picture, Best Actor in a Leading Role (Hanks had won the previous year for Philadelphia), Best Director, Best Visual Effects, Best Adapted Screenplay, and Best Film Editing at the 67th Academy Awards. The film was nominated for seven Golden Globe Awards, winning three of them: Best Actor – Motion Picture Drama, Best Director – Motion Picture, and Best Motion Picture – Drama. The film was also nominated for six Saturn Awards and won two for Best Fantasy Film and Best Supporting Actor (Film).</p><p>In addition to the film's multiple awards and nominations, it has also been recognized by the American Film Institute on several of its lists. The film ranks 37th on 100 Years...100 Cheers, 71st on 100 Years...100 Movies, and 76th on 100 Years...100 Movies (10th Anniversary Edition). In addition, the quote \"Mama always said life was like a box of chocolates. You never know what you're gonna get,\" was ranked 40th on 100 Years...100 Movie Quotes. The film also ranked at number 61 on Empire's list of the 100 Greatest Movies of All Time.</p><p>In December 2011, Forrest Gump was selected for preservation in the Library of Congress' National Film Registry. The Registry said that the film was \"honored for its technological innovations (the digital insertion of Gump seamlessly into vintage archival footage), its resonance within the culture that has elevated Gump (and what he represents in terms of American innocence) to the status of folk hero, and its attempt to engage both playfully and seriously with contentious aspects of the era's traumatic history.\"</p><p>American Film Institute lists</p><ul><li>AFI's 100 Years...100 Movies – #71</li><li>AFI's 100 Years...100 Laughs – Nominated</li><li>AFI's 100 Years...100 Passions – Nominated</li><li>AFI's 100 Years...100 Heroes and Villains: Forrest Gump – Nominated Hero</li><li>Forrest Gump – Nominated Hero</li><li>AFI's 100 Years...100 Movie Quotes: \"Mama always said life was like a box of chocolates. You never know what you're gonna get.\" – #40 \"Mama says, 'Stupid is as stupid does.'\" – Nominated</li><li>\"Mama always said life was like a box of chocolates. You never know what you're gonna get.\" – #40</li><li>\"Mama says, 'Stupid is as stupid does.'\" – Nominated</li><li>AFI's 100 Years of Film Scores – Nominated</li><li>AFI's 100 Years...100 Cheers – #37</li><li>AFI's 100 Years...100 Movies (10th Anniversary Edition) – #76</li><li>AFI's 10 Top 10 – Nominated Epic Film</li></ul><br/><h3>Symbolism</h3><h4>Feather</h4><blockquote>\"I don't want to sound like a bad version of 'the child within'. But the childlike innocence of Forrest Gump is what we all once had. It's an emotional journey. You laugh and cry. It does what movies are supposed to do: make you feel alive.\"</blockquote><p>—producer Wendy Finerman</p><p>Various interpretations have been suggested for the feather present at the opening and conclusion of the film. Sarah Lyall of The New York Times noted several suggestions made about the feather: \"Does the white feather symbolize The Unbearable Lightness of Being? Forrest Gump's impaired intellect? The randomness of experience?\" Hanks interpreted the feather as: \"Our destiny is only defined by how we deal with the chance elements to our life and that's kind of the embodiment of the feather as it comes in. Here is this thing that can land anywhere and that it lands at your feet. It has theological implications that are really huge.\" Sally Field compared the feather to fate, saying: \"It blows in the wind and just touches down here or there. Was it planned or was it just perchance?\" Visual effects supervisor Ken Ralston compared the feather to an abstract painting: \"It can mean so many things to so many different people.\"</p><h4>Political interpretations</h4><p>Hanks states that \"the film is non-political and thus non-judgmental\". Nevertheless, CNN's Crossfire debated in 1994 whether the film promoted conservative values or was an indictment of the counterculture movement of the 1960s. Thomas Byers called it \"an aggressively conservative film\" in a Modern Fiction Studies article.</p><blockquote>All over the political map, people have been calling Forrest their own. But, Forrest Gump isn't about politics or conservative values. It's about humanity, it's about respect, tolerance and unconditional love.</blockquote><p>—producer Steve Tisch</p><p>It has been noted that while Gump follows a very conservative lifestyle, Jenny's life is full of countercultural embrace, complete with drug use, promiscuity, and antiwar rallies, and that their eventual marriage might be a kind of reconciliation. Jennifer Hyland Wang argues in a Cinema Journal article that Jenny's death to an unnamed virus \"symbolizes the death of liberal America and the death of the protests that defined a decade\" in the 1960s. She also notes that the film's screenwriter, Eric Roth, developed the screenplay from the novel and transferred to Jenny \"all of Gump's flaws and most of the excesses committed by Americans in the 1960s and 1970s\".</p><p>Other commentators believe the film forecast the 1994 Republican Revolution and used the image of Forrest Gump to promote movement leader Newt Gingrich's traditional, conservative values. Jennifer Hyland Wang observes that the film idealizes the 1950s, as made evident by the lack of \"Whites Only\"-signs in Gump's Southern childhood, and envisions the 1960s as a period of social conflict and confusion. She argues that this sharp contrast between the decades criticizes the counterculture values and reaffirms conservatism. Wang argues that the film was used by Republican politicians to illustrate a \"traditional version of recent history\" to gear voters toward their ideology for the congressional elections. Presidential candidate Bob Dole stated that the film's message was \"no matter how great the adversity, the American Dream is within everybody's reach\".</p><p>In 1995, National Review included Forrest Gump in its list of the \"Best 100 Conservative Movies\" of all time, and ranked it number four on its \"25 Best Conservative Movies of the Last 25 Years\" list. National Review's John Miller wrote that \"Tom Hanks plays the title-character, an amiable dunce who is far too smart to embrace the lethal values of the 1960s. The love of his life, wonderfully played by Robin Wright Penn, chooses a different path; she becomes a drug-addled hippie, with disastrous results.\"</p><p>Professor James Burton at Salisbury University argues that conservatives claimed Forrest Gump as their own due less to the content of the film and more to the historical and cultural context of 1994. Burton claims that the film's content and advertising campaign were affected by the cultural climate of the 1990s, which emphasized family-values and American values, epitomized in the book Hollywood vs. America. He claims that this climate influenced the apolitical nature of the film, which allowed many different political interpretations.</p><p>Some commentators see the conservative readings of Forrest Gump as indicating the death of irony in American culture. Vivian Sobchack notes that the film's humor and irony rely on the assumption of the audience's historical knowledge.</p><br/><h3>Soundtrack</h3><p>The 32-song soundtrack from the film was released on July 6, 1994. With the exception of a lengthy suite from Alan Silvestri's score, all the songs are previously released; the soundtrack includes songs from Bob Dylan, Elvis Presley, Creedence Clearwater Revival, Aretha Franklin, Lynyrd Skynyrd, Three Dog Night, the Byrds, the Beach Boys, the Jimi Hendrix Experience, the Doors, the Mamas & the Papas, the Doobie Brothers, Simon & Garfunkel, Bob Seger, and Buffalo Springfield among others. Music producer Joel Sill reflected on compiling the soundtrack: \"We wanted to have very recognizable material that would pinpoint time periods, yet we didn't want to interfere with what was happening cinematically.\" The two-disc album has a variety of music from the 1950s–1980s performed by American artists. According to Sill, this was due to Zemeckis' request, \"All the material in there is American. Bob (Zemeckis) felt strongly about it. He felt that Forrest wouldn't buy anything but American.\"</p><p>The soundtrack reached a peak of number 2 on the Billboard album chart. The soundtrack went on to sell twelve million copies, and is one of the top selling albums in the US. The Oscar-nominated score for the film was composed and conducted by Alan Silvestri and released on August 2, 1994.</p><br/><h3>Adaptations</h3><h4>Novel-sequel</h4><p>The screenplay for the sequel was written by Eric Roth in 2001. It is based on the original novel's sequel, Gump and Co., written by Winston Groom in 1995. Roth's script begins with Forrest sitting on a bench waiting for his son to return from school. After the September 11 attacks, Roth, Zemeckis, and Hanks decided the story was no longer \"relevant.\" In March 2007, however, it was reported Paramount producers took another look at the screenplay.</p><p>On the first page of the sequel novel, Forrest Gump tells readers \"Don't never let nobody make a movie of your life's story,\" and \"Whether they get it right or wrong, it doesn't matter.\" The first chapter of the book suggests the real-life events surrounding the film have been incorporated into Forrest's storyline, and that Forrest got a lot of media attention as a result of the film. During the course of the sequel novel, Gump runs into Tom Hanks and at the end of the novel in the film's release, includes Gump going on The David Letterman Show and attending the Academy Awards.</p><h4>Remake</h4><p>The Indian film, Laal Singh Chaddha, released in August 2022 and starring Aamir Khan in the title role, is an official remake of Forrest Gump set in India between the late 1970s and the 2010s. The film was directed by Advait Chandan and produced by Aamir Khan Productions, Viacom18 Studios and Paramount Pictures.</p><br/>"
  },
  "errorMessage": ""
}