{
  "imDbId": "tt0053291",
  "title": "Some Like It Hot",
  "fullTitle": "Some Like It Hot (1959)",
  "type": "Movie",
  "year": "1959",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/great-movie-some-like-it-hot-1959",
      "rate": "100",
      "content": "Wilder's 1959 comedy is one of the enduring treasures of the movies, a film of inspiration and meticulous craft, a movie that's about nothing but sex and yet pretends it's about crime and greed."
    },
    {
      "publisher": "Empire",
      "author": "Angie Errigo",
      "link": "https://www.empireonline.com/movies/reviews/like-hot-review/",
      "rate": "100",
      "content": "Key to its success - along with its vivid characters and brilliant performances - is the snappy pace throughout. Non-stop gags, invention, twists and comic incident flow, as Joe and Jerry - sexy Curtis and screamingly funny Lemmon - elude mob boss George Raft by wriggling into an all-girl jazz band, with Josephine and Daphne’s legendary drag act taking in amorous adventures, seductive deceptions and madcap pursuits."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1959/film/reviews/some-like-it-hot-2-1200419454/",
      "rate": "100",
      "content": "Some Like It Hot, directed in masterly style by Billy Wilder, is probably the funniest picture of recent memory. It's a whacky, clever, farcical comedy that starts off like a firecracker and keeps on throwing off lively sparks till the very end."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2014/jul/17/some-like-it-hot-review-monroe-lemmon-curtis-wilder",
      "rate": "100",
      "content": "Reinvented by Wilder and co-screenwriter co-writer IAL Diamond, Some Like It Hot is effortlessly fluent, joyous and buoyant: a high-concept comedy that stays as high as a kite, while other comedies flag. \"Nobody's perfect\" is the last line. Wilder, Lemmon, Curtis and Monroe come pretty close."
    },
    {
      "publisher": "",
      "author": "The Hollywood Reporter",
      "link": "https://www.hollywoodreporter.com/news/general-news/some-like-hot-review-1959-movie-989529/",
      "rate": "100",
      "content": "Some Like It Hot is another supersonic, breakneck, belly-laugh comedy that should be a block-busting bonanza at the box office. It should be a proof that when the making of pictures is taken out of the bands of men-of-measured-merriment and handed over to men whose only purpose is to create amusement, they are still the world's best means of entertainment. Billy Wilder, who produced, directed and wrote the screenplay, with I.A.L. Diamond, was on the front burner all the way."
    },
    {
      "publisher": "New York Daily News",
      "author": "Kate Cameron",
      "link": "https://www.nydailynews.com/entertainment/movies/hot-find-funny-1959-review-article-1.2573332",
      "rate": "100",
      "content": "The funniest comedy I’ve seen in years. There aren’t many of the hundred and four minutes of running time that doesn’t find the audience laughing its head off at the antics of Jack Lemmon, Tony Curtis and Marilyn Monroe."
    },
    {
      "publisher": "Time Out London",
      "author": "Cath Clarke",
      "link": "",
      "rate": "100",
      "content": "Billy Wilder’s 1959 comedy is still perfect all these years later."
    },
    {
      "publisher": "Total Film",
      "author": "James Mottram",
      "link": "https://www.gamesradar.com/destiny-2-guide-walkthrough/",
      "rate": "100",
      "content": "But it’s the precision-tooled plot fashioned by Wilder and I.A.L. Diamond that holds it together, creating the perfect farcical playground. Brilliant performances, wondrous comic timing and the greatest pay-off line ever written: this one’s still red hot."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Chris Cabin",
      "link": "",
      "rate": "88",
      "content": "Magnificently paced and terrifically funny at nearly every turn, Some Like It Hot was imbued with an inherent distrust of capitalism and big business that Wilder regularly expressed in an only slightly covert manner."
    },
    {
      "publisher": "",
      "author": "The New York Times",
      "link": "https://www.nytimes.com/reviews/movies?mcubz=0&amp;res=9E07E2D8103EE63BBC4850DFB5668382649EDE",
      "rate": "80",
      "content": "Let's face it. Two hours is too long a time to harp on one joke. But Billy Wilder, who produced, directed and collaborated with I. A. L. Diamond on this breeziest of scripts, proves once again that he is as professional as anyone in Hollywood. Mr. Wilder, abetted by such equally proficient operatives as Marilyn Monroe, Jack Lemmon and Tony Curtis, surprisingly has developed a completely unbelievable plot into a broad farce in which authentically comic action vies with snappy and sophisticated dialogue."
    }
  ],
  "errorMessage": ""
}