{
  "imDbId": "tt0053291",
  "title": "Some Like It Hot",
  "fullTitle": "Some Like It Hot (1959)",
  "type": "Movie",
  "year": "1959",
  "language": "en",
  "titleInLanguage": "Some Like It Hot",
  "url": "https://en.wikipedia.org/wiki/Some_Like_It_Hot",
  "plotShort": {
    "plainText": "Some Like It Hot is a 1959 American crime comedy film directed, produced and co-written by Billy Wilder. It stars Marilyn Monroe, Tony Curtis and Jack Lemmon, with George Raft, Pat O'Brien, Joe E. Brown, Joan Shawlee and Nehemiah Persoff in supporting roles. The screenplay by Wilder and I. A. L. Diamond is based on a screenplay by Robert Thoeren and Michael Logan from the 1935 French film Fanfare of Love. The film is about two musicians who disguise themselves by dressing as women to escape from mafia gangsters whom they witnessed committing a crime.\r\nSome Like It Hot opened to critical and commercial success and is considered to be one of the greatest films of all time. The film received six Academy Award nominations, including Best Actor, Best Director and Best Adapted Screenplay, winning for Best Costume Design. In 1989, the Library of Congress selected it as one of the first 25 films for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\".\r\nThe film was produced without approval from the Motion Picture Production Code (Hays Code) because it features LGBT-related themes, including cross-dressing. The code had been gradually weakening in its scope since the early 1950s, due to greater social tolerance for taboo topics in film, but it was enforced until the mid-1960s. The overwhelming success of Some Like It Hot is considered one of the reasons behind the retirement of the Hays Code.",
    "html": "<p>Some Like It Hot is a 1959 American crime comedy film directed, produced and co-written by Billy Wilder. It stars Marilyn Monroe, Tony Curtis and Jack Lemmon, with George Raft, Pat O'Brien, Joe E. Brown, Joan Shawlee and Nehemiah Persoff in supporting roles. The screenplay by Wilder and I. A. L. Diamond is based on a screenplay by Robert Thoeren and Michael Logan from the 1935 French film Fanfare of Love. The film is about two musicians who disguise themselves by dressing as women to escape from mafia gangsters whom they witnessed committing a crime.</p><p>Some Like It Hot opened to critical and commercial success and is considered to be one of the greatest films of all time. The film received six Academy Award nominations, including Best Actor, Best Director and Best Adapted Screenplay, winning for Best Costume Design. In 1989, the Library of Congress selected it as one of the first 25 films for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\".</p><p>The film was produced without approval from the Motion Picture Production Code (Hays Code) because it features LGBT-related themes, including cross-dressing. The code had been gradually weakening in its scope since the early 1950s, due to greater social tolerance for taboo topics in film, but it was enforced until the mid-1960s. The overwhelming success of Some Like It Hot is considered one of the reasons behind the retirement of the Hays Code.</p>"
  },
  "plotFull": {
    "plainText": "Some Like It Hot is a 1959 American crime comedy film directed, produced and co-written by Billy Wilder. It stars Marilyn Monroe, Tony Curtis and Jack Lemmon, with George Raft, Pat O'Brien, Joe E. Brown, Joan Shawlee and Nehemiah Persoff in supporting roles. The screenplay by Wilder and I. A. L. Diamond is based on a screenplay by Robert Thoeren and Michael Logan from the 1935 French film Fanfare of Love. The film is about two musicians who disguise themselves by dressing as women to escape from mafia gangsters whom they witnessed committing a crime.\r\nSome Like It Hot opened to critical and commercial success and is considered to be one of the greatest films of all time. The film received six Academy Award nominations, including Best Actor, Best Director and Best Adapted Screenplay, winning for Best Costume Design. In 1989, the Library of Congress selected it as one of the first 25 films for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\".\r\nThe film was produced without approval from the Motion Picture Production Code (Hays Code) because it features LGBT-related themes, including cross-dressing. The code had been gradually weakening in its scope since the early 1950s, due to greater social tolerance for taboo topics in film, but it was enforced until the mid-1960s. The overwhelming success of Some Like It Hot is considered one of the reasons behind the retirement of the Hays Code.\r\nPlot\r\nIn February 1929, in Prohibition-era Chicago, Joe is a jazz saxophone player and an irresponsible, impulsive ladies' man; his anxious friend Jerry is a jazz double bass player. They work in a speakeasy owned by gangster \"Spats\" Colombo. Tipped off by informant \"Toothpick\" Charlie, the police raid the joint. Joe and Jerry escape, but later accidentally witness Spats and his henchmen gunning down \"Toothpick\" and his gang in revenge, which was inspired by the real-life Saint Valentine's Day Massacre. Spats and his gang see them as they flee. Broke, terrified, and desperate to get out of town, Joe and Jerry disguise themselves as women named Josephine and Daphne so they can join Sweet Sue and her Society Syncopators, an all-female band headed by train to Miami. On the train, Joe and Jerry befriend Sugar Kane, the band's vocalist and ukulele player.\r\nJoe and Jerry become obsessed with Sugar and compete for her affection while maintaining their disguises. Sugar confides to \"Josephine\" that she has sworn off male saxophone players, who have taken advantage of her in the past. She hopes to find a gentle, bespectacled millionaire in Florida. During the forbidden drinking and partying on the train, \"Josephine\" and \"Daphne\" become close friends with Sugar, and struggle to remember that they are supposed to be girls and cannot make passes at her.\r\nOnce in Miami, Joe woos Sugar by assuming a second disguise as millionaire Junior, the heir to Shell Oil while feigning indifference to her. An actual millionaire, the much-married, aging, mama's-boy Osgood Fielding III, persistently pursues \"Daphne\", whose refusals only increase his appetite. He invites \"her\" for a champagne supper on his yacht, New Caledonia. Joe convinces Jerry to keep Osgood occupied onshore so that \"Junior\" can take Sugar to Osgood's yacht and pass it off as his own. Once on the yacht, \"Junior\" tells Sugar that psychological trauma has left him impotent and frigid, but that he would marry anyone who could cure him. Sugar tries to arouse him, with considerable success. Meanwhile, \"Daphne\" and Osgood dance the tango (\"La Cumparsita\") till dawn. When Joe and Jerry get back to the hotel, Jerry announces that Osgood has proposed marriage to \"Daphne\" and that he, as Daphne, has accepted, anticipating an instant divorce and huge cash settlement when his ruse is revealed. Joe convinces Jerry that he cannot marry Osgood.\r\nThe hotel hosts a conference for \"Friends of Italian Opera\", which is a major meeting of the national crime syndicate, presided over by \"Little Bonaparte\". Spats and his gang recognize Joe and Jerry as the witnesses they have been looking for. Joe and Jerry, fearing for their lives, realize they must quit the band and leave the hotel. Joe conceals his deception from Sugar by telling her, over the telephone, that he, Junior, must marry a woman of his father's choosing and move to Venezuela for financial reasons. Sugar is distressed and heartbroken. Joe and Jerry evade Spats' men by hiding under a table at the syndicate banquet. \"Little Bonaparte\" has Spats and his men killed at the banquet; again, Joe and Jerry are witnesses and they flee through the hotel. Joe, dressed as Josephine, sees Sugar onstage singing a lament to lost love. He runs onto the platform and kisses her, causing Sugar to realize that Josephine and Junior are the same person.\r\nJerry persuades Osgood to take \"Daphne\" and \"Josephine\" away on his yacht. Sugar runs from the stage at the end of her performance and jumps aboard Osgood's launch just as it is leaving the dock with Joe, Jerry, and Osgood. Joe confesses the truth to Sugar and tells her that she deserves better, but Sugar wants him anyway, realizing he is the first man to genuinely care for her. Meanwhile, Jerry tries to get out of his promise to marry Osgood, by listing reasons why \"Daphne\" and Osgood cannot marry, ranging from a smoking habit to infertility. Osgood, smiling broadly, has answers for all of them. Exasperated, Jerry rips off the wig, switches to his normal voice, and says \"I'm a man!\" Still smiling, Osgood replies \"Well, nobody's perfect,\" leaving Jerry speechless.\r\nCast\r\nMarilyn Monroe as Sugar \"Kane\" Kowalczyk, a ukulele player and singer\r\nTony Curtis as Joe/\"Josephine\"/\"Shell Oil Junior\", a saxophone player\r\nJack Lemmon as Jerry/\"Daphne\", a double bass player\r\nJoe E. Brown as Osgood Fielding III\r\nGeorge Raft as \"Spats\" Colombo, a mobster from Chicago\r\nPat O'Brien as Agent Mulligan\r\nNehemiah Persoff as \"Little Bonaparte\", a mobster and leader of the \"Friends of Italian Opera Society\"\r\nJoan Shawlee as Sweet Sue, the bandleader of \"Sweet Sue and Her Society Syncopators\"\r\nDave Barry as Mister Bienstock, the band manager for \"Sweet Sue and Her Society Syncopators\"\r\nBilly Gray as Sig Poliakoff, Joe and Jerry's agent in Chicago\r\nBarbara Drew as Nellie Weinmeyer, Poliakoff's secretary\r\nGrace Lee Whitney as Rosella (Fiddle)\r\nGeorge E. Stone as \"Toothpick\" Charlie, a gangster who is killed by \"Spats\" Colombo\r\nMike Mazurki as Spats' henchman\r\nHarry Wilson as Spats' henchman\r\nEdward G. Robinson Jr. as Johnny Paradise, a gangster who kills \"Spats\" Colombo\r\nBeverly Wills as Dolores, a trombone player, and Sugar's apartment friend\r\nAl Breneman as the bellboy (uncredited)\r\nSoundtrack\r\nThe soundtrack features four songs performed by Marilyn Monroe, nine songs composed by Adolph Deutsch, as well as two songs performed by jazz artist Matty Malneck.\r\nProduction\r\nPre-production\r\nBilly Wilder wrote the script for the film with writer I.A.L. Diamond. The plot was based on a screenplay by Robert Thoeren and Michael Logan for the 1935 French film Fanfare of Love. The original script for Fanfare of Love was untraceable, so Walter Mirisch found a copy of the 1951 German remake, Fanfares of Love. He bought the rights to that script, and Wilder worked with this to produce a new story. Both films follow the story of two musicians in search of work, but Wilder created the gangster subplot that keeps the musicians on the run.\r\nThe studio hired female impersonator Barbette to coach Lemmon and Curtis on gender illusion for the film. Monroe worked for 10 percent of the gross in excess of $4 million, Curtis for 5 percent of the gross over $2 million, and Wilder for 17.5 percent of the first million after break-even and 20 percent thereafter.\r\nCasting\r\nTony Curtis was spotted by Billy Wilder while he was making the film Houdini (1953), and he thought Curtis would be perfect for the role of Joe. \"I was sure Tony was right for it,\" explained Wilder, \"because he was quite handsome, and when he tells Marilyn that he is one of the Shell Oil family, she has to be able to believe it\". Wilder's first idea for the role of Jerry was Frank Sinatra, but he did not come to the audition. Jerry Lewis and Danny Kaye were also considered for the role of Jerry. Finally, Wilder saw Jack Lemmon in the comedy Operation Mad Ball and selected him for the part. Wilder and Lemmon would go on to make numerous films together, including The Apartment and several films which also included Walter Matthau.\r\nAccording to York Film Notes, Billy Wilder and I.A.L. Diamond did not expect a star as big as Marilyn Monroe to take the part of Sugar. \"Mitzi Gaynor was who we had in mind,\" Wilder said. \"The word came that Marilyn wanted the part and then we had to have Marilyn.\" Wilder and Monroe had made the film The Seven Year Itch together in 1955.\r\nIt was George Raft's first \"A\" picture in a number of years.\r\nFilming\r\nThe film was made in California during the summer and autumn of 1958. AFI reported the production dates between early August and November 12, 1958, at Samuel Goldwyn Studios. Many scenes were shot at the Hotel del Coronado in Coronado, California which appeared as the \"Seminole Ritz Hotel\" in Miami in the film, as it fit into the era of the 1920s and was near Hollywood.\r\nThere were many problems with Marilyn Monroe, who lacked concentration and suffered from an addiction to pills. She was constantly late to set, and could not memorize many of her lines, averaging 35–40 takes for a single line according to Tony Curtis. The line \"It's me, Sugar\" took 47 takes to get correct because Monroe kept getting the word order wrong, saying either \"Sugar, it's me\" or \"It's Sugar, me\". Tony Curtis and Jack Lemmon made bets during the filming on how many takes she would need to get it right. Three days were scheduled for shooting the scene with Shell Jr. and Sugar at the beach, as Monroe had many complicated lines, but the scene was finished in only 20 minutes. Monroe's acting coach Paula Strasberg and Monroe's husband Arthur Miller both tried to influence the production, which Wilder and other crew members found annoying.\r\nBilly Wilder spoke in 1959 about making another film with Monroe: \"I have discussed this with my doctor and my psychiatrist and they tell me I'm too old and too rich to go through this again.\" But Wilder also admitted: \"My Aunt Minnie would always be punctual and never hold up production, but who would pay to see my Aunt Minnie?\" He also stated that Monroe played her part wonderfully. Years later, Wilder noted \"I think there are more books on Marilyn Monroe than there are on World War 2, and there's a great similarity.\"\r\nThe film's closing line, \"Well, nobody's perfect,\" is ranked 78th on The Hollywood Reporter list of Hollywood's 100 Favorite Movie Lines, but it was never supposed to be in the final cut. Diamond and Wilder put it in the script as a \"placeholder\" until they could come up with something better, but they never did. Wilder's tombstone pays homage to the line by reading, \"I'm a writer, but then, nobody's perfect\". In 2000, The Guardian newspaper ranked the closing scene at No. 10 on their list of \"The top 100 film moments\"\r\nStyle\r\nWith regard to sound design, there is a \"strong musical element\" in the film, with the soundtrack created by Adolph Deutsch. It has an authentic 1920s jazz feel using sharp, brassy strings to create tension in certain moments, for example whenever Spats's gangsters appear. In terms of cinematography and aesthetics, Billy Wilder chose to shoot the film in black and white as Jack Lemmon and Tony Curtis in full drag costume and make-up looked \"unacceptably grotesque\" in early color tests. Despite Monroe's contract requiring the film to be in color, she agreed to it being filmed in black and white after seeing that Curtis and Lemmon's makeup gave them a \"ghoulish\" appearance on color film. Orry-Kelly who was in charge of costume design created the costumes for Marilyn Monroe as well as Jack Lemmon and Tony Curtis, after the stock costumes the studio provided for the male leads fit poorly.\r\nReception\r\nBox office\r\nBy 1962, Some Like It Hot had grossed $14 million in the US. According to The Numbers, the film ultimately grossed $25 million in the US. As of 2020, it had grossed over $83.2 million internationally.\r\nThe film opened in the week ended March 24, 1959, in several cities in the United States; the highest grossing of which were in Chicago, where it grossed $45,000 at the United Artists Theatre with Monroe making an appearance, and in Washington, D.C., where it grossed $40,000 at the Capitol Theatre. With results from just six key cities, Variety listed it as the third highest-grossing film in the United States for the week.\r\nThe film then expanded to 100 theatres around the country for the Easter holidays, including at the newly renovated State Theatre in New York City on Sunday, March 29, 1959, and became number one in the country and remained there for three weeks before being knocked off the top by Imitation of Life. Imitation of Life was top for two weeks before being replaced again by Some Like It Hot, which remained there for another four weeks before being replaced by Pork Chop Hill. In its first month, the film grossed $2,585,120 from 96 engagements.\r\nCritical response\r\nSome Like It Hot received widespread acclaim from critics and is considered among the best films of all time. On review aggregator Rotten Tomatoes, 94% of 70 critics have given the film a positive review, with an average rating of 9.1/10. The website's critical consensus reads, \"Some Like It Hot: A spry, quick-witted farce that never drags.\" According to Metacritic, another review aggregator which calculated a weighted average score of 98 out of 100 based on 19 critics, the film received \"universal acclaim\". Chicago Sun-Times's Roger Ebert wrote, \"Wilder's 1959 comedy is one of the enduring treasures of the movies, a film of inspiration and meticulous craft.\" Ebert gave the film four stars out of four and included it in his Great Movies list. John McCarten of The New Yorker referred to the film as \"a jolly, carefree enterprise\". Richard Roud, writing for The Guardian in 1967, said with this film Wilder comes \"close to perfection\".\r\nIn 1989, this film became one of the first 25 inducted into the United States National Film Registry. In 1998 the film was ranked at No. 7 in Time Out magazine's poll of Top 100 films of all time. In 1999 Entertainment Weekly voted it at No. 9 on their list of 100 Greatest Movies of All Time.\r\nSome Like It Hot was voted as the top comedy film by the American Film Institute on their list on AFI's 100 Years...100 Laughs poll in 2000, and was selected as the best comedy of all time in a poll of 253 film critics from 52 countries conducted by the BBC in 2017. In 2005, the British Film Institute included this film on its list of \"Top fifty films for children up to the age of 14\". In the 2012 Sight & Sound polls, it was ranked the 42nd-greatest film ever made in the critics' poll and 37th in the directors' poll. In the earlier 2002 Sight & Sound polls the film ranked 37th among critics and 24th among directors. In 2010, The Guardian considered it the 3rd-best comedy film of all time. In 2015, the film ranked 30th on BBC's \"100 Greatest American Films\" list, voted on by film critics from around the world. It was included in The New York Times's \"The Best 1,000 Movies Ever Made\" list in 2002. In 2005, it was included on Time's All-Time 100 best movies list. The film was voted at No. 52 on the list of \"100 Greatest Films\" by the prominent French magazine Cahiers du cinéma in 2008. In July 2018, it was selected to be screened in the Venice Classics section at the 75th Venice International Film Festival.\r\nAwards and nominations\r\nThe film is recognized by American Film Institute in these lists:\r\n1998: AFI's 100 Years...100 Movies – #14\r\n2000: AFI's 100 Years...100 Laughs – #1\r\n2005: AFI's 100 Years...100 Movie Quotes: Osgood Fielding III: \"Well, nobody's perfect.\" – #48\r\nOsgood Fielding III: \"Well, nobody's perfect.\" – #48\r\n2007: AFI's 100 Years...100 Movies (10th Anniversary Edition) – #22\r\nThe film was inducted in 1989 into the National Film Registry by the Library of Congress. The Writers Guild of America ranked the film's screenplay the 9th greatest ever written.\r\nAdaptations\r\nAn unsold television pilot was filmed by Mirisch Productions in 1961 featuring Vic Damone and Tina Louise. As a favor to the production company, Jack Lemmon and Tony Curtis agreed to film cameo appearances, returning as their original characters, Daphne and Josephine, at the beginning of the pilot. Their appearance sees them in a hospital where Jerry (Lemmon) is being treated for his impacted back tooth and Joe (Curtis) is the same O blood type.\r\nIn 1972, a musical play based on the screenplay of the film, entitled Sugar, opened on Broadway starring Elaine Joyce, Robert Morse, Tony Roberts and Cyril Ritchard, with book by Peter Stone, lyrics by Bob Merrill, and (all-new) music by Jule Styne.\r\nIn 1975 a Bollywood remake of this movie was released as Rafoo Chakkar.\r\nA 1984 stage production at the Claridge Hotel & Casino in Atlantic City, New Jersey, starred Joe Namath as Joe.\r\nA 1991 stage production of this show in London featured Tommy Steele and retained the film's title.\r\nTony Curtis, then in his late 70s, performed in a 2002 stage production of the film, this time cast as Osgood Fielding III, the character originally played by Joe E. Brown.\r\nOn 5 January 2019, Marc Shaiman and Scott Wittman in an interview with Graham Norton on BBC Radio 2 confirmed they were writing the music and lyrics for a new adaptation separate from the 1972 production. The version had aimed for a Broadway production in 2020, but was delayed by the COVID-19 pandemic. On 20 April 2022, the production was confirmed to star Christian Borle at the Shubert Theatre with previews beginning 1 November 2022, with music by Shaiman, music and lyrics by Shaiman and Wittman, and book by Matthew Lopez and Amber Ruffin.",
    "html": "<p>Some Like It Hot is a 1959 American crime comedy film directed, produced and co-written by Billy Wilder. It stars Marilyn Monroe, Tony Curtis and Jack Lemmon, with George Raft, Pat O'Brien, Joe E. Brown, Joan Shawlee and Nehemiah Persoff in supporting roles. The screenplay by Wilder and I. A. L. Diamond is based on a screenplay by Robert Thoeren and Michael Logan from the 1935 French film Fanfare of Love. The film is about two musicians who disguise themselves by dressing as women to escape from mafia gangsters whom they witnessed committing a crime.</p><p>Some Like It Hot opened to critical and commercial success and is considered to be one of the greatest films of all time. The film received six Academy Award nominations, including Best Actor, Best Director and Best Adapted Screenplay, winning for Best Costume Design. In 1989, the Library of Congress selected it as one of the first 25 films for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\".</p><p>The film was produced without approval from the Motion Picture Production Code (Hays Code) because it features LGBT-related themes, including cross-dressing. The code had been gradually weakening in its scope since the early 1950s, due to greater social tolerance for taboo topics in film, but it was enforced until the mid-1960s. The overwhelming success of Some Like It Hot is considered one of the reasons behind the retirement of the Hays Code.</p><br/><h3>Plot</h3><p>In February 1929, in Prohibition-era Chicago, Joe is a jazz saxophone player and an irresponsible, impulsive ladies' man; his anxious friend Jerry is a jazz double bass player. They work in a speakeasy owned by gangster \"Spats\" Colombo. Tipped off by informant \"Toothpick\" Charlie, the police raid the joint. Joe and Jerry escape, but later accidentally witness Spats and his henchmen gunning down \"Toothpick\" and his gang in revenge, which was inspired by the real-life Saint Valentine's Day Massacre. Spats and his gang see them as they flee. Broke, terrified, and desperate to get out of town, Joe and Jerry disguise themselves as women named Josephine and Daphne so they can join Sweet Sue and her Society Syncopators, an all-female band headed by train to Miami. On the train, Joe and Jerry befriend Sugar Kane, the band's vocalist and ukulele player.</p><p>Joe and Jerry become obsessed with Sugar and compete for her affection while maintaining their disguises. Sugar confides to \"Josephine\" that she has sworn off male saxophone players, who have taken advantage of her in the past. She hopes to find a gentle, bespectacled millionaire in Florida. During the forbidden drinking and partying on the train, \"Josephine\" and \"Daphne\" become close friends with Sugar, and struggle to remember that they are supposed to be girls and cannot make passes at her.</p><p>Once in Miami, Joe woos Sugar by assuming a second disguise as millionaire Junior, the heir to Shell Oil while feigning indifference to her. An actual millionaire, the much-married, aging, mama's-boy Osgood Fielding III, persistently pursues \"Daphne\", whose refusals only increase his appetite. He invites \"her\" for a champagne supper on his yacht, New Caledonia. Joe convinces Jerry to keep Osgood occupied onshore so that \"Junior\" can take Sugar to Osgood's yacht and pass it off as his own. Once on the yacht, \"Junior\" tells Sugar that psychological trauma has left him impotent and frigid, but that he would marry anyone who could cure him. Sugar tries to arouse him, with considerable success. Meanwhile, \"Daphne\" and Osgood dance the tango (\"La Cumparsita\") till dawn. When Joe and Jerry get back to the hotel, Jerry announces that Osgood has proposed marriage to \"Daphne\" and that he, as Daphne, has accepted, anticipating an instant divorce and huge cash settlement when his ruse is revealed. Joe convinces Jerry that he cannot marry Osgood.</p><p>The hotel hosts a conference for \"Friends of Italian Opera\", which is a major meeting of the national crime syndicate, presided over by \"Little Bonaparte\". Spats and his gang recognize Joe and Jerry as the witnesses they have been looking for. Joe and Jerry, fearing for their lives, realize they must quit the band and leave the hotel. Joe conceals his deception from Sugar by telling her, over the telephone, that he, Junior, must marry a woman of his father's choosing and move to Venezuela for financial reasons. Sugar is distressed and heartbroken. Joe and Jerry evade Spats' men by hiding under a table at the syndicate banquet. \"Little Bonaparte\" has Spats and his men killed at the banquet; again, Joe and Jerry are witnesses and they flee through the hotel. Joe, dressed as Josephine, sees Sugar onstage singing a lament to lost love. He runs onto the platform and kisses her, causing Sugar to realize that Josephine and Junior are the same person.</p><p>Jerry persuades Osgood to take \"Daphne\" and \"Josephine\" away on his yacht. Sugar runs from the stage at the end of her performance and jumps aboard Osgood's launch just as it is leaving the dock with Joe, Jerry, and Osgood. Joe confesses the truth to Sugar and tells her that she deserves better, but Sugar wants him anyway, realizing he is the first man to genuinely care for her. Meanwhile, Jerry tries to get out of his promise to marry Osgood, by listing reasons why \"Daphne\" and Osgood cannot marry, ranging from a smoking habit to infertility. Osgood, smiling broadly, has answers for all of them. Exasperated, Jerry rips off the wig, switches to his normal voice, and says \"I'm a man!\" Still smiling, Osgood replies \"Well, nobody's perfect,\" leaving Jerry speechless.</p><br/><h3>Cast</h3><ul><li>Marilyn Monroe as Sugar \"Kane\" Kowalczyk, a ukulele player and singer</li><li>Tony Curtis as Joe/\"Josephine\"/\"Shell Oil Junior\", a saxophone player</li><li>Jack Lemmon as Jerry/\"Daphne\", a double bass player</li><li>Joe E. Brown as Osgood Fielding III</li><li>George Raft as \"Spats\" Colombo, a mobster from Chicago</li><li>Pat O'Brien as Agent Mulligan</li><li>Nehemiah Persoff as \"Little Bonaparte\", a mobster and leader of the \"Friends of Italian Opera Society\"</li><li>Joan Shawlee as Sweet Sue, the bandleader of \"Sweet Sue and Her Society Syncopators\"</li><li>Dave Barry as Mister Bienstock, the band manager for \"Sweet Sue and Her Society Syncopators\"</li><li>Billy Gray as Sig Poliakoff, Joe and Jerry's agent in Chicago</li><li>Barbara Drew as Nellie Weinmeyer, Poliakoff's secretary</li><li>Grace Lee Whitney as Rosella (Fiddle)</li><li>George E. Stone as \"Toothpick\" Charlie, a gangster who is killed by \"Spats\" Colombo</li><li>Mike Mazurki as Spats' henchman</li><li>Harry Wilson as Spats' henchman</li><li>Edward G. Robinson Jr. as Johnny Paradise, a gangster who kills \"Spats\" Colombo</li><li>Beverly Wills as Dolores, a trombone player, and Sugar's apartment friend</li><li>Al Breneman as the bellboy (uncredited)</li></ul><br/><h3>Soundtrack</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Some Like It Hot: Original MGM Motion Picture Soundtrack</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">24 February 1998</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span>Soundtrack</span><br><span>Jazz</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">32</span>:<span class=\"s\">22</span></span></td></tr></tbody></table><p>The soundtrack features four songs performed by Marilyn Monroe, nine songs composed by Adolph Deutsch, as well as two songs performed by jazz artist Matty Malneck.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"<span>Runnin' Wild</span>\" (<span>Marilyn Monroe</span>)</td><td class=\"tracklist-length\">1:07</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Medley: Sugar Blues/Running Wild\" (<span>Adolph Deutsch</span> &amp; His Orchestra)</td><td class=\"tracklist-length\">1:32</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Down Among the Sheltering Palms\" (Adolph Deutsch &amp; His Orchestra)</td><td class=\"tracklist-length\">1:59</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Randolph Street Rag\" (Adolph Deutsch)</td><td class=\"tracklist-length\">1:28</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"<span class=\"mw-redirect\">I Wanna Be Loved By You</span>\" (Marilyn Monroe)</td><td class=\"tracklist-length\">2:58</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Park Avenue Fantasy\" (Adolph Deutsch &amp; His Orchestra)</td><td class=\"tracklist-length\">3:34</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Medley: Down Among the Sheltering Palms / La Cumparsita / I Wanna Be Loved By You\" (Adolph Deutsch &amp; His Orchestra)</td><td class=\"tracklist-length\">2:20</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"I'm Thru With Love\" (Marilyn Monroe)</td><td class=\"tracklist-length\">2:34</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"Medley: Sugar Blues / Tell the Whole Damn World\" (Adolph Deutsch &amp; His Orchestra)</td><td class=\"tracklist-length\">3:25</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Play It Again Charlie\" (Adolph Deutsch)</td><td class=\"tracklist-length\">1:49</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Sweet Georgia Brown\" (<span>Matty Malneck</span> &amp; His Orchestra)</td><td class=\"tracklist-length\">2:57</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"By the Beautiful Sea\" (Adolph Deutsch &amp; His Orchestra)</td><td class=\"tracklist-length\">1:22</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Park Avenue Fantasy (Reprise)\" (Adolph Deutsch &amp; His Orchestra)</td><td class=\"tracklist-length\">2:10</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Some Like It Hot\" (Matty Malneck &amp; His Orchestra)</td><td class=\"tracklist-length\">1:46</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"Some Like It Hot (Single Version)\" (Marilyn Monroe)</td><td class=\"tracklist-length\">1:21</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>32:22</td></tr></tbody></table><br/><h3>Production</h3><h4>Pre-production</h4><p>Billy Wilder wrote the script for the film with writer I.A.L. Diamond. The plot was based on a screenplay by Robert Thoeren and Michael Logan for the 1935 French film Fanfare of Love. The original script for Fanfare of Love was untraceable, so Walter Mirisch found a copy of the 1951 German remake, Fanfares of Love. He bought the rights to that script, and Wilder worked with this to produce a new story. Both films follow the story of two musicians in search of work, but Wilder created the gangster subplot that keeps the musicians on the run.</p><p>The studio hired female impersonator Barbette to coach Lemmon and Curtis on gender illusion for the film. Monroe worked for 10 percent of the gross in excess of $4 million, Curtis for 5 percent of the gross over $2 million, and Wilder for 17.5 percent of the first million after break-even and 20 percent thereafter.</p><h4>Casting</h4><p>Tony Curtis was spotted by Billy Wilder while he was making the film Houdini (1953), and he thought Curtis would be perfect for the role of Joe. \"I was sure Tony was right for it,\" explained Wilder, \"because he was quite handsome, and when he tells Marilyn that he is one of the Shell Oil family, she has to be able to believe it\". Wilder's first idea for the role of Jerry was Frank Sinatra, but he did not come to the audition. Jerry Lewis and Danny Kaye were also considered for the role of Jerry. Finally, Wilder saw Jack Lemmon in the comedy Operation Mad Ball and selected him for the part. Wilder and Lemmon would go on to make numerous films together, including The Apartment and several films which also included Walter Matthau.</p><p>According to York Film Notes, Billy Wilder and I.A.L. Diamond did not expect a star as big as Marilyn Monroe to take the part of Sugar. \"Mitzi Gaynor was who we had in mind,\" Wilder said. \"The word came that Marilyn wanted the part and then we had to have Marilyn.\" Wilder and Monroe had made the film The Seven Year Itch together in 1955.</p><p>It was George Raft's first \"A\" picture in a number of years.</p><h4>Filming</h4><p>The film was made in California during the summer and autumn of 1958. AFI reported the production dates between early August and November 12, 1958, at Samuel Goldwyn Studios. Many scenes were shot at the Hotel del Coronado in Coronado, California which appeared as the \"Seminole Ritz Hotel\" in Miami in the film, as it fit into the era of the 1920s and was near Hollywood.</p><p>There were many problems with Marilyn Monroe, who lacked concentration and suffered from an addiction to pills. She was constantly late to set, and could not memorize many of her lines, averaging 35–40 takes for a single line according to Tony Curtis. The line \"It's me, Sugar\" took 47 takes to get correct because Monroe kept getting the word order wrong, saying either \"Sugar, it's me\" or \"It's Sugar, me\". Tony Curtis and Jack Lemmon made bets during the filming on how many takes she would need to get it right. Three days were scheduled for shooting the scene with Shell Jr. and Sugar at the beach, as Monroe had many complicated lines, but the scene was finished in only 20 minutes. Monroe's acting coach Paula Strasberg and Monroe's husband Arthur Miller both tried to influence the production, which Wilder and other crew members found annoying.</p><p>Billy Wilder spoke in 1959 about making another film with Monroe: \"I have discussed this with my doctor and my psychiatrist and they tell me I'm too old and too rich to go through this again.\" But Wilder also admitted: \"My Aunt Minnie would always be punctual and never hold up production, but who would pay to see my Aunt Minnie?\" He also stated that Monroe played her part wonderfully. Years later, Wilder noted \"I think there are more books on Marilyn Monroe than there are on World War 2, and there's a great similarity.\"</p><p>The film's closing line, \"Well, nobody's perfect,\" is ranked 78th on The Hollywood Reporter list of Hollywood's 100 Favorite Movie Lines, but it was never supposed to be in the final cut. Diamond and Wilder put it in the script as a \"placeholder\" until they could come up with something better, but they never did. Wilder's tombstone pays homage to the line by reading, \"I'm a writer, but then, nobody's perfect\". In 2000, The Guardian newspaper ranked the closing scene at No. 10 on their list of \"The top 100 film moments\"</p><h4>Style</h4><p>With regard to sound design, there is a \"strong musical element\" in the film, with the soundtrack created by Adolph Deutsch. It has an authentic 1920s jazz feel using sharp, brassy strings to create tension in certain moments, for example whenever Spats's gangsters appear. In terms of cinematography and aesthetics, Billy Wilder chose to shoot the film in black and white as Jack Lemmon and Tony Curtis in full drag costume and make-up looked \"unacceptably grotesque\" in early color tests. Despite Monroe's contract requiring the film to be in color, she agreed to it being filmed in black and white after seeing that Curtis and Lemmon's makeup gave them a \"ghoulish\" appearance on color film. Orry-Kelly who was in charge of costume design created the costumes for Marilyn Monroe as well as Jack Lemmon and Tony Curtis, after the stock costumes the studio provided for the male leads fit poorly.</p><br/><h3>Reception</h3><h4>Box office</h4><p>By 1962, Some Like It Hot had grossed $14 million in the US. According to The Numbers, the film ultimately grossed $25 million in the US. As of 2020, it had grossed over $83.2 million internationally.</p><p>The film opened in the week ended March 24, 1959, in several cities in the United States; the highest grossing of which were in Chicago, where it grossed $45,000 at the United Artists Theatre with Monroe making an appearance, and in Washington, D.C., where it grossed $40,000 at the Capitol Theatre. With results from just six key cities, Variety listed it as the third highest-grossing film in the United States for the week.</p><p>The film then expanded to 100 theatres around the country for the Easter holidays, including at the newly renovated State Theatre in New York City on Sunday, March 29, 1959, and became number one in the country and remained there for three weeks before being knocked off the top by Imitation of Life. Imitation of Life was top for two weeks before being replaced again by Some Like It Hot, which remained there for another four weeks before being replaced by Pork Chop Hill. In its first month, the film grossed $2,585,120 from 96 engagements.</p><h4>Critical response</h4><p>Some Like It Hot received widespread acclaim from critics and is considered among the best films of all time. On review aggregator Rotten Tomatoes, 94% of 70 critics have given the film a positive review, with an average rating of 9.1/10. The website's critical consensus reads, \"Some Like It Hot: A spry, quick-witted farce that never drags.\" According to Metacritic, another review aggregator which calculated a weighted average score of 98 out of 100 based on 19 critics, the film received \"universal acclaim\". Chicago Sun-Times's Roger Ebert wrote, \"Wilder's 1959 comedy is one of the enduring treasures of the movies, a film of inspiration and meticulous craft.\" Ebert gave the film four stars out of four and included it in his Great Movies list. John McCarten of The New Yorker referred to the film as \"a jolly, carefree enterprise\". Richard Roud, writing for The Guardian in 1967, said with this film Wilder comes \"close to perfection\".</p><p>In 1989, this film became one of the first 25 inducted into the United States National Film Registry. In 1998 the film was ranked at No. 7 in Time Out magazine's poll of Top 100 films of all time. In 1999 Entertainment Weekly voted it at No. 9 on their list of 100 Greatest Movies of All Time.</p><p>Some Like It Hot was voted as the top comedy film by the American Film Institute on their list on AFI's 100 Years...100 Laughs poll in 2000, and was selected as the best comedy of all time in a poll of 253 film critics from 52 countries conducted by the BBC in 2017. In 2005, the British Film Institute included this film on its list of \"Top fifty films for children up to the age of 14\". In the 2012 Sight & Sound polls, it was ranked the 42nd-greatest film ever made in the critics' poll and 37th in the directors' poll. In the earlier 2002 Sight & Sound polls the film ranked 37th among critics and 24th among directors. In 2010, The Guardian considered it the 3rd-best comedy film of all time. In 2015, the film ranked 30th on BBC's \"100 Greatest American Films\" list, voted on by film critics from around the world. It was included in The New York Times's \"The Best 1,000 Movies Ever Made\" list in 2002. In 2005, it was included on Time's All-Time 100 best movies list. The film was voted at No. 52 on the list of \"100 Greatest Films\" by the prominent French magazine Cahiers du cinéma in 2008. In July 2018, it was selected to be screened in the Venice Classics section at the 75th Venice International Film Festival.</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th><th>Ref.</th></tr><tr><td rowspan=\"6\"><span>Academy Awards</span></td><td><span>Best Director</span></td><td><span>Billy Wilder</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"6\"></td></tr><tr><td><span>Best Actor</span></td><td><span>Jack Lemmon</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay – Based on Material from Another Medium</span></td><td>Billy Wilder and <span>I. A. L. Diamond</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Art Direction – Black-and-White</span></td><td>Art Direction: <span>Ted Haworth</span>; <br> Set Decoration: <span>Edward G. Boyle</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography – Black-and-White</span></td><td><span>Charles Lang</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Costume Design – Black-and-White</span></td><td><span>Orry-Kelly</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Bambi Awards</span></td><td>Best Actor – International</td><td><span>Tony Curtis</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"2\"><span>British Academy Film Awards</span></td><td><span>Best Film from any Source</span></td><td>Billy Wilder</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td><span>Best Foreign Actor</span></td><td>Jack Lemmon</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td rowspan=\"2\">Billy Wilder</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"3\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span class=\"mw-redirect\">Best Motion Picture – Musical or Comedy</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"3\"></td></tr><tr><td><span class=\"mw-redirect\">Best Actor in a Motion Picture – Musical or Comedy</span></td><td>Jack Lemmon</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Best Actress in a Motion Picture – Musical or Comedy</span></td><td>Marilyn Monroe</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Grammy Awards</span></td><td><span>Best Sound Track Album, Original Cast – Motion Picture or Television</span></td><td><i><span>Some Like It Hot</span></i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Jules Verne Awards</span></td><td>Jules Verne Légendaire Award</td><td>Billy Wilder</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"3\"><span>Laurel Awards</span></td><td colspan=\"2\">Top Comedy</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">3rd Place</td><td align=\"center\" rowspan=\"3\"></td></tr><tr><td>Top Male Comedy Performance</td><td>Jack Lemmon</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">2nd Place</td></tr><tr><td>Top Female Comedy Performance</td><td>Marilyn Monroe</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">2nd Place</td></tr><tr><td><span>National Board of Review Awards</span></td><td colspan=\"2\"><span>Top Ten Films</span></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">7th Place</td><td align=\"center\"></td></tr><tr><td><span>National Film Preservation Board</span></td><td colspan=\"2\"><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td><td align=\"center\"></td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td><td align=\"center\"></td></tr><tr><td><span>Producers Guild of America Awards</span></td><td>PGA Hall of Fame – Motion Pictures</td><td>Robert Evans</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Venice International Film Festival</span></td><td><span>Golden Lion</span></td><td>Billy Wilder</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Best Written American Comedy</span></td><td>Billy Wilder and I. A. L. Diamond</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr></tbody></table><p>The film is recognized by American Film Institute in these lists:</p><ul><li>1998: AFI's 100 Years...100 Movies – #14</li><li>2000: AFI's 100 Years...100 Laughs – #1</li><li>2005: AFI's 100 Years...100 Movie Quotes: Osgood Fielding III: \"Well, nobody's perfect.\" – #48</li><li>Osgood Fielding III: \"Well, nobody's perfect.\" – #48</li><li>2007: AFI's 100 Years...100 Movies (10th Anniversary Edition) – #22</li></ul><p>The film was inducted in 1989 into the National Film Registry by the Library of Congress. The Writers Guild of America ranked the film's screenplay the 9th greatest ever written.</p><br/><h3>Adaptations</h3><p>An unsold television pilot was filmed by Mirisch Productions in 1961 featuring Vic Damone and Tina Louise. As a favor to the production company, Jack Lemmon and Tony Curtis agreed to film cameo appearances, returning as their original characters, Daphne and Josephine, at the beginning of the pilot. Their appearance sees them in a hospital where Jerry (Lemmon) is being treated for his impacted back tooth and Joe (Curtis) is the same O blood type.</p><p>In 1972, a musical play based on the screenplay of the film, entitled Sugar, opened on Broadway starring Elaine Joyce, Robert Morse, Tony Roberts and Cyril Ritchard, with book by Peter Stone, lyrics by Bob Merrill, and (all-new) music by Jule Styne.</p><p>In 1975 a Bollywood remake of this movie was released as Rafoo Chakkar.</p><p>A 1984 stage production at the Claridge Hotel & Casino in Atlantic City, New Jersey, starred Joe Namath as Joe.</p><p>A 1991 stage production of this show in London featured Tommy Steele and retained the film's title.</p><p>Tony Curtis, then in his late 70s, performed in a 2002 stage production of the film, this time cast as Osgood Fielding III, the character originally played by Joe E. Brown.</p><p>On 5 January 2019, Marc Shaiman and Scott Wittman in an interview with Graham Norton on BBC Radio 2 confirmed they were writing the music and lyrics for a new adaptation separate from the 1972 production. The version had aimed for a Broadway production in 2020, but was delayed by the COVID-19 pandemic. On 20 April 2022, the production was confirmed to star Christian Borle at the Shubert Theatre with previews beginning 1 November 2022, with music by Shaiman, music and lyrics by Shaiman and Wittman, and book by Matthew Lopez and Amber Ruffin.</p><br/>"
  },
  "errorMessage": ""
}