{
  "imDbId": "tt8579674",
  "title": "1917",
  "fullTitle": "1917 (2019)",
  "type": "Movie",
  "year": "2019",
  "items": [
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2019/nov/25/1917-review-sam-mendess-turns-western-front-horror-into-a-single-shot-masterpiece",
      "rate": "100",
      "content": "1917 is Mendes’s most purely ambitious and passionate picture since his misunderstood and under-appreciated Jarhead of 2005. It’s bold, thrilling film-making."
    },
    {
      "publisher": "IGN",
      "author": "Jim Vejvoda",
      "link": "",
      "rate": "95",
      "content": "1917 is an expertly crafted and emotionally exhausting thrill-ride behind enemy lines. Gloriously shot, deftly paced, and striking in its gruesome recreation of the time and place, Sam Mendes’ 1917 wisely never loses sight of the smaller, intimate elements in a fast-paced story with immense scale and action."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Leah Greenblatt",
      "link": "https://ew.com/movie-reviews/2019/11/25/1917-review/",
      "rate": "91",
      "content": "The film belongs to Chapman and more than anyone, MacKay, a 27-year-old Londoner with the long bones and baleful eyes of a porcelain saint or a lost Caulkin brother. His Lance Corporal Schofield isn’t just a surrogate Everyman; he’s hope and fear personified, and you couldn’t look away if you wanted to."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Todd McCarthy",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/1917-review-1257818/",
      "rate": "90",
      "content": "Even if the film is mostly hitting familiar notes in terms of story and theme, it expresses a concise, focused and expertly managed vision with which there’s little to quibble, and the extraordinary style represents the fruition of a long-imagined dream on the part of many directors and cinematographers. From now on, when the discussion turns to great works of cinematography and camera operating, 1917 will always have to be high on the list."
    },
    {
      "publisher": "Screen Daily",
      "author": "Fionnuala Halligan",
      "link": "https://www.screendaily.com/reviews/1917-review/5145070.article",
      "rate": "90",
      "content": "Mendes is intent on bringing a sense of breathless derring-do to a war only known for its doomed futility. And he loads onto it a one-take challenge, a rolling-back and slowly-swerving camera, using the sleight of hand which distinguishes the best action cinema of this kind."
    },
    {
      "publisher": "IndieWire",
      "author": "Kate Erbland",
      "link": "https://www.indiewire.com/criticism/movies/1917-review-sam-mendes-single-take-wwi-1202192008/",
      "rate": "83",
      "content": "The clock is always ticking in 1917, and even as MacKay is offering a heartbreaking study in restrained emotion, he’s still at least moving towards the end goal of his terrible task. There’s no time to pause, even for great beauty, a lesson that even 1917 is often loathe to honor."
    },
    {
      "publisher": "Variety",
      "author": "Peter Debruge",
      "link": "https://variety.com/2019/film/reviews/1917-review-1203416169/",
      "rate": "80",
      "content": "Astonishing as his filmmaking can be at times, it’s Mendes’ attention to character, more than the technique, that makes 1917 one of 2019’s most impressive cinematic achievements."
    },
    {
      "publisher": "TheWrap",
      "author": "Alonso Duralde",
      "link": "https://www.thewrap.com/1917-film-review-sam-mendes-2019-george-mackay/",
      "rate": "75",
      "content": "The movie is more successful as a thriller than as a thoughtful examination of war and its horrors; Mendes seems less interested in bigger ideas about the nightmare of battle and its effects on his characters than he is in Hitchcockian audience manipulation."
    },
    {
      "publisher": "Vanity Fair",
      "author": "Richard Lawson",
      "link": "https://www.vanityfair.com/hollywood/2019/11/1917-film-review-sam-mendes",
      "rate": "75",
      "content": "1917 is a rattling wonder of form, an audacious undertaking that nonetheless bobbles or cheats on a few occasions."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Justin Chang",
      "link": "https://www.latimes.com/entertainment-arts/movies/story/2019-11-25/la-et-mn-1917-review-sam-mendes",
      "rate": "70",
      "content": "There are times when the nonstop visual momentum lends 1917 the feel of a virtual-reality installation, and others when the simulation of raw immediacy slips to reveal the calculated construct underneath."
    }
  ],
  "errorMessage": ""
}