{
  "imDbId": "tt8579674",
  "title": "1917",
  "fullTitle": "1917 (2019)",
  "type": "Movie",
  "year": "2019",
  "items": [
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw6810224",
      "warningSpoilers": false,
      "date": "13 April 2021",
      "rate": "10",
      "helpful": "131 out of 156 found this helpful.",
      "title": "\"He travels the fastest who travels alone\"",
      "content": "There are some great WW1 films out there, the granddaddy of them all in my view being 1930's 'All Quiet on the Western Front'. Also appreciate many of the actors here, though they are in cameo roles, and Sam Mendes as a director (of the films of his seen, almost all, 'Spectre' is the only one to not do much for me). Roger Deakins and Thomas Newman are masters in their field, Deakins is one of the best cinematographers in the business and Newman's score for 'Road to Perdition' is a favourite.'1917' was seen for all those reasons. As well as because of the critical acclaim, with it being considered as one of 2019's year's best films. After seeing it, my thoughts are that the acclaim for '1917' is richly deserved in one of the best and most powerful films that year. It did connect a lot with me, due to watching it not long after reading the harrowing war diaries of my great-grandfather (who fought in the war and was mustard gassed and blinded).First and foremost, '1917' is a visual and technical achievement. It is beautifully and evocatively designed and Deakins' cinematography, with awe-inspiring and never gimmicky use of the long unbroken one take technique, is nothing short of masterful. Mendes ensures that the tension, even in the slower moments, never slips, keeping the intensity (at its best almost nerve-shredding) going.Newman provides another hauntingly beautiful score, that does stir the emotions in the latter parts of the film when things become more urgent. The sound is thrilling in its authenticity, so much so it was like being there. The film is intelligently scripted and to me the two lead characters, especially Scofield, were easy to get behind, interesting and their bond came over as realistic. The story is engrossing throughout, it briefly loses a little momentum just before the climax perhaps, but the first half is emotionally powerful and the climax is unpredictably intense.Such a good job is done too with showing the full horrors of war from a visual standpoint, a psychological one and in the unflinching action. Without going too far, the point of view not being hammered home. '1917' benefits hugely from the splendid lead performance of George MacKay and Dean-Charles Chapman is strong too despite his role not being quite as meaty. The cameos from Benedict Cumberbatch, Colin Firth, Richard Madden and Andrew Scott manage to make big impressions in short screen time.Overall, brilliant and powerful film. One of the best films personally watched in 2020. 10/10."
    },
    {
      "username": "boblipton",
      "userUrl": "https://www.imdb.com/user/ur1617546",
      "reviewLink": "https://www.imdb.com/review/rw5396894",
      "warningSpoilers": true,
      "date": "10 January 2020",
      "rate": "8",
      "helpful": "40 out of 50 found this helpful.",
      "title": "Another Day In One Long Take",
      "content": "The command has realized that the Germans have pulled back for a trap on a British offensive. The telephone lines are cut, and the only way to get the orders through to the colonel commanding the offensive is to send two soldiers through the lines. One of them has special incentive. His elder brother is a soldier in the attack. If it goes through, 1600 men, will be wiped out for no purpose.... including the soldier's brother.It's a classic story-telling format that dates back to the ANABASIS: get from point A to Point B, only here it's just two men traveling through the alternating inferno of the Great War's front lines, and the bucolic springtime of northern France. Effective as that is, director Sam Mendes and cinematographer Roger Deakins have shot it, as near as they could manage, as one long take - after I had realized what they were doing, about twenty minutes into the film, I began to look for ways of editing things together. While I spotted a few, there was really only one obvious spot, and that was after more than an hour had passed.This deliberate effort to make this movie in this manner clearly has a point. It is a constant barrage, one long cinematic sentence that must be swallowed whole. It forces the viewer to take it all in in one piece, giving, perhaps, a hint of the overwhelming sensory overload of this struggle to get through.It certainly worked on me."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw5625335",
      "warningSpoilers": false,
      "date": "10 April 2020",
      "rate": "9",
      "helpful": "93 out of 124 found this helpful.",
      "title": "Reasonably accurate in showing the hell that is war.",
      "content": "I am not particularly a huge fan of war films. Much of it is because they too often glamorize war or present bullet-proof heroes who are anything but realistic. However, I am glad I watched \"1917\" because neither of these problems exist in the story plus it's a very good depiction of war and the awfulness of it...particularly WWI.The story is very simple...two lance corporals are sent on a mad dash across enemy territory to alert troops on the other side of this no-man's land that they are walking into a trap. The film shows their journey and the thrilling finale.The plot is among the simplest I've seen in a war film and the movie is really about action and the men's struggle to sneak across the battlefield and alert their troops....simple. Yet it was made so thoughtfully and realistically that it really worked well. A brilliantly made film...among the best I've seen about war. But it's also very graphic and unpleasant....so be forewarned."
    },
    {
      "username": "aivilovee",
      "userUrl": "https://www.imdb.com/user/ur56853570",
      "reviewLink": "https://www.imdb.com/review/rw5315851",
      "warningSpoilers": false,
      "date": "12 December 2019",
      "rate": "9",
      "helpful": "517 out of 693 found this helpful.",
      "title": "An achievement",
      "content": "It's a stunning watch from start to finish. The amount of work that went into this film alone deserves your attendance, and even then, the story never stalls, and has a fair balance between war and humanity, and has some of the most incredible camera work I've seen in a while. It's hands down my favorite film of 2019."
    },
    {
      "username": "diegosays",
      "userUrl": "https://www.imdb.com/user/ur76534649",
      "reviewLink": "https://www.imdb.com/review/rw5389758",
      "warningSpoilers": false,
      "date": "7 January 2020",
      "rate": "10",
      "helpful": "651 out of 864 found this helpful.",
      "title": "We're living in such wonderful times...",
      "content": "1917 is a poem. Is the most deep, impressive and realistic way of seeing what kinds of things happened in WWI. This movie made me leave the movies with tears in my eyes as if I have had a time travel experience to the World War I, and then waking up and realizing how wonderful are the times we are living in. 1917 is a must see movie for everyone."
    },
    {
      "username": "allentyson-89230",
      "userUrl": "https://www.imdb.com/user/ur112121914",
      "reviewLink": "https://www.imdb.com/review/rw5394852",
      "warningSpoilers": false,
      "date": "10 January 2020",
      "rate": "10",
      "helpful": "978 out of 1,327 found this helpful.",
      "title": "Don't listen to critics!",
      "content": "Don't listen to the critics saying this movie is boring. This movie is one of the most tense and exciting movies I've seen in years. Amazing cinematography and overall amazing experience of a movie."
    },
    {
      "username": "eelen-seth",
      "userUrl": "https://www.imdb.com/user/ur21869650",
      "reviewLink": "https://www.imdb.com/review/rw5302763",
      "warningSpoilers": false,
      "date": "6 December 2019",
      "rate": "8",
      "helpful": "260 out of 379 found this helpful.",
      "title": "A technical masterpiece",
      "content": "Sam Mendes' war drama is set during World War I and very personal to him, as it tells a story his grandfather used to tell him when he was still a young lad. Dedicated to Mendes' hero, this drama cuts deep when we join two young soldiers on a mission to deliver a message that could possibly save thousands of fellow combatants.Filmed and edited as if it was one long take, the camera never leaves our main protagonists, Blake (Dean-Charles Chapman) and Schofield (George MacKay), out of its sight. Mendes (Skyfall) and co-writer Krysty Wilson-Cairns (Penny Dreadful) therefore corner themselves by relying on this kind of linear storytelling, to tell a very focused but at times a somewhat thin tale. Some of the scenes are so empty, it will for sure test audiences' patience. Technical, '1917' is a true feast for the eyes and ears.Roger Deakins' (Blade Runner 2049) cinematography is once again breathtakingly superior to anything else you've seen this year, and for sure will be the one thing people unanimously praise. Sound editing/mixing, visual effects and production design are all outstanding. These are the things, people will remember. It is Thomas Newman's (Passengers) score that elevates every moment happening in front of you, intensifying the emotions brought by our main characters. And although MacKay (Captain Fantastic) and Chapman (Game of Thrones) do a pretty phenomenal job at capturing the true essence of their characters going through a literal hell, it's the side characters with little-to-no screen time who steal their spotlight. Andrew Scott (Fleabag), Mark Strong (Shazam!), Richard Madden (Rocketman) and Benedict Cumberbatch (Dr. Strange) are checkpoints along the way, but man, do they impress with the few lines they're given.1917 is without a doubt a technical masterpiece, that will inspire many filmmakers, but I can't feel a bit let down. As an overall film, it wants to play a heavy tune on your heartstrings, but can't reach that level of sentiment, because the focus on technicalities pulled me out of the story. It for sure is one of the better films 2019 has brought to the big screen, yet a bit more focus on the script could've made this the cinematic masterpiece of the decade. Nonetheless, I recommend watching this on the biggest screen possible and enjoy another fine piece of cinema brought to you by Sam Mendes."
    },
    {
      "username": "RforFilm",
      "userUrl": "https://www.imdb.com/user/ur26680166",
      "reviewLink": "https://www.imdb.com/review/rw5415616",
      "warningSpoilers": true,
      "date": "17 January 2020",
      "rate": "8",
      "helpful": "87 out of 126 found this helpful.",
      "title": "1917 recruits you to experience a war journey done in an impressive \"one-shot\" style that I can't say i've seen before",
      "content": "Saving Private Ryan, 30 Seconds over Tokyo, Patton, Inglorious Bastards, The Great Escape and Schindler's List are only a few of the countless movies about World War II that have been made. In fact, many are still made today. So why haven't there been a lot of movies about the first World War? I think it comes down to exactly what was being fought for and what it meant for everyone. Everyone can agree that Nazism is bad and running a nation as a dictatorship robs everyone of their freedom. Germany was a common enemy that everyone would want to fight, similar to a simple film's goal of good against evil.While World War I may have not had a simple enemy to get behind, it's still an important war as it collapsed several European empires, set the stage for a revolution in Russia, put the U. S. in a larger military position and unfortunately led to the deaths of millions. What movies can do is really put us in the position of those solders to see the magnitude of warfare and it's path of devastation. This may make 1917 one of the most intense movies to sit through, but an important one to witness.In the misty month of April in 1917, English soldiers are resting after seeing the Germans pulling back from the western front. Two solders, Blake (played by Dean-Charles Chapman) and Schofield (played by George MacKay) are assigned to deliver a message to another Battalion. They receive more information from General Erinmore (played by Colin Firth), where they find out that the 2nd Battalion , which is assuming an easy victory, is about to walk into a deadly battle with most of the German offensive attacking there. With the phone lines cut, both Blake and Schofield are instructed to cross No Man's Land to find the Battalion and deliver a message to not attack.Plot wise, that's all you need to know about 1917. The rest of the movie follows these two men as they cross over the horror that is No Man's Land, abandoned German trenches and everything else that would scare any soldier crossing the lines. What separates this from a lot of other war movies is that the entire film is created to appear that everything is done in one continuous shot, never taking the perspective away from the main characters. This also includes time and light, depending whether it's day or night.Even with it's ambition, 1917 is still a phenomenal movie that's an experience that gave my heart a large rush. Director Sam Mendes (American Beauty, Skyfall) clearly wanted to give audiences the best way to experience the trenches and gunshots and did so through this one shot story. Birdman may have done something similar, but given how many extras and special effects went off, I would love to see a behind the scenes look at how everything was done. The cinematography pays a lot of detail to little things like the color of the sky during sunrise and how much paler skin would become after death.The story feels a lot like something out of theme park or a video game...and I mean that in a good way. You're aware that your watching someone else's experience , but the right angles do make you feel like you're a part of it. Where 1917 endures in the story is it's simple goal while going through several layers of warfare Hell. I could see this getting boring quick, but despite it's one shot goal, every scene still has a different look that never feels too familiar. The movie knows not to stop for too long unless it was for an important reason. It's a rush.Does this movie into the bigger political or social impact of World War I? No, but that was never the intention. It's like watching someone's small story that is large in scale. If I did have any problems is that there's a point where a character is knocked out and he's awoken. I won't say where, but it broke part of the spell that the movie put me in. You can tell it's a point where they were hiding an edit, but if the movie had a bunch of them in plain sight, you'd think they could have done better.I'll give this eight dogfight planes out of ten. Like a lot of war movies, this isn't a pleasant experience. It isn't supposed to be; it's meant to be a tool to really give you something that a lot of people have forgotten about as WWI movies aren't made a lot. I highly recommend this if your willing to see something that I can't say I could make myself."
    },
    {
      "username": "aarongnr",
      "userUrl": "https://www.imdb.com/user/ur69858713",
      "reviewLink": "https://www.imdb.com/review/rw5412781",
      "warningSpoilers": true,
      "date": "16 January 2020",
      "rate": "7",
      "helpful": "555 out of 856 found this helpful.",
      "title": "While its undeniable that it is a Visual Masterpiece...",
      "content": "It still wasn't fully satisfying for me.Obviously the story is pretty much one line: deliver this message. This is ok, not every movie needs to be packed with story. But then it shouldn't waste too much time either, it should be faster paced, there should always be something to look at that's actually interesting. The stapled corpses get boring at some point.The biggest problem I had with this movie, were the unnecessary coincidences. 1) The germans take every step to not leave food or anything behind, yet there is exactly 1 cow and 1 milk bucket left. Which leads to 2) In the town the protagonist jump exactly into this 1 house wherw there's also a baby that needs this milk. 3) The rat. It just runs into the trap exactly when our protagonists are there. Of course. 4) The plane. You guessed it: It lands exactly at our heroes feet. And they decide to help the german guy (why?) which leads to Blakes death.Other than that, the movie really was spectacular and a feast for this eyes. But it is a movie with just a few too many problems to really shine for me."
    },
    {
      "username": "tgrafflin",
      "userUrl": "https://www.imdb.com/user/ur20889743",
      "reviewLink": "https://www.imdb.com/review/rw5384922",
      "warningSpoilers": false,
      "date": "5 January 2020",
      "rate": "10",
      "helpful": "967 out of 1,219 found this helpful.",
      "title": "I Wanted to Hate This Hauntingly Beautiful Gift of a Movie",
      "content": "I sat in a packed yet silent theater this morning and watched, what I believe to be, the next Academy Award winner for the Best Picture. I'm not at all a fan of war movies but I am a fan of great movies....and 1917 is a great movie. I have never been so mesmerized by set design and direction, the mass human emotion of this film is astonishingly captured and embedded magically in the audience. It keeps running through my mind...the poetry and beauty intertwined with the raw misery of war. Treat yourself....see this movie!"
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5474158",
      "warningSpoilers": false,
      "date": "10 February 2020",
      "rate": "",
      "helpful": "121 out of 193 found this helpful.",
      "title": "1917",
      "content": "Absolutely incredible - I've seen it 3 times in cinemas and each time I find myself even more in awe of, blown away by, and in love with this film. It's thrilling, tense, gentle, satisfying, and deeply beautiful. As a huge fan of the war genre, this is unlike any other film I've ever seen - it finds its true strength in its unexciting, human moments rather than in the mindless chaos of firefights, while still managing to have some of the most exhilarating and edge-of-your-seat segments I've ever seen. Schofield is a brilliant and unconventional choice for the lead character, and his empathy and softness have made him one of my favourite characters of all time and an exceptionally rare example of how quiet tenderness truly can carry a war film better than loud banter and hyper-masculine bluster so often does. Krysty Wilson-Cairns is a genius and George Mackay said so much more in Schofield's silence than most actors could hope to in the grandest monologue. A masterpiece."
    },
    {
      "username": "gkdidaxi",
      "userUrl": "https://www.imdb.com/user/ur30837647",
      "reviewLink": "https://www.imdb.com/review/rw5382122",
      "warningSpoilers": false,
      "date": "4 January 2020",
      "rate": "10",
      "helpful": "748 out of 979 found this helpful.",
      "title": "Words fail me",
      "content": "This film is overwhelming. I have nothing further to add, other than the compelling need for eternal remembrance to those who sacrificed their lives in any way, we can not fathom. We, citizens of any country, today, should feel ourselves lucky and blessed to exist. A Happy New Year to all. George from Hellas. NB: do not give it a second thought; watch it; even if this genre is not your cup of tea. After all, it is much more than a feature film. It's a massive dedication to unselfishness. Do yourself a favour and watch it. And then watch it once more."
    },
    {
      "username": "andrewroy-04316",
      "userUrl": "https://www.imdb.com/user/ur71021213",
      "reviewLink": "https://www.imdb.com/review/rw5400965",
      "warningSpoilers": true,
      "date": "12 January 2020",
      "rate": "8",
      "helpful": "50 out of 75 found this helpful.",
      "title": "A technical marvel, 1917's one-shot conceit is immersive and affecting",
      "content": "1917 is a very good film in general, but it's the way it's shot that marks it as an artistically cutting-edge film. It brings the technical excellence of Dunkirk, with great war sets and brutally realistic depictions of the intensity of war, but intelligently turns to a humanist angle in telling a simple story of two men trying to help their country's men. There are no bad elements of 1917, but it's the phenomenal execution of the one-shot technique that makes it great. The tracking shots in the trenches made me realize how much less immersive it is to be constantly cut to the front of the next shot, rather than seeing the path the characters take. Given that it's this one epic journey, it is fitting to go on it with Schofield the whole way. The colors and big war shots (especially Schofield running across the war zone to reach the captain and him jumping into the river) were gorgeous. The score is essential, ratcheting tension up quickly in scenes like the rat trip wire and also calming it down in personal scenes like one character's death and when Schofield meets the baby and woman. War is so extreme and all-encompassing that it's truly difficult for any film to accurately capture it, but 1917 belongs up there with the best efforts. It is a film of brutality and loyalty, but above all it's a beautiful work of art about one of the ugliest subjects known to man."
    },
    {
      "username": "dr-peter-coldwell",
      "userUrl": "https://www.imdb.com/user/ur38182114",
      "reviewLink": "https://www.imdb.com/review/rw5318396",
      "warningSpoilers": false,
      "date": "13 December 2019",
      "rate": "10",
      "helpful": "2,421 out of 2,822 found this helpful.",
      "title": "Review from a combat veteran.",
      "content": "Last night COL Ferry and I (COL Coldwell, both USA) were able to watch the new WWI film, 1917, before it has national release. It is a cinematographic feast for the eyes, long expansive shots that follow the protagonists as they execute their mission. It does not hide the horrors that existed in trench warfare, it shows them for their brutality and abundance. (My great uncle died as a consequence of his service fighting in the trenches, mustard gas poisoning). In many ways it reminded me of Saving Private Ryan.For those who have served in combat (I have deployments to Iraq and Afghanistan), I cannot tell you if the film will be too difficult to watch, it might well be, especially if incoming artillery is a trigger. For me, as the camera travels a few inches above the dirt advancing slowly up a berm, my response was visceral. I was taken back to the patrols we walked in Afghanistan, not knowing what was around the corner; not relaxing heightened vigilance, not knowing if there would be an IED, a child wearing a suicide vest, a sniper taking aim. For the protagonists in this film (as for all who served and are serving) surviving the climb up the berm, there is no sigh of relief, no respite from the fear of uncertainty. They (we) survive to move forward to face more uncertainty.Watching allowed me to pay homage to my great uncle, and the approximate 800,000 other Brits who were killed or died as a consequence of their service. (Germany lost over 2 million soldiers in the war). Estimates put the total casualty numbers for both military and civilians at 40 million, half killed or died from wounds/infection.I rate this film as 10/10, for many reasons. Directing, acting, set design, cinematography, musical score, the raw emotion it invokes. Some critics have said they never felt a connection with the characters, I suspect they never served in combat. While the brotherhood (including female War Fighters) is strong, there is also a common characteristic possessed by all War Fighters, the ability to focus on a mission and suppress emotion, even as those around the Fighter fall. This was the quality I recognized in the actors and why the viewer doesn't \"bond\" with the main protagonists; we, the viewer, were on the mission with them, we grieve as we can and move on.Watch if you will, but know there is no pleasure in watching and the film will grab you and the beginning and not let you go. Even though we know the outcome of WWI, there is no joy, there is no peace. Watch because it will allow you a glimpse at the horror and brutality of war; reflect on their service and sacrifice. Note, as we (the viewer) are \"walking\" through the trenches, glancing shots of the young soldiers shows them with flat affect, isolation, almost apathy; this is the face of \"shell shock,\" what we know call post-traumatic stress disorder.For original WW1 footage, watch \"They Shall Never Grow Old,\" an exceptional documentary."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw8646026",
      "warningSpoilers": false,
      "date": "30 October 2022",
      "rate": "10",
      "helpful": "14 out of 19 found this helpful.",
      "title": "Epic in All Proportions...",
      "content": "You're on a mission to deliver key instructions, that will halt significant, headcount reductions, but to get to where you need, you'll have to weave, bereave, believe, avoiding terminal pitfalls, lethal obstructions.Leaving you under no illusion of the hell suffered by those during The Great War, telling an amazing tale of bravery, determination, conviction and courage, through spectacular cinematography, editing, set design and dialogue, all layered through huge performances by the cast, none more so than that from George MacKay, who carries you, as well as a great burden, through the torment and the trenches of man's inhumanity to man."
    },
    {
      "username": "shadden66",
      "userUrl": "https://www.imdb.com/user/ur58592449",
      "reviewLink": "https://www.imdb.com/review/rw5414601",
      "warningSpoilers": true,
      "date": "17 January 2020",
      "rate": "7",
      "helpful": "255 out of 401 found this helpful.",
      "title": "Good but not great",
      "content": "The one-shot look of this movie was interesting. Wasn't sure if I was going to like that that approach to filming but it worked for this film.The movie looked fantastic and the scenes and shots were breath taking. Sound and music score really helped a viewer on an emotional level as well.While I was engrossed and drawn into this film from start to finish, after it was over and I had time to reflect on it, I found it not the profound masterpiece others have stated it as.The plot in general was unrealistic - there are better ways to deliver a message than sending two soldiers across enemy lines and relying on luck and hope.Some of the scenes dragged as well, which caused the movie to lose momentum for me. Felt the build up often yes, but then there would be scene that made me lose interest (truck ride. French woman & baby).Acting wasn't spectacular either, from anyone in the film. You can have all the explosions and battle scenes you want that look great, but if the actors can't carry the script along it won't work as a whole. This is why the comparisons that mention Saving Private Ryan don't work for me - those actors drew you in with their performances. That didn't happen here, and between the acting and the momentum losing scenes, is why I cant rate this film any higher.Close, but missed the mark for a perfect film, but a good watch none the less."
    },
    {
      "username": "Instant_Palmer",
      "userUrl": "https://www.imdb.com/user/ur39322316",
      "reviewLink": "https://www.imdb.com/review/rw5371379",
      "warningSpoilers": true,
      "date": "1 January 2020",
      "rate": "10",
      "helpful": "35 out of 51 found this helpful.",
      "title": "Visually Stunning Academy Award Winner for Cinematography (and 6+ more nominations likely)",
      "content": "Director/Writer Sam Mendes and Cinematographer Roger Deakins produce the best war film of the 2010s. Truly stunning visually, the story of two soldiers' race to the front lines of WWI under direct orders to deliver the message to stop 1,600 British soldiers from entering a trap set-up by German forces to massacre them, keeps the audience on the edge of their seats, and inside the soldiers' boots, through amazing Mendes/Deakins directing/cinematography techniques.This is film art in its highest form, and is at once incredibly beautiful and horrific.A runaway certain Oscar winner for Cinematography (Deakins), and nominations (at a minimum) for Best Film, Director, Visual Effects, Screenplay (Mendes), Film Editing (Lee Smith), and Actor (George MacKay)."
    },
    {
      "username": "thompson12001",
      "userUrl": "https://www.imdb.com/user/ur13214533",
      "reviewLink": "https://www.imdb.com/review/rw5360598",
      "warningSpoilers": false,
      "date": "28 December 2019",
      "rate": "10",
      "helpful": "394 out of 589 found this helpful.",
      "title": "One of the greatest war movies of all time",
      "content": "This is hands down one of the greatest war movies to ever hit the silver screen along with being very unique. The hell of the WWI battlefield is a subject that hasn't been covered in a long time and Mr. Mendes executes this perfectly. A movie like this couldn't have been made 50 years ago but with today's advances in film making along with a large studio budget Mr. Mendes takes us through an adventure every bit as harrowing as Saving Private Ryan and Thin Red Line.The use of the single shot was brilliant as it brings the viewer along in the trenches and further adds to the realism to the film. I was surprised to hear that this was gimmicky effect from some critics, I feel Mr. Mendes nailed it brilliantly with the help of some fantastic cinematography. The set pieces were so realistic and detailed, a lesser director would've focused more on them but for this ride the camera never stops moving and it's a benefit to the film.There was no slow part in the movie and the audience is enthralled with the journey from the first minute of the film. The dialogue was great and certainly was a key component of making the single shot method work here. There is no pointless exposition in the movie.This isn't a piece to glorify war but rather demonstrate how one can be brave all the while showing their vulnerabilities and fear that any normal person would feel in that type of situation. There are no gratuitous bits in the film to exemplify heroism, just a simple story that allows the characters to shine and define bravery on their own terms.From the acting, to the score, to the cinematography, editing and overall direction of the film Mr. Mendes absolutely knocked it out of the park. This isn't just one of the best war movies of all time, I believe it's truly one of the best pieces of film to ever grace the big screen. 1917 will leave you breathless and for many like myself, in tears when the journey comes to and end.Bravo!!"
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw5481020",
      "warningSpoilers": false,
      "date": "13 February 2020",
      "rate": "10",
      "helpful": "27 out of 42 found this helpful.",
      "title": "A truly outstanding movie.",
      "content": "I haven't seen Parasite yet, all I can say is that it must be fantastic, to have beaten this to The Oscar for best movie. The story is incredible, intense, moving, and of course a piece of reality. The raw human emotions is perfectly captured, the Cinema watched in silence, you could tell the audience were captivated.A cinematic Masterpiece, it looks incredible, a lavish, visual treat, the production values are outstanding, it looks and sounds terrific.. There are many moments from this movie that will live with me for a long time. The performances are outstanding, I wouldn't pick out a singular one, they are all terrific.War films are becoming a favourite genre of mine, Dunkirk from a few years ago, and now 1917.If you see one film this year, watch this, it is phenomenal. 10/10"
    },
    {
      "username": "joachimokeefe",
      "userUrl": "https://www.imdb.com/user/ur1148847",
      "reviewLink": "https://www.imdb.com/review/rw5433495",
      "warningSpoilers": false,
      "date": "24 January 2020",
      "rate": "7",
      "helpful": "44 out of 70 found this helpful.",
      "title": "Like watching someone else play a high-end computer game",
      "content": "Two young English soldiers (possibly Cockney) must deliver a message across enemy lines to save 1600 men from certain annihilation - and one of them has a sibling in the doomed attack.Technically, directorially, cinematographically, 1917 is stunning; amazing. As you probably know, it's supposed to consist of one continuous 2-hour shot. Hitchcock, eat your heart out.Nearly 500 rank-and-file digital artists alone might tell you different, and I'd be interested to learn about the size of the camera disk drive they used, if it was 'one take'.Emotionally, 1917 is suspenseful, scary, shocking, sad, exciting, nightmarish, and yet: your engagement with the two main characters is more to do with 'what will be thrown at these actors next?', rather than 'what will happen to this person I really care about?'It's like watching someone play a massively multiplayer online WWI game, with graphics and camera movement that blows the competition away because it's actually staged. It's not like feeling anger at the stupidity of war, or feeling grief at the deaths of thousands over a pointless dispute between royal cousins - any Germans certainly get a very rough ride from the script.1917 is impressive in the way 'Saving Private Ryan' was impressive, but not as moving in the way 'Paths Of Glory' and many others were emotionally moving.Ten stars for technique, five for throwing money at a series of old soldiers' gory tales without any more context than, 'Wow, look at this!!'"
    },
    {
      "username": "jashminocha",
      "userUrl": "https://www.imdb.com/user/ur109239030",
      "reviewLink": "https://www.imdb.com/review/rw5298899",
      "warningSpoilers": false,
      "date": "4 December 2019",
      "rate": "8",
      "helpful": "248 out of 392 found this helpful.",
      "title": "Riveting, hauntingly beautiful and mesmerizing",
      "content": "The entire movie made to look like it's shot at one single take, this is possible because of extraordinary talented 14 times Academy Award nominee cinematographer Roger Deakins. This man is a genius, the movie is shot beautifully. it is mesmerizing to a watch world war 1 movie like it is happening right in front of you. The pacing is phenomenal. The only real flaw in the movie is that there are no great character building movements like other war movies but that is also intentional because, the main intention or motive is to save lives and not focus on characters in the movie and that works."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw6001157",
      "warningSpoilers": false,
      "date": "16 August 2020",
      "rate": "",
      "helpful": "16 out of 24 found this helpful.",
      "title": "Engaging, but the technical delivery carries the weakness in the narrative",
      "content": "This is an impressive bit of filmmaking, and it won 3 Oscars for just that - however the areas of the wins are quite telling and fit with my experience of watching it. The wins were all technical in nature, which is fitting because 1917 is a film that very much impresses on its delivery first, and its content a reasonably distant second. It is sort of understandable, because the central plot is about rushed forward motion, and this does mean limited opportunity for the film is flesh out its characters and scenario. It does have a go at it, and does reasonably well, but mostly this aspect is a weakness.In terms of tension and thrills, it does well at its best, producing many good set-pieces through the run-time. The downside of this is that sustained periods without big moments, or engaging smaller drama, do give an up/down feeling to the pace of delivery. Broadly though, it flows well and takes the viewer along with it. Main reason though was the technical delivery. I am a sucker for a \"single-shot\" delivery, so I was already open to loving this film on that basis alone. Okay it is not one single take so much as a series of takes (longest of which is 8 minutes), but this is still hugely impressive and it gives the film the sense of movement and momentum that the narrative benefits from. Cinematography, lighting, sound, editing, effects - all the technical aspects come together impressively and it enough to carry the film over the weaknesses in other areas. The cast occasionally distract by virtue of their fame, but mostly they work well, and the two young leads sell their situations well.Overall though, I still ended the film thinking about the technical aspects than I was about the characters or the film as a whole - which isn't a good situation. When I watched The Irishman, I quickly stopped noticing the de-aging technology and just got into the film; however here the same didn't happen consistently - I found I was broken out of the film and was focused on the camera movement, editing etc."
    },
    {
      "username": "CtlAltDel",
      "userUrl": "https://www.imdb.com/user/ur24536951",
      "reviewLink": "https://www.imdb.com/review/rw5403066",
      "warningSpoilers": false,
      "date": "12 January 2020",
      "rate": "7",
      "helpful": "114 out of 192 found this helpful.",
      "title": "Style over substance",
      "content": "Try and see it on the big screen. The 'one continuous shot' method works very well thru the trenches but is probably not necessary elsewhere, apart from a few chase scenes. I came out of the theatre feeling overwhelmed but found I'd just about forgotten the film by the next day. Why was that? Because you never actually make an emotional connection with the main characters. Actually, there is no real character development. It's gripping at times but more a case of style over substance - worth it just for the style though."
    },
    {
      "username": "iamianiman",
      "userUrl": "https://www.imdb.com/user/ur58447224",
      "reviewLink": "https://www.imdb.com/review/rw5393345",
      "warningSpoilers": false,
      "date": "9 January 2020",
      "rate": "8",
      "helpful": "144 out of 248 found this helpful.",
      "title": "A century and three years old, 1917 relives the terrifying but excellent journey of two unsung heroes.",
      "content": "It features a realistic portrayal of a true remarkable story following the appalling journey of two soldiers having to call off the attack against Germany.1917 is a massive technical achievement done right. The camera tracks this pair of individuals with a smooth good-looking one continuous shot for 110 mins! Despite it's not exactly one shot, the slick technique where it manages to trick the audience's eyes when a one shot jumps from the other is brilliant.Cinematography is riveting to the eyes. There are so many important close-ups that picture a thousand words of these two soldiers about their past and their emotional trauma of the World War 1 effect. The better thing is it knows when to pull back from those close-ups to reveal the true scale of the horrendous and the shock of the battlefield.Immersively done, 1917 sucks you into the sheer horror of experiencing the daunting moments of World War 1. You will feel as if you are walking with these men.1917 is a highly suspenseful film from the front 'till the end of the line. I can assure you, the intensity is greater than 90% horror movies in the last decade. Sam Mendes escalates the tense atmosphere little by little before he uncovers everything in the final 20 minutes.The set feels very much like a breath of air back in the early 1900s. It is unrelenting seeing objects, locations and soldiers are bombed into pieces, excellently enhanced by how specific the layouts are to justify the maddening era of bloodbath.Though feels gimmicky, the music projects a powerful influence in increasing the gritty war moments and giving the sense that every scene should be appreciated as much as possible.George Mackay & Dean Chapman's performances are great however, I wish they could give more. The former expresses his raw emotions clearly but sometimes, he falls flat and the latter's way of characters feels quite unbelievable due to Chapman's failure to construct expressions that is substantially connected to the impacts of war. For mega-awards like Golden Globe & Oscar, the lack of creativity to create nuances details on their face, resulted in them not nominated for Best Actor/Supporting Actor.1917 renders much of a survival movie like Dunkirk rather than non-stopping war shootings genre. The plot is where the downside comes. Mind that it is great and propulsively executed but the emptiness of the sub-stories is what 1917 suffers.1917 also hurts by putting in dialogues that does not drive the story further, but only to give a sense of what personality the characters embody.Verdict: 1917 is a warfare that feels immersive and nerve-wracking with its glorious cinematography and visual designs however, it occasionally steps into the landmines which is forgivable as the whole movie transmits an experience that is substantially novelty and worth living for."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw5394960",
      "warningSpoilers": false,
      "date": "10 January 2020",
      "rate": "10",
      "helpful": "84 out of 160 found this helpful.",
      "title": "Mesmerizing art",
      "content": "Exhilarating from start to finish, well deserving of the Golden Globe wins! A masterpiece I'm so glad I got to see in RPX. So well filmed with beautiful lighting, suspense, incredible action, and cinematography is top notch. I loved everything about 1917 especially the exciting night sequence and the I'm happy with everything that happens."
    }
  ],
  "errorMessage": ""
}