{
  "imDbId": "tt8579674",
  "title": "1917",
  "fullTitle": "1917 (2019)",
  "type": "Movie",
  "year": "2019",
  "language": "en",
  "titleInLanguage": "1917 (2019 film)",
  "url": "https://en.wikipedia.org/wiki/1917_(2019_film)",
  "plotShort": {
    "plainText": "1917 is a 2019 British war film directed and produced by Sam Mendes, who co-wrote it with Krysty Wilson-Cairns. Partially inspired by stories told to Mendes by his paternal grandfather Alfred about his service during World War I, the film takes place after the German retreat to the Hindenburg Line during Operation Alberich, and follows two British soldiers, Will Schofield (George MacKay) and Tom Blake (Dean-Charles Chapman), in their mission to deliver an important message to call off a doomed offensive attack. Mark Strong, Andrew Scott, Richard Madden, Claire Duburcq, Colin Firth, and Benedict Cumberbatch also star in supporting roles. Like Alfred Hitchcock's Rope, it lacks apparent cuts, looking largely as if filmed in two long takes.\r\nThe project was announced in June 2018, with MacKay and Chapman signing on in October and the rest of the cast joining the following March. Filming took place from April to June 2019 in the UK, with cinematographer Roger Deakins and editor Lee Smith using long takes to have the entire film appear as two continuous shots.\r\n1917 premiered in the UK on 4 December 2019 and was released theatrically in the United States on 25 December by Universal Pictures and in the United Kingdom on 10 January 2020 by Entertainment One. It was a critical and box office success, grossing $384.9 million worldwide. The film was nominated for ten awards at the 92nd Academy Awards, winning three, and received numerous other accolades.",
    "html": "<p>1917 is a 2019 British war film directed and produced by Sam Mendes, who co-wrote it with Krysty Wilson-Cairns. Partially inspired by stories told to Mendes by his paternal grandfather Alfred about his service during World War I, the film takes place after the German retreat to the Hindenburg Line during Operation Alberich, and follows two British soldiers, Will Schofield (George MacKay) and Tom Blake (Dean-Charles Chapman), in their mission to deliver an important message to call off a doomed offensive attack. Mark Strong, Andrew Scott, Richard Madden, Claire Duburcq, Colin Firth, and Benedict Cumberbatch also star in supporting roles. Like Alfred Hitchcock's Rope, it lacks apparent cuts, looking largely as if filmed in two long takes.</p><p>The project was announced in June 2018, with MacKay and Chapman signing on in October and the rest of the cast joining the following March. Filming took place from April to June 2019 in the UK, with cinematographer Roger Deakins and editor Lee Smith using long takes to have the entire film appear as two continuous shots.</p><p>1917 premiered in the UK on 4 December 2019 and was released theatrically in the United States on 25 December by Universal Pictures and in the United Kingdom on 10 January 2020 by Entertainment One. It was a critical and box office success, grossing $384.9 million worldwide. The film was nominated for ten awards at the 92nd Academy Awards, winning three, and received numerous other accolades.</p>"
  },
  "plotFull": {
    "plainText": "1917 is a 2019 British war film directed and produced by Sam Mendes, who co-wrote it with Krysty Wilson-Cairns. Partially inspired by stories told to Mendes by his paternal grandfather Alfred about his service during World War I, the film takes place after the German retreat to the Hindenburg Line during Operation Alberich, and follows two British soldiers, Will Schofield (George MacKay) and Tom Blake (Dean-Charles Chapman), in their mission to deliver an important message to call off a doomed offensive attack. Mark Strong, Andrew Scott, Richard Madden, Claire Duburcq, Colin Firth, and Benedict Cumberbatch also star in supporting roles. Like Alfred Hitchcock's Rope, it lacks apparent cuts, looking largely as if filmed in two long takes.\r\nThe project was announced in June 2018, with MacKay and Chapman signing on in October and the rest of the cast joining the following March. Filming took place from April to June 2019 in the UK, with cinematographer Roger Deakins and editor Lee Smith using long takes to have the entire film appear as two continuous shots.\r\n1917 premiered in the UK on 4 December 2019 and was released theatrically in the United States on 25 December by Universal Pictures and in the United Kingdom on 10 January 2020 by Entertainment One. It was a critical and box office success, grossing $384.9 million worldwide. The film was nominated for ten awards at the 92nd Academy Awards, winning three, and received numerous other accolades.\r\nPlot\r\nOn 6 April 1917, aerial reconnaissance has observed that the Imperial German Army, which has pulled back from a sector of the Western Front in northern France, is not in retreat but has made a strategic withdrawal to the new Hindenburg Line, where they are waiting to overwhelm the British with artillery. In the British trenches, with field telephone lines cut, two young British lance corporals, William Schofield, a veteran of the Somme, and Tom Blake, are ordered by General Erinmore to carry a message to Colonel Mackenzie of the 2nd Battalion of the Devonshire Regiment, calling off a scheduled attack the next morning that would jeopardise the lives of 1,600 men, including Blake's brother Joseph, a lieutenant.\r\nSchofield and Blake cross no man's land to reach the abandoned German trenches, but Schofield injures his left hand along the way. In an underground barracks, they discover a tripwire set by the Germans, which is promptly triggered by a rat; the explosion almost kills Schofield, but Blake saves him, and the two escape. They arrive at an abandoned farmhouse, where a German plane is shot down in a dogfight with Allied aircraft. Schofield and Blake save the burned pilot from the wreck. Blake persuades Schofield to get water for the pilot. When Schofield's back is turned, the pilot stabs Blake. Schofield shoots the pilot dead and comforts Blake as he dies, promising to complete the mission and to write to Blake's mother. Taking Blake's rings and dog tag, as well as Erinmore's letter, he is picked up by a passing British unit.\r\nA destroyed canal bridge near Écoust-Saint-Mein prevents the British lorries from crossing, and Schofield chooses to part with them. He uses what is left of the bridge to cross alone, and comes under fire from a sniper. Exchanging shots, Schofield wounds the sniper and advances, whereupon he and the sniper shoot each other simultaneously; the sniper is killed, while Schofield is struck in the helmet and knocked unconscious. He awakens at night and makes his way through the flare-lit ruins of the town. After evading a German soldier, he discovers a French woman hiding with a presumably orphaned infant. She treats his wounds, and he gives her his canned food and milk from the farm. Despite her pleas, Schofield leaves, after hearing the chimes of a nearby clock and realising that time is running out. Encountering German soldiers, he strangles one to death and escapes pursuit by jumping into a river. The river carries him while the cherry blossoms fall. He is swept over a waterfall before reaching the riverbank. In the forest, he finds D Company of the 2nd Devons, which is in the last wave of the attack. As the company starts to move toward the front, Schofield tries to reach Colonel Mackenzie.\r\nRealising that the trenches are too crowded for him to make it to Mackenzie in time, Schofield goes \"over the top\" and sprints on the open battlefield parallel to the British trench line, just as the infantry begins its charge. He forces his way in to meet Mackenzie, who reads the message and reluctantly calls off the attack. Schofield looks for Blake's brother, and finds him, who was among the first wave and is bloodied but unharmed. Schofield informs Joseph of his mission and of Tom's death, passing on Tom's rings and dog tag. Joseph is deeply upset about his brother but thanks Schofield for his efforts. Schofield asks for permission to write to their mother about Tom's heroics, to which Joseph agrees. Exhausted, Schofield sits under a nearby tree and looks at photographs of his family; on the back of one of them is the message Come back to us.\r\nCast\r\nGeorge MacKay as Lance Corporal William \"Will\" Schofield\r\nDean-Charles Chapman as Lance Corporal Thomas \"Tom\" Blake\r\nMark Strong as Captain Smith\r\nAndrew Scott as Lieutenant Leslie\r\nRichard Madden as Lieutenant Joseph Blake\r\nClaire Duburcq as Lauri\r\nColin Firth as General Erinmore\r\nBenedict Cumberbatch as Lieutenant-Colonel Mackenzie (referred to as a colonel)\r\nDaniel Mays as Sergeant Sanders\r\nAdrian Scarborough as Major Hepburn\r\nJamie Parker as Lieutenant Richards\r\nPip Carter as Lieutenant Gordon\r\nMichael Jibson as Lieutenant Hutton\r\nRichard McCabe as Colonel Collins\r\nJustin Edwards as Captain Ivins\r\nNabhaan Rizwan as Sepoy Jondalar\r\nBilly Postlethwaite as PCO Harvey\r\nAnson Boon as Private Cook\r\nTommy French as Private Butler\r\nKenny Fullwood as Private Rossi\r\nElliot Edusah as Private Grey\r\nProduction\r\nPre-production\r\nAmblin Partners and New Republic Pictures were announced to have acquired the project on 18 June 2018, with Sam Mendes directing and co-writing the screenplay alongside Krysty Wilson-Cairns. Tom Holland was reported to be pushing for a lead role in the film in September 2018 but ultimately was not involved as he was contractually obligated to do reshoots for Chaos Walking in April 2019. In October 2018, Roger Deakins was set to reunite with Mendes as cinematographer. George MacKay and Dean-Charles Chapman entered negotiations to star that same month. Thomas Newman was hired to compose the score in March 2019. That same month, Benedict Cumberbatch, Colin Firth, Mark Strong, Richard Madden, Andrew Scott, Daniel Mays, Adrian Scarborough, Jamie Parker, Nabhaan Rizwan, and Claire Duburcq joined the cast in supporting roles.\r\nWriting\r\nIn August 2019, Mendes stated that the film shows \"the story of a messenger who has a message to carry.\" In December 2019, Mendes stated that the writing involved some risk-taking: \"I took a calculated gamble, and I'm pleased I did because of the energy you get just from driving forward (in the narrative), in a war that was fundamentally about paralysis and stasis.\" The ideas for a script, which Mendes wrote with Krysty Wilson-Cairns, came from the story that Mendes's grandfather, Alfred Mendes, a native of Trinidad who was a messenger for the British on the Western Front, had told him.\r\nFilming\r\nRoger Deakins was the cinematographer for the film, reuniting with Mendes for their fourth collaboration, having first worked together on Jarhead in 2005. Filming was accomplished with long takes and elaborately choreographed moving camera shots to give the effect of two continuous takes. Although many media accounts have referred to the story as being told in only one shot, the screen does cut to black one hour and six minutes into the film, when Schofield is knocked unconscious, and fades in upon his regaining consciousness after night has fallen. Mendes explained, \"It was to do with the fact that I wanted the movie to go from afternoon to dusk, and then from night into dawn. I wanted it to be in two movements...I wanted to take it somewhere more like a hallucination. Somewhere more surreal, almost dream-like. And horrifying too\".\r\n1917 was the first film to be shot with the Arri Alexa Mini LF digital cinema camera. Deakins wanted to use a camera with a large format image sensor, but thought that the original Alexa LF was too large and heavy to capture the intimate shots he wanted. Arri provided him with a prototype of the Mini LF two months before filming was set to begin, and two more cameras a week before. His lenses were Arri Signature Primes, of which he used three focal lengths: a 40 mm lens for most of the film, a wider 35 mm for scenes in the tunnels and bunkers, to emphasise feelings of claustrophobia, and a narrower 47 mm in the river, \"to lose some of the background\".\r\nFilming began on 1 April 2019 and continued through June 2019 in Wiltshire, Hankley Common in Surrey and Govan, as well as at Shepperton Studios. Concern was raised about filming on Salisbury Plain by conservationists who felt the production could disturb potentially undiscovered remains, requesting a survey before any set construction began. Some shots required the use of as many as 500 background extras.\r\nSections of the film were also shot near Low Force, on the River Tees, Teesdale in June 2019, a reference to river Styx. The production staff had to install signs warning walkers in the area not to be alarmed at the artificial bodies and body parts strewn around the site. For the scenes on the river, the cast and crew were assisted by a local outdoor adventure provider for safety and stunts.\r\nThe filming of the film's climax, called by many the \"Schofield Run\", required extensive pre-production, and took two days to shoot with George MacKay as Schofield running about 300 meters amidst explosions and over 500 extras as soldiers during every take. Crew members on set, including two grips, had to dress as soldiers and pass in front of the lens as the camera pulled back in order to get the \"complex choreography\" of the scene executed properly. On preparing for the scene, MacKay recalled that \"...Sam gave me a lovely note ... He said, as much as there's desperation and it's intense and what he's running to is so serious, there's almost a euphoria to it as well. It's this kind of utter release.\" During the second take, MacKay knocked into two extras as soldiers mid-run and continued to run after doing so, a moment that was not scripted. This take made it into the finished film and MacKay was not seriously injured as a result. MacKay described how they actually worked in the scene, saying \"As soon as the collisions happened, they felt inevitable. There's a grace to the run, but there's also a reality to the fact that he got knocked about on the way.\" It was not until after filming that MacKay saw the impact that the scene would have upon himself and audiences when he saw the completed film on the screen. \"To be honest, I cried...\", said MacKay about the results, \"...I don't usually get that emotional watching something I've been involved in because I'm more objective, but I found it so moving.\" In conclusion, MacKay described the shot as a \"reflection of the entire film\", while going to say that \"It's a very simple journey through massive difficulty, but there's the notion that it has to get done ... It's something that will always be with me.\"\r\nMusic\r\nThe soundtrack album of the film was released on 20 December 2019. The score was composed by Thomas Newman, the regular collaborator to Mendes. It was nominated for best original score at the Academy Awards.\r\nThe soundtrack does not include the rendition of the American folk song The Wayfaring Stranger by Jos Slovick. In early 2020, a Change.org petition collected over 2,500 signatures to urge film producers Universal Pictures and DreamWorks Pictures to release a full studio version of Slovick's performance. Subsequently, Sony Classical Records released an EP of the song on 7 February on Amazon and streaming platforms.\r\nRelease\r\nThe film premiered on 4 December 2019 at the 2019 Royal Film Performance in London, an event held in aid of the Film & TV Charity. It was released in limited theatres in the United States on 25 December 2019, before going to wide release on 10 January 2020, shortly before the widespread lockdown of theatres internationally in response to the heightening COVID-19 pandemic. The studio spent an estimated $115 million on prints and advertisements promoting the film. The film was specially formatted for IMAX at the expanded aspect ratio of 1.9:1. 1917 was released on Digital HD on 10 March 2020 and was released by Universal Pictures Home Entertainment on DVD, Blu-ray, and Ultra HD Blu-ray on 24 March 2020.\r\nReception\r\nBox office\r\n1917 grossed $159.2 million in the United States and Canada, and $225.7 million in other countries, for a worldwide total of $384.9 million, against a production budget of $90–100 million. Deadline Hollywood calculated the net profit of the film to be $77 million.\r\nIn the US, the film made $251,000 on its first day of limited release. It went on to have a limited opening weekend of $570,000, and a five-day gross of $1 million, for an average of $91,636 per-venue. The film would go on to make a total of $2.7 million over its 15 days of limited release. It then expanded wide on 10 January, making $14 million on its first day, including $3.25 million from Thursday night previews. It went on to gross $36.5 million for the weekend (beating the original projections of $25 million), becoming the first film to dethrone Star Wars: The Rise of Skywalker at the box office. In its second weekend of wide release the film made $22 million (and $26.8 million over the four-day Martin Luther King Jr. Day holiday), finishing third behind Bad Boys for Life and Dolittle. It then made $15.8 million and $9.7 million the following two weekends, remaining in second both times. During the four-day-weekend of the Academy Awards, the film made $9.3 million.\r\nCritical response\r\nOn review aggregator Rotten Tomatoes, the film holds an approval rating of 89% based on 460 reviews, with an average rating of 8.4/10. The website's critical consensus reads, \"Hard-hitting, immersive, and an impressive technical achievement, 1917 captures the trench warfare of World War I with raw, startling immediacy.\" Metacritic assigned the film a weighted average score of 78 out of 100 based on 57 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale, and PostTrak reported it received an average 4.5 out of 5 from viewers they surveyed, with 69% saying they would definitely recommend it.\r\nSeveral critics named the film among the best of 2019, including Kate Erbland of IndieWire and Sheri Linden of The Hollywood Reporter. Writing for the Hindustan Times, Rohan Naahar stated, \"I can only imagine the effect 1917 will have on audiences that aren't familiar with the techniques Sam Mendes and Roger Deakins are about to unleash upon them.\" In his review for NPR, Justin Chang was less positive. He agreed the film was a \"mind-boggling technical achievement\" but did not think it was that spectacular overall, as Mendes's style with its impression of a continuous take \"can be as distracting as it is immersive\".\r\nManohla Dargis of The New York Times called the film, \"A carefully organized and sanitized war picture that turns one of the most catastrophic episodes in modern times into an exercise in preening showmanship.\" Alison Willmore of Vulture compared it unfavourably to the war film Dunkirk (2017), writing, \"The artifice of the aesthetic premise overwhelms any of the film's other intentions.\"\r\nAccolades\r\n1917 received ten nominations at the 92nd Academy Awards, winning for Best Cinematography, Best Sound Mixing, and Best Visual Effects. It received three nominations at the 77th Golden Globe Awards and won two awards: for Best Motion Picture – Drama and Best Director. It also received eight nominations at the 25th Critics' Choice Awards, winning three awards, including Best Director, and nine nominations at the 73rd British Academy Film Awards, winning the most awards – seven, including Best Film, Best Director and Outstanding British film. It was chosen by the National Board of Review and the American Film Institute as one of the top ten films of the year.\r\nHistorical accuracy\r\nThe film was inspired by Operation Alberich, a German withdrawal to new positions on the shorter and more easily defended Hindenburg Line that took place between 9 February and 20 March 1917. However, the main and supporting characters all appear to be fictional.\r\nContrary to the film's depiction, the number of Black soldiers serving directly in the British Army itself was unknown but negligible, as the Black population in Britain at the time remained small. Instead, the majority of Black troops who participated in the British war effort served in their own colonial regiments from Africa and the West Indies. Over 15,000 men from the British West Indies enlisted in the military during the First World War, and by 1915 they were organised into the British West Indies Regiment. The regiment served in the Middle Eastern theatre of World War I, including the Sinai and Palestine campaign and the Mesopotamian campaign. Indian Sikhs would also have served in their own regiments as part of the British Indian Army, not as individuals in the ranks of British regiments and corps. By the end of 1915, the Indian infantry formations had been withdrawn from the Western Front and sent to the Middle East.\r\nThe military historian Jeremy Banning was critical of the military tactics portrayed in the film, writing \"It made no sense, as the film depicts, to have some battalions nine miles beyond the former German line and others seemingly unaware of whether this line was manned As for the assault by the Devons, no unit would attack without adequate artillery support\".",
    "html": "<p>1917 is a 2019 British war film directed and produced by Sam Mendes, who co-wrote it with Krysty Wilson-Cairns. Partially inspired by stories told to Mendes by his paternal grandfather Alfred about his service during World War I, the film takes place after the German retreat to the Hindenburg Line during Operation Alberich, and follows two British soldiers, Will Schofield (George MacKay) and Tom Blake (Dean-Charles Chapman), in their mission to deliver an important message to call off a doomed offensive attack. Mark Strong, Andrew Scott, Richard Madden, Claire Duburcq, Colin Firth, and Benedict Cumberbatch also star in supporting roles. Like Alfred Hitchcock's Rope, it lacks apparent cuts, looking largely as if filmed in two long takes.</p><p>The project was announced in June 2018, with MacKay and Chapman signing on in October and the rest of the cast joining the following March. Filming took place from April to June 2019 in the UK, with cinematographer Roger Deakins and editor Lee Smith using long takes to have the entire film appear as two continuous shots.</p><p>1917 premiered in the UK on 4 December 2019 and was released theatrically in the United States on 25 December by Universal Pictures and in the United Kingdom on 10 January 2020 by Entertainment One. It was a critical and box office success, grossing $384.9 million worldwide. The film was nominated for ten awards at the 92nd Academy Awards, winning three, and received numerous other accolades.</p><br/><h3>Plot</h3><p>On 6 April 1917, aerial reconnaissance has observed that the Imperial German Army, which has pulled back from a sector of the Western Front in northern France, is not in retreat but has made a strategic withdrawal to the new Hindenburg Line, where they are waiting to overwhelm the British with artillery. In the British trenches, with field telephone lines cut, two young British lance corporals, William Schofield, a veteran of the Somme, and Tom Blake, are ordered by General Erinmore to carry a message to Colonel Mackenzie of the 2nd Battalion of the Devonshire Regiment, calling off a scheduled attack the next morning that would jeopardise the lives of 1,600 men, including Blake's brother Joseph, a lieutenant.</p><p>Schofield and Blake cross no man's land to reach the abandoned German trenches, but Schofield injures his left hand along the way. In an underground barracks, they discover a tripwire set by the Germans, which is promptly triggered by a rat; the explosion almost kills Schofield, but Blake saves him, and the two escape. They arrive at an abandoned farmhouse, where a German plane is shot down in a dogfight with Allied aircraft. Schofield and Blake save the burned pilot from the wreck. Blake persuades Schofield to get water for the pilot. When Schofield's back is turned, the pilot stabs Blake. Schofield shoots the pilot dead and comforts Blake as he dies, promising to complete the mission and to write to Blake's mother. Taking Blake's rings and dog tag, as well as Erinmore's letter, he is picked up by a passing British unit.</p><p>A destroyed canal bridge near Écoust-Saint-Mein prevents the British lorries from crossing, and Schofield chooses to part with them. He uses what is left of the bridge to cross alone, and comes under fire from a sniper. Exchanging shots, Schofield wounds the sniper and advances, whereupon he and the sniper shoot each other simultaneously; the sniper is killed, while Schofield is struck in the helmet and knocked unconscious. He awakens at night and makes his way through the flare-lit ruins of the town. After evading a German soldier, he discovers a French woman hiding with a presumably orphaned infant. She treats his wounds, and he gives her his canned food and milk from the farm. Despite her pleas, Schofield leaves, after hearing the chimes of a nearby clock and realising that time is running out. Encountering German soldiers, he strangles one to death and escapes pursuit by jumping into a river. The river carries him while the cherry blossoms fall. He is swept over a waterfall before reaching the riverbank. In the forest, he finds D Company of the 2nd Devons, which is in the last wave of the attack. As the company starts to move toward the front, Schofield tries to reach Colonel Mackenzie.</p><p>Realising that the trenches are too crowded for him to make it to Mackenzie in time, Schofield goes \"over the top\" and sprints on the open battlefield parallel to the British trench line, just as the infantry begins its charge. He forces his way in to meet Mackenzie, who reads the message and reluctantly calls off the attack. Schofield looks for Blake's brother, and finds him, who was among the first wave and is bloodied but unharmed. Schofield informs Joseph of his mission and of Tom's death, passing on Tom's rings and dog tag. Joseph is deeply upset about his brother but thanks Schofield for his efforts. Schofield asks for permission to write to their mother about Tom's heroics, to which Joseph agrees. Exhausted, Schofield sits under a nearby tree and looks at photographs of his family; on the back of one of them is the message Come back to us.</p><br/><h3>Cast</h3><ul><li>George MacKay as Lance Corporal William \"Will\" Schofield</li><li>Dean-Charles Chapman as Lance Corporal Thomas \"Tom\" Blake</li><li>Mark Strong as Captain Smith</li><li>Andrew Scott as Lieutenant Leslie</li><li>Richard Madden as Lieutenant Joseph Blake</li><li>Claire Duburcq as Lauri</li><li>Colin Firth as General Erinmore</li><li>Benedict Cumberbatch as Lieutenant-Colonel Mackenzie (referred to as a colonel)</li><li>Daniel Mays as Sergeant Sanders</li><li>Adrian Scarborough as Major Hepburn</li><li>Jamie Parker as Lieutenant Richards</li><li>Pip Carter as Lieutenant Gordon</li><li>Michael Jibson as Lieutenant Hutton</li><li>Richard McCabe as Colonel Collins</li><li>Justin Edwards as Captain Ivins</li><li>Nabhaan Rizwan as Sepoy Jondalar</li><li>Billy Postlethwaite as PCO Harvey</li><li>Anson Boon as Private Cook</li><li>Tommy French as Private Butler</li><li>Kenny Fullwood as Private Rossi</li><li>Elliot Edusah as Private Grey</li></ul><br/><h3>Production</h3><h4>Pre-production</h4><p>Amblin Partners and New Republic Pictures were announced to have acquired the project on 18 June 2018, with Sam Mendes directing and co-writing the screenplay alongside Krysty Wilson-Cairns. Tom Holland was reported to be pushing for a lead role in the film in September 2018 but ultimately was not involved as he was contractually obligated to do reshoots for Chaos Walking in April 2019. In October 2018, Roger Deakins was set to reunite with Mendes as cinematographer. George MacKay and Dean-Charles Chapman entered negotiations to star that same month. Thomas Newman was hired to compose the score in March 2019. That same month, Benedict Cumberbatch, Colin Firth, Mark Strong, Richard Madden, Andrew Scott, Daniel Mays, Adrian Scarborough, Jamie Parker, Nabhaan Rizwan, and Claire Duburcq joined the cast in supporting roles.</p><h4>Writing</h4><p>In August 2019, Mendes stated that the film shows \"the story of a messenger who has a message to carry.\" In December 2019, Mendes stated that the writing involved some risk-taking: \"I took a calculated gamble, and I'm pleased I did because of the energy you get just from driving forward (in the narrative), in a war that was fundamentally about paralysis and stasis.\" The ideas for a script, which Mendes wrote with Krysty Wilson-Cairns, came from the story that Mendes's grandfather, Alfred Mendes, a native of Trinidad who was a messenger for the British on the Western Front, had told him.</p><h4>Filming</h4><p>Roger Deakins was the cinematographer for the film, reuniting with Mendes for their fourth collaboration, having first worked together on Jarhead in 2005. Filming was accomplished with long takes and elaborately choreographed moving camera shots to give the effect of two continuous takes. Although many media accounts have referred to the story as being told in only one shot, the screen does cut to black one hour and six minutes into the film, when Schofield is knocked unconscious, and fades in upon his regaining consciousness after night has fallen. Mendes explained, \"It was to do with the fact that I wanted the movie to go from afternoon to dusk, and then from night into dawn. I wanted it to be in two movements...I wanted to take it somewhere more like a hallucination. Somewhere more surreal, almost dream-like. And horrifying too\".</p><p>1917 was the first film to be shot with the Arri Alexa Mini LF digital cinema camera. Deakins wanted to use a camera with a large format image sensor, but thought that the original Alexa LF was too large and heavy to capture the intimate shots he wanted. Arri provided him with a prototype of the Mini LF two months before filming was set to begin, and two more cameras a week before. His lenses were Arri Signature Primes, of which he used three focal lengths: a 40 mm lens for most of the film, a wider 35 mm for scenes in the tunnels and bunkers, to emphasise feelings of claustrophobia, and a narrower 47 mm in the river, \"to lose some of the background\".</p><p>Filming began on 1 April 2019 and continued through June 2019 in Wiltshire, Hankley Common in Surrey and Govan, as well as at Shepperton Studios. Concern was raised about filming on Salisbury Plain by conservationists who felt the production could disturb potentially undiscovered remains, requesting a survey before any set construction began. Some shots required the use of as many as 500 background extras.</p><p>Sections of the film were also shot near Low Force, on the River Tees, Teesdale in June 2019, a reference to river Styx. The production staff had to install signs warning walkers in the area not to be alarmed at the artificial bodies and body parts strewn around the site. For the scenes on the river, the cast and crew were assisted by a local outdoor adventure provider for safety and stunts.</p><p>The filming of the film's climax, called by many the \"Schofield Run\", required extensive pre-production, and took two days to shoot with George MacKay as Schofield running about 300 meters amidst explosions and over 500 extras as soldiers during every take. Crew members on set, including two grips, had to dress as soldiers and pass in front of the lens as the camera pulled back in order to get the \"complex choreography\" of the scene executed properly. On preparing for the scene, MacKay recalled that \"...Sam gave me a lovely note ... He said, as much as there's desperation and it's intense and what he's running to is so serious, there's almost a euphoria to it as well. It's this kind of utter release.\" During the second take, MacKay knocked into two extras as soldiers mid-run and continued to run after doing so, a moment that was not scripted. This take made it into the finished film and MacKay was not seriously injured as a result. MacKay described how they actually worked in the scene, saying \"As soon as the collisions happened, they felt inevitable. There's a grace to the run, but there's also a reality to the fact that he got knocked about on the way.\" It was not until after filming that MacKay saw the impact that the scene would have upon himself and audiences when he saw the completed film on the screen. \"To be honest, I cried...\", said MacKay about the results, \"...I don't usually get that emotional watching something I've been involved in because I'm more objective, but I found it so moving.\" In conclusion, MacKay described the shot as a \"reflection of the entire film\", while going to say that \"It's a very simple journey through massive difficulty, but there's the notion that it has to get done ... It's something that will always be with me.\"</p><br/><h3>Music</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">1917</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Film score</span> by <div class=\"contributor\" style=\"display:inline\">Thomas Newman</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">20 December 2019</td></tr><tr><th scope=\"row\" class=\"infobox-label\">Studio</th><td class=\"infobox-data plainlist\"><span>Abbey Road</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span class=\"mw-redirect\">Orchestral</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"h\">1</span>:<span class=\"min\">17</span>:<span class=\"s\">08</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span>Amblin Partners</span> <br> <span class=\"mw-redirect\">Sony Classical</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Producer</span></th><td class=\"infobox-data hlist\"><ul><li>Bill Bernstein</li><li>Thomas Newman</li></ul></td></tr></tbody></table><p>The soundtrack album of the film was released on 20 December 2019. The score was composed by Thomas Newman, the regular collaborator to Mendes. It was nominated for best original score at the Academy Awards.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Track listing</caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"1917\"</td><td class=\"tracklist-length\">1:17</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Up the Down Trench\"</td><td class=\"tracklist-length\">6:19</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Gehenna\"</td><td class=\"tracklist-length\">3:34</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"A Scrap of Ribbon\"</td><td class=\"tracklist-length\">6:29</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"The Night Window\"</td><td class=\"tracklist-length\">3:41</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"The Boche\"</td><td class=\"tracklist-length\">3:21</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Tripwire\"</td><td class=\"tracklist-length\">1:40</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"A Bit of Tin\"</td><td class=\"tracklist-length\">2:02</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"Lockhouse\"</td><td class=\"tracklist-length\">4:04</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Blake and Schofield\"</td><td class=\"tracklist-length\">4:20</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Milk\"</td><td class=\"tracklist-length\">10:10</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"Écoust-Saint-Mein\"</td><td class=\"tracklist-length\">2:36</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Les Arbres\"</td><td class=\"tracklist-length\">3:36</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Engländer\"</td><td class=\"tracklist-length\">4:29</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"The Rapids\"</td><td class=\"tracklist-length\">1:29</td></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"Croisilles Wood\"</td><td class=\"tracklist-length\">2:06</td></tr><tr><th id=\"track17\" scope=\"row\">17.</th><td>\"Sixteen Hundred Men\"</td><td class=\"tracklist-length\">6:32</td></tr><tr><th id=\"track18\" scope=\"row\">18.</th><td>\"Mentions in Dispatches\"</td><td class=\"tracklist-length\">3:44</td></tr><tr><th id=\"track19\" scope=\"row\">19.</th><td>\"Come Back to Us\"</td><td class=\"tracklist-length\">5:39</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>1:17:08</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary\" style=\"background-color: khaki; font-size: 125%;\">\"I Am a Poor Wayfaring Stranger (From the Film <i>1917</i>)\"</th></tr><tr class=\"description\"><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: khaki;\"><span>Single</span> by Jos Slovick</th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data plainlist\">7 February 2020</td></tr><tr><th scope=\"row\" class=\"infobox-label\">Recorded</th><td class=\"infobox-data plainlist\">2019</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Studio</span></th><td class=\"infobox-data plainlist\"><span>Abbey Road Studios</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span class=\"mw-redirect\">orchestral</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data plainlist\"><span class=\"duration\"><span class=\"min\">4</span>:<span class=\"s\">09</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span>Amblin Partners</span> <br> <span class=\"mw-redirect\">Sony Classical</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span class=\"nowrap\"><span>Producer(s)</span></span></th><td class=\"infobox-data hlist\"><ul><li>Bill Bernstein</li><li>Thomas Newman</li></ul></td></tr></tbody></table><p>The soundtrack does not include the rendition of the American folk song The Wayfaring Stranger by Jos Slovick. In early 2020, a Change.org petition collected over 2,500 signatures to urge film producers Universal Pictures and DreamWorks Pictures to release a full studio version of Slovick's performance. Subsequently, Sony Classical Records released an EP of the song on 7 February on Amazon and streaming platforms.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Track listing</caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:60%\">Title</th><th scope=\"col\" style=\"width:40%\">Artist</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"I Am a Poor Wayfaring Stranger (From 1917 (A Cappella))\"</td><td>Jos Slovick</td><td class=\"tracklist-length\">4:09</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"I Am a Poor Wayfaring Stranger (From 1917)\"</td><td>Jos Slovick &amp; Craig Leon</td><td class=\"tracklist-length\">4:49</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"I Am a Poor Wayfaring Stranger (Original Lyrics)\"</td><td>Jos Slovick &amp; Craig Leon</td><td class=\"tracklist-length\">4:49</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"3\" scope=\"row\"><span>Total length:</span></th><td>13:47</td></tr></tbody></table><br/><h3>Release</h3><p>The film premiered on 4 December 2019 at the 2019 Royal Film Performance in London, an event held in aid of the Film & TV Charity. It was released in limited theatres in the United States on 25 December 2019, before going to wide release on 10 January 2020, shortly before the widespread lockdown of theatres internationally in response to the heightening COVID-19 pandemic. The studio spent an estimated $115 million on prints and advertisements promoting the film. The film was specially formatted for IMAX at the expanded aspect ratio of 1.9:1. 1917 was released on Digital HD on 10 March 2020 and was released by Universal Pictures Home Entertainment on DVD, Blu-ray, and Ultra HD Blu-ray on 24 March 2020.</p><br/><h3>Reception</h3><h4>Box office</h4><p>1917 grossed $159.2 million in the United States and Canada, and $225.7 million in other countries, for a worldwide total of $384.9 million, against a production budget of $90–100 million. Deadline Hollywood calculated the net profit of the film to be $77 million.</p><p>In the US, the film made $251,000 on its first day of limited release. It went on to have a limited opening weekend of $570,000, and a five-day gross of $1 million, for an average of $91,636 per-venue. The film would go on to make a total of $2.7 million over its 15 days of limited release. It then expanded wide on 10 January, making $14 million on its first day, including $3.25 million from Thursday night previews. It went on to gross $36.5 million for the weekend (beating the original projections of $25 million), becoming the first film to dethrone Star Wars: The Rise of Skywalker at the box office. In its second weekend of wide release the film made $22 million (and $26.8 million over the four-day Martin Luther King Jr. Day holiday), finishing third behind Bad Boys for Life and Dolittle. It then made $15.8 million and $9.7 million the following two weekends, remaining in second both times. During the four-day-weekend of the Academy Awards, the film made $9.3 million.</p><h4>Critical response</h4><p>On review aggregator Rotten Tomatoes, the film holds an approval rating of 89% based on 460 reviews, with an average rating of 8.4/10. The website's critical consensus reads, \"Hard-hitting, immersive, and an impressive technical achievement, 1917 captures the trench warfare of World War I with raw, startling immediacy.\" Metacritic assigned the film a weighted average score of 78 out of 100 based on 57 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale, and PostTrak reported it received an average 4.5 out of 5 from viewers they surveyed, with 69% saying they would definitely recommend it.</p><p>Several critics named the film among the best of 2019, including Kate Erbland of IndieWire and Sheri Linden of The Hollywood Reporter. Writing for the Hindustan Times, Rohan Naahar stated, \"I can only imagine the effect 1917 will have on audiences that aren't familiar with the techniques Sam Mendes and Roger Deakins are about to unleash upon them.\" In his review for NPR, Justin Chang was less positive. He agreed the film was a \"mind-boggling technical achievement\" but did not think it was that spectacular overall, as Mendes's style with its impression of a continuous take \"can be as distracting as it is immersive\".</p><p>Manohla Dargis of The New York Times called the film, \"A carefully organized and sanitized war picture that turns one of the most catastrophic episodes in modern times into an exercise in preening showmanship.\" Alison Willmore of Vulture compared it unfavourably to the war film Dunkirk (2017), writing, \"The artifice of the aesthetic premise overwhelms any of the film's other intentions.\"</p><h4>Accolades</h4><p>1917 received ten nominations at the 92nd Academy Awards, winning for Best Cinematography, Best Sound Mixing, and Best Visual Effects. It received three nominations at the 77th Golden Globe Awards and won two awards: for Best Motion Picture – Drama and Best Director. It also received eight nominations at the 25th Critics' Choice Awards, winning three awards, including Best Director, and nine nominations at the 73rd British Academy Film Awards, winning the most awards – seven, including Best Film, Best Director and Outstanding British film. It was chosen by the National Board of Review and the American Film Institute as one of the top ten films of the year.</p><br/><h3>Historical accuracy</h3><p>The film was inspired by Operation Alberich, a German withdrawal to new positions on the shorter and more easily defended Hindenburg Line that took place between 9 February and 20 March 1917. However, the main and supporting characters all appear to be fictional.</p><p>Contrary to the film's depiction, the number of Black soldiers serving directly in the British Army itself was unknown but negligible, as the Black population in Britain at the time remained small. Instead, the majority of Black troops who participated in the British war effort served in their own colonial regiments from Africa and the West Indies. Over 15,000 men from the British West Indies enlisted in the military during the First World War, and by 1915 they were organised into the British West Indies Regiment. The regiment served in the Middle Eastern theatre of World War I, including the Sinai and Palestine campaign and the Mesopotamian campaign. Indian Sikhs would also have served in their own regiments as part of the British Indian Army, not as individuals in the ranks of British regiments and corps. By the end of 1915, the Indian infantry formations had been withdrawn from the Western Front and sent to the Middle East.</p><p>The military historian Jeremy Banning was critical of the military tactics portrayed in the film, writing \"It made no sense, as the film depicts, to have some battalions nine miles beyond the former German line and others seemingly unaware of whether this line was manned As for the assault by the Devons, no unit would attack without adequate artillery support\".</p><br/>"
  },
  "errorMessage": ""
}