{
  "imDbId": "tt0056592",
  "title": "To Kill a Mockingbird",
  "fullTitle": "To Kill a Mockingbird (1962)",
  "type": "Movie",
  "year": "1962",
  "language": "en",
  "titleInLanguage": "To Kill a Mockingbird (film)",
  "url": "https://en.wikipedia.org/wiki/To_Kill_a_Mockingbird_(film)",
  "plotShort": {
    "plainText": "To Kill a Mockingbird is a 1962 American legal drama film directed by Robert Mulligan. The screenplay by Horton Foote is based on Harper Lee's 1960 Pulitzer Prize–winning novel of the same name. The film stars Gregory Peck as Atticus Finch and Mary Badham as Scout. It marked the film debut of Robert Duvall, William Windom and Alice Ghostley.\r\nIt gained overwhelmingly positive reception from both the critics and the public; a box-office success, it earned more than six times its budget. The film won three Academy Awards, including Best Actor for Peck, and was nominated for eight, including Best Picture.\r\nIn 1995, the film was selected by the Library of Congress for preservation in the National Film Registry as \"culturally, historically, or aesthetically significant\". In 2003, the American Film Institute named Atticus Finch the greatest movie hero of the 20th century. In 2007, the film ranked twenty-fifth on the AFI's 10th anniversary list of the greatest American movies of all time. In 2020, the British Film Institute included it in their list of the 50 films you should see by the age of 15. The film was restored and released on Blu-ray and DVD in 2012, as part of the 100th anniversary of Universal Pictures.",
    "html": "<p>To Kill a Mockingbird is a 1962 American legal drama film directed by Robert Mulligan. The screenplay by Horton Foote is based on Harper Lee's 1960 Pulitzer Prize–winning novel of the same name. The film stars Gregory Peck as Atticus Finch and Mary Badham as Scout. It marked the film debut of Robert Duvall, William Windom and Alice Ghostley.</p><p>It gained overwhelmingly positive reception from both the critics and the public; a box-office success, it earned more than six times its budget. The film won three Academy Awards, including Best Actor for Peck, and was nominated for eight, including Best Picture.</p><p>In 1995, the film was selected by the Library of Congress for preservation in the National Film Registry as \"culturally, historically, or aesthetically significant\". In 2003, the American Film Institute named Atticus Finch the greatest movie hero of the 20th century. In 2007, the film ranked twenty-fifth on the AFI's 10th anniversary list of the greatest American movies of all time. In 2020, the British Film Institute included it in their list of the 50 films you should see by the age of 15. The film was restored and released on Blu-ray and DVD in 2012, as part of the 100th anniversary of Universal Pictures.</p>"
  },
  "plotFull": {
    "plainText": "To Kill a Mockingbird is a 1962 American legal drama film directed by Robert Mulligan. The screenplay by Horton Foote is based on Harper Lee's 1960 Pulitzer Prize–winning novel of the same name. The film stars Gregory Peck as Atticus Finch and Mary Badham as Scout. It marked the film debut of Robert Duvall, William Windom and Alice Ghostley.\r\nIt gained overwhelmingly positive reception from both the critics and the public; a box-office success, it earned more than six times its budget. The film won three Academy Awards, including Best Actor for Peck, and was nominated for eight, including Best Picture.\r\nIn 1995, the film was selected by the Library of Congress for preservation in the National Film Registry as \"culturally, historically, or aesthetically significant\". In 2003, the American Film Institute named Atticus Finch the greatest movie hero of the 20th century. In 2007, the film ranked twenty-fifth on the AFI's 10th anniversary list of the greatest American movies of all time. In 2020, the British Film Institute included it in their list of the 50 films you should see by the age of 15. The film was restored and released on Blu-ray and DVD in 2012, as part of the 100th anniversary of Universal Pictures.\r\nPlot\r\nThe film is narrated by the adult Jean Louise \"Scout\" Finch. Young Scout and her pre-teen older brother Jem live in the fictional town of Maycomb, Alabama, during the early 1930s. Despite the family's modest means, the children enjoy a happy childhood, cared for by their widowed father, Atticus Finch, and the family's African-American housekeeper, Calpurnia. During the summer, Jem, Scout, and their friend Dill play games and often search for Arthur \"Boo\" Radley, an odd, reclusive neighbor who lives with his brother Nathan. The children have never seen Boo, who rarely leaves the house. On different occasions, Jem has found small objects left inside a tree knothole on the Radley property. These include a broken pocket watch, an old spelling bee medal, a pocket knife, and two carved soap dolls resembling Jem and Scout.\r\nAtticus, a lawyer, strongly believes all people deserve fair treatment, in turning the other cheek, and in defending what you believe. Many of Atticus' clients are poor farmers who pay for his legal services in trade, often leaving him fresh produce, firewood, and so on. Atticus' work as a lawyer often exposes Scout and Jem to the town's racism, aggravated by poverty. As a result, the children mature more quickly.\r\nAtticus is appointed to defend Tom Robinson, an African-American accused of raping a Caucasian girl, Mayella Ewell. Atticus accepts the case, heightening tension in the town and causing Jem and Scout to experience schoolyard taunts. One evening before the trial, as Atticus sits in front of the local jail to safeguard Robinson, a lynch mob arrives. Scout, Jem, and Dill unexpectedly interrupt the confrontation. Scout, unaware of the mob's purpose, recognizes Mr. Cunningham and asks him to say hello to his son Walter, her classmate. Cunningham becomes embarrassed, and the mob disperses.\r\nAt the trial, it is alleged that Tom entered the Ewell property at Mayella's request to chop up a chifforobe and that Mayella showed signs of having been beaten around that time. One of Atticus' defensive arguments is that Tom's left arm is disabled due to a farming accident years ago, yet the supposed rapist would have had to mostly assault Mayella with his left hand before raping her. Atticus noted that Mayella's father, Bob Ewell, is left-handed, implying that he beat Mayella because he caught her seducing a young African-American man (Robinson). Atticus also states that Mayella was never examined by a doctor after the supposed rape. Taking the stand, Tom denies he attacked Mayella, but states that she kissed him against his will. He testifies that he had previously assisted Mayella with various chores at her request because he \"felt sorry for her\" – words that incite a swift, negative reaction from the prosecutor, and a gasp from the Caucasian audience.\r\nIn his closing argument, Atticus asks the all-Caucasian male jury to cast aside their prejudices and focus on Tom's obvious innocence. However, Tom is found guilty. As Atticus exits the courtroom, the African-American spectators in the balcony rise to show their respect and appreciation.\r\nWhen Atticus arrives home, Sheriff Tate informs him that Tom was killed during his transfer to prison, apparently while attempting to escape. Atticus, accompanied by Jem, goes to the Robinson home to relay news of Tom's death. Bob Ewell appears and spits in Atticus' face.\r\nAutumn arrives, and Scout and Jem attend an evening school pageant in which Scout portrays a ham. After the pageant, Scout is unable to find her dress and shoes, forcing her to walk home with Jem while wearing the large, hard-shelled costume. While cutting through the woods, Scout and Jem are attacked. Scout's cumbersome costume protects her but restricts her vision. The attacker knocks Jem unconscious, but is himself attacked (and killed) by a second man, unseen by Scout. Scout escapes her costume and sees the second man carrying Jem towards their house. Scout follows them and runs into the arms of a frantic Atticus. Still unconscious, Jem has his broken arm treated by Doc Reynolds.\r\nScout tells Sheriff Tate and her father what happened, then notices a strange man behind Jem's bedroom door. Atticus introduces Scout to Arthur Radley, whom she knows as Boo. It was Boo who rescued Jem and Scout, overpowering Bob Ewell and carrying Jem home. The sheriff reports that Ewell, apparently seeking revenge for Atticus humiliating him in court, is dead at the scene of the attack. Atticus mistakenly assumes Jem killed Ewell in self-defense, but Sheriff Tate realizes the truth – Boo killed Ewell defending the children. His official report will state that Ewell died falling on his knife. He refuses to drag the painfully shy, introverted Boo into the spotlight for his heroism, insisting it would be a sin. As Scout escorts Boo home, she draws a startlingly precocious analogy: comparing the unwelcome public attention that would have been heaped on Boo, with the killing of a mockingbird that does nothing but sing.\r\nCast\r\nGregory Peck as Atticus Finch\r\nMary Badham as Scout\r\nPhillip Alford as Jem\r\nJohn Megna as Charles Baker \"Dill\" Harris\r\nFrank Overton as Sheriff Heck Tate\r\nRosemary Murphy as Miss Maudie Atkinson\r\nRuth White as Mrs. Dubose\r\nBrock Peters as Tom Robinson\r\nEstelle Evans as Calpurnia\r\nPaul Fix as Judge John Taylor\r\nCollin Wilcox as Mayella Violet Ewell\r\nJames Anderson as Robert E. Lee \"Bob\" Ewell\r\nAlice Ghostley as Miss Stephanie Crawford\r\nRobert Duvall as Arthur \"Boo\" Radley\r\nWilliam Windom as Horace Gilmer, District Attorney\r\nCrahan Denton as Walter Cunningham\r\nRichard Hale as Nathan Radley\r\nUncredited roles in order of appearance\r\nKim Stanley as the narrator; the voice of adult Scout—\"Maycomb was a tired old town – even in 1932 when I first knew it – that summer I was six years old.\"\r\nPaulene Myers as Jessie, Mrs. Dubose's servant, sitting close to her on the Dubose porch.\r\nJamie Forster as Mr. Townsend, sitting on a bench, with three men, near the courthouse: \"If you're lookin' for your daddy, he's inside the courthouse.\"\r\nSteve Condit as Walter Cunningham Jr., Mr. Cunningham's son, at dinner with the Finch family: \"Yes, sir. I don't know when I had roast. We been havin' squirrels and rabbits lately.\"\r\nDavid Crawford as David, Tom Robinson's son, sitting on the steps to the Robinsons' shack: \"Good evening.\"\r\nKim Hamilton as Helen, Tom Robinson's wife, inside the Robinsons' shack: \"Good evening, Mr. Finch.\"\r\nDan White as the mob leader approaching as Atticus Finch sits in front of the jailhouse: \"He in there, Mr. Finch?\"\r\nKelly Thordsen as a heavyset member of the mob who grabs and picks up Jem: \"Well, I'll send you home.\"\r\nWilliam \"Bill\" Walker as Reverend Sykes, at the courthouse for Tom Robinson's trial: \"Miss Jean Louise? Miss Jean Louise, stand up. Your father's passin'.\"\r\nCharles Fredericks as the court clerk at Tom Robinson's trial: \"Place your hand on the bible, please. Do you solemnly swear to tell the truth...?\"\r\nGuy Wilkerson as the jury foreman at Tom Robinson's trial: \"We find the defendant guilty as charged.\"\r\nJay Sullivan as the court reporter at Tom Robinson's trial: \"Yes.\"\r\nJester Hairston as Spence, Tom Robinson's father in front of the Robinsons' shack: \"Hello Mr. Finch. I'm Spence, Tom's father.\"\r\nHugh Sanders as Doctor Reynolds, the town physician who examines Jem: \"He's got a bad break, so far as I can tell. Somebody tried to wring his arm off.\"\r\nCasting\r\nJames Stewart declined the role of Atticus Finch, concerned that the story was too controversial. Universal offered the role to Rock Hudson when the project was being first developed but producer Alan J. Pakula wanted a bigger star.\r\nProduction\r\nThe producers had wanted to use Harper Lee's hometown of Monroeville, Alabama for the set. Harper Lee used her experiences as a child in Monroeville as the basis for the fictional town of Maycomb, so it seemed that would be the best place. However, the town had changed significantly between the 1920s and the early 1960s, so they made it on the backlot in Hollywood instead.\r\nThe Old Monroe County Courthouse in Monroeville was used as a model for the film set, since they could not use the courthouse due to the poor audio quality in the courthouse. The accuracy of the recreated courthouse in Hollywood led many Alabamians to believe that the film was shot in Monroeville. The Old Courthouse in Monroe County is now a theater for many plays inspired by To Kill a Mockingbird as well as a museum dedicated to multiple authors from Monroeville.\r\nReception\r\nThe film received widespread critical acclaim. As of January 2023, it maintains a 93% rating on Rotten Tomatoes, based on 67 reviews, with an average rating of 8.9/10. The site's critical consensus states, \"To Kill a Mockingbird is a textbook example of a message movie done right – sober-minded and earnest, but never letting its social conscience get in the way of gripping drama.\" Metacritic, using a weighted average, assigned the film a score of 88 out of 100 based on 16 critics, meaning \"universal acclaim.\" According to Bosley Crowther:\r\nHorton Foote's script and the direction of Mr. Mulligan may not penetrate that deeply, but they do allow Mr. Peck and little Miss Badham and Master Alford to portray delightful characters. Their charming enactments of a father and his children in that close relationship, which can occur at only one brief period, are worth all the footage of the film. Rosemary Murphy as a neighbor, Brock Peters as the Negro on trial, and Frank Overton as a troubled sheriff are good as locality characters, too. James Anderson and Collin Wilcox as Southern bigots are almost caricatures. But those are minor shortcomings in a rewarding film.\r\nRoger Ebert of the Chicago Sun-Times criticized the film for focusing less on black people, criticizing the film for having a white savior narrative:\r\nIt expresses the liberal pieties of a more innocent time, the early 1960s, and it goes very easy on the realities of small-town Alabama in the 1930s. One of the most dramatic scenes shows a lynch mob facing Atticus, who is all by himself on the jailhouse steps the night before Tom Robinson's trial. The mob is armed and prepared to break in and hang Robinson, but Scout bursts onto the scene, recognizes a poor farmer who has been befriended by her father, and shames him (and all the other men) into leaving. Her speech is a calculated strategic exercise, masked as the innocent words of a child; one shot of her eyes shows she realizes exactly what she's doing. Could a child turn away a lynch mob at that time, in that place? Isn't it nice to think so.\r\nWalt Disney requested that the film be privately screened in his house. At the film's conclusion, Disney sadly stated, \"That was one hell of a picture. That's the kind of film I wish I could make.\"\r\nIn a retrospective review, American film critic Pauline Kael claimed that, when Gregory Peck received the Academy Award for Best Actor:\r\n... there was a fair amount of derision throughout the country: Peck was better than usual, but in that same virtuously dull way. (There was the suspicion that Peck was being rewarded because the Lincolnesque lawyer shot a rabid dog and defended an innocent black man accused of raping a white woman.)\r\nPeck's performance became synonymous with the role and character of Atticus Finch. Producer Alan J. Pakula remembered hearing from Peck when he was first approached with the role: \"He called back immediately. No maybes. I must say the man and the character he played were not unalike\". Peck later said in an interview that he was drawn to the role because the book reminded him of growing up in La Jolla, California. \"Hardly a day passes that I don't think how lucky I was to be cast in that film\", Peck said in a 1997 interview. \"I recently sat at a dinner next to a woman who saw it when she was 14-years-old, and she said it changed her life. I hear things like that all the time\". The 1962 softcover edition of the novel opens:\r\nHarper Lee, in liner notes written for the film's DVD re-release by Universal, wrote:\r\nUpon Peck's death in 2003, Brock Peters, who played Tom Robinson in the film version, quoted Harper Lee at Peck's eulogy, saying, \"Atticus Finch gave him an opportunity to play himself\". Peters concluded his eulogy stating, \"To my friend Gregory Peck, to my friend Atticus Finch, vaya con Dios\". Peters remembered the role of Tom Robinson when he recalled, \"It certainly is one of my proudest achievements in life, one of the happiest participations in film or theater I have experienced\". Peters remained friends not only with Peck but with Mary Badham throughout his life.\r\nPeck himself admitted that many people reminded him of this film more than any other film he had ever done.\r\nAwards and honors\r\nIn 1995, To Kill a Mockingbird was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". It is also Robert Duvall's big-screen debut, as the misunderstood recluse Boo Radley. Duvall was cast on the recommendation of screenwriter Horton Foote, who met him at Neighborhood Playhouse in New York City where Duvall starred in a 1957 production of Foote's play, The Midnight Caller.\r\nIn 2007, Hamilton was honored by the Harlem community for her part in the movie. She was the last surviving African-American adult who had a speaking part in the movie. When told of the award, she said, \"I think it is terrific. I'm very pleased and very surprised\".\r\nThe American Film Institute named Atticus Finch the greatest movie hero of the 20th century. Additionally, the AFI ranked the movie second on their 100 Years... 100 Cheers list, behind It's a Wonderful Life. The film was ranked number 34 on AFI's list of the 100 greatest movies of all time, but moved up to number 25 on the 10th Anniversary list. In June 2008, the AFI revealed its \"Ten top Ten\"—the best ten films in ten \"classic\" American film genres—after polling over 1,500 people from the creative community. To Kill a Mockingbird was acknowledged as the best film in the courtroom drama genre.\r\nAmerican Film Institute lists:\r\nAFI's 100 Years...100 Movies – #34\r\nAFI's 100 Years...100 Heroes & Villains: Atticus Finch – #1 Hero\r\nAtticus Finch – #1 Hero\r\nAFI's 100 Years...100 Movie Quotes: \"Miss Jean Louise, stand up. Your father's passing.\" – Nominated \"You never really understand a person until you consider things from his point of view, until you climb inside of his skin and walk around in it.\" – Nominated\r\n\"Miss Jean Louise, stand up. Your father's passing.\" – Nominated\r\n\"You never really understand a person until you consider things from his point of view, until you climb inside of his skin and walk around in it.\" – Nominated\r\nAFI's 100 Years of Film Scores – #17\r\nAFI's 100 Years...100 Cheers – #2\r\nAFI's 100 Years...100 Movies: 10th Anniversary Edition– #25\r\nAFI's 10 Top 10 – #1 Courtroom Drama\r\nMusic\r\nElmer Bernstein's score for To Kill a Mockingbird is regarded as one of the greatest film scores and has been recorded three times. It was first released in April 1963 on Ava; then Bernstein re-recorded it in the 1970s for his Film Music Collection series; and finally, he recorded the complete score (below) in 1996 with the Royal Scottish National Orchestra for the Varese Sarabande Film Classics series.",
    "html": "<p>To Kill a Mockingbird is a 1962 American legal drama film directed by Robert Mulligan. The screenplay by Horton Foote is based on Harper Lee's 1960 Pulitzer Prize–winning novel of the same name. The film stars Gregory Peck as Atticus Finch and Mary Badham as Scout. It marked the film debut of Robert Duvall, William Windom and Alice Ghostley.</p><p>It gained overwhelmingly positive reception from both the critics and the public; a box-office success, it earned more than six times its budget. The film won three Academy Awards, including Best Actor for Peck, and was nominated for eight, including Best Picture.</p><p>In 1995, the film was selected by the Library of Congress for preservation in the National Film Registry as \"culturally, historically, or aesthetically significant\". In 2003, the American Film Institute named Atticus Finch the greatest movie hero of the 20th century. In 2007, the film ranked twenty-fifth on the AFI's 10th anniversary list of the greatest American movies of all time. In 2020, the British Film Institute included it in their list of the 50 films you should see by the age of 15. The film was restored and released on Blu-ray and DVD in 2012, as part of the 100th anniversary of Universal Pictures.</p><br/><h3>Plot</h3><p>The film is narrated by the adult Jean Louise \"Scout\" Finch. Young Scout and her pre-teen older brother Jem live in the fictional town of Maycomb, Alabama, during the early 1930s. Despite the family's modest means, the children enjoy a happy childhood, cared for by their widowed father, Atticus Finch, and the family's African-American housekeeper, Calpurnia. During the summer, Jem, Scout, and their friend Dill play games and often search for Arthur \"Boo\" Radley, an odd, reclusive neighbor who lives with his brother Nathan. The children have never seen Boo, who rarely leaves the house. On different occasions, Jem has found small objects left inside a tree knothole on the Radley property. These include a broken pocket watch, an old spelling bee medal, a pocket knife, and two carved soap dolls resembling Jem and Scout.</p><p>Atticus, a lawyer, strongly believes all people deserve fair treatment, in turning the other cheek, and in defending what you believe. Many of Atticus' clients are poor farmers who pay for his legal services in trade, often leaving him fresh produce, firewood, and so on. Atticus' work as a lawyer often exposes Scout and Jem to the town's racism, aggravated by poverty. As a result, the children mature more quickly.</p><p>Atticus is appointed to defend Tom Robinson, an African-American accused of raping a Caucasian girl, Mayella Ewell. Atticus accepts the case, heightening tension in the town and causing Jem and Scout to experience schoolyard taunts. One evening before the trial, as Atticus sits in front of the local jail to safeguard Robinson, a lynch mob arrives. Scout, Jem, and Dill unexpectedly interrupt the confrontation. Scout, unaware of the mob's purpose, recognizes Mr. Cunningham and asks him to say hello to his son Walter, her classmate. Cunningham becomes embarrassed, and the mob disperses.</p><p>At the trial, it is alleged that Tom entered the Ewell property at Mayella's request to chop up a chifforobe and that Mayella showed signs of having been beaten around that time. One of Atticus' defensive arguments is that Tom's left arm is disabled due to a farming accident years ago, yet the supposed rapist would have had to mostly assault Mayella with his left hand before raping her. Atticus noted that Mayella's father, Bob Ewell, is left-handed, implying that he beat Mayella because he caught her seducing a young African-American man (Robinson). Atticus also states that Mayella was never examined by a doctor after the supposed rape. Taking the stand, Tom denies he attacked Mayella, but states that she kissed him against his will. He testifies that he had previously assisted Mayella with various chores at her request because he \"felt sorry for her\" – words that incite a swift, negative reaction from the prosecutor, and a gasp from the Caucasian audience.</p><p>In his closing argument, Atticus asks the all-Caucasian male jury to cast aside their prejudices and focus on Tom's obvious innocence. However, Tom is found guilty. As Atticus exits the courtroom, the African-American spectators in the balcony rise to show their respect and appreciation.</p><p>When Atticus arrives home, Sheriff Tate informs him that Tom was killed during his transfer to prison, apparently while attempting to escape. Atticus, accompanied by Jem, goes to the Robinson home to relay news of Tom's death. Bob Ewell appears and spits in Atticus' face.</p><p>Autumn arrives, and Scout and Jem attend an evening school pageant in which Scout portrays a ham. After the pageant, Scout is unable to find her dress and shoes, forcing her to walk home with Jem while wearing the large, hard-shelled costume. While cutting through the woods, Scout and Jem are attacked. Scout's cumbersome costume protects her but restricts her vision. The attacker knocks Jem unconscious, but is himself attacked (and killed) by a second man, unseen by Scout. Scout escapes her costume and sees the second man carrying Jem towards their house. Scout follows them and runs into the arms of a frantic Atticus. Still unconscious, Jem has his broken arm treated by Doc Reynolds.</p><p>Scout tells Sheriff Tate and her father what happened, then notices a strange man behind Jem's bedroom door. Atticus introduces Scout to Arthur Radley, whom she knows as Boo. It was Boo who rescued Jem and Scout, overpowering Bob Ewell and carrying Jem home. The sheriff reports that Ewell, apparently seeking revenge for Atticus humiliating him in court, is dead at the scene of the attack. Atticus mistakenly assumes Jem killed Ewell in self-defense, but Sheriff Tate realizes the truth – Boo killed Ewell defending the children. His official report will state that Ewell died falling on his knife. He refuses to drag the painfully shy, introverted Boo into the spotlight for his heroism, insisting it would be a sin. As Scout escorts Boo home, she draws a startlingly precocious analogy: comparing the unwelcome public attention that would have been heaped on Boo, with the killing of a mockingbird that does nothing but sing.</p><br/><h3>Cast</h3><ul><li>Gregory Peck as Atticus Finch</li><li>Mary Badham as Scout</li><li>Phillip Alford as Jem</li><li>John Megna as Charles Baker \"Dill\" Harris</li><li>Frank Overton as Sheriff Heck Tate</li><li>Rosemary Murphy as Miss Maudie Atkinson</li><li>Ruth White as Mrs. Dubose</li><li>Brock Peters as Tom Robinson</li><li>Estelle Evans as Calpurnia</li><li>Paul Fix as Judge John Taylor</li><li>Collin Wilcox as Mayella Violet Ewell</li><li>James Anderson as Robert E. Lee \"Bob\" Ewell</li><li>Alice Ghostley as Miss Stephanie Crawford</li><li>Robert Duvall as Arthur \"Boo\" Radley</li><li>William Windom as Horace Gilmer, District Attorney</li><li>Crahan Denton as Walter Cunningham</li><li>Richard Hale as Nathan Radley</li></ul><h4>Uncredited roles in order of appearance</h4><ul><li>Kim Stanley as the narrator; the voice of adult Scout—\"Maycomb was a tired old town – even in 1932 when I first knew it – that summer I was six years old.\"</li><li>Paulene Myers as Jessie, Mrs. Dubose's servant, sitting close to her on the Dubose porch.</li><li>Jamie Forster as Mr. Townsend, sitting on a bench, with three men, near the courthouse: \"If you're lookin' for your daddy, he's inside the courthouse.\"</li><li>Steve Condit as Walter Cunningham Jr., Mr. Cunningham's son, at dinner with the Finch family: \"Yes, sir. I don't know when I had roast. We been havin' squirrels and rabbits lately.\"</li><li>David Crawford as David, Tom Robinson's son, sitting on the steps to the Robinsons' shack: \"Good evening.\"</li><li>Kim Hamilton as Helen, Tom Robinson's wife, inside the Robinsons' shack: \"Good evening, Mr. Finch.\"</li><li>Dan White as the mob leader approaching as Atticus Finch sits in front of the jailhouse: \"He in there, Mr. Finch?\"</li><li>Kelly Thordsen as a heavyset member of the mob who grabs and picks up Jem: \"Well, I'll send you home.\"</li><li>William \"Bill\" Walker as Reverend Sykes, at the courthouse for Tom Robinson's trial: \"Miss Jean Louise? Miss Jean Louise, stand up. Your father's passin'.\"</li><li>Charles Fredericks as the court clerk at Tom Robinson's trial: \"Place your hand on the bible, please. Do you solemnly swear to tell the truth...?\"</li><li>Guy Wilkerson as the jury foreman at Tom Robinson's trial: \"We find the defendant guilty as charged.\"</li><li>Jay Sullivan as the court reporter at Tom Robinson's trial: \"Yes.\"</li><li>Jester Hairston as Spence, Tom Robinson's father in front of the Robinsons' shack: \"Hello Mr. Finch. I'm Spence, Tom's father.\"</li><li>Hugh Sanders as Doctor Reynolds, the town physician who examines Jem: \"He's got a bad break, so far as I can tell. Somebody tried to wring his arm off.\"</li></ul><h4>Casting</h4><p>James Stewart declined the role of Atticus Finch, concerned that the story was too controversial. Universal offered the role to Rock Hudson when the project was being first developed but producer Alan J. Pakula wanted a bigger star.</p><br/><h3>Production</h3><p>The producers had wanted to use Harper Lee's hometown of Monroeville, Alabama for the set. Harper Lee used her experiences as a child in Monroeville as the basis for the fictional town of Maycomb, so it seemed that would be the best place. However, the town had changed significantly between the 1920s and the early 1960s, so they made it on the backlot in Hollywood instead.</p><p>The Old Monroe County Courthouse in Monroeville was used as a model for the film set, since they could not use the courthouse due to the poor audio quality in the courthouse. The accuracy of the recreated courthouse in Hollywood led many Alabamians to believe that the film was shot in Monroeville. The Old Courthouse in Monroe County is now a theater for many plays inspired by To Kill a Mockingbird as well as a museum dedicated to multiple authors from Monroeville.</p><br/><h3>Reception</h3><p>The film received widespread critical acclaim. As of January 2023, it maintains a 93% rating on Rotten Tomatoes, based on 67 reviews, with an average rating of 8.9/10. The site's critical consensus states, \"To Kill a Mockingbird is a textbook example of a message movie done right – sober-minded and earnest, but never letting its social conscience get in the way of gripping drama.\" Metacritic, using a weighted average, assigned the film a score of 88 out of 100 based on 16 critics, meaning \"universal acclaim.\" According to Bosley Crowther:</p><blockquote>Horton Foote's script and the direction of Mr. Mulligan may not penetrate that deeply, but they do allow Mr. Peck and little Miss Badham and Master Alford to portray delightful characters. Their charming enactments of a father and his children in that close relationship, which can occur at only one brief period, are worth all the footage of the film. Rosemary Murphy as a neighbor, Brock Peters as the Negro on trial, and Frank Overton as a troubled sheriff are good as locality characters, too. James Anderson and Collin Wilcox as Southern bigots are almost caricatures. But those are minor shortcomings in a rewarding film.</blockquote><p>Roger Ebert of the Chicago Sun-Times criticized the film for focusing less on black people, criticizing the film for having a white savior narrative:</p><blockquote>It expresses the liberal pieties of a more innocent time, the early 1960s, and it goes very easy on the realities of small-town Alabama in the 1930s. One of the most dramatic scenes shows a lynch mob facing Atticus, who is all by himself on the jailhouse steps the night before Tom Robinson's trial. The mob is armed and prepared to break in and hang Robinson, but Scout bursts onto the scene, recognizes a poor farmer who has been befriended by her father, and shames him (and all the other men) into leaving. Her speech is a calculated strategic exercise, masked as the innocent words of a child; one shot of her eyes shows she realizes exactly what she's doing. Could a child turn away a lynch mob at that time, in that place? Isn't it nice to think so.</blockquote><p>Walt Disney requested that the film be privately screened in his house. At the film's conclusion, Disney sadly stated, \"That was one hell of a picture. That's the kind of film I wish I could make.\"</p><p>In a retrospective review, American film critic Pauline Kael claimed that, when Gregory Peck received the Academy Award for Best Actor:</p><blockquote>... there was a fair amount of derision throughout the country: Peck was better than usual, but in that same virtuously dull way. (There was the suspicion that Peck was being rewarded because the Lincolnesque lawyer shot a rabid dog and defended an innocent black man accused of raping a white woman.)</blockquote><p>Peck's performance became synonymous with the role and character of Atticus Finch. Producer Alan J. Pakula remembered hearing from Peck when he was first approached with the role: \"He called back immediately. No maybes. I must say the man and the character he played were not unalike\". Peck later said in an interview that he was drawn to the role because the book reminded him of growing up in La Jolla, California. \"Hardly a day passes that I don't think how lucky I was to be cast in that film\", Peck said in a 1997 interview. \"I recently sat at a dinner next to a woman who saw it when she was 14-years-old, and she said it changed her life. I hear things like that all the time\". The 1962 softcover edition of the novel opens:</p><p>Harper Lee, in liner notes written for the film's DVD re-release by Universal, wrote:</p><p>Upon Peck's death in 2003, Brock Peters, who played Tom Robinson in the film version, quoted Harper Lee at Peck's eulogy, saying, \"Atticus Finch gave him an opportunity to play himself\". Peters concluded his eulogy stating, \"To my friend Gregory Peck, to my friend Atticus Finch, vaya con Dios\". Peters remembered the role of Tom Robinson when he recalled, \"It certainly is one of my proudest achievements in life, one of the happiest participations in film or theater I have experienced\". Peters remained friends not only with Peck but with Mary Badham throughout his life.</p><p>Peck himself admitted that many people reminded him of this film more than any other film he had ever done.</p><br/><h3>Awards and honors</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th></tr><tr><td rowspan=\"8\"><span>Academy Awards</span></td><td><span>Best Picture</span></td><td><span>Alan J. Pakula</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td><span>Robert Mulligan</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor</span></td><td><span>Gregory Peck</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actress</span></td><td><span>Mary Badham</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay – Based on Material from Another Medium</span></td><td><span>Horton Foote</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Art Direction – Black-and-White</span></td><td><span>Alexander Golitzen</span>, <span>Henry Bumstead</span> and <span>Oliver Emert</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Cinematography – Black-and-White</span></td><td><span>Russell Harlan</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Music Score – Substantially Original</span></td><td><span>Elmer Bernstein</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>American Cinema Editors Awards</span></td><td><span>Best Edited Feature Film</span></td><td><span>Aaron Stell</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>British Academy Film Awards</span></td><td colspan=\"2\"><span>Best Film from any Source</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Foreign Actor</span></td><td>Gregory Peck</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Cannes Film Festival</span></td><td><span>Palme d'Or</span></td><td rowspan=\"2\">Robert Mulligan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Gary Cooper Award</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>David di Donatello Awards</span></td><td><span>Best Foreign Actor</span></td><td>Gregory Peck</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td>Robert Mulligan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"5\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Motion Picture – Drama</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor in a Motion Picture – Drama</span></td><td>Gregory Peck</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Best Director – Motion Picture</span></td><td>Robert Mulligan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Score – Motion Picture</span></td><td>Elmer Bernstein</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td colspan=\"2\">Best Film Promoting International Understanding</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>Laurel Awards</span></td><td colspan=\"2\">Top General Entertainment</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Top Male Dramatic Performance</td><td>Gregory Peck</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Top Female Supporting Performance</td><td>Mary Badham</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>National Film Preservation Board</span></td><td colspan=\"2\"><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td></tr><tr><td rowspan=\"2\"><span>New York Film Critics Circle Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay</span></td><td>Horton Foote</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Producers Guild of America Awards</span></td><td>PGA Hall of Fame – Motion Pictures</td><td>Alan J. Pakula</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Best Written American Drama</span></td><td>Horton Foote</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><p>In 1995, To Kill a Mockingbird was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". It is also Robert Duvall's big-screen debut, as the misunderstood recluse Boo Radley. Duvall was cast on the recommendation of screenwriter Horton Foote, who met him at Neighborhood Playhouse in New York City where Duvall starred in a 1957 production of Foote's play, The Midnight Caller.</p><p>In 2007, Hamilton was honored by the Harlem community for her part in the movie. She was the last surviving African-American adult who had a speaking part in the movie. When told of the award, she said, \"I think it is terrific. I'm very pleased and very surprised\".</p><p>The American Film Institute named Atticus Finch the greatest movie hero of the 20th century. Additionally, the AFI ranked the movie second on their 100 Years... 100 Cheers list, behind It's a Wonderful Life. The film was ranked number 34 on AFI's list of the 100 greatest movies of all time, but moved up to number 25 on the 10th Anniversary list. In June 2008, the AFI revealed its \"Ten top Ten\"—the best ten films in ten \"classic\" American film genres—after polling over 1,500 people from the creative community. To Kill a Mockingbird was acknowledged as the best film in the courtroom drama genre.</p><p>American Film Institute lists:</p><ul><li>AFI's 100 Years...100 Movies – #34</li><li>AFI's 100 Years...100 Heroes & Villains: Atticus Finch – #1 Hero</li><li>Atticus Finch – #1 Hero</li><li>AFI's 100 Years...100 Movie Quotes: \"Miss Jean Louise, stand up. Your father's passing.\" – Nominated \"You never really understand a person until you consider things from his point of view, until you climb inside of his skin and walk around in it.\" – Nominated</li><li>\"Miss Jean Louise, stand up. Your father's passing.\" – Nominated</li><li>\"You never really understand a person until you consider things from his point of view, until you climb inside of his skin and walk around in it.\" – Nominated</li><li>AFI's 100 Years of Film Scores – #17</li><li>AFI's 100 Years...100 Cheers – #2</li><li>AFI's 100 Years...100 Movies: 10th Anniversary Edition– #25</li><li>AFI's 10 Top 10 – #1 Courtroom Drama</li></ul><br/><h3>Music</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">To Kill a Mockingbird</th></tr><tr><td colspan=\"2\" class=\"infobox-image\"></td></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\"><span>Elmer Bernstein</span></div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">Early April 1963</td></tr><tr><th scope=\"row\" class=\"infobox-label\">Recorded</th><td class=\"infobox-data plainlist\">August 1–2, 1996, City Halls, <span>Glasgow</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">41</span>:<span class=\"s\">53</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span>Varèse Sarabande</span></td></tr></tbody></table><p>Elmer Bernstein's score for To Kill a Mockingbird is regarded as one of the greatest film scores and has been recorded three times. It was first released in April 1963 on Ava; then Bernstein re-recorded it in the 1970s for his Film Music Collection series; and finally, he recorded the complete score (below) in 1996 with the Royal Scottish National Orchestra for the Varese Sarabande Film Classics series.</p><br/>"
  },
  "errorMessage": ""
}