{
  "imDbId": "tt0120586",
  "title": "American History X",
  "fullTitle": "American History X (1998)",
  "type": "Movie",
  "year": "1998",
  "items": [
    {
      "username": "Boba_Fett1138",
      "userUrl": "https://www.imdb.com/user/ur1416505",
      "reviewLink": "https://www.imdb.com/review/rw1130372",
      "warningSpoilers": false,
      "date": "19 July 2005",
      "rate": "10",
      "helpful": "456 out of 555 found this helpful.",
      "title": "One of the most powerful movies I have ever seen.",
      "content": "I was expecting a kind of a moralistic movie with an overly present, almost preaching like message. The movie however turned out to be extremely powerful mainly due to the professionalism it was made with.The movie its story is told 'beautifuly' in black & white and color. The quite original directing from Tony Kaye gives the movie a nice visual style and certain atmosphere. The story itself isn't that complicated or extremely original on its own and perhaps at most points even predictable but the way the story is told is phenomenal. This is not a movie with an happy ending or a movie that provides a solution to the racial discrimination problems. It shows what is NOT the solution to the problems and that everything that is occurring is like a vicious circle. The movie does not give a hopeful message but instead shows the dangers and pain you're causing to yourself and your close environment when you're thinking as a white supremacist.As an anti Neo-Nazi movie this movie works really powerful. I think that its a really good and important thing that this movie is often shown in classrooms.Edward Norton is truly fantastic in his role. He is very well believable as a Neo-Nazi as well as the reformed person he later turns into in the movie. It's almost like he's playing 2 different characters and he does that so extremely well. Also really good was Edward Furlong who we all long had not seen in a big production. Furlong and Norton are both acting well together in their scene's are highly believable as two brothers.Also surprising good was the musical score by Anne Dudley who had already won an Oscar for \"The Full Monty\", the year before.This was a movie that surprisingly impressed me. As a movie its extremely powerful and important.10/10http://bobafett1138.blogspot.com/"
    },
    {
      "username": "behbehseta",
      "userUrl": "https://www.imdb.com/user/ur102612153",
      "reviewLink": "https://www.imdb.com/review/rw5043820",
      "warningSpoilers": false,
      "date": "6 August 2019",
      "rate": "10",
      "helpful": "241 out of 252 found this helpful.",
      "title": "Edward Norton owned this movie",
      "content": "I give this movie a 10 because1) Edward Norton was the meaning of masterful acting, you could just look at his eyes and understand every little pain he felt and caused. His smile and manner switching before and after was so distinguishing that if you did not speak English you could just follow him.2) cinematography : not only the black and white phase was amazing some other shots was masterful3) the cause , I watched this movie in 2019 and it is as important and as relevant as it was 21 years ago"
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw2545128",
      "warningSpoilers": true,
      "date": "7 January 2012",
      "rate": "9",
      "helpful": "32 out of 36 found this helpful.",
      "title": "\"Has anything you've done made your life better?\"",
      "content": "I've seen a lot of movies and have seen a lot of violence in them - war films, Westerns, horror and even some of those slasher/gore flicks that go so way over the top. For the most part, the violence depicted is far removed from any sense of reality, because after all, it's a movie and the director can be as unrealistic as he wants to get with flying bodies, severed limbs and the like. However the curb stomp by Edward Norton's character on the black hood in the street was probably as visceral an experience that one can get from simply watching the event on screen. I think that comes from internalizing the impact such a trauma can have if it was personally done to you. It's a little hard to put into words, but I hope you can catch my meaning.What I think the film does effectively is show how a hardened racist like Derek Vinyard (Norton) can slowly come to terms with his prejudices when forced to confront them in a restricted environment. Not only is Derek influenced by his co-worker Lamont (Guy Torry) in the laundry, but also the hypocrisy of the segregated racial groups in the prison yard who break those boundaries for self expediency and personal profit. It's also noteworthy to remark on the character of Cameron Alexander (Stacy Keach), who foments racism and violence from a safe distance, never forcing a confrontation for himself, but only through surrogates like Derek and Seth (Ethan Suple).If the film does anything, it should help instruct the viewer to rely on one's own life and experiences to see the humanity and good in all people, regardless of race or ethnic background. I'll never understand why racists and haters focus on what's 'different' about others instead of seeing what makes all people the 'same' - a desire to amount to something, be part of a family and have a sense of belonging to a larger community of mankind."
    },
    {
      "username": "alexkolokotronis",
      "userUrl": "https://www.imdb.com/user/ur16117882",
      "reviewLink": "https://www.imdb.com/review/rw2016374",
      "warningSpoilers": false,
      "date": "1 February 2009",
      "rate": "10",
      "helpful": "156 out of 178 found this helpful.",
      "title": "The Most Dangerous Person To Us Is Ourselves",
      "content": "American History X is a movie of its own. It has a little bit of everything in the way it touches you. This of course making it a very though provoking film. There isn't a genre you can place this film in because it is a not a crime story, action or even a simple drama instead it is a humanistic thriller. What it is about, is the battle over ourselves.Who better than to display these wild but common complexities within people than Edward Norton. The range he shows here is astounding in only his fifth movie. Norton plays Derek Vinyard, a skin head that realizes through cruel yet necessary events in his life that he has gone down the wrong path. When he comes out of jail he attempts to stop his brother played Edward Furlong from going down the same road he had done. Through all his efforts though some things just prove to be inevitable. Avery Brooks also gives a great performance as Derek Vinyard's former teacher and now principal of his former school. His words may not be of the most inspiring but his actions and messages sent across are subtle yet strong and to the point.Norton's performance though wasn't just about range but exploring different dimensions of life. Whether it proved to be psychological, social or even political on a certain level. It is a transforming performance revealing something mind blowing and eye opening. That we, and this includes anyone, can take a devastating turn in life no matter how intelligent we are or thoughtful. That the person that determines the outcome of your life is yourself whether it is good or bad. Norton's realizations aren't through teachings such as the ones that got him in jail but they are through the events in the time he spent in jail. He saw the truth for himself realizing then what is false and what is real.The screenplay written by David McKenna is about as versatile as the performance Norton gives. Not only because of the Derek Vinyard character but because of the characters involved in his life. For example the root of his evil did not come from the murder of his father but rather his father himself. Through just a conversation at breakfast did his negative thoughts get really embedded eventually then leading to them dramatically taking over his mind and way of life. Only when his father got killed did these negative thoughts seem justified. The way this screenplay and direction was able to display this message in just a plethora of other underlying tones was spectacular.What makes this movie great though is that you can truly find yourself in the messages delivered. As much as the main character might not seem relevant or connected to many people it his emotions and functioning of his mind that all of us are able to connect with. Yet what makes a movie great is not simply the message or messages sent across but how powerfully they are delivered. American History X delivers its multiple and intertwining messages about as powerfully as I've seen from a film."
    },
    {
      "username": "seventhsamurai1954",
      "userUrl": "https://www.imdb.com/user/ur4036837",
      "reviewLink": "https://www.imdb.com/review/rw1144427",
      "warningSpoilers": true,
      "date": "7 August 2005",
      "rate": "10",
      "helpful": "143 out of 156 found this helpful.",
      "title": "Changed My Life.",
      "content": "American History X really opened my eyes to the world of racism and how cruel human beings can be sometimes. This story follows a violent extreme skin-head (Norton) that spends three years in jail for killing two black people and how he changed through jail. He then tries to help his younger brother, who idolizes him, not to go down the same path he did. You really can't find a more powerful movie than this. This movie forces you to open your eyes through harsh realism and although some things are disturbing, it makes you take notice. Everything about this movie is so incredible I can't even find words for it. All I can say is that if you have not seen this movie, it really is a must to see because it teaches you something and is really powerful.Norton's best performance and a must for everyone."
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0442604",
      "warningSpoilers": true,
      "date": "27 January 2004",
      "rate": "10",
      "helpful": "85 out of 109 found this helpful.",
      "title": "Why can't we just stop hating each other?",
      "content": "This movie, got to me! I mean got under my skin got to me. It is so effective, the performances were just perfect. We have Edward Norton and Edward Furlong, two fine actors, they play two skin head Nazi racist brothers who are very violent. We start off at a very disturbing scene where we see how Edward Norton's character is put in jail for killing an African American very violently. When he comes back, he has just learned so much that no school, no white man could ever teach him: self respect, respect for others, respect for life, for his family, and knowing that \"We can't live our lives p*ssed off\". He is touched when he learns that his brother's teacher is asking him to write a paper about racism and how it effects today's society called \"American History X\". But when Eddie just gives a wrong look to the black kid in school, some things go terribly wrong.First off, Ed Norton's old \"friends\" turn on him because he wishes not to be part of their very racist gang. Even his own brother who followed his footsteps hates him for turning on the gang. But Ed Norton takes Eddie and tells him his passionate and harrowing experience in prison. Eddie seems to start to see the light, but there is an extremely powerful ending that will make even the toughest guy shed a tear. I highly, very much highly, recommend this movie for everyone. Even for the kids, though you might want to turn them away for a few scenes, but that's how powerful this movie is. Trust me, this movie should not be missed and it sends a message.10/10"
    },
    {
      "username": "Anonymous_Maxine",
      "userUrl": "https://www.imdb.com/user/ur0562732",
      "reviewLink": "https://www.imdb.com/review/rw0442157",
      "warningSpoilers": true,
      "date": "28 August 2000",
      "rate": "10",
      "helpful": "326 out of 446 found this helpful.",
      "title": "Edward Norton delivers a staggering performance as an extremely intelligent white supremacist who realizes the wrongness of his views and must then try to prevent his younger brother form going down the same",
      "content": "American History X is one of the most powerful movies released in years. Not since Schindler's List has the subject of racism been so potently presented. The use of black and white cinematography to portray painful flashbacks is amazing, and the settings, while not necessarily pretty, fit the story flawlessly. Derek Vineyard's (Edward Norton) transition from a white supremacy leader's protege to a gang leader himself to a changed man is shown mainly through a series of flashbacks to the time before he was sent to prison. The character development and story are amazingly well done, and this is largely a factor of the high quality of the acting. Edward Norton especially, but also Edward Furlong, Beverly D'Angelo, and all of the rest of the cast down to Avery Brooks as Bob Sweeney, the African American high school teacher who comes up with the term American History X, and Stacy Keach as the wonderfully hateable Cameron Alexander. Keach, by the way, would have been the perfect choice to play Francis Dolarhyde in Manhunter, the film the precedes The Silence of the Lambs, but oh well. Unfortunately, despite the fact that American History X is one of the best films in years, it is horribly underrated. Much like Norton's last film, Primal Fear, which was also a great movie, this movie did not get nearly the recognition that it deserves."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw2746106",
      "warningSpoilers": true,
      "date": "31 January 2013",
      "rate": "8",
      "helpful": "19 out of 22 found this helpful.",
      "title": "Gutsy and compelling",
      "content": "American History X is a real surprise, a searing look at racism in America today, told from the point of view of members of a skinhead gang. It's a lengthy film that's punctuated with moments of unflinching brutality, and yet it keeps you hooked to the screen throughout. And the reason for that? Edward Norton. Norton burns up the screen in this film; he's even better than he was in FIGHT CLUB, his big break-out picture. He somehow makes his Neo-Nazi character frightening, compelling and sympathetic in equal measure, a fully realised human being rather than a caricature. Furlong isn't bad, and supporting players like Gould and Keach are great, but let's not kid ourselves here. This is Norton's movie, and he owns it.This film works well because it isn't judgemental in the slightest. It presents all the sides of a situation without ever TAKING sides. It refuses to preach to the viewer, too, which is something to be commended. It gradually draws you into the plot, and for once the many and lengthy flashbacks are more interesting than the present-time story; the prison flashbacks are among the most powerful I've seen presented. It's not quite a perfect film - I'm not too sure about that ending, when it comes down to it, it feels forced and disconnected from the rest of the movie - but it's certainly up there with the best that Hollywood had to offer during the 1990s."
    },
    {
      "username": "exa56",
      "userUrl": "https://www.imdb.com/user/ur2124305",
      "reviewLink": "https://www.imdb.com/review/rw1275823",
      "warningSpoilers": false,
      "date": "26 January 2006",
      "rate": "10",
      "helpful": "303 out of 345 found this helpful.",
      "title": "A masterpiece! Truly one of the best film I have ever seen",
      "content": "I have been wanting to see this movie for a long time, since my English teacher mentioned it in our class in grade ten. Gosh I wished I wouldn't have waited all this time to finally watch it, although maybe it's a good thing cause I would have probably been a little bit more traumatized at 14... This movie is exceptional!!! Makes u think, makes you frustrated, makes you wanna scream and even makes you cry! Edward Norton is just phenomenal playing the role of a freak skin head and even more so playing this skin head who finally realizes how stupid he was and tries to protect his younger brother. Edward Furlong also does an amazing job!!! This film is moving in so many ways...I can't even describe how real and heartfelt it felt. I definitely think Edward Norton should have won the Oscar for his performance, cause he was absolutely terrific! I can't get why they didn't gave it to him... This movie will surely stay on my mind for a while now... just thinking that some place in the world things like that still happen...it crushes my heart. This is a wonderful movie that every single person should see at least once in his life... Watch American History X, it totally worth it!"
    },
    {
      "username": "mark.waltz",
      "userUrl": "https://www.imdb.com/user/ur0968789",
      "reviewLink": "https://www.imdb.com/review/rw6528443",
      "warningSpoilers": true,
      "date": "26 January 2021",
      "rate": "10",
      "helpful": "20 out of 25 found this helpful.",
      "title": "I don't feel angry. I just feel disgust.",
      "content": "Is this what has happened to society? I can watch something like this, even being a 20+ year old film, and feel nothing? No fear, no hatred, no sympathy, no caring, just nothing, as if novocaine has been shot into my heart. That's the power of cinema that I don't really want to see but when I do, I am amazed how well done it is. It's not the film I despise. It's that feeling I get of emotions I list above that I just don't feel when I read this in the papers, see on the evening news or on the street, or in this case, see on my TV as a movie.The young Edward Furlong has made a hero (fortunately not a martyr) out of older brother Edward Norton, a skinhead white supremesist who in the opening scene kills two black kids who are attempting to steal his car. It's not the shooting that is shocking. It's the hatred in his eyes as he does it, as if they were his release of anger for the day and he could pump them with lead then go back to bed. After three years in prison, he's on the streets and finds out that Furlong is heading down the same path even though he's not even out of high school, his voice sounding like it's still changing.There's no pointing of finger of right or wrong, of moral judgment from the point of view of the writer as far as I can see. This is what's on the news, documented from what's been on the pages of the L.A. Times for decades. The point of view is that society has become entirely rotten from all sides, that the hatred of all but a certain type of white is acceptable from the point of view of Norton's crowd.Through history teacher Elliot Gould, a conversation erupts with Norton and his family (which includes ailing mother Beverly D'Angelo whom Gould is dating) over the Rodney King trial and riots that shows the differing feelings on the subject, a very intense argument that makes you ask if anything on these issues can ever be resolved. Avery Brooks plays Furlong's principal, a black man unwilling to give up on trying to save Furlong from his fate, and while he attempts to be the voice of reason, is there really any reason left in the world? When Norton rants at Gould in the most anti-Semitic manner, you may feel your gut wrenching up in horror, and it's one of the most depressing moments in screen history.So is \"American History X\" the conversation we're supposed to have? The film is structured in a way where the current situations are filmed in color while the flashbacks are in black and white, and that gives it the feeling of one of Leni Riefenstahl's German pro-Nazi documentaries. It's obvious that sounds like this are meant to be seen when you reach a certain maturity because otherwise, they are often too deeply depressing to watch, and indeed, I can't imagine watching it ever again.But the violence sticks with you, the image of Norton on the street in his boxers with his smug smile being arrested as if he saw himself as a savior of some sort. Once you see this film, even if you never see it again, you'll never forget those images, although as for myself, one viewing was plenty even if I never want to see it again, I have to call it one that I couldn't imagine not seeing. My 10/10 star rating is simply for the way it made me feel, the numbness of the emotions and the way it has made me think about every moment about it afterwards."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3309833",
      "warningSpoilers": false,
      "date": "2 September 2015",
      "rate": "9",
      "helpful": "12 out of 14 found this helpful.",
      "title": "great American cinema",
      "content": "Derek Vinyard (Edward Norton) grew angry after his firefighter father was shot and killed while putting out a fire in a drug den. He becomes a white supremacist under the tutelage of Cameron Alexander (Stacy Keach). Along with girlfriend Stacey (Fairuza Balk) and idiot Seth Ryan (Ethan Suplee), he aims to take back the neighborhood from the minorities. He kills 3 black guys who are breaking into his truck and gets sent to prison for 3 years. His brother Danny (Edward Furlong) idolizes him. However, Derek leaves prison a changed man as he tries to get his family away from his past.This is a shocking revealing portrayal of personal racism. Norton is insanely powerful. Furlong does some solid work as the teen with a chip on his shoulder. This is a movie worthy of recognition."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0442593",
      "warningSpoilers": false,
      "date": "8 November 2003",
      "rate": "",
      "helpful": "38 out of 54 found this helpful.",
      "title": "Not perfect but still very strong",
      "content": "Years have past since Danny saw his neo-nazi brother, kill several black males who were robbing his car. Since he has been in prison, Derek's legacy has grown among the white gangs of the area and Danny has followed in his brother's footsteps. When he writes a racist paper for school, his teacher makes his write a new paper, focusing on recent history  that of his brother and how he influenced him. Meanwhile Derek leaves prison a reformed man with only the desire to repair the damage he once did to his family with his beliefs and his hate.I was looking forward to see this film as I missed it at the cinema and am a firm believer that Edward Norton is one of the most talented actors of his generation and is always worth seeing (even if some of his films have given less than he deserves). It was maybe better that I only saw it recently as I was able to enjoy it without all the hype and fighting over who did what to who, or all the comments from director Kaye as to his opinions of the film. Having seen the pompous fool interviewed several times, I find it quite self assuring that I don't agree with his opinions of it!The plot is a mix of flashback into Derek's hate filled past (told in b&w) and the present (colour) where he is desperate to save his brother and family from suffering anymore from his `sins'. As a basic narrative the film struggles at times to make a solid story and seems to be trying too hard to create confrontations to up the drama within the film. It still works mind you but this is not it's best asset.The main thing the film does well is to be a very true representation of white male disillusionment. The film avoids painting these people as monsters straightaway (although makes no bones that they are confused, misled and wrong). The arguments and discussions they have in the film are not so far from reality that the characters seem fiction  the characters and the film's world seem very real. The film's message that hate is no way to live no matter who it is directed at may be a little simplistic but it is a valid point. One particular weakness which I felt was a little hamfisted was Derek's `road to Damascus' experience in prison  it was OK but was far too easy given the character we had just seen brutally kill several black men.The other main selling point the film has is a performance by Norton that simply ensures he steals nearly every scene he is in. In b&w flashback he is at his best  a larger than life character who is never allowed to just be seen as a thug. Norton acts out the various stages of his life well and makeup ensures that he looks younger when required. In the present he is less dominant but still is very good giving a different performance. Furlong is also very strong, although he only has a few scenes where he is able to be outside of Norton's shadow. Support from Balk, Gould, D'Angelo and Brooks is mixed  Gould's Jewish character is only in the film to allow for one scene to occur, while Brooks' righteous teacher is simply a `morally upright teacher' with no meat on his character.Overall this is a good film, which occasionally struggles when it forces the issue in the `present' scenes. However for the most part it is a powerful film which owes a lot to well captured themes and an excellent performance from Norton."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw4672532",
      "warningSpoilers": false,
      "date": "18 February 2019",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "So Mind Bending",
      "content": "Sometimes it's hard, as a viewer, to even watch something like this. It is inundated with scenes of horror and violence. If one simply passes off the idea of doing a movie about the ugliest side of humanity and then put it in our laps. The performances are outstanding and a moral commitment is made. Some would say to the worst of the worst, there is a glorification of the events through flashback that may be seen as sort of cool. This is a small price for me to pay, but I have to admit, I would not do well with a continuous diet of such darkness."
    },
    {
      "username": "rajatdahiyax",
      "userUrl": "https://www.imdb.com/user/ur28597523",
      "reviewLink": "https://www.imdb.com/review/rw3071506",
      "warningSpoilers": false,
      "date": "19 August 2014",
      "rate": "9",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Norton's astounding performance!!!!!!",
      "content": "American History X is a 1998 American crime drama film directed by Tony Kaye and written by David McKenna. It stars Edward Norton and Edward Furlong, and co-stars Fairuza Balk, Stacy Keach, Elliott Gould, Avery Brooks, Ethan Suplee and Beverly D'Angelo.In a shocking opening scene, teen Danny Vinyard (Edward Furlong) races to tell his older brother, neo-Nazi Derek (Edward Norton), about the young blacks breaking into his car in front of the house, whereupon Derek gets his gun and with no forethought shoots the youths in their tracks. Tried and convicted, Derek is sent away for three years in prison, where he acquires a different outlook as he contrasts white-power prisoners with black Lamont (Guy Torry), his prison laundry co-worker and eventual pal. Meanwhile, Danny, with a shaved head and a rebellious attitude, seems destined to follow in his big brother's footsteps. After Danny writes a favorable review of Hitler's Mein Kampf, black high-school principal Sweeney (Avery Brooks) puts Danny in his private \"American History X\" course and assigns him to do a paper about his older brother, who was a former student of Sweeney's. This serves to introduce flashbacks, with the film backtracking to illustrate Danny's account of Derek's life prior to the night of the shooting. Monochrome sequences of Derek leading a Venice, California gang are inter cut with color footage of the mature Derek ending his past neo-Nazi associations and attempting to detour Danny away from the group led by white supremacist, Cameron (Stacy Keach), who once influenced Derek"
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw1163860",
      "warningSpoilers": false,
      "date": "2 September 2005",
      "rate": "8",
      "helpful": "34 out of 48 found this helpful.",
      "title": "Not a perfect film, but very good - Norton's performance is the highlight",
      "content": "\"American History X\" is a bold and disturbing movie about family, racism and our own self-perceptions. Its main character is Derek (Edward Norton), a neo-Nazi skinhead who is released from jail to find his younger brother (Edward Furlong) descending down the same corrupt path as he once walked.In jail Derek learns a few things about life, and racism, or more appropriately, himself, and after becoming a free man again takes it upon himself to set his brother on the straight and narrow path.\"American History X\" is not a pleasant motion picture. It begins in flashback, as Derek murders two black kids trying to break into his car. His brother, who idolizes Derek and later mimics his lifestyle, witnesses this event. It's a good message about negative influences, along with everything else.Much has been made of the film's controversy and lawsuits. Director Tony Kaye disowned the film after Norton (allegedly) re-edited footage to give himself more screen time. Kaye tried to have his name changed on the film credits, but by this time he had already taken out a complaint in several magazines, which are against the rules of the Director's Guild. He was therefore denied the opportunity to credit the work as \"directed by Humpty Dumpty.\" Then, musical band Anti-Hero complained to New Line Cinema (the film's international distributor) because one of the Nazi characters featured a tattoo of their band. They later wrote a song, called \"NLC,\" bashing the company.Despite the hard-edged controversy it's still a very good film, above all else extremely well-acted and featuring a gripping storyline  even if the direction isn't always up to par.Edward Norton is simply superb in his role, showing extremely raw talent a mere two years after his film debut (in the Richard Gere thriller \"A Primal Fear\"). Norton careens between the role of a raging, vicious supremacist and a kindler, gentler version of the same character; a metamorphosis so convincing it's hard to believe it's just one actor.The rest of the cast is good as well  Furlong gives the best performance of his career and Beverly D'Angelo and Stacy Keach have strong supporting roles. (D'Angelo in particular, who portrays a sleazy alcoholic  a stretch compared to her usual Normal Mom roles in the \"Vacation\" movies.) \"American History X\" isn't exactly rewarding of all the praise it has been lavished since its release (mainly from viewers rather than critics, who were less kind)  it isn't the best movie of its kind or even a flawless one. The black-and-white photography isn't on the same level, visually, as \"Raging Bull\" or \"Schindler's List.\" The preaching is a bit heavy-handed at times.But it still manages to convey an important lesson and boasts great acting complimented by an (overall) impressive, gut-wrenching screenplay. A must-see for all who can stomach its content."
    },
    {
      "username": "Movie_Buff_Brad",
      "userUrl": "https://www.imdb.com/user/ur6898220",
      "reviewLink": "https://www.imdb.com/review/rw1694386",
      "warningSpoilers": false,
      "date": "16 July 2007",
      "rate": "10",
      "helpful": "60 out of 70 found this helpful.",
      "title": "One of the best films about racism",
      "content": "One of the reasons I like the film is that the racism isn't shoved down your throat. It's subtle and believable. There's no characters standing around screaming about \"Those goddamn Mexicans, I don't want THEM changing my locks so THEY can rob the place with their little essays!\", right in front of them. The acting is great all around, and Edward Norton gives one of the best performances of all time. I can't believe he didn't win best actor. While I haven't seen Benji's performance, I doubt he was half as good as Norton. The film is also highly inspirational and moving. How is it that this wasn't even nominated for best picture, while Crash was AND won? Crazy.This should be shown in schools."
    },
    {
      "username": "damianphelps",
      "userUrl": "https://www.imdb.com/user/ur29500838",
      "reviewLink": "https://www.imdb.com/review/rw6052444",
      "warningSpoilers": false,
      "date": "1 September 2020",
      "rate": "8",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Thought provoking",
      "content": "A really great movie that deals with a heavy topic, that is as relevant now as it was back then.Gritty and violent and very very passionate but nothing is done here just to titillate, it provides a truth to the story that would be insincere if it wasn't included.Does get a little bogged down at times and can be perhaps a bit too simplistic when dealing with the healing transformations of the characters. BUT it is a brave and challenging film that also remembers to entertain as well as educate."
    },
    {
      "username": "Lady_Targaryen",
      "userUrl": "https://www.imdb.com/user/ur6643268",
      "reviewLink": "https://www.imdb.com/review/rw1378747",
      "warningSpoilers": true,
      "date": "27 May 2006",
      "rate": "9",
      "helpful": "19 out of 25 found this helpful.",
      "title": "See reality in your eyes when hate makes you blind...",
      "content": "''American History X''is one of the most amazing movies I watched in my life! My dad gave me the tape to watch, and after almost 2 weeks of laziness to watch this movie, I finally watched it 2 times! First, I need to say that both Edwards( Norton and Furlong)are great! Edward Norton specially REALLY looks a skinhead, showing all his anger and awesome body in this movie.I like the end of this movie (who is very sad by the way, since I liked the character Danny very much)showing how hate and violence only makes even more hate and violence, in a effect like a snowball.The other ending that never was filmed, in which Derek shaves his head again in the school bathroom,would not help very much with a good message, but it could have some sense, showing that the prejudice and the racism will continue no matter what we try to solve it. (But it is too pessimistic!)I don't think this movie is racist like many people are saying. It is against racism, since the moral of the story was to show how the prejudice of all races and ethnicities only can make problems and anger for everybody.It's funny to see how many goofs we have in this movie. I didn't pay attention to any of them, since the story itself makes you not bother with errors."
    },
    {
      "username": "lisa-13121",
      "userUrl": "https://www.imdb.com/user/ur81007726",
      "reviewLink": "https://www.imdb.com/review/rw5085907",
      "warningSpoilers": false,
      "date": "28 August 2019",
      "rate": "10",
      "helpful": "29 out of 32 found this helpful.",
      "title": "All Time Favorite",
      "content": "I have LOVED this movie since the day I saw it! I own it & will never sell or give it away! It's topic will ALWAYS be relevant & controversial. I can watch it every few years or so & still love it as much as the first time!"
    },
    {
      "username": "DanielStephens1988",
      "userUrl": "https://www.imdb.com/user/ur66359171",
      "reviewLink": "https://www.imdb.com/review/rw5204753",
      "warningSpoilers": false,
      "date": "22 October 2019",
      "rate": "9",
      "helpful": "38 out of 48 found this helpful.",
      "title": "Beautiful film about how hatred will never resolve the problem",
      "content": "The tragedy of evil is that in trying to stop it, you create it. So if you want to stop doing evil actions, you also have to stop seeing evil because to see evil you must project evil... therefore, you create evil. If you genuinely want to be moral, you got to make a counterintuitive move of giving up all morality. All of your moral rules give them all away. Only then you will truly be moral but if you go around touting your morality, and telling people how moral you are and how immoral they are, that immediately tells that you're not embodying your morality. A genuinely moral person would never do that because true morality is not based on rules, it's not a self-image that you adopt, it's not a list of 10 commandments that you follow. When you think you're so righteous and so moral, you will go and kill people in the name of your morality which is precisely what creates evil."
    },
    {
      "username": "jmchnwth",
      "userUrl": "https://www.imdb.com/user/ur8766380",
      "reviewLink": "https://www.imdb.com/review/rw1258882",
      "warningSpoilers": false,
      "date": "7 January 2006",
      "rate": "10",
      "helpful": "356 out of 384 found this helpful.",
      "title": "This is a fantastic movie....",
      "content": "This is a fantastic movie because no matter what side you're on in life, this movie shows them all, good and bad, right or wrong. I also agree with the point in the movie that proves that people can change for the better and straighten things out in their head to do the right things in life. Yes, things in our world have changed, some for the good, some for the bad, but just because you might not agree with some of it, doesn't mean you can play God and try to make things \"your way\" and this shows exactly what happens when you try. This movie talks about all walks of life and the struggles we all have in what beliefs are right and wrong. Yes this movie is brutal and violent, but also truthful to the past and unfortunately still sometimes the present. This movie is about race, but not only 1 race is singled out and fed to the dogs, they all are. So, go into this movie with an open mind and your mind will come out full."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1292418",
      "warningSpoilers": false,
      "date": "15 February 2006",
      "rate": "9",
      "helpful": "20 out of 30 found this helpful.",
      "title": "exceptionally powerful drama--but not for the kids",
      "content": "I really appreciated how those associated with this excellent film refused to pull any punches in showing the life of a young skin-head so ably portrayed by Edward Norton. Instead of creating a caricature of a racist, all the vile language and violence is shown. This DEFINITELY makes this a movie NOT for KIDS, but for adults it makes a strong impact--like a right cross into the jaw! Now I know some adults will also be completely turned off by this as well, but considering how slimy and awful racism is, how can you talk about it other than by exposing it as it really is?! I applaud the efforts, though I must also admit it can VERY hard to watch--particularly the shooting scene and the intensely graphic language."
    },
    {
      "username": "Ari-21",
      "userUrl": "https://www.imdb.com/user/ur0178848",
      "reviewLink": "https://www.imdb.com/review/rw0442283",
      "warningSpoilers": false,
      "date": "9 December 1998",
      "rate": "10",
      "helpful": "617 out of 918 found this helpful.",
      "title": "This was probably the best movie I've ever seen",
      "content": "I honestly don't think I have ever seen a better movie than American History X in my entire life! I may only be 14, but I have seen a lot of movies. I am an avid fan of them, and this one just takes the cake. Edward Norton is just unbelievable. He is the most talented actor I've ever laid eyes on. His performance in the movie is phenomenal. He delves so deep into his character that he can convince the whole audience easily of his neo-nazi role. The look on his face as he walks back from killing one man in the first seen is purely horrifying. The entire move was dramatic, intriguing, and powerful. It really is moving and emotional as well as scary. It is so true to life, and provides the viewer with such insight into the life and events that create a monster such as Derek Vinyard. It answers many questions I have long awaited an answer to such as what could possibly make someone act as Derek did in this movie, yet left open-ended many others that people such as myself may have. Almost every single scene in the movie was extremely captivating. I can't even go on to say more about the acting, other than if Edward Norton does not win best actor this year, I will go absolutely nuts. It's bad enough he lost it to Cuba Gooding Jr. when he was in Primal Fear, which was yet another incredible performance by him. Edward Furlong, the little kid from T2 is astounding as the confused brother of Derek. I was stunned walking out of the theater after seeing American History X, and I don't think I will ever have the benefit of seeing another movie as good as this one as long as I live. I recommend anyone with a good tolerance for violent and graphic depictions go see this movie. I am bewildered as to why director Tony Kaye would ever want out of this success. If I were to rate this movie, as I often do for others in reviewing them for school, I would give it an A+ with all of my heart."
    },
    {
      "username": "xiaoli7377",
      "userUrl": "https://www.imdb.com/user/ur123364108",
      "reviewLink": "https://www.imdb.com/review/rw8382978",
      "warningSpoilers": false,
      "date": "29 July 2022",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Had It Been Longer",
      "content": "I loved this movie, it's terrific. Edward Norton is great here, all the acting performances are good. A very important social message.I would have given it a 10 if it were longer. I wish there were more scenes of his thought process of leaving the skinhead movement, and more scenes of him bonding with his little brother (Edward Furlong) and slowly getting him to rework his worldview and frame of reference as well. The ending is also a little abrupt.I just wish for more of the film. Nothing wrong with what we got. It's already a phenomenal work of art that I implore every person of every race to watch. Obviously the subject matter is skinheads, but the theme of de-radicalizing your brain is universal and is much needed in today's world."
    },
    {
      "username": "KoRnNut-2",
      "userUrl": "https://www.imdb.com/user/ur0262755",
      "reviewLink": "https://www.imdb.com/review/rw0442396",
      "warningSpoilers": false,
      "date": "1 March 1999",
      "rate": "10",
      "helpful": "384 out of 582 found this helpful.",
      "title": "Best movie of 1998",
      "content": "Powerful portrayal of Neo-Nazi movement in America. Told in series of flashbacks. Flawless acting by Edward Norton. Does its best to make the point that no one is ever right aand no one is ever wrong. I have a friend who was a Nazi and a racist. But upon walking out of the theater after this movie he hung his head in shame. This is why the film industry began."
    }
  ],
  "errorMessage": ""
}