{
  "imDbId": "tt0120586",
  "title": "American History X",
  "fullTitle": "American History X (1998)",
  "type": "Movie",
  "year": "1998",
  "language": "en",
  "titleInLanguage": "American History X",
  "url": "https://en.wikipedia.org/wiki/American_History_X",
  "plotShort": {
    "plainText": "American History X is a 1998 American crime drama film directed by Tony Kaye (in his feature directorial debut) and written by David McKenna. The film stars Edward Norton and Edward Furlong as two brothers from Los Angeles who are involved in the white power skinhead and neo-Nazi movements. The older brother (Norton) serves three years in prison for voluntary manslaughter, is rehabilitated during this time, and then tries to prevent his brother (Furlong) from being indoctrinated further. The supporting cast includes Fairuza Balk, Stacy Keach, Elliott Gould, Avery Brooks, Ethan Suplee and Beverly D'Angelo.\r\nMcKenna wrote the script based on his own childhood and experiences of growing up in San Diego. He sold the script to New Line Cinema, which was impressed by the writing. American History X was Kaye's first directorial role in a feature film. Budgeted at $20 million, filming took place in 1997. Before the film's release, Kaye and the film studio were in disagreements about the final cut of the film. The final version was longer than Kaye intended, which resulted in him publicly disowning the film, thus negatively affecting his directing career.\r\nDistributed by New Line Cinema, the film was released in the United States on October 30, 1998, grossing $23.9 million, against a $20 million budget. American History X was critically praised, with Norton and Furlong's performances and the film's message drawing acclaim. Norton received an Academy Award nomination for Best Actor. The film has also been used for educational purposes in the United States and in other countries. A follow-up, African History Y, with Kaye returning as director and starring Djimon Hounsou, was in active development as of 2020.",
    "html": "<p>American History X is a 1998 American crime drama film directed by Tony Kaye (in his feature directorial debut) and written by David McKenna. The film stars Edward Norton and Edward Furlong as two brothers from Los Angeles who are involved in the white power skinhead and neo-Nazi movements. The older brother (Norton) serves three years in prison for voluntary manslaughter, is rehabilitated during this time, and then tries to prevent his brother (Furlong) from being indoctrinated further. The supporting cast includes Fairuza Balk, Stacy Keach, Elliott Gould, Avery Brooks, Ethan Suplee and Beverly D'Angelo.</p><p>McKenna wrote the script based on his own childhood and experiences of growing up in San Diego. He sold the script to New Line Cinema, which was impressed by the writing. American History X was Kaye's first directorial role in a feature film. Budgeted at $20 million, filming took place in 1997. Before the film's release, Kaye and the film studio were in disagreements about the final cut of the film. The final version was longer than Kaye intended, which resulted in him publicly disowning the film, thus negatively affecting his directing career.</p><p>Distributed by New Line Cinema, the film was released in the United States on October 30, 1998, grossing $23.9 million, against a $20 million budget. American History X was critically praised, with Norton and Furlong's performances and the film's message drawing acclaim. Norton received an Academy Award nomination for Best Actor. The film has also been used for educational purposes in the United States and in other countries. A follow-up, African History Y, with Kaye returning as director and starring Djimon Hounsou, was in active development as of 2020.</p>"
  },
  "plotFull": {
    "plainText": "American History X is a 1998 American crime drama film directed by Tony Kaye (in his feature directorial debut) and written by David McKenna. The film stars Edward Norton and Edward Furlong as two brothers from Los Angeles who are involved in the white power skinhead and neo-Nazi movements. The older brother (Norton) serves three years in prison for voluntary manslaughter, is rehabilitated during this time, and then tries to prevent his brother (Furlong) from being indoctrinated further. The supporting cast includes Fairuza Balk, Stacy Keach, Elliott Gould, Avery Brooks, Ethan Suplee and Beverly D'Angelo.\r\nMcKenna wrote the script based on his own childhood and experiences of growing up in San Diego. He sold the script to New Line Cinema, which was impressed by the writing. American History X was Kaye's first directorial role in a feature film. Budgeted at $20 million, filming took place in 1997. Before the film's release, Kaye and the film studio were in disagreements about the final cut of the film. The final version was longer than Kaye intended, which resulted in him publicly disowning the film, thus negatively affecting his directing career.\r\nDistributed by New Line Cinema, the film was released in the United States on October 30, 1998, grossing $23.9 million, against a $20 million budget. American History X was critically praised, with Norton and Furlong's performances and the film's message drawing acclaim. Norton received an Academy Award nomination for Best Actor. The film has also been used for educational purposes in the United States and in other countries. A follow-up, African History Y, with Kaye returning as director and starring Djimon Hounsou, was in active development as of 2020.\r\nPlot\r\nHigh school student Danny Vinyard antagonizes his Jewish history teacher Murray by choosing to write a civil rights essay on Mein Kampf. African-American principal and outreach worker Dr. Bob Sweeney tells Danny that he will study history through current events or be expelled, calling their class American History X. Danny's first assignment is a paper on his older brother Derek, a past student of Sweeney's and former neo-Nazi leader released from prison that day.\r\nYears earlier, Danny and Derek's father, a firefighter, was shot and killed by a black narcotics dealer while putting out a fire at their home. Immediately after his death, Derek erupts in a racially motivated tirade in a televised interview. High-profile neo-Nazi Cameron Alexander becomes Derek's mentor and they form their own violent white supremacist gang called the Disciples of Christ (D.O.C.) in Venice Beach. A skilled basketball player, Derek is dragged into a game against several Crips, winning control of the local ball courts. Derek organizes an attack on a supermarket employing illegal Mexican immigrants.\r\nDerek's mother Doris invites Murray, her boyfriend, for dinner where an argument about Rodney King and the 1992 Los Angeles riots occurs. Derek assaults his sister Davina and openly berates Murray, and Doris tells Derek to leave home. That night, the same group of Crips that Derek had beaten in the basketball game earlier attempt to steal his truck. When Danny alerts Derek to the crime, Derek shoots two of the men, killing one and wounding the other, before curb stomping the wounded man. He is arrested and sentenced to three years in the California Institution for Men for voluntary manslaughter.\r\nIn prison, Derek joins the Aryan Brotherhood and befriends a black inmate named Lamont. Derek becomes disillusioned by prison gang politics; he believes in the ideology but disapproves of the gang's dealings with non-white gangs and involvement in narcotics dealing, thinking that the members are only using the philosophy of white supremacy out of convenience. He loses his belief further when his friends in the D.O.C. never visit him in prison. He ultimately abandons the Aryan Brotherhood, who beat and rape him in the shower in retaliation. Derek is visited in the hospital wing by Sweeney, with whom he pleads for help to get out of prison. Sweeney rebukes Derek and reveals his own racist past, and warns that Danny has become involved with the D.O.C. to follow in Derek's footsteps. After recovering and leaving the hospital wing, Derek ignores the Aryan Brotherhood while Lamont warns that he may be targeted by African-American gangs now that he is no longer under the Aryan Brotherhood's protection. An attack never comes, and Derek spends the remainder of his sentence alone. When he is released, Derek thanks Lamont, whom he realizes intervened on his behalf.\r\nReturning home, Derek finds Danny emulating him, sporting a D.O.C. tattoo and becoming a skinhead. Derek tries to persuade him to leave the gang, but Danny feels betrayed. Derek's best friend Seth, also a D.O.C. member, frequently disrespects Derek's mother and sister while grooming Danny for the group; Seth and Danny are closely controlled by Cameron. During a party at the D.O.C's compound, Derek confronts Cameron and calls him out for using him only to abandon him for three years; declaring his departure from the group and refusal to allow them to use Danny the same way, he brutally beats Cameron when the man mocks him. Seth and the others, including Derek's ex-girlfriend Stacey, turn against Derek. Seth holds Derek at gunpoint, but Derek easily disarms him and holds everyone at gunpoint before fleeing with his brother.\r\nAfterwards, Derek tells Danny about his experience in prison, which seems to prompt a change in Danny. The pair return home and remove racist posters from their shared bedroom. The next morning, Danny completes his paper, reflecting on his reasons for adopting neo-Nazi values, and their flaws. Derek walks Danny to school, stopping at a diner for breakfast. Sweeney and a police officer inform Derek that Seth and Cameron were attacked the night before and are in an intensive care unit. Derek denies having any knowledge or involvement and reluctantly agrees to inspect the people he denounced. In the boys' bathroom, Danny is killed by a black student that he had confronted the day before. Derek runs to the school and, finding Danny's body, mournfully cradles him while blaming himself for influencing Danny's views and actions. In a voiceover, Danny reads the final lines of his paper for Dr. Sweeney, quoting the final stanza of Abraham Lincoln's first inaugural address.\r\nCast\r\nEdward Norton as Derek Vinyard\r\nEdward Furlong as Danny Vinyard\r\nBeverly D'Angelo as Doris Vinyard\r\nJennifer Lien as Davina Vinyard\r\nEthan Suplee as Seth Ryan\r\nFairuza Balk as Stacey\r\nAvery Brooks as Dr. Bob Sweeney\r\nElliott Gould as Murray\r\nStacy Keach as Cameron Alexander\r\nWilliam Russ as Dennis Vinyard\r\nGuy Torry as Lamont\r\nJoseph Cortese as Rasmussen\r\nAlex Sol as Mitch McCormick\r\nJason Bose Smith as Little Henry\r\nAntonio David Lyons as Lawrence\r\nKeram Malicki-Sánchez as Chris\r\nGiuseppe Andrews as Jason\r\nChristopher Masterson as Daryl Dawson\r\nPaul Le Mat as McMahon\r\nProduction\r\nDevelopment\r\nScreenwriter David McKenna wrote the screenplay for American History X and sold the rights to New Line Cinema when he was 26. The inspiration for the story came from the punk-rock scene of McKenna's childhood, where he often witnessed violent behavior. \"I saw a lot of bigotry growing up, and it made me think about writing something about the world of hate-mongers. The point I tried to make in the script is that a person is not born a racist. It is learned through environment and the people that surround you. The question that intrigued me is: why do people hate and how does one go about changing that? My premise was that hate starts in the family\". In order to make the characters as realistic as possible, McKenna interviewed and observed the behavior of skinheads during the writing process. He said \"I had seen documentaries that just didn't ring true to me, and I wanted to write an accurate portrayal of how good kids from good families can get so terribly lost\".\r\nProducer John Morrissey, who read the script three years prior, was impressed by the script's intense characters and dialogue. Michael De Luca, then-production president of New Line Cinema, said \"I was intrigued by its intensity, conviction and brutal honesty. There was a brilliant character study woven into the screenplay, and I knew we had something special if we did it correctly\". In 1996, the producers first approached Dennis Hopper to direct the film. Hopper turned down the offer and Tony Kaye was then approached to direct. Kaye, who had been De Luca's preferred choice from the beginning, accepted and made his directorial debut in a feature film on American History X. He took the contract to a synagogue, \"I signed it in front of the rabbi. I thought it would make it good\", Kaye said. After the film was released, De Luca stated \"It's everything I had hoped for. The performances are explosive and frightening, and the film dramatically demonstrates both the subtle and overt roots of racism while also showing the possibility for redemption\".\r\nCasting\r\nJoaquin Phoenix was offered the role of Derek Vinyard but he refused the part. After holding casting calls, Kaye was unable to find a suitable actor for the lead role, but casting director Valerie McCaffrey suggested Edward Norton. Kaye initially objected, feeling that Norton lacked the \"weight or presence\", but he eventually conceded. According to executive producer Steve Tisch, Norton's passion for the project was \"contagious\", and he even agreed to a pay cut of more than $500,000 from his usual $1 million fee, to be cast in the lead. McCaffrey also cast Edward Furlong for the role of Danny Vinyard. To prepare for the role, Norton increased his calorie intake and spent hours in the gym to gain 25 pounds (11 kg) of muscle.\r\nFilming\r\nI was attracted to the complexity of the role. This character travels so far within the course of the film. By the end, he's completely humanized and the audience might even be sympathetic, or at least, empathetic towards him. Derek is very much a guy whose anger and rage have superseded his intelligence. They have paralyzed his boundless potential. I liked the transformation that he goes through as his intelligence reasserts itself over his anger.\r\n—Norton on his character\r\nPrincipal photography took place in Los Angeles and Venice Beach, lasting for several months and finishing in May 1997. Kaye served as cinematographer and camera operator, and would often silently walk around the set, scouting for camera angles or visuals. During filming, Kaye established a casual environment for the cast and crew. He welcomed visitors on set, including singer Courtney Love, Norton's girlfriend at the time, and British historian John Richardson. Kaye would arrive for work in a Lincoln Town Car with a chauffeur, and a license plate that read \"JEWISH\". He carried four cell phones and a fax machine, and during the Passover holidays, Kaye had boxes of matzo delivered to the set. He also discovered at the time a newsletter published by a British political group, the National Front, which said he was a prominent Jew who supposedly controlled Britain's media.\r\nBoth Furlong and Ethan Suplee found taking on their roles with hateful views to be uncomfortable. Furlong said \"It's pretty intense, having to say this incredibly hateful stuff\". The actors had \"white power\" tattoos painted on their arms, which Suplee forgot to remove one day after filming, and was confronted by a man in a convenience store. Norton recalls \"Doing that film created the strangest distortion of perception on me ... the degree to which that film and the magic of camera and art and black and white photography ... made a lot of people think that I was a larger and tougher person than I am\". The flashback scenes were edited to be in black-and-white, whereas the present-day scenes were edited to be in color.\r\nMusic\r\nKaye hired British composer Anne Dudley to score the film, and wanted the music to be \"big and elegiac\". She employed a full orchestra and a boys' choir, and decided against using hip-hop sounds. She said, \"The neo-Nazi faction is personified in the music by a boys choir – what could be a more Aryan sound? ... A calming string orchestra instead provides a much more expressive and timeless palette\".\r\nRelease\r\nKaye's original cut of the finished film had a run time of 95 minutes, which was delivered on time and within budget. Although it generated a positive response from test screenings, New Line Cinema insisted on further edits to the film. Kaye was mortified, saying \"I'm fully aware that I'm a first-time director, but I need the same autonomy and respect that Stanley Kubrick gets\". Soon afterwards, Norton was involved with editing alongside Kaye, which was a difficult experience for the pair. At one point, Kaye punched a wall which resulted in stitches to his hand.\r\nIn June 1998, the film studio test-screened a second cut of the film which included changes made by Norton. The studio tried to persuade Kaye to release Norton's cut, but he objected. Although the differences between the two cuts are disputed, Kaye objected to an additional 18 minutes of footage, and they disagreed with the length of certain scenes such as a family argument, Norton's anti-immigration speech, and a flashback where Norton's father is criticizing a teacher. Subsequently, the studio compromised and gave Kaye an extra eight weeks to edit and submit a new cut of the film.\r\nDuring this period, Kaye took a number of combative actions, spending $100,000 on advertisements in the Hollywood press and condemning the behavior of Norton and the studio. American History X was due to premiere at the 1998 Toronto International Film Festival, however, Kaye demanded that organizer Piers Handling withdraw the film. On July 28, 1998, after the eight week deadline, Kaye had nothing new to show and the studio announced that it would release Norton's cut. Kaye attempted to remove his name from the film credits, applying for various pseudonyms, including \"Humpty Dumpty\", a request that the Directors Guild of America (DGA) refused. Kaye subsequently filed a $200 million lawsuit against DGA and New Line Cinema, although the case was dismissed in 2000. Kaye disowned the film, describing the released version, which was 24 minutes longer than his own cut, as a \"total abuse of creativity\" and \"crammed with shots of everyone crying in each other's arms\". Kaye's behavior caused Hollywood to view him as unemployable, and he did not watch the film until June 2007. He later admitted that \"My ego got in the way. That was entirely my fault. Whenever I can, I take the opportunity to apologize\". He also did not direct another film until 2006's Lake of Fire.\r\nHome media\r\nThe film was released by New Line Home Video on DVD on April 6, 1999, and on VHS on August 24 of the same year. The film was later released on Blu-ray on April 7, 2009, including seven minutes of deleted scenes and a theatrical trailer.\r\nReception\r\nBox office\r\nAmerican History X premiered in Los Angeles on October 28, 1998, and on the same week in New York. It received a wider release in the United States on October 30. The film grossed $156,076 in 17 theaters during its opening weekend. The film went on to gross $6,719,864 from 513 theaters in the United States, for a worldwide total of $23,875,127.\r\nCritical response\r\nOn Rotten Tomatoes, American History X has an approval rating of 83% based on 87 reviews, with an average rating of 7.30/10. The website's critical consensus reads, \"American History X doesn't contend with its subject matter as fully as it could, but Edward Norton's performance gives this hard-hitting drama crucial weight.\" On Metacritic, the film has a weighted score of 62 out of 100 based on 32 critic reviews, indicating \"generally favorable reviews\". Audiences surveyed by CinemaScore gave the film a grade \"A\" on scale of A to F.\r\nGene Siskel of the Chicago Tribune, gave American History X four out of four stars, describing it as \"a shockingly powerful screed against racism that also manages to be so well performed and directed that it is entertaining as well\", adding it was \"also effective at demonstrating how hate is taught from one generation to another\". He said Norton was an \"immediate front-runner\" for an Academy Award. Todd McCarthy, writing for Variety, gave the film a positive review stating \"This jolting, superbly acted film will draw serious-minded upscale viewers interested in cutting-edge fare\". He particularly praised Norton's performance, saying \"His Derek mesmerizes even as he repels, and the actor fully exposes the human being behind the tough poses and attitudinizing\". Janet Maslin of The New York Times wrote \"Though its story elements are all too easily reduced to a simple outline, American History X has enough fiery acting and provocative bombast to make its impact felt. For one thing, its willingness to take on ugly political realities gives it a substantial raison d'être. For another, it has been directed with a mixture of handsome photo-realism and visceral punch\".\r\nFilm critic Roger Ebert gave the film three out of four stars, but was critical of the underdeveloped areas, stating \"the movie never convincingly charts Derek's path to race hatred\". Ebert concluded \"This is a good and powerful film. If I am dissatisfied, it is because it contains the promise of being more than it is\". Owen Gleiberman of Entertainment Weekly called the film \"riveting\", and praised the narrative structure despite \"thinness of the script\".\r\nMick LaSalle of the San Francisco Chronicle expressed disappointment with the picture. LaSalle felt that while it succeeded in portraying Derek's descent into neo-Nazism, it failed to portray his renouncement of his past beliefs, \"We had to watch him think his way in. We should see him think his way out\". LaSalle also noted that \"In some places the dialogue is surprisingly stilted. Far worse, the ending is a misfire\". However, he complimented Norton's performance. Stephen Hunter, writing for The Washington Post, was highly critical of the film and gave it a negative review, calling it \"an old melodramatic formula hidden under pretentious TV-commercial-slick photography\". Michael O'Sullivan wrote \"There are moments when Anne Dudley's string-laden score overpowers the stark simplicity of the film's message and other times when the moral of brotherly love is hammered a bit heavily\", but conceded \"the blunt and brutal American History X is ultimately only as imperfect as we ourselves are\".\r\nAccolades\r\nEdward Norton was nominated for an Academy Award for Best Actor for his role as Derek Vinyard, but lost to Roberto Benigni for Life Is Beautiful. Norton's loss was included on Empire's list of \"22 Incredibly Shocking Oscars Injustices\".\r\nLegacy\r\nIn 1999, Amnesty International USA used American History X for an educational campaign, screening the film in colleges and in nationwide events for raising awareness on human rights. Zara Toussaint, of Amnesty International in France, organized screenings in her country followed by debates. \"The reactions were varied. Some people thought that this was only an extreme case, that this kind of group was very marginal and that there could be no equivalent in France\", she said. In response to the French screening, Sébastien Homer of L'Humanité wrote, \"Police violence, the Rodney King affair, unsanitary prisons, ill-treatment, rejection of asylum seekers, the United States has still not assimilated what human rights, freedom, equality meant\". In September 1999, Empire magazine ranked the film 311th in a list of the 500 greatest movies of all time. In 2008, Norton's performance was ranked by Total Film as the 72nd greatest film performance of all time. Although director Kaye did not watch the film until 2007, he has acknowledged that it has become \"quite a little classic in its own befuddled way\". In 2012, he said that he was \"very proud of what we all achieved\".\r\nFor its 20th anniversary, Christopher Hooton writing for The Independent opined that the film \"feels more essential now that it ever has\". Clayton Schuster of Vice drew comparisons between the film and both the racial rhetoric of Donald Trump and real life atrocities; the murders of nine African-Americans in a Charleston church in 2015, a far-right march in Charlottesville, Virginia in 2017, and a year later, a mass shooting in a Pittsburgh synagogue. He argues that these violent acts are no different to the hate represented in the movie, adding, \"White supremacy has existed for centuries. It's lurked on the fringes of American power since the birth of this nation\". He added \"there is at least one notable difference ... The movie portrays skinheads as visually different ... They're suited up in boots with red laces, heads gleaming from a fresh shave, and tatted with Nazi insignia and racist slogans. White supremacists today have largely adopted a policy of fitting into society rather than standing out\". Writing for Esquire magazine in 2018, Justin Kirkland stated that he believed that \"Perhaps the reason that American History X still feels so relevant two decades after its release is because we haven't done enough for it not to be ... I'm afraid we're going to be writing about American History X forever. I'm afraid of what will happen if we don't\".",
    "html": "<p>American History X is a 1998 American crime drama film directed by Tony Kaye (in his feature directorial debut) and written by David McKenna. The film stars Edward Norton and Edward Furlong as two brothers from Los Angeles who are involved in the white power skinhead and neo-Nazi movements. The older brother (Norton) serves three years in prison for voluntary manslaughter, is rehabilitated during this time, and then tries to prevent his brother (Furlong) from being indoctrinated further. The supporting cast includes Fairuza Balk, Stacy Keach, Elliott Gould, Avery Brooks, Ethan Suplee and Beverly D'Angelo.</p><p>McKenna wrote the script based on his own childhood and experiences of growing up in San Diego. He sold the script to New Line Cinema, which was impressed by the writing. American History X was Kaye's first directorial role in a feature film. Budgeted at $20 million, filming took place in 1997. Before the film's release, Kaye and the film studio were in disagreements about the final cut of the film. The final version was longer than Kaye intended, which resulted in him publicly disowning the film, thus negatively affecting his directing career.</p><p>Distributed by New Line Cinema, the film was released in the United States on October 30, 1998, grossing $23.9 million, against a $20 million budget. American History X was critically praised, with Norton and Furlong's performances and the film's message drawing acclaim. Norton received an Academy Award nomination for Best Actor. The film has also been used for educational purposes in the United States and in other countries. A follow-up, African History Y, with Kaye returning as director and starring Djimon Hounsou, was in active development as of 2020.</p><br/><h3>Plot</h3><p>High school student Danny Vinyard antagonizes his Jewish history teacher Murray by choosing to write a civil rights essay on Mein Kampf. African-American principal and outreach worker Dr. Bob Sweeney tells Danny that he will study history through current events or be expelled, calling their class American History X. Danny's first assignment is a paper on his older brother Derek, a past student of Sweeney's and former neo-Nazi leader released from prison that day.</p><p>Years earlier, Danny and Derek's father, a firefighter, was shot and killed by a black narcotics dealer while putting out a fire at their home. Immediately after his death, Derek erupts in a racially motivated tirade in a televised interview. High-profile neo-Nazi Cameron Alexander becomes Derek's mentor and they form their own violent white supremacist gang called the Disciples of Christ (D.O.C.) in Venice Beach. A skilled basketball player, Derek is dragged into a game against several Crips, winning control of the local ball courts. Derek organizes an attack on a supermarket employing illegal Mexican immigrants.</p><p>Derek's mother Doris invites Murray, her boyfriend, for dinner where an argument about Rodney King and the 1992 Los Angeles riots occurs. Derek assaults his sister Davina and openly berates Murray, and Doris tells Derek to leave home. That night, the same group of Crips that Derek had beaten in the basketball game earlier attempt to steal his truck. When Danny alerts Derek to the crime, Derek shoots two of the men, killing one and wounding the other, before curb stomping the wounded man. He is arrested and sentenced to three years in the California Institution for Men for voluntary manslaughter.</p><p>In prison, Derek joins the Aryan Brotherhood and befriends a black inmate named Lamont. Derek becomes disillusioned by prison gang politics; he believes in the ideology but disapproves of the gang's dealings with non-white gangs and involvement in narcotics dealing, thinking that the members are only using the philosophy of white supremacy out of convenience. He loses his belief further when his friends in the D.O.C. never visit him in prison. He ultimately abandons the Aryan Brotherhood, who beat and rape him in the shower in retaliation. Derek is visited in the hospital wing by Sweeney, with whom he pleads for help to get out of prison. Sweeney rebukes Derek and reveals his own racist past, and warns that Danny has become involved with the D.O.C. to follow in Derek's footsteps. After recovering and leaving the hospital wing, Derek ignores the Aryan Brotherhood while Lamont warns that he may be targeted by African-American gangs now that he is no longer under the Aryan Brotherhood's protection. An attack never comes, and Derek spends the remainder of his sentence alone. When he is released, Derek thanks Lamont, whom he realizes intervened on his behalf.</p><p>Returning home, Derek finds Danny emulating him, sporting a D.O.C. tattoo and becoming a skinhead. Derek tries to persuade him to leave the gang, but Danny feels betrayed. Derek's best friend Seth, also a D.O.C. member, frequently disrespects Derek's mother and sister while grooming Danny for the group; Seth and Danny are closely controlled by Cameron. During a party at the D.O.C's compound, Derek confronts Cameron and calls him out for using him only to abandon him for three years; declaring his departure from the group and refusal to allow them to use Danny the same way, he brutally beats Cameron when the man mocks him. Seth and the others, including Derek's ex-girlfriend Stacey, turn against Derek. Seth holds Derek at gunpoint, but Derek easily disarms him and holds everyone at gunpoint before fleeing with his brother.</p><p>Afterwards, Derek tells Danny about his experience in prison, which seems to prompt a change in Danny. The pair return home and remove racist posters from their shared bedroom. The next morning, Danny completes his paper, reflecting on his reasons for adopting neo-Nazi values, and their flaws. Derek walks Danny to school, stopping at a diner for breakfast. Sweeney and a police officer inform Derek that Seth and Cameron were attacked the night before and are in an intensive care unit. Derek denies having any knowledge or involvement and reluctantly agrees to inspect the people he denounced. In the boys' bathroom, Danny is killed by a black student that he had confronted the day before. Derek runs to the school and, finding Danny's body, mournfully cradles him while blaming himself for influencing Danny's views and actions. In a voiceover, Danny reads the final lines of his paper for Dr. Sweeney, quoting the final stanza of Abraham Lincoln's first inaugural address.</p><br/><h3>Cast</h3><ul><li>Edward Norton as Derek Vinyard</li><li>Edward Furlong as Danny Vinyard</li><li>Beverly D'Angelo as Doris Vinyard</li><li>Jennifer Lien as Davina Vinyard</li><li>Ethan Suplee as Seth Ryan</li><li>Fairuza Balk as Stacey</li><li>Avery Brooks as Dr. Bob Sweeney</li><li>Elliott Gould as Murray</li><li>Stacy Keach as Cameron Alexander</li><li>William Russ as Dennis Vinyard</li><li>Guy Torry as Lamont</li><li>Joseph Cortese as Rasmussen</li><li>Alex Sol as Mitch McCormick</li><li>Jason Bose Smith as Little Henry</li><li>Antonio David Lyons as Lawrence</li><li>Keram Malicki-Sánchez as Chris</li><li>Giuseppe Andrews as Jason</li><li>Christopher Masterson as Daryl Dawson</li><li>Paul Le Mat as McMahon</li></ul><br/><h3>Production</h3><h4>Development</h4><p>Screenwriter David McKenna wrote the screenplay for American History X and sold the rights to New Line Cinema when he was 26. The inspiration for the story came from the punk-rock scene of McKenna's childhood, where he often witnessed violent behavior. \"I saw a lot of bigotry growing up, and it made me think about writing something about the world of hate-mongers. The point I tried to make in the script is that a person is not born a racist. It is learned through environment and the people that surround you. The question that intrigued me is: why do people hate and how does one go about changing that? My premise was that hate starts in the family\". In order to make the characters as realistic as possible, McKenna interviewed and observed the behavior of skinheads during the writing process. He said \"I had seen documentaries that just didn't ring true to me, and I wanted to write an accurate portrayal of how good kids from good families can get so terribly lost\".</p><p>Producer John Morrissey, who read the script three years prior, was impressed by the script's intense characters and dialogue. Michael De Luca, then-production president of New Line Cinema, said \"I was intrigued by its intensity, conviction and brutal honesty. There was a brilliant character study woven into the screenplay, and I knew we had something special if we did it correctly\". In 1996, the producers first approached Dennis Hopper to direct the film. Hopper turned down the offer and Tony Kaye was then approached to direct. Kaye, who had been De Luca's preferred choice from the beginning, accepted and made his directorial debut in a feature film on American History X. He took the contract to a synagogue, \"I signed it in front of the rabbi. I thought it would make it good\", Kaye said. After the film was released, De Luca stated \"It's everything I had hoped for. The performances are explosive and frightening, and the film dramatically demonstrates both the subtle and overt roots of racism while also showing the possibility for redemption\".</p><h4>Casting</h4><p>Joaquin Phoenix was offered the role of Derek Vinyard but he refused the part. After holding casting calls, Kaye was unable to find a suitable actor for the lead role, but casting director Valerie McCaffrey suggested Edward Norton. Kaye initially objected, feeling that Norton lacked the \"weight or presence\", but he eventually conceded. According to executive producer Steve Tisch, Norton's passion for the project was \"contagious\", and he even agreed to a pay cut of more than $500,000 from his usual $1 million fee, to be cast in the lead. McCaffrey also cast Edward Furlong for the role of Danny Vinyard. To prepare for the role, Norton increased his calorie intake and spent hours in the gym to gain 25 pounds (11 kg) of muscle.</p><h4>Filming</h4><blockquote>I was attracted to the complexity of the role. This character travels so far within the course of the film. By the end, he's completely humanized and the audience might even be sympathetic, or at least, empathetic towards him. Derek is very much a guy whose anger and rage have superseded his intelligence. They have paralyzed his boundless potential. I liked the transformation that he goes through as his intelligence reasserts itself over his anger.</blockquote><p>—Norton on his character</p><p>Principal photography took place in Los Angeles and Venice Beach, lasting for several months and finishing in May 1997. Kaye served as cinematographer and camera operator, and would often silently walk around the set, scouting for camera angles or visuals. During filming, Kaye established a casual environment for the cast and crew. He welcomed visitors on set, including singer Courtney Love, Norton's girlfriend at the time, and British historian John Richardson. Kaye would arrive for work in a Lincoln Town Car with a chauffeur, and a license plate that read \"JEWISH\". He carried four cell phones and a fax machine, and during the Passover holidays, Kaye had boxes of matzo delivered to the set. He also discovered at the time a newsletter published by a British political group, the National Front, which said he was a prominent Jew who supposedly controlled Britain's media.</p><p>Both Furlong and Ethan Suplee found taking on their roles with hateful views to be uncomfortable. Furlong said \"It's pretty intense, having to say this incredibly hateful stuff\". The actors had \"white power\" tattoos painted on their arms, which Suplee forgot to remove one day after filming, and was confronted by a man in a convenience store. Norton recalls \"Doing that film created the strangest distortion of perception on me ... the degree to which that film and the magic of camera and art and black and white photography ... made a lot of people think that I was a larger and tougher person than I am\". The flashback scenes were edited to be in black-and-white, whereas the present-day scenes were edited to be in color.</p><h4>Music</h4><p>Kaye hired British composer Anne Dudley to score the film, and wanted the music to be \"big and elegiac\". She employed a full orchestra and a boys' choir, and decided against using hip-hop sounds. She said, \"The neo-Nazi faction is personified in the music by a boys choir – what could be a more Aryan sound? ... A calming string orchestra instead provides a much more expressive and timeless palette\".</p><br/><h3>Release</h3><p>Kaye's original cut of the finished film had a run time of 95 minutes, which was delivered on time and within budget. Although it generated a positive response from test screenings, New Line Cinema insisted on further edits to the film. Kaye was mortified, saying \"I'm fully aware that I'm a first-time director, but I need the same autonomy and respect that Stanley Kubrick gets\". Soon afterwards, Norton was involved with editing alongside Kaye, which was a difficult experience for the pair. At one point, Kaye punched a wall which resulted in stitches to his hand.</p><p>In June 1998, the film studio test-screened a second cut of the film which included changes made by Norton. The studio tried to persuade Kaye to release Norton's cut, but he objected. Although the differences between the two cuts are disputed, Kaye objected to an additional 18 minutes of footage, and they disagreed with the length of certain scenes such as a family argument, Norton's anti-immigration speech, and a flashback where Norton's father is criticizing a teacher. Subsequently, the studio compromised and gave Kaye an extra eight weeks to edit and submit a new cut of the film.</p><p>During this period, Kaye took a number of combative actions, spending $100,000 on advertisements in the Hollywood press and condemning the behavior of Norton and the studio. American History X was due to premiere at the 1998 Toronto International Film Festival, however, Kaye demanded that organizer Piers Handling withdraw the film. On July 28, 1998, after the eight week deadline, Kaye had nothing new to show and the studio announced that it would release Norton's cut. Kaye attempted to remove his name from the film credits, applying for various pseudonyms, including \"Humpty Dumpty\", a request that the Directors Guild of America (DGA) refused. Kaye subsequently filed a $200 million lawsuit against DGA and New Line Cinema, although the case was dismissed in 2000. Kaye disowned the film, describing the released version, which was 24 minutes longer than his own cut, as a \"total abuse of creativity\" and \"crammed with shots of everyone crying in each other's arms\". Kaye's behavior caused Hollywood to view him as unemployable, and he did not watch the film until June 2007. He later admitted that \"My ego got in the way. That was entirely my fault. Whenever I can, I take the opportunity to apologize\". He also did not direct another film until 2006's Lake of Fire.</p><h4>Home media</h4><p>The film was released by New Line Home Video on DVD on April 6, 1999, and on VHS on August 24 of the same year. The film was later released on Blu-ray on April 7, 2009, including seven minutes of deleted scenes and a theatrical trailer.</p><br/><h3>Reception</h3><h4>Box office</h4><p>American History X premiered in Los Angeles on October 28, 1998, and on the same week in New York. It received a wider release in the United States on October 30. The film grossed $156,076 in 17 theaters during its opening weekend. The film went on to gross $6,719,864 from 513 theaters in the United States, for a worldwide total of $23,875,127.</p><h4>Critical response</h4><p>On Rotten Tomatoes, American History X has an approval rating of 83% based on 87 reviews, with an average rating of 7.30/10. The website's critical consensus reads, \"American History X doesn't contend with its subject matter as fully as it could, but Edward Norton's performance gives this hard-hitting drama crucial weight.\" On Metacritic, the film has a weighted score of 62 out of 100 based on 32 critic reviews, indicating \"generally favorable reviews\". Audiences surveyed by CinemaScore gave the film a grade \"A\" on scale of A to F.</p><p>Gene Siskel of the Chicago Tribune, gave American History X four out of four stars, describing it as \"a shockingly powerful screed against racism that also manages to be so well performed and directed that it is entertaining as well\", adding it was \"also effective at demonstrating how hate is taught from one generation to another\". He said Norton was an \"immediate front-runner\" for an Academy Award. Todd McCarthy, writing for Variety, gave the film a positive review stating \"This jolting, superbly acted film will draw serious-minded upscale viewers interested in cutting-edge fare\". He particularly praised Norton's performance, saying \"His Derek mesmerizes even as he repels, and the actor fully exposes the human being behind the tough poses and attitudinizing\". Janet Maslin of The New York Times wrote \"Though its story elements are all too easily reduced to a simple outline, American History X has enough fiery acting and provocative bombast to make its impact felt. For one thing, its willingness to take on ugly political realities gives it a substantial raison d'être. For another, it has been directed with a mixture of handsome photo-realism and visceral punch\".</p><p>Film critic Roger Ebert gave the film three out of four stars, but was critical of the underdeveloped areas, stating \"the movie never convincingly charts Derek's path to race hatred\". Ebert concluded \"This is a good and powerful film. If I am dissatisfied, it is because it contains the promise of being more than it is\". Owen Gleiberman of Entertainment Weekly called the film \"riveting\", and praised the narrative structure despite \"thinness of the script\".</p><p>Mick LaSalle of the San Francisco Chronicle expressed disappointment with the picture. LaSalle felt that while it succeeded in portraying Derek's descent into neo-Nazism, it failed to portray his renouncement of his past beliefs, \"We had to watch him think his way in. We should see him think his way out\". LaSalle also noted that \"In some places the dialogue is surprisingly stilted. Far worse, the ending is a misfire\". However, he complimented Norton's performance. Stephen Hunter, writing for The Washington Post, was highly critical of the film and gave it a negative review, calling it \"an old melodramatic formula hidden under pretentious TV-commercial-slick photography\". Michael O'Sullivan wrote \"There are moments when Anne Dudley's string-laden score overpowers the stark simplicity of the film's message and other times when the moral of brotherly love is hammered a bit heavily\", but conceded \"the blunt and brutal American History X is ultimately only as imperfect as we ourselves are\".</p><h4>Accolades</h4><p>Edward Norton was nominated for an Academy Award for Best Actor for his role as Derek Vinyard, but lost to Roberto Benigni for Life Is Beautiful. Norton's loss was included on Empire's list of \"22 Incredibly Shocking Oscars Injustices\".</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Recipient(s)</th><th>Result</th></tr><tr><td><span>Academy Awards</span></td><td><span>Best Actor</span></td><td><span>Edward Norton</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"5\">Awards Circuit Community Awards</td><td>Best Motion Picture</td><td>John Morrissey</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Actor in a Leading Role</td><td>Edward Norton</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Actor in a Supporting Role</td><td><span>Edward Furlong</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Original Screenplay</td><td><span>David McKenna</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Film Editing</td><td><span>Gerald B. Greenberg</span> and <span>Alan Heim</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Chicago Film Critics Association Awards</span></td><td><span>Best Actor</span></td><td rowspan=\"2\">Edward Norton</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Chlotrudis Awards</span></td><td>Best Actor</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Golden Reel Awards</span></td><td><span>Best Sound Editing – Music (Foreign &amp; Domestic)</span></td><td><span>Richard Ford</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Online Film Critics Society Awards</span></td><td><span>Best Actor</span></td><td>Edward Norton</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Political Film Society Awards</td><td colspan=\"2\"><span>Peace</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>Satellite Awards</span></td><td><span>Best Actor in a Motion Picture – Drama</span></td><td>Edward Norton</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actress in a Supporting Role in a Motion Picture – Drama</span></td><td><span>Beverly D'Angelo</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Screenplay</span></td><td>David McKenna</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Saturn Awards</span></td><td><span>Best Actor</span></td><td rowspan=\"3\">Edward Norton</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Southeastern Film Critics Association Awards</td><td>Best Actor</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Taormina International Film Festival</span></td><td>Best Actor</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Turkish Film Critics Association Awards</span></td><td colspan=\"2\">Best Foreign Film</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">14th Place</td></tr><tr><td><span>Young Artist Awards</span></td><td>Best Performance in a Feature Film: Supporting Young Actor</td><td>Edward Furlong</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><h4>Legacy</h4><p>In 1999, Amnesty International USA used American History X for an educational campaign, screening the film in colleges and in nationwide events for raising awareness on human rights. Zara Toussaint, of Amnesty International in France, organized screenings in her country followed by debates. \"The reactions were varied. Some people thought that this was only an extreme case, that this kind of group was very marginal and that there could be no equivalent in France\", she said. In response to the French screening, Sébastien Homer of L'Humanité wrote, \"Police violence, the Rodney King affair, unsanitary prisons, ill-treatment, rejection of asylum seekers, the United States has still not assimilated what human rights, freedom, equality meant\". In September 1999, Empire magazine ranked the film 311th in a list of the 500 greatest movies of all time. In 2008, Norton's performance was ranked by Total Film as the 72nd greatest film performance of all time. Although director Kaye did not watch the film until 2007, he has acknowledged that it has become \"quite a little classic in its own befuddled way\". In 2012, he said that he was \"very proud of what we all achieved\".</p><p>For its 20th anniversary, Christopher Hooton writing for The Independent opined that the film \"feels more essential now that it ever has\". Clayton Schuster of Vice drew comparisons between the film and both the racial rhetoric of Donald Trump and real life atrocities; the murders of nine African-Americans in a Charleston church in 2015, a far-right march in Charlottesville, Virginia in 2017, and a year later, a mass shooting in a Pittsburgh synagogue. He argues that these violent acts are no different to the hate represented in the movie, adding, \"White supremacy has existed for centuries. It's lurked on the fringes of American power since the birth of this nation\". He added \"there is at least one notable difference ... The movie portrays skinheads as visually different ... They're suited up in boots with red laces, heads gleaming from a fresh shave, and tatted with Nazi insignia and racist slogans. White supremacists today have largely adopted a policy of fitting into society rather than standing out\". Writing for Esquire magazine in 2018, Justin Kirkland stated that he believed that \"Perhaps the reason that American History X still feels so relevant two decades after its release is because we haven't done enough for it not to be ... I'm afraid we're going to be writing about American History X forever. I'm afraid of what will happen if we don't\".</p><br/>"
  },
  "errorMessage": ""
}