{
  "imDbId": "tt0363163",
  "title": "Downfall",
  "fullTitle": "Downfall (2004)",
  "type": "Movie",
  "year": "2004",
  "items": [
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw1269676",
      "warningSpoilers": false,
      "date": "19 January 2006",
      "rate": "10",
      "helpful": "301 out of 330 found this helpful.",
      "title": "The Most Impressive, Depressive and Realistic Dramatic Movie about the World War II",
      "content": "\"Der Untergang\" is certainly the most impressive, depressive and realistic dramatic movie about the World War II ever made. I have never seen a film picturing the insanity of Hitler in his very last days in a bunker in Berlin with his high command, and how the German people were hypnotized by him like in this film. Last year, I saw the deceptive, boring, pretentious and overrated \"Molokh\", showing a caricature of Hitler and Eva Braun in Bavaria. But \"Der Untergang\" is awesome and comparable to \"Apocalypse Now!\", my favorite movie of war.Two years ago, I saw the powerful \"Das Experiment\" and I was impressed with the work of Oliver Hirschbiegel. With \"Der Untergang\", this director is certainly included in my list of favorite directors. It is difficult to highlight one actor or actress in this constellation of stars, but I was impressed with the performance of Bruno Ganz and his \"human\" Hitler, totally different from the stereotypes usual in other movies. The cinematography and the battles are stunning, and the scenario of Berlin completely destroyed recalled the neo-realistic movie of Roberto Rossellini \"Germania Anno Zero\".For those who know Germany and German people, it is amazing to see how this wonderful country survived to the chaos, destruction and lack of command, arrived from the ashes like Phoenix and sixty years later is again one of the greatest nations. For those who might have believed in Hitler and his Nazi Party, it is impressive to see how people is forgotten and treated without compassion by their leader in his last hours. And for those who love war, I really recommend to watch this magnificent anti-war movie, and see the behavior of the leaders and population when a war is lost. My vote is ten.Title (Brazil): \"A Queda! As Últimas Horas de Hitler\" (\"The Fall! The Last Hours of Hitler\")"
    },
    {
      "username": "The_Void",
      "userUrl": "https://www.imdb.com/user/ur2248099",
      "reviewLink": "https://www.imdb.com/review/rw1064606",
      "warningSpoilers": false,
      "date": "21 April 2005",
      "rate": "8",
      "helpful": "65 out of 69 found this helpful.",
      "title": "A magnificent piece of cinema. Spectacular in every respect",
      "content": "Truly great movies are few and far between these days; but Der Untergang most definitely represents one of those rare occasions. Oliver Hirschbiegel, who brought us the wonderful 'Das Experiment' has produced a film that is very nearly perfect. Depicting the final ten days of Hitler and the National Socialist regime, Der Untergang or 'The Downfall' to give it it's English title is an expose of failure and the way that a madman can bend a whole nation into doing his bidding. The film is very realistic, and an excellent ensemble cast breathe life and believability into the roles of the various members of the Nazi party and because every performance is picture perfect, the whole thing comes together brilliantly as one whole piece. Bruno Ganz gives the central performance as the Fuhrer himself and it is one of the greatest performances I've ever seen in a film. His portrayal of Hitler in the middle of his downfall is absolutely perfect, and Ganz excellently portrays the man's every emotion. It must be difficult to play such a notorious character as Hitler himself, but Ganz rises to the occasion and gives it his all.It is not the acting or the realism that is Der Untergang's main claim to greatness, however - it's the double meaning behind every scene. Each one is perfectly composed, and all the time you're watching you can not only see what's happening on screen but also take note of the implications surrounding it. Through every scene, there's always the notion that a nation is falling. That's another thing that's great about this movie - the way that it manipulates the audience into an awkward situation. On the one hand, we know that Hitler and the Nazi regime were unspeakably evil; but while we're watching this almost great nation crumble around it's leader, it is hard to watch without feeling some sympathy for the country, in spite of the ideals that were preached. I thought it would be impossible to generate feelings for the Nazi's; but Der Untergang has managed even that. 'The Downfall' is an apt title for this movie, as aside from depicting an important event in history; the film is fundamentally about failure. The entire movie focuses on one man's huge downfall, and it is both a heartbreaking and powerful cinematic experience. Der Untergang is not to be missed."
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw1157433",
      "warningSpoilers": false,
      "date": "24 August 2005",
      "rate": "9",
      "helpful": "49 out of 50 found this helpful.",
      "title": "\"You have to feel that Hitler was a human being; only then he is a real horror.\"",
      "content": "The first internationally released German production to feature Hitler as a central figure, \"Downfall\" (2004) takes place in the dismal gloomy Berlin during April - May 1945 in anticipation of the inevitable German defeat. The film shows the last days of Hitler and those close to him through the eyes of his young secretary, Traudl Junge.Oliver Hirschbiegel's film has been criticized by some circles as presenting a \"too sympathetic\" portrait of the Fuhrer. I don't believe anything in the film suggests that its creators sympathize with the Nazi regime and those who had orchestrated it.Showing Hitler as a human being (amazing performance by Bruno Ganz), a man who loved his dog, was a vegetarian and could display some moments of tenderness did not undermine the overall image of a lonely, domineering, conscienceless, and hateful man who believed that his people, his compatriots, women and children deserve to die because they are no longer deserve to live and because \"in a war as such there are no civilians\".Did those who think that that the film \"humanized\" Hitler forget the most chilling scene in the movie, the one that shows Frau Goebbels crush the ampoules with cyanide between her children's teeth, after they had been dosed with a sleeping draught? She did it not because she was scared of what would happen to them after the war, no, her reason was, \"The country without National Socialism and its party is not worth living in\". How dangerous Hitler was if he could induce such a blind devotion that could convince a mother of six to murder her children in cold blood.Bernd Eichinger, the producer and scriptwriter of \"Downfall\" emphasized, the greatest danger he saw in making a film about Hitler was the temptation to show him as a psychopath or madman: \"Hitler possessed an enormous criminal and destructive energy, and he was a barbarian in the most fundamental sense of the term... But I am convinced that he was totally of sound mind until the very end, which is why leadership never slipped from his hands.\" The film's director Oliver Hirschbiege says that, in the same way it was evil of Hitler to see Jews as less than human beings - i.e. as \"insects\" - it would be equally wrong to portray Hitler as a madman, because that would excuse him of culpability: \"I think the biggest mistake is to have an image of Hitler as insane - that he was not a human being but a monster. The most important point to realize is that Hitler was not a madman, not a psychopath or someone on drugs, which implies that he wasn't responsible for what he was doing. Of course he was responsible! \"For me, (this film is) paying homage to and truly honoring the victims, because we fall short if we explain the Holocaust by stating that they were all out of their minds. They knew what they were doing!\" I believe that the result of their work, the film I saw last night is absolutely unforgettable - honest, powerful and devastating. It is a masterwork of film-making and a very important in its objectivity historical document.9.5/10"
    },
    {
      "username": "jotix100",
      "userUrl": "https://www.imdb.com/user/ur1406078",
      "reviewLink": "https://www.imdb.com/review/rw1042459",
      "warningSpoilers": true,
      "date": "19 March 2005",
      "rate": "10",
      "helpful": "237 out of 276 found this helpful.",
      "title": "The last days at the bunker",
      "content": "This magnificent film goes where no one else dared to go to show us the last days of Adolf Hitler. The director, Oliver Hirshbiegel, working with a big cast, brings to life the madness of the last days of the monster, as observed by a young and impressionable secretary who witnessed most of the crisis.At the beginning of the film we watch as five young women are brought to be interviewed by Hitler for a job as his personal secretary. Young Traudl Junge is selected. She is a pretty woman who is naive in many ways and probably had no inkling about the trip she was going to embark.The film captures the tragic figure of Hitler as everything is caving in on him and his grand plans for victory. We watch a man at the beginning of the film that is still thinking he is in command of the German forces, but his authority has eroded, as it becomes clear to the people under him the war is lost and it will be a matter of time before they are defeated.We watch the life of privilege the higher ups led inside the bunker. It was a fortification in which all comforts the regular Germans could not imagine existed. We get to know the people in Hitler's inner circle. The Goebbels, both Joseph and Magda, supporters of the regime, maintain the loyalty to the Fuhrer until the end. The scene where Magda Goebbels murders her children is hard to take and we keep sinking in our seats, as we can't believe such cruelty existed. In her narrow view of things, Magda must take her family with her to a death these children didn't deserve.The film is totally dominated by Bruno Ganz. As Hitler, he makes us see this man as he probably was in real life. Mr. Ganz's uncanny resemblance with Hitler is what makes the film works the way it does. At times, Mr. Ganz is totally irrational, and at times, he is presented as a lost man who can't see what he has done to Germany and to Europe and the world.As Traudl Junge, the young secretary, Alexandra Maria Lara gives a subtle performance. She saw plenty inside the bunker and lived to tell it to the world. The other excellent performance is given by Corinna Harfouch, who as Mrs. Goebbels makes us cringe in horror because of what she is capable of doing. Juliane Kohler, as Eva Braun, is an enigma. At times, she is presented as a carefree young woman who might have loved Hitler. Yet, we don't ever know what made this Eva Braun tick. Ulrich Matthes as Joseph Goebbels and Heino Ferch as Albert Speer are equally effective playing these two men.The director and his team have to be congratulated for taking us on a voyage to see the last moments of the Third Reich."
    },
    {
      "username": "Coventry",
      "userUrl": "https://www.imdb.com/user/ur2020269",
      "reviewLink": "https://www.imdb.com/review/rw1001971",
      "warningSpoilers": true,
      "date": "18 January 2005",
      "rate": "10",
      "helpful": "73 out of 82 found this helpful.",
      "title": "A mesmerizing experience and one that will hopefully remind people all over the world that history may never repeat itself!",
      "content": "All I can say about \"Der Untergang\" is: WOW! This is one of those rare films that prove that the darkest pages in our world history easily surpass the fiction tales of the most imaginative fantasist. This soon-to-be landmark in cinema portrays the final ten days of Hitler's reign at the well hidden bunker in Berlin. In the opening sequences, we see how the Führer hires Traudl Junge (flawless performance by Alexandra Maria Lara) as his personal secretary and we largely witness the rest of the story from her viewpoint. Recent documentary footage with the real Junge is showed to audience at the end of the movie, stressing even more that this is a very intelligent and carefully elaborated production. A form of criticism I often encountered stated that Hitler was portrayed too \"human\" by the Swiss actor Bruno Ganz. Let me tell you that people who claim this haven't got the slightest clue what they're talking about! It's true that Hitler sometimes strokes his dog or even gives a compliment to his servant for cooking him such a lovely dinner! But only moments after, you're exposed to the real Hitler again! Alternately a mad-raving dictator, a disillusioned conqueror or simply a pathetic old man. But perhaps the most astonishing scenes in \"Der Untergang\" are the ones in which the persons close to Hitler  either professional or amicable  remain unconditionally loyal to him! It is deeply disturbing to behold how so many people blindly swear by the unworldly beliefs of a madman, even prepared to follow him into death. This accurate portrait results in a series of brilliant sequences with the severely shocking fate of the Goebbels family as an absolute highlight.Purely talking in terms of cinema, \"Der Untergang\" comes dangerously close to perfection as well. The largest part of this film exists out of interior shots, more specifically the bunker-network where Hitler lasted his final days and eventually committed suicide. And the atmosphere inside this bunker is reflected on the movie-screen as genuine as humanly possible. You can nearly smell the fear of the lower-ranked officers! You can almost feel the shivering of the petrified secretaries! I really hate using a cliché sentence like this but it's true it's like you are there yourself! And you don't want to be there! Even the totally demolished streets of Berlin looks look more appealing than the claustrophobic Nazi bunker. This despicable chapter in history deserves an accurate and well-budgeted cinema version, if only just for passing on the inglorious stories of WWII to younger generations. Director Oliver Hirschbiegel terrifically turned Joachim Fest's novel into a mesmerizing film experience. Perhaps the most praiseworthy aspect about it all is that \"Der Untergang\" simply is a reconstruction of the facts! No lame and amateurish attempts to blame Hitler's actions on miserable childhoods or traumatizing experiences. Simply put: this is fundamental viewing!"
    },
    {
      "username": "wforstchen",
      "userUrl": "https://www.imdb.com/user/ur0724961",
      "reviewLink": "https://www.imdb.com/review/rw1155054",
      "warningSpoilers": true,
      "date": "21 August 2005",
      "rate": "10",
      "helpful": "381 out of 390 found this helpful.",
      "title": "This Historian is awed by the effort for accuracy",
      "content": "I teach a college course on WWII, in graduate school studied under several experts on the subject and have interviewed numerous survivors on both sides. This film comes out on top, perhaps the finest ever made on the subject of the war (though the Belorussian \"Come and See\" & \"Schindler's List\" are darn close as well).I had the remarkable experience of watching this film last night with two veterans, one a GI who fought from Omaha to Czechoslovakia. . .and a German infantry officer, a veteran of four years on the Eastern Front. The German, who met Hitler several times, within minutes was exclaiming over the historical accuracy, right down to \"Hitler's\" lower class Munich accent. . .something an American audience would never pick up on. My German friend, who at the end of the war was in East Prussia, in the debacle of attempting to evacuate over a million civilians ahead of the Russians, was profoundly shaken by the film. . .saying the horror, the hospital scenes, the utter chaos, the lynchings, the sight of 12 year old children fighting. . .all of it was real. And an interesting observation by him. . .he had no idea Berlin, at the end, had been as bad as what he witnessed along the Baltic coast and is still haunted by. It truly was \"Gotterdammerung\" for an entire nation and this film brings it frightfully close to you. If you are a parent of small children, the terrifying ending for the Goebbel's children is an absolutely searing nightmare.I think the most important point of the film was the portrayal of Hitler. . .not as the stereotyped raving madman, usually overplayed like a bad performance of King Richard, but far more subtle. I've talked with many who knew Hitler, including a childhood playmate of Helga, Goebbel's oldest child, and all will tell you that Hitler could be absolutely charming, focused on you, even courtly when with women. The terror is, that even as the actor shows us that \"human\" side, in his soft voice he is dictating orders, observations, and comments of absolute evil. The true form of evil rarely looks evil on the surface, it seduces us with a fair face as it leads, sometimes an entire nation, into damnation. THis film captured that evil.My German friend's comment at the end of the movie. . .\"I still can not believe we fought for that monster for six years.\" A history professor at Montreat College"
    },
    {
      "username": "ilovedolby",
      "userUrl": "https://www.imdb.com/user/ur1777116",
      "reviewLink": "https://www.imdb.com/review/rw1095187",
      "warningSpoilers": true,
      "date": "5 June 2005",
      "rate": "10",
      "helpful": "138 out of 152 found this helpful.",
      "title": "A deeply disturbing, intimate portrait of the insanity of Hitler and the blind faith of his followers at the end.",
      "content": "In recent years, war films have given a new exposure to the sheer nature of war. In \"Saving Private Ryan,\" \"Black Hawk Down\" and \"Born on the Fourth of July,\" we were exposed to the realities that a soldier endures not only on the battlefield, but what they take with them long after the battles end. However, \"Downfall,\" a German film nominated for Best Foreign Language Film at the 2005 Oscars, brings a unique perspective to the table. It is about the last days of Hitler and the Third Reich and the ultimate demise of both. More so than a war movie, this feature exposes the insanity of Hitler and the blind faith of his followers at the end. It is a deeply disturbing, intimate portrait of the cruelty that he inflicted not only upon 6 million Jews, but ultimately on his own countryman at the end.Based on the book \"Inside Hitler's Bunker\" by Joachim Fest, \"Downfall\" is in a word, shocking. The last act in the great horrific play of the Third Reich plays out like that of a cultso many men and woman who swore allegiance to Hitler commit suicide by either shooting themselves in the head or by ingesting poison capsules. But the madness of Hitler himself is horrifically captivating. He changes his mind and opinion on a whim. One moment he advises his SS-Guards and Generals to leave the city after learning that he does not have enough troops to protect Berlin. A particular one named Gruppenführer Hermann Fegelein , who was Eva Braun's brother-in-law, takes the Fuhrer for his word and leaves Berlin. When Hitler realizes this, he denounces Fegelein and orders him executed. What is more, Hitler discusses the final demise of the German people. He explains that this failure is not only that of the military, but of the civilians themselves. As such, his soldiers do not protect the people from the coming onslaught of the Soviet Army. He advises, \"In a war as such there are no civilians.\" Hitler is recreated by the superlative performance of Bruno Ganz, who appeared in the 2004 remake of \"The Manchurian Candidate.\" Ganz captures the movement, voice, even the involuntary shaking of Hitler's left hand so well, that the audience would feel as if they are watching the dictator himself. We are often left with shivers down our spine at how realistic Ganz's depiction is. Surprisingly enough, Thomas Kretschmann, who played the Nazi captain that gave Wladyslaw Szpilman a coat and food in \"The Pianist\" is seen here as Fegelein. I first noticed Kretschmann as a German U-Boat commander in 2000s, \"U-571.\" He is a remarkable actor who brings with him a demanding presence on the screen through his stern looks and ultimate resolve. Unfortunately my knowledge of Eva Braun other than Hitler's mistress is limited. So it was refreshing to see a film that revealed her. Based on \"Downfall's\" depiction, Braun, portrayed by Juliane Kohler, was either one of the shallowest individuals I have ever seen, or she was so blinded by her faith in Hitler that she disregarded almost any sense of reality. For example, during Berlin's first days of bombardment, she becomes bored with being in the bunker and orders a party in an above ball roomnot surprisingly during that party a shell lands nearby and blows out windows in the room. Secondly, during later heavy bombardment, realizing that she will commit suicide with Hitler, she writes a letter to a relative where she states what jewelry she will leave behind. She is simply detached from reality and lost in the fanatical jargon of the Fuhrer. Certainly the film's most disturbing instances occur when Magda and Joseph Goebbels poison their children in the name of the Fatherland. One of their children, a girl probably about 10 years old, has a dim understanding of what is happening and refuses to take the drink given. She is then forced to drink it by her mother and a guard. Later on, Magda would come into her children's room while they were asleep and would give them the final capsule to eliminate them. \"Downfall\" is certainly one of the most powerful film's I have ever seen. As stated above, Hitler and his followers played out their existence as if they were in a cult. The blind faith of his followers and the insanity of the man are so well realized by director Oliver Herschbiegel, that it changes one's perception from that of simply being history to that of realism. These events happened less than a century ago and although most have learned to forgive Germany's past, no one will ever forget it. It is the stigma that haunts this generation of German youth because many of their grandparents or great-grandparents were a part of one of history's most infamous armies. But the fact that this film is German was surprising to me. I would have guessed that no one in Germany would have wanted to dig up their past in this way. However, if one looks at this film as closure to Germany's transgressions, then maybe this new generation of German youth can learn to have a sense of national identity without the horrors of the past seen in their shadows. **** out of ****"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw3200950",
      "warningSpoilers": false,
      "date": "13 March 2015",
      "rate": "10",
      "helpful": "25 out of 28 found this helpful.",
      "title": "Very important historically but not for the faint of heart",
      "content": "This film is based on the experiences of Hitler's secretary as well as other survivors of the bunker during the final days of Nazi Germany. It follows these people (with a strong emphasis on Hitler through the first 80% of the film) and excels at its historical accuracy. Unlike some of the other Hitler biopics (such as the ones starring Richard Basehart and Alec Guinness), this one shows an odd and 3-dimensional man--screaming and irrational one moment yet rather kind and likable the next. If Hitler had ONLY been a screaming madman (as he's generally shown) no one would have followed him and he never would have led Nazi Germany. Here he is much more believable and the writer, director and actor (Bruno Ganz) all created the best screen Hitler to date. The film is a history teacher's dream come true, as the film sure makes you THINK it's being filmed in Berlin during the final days. The look of the bombed out and burned out city is amazing, the bunker sure looks like what the real bunker would have looked like, the uniforms, weapons, cars, etc. all look as they should.I have only one reservation about this incredibly well made film and that is although the film often sanitized the violence here and there, other times it's up close and personal and overwhelming. For example, many times folks blow their brains out with pistols. You often only hear it and you might see a brief look at the corpse. But, other times, with little warning, someone whips out their pistol and blows a hole through their head...and you see all of it. And, the death of the Goebbels children is heart-wrenching to watch. There also are the scenes involving amputations that are hard to watch. So, while I applaud the film for accuracy, it it NOT for small children or anyone who isn't prepared to see exactly how it was...blood and all. Overall, incredibly compelling and a film that's among the best the Germans have ever made. Ironically, Ganz played Hitler in this one and his other super-famous film was WINGS OF DESIRE in which he played an angel!!"
    },
    {
      "username": "bs3dc",
      "userUrl": "https://www.imdb.com/user/ur4344459",
      "reviewLink": "https://www.imdb.com/review/rw1623646",
      "warningSpoilers": true,
      "date": "24 March 2007",
      "rate": "",
      "helpful": "42 out of 44 found this helpful.",
      "title": "Brilliant Depiction Of The Effects Of War",
      "content": "Downfall is the gripping depiction of the last few days of the Second World War in Europe, as the Russians advance into Berlin and approach ever nearer the bunker of Adolf Hitler who still believes their advance can be stopped...Bruno Ganz turns in a terrific performance as Hitler, paying great attention to detail (including the regional accent and the effects of Parkinson's disease) that really make him into a believable person which is a lot more frightening to watch than the usual two-dimensional characterisations that are usually seen on screen. Ganz manages to dominate the screen with the same effectiveness that allowed Hitler to get followers of such devotion that despite his atrocities and the horror of the situation many are prepared to stay with him and fight to the death while the possibility of escape or surrender remains open to them. He is almost schizophrenic - at some moments he is almost gentle, such as some of the scenes with his secretary, then shortly afterwards he is practically foaming at the mouth in his contempt for the civilian population of Berlin who he will not raise a finger to try to save by surrendering to the Allies.The other actors are not very well known - at least on the international arena, but this added greatly to the authentic feel. Some of the senior Nazi leaders are hardly more sympathetic than their Fuhrer - Himmler in particular shows only personal ambition while pretending loyalty. Other characters such as the caring SS doctor who finds elderly patients simply abandoned in a hospital or the father who desperately tries to persuade his son who must be around 12-14 not to get involved and perish in a hopeless cause are succinctly realised.The film is expertly shot, with the unreal atmosphere in the bunker captured perfectly where Hitler raves about army units that barely or cease to exist coming to the rescue of the Reich and orders oilfields re-captured for 'long distance missions' when the Russian troops are barely a few hundred metres away.There is no glory shown in the battle scenes as the outcome is always a foregone conclusion making the resulting deaths even more moving. Watching young children and old men trying to hold off the Russian advance with inadequate weaponry is tragic in the knowledge that they are dying for no real purpose other than the whims of a handful of madmen.Very few films have depicted the tragic waste of life that war provokes better than Downfall and this turns out to be one of the best movies concerning the conflict that claimed over 50 million lives."
    },
    {
      "username": "nosiesnetnieuws",
      "userUrl": "https://www.imdb.com/user/ur2669188",
      "reviewLink": "https://www.imdb.com/review/rw0969337",
      "warningSpoilers": true,
      "date": "24 November 2004",
      "rate": "10",
      "helpful": "786 out of 848 found this helpful.",
      "title": "Impressive achievement, realistic and shocking",
      "content": "This film definitely is a must-see because of the incomparable degree of realism displayed in it. Direction, camera and acting are of an unparalleled level and make you, as the viewer, feel as if you are actually in Berlin, 1945, and in the FÃ¼hrer's bunker. The film does not provide any commentary or judgment, it just shows facts.The film is criticized because it gives the Nazi's a human face, but this is exactly it's strongest point: the Nazi's were not extraterrestrial monsters, they were as human as you and I. The image of Hitler crying of sorrow because all is lost, is still burned on my retina.In my opinion, this is a film that should be shown in schools to illustrate the Second World War with. It is probably impossible to provide a more realistic account, without *any* form of judgment.A major achievement, even for Germany as a whole. It is very brave to create such a realistic film about one's own past."
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw1328052",
      "warningSpoilers": true,
      "date": "28 March 2006",
      "rate": "8",
      "helpful": "13 out of 14 found this helpful.",
      "title": "Unforgettable",
      "content": "I tuned in late to this film, not expected very much, because we have all I suppose seen so many documentaries of Hitler's last days in the bunker, and a reconstruction with Alec Guiness thrown in for good measure. Many of these presentations depend on interviews with Trudl Junge, Hitler's secretary at the time. Her descriptions of the goings on during the final days are cool, precise, and dispassionate. First Hitler said this, then Eva Braun said that, and then they went up into the garden. A human surveillance camera who seems to have no personal mechanism for judgments.She was, however, quite human after all. The last shot of the film is from an interview with her before her death in 2002. She explains to us that, young as she was, she had always put aside any feeling of guilt for her involvement in the Third Reich, negligible as it was. But then, one day, she passed a monument to Sophie Scholl who sacrificed herself in the course of resisting Naziism, and Frau Junge tells the camera -- and the rest of the world -- that she realized at that moment that youth and naiveté could no longer serve as her excuse.I missed the first half hour or so, but I stayed for the rest. This is an extremely powerful movie. The events in the bunker are keenly observed. There is virtually nothing in the way of sentiment or dramatic displays. If the director, Hirschbiegel, wants two officers to commit suicide he may have them walk into a room and close the door behind them, then allow us to hear two shots a bit later.No one talks about despair. Instead, the officers and some of the ladies sit around a table in one of the bunker's rooms and get drunk as skunks.This is a tragic ending to an insane war, and it is all enacted by human beings, not demons. Goebbels and his wife have 5 beautiful young children, a boy and four girls. They deliberately give them knockout drops, then Frau Goebbels puts a capsule of fast-acting poison in each of their mouths, one after another, and crunches the capsule by pressing each child's teeth together. Then, wordlessly, Goebbels and his wife walk up into the open where, still wordlessly, he shoots her and then himself -- off camera. The soldiers who have been waiting impatiently for this ritual to end, then scurry forward with cans of gasoline to dispose of the bodies.The episode is impossible to watch without being moved. What have Goebbels and his wife died for? What did their children, who knew nothing of war or racism, die for? And, implicitly, the film asks, what did some 50 million people die for between 1939 and 1945? I am grateful to the director and the actors for keeping things so matter of fact. Preparations for a predictable death are pretty gruesome even with the most tasteful intentions, and too often executions and suicides seem to have the filmmakers' attention lavished on them for not much reason other than to pander to a morbid interest in watching someone else die, a kind of arousal jag.How easy it would have been for a trashy sensibility to give us the death of Hitler's German shepherd, Blondi, in all its horror. A DOG yet! Those of us who might have cheered at Hitler's death would now have a chance to weep over Blondi's. Instead, except for a few instructive inserts, Blondi's poisoning is only glimpsed in a clumsy shot through an open doorway.Congratulations to everyone involved in this production. They've given us a well-executed film, made for adults. They come along so rarely."
    },
    {
      "username": "hermes-10",
      "userUrl": "https://www.imdb.com/user/ur0395506",
      "reviewLink": "https://www.imdb.com/review/rw0961136",
      "warningSpoilers": false,
      "date": "12 November 2004",
      "rate": "9",
      "helpful": "531 out of 586 found this helpful.",
      "title": "Amazing realism",
      "content": "Der Untergang makes you live the horrors and craziness of war. Bruno Ganz's interpretation of Adolf Hitler is worthy of an Oscar. He is completely believable. Also the rest of the cast performs admirably. You feel transported to Berlin as it was bombarded by the Russians. You get a very clear insight (or an impression?) in how the military decisions were taken during those final days of the war. The movie balances well between large-scale effects of bombs exploding in ruined streets and depictions of different persons going though the experience  from Hitler and his staff in the well-protected bunkers to the principal military commanders torn between reason and loyalty and German civilians trapped in an inferno. The movie is neither pro-Nazi nor does it depict all Nazis as mindless monsters. It gives an impression of utter realism. Go see it in a good cinema  your seat will tremble as the bombs explode. A nine out of ten."
    },
    {
      "username": "philip_vanderveken",
      "userUrl": "https://www.imdb.com/user/ur3922673",
      "reviewLink": "https://www.imdb.com/review/rw1021677",
      "warningSpoilers": false,
      "date": "15 February 2005",
      "rate": "10",
      "helpful": "38 out of 45 found this helpful.",
      "title": "It's amazing and unbelievably realistic... Go see it people, NOW!!!",
      "content": "Having a huge interest in both World Wars and all that happened during the time period 1910-1950, I've seen a lot of movies and read even more books on the subject. Name me a more or less realistic war movie and I've probably seen it, so when \"Der Untergang\" was first released in Germany, I already knew I wanted to watch it as soon as it would be released over here. The commotion that it caused, the good critics that it got, all made me look forward to the day that I would see it, but really nothing could prepare me for what I saw... It was amazing, it was great, it was jaw-dropping...The main criticism that many people had on this movie was that Hitler and the other Nazi party members looked too human. I know, some people expect that the leaders of the Third Reich are only shown as real monsters, as people who didn't have any human feelings... But that's not the truth. The truth is that, no matter how horrible the things they did, they still were human and (most of the time) acted like normal human beings (for instance Hitler who really loved his German shepherd or who had one of Goebbels' children sitting on his lap while they were singing a song for him...). And let's be honest: do you think a leader who doesn't care for his people's destiny after the war, who doesn't want to see the truth that the war is lost, who knows all too well that he sends young children into battle (he even decorates them personally), but doesn't care, a man who can be so kind and sweet one moment and than be furious and outraged the other moment, really looks like a kind, sweet grandfather??? I don't think so. The makers of this movie never intended to make him look like a nice or a bad man, they intended to show him the way he really was and they did an amazing job.I've seen many documentaries about Hitler and read a lot of books about the man, so I think I can say I know quite well how he acted and reacted. Seeing Bruno Ganz as Hitler was a shock. He doesn't just look like Hitler, he IS Hitler in this movie!!! His performance was absolutely amazing and seeing him in this film really made shivers going down my spine. Hitler seemed to be alive again! If you've read so many books about the man as I did, you can only conclude that the resemblance is more than just remarkable, it is perfect.But of course there were more actors in the movie than Bruno Ganz (an actor who I admire since I saw \"Pane e Tulipani\" or \"Bread and Tulips\" for the first time). Even though I have to admit that I don't really know any of them, I must say that they all did an excellent job. Juliane Köhler as Eva Brown, Corinna Harfouch as Magda Goebbels, Alexandra Maria Lara as Traudl Junge, Ulrich Matthes as Joseph Goebbels,... They all must have studied there characters for many hours, because they were all excellent.As the horror and reality of the movie have only just ended and burned themselves on your retina for the rest of your life (By the end of the movie, you'll have seen many officers commit suicide, Hitler and Eva Brown being burned behind the bunker, the Goebbels murdering their children, people being hanged on a lantern for stupid reasons, young children dying as they try to defend Berlin...), you think you've had it all, but than the real Traudl Junge gives away a last testimony, looking back on her life with Hitler ... blowing you away even more. I can't remember that I've ever been so quiet after seeing a movie and apparently I wasn't the only one. Really no-one spoke a word during the first minutes after the lights went on again. I don't think many movies have ever touched the audience in such a deep way as this one did.Because of its historical value and realism, this movie should be seen by everybody and especially by young people at school. Forget those history books for once, this will get through to them at least ten times better. I'm sure that everybody will admit that this movie is a true masterpiece. People who don't know anything about the subject will be able to learn a lot about it and people who already thought they knew it all will still find some new things and will admit that this is exactly the way it must have been 60 years ago. I think there can be only one appropriate score for this movie and that is a full 10/10. Go see it people, NOW!!!"
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw1249848",
      "warningSpoilers": false,
      "date": "29 December 2005",
      "rate": "8",
      "helpful": "18 out of 21 found this helpful.",
      "title": "DOWNFALL is essential and indispensable watching for outstanding performance by Bruno Ganz",
      "content": "The film deals with the history of Hitler's last days in underground bunker , it's the true story of the historic downfall and death (at age 55 in 1945) of the infamous Nazi dictator's culprit of death of 50 million people during second war world and killing of 6 million Jewish in concentration camps . The Fuhrer's last few tortured days in his underground bunker against a Berlin background . Hitler had height five feet , seven inches , eyes black , hair black , shaggy locks hung over forehead , complexion sallow , wide mustache , various hairs on each side ; besides he had marked devotion to brown shirts and old trench-coat and always surrounded by armed thugs and expert gunmen . He had demented gaze with tendency to become hysterical on slight provocation with delusions , particularly upon his place in history and his powers over vast numbers of people and addicted to public hysteria on race purity , and known to throw himself on the floor and gnaw rugs, guttural voice apt to rise to shrill tones when excited or thwarted . He was a congenital liar suffering from dreams of persecution . Almost all these physical descriptions and particulars of Hitler are perfectly incarnated by Bruno Ganz who even studied Parkinson's disease patients in a Swiss hospital to prepare for his role . Thus , he magnificently plays him as a sadistic , malicious , dangerous , vengeful, mystical and maniacal man .Bruno Ganz's portrayal is the perfection in the Hitler role one would expect at least on the surface , he gives insight to his madness and with persuasive qualities of his interpretation . A flawless casting with excellent German actors such as Alexandra Maria Lara (personal secretary Traudl Junge and the picture is based on his book) as co-protagonist , Juliane Kohler (Eva Braun) and distinguished players as Ulrich Matthes (Joseph Goebbles) , Corinna Harfouch (Magda Goebbles) and Thomas Kretschman . Besides , a nice support cast who play to famous characters as Martin Borman , Alber Speer , General Keitel , General Jodl and Hermann Goering and specially Heimrich Himmler who will betray to Hitler deciding along with the count Bernardotte to agree peace with the Allies , originating his hysteria splendidly reflected in the movie . In spite of Berlin is surrounded and meanwhile the bloody war with enormous bombing fall about the survivors and last defending , Hitler prepares the sad farewell very well narrated by the director Oliver Hirschbiegel and superbly captured the atmosphere by the cameras . The motion picture is one of the best war movies ever made , on pair with ¨Das Boot (also German movie and directed by Wolfgang Petersen) and ¨Saving private Ryan¨ (Steven Spielberg) . The flick will appeal to historical cinema enthusiasts and warlike genre fans. Rating : Above average and astounding , being interesting and thoughtful ."
    },
    {
      "username": "Buddy-51",
      "userUrl": "https://www.imdb.com/user/ur0375636",
      "reviewLink": "https://www.imdb.com/review/rw1429449",
      "warningSpoilers": true,
      "date": "24 July 2006",
      "rate": "8",
      "helpful": "8 out of 8 found this helpful.",
      "title": "grimly fascinating film",
      "content": "Ever since his death in a Berlin bunker at the end of World War II, there has been endless speculation and conjecture surrounding the final days of Adolph Hitler and his long time mistress Eva Braun. A few years back, a documentary entitled \"Blind Spot: Hitler's Secretary\" interviewed one of the few people who claimed to be an eyewitness to those events, a young woman hired to take dictation for Der Fuehrer for the last two and a half years of his life. \"Downfall\" is a dramatized account of what she saw.Indeed, this new film begins and ends with clips from that earlier work, in which a now aged Traudl Junge attempts to explain why she allowed herself to become a devotee of both Hitler and the Nazi party (she chalks it up, basically, to \"curiosity\"). After that brief preamble, \"Downfall\" plunges us immediately into that hellish time when the world lay in ruins and The Third Reich was breathing its long overdue final gasp.The beauty of \"Downfall\" is not merely that it affords us a glimpse into one of the most fascinating bits of 20th Century history, but that it opens up aspects of human nature that we may not always wish to acknowledge. It shows Hitler as a man accustomed to being able to control events and the people around him suddenly rendered impotent in the face of a force - in this case the Russian army battering away at Germany's capital city - greater than himself. As events spiral more and more out of control, the dictator becomes ever more paranoid and divorced from reality (by the end he's issuing orders to an army that , quite literally, no longer exists). For him, the world suddenly divides itself up into those who will remain loyal and faithful to the bitter end and those who will become traitors both to him and to the \"glorious cause\" that defined their lives for so many years. For one thing the movie is clear to acknowledge is that, even in his final moments, Hitler remains unrepentant and convinced that not only was he right in what he did, but that future generations would come to recognize that rightness and honor him for it. In many ways, this is the story of any failed dictator whose dreams of worldwide domination end in the smoldering ruins of his own hubris.But it is not merely Hitler who exhibits bizarre behavior in the face of onrushing doom. Even though most of the people who have chosen to remain in the bunker with their leader are fully aware of the fate that awaits them, they maintain many of the rituals and accoutrements of \"civilized,\" \"gracious\" living: they hold dances, sing patriotic songs, drink champagne from crystal glasses, read magazines, all the while calmly discussing the ideal way to kill themselves. Despite their fear, they are so caught up in the vision and the man to whom they have sworn allegiance that they are willing to die - and take their children with them into death - rather than live in a world without their beloved Fuehrer.The makers of \"Downfall\" run the risk common to any work that attempts to provide a three-dimensional portrait of Hitler: the accusation that they are trying to \"humanize\" a man whose epic disregard for human life puts him in the category of the greatest monsters who ever lived. And, indeed, the movie does show Hitler displaying moments of warmth and tenderness, mainly aimed towards the women in his life (and, of course, his dog). Yet, who among us really believes that Hitler NEVER showed affection to those who were close to him? It was the fact that he COULD treat the people he loved in this way yet was unable to extend that same sense of empathy and concern to the faceless, nameless millions he slaughtered that made him the true incarnation of evil on earth.The film also does a great job showing the varied reaction of Hitler's military commanders as they argue back and forth over whether to level with him about the hopelessness of the situation and thereby risk incurring his wrath or to continue to feed his delusions and let him go out thinking he was still master of his fate.The performances are all first rate, but I would like to single out especially the lively and vivacious Juliane Kohler who manages to make Eva Braun's blind devotion to a murderous madman and fearlessness in the face of death touching, understandable, and - dare I say it? - strangely heroic. As Junge, Alexandra Maria Lara shrewdly portrays a woman whose own devotion to the man and the cause is tempered by a certain degree of rationality and fear, to the point where she can ask, in a moment of candor, how Hitler can be so kind on a personal level, yet so brutal in his comments and actions. And, of course, Bruno Ganz gives a bravura performance as Hitler, running the gamut from full-throttle mania to tender solicitude while never losing sight of the man at the core.Despite being set in the past, \"Downfall\" has a great deal of relevance to our own time. To see Magda Goebbels methodically and systematically poisoning each one of her own children before having herself killed is to understand a little better how family men can fly planes filled with innocent men, women and children into skyscrapers. It's a scary and sobering sight indeed. Now if only we as a species could learn some of the lessons put forth by this film."
    },
    {
      "username": "Marx_Bros_Fan86",
      "userUrl": "https://www.imdb.com/user/ur4823391",
      "reviewLink": "https://www.imdb.com/review/rw2021190",
      "warningSpoilers": true,
      "date": "10 February 2009",
      "rate": "10",
      "helpful": "23 out of 25 found this helpful.",
      "title": "Probably the most accurate WW II movie I have ever seen",
      "content": "A lot of war movies have a sense of patriotism or commercialism, but Der Untergang feels like it is just giving you the cold hard facts of the last ten days of the Third Reich. I have to commend the filmmakers for not using black and white or filtering the color, like many other WW II movies today. It is becoming a cliché. The film is based on Traudl Junge's recollections of the last ten days she spent in Hitler's Bunker. It takes place entirely in the Bunker, which gives the film a very claustrophobic feel. As the outcome of the war becomes clearer, the Bunker becomes a cesspool of drunkenness, denial, and even death.Hitler's secretary Traudl Junge has a strange relationship with him. She stays with him out of sympathy and loyalty, but she is often horrified by his cruelty and inhumanity. This might be difficult to understand but I believe this makes the movie all the more realistic. She can recognize cruelty when she sees it but Hitler is the Fuhrer, a man who is practically worshiped. Hitler is shown to have elements of humanity. He despises smoking, loves his dog Blondi, and genuinely seems to care for his secretaries and Dr. Goebbel's children. We can feel his sorrow as the Russians advance toward Berlin. His dream of a German Empire had been lost and it breaks his soul. One of my favorite shots in the film is that of Hitler staring silently at a picture of Frederick the Great, seemingly thinking about his failures.This is not to say Der Untergang is pro Nazi. I believe that by portraying Hitler's humanity the film makes his crimes all the more terrible. If he was just a one dimensional monster that would be his excuse. The inhumanity of the Third Reich does emerge throughout the film. Hitler blames the German people for the defeat of the military, calling them cowards and saying they deserve their fate. Joseph Goebbels expresses similar sentiments. Magda Goebbels says she cannot live in a world without National Socialism, and poisons her children before committing suicide with her husband.The film perfectly captures an aura of hopelessness and denial. Eva Braun throws a party in the middle of the Russian bombing, trying to get her mind off Germany's impending defeat. She does anything and everything to keep her mind off the war. Hitler orders his Generals to move Tank divisions that do not exist or are too crippled to be of any use. He blames his Generals for Germany's defeat and not himself, which he usually did in real life. People around Hitler are aware that the situation is hopeless and betray him to save their own skin. In the midst of all the madness, some people have retained their sanity. Professor Schenck, a German Doctor, tries to help the wounded soldiers and civilians when his own government abandons them. Berlin is in ruins and people are left to fend for themselves. An old man tries to convince soldiers who are no more than thirteen that there is no point in fighting, but to no avail. Eva Braun's brother-in-law Fegelein tries to convince Braun to leave Berlin, but she cannot leave the Fuhrer. We sympathize with these people, and they only show how insane the Third Reich was. People commit suicide out of devotion to the Fuhrer. Corinna Harfouch plays a chilling Magda Goebbels; the scene where she pleads with Hitler not to kill himself was outstanding. The star of this movie though, is Bruno Ganz. His performance as Hitler feels so authentic it is frightening. If I ever had to recommend a movie just to see one performance, this would be one of them. Hitler has been played by great actors like Anthony Hopkins and Alec Guinness, but Ganz has received the most praise. I will seek out more of Ganz's movies based on this performance. At the end of the film, an excerpt from an interview with the real Traudl Junge is shown. She says that at the time of the Nuremberg trials she was shocked by what had happened in the Concentration Camps but did not consider herself responsible. Now she admits that she had no excuse. I would imagine this is how many Germans from her generation feel. I highly recommend Der Untergang to anyone who is interested in The Third Reich or anyone who appreciates good film making."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw1063855",
      "warningSpoilers": true,
      "date": "19 April 2005",
      "rate": "",
      "helpful": "24 out of 30 found this helpful.",
      "title": "Gripping, moving and horrifying  again a war movie that just makes you wonder what the point of it all is",
      "content": "In 1945 the second world war is coming to an end The German armies that once spread out all over Europe have been decimated and pushed back to the very heart of the German command in Berlin. Deep in his bunker, Hitler continues to rule with his group of generals, families and Traudl, his secretary. Awaiting armies that no longer exist and making plans that his generals are too scared to tell him are impossible, Hitler refuses to surrender as the streets and citizens of Berlin suffer between the remaining defending forces and the advancing Russian army. Gradually, as it becomes obvious that all is lost, the dream collapses and all that is left is death.A few months ago, a fellow user on this site asked me if I thought if Der Untergang was going to get nominated for an Oscar or not; I must admit that at the time I had not heard of it, but decided to see it if I got the chance. Of course it took me a few weeks to be in the mood for a long war movie that I knew was not going to have a good ending for anyone. When I went to see this film, the woman selling me my tickets asked if I knew it was a German film, I asked why it mattered and she said that they had had quite a few people leave the screening complaining about the fact it wasn't in English; doubtless these people then went into the next available screening of Be Cool (or whatever) and turned off their hearts and minds and just talked their way through the movie. Anyway, enough of my multiplex complaining, in fairness I did join a surprisingly full screening of this film and immediately got into it. The focus of the story was the bunker and it is compelling in its portrayal, with the cold emotion, the cruel sentiments and the utter pointlessness of the whole thing.The characters are not that well developed; they were never really people to me but they did enough to fit their roles within this story. That said, the whole story is compelling and it didn't matter that I didn't care for the characters as people because they were gripping to watch nonetheless. The film works well to paint the inanity of the whole thing but also cut in moments that are so cold that they almost made me shiver  for example, when Hitler is told of the loss of all the young officers, he simply replies \"that is what the young are for\". The film does not forget the people above ground and the scenes of destruction of Berlin are impacting  those who say that the civilians deserved it should see this and try to understand what they would have done in the situation; I am part of a country that went to war with Iraq, by that logic I deserve to have that country retaliate against me, even though I opposed the manner in which we did it.The acting is classy even though the characters are quite thin at times. Ganz is a great Hitler and gets it spot on throughout the film; however he does well not to dominate the film  his death (no spoiler there) doesn't stop the film because he was not what the film was all about. Lara is good although a bit too wide-eyed to convince; her real confessions at the end of the film are a bit too forgiving of her as a person but it does serve as a fair ending to the film. Harfouch and Matthes are cold and effective as the Goebbels' while the rest of the support cast all fit their roles well, with a good mix of opinions and approaches across the generals facing Hitler.Overall this is a good film although it is not an easy one to watch. The bunker scenes are cold and compelling even if the characters are broad historical reference points rather than people, meanwhile the attacks on Berlin are brutal and difficult to just watch without being moved. The manner in which the film ends is just as you'd expect, with nothing achieved but destruction by all of German's years before and during the war. The end credits remind us that 50 million people died during the war, including 6 million Jews and ethnic minorities systematically murdered  having seen the men who organised all this taking their own lives the main thing I felt was just how pointless and wasteful the whole thing had been and I left the film having \"enjoyed\" the quality film but being utterly depressed by the world in which we live."
    },
    {
      "username": "Prismark10",
      "userUrl": "https://www.imdb.com/user/ur4569900",
      "reviewLink": "https://www.imdb.com/review/rw3569041",
      "warningSpoilers": false,
      "date": "26 October 2016",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Hitler's last days",
      "content": "Downfall is an enthralling film that examine the final days of the Nazi hierarchy ensconced in their bunker. It is a war story I have never encountered before, the German view of the last days in 1945. As the war is lost we see the Nazis throwing their own citizens in peril as the red army takes control of Berlin.As Goebbels remarks, he has no sympathy for the German citizens, they made their choice, gave the Nazis the mandate now they will face the consequences.Downfall is told from the view of Traudl Junge (Alexandra Maria Lara) a young woman from Munich taken on by Hitler as a secretary in 1942. Her memoir is one of the sources of the movie's narrative.Hitler (Bruno Ganz) is increasingly unhinged at times shouts like a rabid dog of comrades, generals that have betrayed him. His acolytes in the bunker, some remain loyal, some look to get out, some look for a glorious death, others just to survive. As the city is near to falling, you see a few of the officers getting increasingly drunk, (Eva Braun lives a decadent life even as the city is being pounded) others make way in to the bunker and hear Hitler speak of some miraculous, imaginary strategy that an army division will come to the rescue. In the meantime he is making plans for his own and Eva's death and destruction of their bodies.As Berlin is destroyed, its citizens turn on in each other, people get hung as Russian collaborators. A young boy is part of a makeshift resistance to repel the Russians and then just tries to make his way home.At the end you see the Goebbels who decide it is National Socialism or nothing and Mrs Goebbels calmly kills her own children before they take their own lives.The film finishes as we see documentary footage of Junge who confesses she did not know what was happening under the Nazis but she should had looked harder, after all Sophie Scholl who was also from Munich knew what was happening.Downfall is apparently faithful to the facts. It is not just a film that is set in the bunker, you see the fighting in the city, the German soldiers trying to resist, getting conflicting orders at times impossible orders. One General is ordered to be shot for leaving his lines, he has not and goes to see Hitler to complain.Director Oliver Hirschbiegel has made a commanding film that holds your attention and a blazing performance by Ganz. His Hitler is ill and mad, knowing his dream of the third Reich is in ruins and flip flopping between reality and fantasy surrounded by sycophants who want him to leave Berlin and suspicious military leaders, who feel betrayed by his overconfidence and ineptitude who wish to pursue peace at this late stage."
    },
    {
      "username": "Jdylan-1",
      "userUrl": "https://www.imdb.com/user/ur3227458",
      "reviewLink": "https://www.imdb.com/review/rw1371580",
      "warningSpoilers": false,
      "date": "19 May 2006",
      "rate": "10",
      "helpful": "24 out of 25 found this helpful.",
      "title": "One of the Best Movies I've Ever Watched",
      "content": "Seriously, I wasn't expecting much, but this was one of the best movies period. The actors and acting was terrific, the sets were incredible (St. Petersburg, Russia), the emotions... I felt like I was in Berlin during the last few days, I felt like I was in the bunker with Hitler. It is the most realistic depiction of the situation I had ever seen, and I almost felt a tear in my eye. And that is something, coming from a 40 year old Army veteran. The last 5 minutes, I was on the edge of my seat, when the Russians showed up. Anyway, this movie is totally recommended by me, but brush up on your Nazi history first, or you won't know who is who.I also liked it because it showed Hitler as a real human, and not the usual Anthony Hopkins/Alec Guiness \"nutbag\" Hitler, or the stereotypical \"demon\" Hitler. It showed him as he was, a broken down egomaniac. I will totally buy this movie and add it to my collection, which is rare for me to do these days."
    },
    {
      "username": "engelst",
      "userUrl": "https://www.imdb.com/user/ur0332491",
      "reviewLink": "https://www.imdb.com/review/rw0961147",
      "warningSpoilers": false,
      "date": "12 November 2004",
      "rate": "7",
      "helpful": "448 out of 591 found this helpful.",
      "title": "Distanced and sober view of Hitler's last days",
      "content": "The first 15 minutes made me doubt the qualities of this movie. The situations were a bit forced and the cuts were strange. But after the uncomfortable beginning the movie took momentum and kept it until the end.I think the choice of depicting Hitler as a human being with a dispassionate and modest direction was excellent. The film never tries to force viewers into an opinion. Everybody can form his own opinion. Too often the horrors of WWII led writers and directors to depict Nazis as monsters. Perfectly normal human beings can be cruel and merciless if they are blinded (by hate for example), which should never be forgotten.In a way, a human Hitler to me is more guilty than a raving monster. He had the choice and he chose to do wrong. He could choose life and he chose murder and destruction. A human being lost respect for the life of other human beings and led a country into genocide. Ultimately he loses respect for all life and starts sacrificing his own soldiers at random. This is what I value this film for, making the idea of a human Hitler tangible.It was very brave to make this film, given that controversy was almost certain to arise. One of the highlights of this year, to be sure."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1732127",
      "warningSpoilers": false,
      "date": "18 September 2007",
      "rate": "8",
      "helpful": "15 out of 19 found this helpful.",
      "title": "'Grim' Look At The Nazis' Final Hours",
      "content": "Wow, what a grim movie. How I stuck with this for 155 minutes, I don't know, but it's a fairly involving story once you get into it and you want to see how it's all played out.A main reason I use the word \"grim\" is that there are more scenes with people committing suicide in this movie than all the movies (thousands) I've seen put together. This German movie deals with the last days Of Hitler and the Nazis in Berlin in April of 1945. In the end, most of the people in the film either kill themselves, as mentioned, or execute their loved ones in order to avoid capture by the Russians, who overtook the city. This includes poisoning a group of young children.While not overly gory, some of the scenes are shocking, ones I suspect would linger in anyone's memory..Bruno Ganz as Adolph Hitler was intriguing, to say the least. As an American, I can recall very few, if any, films in which Hitler was shown to this degree with this much dialog. Being such a famous figure in history, it was one of the reasons, frankly, I stayed with the film. I never this man portrayed on film.Alexandra Maria Lara as \"Traudl Junge\" was the bright spot in this dismal story, a beautiful and wholesome-looking woman with an expressive face. She was the only character in the film that I cared about. Everyone else is pretty cold. Junge \"won\" the job as a secretary for Hitler and is pictured as sweet and naive woman...and just one more of the millions of victims of World War II. Victims can be survivors, too, as the story concludes, if for nothing else, for suffering with a guilty conscience for decades.This war movie definitely can be classified as \"different\" and memorable. I doubt if I'd ever watch this again, but it was worth the one viewing, that's for sure."
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw1795043",
      "warningSpoilers": false,
      "date": "6 January 2008",
      "rate": "8",
      "helpful": "27 out of 37 found this helpful.",
      "title": "Compelling But With One Serious Flaw",
      "content": "Watching DER UNTERGANG is something of a unique experience for me . It's not often I'd go out of my way to watch a foreign film , far less one that is often talkative and where the outcome is in no doubt . Even more remarkable is the fact that I sometimes rewatch this movie from start to end unable to take my eyes off screen . The reason ? It's one of the few films where the acting is truly compelling I heard a lot of controversy about DER UNTERGANG as soon as Bruno Ganz had been cast and together with director Oliver Hirschbiegel they both decided to make a film where every minor detail about Hitler's last days should be totally accurate . They succeeded and that's not only my opinion because every professional historian has remarked that Ganz interpretation is the only truly accurate portrayal of Adolph Hitler . You find yourself unable to take your eyes off screen every time Hitler appears . Also of worthy note is Ulrich Matthes as Joseph Goebbles . Note how often Matthes appears on screen where he doesn't have to say a word , his burning presence is enough to hold the audience attention and radiates great evil . It's almost as if the audience have jumped into a time machine and landed in Hitler's bunker in the spring of 1945 . It's so convincing it's almost enough to give you nightmares I would have happily given DER UNTERGANG 10 out of 10 but it loses a couple of points because of a serious problem and that is the way it somehow tries to make out the people of Nazi Germany are also victims of the Nazi regime . Notice the speech by Goebbles where he sneers he's not interested in the suffering of the German civilian population because \" They voted for us and now their throats will be slit \". If you have little knowledge of European history 1939-45 ( I'm afraid such people are becoming more and more numerous as the years pass ) then you'll find yourself asking why don't the Germans just surrender ? It's easily explained by the fact that the Nazi regime murdered million upon millions of people in Eastern Europe and it's payback time as the red army advances into the heart of the Nazi regime . It's also interesting to note that we never see Soviet soldiers raping German women in their thousands . Again if someone with no knowledge of the period would ask why are the Soviets doing that ? And again the answer is simple - Revenge against a country /regime that was responsible for the deaths of almost 15% of the Soviet population . Don't you get the feeling the film wants to avoid awkward questions ? This type of controversy seems to be responsible for Ganz , Matthes , Hirschbiegel and the film itself being very under rewarded at international film festivals which while being slightly understandable does seem wrong . There is no doubt in my mind that Ganz deserved the Oscar for best actor that year since it's the best performance I've ever seen by a non English speaking actor in a movie . If no one discovers time travel then this will be the closest we'll find out what it was like in the days leading up to the death of history's most hated figure"
    },
    {
      "username": "Danusha_Goska",
      "userUrl": "https://www.imdb.com/user/ur2366009",
      "reviewLink": "https://www.imdb.com/review/rw1043040",
      "warningSpoilers": true,
      "date": "20 March 2005",
      "rate": "10",
      "helpful": "13 out of 15 found this helpful.",
      "title": "Yes, You *Should* See \"Downfall\"",
      "content": "You may have reservations about seeing this movie.Maybe, as some critics have implied, the movie \"humanizes\" Hitler and Nazis.Maybe it would be creepy to watch a movie where most of the action takes place in an underground bunker.Maybe you just don't want to go to a foreign language film.Forget your reservations. You need to see this movie, on a big screen, with an audience. It is a masterpiece. I'd rank it with \"Gone with the Wind,\" \"Lawrence of Arabia,\" and \"Saving Private Ryan.\" \"Downfall\" depicts events of world historical importance through the eyes of complex characters and it does so masterfully. \"Downfall\" raises important questions, and it also presents the viewer with a compelling visual epic.Performances are first-rate. Costume design, the recreation of bombed-out Berlin, of air raids, are so realistic that you feel plunged into another world.From the first scene, I was completely immersed in the world of \"Downfall.\" I was moved; at times I cried. On screen characters make unintentionally funny comments, for example, about how they will negotiate with the Americans after the war. More than once, everyone in the theater where I saw the movie laughed out loud.And, I raged.I don't know when I've reacted so strongly to a movie. I'm sure you've seen the press conference where American military show film footage of the newly captured Saddam Hussein to Iraqi journalists. The Iraqis in the audience, seeing the film footage of Hussein, began to curse and shout and shake their fists at the screen. That's how I wanted to react to this movie.Like most people interested in history, I've seen archival film footage of Hitler's speeches, and productions like \"Triumph of the Will.\" That film footage did not prepare me for \"Downfall\"'s painstaking recreation of Nazism. There they are: Himmler, Goering, Goebbels, Speer, and Hitler himself, chatting, eating, planning, going about their day-to-day activities.Their painfully realistic images on screen filled me with rage.Another reviewer here commented on her strong reaction to watching Magda Goebbels murdering her own children so that they don't have to live in a world without National Socialism. That viewer said she wanted to scream at the screen. I felt that way throughout the movie.Are these Nazis human? Yes. Are they sympathetic? I'd be hard pressed to imagine a normal person feeling sympathy for these Nazis. They murder their own children. Hitler is plainly depicted as a twitching failure and a pathetic narcissist who sees even his beloved German people as mere pawns who exist solely to provide greater glory for him.I can't help but compare \"Downfall\" to the \"big\" epic-wanna-be American movies of 2004, from \"The Aviator\" to \"Alexander.\" There is just no comparison. Hollywood, watch out.During, and certainly after, the movie my mind raced. Without being at all preachy, this movie invites you to -- no, demands that you -- think about the hero worship that surrounded Hitler. Why did a nation drop to its knees for this lunatic? Why, during Berlin's final hours, didn't more people read the writing on the wall? By extension, the film invites critique of any national psychosis and hero worship. Why did these people surrender themselves to Hitler? Is there any comparison between the events on the screen and contemporary life? In a brief coda, the real Traudl Junge, Hitler's secretary, attempts to acquit herself by saying, paraphrase, \"Gosh, I was a young, pretty girl, what did I know or care about politics?\" But then she interrogates that stance. \"I could have informed myself. I could have learned something. Being young is no excuse.\" I left the theater thinking not just about fifty years ago, but about today, about my country's involvement in Iraq, and America's largely passive response to that war."
    },
    {
      "username": "joachimokeefe",
      "userUrl": "https://www.imdb.com/user/ur1148847",
      "reviewLink": "https://www.imdb.com/review/rw1901361",
      "warningSpoilers": false,
      "date": "29 June 2008",
      "rate": "10",
      "helpful": "13 out of 15 found this helpful.",
      "title": "'Saving Private Ryan' without the schmaltzy overtones.",
      "content": "You couldn't really expect to make a 'typical' movie out of the story of last days of the archetypal fascist dictator. 'Untergang' seeks to illustrate the situation of 'sane' people under the control of a madman; that and the impending arrival of the Red Army is the only dramatic jeopardy available - no romantic interlude, nothing to achieve, no sentimental buddy rescue shtick. We witness the reactions of people like you and me (and don't be silly enough to imagine I include Goebbels, etc. - I mean people doing their jobs under impending calamity) who happened to be in the wrongest place at the wrongest time. If this dilemma doesn't absorb you, it's a fault of your imagination, not of the utterly brilliant recreation of something very few people survived to bear witness to. 'Untergang' doesn't seek to make a judgment of Hitler because it doesn't need to: all you need to appreciate is his increasing detachment from reality and the way that this divides the people stuck with him. If there's any sort of judgment, it's of the herd mentality of people as a whole. The film becomes a series of stunning docu-vignettes of the various levels of humanity involved, each one posing the question 'What would YOU have done?'. This film is thought-provoking, and that naturally makes many denizens of the internet uncomfortable."
    },
    {
      "username": "theantigaz",
      "userUrl": "https://www.imdb.com/user/ur3861004",
      "reviewLink": "https://www.imdb.com/review/rw1065230",
      "warningSpoilers": false,
      "date": "22 April 2005",
      "rate": "9",
      "helpful": "17 out of 18 found this helpful.",
      "title": "The End",
      "content": "Now here is a novel idea, making a movie from the \"enemy's\" point of view, attaching a human face to probably the most notorious institute of evil in human history. Before watching this film, I had reservations over how much I would enjoy it and what I might gain from it. I was concerned that the film may be an attempt to show the human side of the Nazi party, to make us sympathetic not to their cause, but to their human nature. I had to think to myself, do I really want to attach a human element to people who history has painted as monsters? The film begins with Hitler recruiting Traudl Junge as a new secretary in 1942, from this point onwards the film is predominantly (but not entirely) seen through her eyes. This key scene at the beginning of the film shows how people reacted to their leader with fanatical loyalty, holding him high in reverence. This gives us a brief insight into the belief of his followers that what they were doing would lead them to a golden utopia, a better world. All to often in films concerning Nazi's, they are portrayed as evil personified, killing for killing's sake, being evil for the sake of being evil. What we get throughout this film is a more realistic viewpoint of people's attitudes. The people who followed Hitler may have no entirely agreed with everything he said, may have not hung on his every word, but believed that he would lead them to a greater future, as such they followed.Bruno Ganz, does a magnificent job of playing one of history's most notorious and documented individuals. He plays the role as, what I feel, accurately and realistically as possible. He resists the temptation to play Hitler as an uber-evil super-villain, disregarding all life who opposes him and wiping out humans at a whim. He plays the roles as an ageing leader, loosing grip on his health, his sanity and his conquest. A man who was kind, considerate and caring to children, his dog and his civilian staff, but who also attempted to wipe out an entire race of people and was proud of himself for doing it. It shows a man willing to send young children into the street to resist enemy advancement, it shows a man who believes that the civilian population would not be evacuated, as it was their chance to rise up (women and children, the old and sick, un armed) and prove they deserved victory. This film raises the question, was Hitler an evil man who practised evil deeds through his beliefs? or were his evil deeds a result of his absolute pursuit of his beliefs? Watching Ganz's performance, you get the feeling all Hitler had left before he took his life, was his ideals (not that this is anything to be proud of). He had lost the war, he had lost the respect of several of his commanding officers and he had lost his grip on reality.The film also shows Hitler's closest officers and staff, it shows how they react to the downfall. Some have blind and fanatical faith that Hitler will act as their saviour and devise a scheme to turn the battle around. Some accept that their leader has lost his grip, but follow with blind devotion anyway. Some are not so sure and see the cracks in the beliefs they were fighting for. The film shows these often horrifying moments and realisations in all to realistic detail.Ultimately, Downfall shows the human and personal element of the end of the war for Hitler and the Nazis. It shows how real people, people who tell jokes, drink, socialise, listen to songs and dance, also followed national socialism with a devotion that drove them to do the terrible things they did. It shows how they did not believe what they were doing was wrong, in their minds they were paving the way for their glorious future. It also shows their fanatical devotion and blind faith in their goal, led to their downfall, both as a movement and as human beings.Downfall is an amazing and powerful film, documenting an unseen side of a major historical event. The film ends with video footage of the real Traudl Junge talking about her feelings towards the war and he involvement with the Nazis. She says that when she first became involved with the Nazis, she was in awe of their power and beliefs, she may have not agreed with everything they did, but what difference would her being involved or not make? She was ignorant to their deeds and as such held a clean conscience. Then she says has realised over time she had the power not to be ignorant to their deeds, that she should have stayed away from them, realising them for the evil that they were. I felt she was warning what ignorance can lead to, that no matter how tiny one person is in the scheme of things, it is no excuse to contribute towards the wrong cause.Excellent historical film, highly recommended."
    }
  ],
  "errorMessage": ""
}