{
  "imDbId": "tt0040897",
  "title": "The Treasure of the Sierra Madre",
  "fullTitle": "The Treasure of the Sierra Madre (1948)",
  "type": "Movie",
  "year": "1948",
  "items": [
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw3522851",
      "warningSpoilers": false,
      "date": "10 August 2016",
      "rate": "9",
      "helpful": "38 out of 39 found this helpful.",
      "title": "Just a great movie all around, but a very dark tale",
      "content": "This film is a sharp-edged study of the effects of greed on otherwise normal men, and one man in particular: Bogart's Fred C. Dobbs. Dobbs and Bob Curtin (Tim Holt) are down and out and meet up with prospector Howard (Walter Huston). When Dobbs wins a lottery, he uses the proceeds to finance a trip for the three to central Mexico to search for gold. The three have to deal with the lawlessness of central Mexico at the time - bandits were actually on the loose in that country killing anybody with stuff, and taking that stuff. The Federales were a violent solution to a violent problem - killing the bandits after a summary judgement and the bandits having dug their own graves. So our trio not only have to worry about bandits once they strike gold, they have to worry about the darkness of their own souls. In the beginning, Bogart's Fred C. Dobbs is a decent guy who does not take advantage of others. Dobbs only takes his money from the guy that wouldn't pay and he does share his lottery ticket and is generous with his fellow miners, but as greed begins to take root in him, little by little we see his goodness eaten away. It's a great credit to the writing and Bogart's skills that this is done gradually and played out over time. Incidentally, that's director John Huston \"staking him to a meal\". One of the best director cameos ever (although Polanski in Chinatown is equally great)! Dobbs overestimates himself and the fallibility of human nature. Walter Hustons character freely admits what gold could do to any of them including himself. Dobbs is sure it will never happen to him, but he's never had anything, so he's never faced temptation, and when he falls it's a long way down. This may be Tim Holt's finest performance - it was probably his finest opportunity given he had spent years laboring as a B western star on the RKO lot. Walter Huston as the prospector, minus his dentures and plus a bunch of pounds and with holes in his clothes is not the debonair fellow you are used to seeing in film . If Mary Astor's character in Dodsworth could have thought this was the future appearance of the man she loved, would she have taken her gondola in the other direction? I guess we'll never know.Highly recommended as one of the great character studies in which several characters get studied in detail."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1167935",
      "warningSpoilers": true,
      "date": "8 September 2005",
      "rate": "10",
      "helpful": "66 out of 74 found this helpful.",
      "title": "God Has a Sense of Humor",
      "content": "I think the great lesson of The Treasure of the Sierra Madre is the effect civilization has on the behavior of man. Some people are only as good as they ought to be and the case in point is the guys that go out into the Sierra Madre gold prospecting and how their behavior changes.Dobbs and Curtin a couple of down on their luck Americans stranded in Tampico, Mexico. They meet up with old Howard at a flop house and his tales inspire them to try gold prospecting. The plot of the film is what happens to them when they find the gold they seek.The Treaure of the Sierra Madre is a film years ahead of its time for the stark realism it portrays. These are not classic movie heroes. I could see this film easily being remade today by some of our contemporary stars like Robert DeNiro, Al Pacino, Russell Crowe.It also has probably the most brutal bar fight ever put on film. Before going prospecting, Humphrey Bogart as Dobbs and Tim Holt as Curtin go out on a construction job for Barton MacLane who stiffs them when it comes time to pay up. They catch up with him at a Tampico dive and administer a terrible beating to MacLane. This is not some western saloon fight, this is probably one of the most realistic bar brawls ever filmed. I like to compare this film to The Oxbow Incident. In both cases, stress and a crisis bring out the true characters in people. Tim Holt is a lot like Henry Fonda's character and Bogart would have definitely been found in the ranks of the lynchers.Bogart as Dobbs is probably someone who in civilized society is no better than what he can get away with. His descent into uncontrollable paranoia is frightening on the screen, one of his best performances.Tim Holt who most of the time was content to star in B westerns for RKO shows what a capable player he is. In the flophouse scene look for an unbilled appearance by his father Jack Holt.Walter Huston capped a long career on the screen with the Best Supporting Actor Award for this film which also was the Best Picture of 1948. And son John Huston won his only Oscar for Best Director, making Oscar night a banner occasion for the Huston family. Huston's character of Howard you can see playing sidekick in many a Hollywood western. That would be a superficial impression. Howard turns out to be a wise old man.The ending of what happens to the men and their acquired treasure in the Sierra Made mountains is something else. In a location far from civilization and far from law it's shown that the Almighty does have a wicked sense of humor."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1055342",
      "warningSpoilers": false,
      "date": "6 April 2005",
      "rate": "8",
      "helpful": "132 out of 142 found this helpful.",
      "title": "One of Warner Brother's triumphs of the forties",
      "content": "Having had his day as an idolized star and romantic leading man, it was now time for Bogart to get down to the serious business of acting For eighteen years it had usually been Bogart playing Bogart in various shadings Now that Bogart was gone and in his place was an older and far less romantic figure, one who found new challenges and was able to meet most of them successfully This new phase of his continued growth began with a story of three men in search of gold Although \"The Treasure of the Sierra Madre\" is indisputably one of Bogart's best films, it was co-star Walter Huston who won an Academy Award as did the movie's director and scenarist, John Huston Based on a novel by the mysterious B. Traven, the film told a riveting tale which explored the degenerative effects of encroaching greed, distrust, and hatred on three prospectors who team up to search for gold in Mexico Bogart's Fred C. Dobbs was an amazingly complex creation whose slow disintegration into paranoia was brilliant1y managed on camera He is a born loser with no potential for change in sight Suspicious, unfeeling, savage, and easily corruptible, he seems clearly destined for a tragic fate almost from our first meeting with him Tim Holt was also excellent as Bob Curtin, a man who, like Bogart, is tempted but whose conscience will not permit him to exercise his baser desires. (He could have let Bogart die in a cave-in, but saved him instead.) Young, impressionable, and unprepared, he has never seen the likes of a Fred C. Dobbs and he finds himself overwhelmed and uncertain as to how he will cope with Dobbs's rage and greed However, it is the director's father, Walter Huston, who literally stole the picture from both Bogart and Holt as he played Howard, a wise old toothless codger who knew all along what would happen and took it all in stride, kicking up his heels and having a marvelous time Life can't surprise him any more He's already had successes and failures enough for one lifetime Like a faithful dog, he's along for the thrill of the hunt, and should there be another pot of gold at the end of this rainbow, well, that's just a bonus It is mainly the interaction of these three men from their first meeting and uneasy partnership through their final confrontation that made \"The Treasure of the Sierra Madre\" one of Warner Brothers' triumphs of the forties"
    },
    {
      "username": "jotix100",
      "userUrl": "https://www.imdb.com/user/ur1406078",
      "reviewLink": "https://www.imdb.com/review/rw0039421",
      "warningSpoilers": true,
      "date": "27 June 2004",
      "rate": "10",
      "helpful": "56 out of 63 found this helpful.",
      "title": "All that glitters is \"gone with the wind....\"",
      "content": "John Huston's genius as a director is undeniable. From his beginning he showed an uncanny knack for getting not only excellent acting from his actors, but his movies always had a social conscience as well. Mr. Huston loved Mexico and it shows in this film. It must have been a difficult task for him directing his own father in the movie. After all, Walter Huston was a major star on his own right. Both father and son made a great contribution, John behind the camera, Walter in front of it.Basically the story is about men that have drifted into Mexico to escape jail, or in search of riches, as it was the case of the men that fate brings together in a Tampico shelter. Dobbs, Howard and Curtin start out as partners searching for gold in the Sierra Madre. They find it, but as luck will have it, none of them will live to be rich from what they find in that remote place.In the most ironic of film endings, this one will be a classic. After the trio finds gold, greed sets in. Friendship turns sour and the three friends become enemies. When the bandits finally catch up with an exhausted Dobbs, trying to go north, they beat him up and discover some sacks full of sand....Humphrey Bogart as Dobbs is excellent. Of course, Walter Huston made the best out of Howard, the clever old man who has seen a lot in his life. He is the only one that discovers a happiness living the simple life among the friendly Mexicans that welcome him into their community. Finally, Tim Holt, as Curtin is perfectly cast as an honest man who has gone into the adventure without any expectations.The final sequence of Howard and the peasants riding their horses into the 'yellow dust' is amazing, as it it incredible. In retrospect, it seems to be telling us that sometimes dreams of becoming rich the easy way will not be sustained, but honest work will be more rewarding."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw3155020",
      "warningSpoilers": false,
      "date": "3 January 2015",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "Great Character Actors...and No Stinking Badges",
      "content": "Ever since \"Greed,\" I have loved movies about losers who destroy themselves and others. This is a classic example of the worst of that term as three men try to face off against forces over which they have little control. It's a little like an early \"Deliverance\" where the paranoia and fear and, yes, greed, conspire to take away what could have been quite lucrative. The performances, for me, of Bogart, and particularly Walter Huston, in a smaller role, make this worthwhile. This is the prototype for the Mexican bandito with his grin and his disregard for human life. The confrontation has become the basis for parody. The concluding scene is priceless with Bogart's facial expressions and the utter dismay it produces. So much has been said about this. Enjoy the ride."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2213381",
      "warningSpoilers": false,
      "date": "26 February 2010",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "A great tale about the darker side of human nature...",
      "content": "There are already a lot of reviews for this film and it's in the Top 250 list on IMDb, so I don't feel quite as much need to talk about his film in great depth--after all, it's all been pretty much said. This is an exceptional film for many reasons--most notably because it looks into the darker side of human nature--something you don't often see in films during this era.The film begins in Mexico. Two Americans (Tim Holt and Humphrey Bogart) are stranded there and haven't a peso between them. Their needs are few--they just want to get enough to buy a meal and find a place to flop. Through this first portion of the film, both men seem like decent enough sorts and the audience tends to empathize with them--even when they are involved in a vicious brawl with Barton MacLane--you feel the guy has it coming when the two give him a beating.Later, however, their prospects change when they hit on the idea of hooking up with an old coot (Walter Huston) who seems to know a lot about gold mining. The three take off for the Mexican wilderness--and much like the story \"Heart of Darkness\", the good and bad within them is slowly revealed--all brought about by greed.What I particularly liked about this film is what a great professional Humphrey Bogart was. His character was extremely flawed and later in the film he was very easy to hate. Many stars of the day probably wouldn't have accepted this less role of a less than honorable man. Nor, I think, they would have been so willing to play a guy who wasn't all that macho.Apart from Bogart, the acting all around was very good, the script exciting and insightful and the direction just dandy. One of the best films of the era."
    },
    {
      "username": "thinker1691",
      "userUrl": "https://www.imdb.com/user/ur3902771",
      "reviewLink": "https://www.imdb.com/review/rw1725953",
      "warningSpoilers": false,
      "date": "7 September 2007",
      "rate": "8",
      "helpful": "28 out of 30 found this helpful.",
      "title": "\"If you want somebody NOT to find it, . . . Put it in front of them\"",
      "content": "In the 1920's, labor was hard to find. If you happened to be a laborer, work was almost non existent. Indeed, if you were unemployed and in Mexico, your chances were dismal. Yet, these were the times, which attracted many South of the border. The place was barren, yet many a fortune could spring up directly before you, . . .if you were luckily enough to see it. That is the story behind this incredible film. The legend of El Dorado was only one of the many myths which lured the adventurous to Mexico, another was \"The Treasure of the Sierra Madre.\" The gold of the Mother of Mountains was passed from father to son for generations. Thus when the film adaption was made, it was sure to be sculpted by men of vision. One such man is legendary John Huston who directed this film. Three common men are lured by the promise of discovering a lost treasure. The first is Fred C. Dobbs (Humphrey Bogart) a nice enough guy who wants only to be fair, but is hungry to 'strike it rich.' The second is Howard, (Walter Huston) as honest as you expect him to be and a man of considerable experience. The last is Bob Curtin (Tim Holt) who if given a chance, will use it. The trio make a PAC to share and share alike all the treasure they find. However, only Howard is aware of what the possession of Gold can do to a man. To find the treasure, they need the mountain, some hard work, a little luck. To bring it home, will require something only one of them possesses. The film is a Classic and is due to the combined talents of all the stars and the director. If you look closely, you'll see Robert Blake (Barreta) and John Huston in brief roles. ****"
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw0039409",
      "warningSpoilers": true,
      "date": "20 November 2003",
      "rate": "10",
      "helpful": "84 out of 108 found this helpful.",
      "title": "Unbeatable.",
      "content": "I wish I knew who B. Traven was. He wrote the novel this film is based on, and it's a good read. There are stories that he was a German. Maybe he was. The dialogue has little German touches in it. Traven surely lived in modest circumstances in Mexico, the details and dynamics of run-down hotels being far too accurate to have been made up in a comfortable armchair.But it's not really important. Huston and his cast and crew have turned the novel into a movie that is as good as anything likely to show up on the screen. It's an astounding achievement. I can't even begin to list the moments that stamp themselves indelibly into one's memory, but I will mention one, just en passant, so to speak. After killing his partner and friend, Bogart lies down next to a fire and tries to go to sleep. He talks to himself dismissively about \"conscience\" and how it only bothers you if you let it, and the fake, sulfurous fire blazes up higher and higher between the actor and the camera until he seems to be consumed by the flame.Alfonso Bedoya. He made a few other movies but nothing resembling this one. What lines he is given! \"Aww, come on. Throw that old iron over here.\"\"There's a good business for Jew.\" And the unforgettable \"batches,\"which doesn't need repeating.It is surely one of Huston's best films. A lesser director could have ruined the novel's plot. But Huston adds his own touches. Cody is killed, shot through the neck, and the old man reads a letter from his wife, retrieved from Cody's pocket. But -- he doesn't know how to read big words!So Curtin takes the letter and reads it. It's not just a directorial flash in the pan, because the scene resonates at the end of the movie when Curtin rides off to meet Cody's wife in the blossom-blooming peach orchard. What I mean is that the letter-reading scene is there for a larger purpose than simply adding to our appreciation of the characters at that particular moment. The fight with Pat in the cantina. Absolutely nothing happens the way it had always happened in previous movies. Huston stages it in a way that an artist would think of. In all movies before this one, fights involved (1) a general melee in which no one wins or loses, or (2) one clip on the jaw and the guy is unconscious. Here, MacCormack, the heavy, done very nicely by Barton Maclaine, abruptly bashes one guy over the head with a bottle of booze and socks the other one. Both victims crumple. But somebody grabs Pat's legs as he walks towards the door. More blows. Bodies slump to the floor and they have a hell of a time getting back up on their feet. More blows. Pat is finally beaten to the floor and he's not unconscious. \"Okay. Enough, fellas. I'm beat. I can't see.\" Bogart and Tim Holt take only the money that is owing to them, and Curtin (Holt) comes up with, \"Let's beat it before the law arrives.\" Before the law arrives. That's straight out of Traven's novel and is one of the reasons people believe he wasn't that familiar with the English language. Not that it doesn't fit -- but the use of \"arrives\" is just a tad formal.I could go on listing one scene after another that is simply outstanding. I watched this repeatedly with my ten year old kid, Josh, who finally memorized almost every word of the script. I showed it in classes in psychology at Camp Lejeune in North Carolina as an almost flawless depiction of an ego defense mechanism called \"projection.\" The Marines loved it. I loved it. My kid loved it. John Simon loved it. Rush Limbaugh loved it. Martha Stewart loved it. Rachel Maddow loved it. Napoleon Bonaparte loved it. Moses loved it. Lenin loved it. St. Peter, when not attending the pearly gates, watches it on cable TV. (No commercials.) Everybody loves it -- and for good reasons."
    },
    {
      "username": "yenlo",
      "userUrl": "https://www.imdb.com/user/ur0313186",
      "reviewLink": "https://www.imdb.com/review/rw0039388",
      "warningSpoilers": false,
      "date": "5 May 1999",
      "rate": "9",
      "helpful": "52 out of 56 found this helpful.",
      "title": "A treasure presented to the viewer",
      "content": "Some movies have certain scenes in them that hold the viewers interest more than others. However every single scene in this film holds the viewers interest. There is never a dull or lagging moment. Three down and outers who at one time in their lives were maybe up and comers strike out in search of a fortune or at least enough to live better than they have been.While Humphrey Bogart gives a superb performance it is Walter Huston who turns in the greatest performance as the old prospector Howard. The scene in the Indian village where he helps to restore a comatose child is one of the most touching in all of film history and is done virtually without any dialog. Mexican character actor Alfonso Bedoya of course steals all the scenes he appears in and delivers his classic \"Stinking Badges\" line. (what person would dress up as a Bandito for a costume party and not want to look exactly like Bedoya's Gold Hat character?) This film probably should have been a little higher on AFI's top 100. A must see!"
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw2460253",
      "warningSpoilers": true,
      "date": "17 July 2011",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "\"The Treasure\" of American Cinema ...",
      "content": "A brutal and uncompromising portrayal of greed's effects on the human spirit and an exhilarating quest of the Mexican El Dorado, the Treasure of the Sierra Madre. You'll be thrilled by John Huston's masterpiece, a genuine monument that would catch by surprise, even the most skeptical viewers when it comes to 'old' movies.The \"Sierra Madre\" was the first major studios films set outside Hollywood, in Mexico, when even the most acclaimed masterpieces didn't raise such a level of authenticity in their exotic setting, like in \"Casablanca\" when Captain Renault refers to the titular town as the middle of the desert. The geography in Huston's film is crucial as it provides the obligatory escapism for any adventure film, with a unique flavor. In \"Sierra Madre\" we get the same authentic feeling that probably inspired Clouzot's \"Wages of Fear\", with the proverbial financial struggle of the white men in South America. There's almost the same criticism of capitalism that prevailed in B. Travel's novel, as these men have been purely and totally exploited by the capitalistic majors that literally raped Mexico from its precious resources.Huston's movie is less politically loaded, but it portrayed capitalism in a negative light through the downfall and total disintegration of its main character, Humphrey Bogart as Fred C. Dobbs. Bogie, after having been a gangster, a private eye, a cynical, detached, and sometimes romantic lead, probably gives one of his best performances as a big s.o.b. And how he didn't get a nomination is unbelievable. His evolution from a decent man who wants a job and some money to the cold-blooded paranoid lunatic who tries to keep the gold for himself is not only fascinating but also mirrors the evolution of the film from a light-hearted mood, made of some comedic running gags like the encounters with Huston as the rich man in a white suit, to a heart-pounding thriller.And on that very level, the differences between the characters set the perfect circumstances for tension, despite the many signs of camaraderie displayed in the beginning. Curtin, Tim Holt in a remarkable performance, is younger and exudes a certain idealistic naiveté that counterbalances Dobbs' growing cynicism. Howard, the old-time prospector, an unforgettable Walter Huston, knows everything about prospecting, with enough experience to foresee the psychological changes on people when gold is at stakes. Of course, the movie is also remembered for the famous 'Gold Hat', Alfonso Bedoya with his unforgettable \"stinking badges\" line but more than an exotic villain, Bedoya foreshadows with a sort of charming charisma the evolution of Dobbs as a similar bastard.Indeed, one never knows how gold would transform us, and one must have the guts to work alone without falling into madness. During their journey guided by Howard, Dobbs and Curtin discover the true meaning of the word 'value' as measurable through the efforts you spend, days and nights, to find the treasure. Walter Huston deservedly won the Oscar for best supporting character, but he's as central as Vito Corleone in \"The Godfather\". Whatever Howard says, we know it's the truth, when he's reluctant, we understand it's a bad premonition. And when Howard esteems that the best would be to split the share when it becomes money, Dobbs, already showing signs of suspicion, recommends that each one takes care of his own share. Howard is experimented enough to resign, with all the wisdom of a man who doesn't want trouble.Dobbs' gradual descent into paranoid madness is highlighted in the episode when a gila monster gets stuck under the rock that covered his share while he suspects Curtin to have come for another reason. The paranoia grows and contaminates the whole team when another American named Cody, joins them and proposes his help. He's obviously smarter than them and doesn't deny that murdering him is an option they would consider. The way the team handled his proposal says a lot about the conservative instinct that could govern so called 'civilized' hearts, and again, doesn't speak in favor of the monopolistic systems regulated by capitalism. The alienation that grows within the team erodes all the camaraderie built during these months of labor, to a point even the word 'partner' loses its humanistic meaning.Bogart perfectly embodied the metamorphosis of a man alienated by his own greed, where the value of his share of gold, exceeded, every kind of principle that made him a decent man. As it's almost impossible to break free from a gila's bite, Dobbs became that gila with paranoia as a venomous poison, too mistrustful to go, to let go or to be reasoned. When Curtin says he protected Howard's money as he would have done for Dobbs, Dobbs uses the same reasoning in a reverse way, pushing cynicism to its paroxysm : betraying before being betrayed. And in an ironic anticlimactic twist, Dobbs is killed by bandits, 15 minutes before the end of the film as to highlight the pointlessness of this entire struggle. After all, what's the point of earning money if you lose principles? Failure is a recurrent theme in Huston's films with this double dimension of cynical denunciation, generally driven by an impeccable script, and this entertaining dimension that pleases the crowds as much as the more sophisticated audience, both who, matured enough by World War II, accepted a story about greed and deception, but maybe not Bogie so far from his usual character, playing such an unsavory bastard. I don't know, if like some said, this is why the film's flopped. One thing for sure, after 60 years, it remains as one of the most enduring classics ever, that beautifully earned a father and a son three deserved Oscars.And any other consideration is as pointless as crying over the loss of the Treasure of the Sierra Madre, and the only reaction it deserves is the unique loud and hysterical, jig-driven, maniacal laugh of Walter Huston"
    },
    {
      "username": "Steffi_P",
      "userUrl": "https://www.imdb.com/user/ur3063013",
      "reviewLink": "https://www.imdb.com/review/rw1728880",
      "warningSpoilers": false,
      "date": "12 September 2007",
      "rate": "8",
      "helpful": "23 out of 25 found this helpful.",
      "title": "\"It's a great joke played on us by the lord, fate, nature or whatever\"",
      "content": "Film noir takes a Mexican holiday in this gritty adventure from John Huston. Pessimistic and full of irony, yet with a sense of adventure and a moralist edge to it, this is typical Huston material.Huston insisted on shooting on location in Mexico, which riled up studio executives no end, but it paid off in the quality of the picture. Treasure of the Sierra Madre would have really suffered in the canned air of a studio. By using the real thing, he perfectly achieves the stark and dusty atmosphere of the poverty riddled Mexican city in the earliest scenes. The sense of scale and grandeur of the mountains in the main part of the film is also very important in achieving the right effect.Huston's background was in fine art, and it's at this point in his career as a director that it really starts to show. The use of lighting is painterly in a way that is almost impossible to achieve in black and white  particularly in the scene in the peasant village which looks almost biblical. Huston also has this unique style of framing, whereby he uses figures in the foreground and background to give the effect of a close-up and a mid-shot simultaneously. It's a look that is totally at odds with anything else produced in Hollywood at that time.Actor wise, Treasure of the Sierra Madre turns the clock back to the 1930s, putting the director's father Walter Huston in a starring role, and casting Humphrey Bogart as a seedy villain. The cast is rounded off by the too-little-seen Tim Holt. All three of them are spot on. The spry old prospector is a role Huston senior seems to have been waiting to play all his life. Bogart is also great playing the sort of character he made his name with a decade earlier. Also worth a mention is Mexican actor Alfonso Bedoya who gives what is for this era an incredibly naturalistic performance as the bandit leader.Huston's forte was in his cinematography, his shot composition and the rhythm of his films, not so much in his handling of action or actors, which is why his pictures tend to be a bit hit and miss. This one is a hit though, thanks to the strength of its story and the quality of the cast, not to mention Huston's persistence for authenticity. Not my absolute favourite of his work, but certainly one of the best."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw3013677",
      "warningSpoilers": false,
      "date": "11 May 2014",
      "rate": "8",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Extraordinary and marvelously performed film about a grizzled hustler decides to join with other prospectors to find gold",
      "content": "Magnificent rendition of B. Traven's story of ambition and human nature at its worst and dealing with an unlikely trio of ambitious prospectors . As Fred Dobbs (Humphrey Bogart) and Bob Curtin (Tim Holt) , two Americans searching for work in Mexico, convince an old prospector (Walter Huston) to help them mine for gold in the Sierra Madre Mountains . Through a lot of troubles they eventually succeed in finding gold, but greedy outlaws (Alfonso Bedoya) , and most especially craziness lead to disaster . As they sold their souls for the treasure of the Sierra Madre . It's an intelligent semi-western that scrutinizes the greed and paranoia that afflicts a misfit group , including their enormous difficulties and breathtaking taking on between protagonists and the Mexican enemies that stalk to them . The film blends thrills , emotion , intrigue , high body-count and it's fast moving and exciting ; being filmed in Mexico, though Warners' studio head Jack L. Warner had the unit return to Hollywood when the budget started to exceed $3 million . Thought-provoking screenplay by the same Huston , concerning about greed and ambition that threaten to turn their success into disaster . Director John Huston had read the book by B. Traven in 1936 and had always thought the material would make a great movie . Based on a 19th-century ballad by a German poet , Traven's book reminded Huston of his own adventures in the Mexican cavalry . When Huston became a director at Warner Bros. , the smashing success of his initial effort, The Maltese Falcon (1941), gave him the clout to ask to write and direct the project, for which Warner Bros had previously secured the movie rights . Although by many to be director John Huston's finest film , this is a tale of fear , greed and murder , as three partners fall out over the gold they have clawed out of the inhospitable and bandit-ridden deserts and mountains . It also has probably the most brutal gold bar fight ever put on film along with \"The Ruthless Four\" . Overrated by some reviewers , but very interesting and attractive to watch . It above all things mostly also remains a real characters movie, in which the three main roles are the essentials . Their dynamic together is also great and is what mostly keeps this movie going . They are three totally different characters, which is the foremost reason why they work out so great together on film . Bogart is superbly believable and gives a nice portrait of an increasingly unhinged prospector , Walter Huston is very good as a cunning veteran and Tim Holt is also pretty well . John Huston has a cameo as an American tourist , this scene was directed by Humphrey Bogart, who took malicious pleasure on his director by making him perform the scene over and over again. And the little boy who sells Bogart the portion of the winning lottery ticket is Robert Blake . The bum seated near Walter Huston in the first scene in the Oso Negro flophouse is Jack Holt, father of Tim Holt . Walter Huston, father of director John Huston, won the Academy Award for best supporting actor , John won for best direction . This was the first father/son win . The musician Max Steiner composes a vibrant soundtrack and well conducted ; including a catching leitmotif and considered to be one of the best . Atmospheric scenario with barren outdoors , dirty landscapes under sunny exteriors and a glimmer sun and fine sets with striking cinematography by Ted McCord , this was one of the first American films to be made almost entirely on location outside the USA . Also shown in computer-colored version . The picture was shot on location in Tampico, Mexico ; just as John Huston was starting to shoot scenes in, the production was shut down inexplicably by the local government ; it turns out that a local newspaper printed a false story that accused the filmmakers of making a production that was unflattering to Mexico . Fortunately, two of Huston's associates, Diego Rivera and Miguel Covarrubias, went to bat for the director with the President of Mexico , then the libelous accusations were dropped . The motion picture was stunningly realized by John Huston and the film took 5-1/2 months to shoot and was 29 days over schedule ; Robert Rossen submitted at least nine drafts of rewrites on the screenplay when John Huston was away during the war . Rating : Above average . Well worth watching , essential and indispensable seeing . In 2007: The American Film Institute ranked this as the #38 Greatest Movie of All Time."
    },
    {
      "username": "secondtake",
      "userUrl": "https://www.imdb.com/user/ur20961309",
      "reviewLink": "https://www.imdb.com/review/rw2821430",
      "warningSpoilers": false,
      "date": "28 June 2013",
      "rate": "9",
      "helpful": "9 out of 9 found this helpful.",
      "title": "Still vivid, compact, colorful, and intense, with some acting to, uh, die for.",
      "content": "The Treasure of the Sierra Madre (1948)This is a weirdly contemporary film. I mean, it's certainly set in the past, and it's made in the heyday of Hollywood genius top to bottom which is long gone. But because it's about this old time and about raw black and white issues (often), the film and the filming are really appropriate. The whole thing just fits, and beautifully.And I mean beautiful. As rugged as it all is--the landscape as well as the beards, all very real--the movie is lyrically filmed. The story is told with visual clarity. And the script, speaking of story, is sophisticated and believable. In all, under the direction of legend John Huston, this is a spot on terrific movie.Of course, there are two actors who are just amazing in their roles (and a third, Tim Holt, who is just fine, if not stellar). I mean of course Walter Huston, who nearly steals the show in every scene. He's a character, but not a caricature. His wisdom--real wisdom, based on smart observation over decades of experience--is sterling. Great stuff, well put. And of course he's the father of the director, which is a fun, and slightly Freudian twist. He gives one of the great performances of the decade.Humphrey Bogart is not far behind, actually. If you like him in Maltese Falcon or Casablanca, you'll be surprised at first by the scruffy, raw character played here. But it's clear-headed, brilliantly delivered Bogart all the way, and a joy to watch him really act. See it for him, too.Then there is the story itself, which is as important now as ever. That is, what matters in life? And what is the price to pay to get it? It's all rather bold and emotional even though it's delivered by some rough guys out of money prospecting in the wilderness of Mexico.Are there downsides here? I suppose. You certainly can wonder about the way the Mexicans--good ones and banditos both--are portrayed. I think it's not bad, tinged with clichés, of course, but in Spanish without translation or stilted half-English, so it's the real thing. And no subtitles. Nicely done for an early Hollywood affair. Huston, the son, the director, if you don't know, is famous for doing things raw and right and slightly off the charts. He is making a commercial film, to be sure, but it has many small aspects that are just not pandering to anyone. This makes it work.I'm sure to some this is a masterpiece. I'm giving that some thought. See it."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw0039418",
      "warningSpoilers": false,
      "date": "1 June 2004",
      "rate": "10",
      "helpful": "30 out of 39 found this helpful.",
      "title": "A Tale of Greed, With Outstanding Direction and Performance of the Cast",
      "content": "In 1925, in Mexico, Fred C. Dobbs (Humphrey Bogart) is an American begging for food and trying to get any job. He meets Bob Curtin (Tim Holt), another American in horrible economical situation and also looking for job, and the former gold prospector Howard (Walter Huston), and together they go to the Mexican mountains seek for gold. After ten months of hard and tense work, including confrontation with bandits, each one of them gets a small fortune in gold. Meanwhile, their personalities are disclosed, and Dobbs shows himself a man obsessed by greed. The end of their journey is ironic and tragic. This movie is a masterpiece. Having an outstanding direction of John Huston, an astounding performance of Humphrey Bogart, Walter Huston and Tim Holt and supported by a fantastic screenplay, it is certainly one of the best movies ever, highly recommended for any audience. Walter Huston and Humphrey Bogart are really stupendous in their roles. My vote is ten.Title (Brazil): `O Tesouro de Sierra Madre' (`The Treasure of the Sierra Madre')"
    },
    {
      "username": "gavin6942",
      "userUrl": "https://www.imdb.com/user/ur1234929",
      "reviewLink": "https://www.imdb.com/review/rw2213042",
      "warningSpoilers": false,
      "date": "25 February 2010",
      "rate": "8",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Bogart and the Stinking Badges",
      "content": "Two penniless Americans (Humphrey Bogart and Tim Holt) during the 1920s in Mexico join with an old-timer (Walter Huston, the director's father) to prospect for gold. The old-timer accurately predicts trouble, but is willing to go anyway. The film is fictional, but presents a very realistic scenario: By the 1920s the violence of the Mexican Revolution had largely subsided, although scattered gangs of bandits continued to terrorize the countryside. The newly established post-revolution government relied on the effective, but ruthless, Federal Police, commonly known as the Federales, to patrol remote areas and dispose of the bandits. Foreigners, like the three American prospectors, were at very real risk of being killed by the bandits if their paths crossed. The bandits, likewise, were given little more than a \"last cigarette\" by the army units after capture, even having to dig their own graves first.The film shows the Americans doing just about anything for money: drilling oil, digging for gold, begging and more. And once gold comes into the picture, the men who once claimed they were not greedy see things differently. Bogart actually goes mad, after he gets greedy and paranoid... during which he encounters a gila monster! The most memorable scene of this film involves the bandits, who don't need any \"stinking badges\". While the line is much more quotable in \"Blazing Saddles\", we couldn't have \"Blazing Saddles\" (or \"UHF\") without this film... just about everyone, even those who never saw or heard of \"Sierra Madre\", knows the badges line.Humphrey Bogart's best film is probably \"Casablanca\", but this one features him in a nice, rough exterior. Yes, sometimes leading men have beards and are covered in dirt. Pretty boys do not stay pretty boys after digging in the hills, or at least that wouldn't be realistic. This film does a fine job trying to \"keep it real\", so we have to commend Huston not only on his directing, but his wonderful location scouting."
    },
    {
      "username": "ksdilauri",
      "userUrl": "https://www.imdb.com/user/ur45868202",
      "reviewLink": "https://www.imdb.com/review/rw4518405",
      "warningSpoilers": false,
      "date": "18 December 2018",
      "rate": "10",
      "helpful": "28 out of 30 found this helpful.",
      "title": "'Sierra Madre's' gold wasn't the only thing Bogart didn't get.",
      "content": "The only thing I have to add to the many well-written reviews here is this: it's astounding that Bogart wasn't nominated in the Academy Awards' Best Actor category. Sure, he had his share of nods in other years, but his portrayal of the complex Dobbs is unique. Watch this classic-for many reasons-and see if Bogie's performance isn't Oscar-worthy."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2262400",
      "warningSpoilers": false,
      "date": "10 June 2010",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Yet another brilliant film from John Huston",
      "content": "I love John Huston's films, and this is another one of my favourites. For one thing it is very well made, with wonderful cinematography and striking locations, and the story which is like a fable on greed and human despair as well as a fun search for gold in bandit-infested Mexico is very exciting. Max Steiner's score is superb, the screenplay is crisp and the direction from John Huston is rock solid. The acting is simply great, and that's an understatement with Humphrey Bogart giving another memorable performance as the drifter Fred C. Dobbs. And he is superbly supported by Tim Holt who plays a young idealist and especially Walter Huston as the gnarled prospector. Overall, just another brilliant film from a terrific director, with a superb opening and unforgettable ending. 10/10 Bethany Cox"
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw4039448",
      "warningSpoilers": false,
      "date": "21 January 2018",
      "rate": "9",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Bogart n Huston nailed it. One of my fav movie of all time, depicting human nature in an interesting way.",
      "content": "I first saw this in the early 90s. Revisited it recently on a blu-ray. Treasure of the Sierra Madre is one of my favourite n in my opinion Bogart's best acting display. Searching for gold has always been a popular film topic n this film has really nailed it with superb display of human nature. Bogart is phenomenal in this film. In this film he is so full of paranoia, insanity n evil but u still feel pity for him. His grungy, unkempt n unshaven look added to the character. The film has a dark tone dealing with human nature of greed, paranoia, evil intentions, insanity n ignorance but it has its share of laughs. Walter Huston's happy dance, Bogart's evil smile, Holt showing equanimity in adversity n Alfonso Bedoyas ignorant n illiterate attitude. The scene, where the character of Holt wondering whether to help his fellow colleague trapped inside the mine n his sympathy towards the widow's share of gold as well his infatuation with the widow by jus looking at the photo r all dealt very well in the film. The scene where the three characters are ready to kill the fourth one is indeed man's darkest nature.A remake is needed with more focus on the action n adventure."
    },
    {
      "username": "Coventry",
      "userUrl": "https://www.imdb.com/user/ur2020269",
      "reviewLink": "https://www.imdb.com/review/rw6246473",
      "warningSpoilers": false,
      "date": "8 November 2020",
      "rate": "8",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Man. The most dangerous enemy known to ... man!",
      "content": "I don't usually comment on non-horror cinematic landmarks, because it honestly isn't my area of expertise, and because - usually - everything that can and needs to be said about the films in question has already been published before. That's definitely also the case for John Huston's \"The Treasure of Sierra Madre\", so I'll try to keep the review brief. In the past four years (2016 - 2020), I often heard the phrase \"Make America great again\". Well, you know what would really help to accomplish this? Make great American movies again, like this one! It's a bona fide movie-monument from start to finish, with a compelling script, breath-taking locations, superb cinematography & music, and of course the stellar performances. Director/co-scripter John Huston and legendary lead actor Humphrey Bogart deserve our endless respect for their stubbornness, perseverance and bravery to have Bogart appear in such an atypical role for his status. Especially after his polished roles in films like \"Casablanca\", \"The Big Sleep\" and \"To Have and Have Not\", it must have been quite a shock for audiences to accept Bogart as a cold and cruel villain. Well actually, he isn't really a villain. Bogart depicts an initially sympathetic drifter who undergoes a transformation into a ruthless scoundrel due to greed and paranoia caused by \"gold diggers' fever\". And his performance is genius, as are those of Tim Holt and Walter Huston."
    },
    {
      "username": "TheAnimalMother",
      "userUrl": "https://www.imdb.com/user/ur18519281",
      "reviewLink": "https://www.imdb.com/review/rw2151074",
      "warningSpoilers": true,
      "date": "2 November 2009",
      "rate": "10",
      "helpful": "17 out of 18 found this helpful.",
      "title": "Artistic Gold!!!",
      "content": "Let me start by saying that this is easily one of the top 5 pre-1950 films in existence. No doubt about that in my mind. Not only that, but it is easily one of the greatest films ever made after 1950 as well.To me, this film in the end plays as a dark comedy. A dark comedy that pokes its fun at the greedy devil within the minds of men.The thing that stands out to me the most about this film is the writing. The Oscar winning screenplay is in my view still under-appreciated. This film's writing is totally devoid of any prejudice at all, and has a depth that almost every other film can only dream to have. A truly amazing work.I could go on and on about this film, but I will just end by saying that as a story, and as a film, The Treasure Of Sierra Madre will stand as an artistic landmark for all of human history.10/10."
    },
    {
      "username": "JoeKarlosi",
      "userUrl": "https://www.imdb.com/user/ur3441650",
      "reviewLink": "https://www.imdb.com/review/rw0039420",
      "warningSpoilers": false,
      "date": "14 June 2004",
      "rate": "7",
      "helpful": "7 out of 7 found this helpful.",
      "title": "The Treasure of the Sierra Madre (1948) ***",
      "content": "Okay, I've finally watched THE TREASURE OF THE SIERRA MADRE, and I found it to be one of those tough films to comment on, perhaps due to its very excellent reputation. I found Bogart to be very good in the movie, and I also enjoyed Walter Huston's performance and could see how he earned his award. The earlier scenes of the movie - before the men ventured out on their search for gold - actually impressed me more than the main parts of the film did. The classic moments where Dobbs is asking John Huston for a hand out again and again; bitching at the pesty little kid (Robert Blake!); beating the hell out of his \"boss\" when he tries to pull a fast one. These were my favorite scenes.Once the trio of buddies is out in the heat, prospecting for their gold, I have to say that while the tension and acting was very good, I just guess I had a hard time both accepting and believing that Bogart could actually go THAT nuts, and wind up turning against his friends like that. Paranoia and greed is one thing, but it just didn't sit right with me for this character of Dobbs - especially after we'd seen what a fair guy he is back when he only took his share of the salary instead of grabbing the whole wad of bills from his beaten \"employer\" (then again, I'm sure the turnabout was supposed to be the idea). It just didn't ring true for me that he could do what he did to his pal. I understand that it was the desert heat getting the best of him, and especially the gold working its ugly spell as the \"root of all evil,\" but it just hit me as improbable and excessive that things would or could go to THAT much of an extreme. Dobbs became a man possessed, and the effect was often more farcial than it was intense.I think director John Huston turned in a fine piece of cinematic work, and for technicality and acting (more than content) I did like this film enough to give it *** out of ****. I thought Bogart gave a very good performance, albeit one that I didn't really want to see happen to his character and one which I had a hard time swallowing actually could. I wouldn't be against seeing it again and re-evaluating it further, somewhere down the line."
    },
    {
      "username": "byght",
      "userUrl": "https://www.imdb.com/user/ur2059044",
      "reviewLink": "https://www.imdb.com/review/rw0039419",
      "warningSpoilers": false,
      "date": "3 June 2004",
      "rate": "",
      "helpful": "93 out of 109 found this helpful.",
      "title": "Truly something special",
      "content": "This film made a huge impression on me when I first saw it at the age of 15 or 16. A recent rewatching on DVD really served to bring home for me what makes this film so special.The whole thing is quite good, but it really hits you when Howard goes off to celebrate with the Indians, leaving Dobbs and Curtin to care for his gold and burros. The ensuing scenes of their spiraling mistrust and tension are absolutely spellbinding--the kind of thing that makes you lean forward in your seat just to get your eyes a little closer to the raw humanity unfolding in front of you. Their paranoia, the way you can SEE scenarios of betrayal dancing in their eyes, Dobbs' burgeoning madness--these are the moments that make this film one for the ages.At its best, film noir (which this most certainly is--Western surroundings or no) makes the viewer complicit in the evil depicted on screen. We find ourselves scheming and plotting in our heads along with the unsavory characters we are watching--we start to feel the same temptations and desires that they do. \"Treasure of the Sierra Madre\" accomplishes this bond with the audience as well as any film you are likely to see.A magnificent film--one of the few great screen tragedies."
    },
    {
      "username": "sddavis63",
      "userUrl": "https://www.imdb.com/user/ur0650255",
      "reviewLink": "https://www.imdb.com/review/rw2149426",
      "warningSpoilers": false,
      "date": "30 October 2009",
      "rate": "8",
      "helpful": "5 out of 5 found this helpful.",
      "title": "A Powerful Statement About The Power Of Greed",
      "content": "With its obvious warning about the consequences of greed, this film is surprisingly relevant today. True, we no longer suffer from the classic problem of \"gold fever.\" Not many people go out free-lance prospecting anymore, but corporate greed is certainly much in the news and the economic collapse of late 2008 had at least partly at its root the problem of greed. This wonderful classic uses a more traditional setting, but manages to portray the same collapse of civilized behaviour and the problems that arise with simply looking out for Number 1. In this movie, that position is clearly held by Humphrey Bogart's Fred Dobbs, an American drifter in Mexico who hooks up with fellow drifter Curtin (Tim Holt) and \"old-timer\" Howard (Walter Huston). Together they decide to strike out into the mountains in search of gold, in spite of Howard's warnings about what riches can do to people - and gold they find.The three characters each seem to represent a different aspect of human nature. Howard is past the age of being too concerned with wealth, and seems to treat this more as an adventure, Curtin is the honest one who wants to make sure that everyone gets treated fairly, and Dobbs is the one who catches \"gold fever\" and becomes increasingly greedy and unbalanced as he contemplates the wealth he can now posses. Bogart's portrayal of the man gradually losing his grip was brilliant, and of the movies I've seen him in I'd rank this near \"Casablanca\" as his best performance. Director John Huston made excellent use of the setting and developed the story nicely, with Dobbs and Curtin starting the movie as victims of dishonest greed, before having to deal with the temptation themselves. There's also some pretty good actions with local bandits. In the end, Dobbs' decision to give into greed robs them all of the wealth they thought would be theirs, and their reactions to their loss of everything were perfectly in character, Dobbs being murdered by the bandits, Curtin realizing that he really hasn't lost anything, while Howard, thanks to an encounter with some local Indians, discovers more than he could ever have hoped for if he had simply kept his gold.An altogether wonderful couple of hours. 8/10"
    },
    {
      "username": "edwagreen",
      "userUrl": "https://www.imdb.com/user/ur2542703",
      "reviewLink": "https://www.imdb.com/review/rw2348247",
      "warningSpoilers": false,
      "date": "4 December 2010",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "This is A Real Treasure from the Sierre Madre ****",
      "content": "Outstanding film with superb direction from the Oscar winner John Huston. His dad, Walter, gave a gem of a performance as the wise, elderly prospector, and he was rewarded accordingly with a best supporting Oscar for this role.The picture should have won for best film but lost to the very dull \"Hamlet.\" I guess that Hollywood wanted to show how cultured they were.The picture is phenomenal because it shows the poison of greed in our lives. Humphrey Bogart gave a brilliant performance as the greedy prospector, who literally cracks up during his quest for gold. Cheated himself by an unworthy employee earlier in the film,Bogart was at his best, especially in the scenes where he is talking to himself.Irony is used beautifully here to show that greediness cannot triumph. Bruce Bennett, Huston and Tim Holt are in fine form as the prospectors who are decent men and can withstand adversity and cruelty from others.Truly a gem of a film."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1550249",
      "warningSpoilers": false,
      "date": "20 December 2006",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "the Hustons and Bogart in a perennial story of money being the root of all evils- even in good men",
      "content": "Fred Dobbs doesn't have a nickel to his name, at least when he's in the small Mexican village at the start of the Treasure of the Sierra Madre. But whatever the situation is, he wants what he can get, and if anyone tries to get in his way he'll let em have it. We see this early one when he and Bob Curtain have to beat it out of a sleazy boss at a construction site to get their earned wages. It's then no surprise that the two of them find it the best idea to take on Howard, an old seemingly-by-gone codger who once was a great prospector, on their ideal trip to look for gold in the mountains of Mexico. But then we start to see a kind of psychological head-trip go on with Dobbs, which makes the Treasure of the Sierra Madre that much more special of a film. The main characters aren't against any very dangerous adversaries- aside from the bandits- and it's not Cowboys and Indians. In fact, getting all the gold together isn't even the climax of the picture, which is usually where one might think a conventional picture would take this story. But John Huston, the director, has none of that here. In 'Sierra Madre', Dobbs becomes the \"bad guy\", but it's hard exactly to call him one. I'm almost reminded of Crime & Punishment, the Dostoyevsky novel, where the morality is very blurred and the character becomes a fragmented version of himself (not to mention trying to reason out in a lack of inner monologue, as Dobbs rambles to himself), and as Dobbs tries to make out with the gold on his own, he meets an end that any lessor Hollywood picture wouldn't dream of going to. That Dobbs then is played by Humphrey Bogart adds, at first, to the initial confusion of the moviegoer. This isn't how it usually happens, is it, least of which since Bogart started playing \"good guy\" roles. But Huston knows, as well as Bogart does- who may be in a true career highlight here alongside In a Lonely Place- that a character shouldn't be just one thing. Even Howard isn't just a kind-hearted old fella, even as he is that to a large extent (he even admits that he might have been tempted to take the money too, had he been younger). And in a sense Dobbs, through Bogart, is a bittersweet reminder of the American dream, where all one really wants is enough money to get by- but then how much can really be enough? Huston is brilliant in building on Dobbs's character, as is Bogart in showing little by little how his generous and genial personality gets stripped away when paranoia and fear settles into his mind-frame. Like when the men discuss how to divide up the money, or when the 'outsider' American comes in, the one who's definitely not invited- notice the striking body language of Bogart in relation to the other actors. Most especially, even if it's a small scene, when the three men talk about what they'll do with their share of the money- Dobbs's goals are in the short-term, unlike the practicality of Howard or Bob. By the last third of the film, if one were just looking at that set apart from the rest of the picture, one might think it's a flashback to Bogart's 'old days' as a character actor in the 30s. Yet he's the star here, which makes Dobbs's plummet a kind of sad testament to the American dream, so called, and to the corruptibility of goods.But aside from building strongly on the characters, Huston is also a good storyteller, and his Treasure of the Sierra Madre is one of the finest 'yarns' of the 40s, albeit subversive as his other great films, the Maltese Falcon and the Asphalt Jungle, were. It's such a simple story, really, but it works because we believe in the characters, the nature of the setting, of the outside influences (i.e. both bandits and the 'common' Mexican peasants). Huston doesn't clutter up his story with any unnecessary moments, even as he uses a lot more bits to build on character than just plot. While Howard ends up being usually expository or with all the information for the other two- as he IS the most experienced like a gold-digging Yoda perhaps- the story never gets clunky. And there's a great sweep to the style of the picture too, with just the right studio score by Max Steiner, and some wonderful desert shots (and shots of the men's varied faces) Ted McCord. And one can't leave thinking about Treasure of the Sierra Madre, aside from considering the performances. Sure, Bogart might be at his best here, both an every-man and every-man-for-himself (plus his own worst enemy), but there's also Tim Holt, who has to carry the most restraint of the three main characters, and he's terrific at it, in what was probably his best remembered role among mostly B pictures. But it's arguable that Walter Huston, John's father, steals the show sometimes from Bogart, or at least gets in enough room to stand right alongside him as a presence to be reckoned with. The character ranges from being wise, to being a cook (like when he laughs wildly at the younger men being tired climbing the mountain), cautious, and always with a sense of truth and honor. Huston probably has one of the more deserved supporting actor Oscar turns here for the part, and if I had to show anyone one performance noteworthy most of all from him it'd be from 'Sierra Madre'. Bottom line, a must-see in the realm of the western/adventure A-pictures of the 40s, with enough to say on the dangers of greed and money to last so many years."
    }
  ],
  "errorMessage": ""
}