{
  "imDbId": "tt0040897",
  "title": "The Treasure of the Sierra Madre",
  "fullTitle": "The Treasure of the Sierra Madre (1948)",
  "type": "Movie",
  "year": "1948",
  "language": "en",
  "titleInLanguage": "The Treasure of the Sierra Madre (film)",
  "url": "https://en.wikipedia.org/wiki/The_Treasure_of_the_Sierra_Madre_(film)",
  "plotShort": {
    "plainText": "The Treasure of the Sierra Madre is a 1948 American Western film written and directed by John Huston. It is an adaptation of B. Traven's 1927 novel of the same name, set in 1925, and follows two downtrodden men (played by Humphrey Bogart and Tim Holt) who join forces with a grizzled old prospector (Walter Huston, the director's father), in searching for gold in Mexico.\r\nThe Treasure of the Sierra Madre was one of the early Hollywood productions to be shot on location outside the United States (in the state of Durango with street scenes in Tampico, Mexico), but many scenes were filmed back in the studio and elsewhere in the U.S. In 1990, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".",
    "html": "<p>The Treasure of the Sierra Madre is a 1948 American Western film written and directed by John Huston. It is an adaptation of B. Traven's 1927 novel of the same name, set in 1925, and follows two downtrodden men (played by Humphrey Bogart and Tim Holt) who join forces with a grizzled old prospector (Walter Huston, the director's father), in searching for gold in Mexico.</p><p>The Treasure of the Sierra Madre was one of the early Hollywood productions to be shot on location outside the United States (in the state of Durango with street scenes in Tampico, Mexico), but many scenes were filmed back in the studio and elsewhere in the U.S. In 1990, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".</p>"
  },
  "plotFull": {
    "plainText": "The Treasure of the Sierra Madre is a 1948 American Western film written and directed by John Huston. It is an adaptation of B. Traven's 1927 novel of the same name, set in 1925, and follows two downtrodden men (played by Humphrey Bogart and Tim Holt) who join forces with a grizzled old prospector (Walter Huston, the director's father), in searching for gold in Mexico.\r\nThe Treasure of the Sierra Madre was one of the early Hollywood productions to be shot on location outside the United States (in the state of Durango with street scenes in Tampico, Mexico), but many scenes were filmed back in the studio and elsewhere in the U.S. In 1990, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".\r\nPlot\r\nIn 1925, in the Mexican town of Tampico, labor contractor Pat McCormick recruits Fred C. Dobbs and Bob Curtin, two broke American drifters, as roughnecks to help construct oil rigs for $8 per day. When the project is completed and the men return to Tampico, McCormick skips out without paying them.\r\nThe two vagrants encounter an old man named Howard in a flophouse. A loquacious ex-miner, he talks to them about gold prospecting and the perils of striking it rich. Dobbs and Curtin run into McCormick at a cantina, and collect their back wages after a bar fight. When Dobbs hits a small jackpot in the lottery, he, Curtin and Howard have enough money to buy supplies to go prospecting in the interior.\r\nDeparting Tampico by train, the three help repulse a bandit attack led by \"Gold Hat\". North of Durango, the trio head into the remote Sierra Madre mountains. Howard proves to be the hardiest and most knowledgeable of the three. After several days of arduous travel, he spots gold the others had missed.\r\nThe men toil under harsh conditions and amass a fortune in placer gold. But as the gold piles up, Dobbs becomes increasingly distrustful of the other two. The men agree to divide the gold dust immediately and hide their shares.\r\nOn a supply trip to Durango, Curtin is spotted making purchases by a Texan named Cody. Cody secretly follows Curtin back to the encampment. When he confronts the three men, they lie about what they are doing there, but he is not fooled. He boldly proposes to join their outfit and share in any future takings. Howard, Curtin and Dobbs discuss it and vote to kill him. As they announce their verdict, pistols in hand, Gold Hat and his bandits arrive. They claim to be Federales. After a tense parley, a gunfight ensues, and Cody is killed. A genuine troop of Federales suddenly appears and pursues Gold Hat and his gang. The three prospectors examine Cody's personal effects. A letter from a loving wife reveals that he was trying to provide for his family. Moved by the letter, Howard and Curtin agree to give part of their share to Cody's family, but Dobbs declines to do the same.\r\nHoward is called away to assist local villagers with a seriously ill little boy. When the boy recovers, the next day, the villagers insist that Howard return with them to be honored. Howard leaves his goods with Dobbs and Curtin and says he will meet them later. Dobbs and Curtin constantly argue, until one night Dobbs shoots Curtin and takes all the gold. Curtin is not dead, and manages to crawl away and hide during the night.\r\nFinding Curtin gone, Dobbs flees but is ambushed at a waterhole by Gold Hat and his men. They first toy with him, then kill him. The bandits mistake the bags of gold dust for sand and dump them, taking only the burros and supplies. The gold is scattered by the strong wind. Curtin is discovered by indios and taken to Howard's village, where he recovers.\r\nGold Hat's gang tries to sell the stolen burros in town but a child recognizes the brands on them (and Dobbs's clothes, which the bandits are wearing) and reports them to the authorities. The bandits are captured and summarily executed by the Federales.\r\nHoward and Curtin return to Durango in a dust storm hoping to reclaim their gold, only to find empty bags. At first shaken by the loss, first Howard, then Curtin, grasp the immense irony of their circumstances, and burst into laughter. Howard decides to return to the village to accept an offer of a permanent home and a position of honor, and Curtin sells their recovered property to return to the U.S., where he will seek out Cody's widow. As Curtin leaves, the camera pans to a cactus as he rides past. Lying next to it is another empty bag.\r\nCast\r\nHumphrey Bogart as Fred C. Dobbs\r\nWalter Huston as Howard\r\nTim Holt as Bob Curtin\r\nBruce Bennett as James Cody\r\nBarton MacLane as Pat McCormick\r\nAlfonso Bedoya as Gold Hat\r\nArturo Soto Rangel as El Presidente\r\nManuel Dondé as El Jefe\r\nJosé Torvay as Pablo\r\nMargarito Luna as Pancho\r\nRobert Blake as the Mexican boy selling lottery tickets (uncredited)\r\nJohn Huston as the American in Tampico in the white suit (uncredited)\r\nJack Holt as a Flophouse Bum (uncredited)\r\nJulian Rivero as the Barber (uncredited)\r\nJay Silverheels as the Indian Guide at Pier (uncredited)\r\nPat Flaherty as the Bar Patron (uncredited)\r\nClifton Young as another Flophouse Bum (uncredited)\r\nProduction notes\r\nPre-production\r\nDirector John Huston first read the novel by B. Traven in 1935 and thought the material would make a great movie with his father in the main role. Based on a 19th-century ballad by a German poet, Traven's book reminded Huston of his adventures in the Mexican cavalry. After a smashing success with his directorial debut The Maltese Falcon, Huston started to work on the project. The studio had George Raft, Edward G. Robinson, and John Garfield in mind for the three main roles, but then World War II intervened. Vincent Sherman was set to direct a version of the story during the World War II years until his script fell afoul of the 1930 Motion Picture Production Code for being derogatory toward Mexicans.\r\nCasting\r\nBy the time Huston came back from making several documentaries for the war effort, Humphrey Bogart had become Warner Brothers' biggest star. When Bogart first got wind that Huston might be making a film of the novel, he immediately started badgering Huston for a part. Bogart was given the main role of Fred C. Dobbs. Before filming, Bogart encountered a critic while leaving a New York nightclub. \"Wait till you see me in my next picture\", he said. \"I play the worst shit you ever saw\".\r\nTraven initially disagreed with Huston's decision to cast his father Walter Huston as Howard, preferring Lewis Stone, but eventually came to agree with Huston. Walter Huston also questioned his son's choice. He still saw himself as a leading man and was not keen on being cast in a supporting role. His son was able to convince him to accept. John Huston rated his father's performance as the finest piece of acting in any of his films. On seeing Walter Huston's performance, Bogart famously said \"One Huston is bad enough, but two are murder\".\r\nHuston originally wanted to cast Ronald Reagan as James Cody. Jack L. Warner instead insisted on casting Reagan in another film. Bruce Bennett was cast in the role. A few notable uncredited actors appear in the film. In an opening cameo, John Huston is pestered for money by Bogart's character, directed by Bogart. Robert Blake also appears as a young boy selling lottery tickets.\r\nA photograph included in the documentary accompanying the DVD release shows Ann Sheridan in streetwalker costume, with Bogart and Huston on the set. Many film-history sources credit Sheridan for a part. Co-star Tim Holt's father, Jack Holt, a star of silent and early sound Westerns and action films, makes a one-line appearance at the beginning of the film as one of the men down on their luck.\r\nFilming\r\nThe Treasure of the Sierra Madre was one of the early Hollywood films to be filmed on location outside the U.S. (in the state of Durango and street scenes in Tampico, Mexico), but many scenes were filmed back in the studio and elsewhere in the U.S. Filming took five and a half months.\r\nThe first scene in the film with Bogart and Holt was the first to be shot. The opening scenes, filmed in longshot on the Plaza de la Libertad in Tampico, show contemporary (1940s) cars and buses, despite that the story opens in 1925 as shown by the lottery number's poster.\r\nJust as Huston was starting to shoot scenes in Tampico, the local government inexplicably closed the production. The cast and crew were at a complete loss to understand because Tampico's residents and government had so far been generous. Tne reason was that a local newspaper had printed a false story accusing the film of being unflattering to Mexico.\r\nHuston soon found out why the newspaper skewered his production. When you wanted to do anything in Tampico, it was customary to bribe the editor of the newspaper, which the crew had failed to do. Fortunately, two of Huston's associates, Diego Rivera and Miguel Covarrubias, went to the president of Mexico. The libelous accusations were dropped, and a few weeks later, the editor of the newspaper was caught in flagrante and shot dead by a jealous husband.\r\nMost of the Mexican extras were paid 10 pesos per day, the equivalent of $2, a considerable amount for an impoverished region at the time.\r\nThere were scenes in which Walter Huston had to speak fluent Spanish, a language he did not know. John Huston hired a Mexican to record the lines and then the elder Huston memorized them so well that many thought he knew the language. As with most of the Mexican actors selected from the local population, Alfonso Bedoya's heavily accented pronunciation of English proved a bit of a problem (\"horseback\" sounded like \"whore's back\"). Bogart knew only two Spanish words, \"Dos Equis\", a Mexican beer.\r\nThe fight scene in the cantina took five days to shoot. During the shooting of the entire film, John Huston pulled pranks on Bennett, Bedoya (along with Bogart), and Bogart. While most of the film was shot in Mexico, Jack L. Warner had the unit return to Hollywood when the budget started to exceed $3 million.\r\nThough the dailies impressed Warner Bros., Jack L. Warner nearly went berserk with the weekly expenditures. After viewing one scene, Warner threw up his hands and shouted to producer Henry Blanke \"Yeah, they're looking for gold all right—mine!\" During another screening of dailies, Warner watched Dobbs stumble in the desert in search of water. Warner jumped up in the middle of the scene and shouted to a gaggle of executives \"If that s.o.b. doesn't find water soon, I'll go broke!\".\r\nWarner had reason to be upset. John Huston and Blanke led him to believe that the film would be an easy picture to make and that they would be in and out of Mexico in a matter of weeks. Warner was notorious for not actually reading scripts and had assumed the film was a B-movie Western. As the full extent of Huston's plans became apparent, Warner became quite angry. He was especially unhappy with the way the film ended, arguing that audiences wouldn't accept it. The initial box-office take was unimpressive, but the film was a huge critical success and more than earned back its original investment of $3 million in its many rereleases.\r\nAs production dragged, Bogart, an avid yachtsman, was getting increasingly anxious about missing the Honolulu Race in which he usually took part. Despite assurances from the studio that his work would be done by then, he pestered Huston about finishing in time. Eventually, Huston grabbed Bogart by the nose and twisted hard. Bogart never again asked him to confirm when shooting was expected to finish.\r\nThe windstorm in the final scene was created by jet engines borrowed from the Mexican Air Force.\r\nEdited scene\r\nHuston's original filmed depiction of Dobbs's death was more graphic—as it was in the book—than the one that made it onto the screen. When Gold Hat strikes Dobbs with his machete, Dobbs is decapitated. Huston shot Dobbs's (fake) head rolling into the waterhole (a quick shot of Gold Hat's accomplices reacting to Dobbs's rolling head remains in the film, and in the next shot one can see the water rippling where it rolled in). The 1948 censors did not allow it, so Huston camouflaged the cut shot with a repeat shot of Gold Hat striking Dobbs. Warner Bros.' publicity department released a statement that Bogart was \"disappointed the scene couldn't be shown in all its graphic glory.\" Bogart's reaction was: \"What's wrong with showing a guy getting his head cut off?\"\r\nJohn Huston's screenplay\r\nJohn Huston's adaptation of Traven's novel was altered to meet Hays Code regulations, which severely limited profanity in film. The original line from the novel was:\r\nThe dialogue as written for the film is:\r\nGold Hat's response as written by Huston and delivered by Bedoya has become famous, and it often is misquoted as \"We don't need no stinking badges!\" In 2005, the quotation was chosen as No. 36 on the American Film Institute list AFI's 100 Years...100 Movie Quotes.\r\nThere is only a single line of female dialogue - a woman speaks in Spanish as she gives Howard a piglet as a gift.\r\nThemes\r\nThe film often is described as a story about the corrupting influence of greed. Film critic Roger Ebert]expanded upon this idea, writing \"The movie has never really been about gold but about character.\" Reviewers have also noted the importance of greed and gold and of nature and its desolateness as an influence on the actions of the men. However, the film's ability to comment on human nature generally has been doubted as Dobbs is evidently flawed from the outset.\r\nReception\r\nAccording to Variety, the film earned $2.3 million in the U.S. in 1948. According to Warner Bros. records, it earned $2,746,000 domestically and $1,349,000 foreign.\r\nAt the 21st Academy Awards, The Treasure of The Sierra Madre received four nominations, and won three awards: Best Supporting Actor for Walter Huston, and Best Director and Best Writing, Screenplay for John Huston, his only Oscars. There has been controversy since the 1949 ceremony because of the academy's choice not to nominate Bogart for the Academy Award for Best Actor, a choice that modern critics and Academy members have since condemned. Bogart's performance has been named the best of his career. British actor Daniel Day-Lewis said that his second Oscar-winning performance as vicious oil baron Daniel Plainview in There Will Be Blood was heavily inspired by Bogart's portrayal of Fred C. Dobbs.\r\nOn Rotten Tomatoes, the film is one of the few that have an approval rating of 100%, based on 50 reviews, and an average rating of 9.1/10. The website's critical consensus reads \"Remade but never duplicated, this darkly humorous morality tale represents John Huston at his finest.\" The Treasure Of The Sierra Madre is now considered to be among the best films of all time, with some critics calling it Huston's magnum opus.\r\nAwards and honors\r\nIn 1990, the film was selected for preservation in the United States National Film Registry by the Library of Congress as \"culturally, historically, or aesthetically significant\". The film was among the first 100 films to be selected.\r\nCritic Leonard Maltin listed The Treasure of the Sierra Madre as one of the \"100 Must-See Films of the 20th Century.\" The Directors Guild of America called it the 57th best-directed movie of all time.\r\nDirector Stanley Kubrick listed The Treasure of the Sierra Madre as his fourth favorite film of all time in a 1963 edition of Cinema magazine. Director Sam Raimi ranked it as his favorite film of all time in an interview with Rotten Tomatoes, and director Paul Thomas Anderson watched it at night before bed while writing There Will Be Blood. Director Spike Lee listed it as one of the \"87 Films Every Aspiring Director Should See.\"\r\nBreaking Bad creator Vince Gilligan has cited the film as one of his personal favorites and has said that Dobbs was a key influence in creating the character of Walter White. A key scene from the film was emulated in \"Buyout\", the sixth episode of the series' fifth season.\r\nAFI's 100 Years... 100 Movies – No. 30\r\nAFI's 100 Years... 100 Thrills – No. 67\r\nAFI's 100 Years... 100 Movie Quotes: \"Badges? We ain't got no badges! We don't need no badges! I don't have to show you any stinking badges!\" – No. 36\r\n\"Badges? We ain't got no badges! We don't need no badges! I don't have to show you any stinking badges!\" – No. 36\r\nAFI's 100 Years... 100 Movies (10th Anniversary Edition) – No. 38\r\nIn popular culture\r\nThe Stone Roses song \"Fools Gold\" was inspired by the film. Songwriter Ian Brown said \"Three geezers who are skint and they put their money together to get equipment to go looking for gold...Then they all betray each other...That's what the song is about.\"\r\nFred C. Dobbs appears in the Looney Tunes short 8 Ball Bunny, delivering his signature phrase: \"Say, pardon me, but could you help out a fellow American who's down on his luck?\".\r\nBlazing Saddles refers to the film with the (misquoted) line \"We don't need no stinkin' badges!\" UHF misquotes the same line as: \"I don't need no stinkin' badgers!\".\r\nThe Fallout: New Vegas expansion pack Dead Money was inspired by the film. The expansion takes place in the Sierra Madre Casino, a pre-war casino which supposedly has a fortune in gold hidden in its vaults. It's stated that many wasteland prospectors died looking for the treasure. At the end of the expansion, the player finds the gold but is forced to leave almost all of it behind, as it's too heavy to carry while they escape.",
    "html": "<p>The Treasure of the Sierra Madre is a 1948 American Western film written and directed by John Huston. It is an adaptation of B. Traven's 1927 novel of the same name, set in 1925, and follows two downtrodden men (played by Humphrey Bogart and Tim Holt) who join forces with a grizzled old prospector (Walter Huston, the director's father), in searching for gold in Mexico.</p><p>The Treasure of the Sierra Madre was one of the early Hollywood productions to be shot on location outside the United States (in the state of Durango with street scenes in Tampico, Mexico), but many scenes were filmed back in the studio and elsewhere in the U.S. In 1990, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".</p><br/><h3>Plot</h3><p>In 1925, in the Mexican town of Tampico, labor contractor Pat McCormick recruits Fred C. Dobbs and Bob Curtin, two broke American drifters, as roughnecks to help construct oil rigs for $8 per day. When the project is completed and the men return to Tampico, McCormick skips out without paying them.</p><p>The two vagrants encounter an old man named Howard in a flophouse. A loquacious ex-miner, he talks to them about gold prospecting and the perils of striking it rich. Dobbs and Curtin run into McCormick at a cantina, and collect their back wages after a bar fight. When Dobbs hits a small jackpot in the lottery, he, Curtin and Howard have enough money to buy supplies to go prospecting in the interior.</p><p>Departing Tampico by train, the three help repulse a bandit attack led by \"Gold Hat\". North of Durango, the trio head into the remote Sierra Madre mountains. Howard proves to be the hardiest and most knowledgeable of the three. After several days of arduous travel, he spots gold the others had missed.</p><p>The men toil under harsh conditions and amass a fortune in placer gold. But as the gold piles up, Dobbs becomes increasingly distrustful of the other two. The men agree to divide the gold dust immediately and hide their shares.</p><p>On a supply trip to Durango, Curtin is spotted making purchases by a Texan named Cody. Cody secretly follows Curtin back to the encampment. When he confronts the three men, they lie about what they are doing there, but he is not fooled. He boldly proposes to join their outfit and share in any future takings. Howard, Curtin and Dobbs discuss it and vote to kill him. As they announce their verdict, pistols in hand, Gold Hat and his bandits arrive. They claim to be Federales. After a tense parley, a gunfight ensues, and Cody is killed. A genuine troop of Federales suddenly appears and pursues Gold Hat and his gang. The three prospectors examine Cody's personal effects. A letter from a loving wife reveals that he was trying to provide for his family. Moved by the letter, Howard and Curtin agree to give part of their share to Cody's family, but Dobbs declines to do the same.</p><p>Howard is called away to assist local villagers with a seriously ill little boy. When the boy recovers, the next day, the villagers insist that Howard return with them to be honored. Howard leaves his goods with Dobbs and Curtin and says he will meet them later. Dobbs and Curtin constantly argue, until one night Dobbs shoots Curtin and takes all the gold. Curtin is not dead, and manages to crawl away and hide during the night.</p><p>Finding Curtin gone, Dobbs flees but is ambushed at a waterhole by Gold Hat and his men. They first toy with him, then kill him. The bandits mistake the bags of gold dust for sand and dump them, taking only the burros and supplies. The gold is scattered by the strong wind. Curtin is discovered by indios and taken to Howard's village, where he recovers.</p><p>Gold Hat's gang tries to sell the stolen burros in town but a child recognizes the brands on them (and Dobbs's clothes, which the bandits are wearing) and reports them to the authorities. The bandits are captured and summarily executed by the Federales.</p><p>Howard and Curtin return to Durango in a dust storm hoping to reclaim their gold, only to find empty bags. At first shaken by the loss, first Howard, then Curtin, grasp the immense irony of their circumstances, and burst into laughter. Howard decides to return to the village to accept an offer of a permanent home and a position of honor, and Curtin sells their recovered property to return to the U.S., where he will seek out Cody's widow. As Curtin leaves, the camera pans to a cactus as he rides past. Lying next to it is another empty bag.</p><br/><h3>Cast</h3><ul><li>Humphrey Bogart as Fred C. Dobbs</li><li>Walter Huston as Howard</li><li>Tim Holt as Bob Curtin</li><li>Bruce Bennett as James Cody</li><li>Barton MacLane as Pat McCormick</li><li>Alfonso Bedoya as Gold Hat</li><li>Arturo Soto Rangel as El Presidente</li><li>Manuel Dondé as El Jefe</li><li>José Torvay as Pablo</li><li>Margarito Luna as Pancho</li><li>Robert Blake as the Mexican boy selling lottery tickets (uncredited)</li><li>John Huston as the American in Tampico in the white suit (uncredited)</li><li>Jack Holt as a Flophouse Bum (uncredited)</li><li>Julian Rivero as the Barber (uncredited)</li><li>Jay Silverheels as the Indian Guide at Pier (uncredited)</li><li>Pat Flaherty as the Bar Patron (uncredited)</li><li>Clifton Young as another Flophouse Bum (uncredited)</li></ul><br/><h3>Production notes</h3><h4>Pre-production</h4><p>Director John Huston first read the novel by B. Traven in 1935 and thought the material would make a great movie with his father in the main role. Based on a 19th-century ballad by a German poet, Traven's book reminded Huston of his adventures in the Mexican cavalry. After a smashing success with his directorial debut The Maltese Falcon, Huston started to work on the project. The studio had George Raft, Edward G. Robinson, and John Garfield in mind for the three main roles, but then World War II intervened. Vincent Sherman was set to direct a version of the story during the World War II years until his script fell afoul of the 1930 Motion Picture Production Code for being derogatory toward Mexicans.</p><h4>Casting</h4><p>By the time Huston came back from making several documentaries for the war effort, Humphrey Bogart had become Warner Brothers' biggest star. When Bogart first got wind that Huston might be making a film of the novel, he immediately started badgering Huston for a part. Bogart was given the main role of Fred C. Dobbs. Before filming, Bogart encountered a critic while leaving a New York nightclub. \"Wait till you see me in my next picture\", he said. \"I play the worst shit you ever saw\".</p><p>Traven initially disagreed with Huston's decision to cast his father Walter Huston as Howard, preferring Lewis Stone, but eventually came to agree with Huston. Walter Huston also questioned his son's choice. He still saw himself as a leading man and was not keen on being cast in a supporting role. His son was able to convince him to accept. John Huston rated his father's performance as the finest piece of acting in any of his films. On seeing Walter Huston's performance, Bogart famously said \"One Huston is bad enough, but two are murder\".</p><p>Huston originally wanted to cast Ronald Reagan as James Cody. Jack L. Warner instead insisted on casting Reagan in another film. Bruce Bennett was cast in the role. A few notable uncredited actors appear in the film. In an opening cameo, John Huston is pestered for money by Bogart's character, directed by Bogart. Robert Blake also appears as a young boy selling lottery tickets.</p><p>A photograph included in the documentary accompanying the DVD release shows Ann Sheridan in streetwalker costume, with Bogart and Huston on the set. Many film-history sources credit Sheridan for a part. Co-star Tim Holt's father, Jack Holt, a star of silent and early sound Westerns and action films, makes a one-line appearance at the beginning of the film as one of the men down on their luck.</p><h4>Filming</h4><p>The Treasure of the Sierra Madre was one of the early Hollywood films to be filmed on location outside the U.S. (in the state of Durango and street scenes in Tampico, Mexico), but many scenes were filmed back in the studio and elsewhere in the U.S. Filming took five and a half months.</p><p>The first scene in the film with Bogart and Holt was the first to be shot. The opening scenes, filmed in longshot on the Plaza de la Libertad in Tampico, show contemporary (1940s) cars and buses, despite that the story opens in 1925 as shown by the lottery number's poster.</p><p>Just as Huston was starting to shoot scenes in Tampico, the local government inexplicably closed the production. The cast and crew were at a complete loss to understand because Tampico's residents and government had so far been generous. Tne reason was that a local newspaper had printed a false story accusing the film of being unflattering to Mexico.</p><p>Huston soon found out why the newspaper skewered his production. When you wanted to do anything in Tampico, it was customary to bribe the editor of the newspaper, which the crew had failed to do. Fortunately, two of Huston's associates, Diego Rivera and Miguel Covarrubias, went to the president of Mexico. The libelous accusations were dropped, and a few weeks later, the editor of the newspaper was caught in flagrante and shot dead by a jealous husband.</p><p>Most of the Mexican extras were paid 10 pesos per day, the equivalent of $2, a considerable amount for an impoverished region at the time.</p><p>There were scenes in which Walter Huston had to speak fluent Spanish, a language he did not know. John Huston hired a Mexican to record the lines and then the elder Huston memorized them so well that many thought he knew the language. As with most of the Mexican actors selected from the local population, Alfonso Bedoya's heavily accented pronunciation of English proved a bit of a problem (\"horseback\" sounded like \"whore's back\"). Bogart knew only two Spanish words, \"Dos Equis\", a Mexican beer.</p><p>The fight scene in the cantina took five days to shoot. During the shooting of the entire film, John Huston pulled pranks on Bennett, Bedoya (along with Bogart), and Bogart. While most of the film was shot in Mexico, Jack L. Warner had the unit return to Hollywood when the budget started to exceed $3 million.</p><p>Though the dailies impressed Warner Bros., Jack L. Warner nearly went berserk with the weekly expenditures. After viewing one scene, Warner threw up his hands and shouted to producer Henry Blanke \"Yeah, they're looking for gold all right—mine!\" During another screening of dailies, Warner watched Dobbs stumble in the desert in search of water. Warner jumped up in the middle of the scene and shouted to a gaggle of executives \"If that s.o.b. doesn't find water soon, I'll go broke!\".</p><p>Warner had reason to be upset. John Huston and Blanke led him to believe that the film would be an easy picture to make and that they would be in and out of Mexico in a matter of weeks. Warner was notorious for not actually reading scripts and had assumed the film was a B-movie Western. As the full extent of Huston's plans became apparent, Warner became quite angry. He was especially unhappy with the way the film ended, arguing that audiences wouldn't accept it. The initial box-office take was unimpressive, but the film was a huge critical success and more than earned back its original investment of $3 million in its many rereleases.</p><p>As production dragged, Bogart, an avid yachtsman, was getting increasingly anxious about missing the Honolulu Race in which he usually took part. Despite assurances from the studio that his work would be done by then, he pestered Huston about finishing in time. Eventually, Huston grabbed Bogart by the nose and twisted hard. Bogart never again asked him to confirm when shooting was expected to finish.</p><p>The windstorm in the final scene was created by jet engines borrowed from the Mexican Air Force.</p><h4>Edited scene</h4><p>Huston's original filmed depiction of Dobbs's death was more graphic—as it was in the book—than the one that made it onto the screen. When Gold Hat strikes Dobbs with his machete, Dobbs is decapitated. Huston shot Dobbs's (fake) head rolling into the waterhole (a quick shot of Gold Hat's accomplices reacting to Dobbs's rolling head remains in the film, and in the next shot one can see the water rippling where it rolled in). The 1948 censors did not allow it, so Huston camouflaged the cut shot with a repeat shot of Gold Hat striking Dobbs. Warner Bros.' publicity department released a statement that Bogart was \"disappointed the scene couldn't be shown in all its graphic glory.\" Bogart's reaction was: \"What's wrong with showing a guy getting his head cut off?\"</p><h4>John Huston's screenplay</h4><p>John Huston's adaptation of Traven's novel was altered to meet Hays Code regulations, which severely limited profanity in film. The original line from the novel was:</p><p>The dialogue as written for the film is:</p><p>Gold Hat's response as written by Huston and delivered by Bedoya has become famous, and it often is misquoted as \"We don't need no stinking badges!\" In 2005, the quotation was chosen as No. 36 on the American Film Institute list AFI's 100 Years...100 Movie Quotes.</p><p>There is only a single line of female dialogue - a woman speaks in Spanish as she gives Howard a piglet as a gift.</p><br/><h3>Themes</h3><p>The film often is described as a story about the corrupting influence of greed. Film critic Roger Ebert]expanded upon this idea, writing \"The movie has never really been about gold but about character.\" Reviewers have also noted the importance of greed and gold and of nature and its desolateness as an influence on the actions of the men. However, the film's ability to comment on human nature generally has been doubted as Dobbs is evidently flawed from the outset.</p><br/><h3>Reception</h3><p>According to Variety, the film earned $2.3 million in the U.S. in 1948. According to Warner Bros. records, it earned $2,746,000 domestically and $1,349,000 foreign.</p><p>At the 21st Academy Awards, The Treasure of The Sierra Madre received four nominations, and won three awards: Best Supporting Actor for Walter Huston, and Best Director and Best Writing, Screenplay for John Huston, his only Oscars. There has been controversy since the 1949 ceremony because of the academy's choice not to nominate Bogart for the Academy Award for Best Actor, a choice that modern critics and Academy members have since condemned. Bogart's performance has been named the best of his career. British actor Daniel Day-Lewis said that his second Oscar-winning performance as vicious oil baron Daniel Plainview in There Will Be Blood was heavily inspired by Bogart's portrayal of Fred C. Dobbs.</p><p>On Rotten Tomatoes, the film is one of the few that have an approval rating of 100%, based on 50 reviews, and an average rating of 9.1/10. The website's critical consensus reads \"Remade but never duplicated, this darkly humorous morality tale represents John Huston at his finest.\" The Treasure Of The Sierra Madre is now considered to be among the best films of all time, with some critics calling it Huston's magnum opus.</p><br/><h3>Awards and honors</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Recipient</th><th>Result</th></tr><tr><td rowspan=\"4\"><span>Academy Awards</span></td><td><span>Best Picture</span></td><td><span>Henry Blanke</span> (for <span>Warner Bros.</span>)</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td><span>John Huston</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>Walter Huston</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay</span></td><td>John Huston</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>British Academy Film Awards</span></td><td colspan=\"2\"><span>Best Film from any Source</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\">Faro Island Film Festival</td><td>Best Film (Golden Train Award)</td><td rowspan=\"2\">John Huston</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Film (Audience Award)</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Actor (Golden Train Award)</td><td rowspan=\"2\"><span>Humphrey Bogart</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Actor (Audience Award)</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Picture</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor</span></td><td>Walter Huston</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>John Huston</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>National Board of Review Awards</span></td><td colspan=\"2\"><span>Top Ten Films</span></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">4th Place</td></tr><tr><td><span>Best Supporting Actor</span></td><td>Walter Huston</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Screenplay</td><td>John Huston</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Film Preservation Board</span></td><td colspan=\"2\"><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td></tr><tr><td rowspan=\"3\"><span>New York Film Critics Circle Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>John Huston</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td>Walter Huston</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Venice International Film Festival</span></td><td><span>Grand International Prize of Venice</span></td><td>John Huston</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Music</span></td><td><span>Max Steiner</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Writers Guild of America Awards</span></td><td><span>Best Written American Drama</span></td><td rowspan=\"2\">John Huston</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Written American Western</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><p>In 1990, the film was selected for preservation in the United States National Film Registry by the Library of Congress as \"culturally, historically, or aesthetically significant\". The film was among the first 100 films to be selected.</p><p>Critic Leonard Maltin listed The Treasure of the Sierra Madre as one of the \"100 Must-See Films of the 20th Century.\" The Directors Guild of America called it the 57th best-directed movie of all time.</p><p>Director Stanley Kubrick listed The Treasure of the Sierra Madre as his fourth favorite film of all time in a 1963 edition of Cinema magazine. Director Sam Raimi ranked it as his favorite film of all time in an interview with Rotten Tomatoes, and director Paul Thomas Anderson watched it at night before bed while writing There Will Be Blood. Director Spike Lee listed it as one of the \"87 Films Every Aspiring Director Should See.\"</p><p>Breaking Bad creator Vince Gilligan has cited the film as one of his personal favorites and has said that Dobbs was a key influence in creating the character of Walter White. A key scene from the film was emulated in \"Buyout\", the sixth episode of the series' fifth season.</p><ul><li>AFI's 100 Years... 100 Movies – No. 30</li><li>AFI's 100 Years... 100 Thrills – No. 67</li><li>AFI's 100 Years... 100 Movie Quotes: \"Badges? We ain't got no badges! We don't need no badges! I don't have to show you any stinking badges!\" – No. 36</li><li>\"Badges? We ain't got no badges! We don't need no badges! I don't have to show you any stinking badges!\" – No. 36</li><li>AFI's 100 Years... 100 Movies (10th Anniversary Edition) – No. 38</li></ul><br/><h3>In popular culture</h3><p>The Stone Roses song \"Fools Gold\" was inspired by the film. Songwriter Ian Brown said \"Three geezers who are skint and they put their money together to get equipment to go looking for gold...Then they all betray each other...That's what the song is about.\"</p><p>Fred C. Dobbs appears in the Looney Tunes short 8 Ball Bunny, delivering his signature phrase: \"Say, pardon me, but could you help out a fellow American who's down on his luck?\".</p><p>Blazing Saddles refers to the film with the (misquoted) line \"We don't need no stinkin' badges!\" UHF misquotes the same line as: \"I don't need no stinkin' badgers!\".</p><p>The Fallout: New Vegas expansion pack Dead Money was inspired by the film. The expansion takes place in the Sierra Madre Casino, a pre-war casino which supposedly has a fortune in gold hidden in its vaults. It's stated that many wasteland prospectors died looking for the treasure. At the end of the expansion, the player finds the gold but is forced to leave almost all of it behind, as it's too heavy to carry while they escape.</p><br/>"
  },
  "errorMessage": ""
}