{
  "imDbId": "tt4154756",
  "title": "Avengers: Infinity War",
  "fullTitle": "Avengers: Infinity War (2018)",
  "type": "Movie",
  "year": "2018",
  "items": [
    {
      "username": "RJBrez",
      "userUrl": "https://www.imdb.com/user/ur59265736",
      "reviewLink": "https://www.imdb.com/review/rw6521351",
      "warningSpoilers": true,
      "date": "24 January 2021",
      "rate": "10",
      "helpful": "186 out of 209 found this helpful.",
      "title": "Best movie of the MCU, incredible from start to finish.",
      "content": "Infinity War is remembered mostly for how it ends, with good reason. But for me, the entire movie is incredible. Action, humor, cinematography, heartbreak, etc. It was a culmination of 10 years of character development. The benefit of that hard work? The movie can start with incredible action and never let up. Most wouldn't agree because of the ending, but I feel it's the best movie of the MCU (so far). Endgame was awesome, infinity war was better. I think the best part of it was the fact that we had so many cool character meet ups that as fans we never thought we'd see. Thor with the guardians? Wow. Star Lord and Iron Man? Rocket and the winter soldier? We could go on and on. They also mastered the art of humor to help offset some deep deep hurt throughout the story. Thor and Star Lords interactions are pure gold. Thor calling Rocket \"rabbit\" pure gold. Dr Strange and Tony going toe to toe is worth the price of admission as well. I'm going to stop now or I could type forever.My only goal of writing this review is to help sway some others. Try to appreciate this movie for more than the gut wrenching ending. It's nonstop awesome from beginning to end. Enjoy!"
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5504583",
      "warningSpoilers": false,
      "date": "23 February 2020",
      "rate": "",
      "helpful": "177 out of 207 found this helpful.",
      "title": "Great",
      "content": "This movie portrays a villain that by far has been the best out of all the other Marvel antagonists. It shows his personal conflicts, his purpose, as well as his cruelty. The heroes of this film are overshadowed by this, but the ending really makes a mark on the audience."
    },
    {
      "username": "Alex_Lo",
      "userUrl": "https://www.imdb.com/user/ur105617842",
      "reviewLink": "https://www.imdb.com/review/rw6566311",
      "warningSpoilers": false,
      "date": "5 February 2021",
      "rate": "10",
      "helpful": "170 out of 198 found this helpful.",
      "title": "Best Cliffhanger of all Time",
      "content": "A meticulously planned film down to the last detail, where you can see how much love is behind it. Of course, the film delivers impressive show values and action, but besides, it is above all the interactions of the characters that are well thought out. Surprisingly, no character is neglected, and all the storylines of the previous films are brought together amazingly logical. The end is for me one of the best cliffhangers of all time, after the movie I was whacked. In the end, I have to ask myself: What more do I expect from a comic book superhero film? I was perfectly happy, so I can also give a comic book adaptation 10 out of 10 stars."
    },
    {
      "username": "grztxks",
      "userUrl": "https://www.imdb.com/user/ur128816687",
      "reviewLink": "https://www.imdb.com/review/rw6692429",
      "warningSpoilers": false,
      "date": "14 March 2021",
      "rate": "10",
      "helpful": "144 out of 164 found this helpful.",
      "title": "Better than Endgame",
      "content": "Infinity war is one of the best MCU protects. It has a great story, great acting, and awesome looking. If you aren't a Marvel fan or haven't watched most of the previous MCU movies this however, won't be something for you. Let's start with Thanos, definitely one of the best villains, he has a motive, is well played, you can even say that Infinity war tells his story and not the story of a hero. But also most of the other cast members were great in their role and again, if you love Marvel, watch this movie."
    },
    {
      "username": "andreascaloni",
      "userUrl": "https://www.imdb.com/user/ur129540860",
      "reviewLink": "https://www.imdb.com/review/rw6604563",
      "warningSpoilers": false,
      "date": "16 February 2021",
      "rate": "9",
      "helpful": "54 out of 63 found this helpful.",
      "title": "EMOTIONAL ROLLER COASTER",
      "content": "Avengers infinity war is an emotional roller coaster. Using the strength of its powerful and interesting villain, the movie successfully brings together the past 10 years of Marvel movies into a largely effective cocktail of super-heroic dramatics. Joe and Anthony Russo create a superhero movie that it's every bit the epic that it needs to be. However prepared you feel, you are not ready for Thanos. Infinity war is stunning, hilarious and heartbreaking.Rating: 9.6."
    },
    {
      "username": "uzair-36867",
      "userUrl": "https://www.imdb.com/user/ur59184435",
      "reviewLink": "https://www.imdb.com/review/rw6575212",
      "warningSpoilers": false,
      "date": "8 February 2021",
      "rate": "10",
      "helpful": "65 out of 72 found this helpful.",
      "title": "To this day one of the most impossible films to pull off",
      "content": "This film is an achievement unto itself. Unlike any other marvel movie, this deserves to be praised for bringing around 25+ popular characters and putting them all in a cohesive narrative thats unlike anything that came before it.At least 20 movies filled with characters and storyline nuances were successfully kept intact here yet the main character was the villain that had barely had any screentime previously, yet was written in a way that you could empathise with him and tied him into prior events like the new york invasion.The movie itself is structured perfectly, from the perspective of Thanos putting him in a heroes journey making him go to different locations to collect the stones from different heroes weve come to know, and pairing different combinations of heroes in an insanely well written way so every character stood out and had an iconic moment to shine.All in all the scope of this film is beyond anything that has come before it and even more so than Endgame, but they kept the narrative grounded and paced it perfectly. And the ending of the movie is one of the best endings ever. The best superhero/ comic book film of all time after The Dark Knight."
    },
    {
      "username": "lalit28595",
      "userUrl": "https://www.imdb.com/user/ur37755360",
      "reviewLink": "https://www.imdb.com/review/rw7167998",
      "warningSpoilers": false,
      "date": "27 July 2021",
      "rate": "10",
      "helpful": "85 out of 95 found this helpful.",
      "title": "EPIC",
      "content": "Infinity war seemed much better than endgame to be honest."
    },
    {
      "username": "Abdulxoxo",
      "userUrl": "https://www.imdb.com/user/ur106279729",
      "reviewLink": "https://www.imdb.com/review/rw6564964",
      "warningSpoilers": false,
      "date": "5 February 2021",
      "rate": "8",
      "helpful": "30 out of 37 found this helpful.",
      "title": "A superior avengers sequel",
      "content": "Although this film has 'Avengers' in the title, it ultimately belongs to Thanos. It's his story that drives the whole plot. He is the main characters of this movie, not any of the heroes. Thanos in my opinion is the greatest villain the MCU has ever produced. as a character he is truly threatening. In most of these movies deep down I know the hero will always win. For the first time I wasn't sure if the hero would win or not. Through the movie's entirety I was on the edge of my seat wandering whether my favourite characters would actually make it out of the movie alive. To have a villain with that level of genuine threat I thought was fantastic. I also felt slightly conflicted by his motivations. On the face of it, planning to eliminate half the universe's population is obviously a bad thing; however, after we learn his motivations for wanting to do so, I'd be lying if I didn't say I understood where he was coming from. There are two tones at play in this movie. One of them is a comical tone, mostly coming from the Guardians, Thor and Spider-Man. Predominantly though this movie is dark. Because of the level of threat created by Thanos, there is an emotional aspect to this film that will take the viewer by surprise. There are plenty of large scale action sequences, which are amazing; but there are also some shocking moments that were difficult to deal with. What I can say is that, the running time of two and a half hours absolutely flew by. Overall, Avengers: Infinity War did well in balancing the screen time among the characters in a way that every member of the Avengers get at least a moment to shine. There are also lots of great action, comedy, performances and a massive cliffhanger at the end that is well earned."
    },
    {
      "username": "Puroo",
      "userUrl": "https://www.imdb.com/user/ur120321993",
      "reviewLink": "https://www.imdb.com/review/rw6834594",
      "warningSpoilers": true,
      "date": "21 April 2021",
      "rate": "10",
      "helpful": "45 out of 58 found this helpful.",
      "title": "How MCU should have always been like",
      "content": "It was only after the release of Infinity War that I got interest in MCU. Before that I wasn't very much into superhero movies. So a couple of months after this movie released, I skimmed through all the MCU movies from Iron Man to Black Panther. I didn't put much focus into watching them all, since most of them were just following one pattern. Iron Man? A guy gets superpowers, beats the bad guy who wanted to take over the world and saves the day. Captain America? A guy gets superpowers, beats the bad guy who wanted to take over the world and saves the day. Thor? A guy \"loses\" and then gets superpowers, beats the bad guy and saves the day. Even in The Avengers and Age of Ultron it's just \"now all those guys come together, beat the bad guy who wanted to take over the world and save the day\". But Avengers: Infinity War is very much different.The movie begins from where the post credit scene of Thor: Ragnarok ended. Loki dies in the very beginning of the movie while he was trying to unsuccessfully deceive Thanos. This clearly shows that this movie really means business. It's not afraid of killing off the characters we have grown to like in all these years. Thor's hammer has broken so he gets a Mjolnir. Meanwhile Iron Man's team faces Thanos in yet another very brutal attack. Captain America's team is able to get out of their imprisonment after the events of Captain America: Civil War. And in spite of having a huge threat looming before them, Captain America and Iron Man still feel guilty of what happened between them previously.Thanos is undoubtedly the biggest threat to have ever been shown in any Marvel movie, MCU or otherwise. Unlike the comics where he's just simping behind Death to show how many people he can kill, this time he actually has a motivation. And that motivation is so powerful he is even ready to sacrifice his own daughter for it. He has fought for many years to find the Infinity Stones, and there is no way that he will sacrifice his lifetime work over morals or ethics. Concepts like humanity, empathy, conscience don't hold him back anymore, as he was brought up by the Eternals and in spite of being treated as one of them, he chose to part ways. Mortals don't matter to him anymore. His ambition does.Every scene from this movie is shot very well. The story, the colour palette, the choreography, the costumes, the score, everything is absolutely perfect. The only part I had a problem with earlier was when Starlord learnt about Thanos having killed Gamora and then he punches Thanos till he wakes up and is stopped. But later on I realised that Starlord has always been an emotional crybaby, and this kind of a behaviour is absolutely suited on him. He cannot be expected to think rationally, considering his track record in both the previous Guardians of the Galaxy movies.And finally in the end when Thanos snapped his finger, half the universe was gone. Even though we did know that they are all going to come back, the emotions that were conveyed by the characters clearly gave signs that something bad will surely happen in the end. I won't be getting into the spoilers because I want to keep this review spoiler free. So if you haven't seen it yet, don't just see who all disappear. Notice how they react when they disappear.Avengers: Infinity War is the kind of the Avengers movie I always wanted to see. I really don't like how The Avengers and Age of Ultron have aged so terribly (just like Joss Whedon's credibility lol) because of how campy they look by today's standards. Sure they did hold their legacy back then, but Infinity War will hold it for decades. It's the best MCU movie of all time."
    },
    {
      "username": "muhammad-66903",
      "userUrl": "https://www.imdb.com/user/ur124162421",
      "reviewLink": "https://www.imdb.com/review/rw6450521",
      "warningSpoilers": false,
      "date": "7 January 2021",
      "rate": "10",
      "helpful": "47 out of 60 found this helpful.",
      "title": "The best",
      "content": "This is is the best marvel/avengers movie every minute is very great no cap."
    },
    {
      "username": "michaelhowell12",
      "userUrl": "https://www.imdb.com/user/ur47292927",
      "reviewLink": "https://www.imdb.com/review/rw5096434",
      "warningSpoilers": true,
      "date": "2 September 2019",
      "rate": "10",
      "helpful": "285 out of 373 found this helpful.",
      "title": "Way better than endgame",
      "content": "This film is way better than endgame! The actions better The writings better The dialogues better The cgi is better More shocks and more emotional. Watching both in the cinema , the reactions to this in cinema was unbelievable compared to endgame. Dont get me wrong endgame is good but to say its the best marvel film is jus marvel fan boys being stupid. I just dont see how people are saying endgame is the best marvel film when theres clearly other marvel films better than it! But trust me this is the film that changed the mcu , lol maybe it because i wanted them to lose because thanos is badass!!!!!!!!!!!!!!"
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6320793",
      "warningSpoilers": true,
      "date": "29 November 2020",
      "rate": "10",
      "helpful": "33 out of 45 found this helpful.",
      "title": "avengers infinity war",
      "content": "A wonderful movie and the action scenes in the film are some of the most wonderful, especially in the Battle of Titan. I liked the fact that Thanos was capable of defeating all the battles in the film and he did not use a plan and the end was sad, especially the death of Spider-man"
    },
    {
      "username": "Filmdokter",
      "userUrl": "https://www.imdb.com/user/ur38220046",
      "reviewLink": "https://www.imdb.com/review/rw7479722",
      "warningSpoilers": false,
      "date": "25 October 2021",
      "rate": "8",
      "helpful": "17 out of 21 found this helpful.",
      "title": "It all led to this: superhero film at its best",
      "content": "#MCUrewatch. A confrontation that has been in the making for dozen of films. Thanos finally arrives. And boy he doesn't disappoint. He is by far the most interesting MCU villain: strong, nuanced and perfectly performed by Brolin. This really is HIS movie. The film has a train like speed and one impressive sequence is followed by the next. Especially the banter between Thor and the Guardians and Iron Man vs Strange is what makes these Marvel films so fun to watch. Great climatic ending (a well ending...). As a stand-alone film it might not be as good as some others but as a showcase of what MCU has achieved, it has never been better."
    },
    {
      "username": "shawneofthedead",
      "userUrl": "https://www.imdb.com/user/ur48490287",
      "reviewLink": "https://www.imdb.com/review/rw4141918",
      "warningSpoilers": true,
      "date": "25 April 2018",
      "rate": "10",
      "helpful": "1,677 out of 2,822 found this helpful.",
      "title": "This movie will blow your mind and break your heart - and make you desperate to go back for more. Brave, brilliant and better than it has any right to be.",
      "content": "Over the past decade, Marvel has earned itself the benefit of the doubt. The studio has consistently delivered smart, funny, brave films that both embrace and transcend their comic-book origins. The 18 blockbuster movies produced since Iron Man first blasted off into the stratosphere in 2008 have not only reinvented superhero films as a genre - they've helped to legitimise it. Indeed, Marvel's two most recent films - Thor: Ragnarok and Black Panther - have received the kind of accolades usually reserved for edgy arthouse flicks. And yet, it's perfectly reasonable to be apprehensive about Avengers: Infinity War. This is a blockbuster film that's been ten years in the making, its plot hinted at and scattered throughout 18 other movies. It features 30 or so characters, each with their own complex backstories and motivations. And all of them are coming together in a bid to stop a giant purple alien dude from destroying the universe. It sounds ridiculous, and feels impossible. But that's precisely what makes the final product such a monumental achievement. Masterfully directed by Anthony and Joe Russo, Infinity War is bold, brainy filmmaking at its very best: the kind that will lift your spirits, blow your mind and shatter your soul - occasionally in the same scene. It demonstrates on an epic scale what Marvel has known all along: that special effects and tightly choreographed action are there to serve the story. For all its blockbuster spectacle (and there's almost too much of that), the film works because it's anchored by the heart, humour and humanity of its characters.The film's basic plot is simple: Thanos (played via motion-capture by Josh Brolin), intergalactic purveyor of death and destruction, has long been on the hunt for the six Infinity Stones that will give him complete control over the elemental building blocks of the universe. He dispatches his acolytes to Earth to retrieve the Time Stone, currently in the possession of Dr. Stephen Strange (Benedict Cumberbatch), and carve the Mind Stone out of the forehead of Vision (Paul Bettany). It's a literal existential threat so terrifying that all the heroes we've come to know and love - from the Avengers to the Guardians of the Galaxy - must put aside their differences and unite against a common foe. From the outset, it's immediately clear that neither the film's directors nor screenwriters (Christopher Markus and Stephen McFeely) are interested in playing it safe. Most other superhero films are bled of high stakes - the hero in the title might suffer untold trauma, but it's a super-safe bet that he or she will make it to the end alive. There's no such guarantee here. Within the first ten minutes, we are confronted with the dark, twisted depths to which Thanos and his acolytes in the Black Order will sink in order to achieve their goals. Death, as well as genuine loss and sacrifice, is intrinsic to the narrative drumbeat that drives Infinity War ever forward, and the film is all the better for it. That's not to say the movie is a morbid and depressing experience. What's so impressive about Infinity War is how it expertly juggles its constantly shifting tones and moods. When it's funny (and it very often is), it's deeply, truly funny. The film finds maximum joy in flinging characters together with merry abandon, mixing and matching ones you'd never have expected to share scenes or trade banter. Peter Quill (Chris Pratt) is floored by Thor's (Chris Hemsworth) godly muscles. Bruce Banner (Mark Ruffalo) is charmed by the wit and intelligence of Shuri (Letitia Wright). And it'd be impossible to not be utterly delighted by Peter Dinklage's inspired cameo. It's a blithely tongue-in-cheek sensibility shared by Marvel's best comic books, which understand that humour can make you care when it really counts.And, boy, does Infinity War make it count. There are many heartbreakingly human moments threaded throughout the film: from the charming surrogate father-son dynamic shared by Tony Stark (Robert Downey Jr) and Peter Parker (Tom Holland), to the undeniable love that ties Vision and Wanda Maximoff (Elizabeth Olsen) together. In many ways, the film stands as a testament to the human capacity not just to love, but to love fiercely and beyond all logic. It's right there when the unfailingly noble Steve Rogers (Chris Evans) declares, \"We don't trade lives\", even when giving up one could save billions. There's even a chilling echo of it in Thanos himself. A lesser film would have turned Thanos into a one-dimensional villain, much the way he's all monster and maniac in the comic books. In Infinity War, however, Thanos' end goal is surprisingly relevant when it comes to thinking and talking about the staggeringly overpopulated world in which we live today. There is, as it turns out, method to Thanos' madness. It makes the tragic twists and turns in his relationships with his estranged adopted daughters, Gamora (Zoe Saldana) and Nebula (Karen Gillan), all the more unsettling. For the most part, Infinity War does justice, too, to the many heroes who have been assembled for the film. The Russo brothers displayed great skill at interweaving multiple perspectives and character trajectories in Captain America: Civil War, and they do so again here, with twice as many characters. Even the most minor of supporting players, like Don Cheadle's James Rhodes/War Machine, are given story beats that land. It helps that Marvel has always taken care to cast genuinely good actors in roles that might otherwise come off as silly and slight. Even so, there are a few standouts amongst this enormous and enormously talented cast. Emotionally speaking, this is Downey's film. He plays every note of Tony's reluctant courage and bone-deep trauma, as he embarks on what he's convinced is a suicide mission. He's ably matched by Cumberbatch, who finds vulnerability even in his character's most cunning and calculative move. Hemsworth, meanwhile, is given free rein to import the big-hearted comedic swagger of Thor: Ragnarok into this film - while also layering it with a deeply-felt, jagged grief for the losses he has suffered at the hands of Thanos and the universe.In a film with so many moving parts, some elements don't work quite as well. A couple of characters that you might have expected to be right at the forefront - including an original Avenger or two - fade into the background. The film tumbles from dizzying fight scene to dizzying fight scene, and while most of them are fantastically choreographed, there are some purely dumb moments that literally revolve around attempts to prevent Thanos from clenching his fist. In effect, this is a superhero mêlée that's part over-the-top and part overkill, and might prove too much for those who don't already care for this franchise and the characters in it.Minor quibbles aside, though, Infinity War is yet another step in the right direction for Marvel. It continues the studio's tradition of placing a premium on rich, complex storytelling that respects both its characters and its audiences. But it also refuses to make things easy for itself. The film ends even more bravely than it began, with a final ten minutes that will haunt and horrify you in equal measure. It's a stroke of bold, brilliant genius - a narrative risk so audacious that you'll want to follow Marvel wherever it goes next."
    },
    {
      "username": "Jesper2801",
      "userUrl": "https://www.imdb.com/user/ur2950600",
      "reviewLink": "https://www.imdb.com/review/rw4143168",
      "warningSpoilers": false,
      "date": "26 April 2018",
      "rate": "10",
      "helpful": "95 out of 125 found this helpful.",
      "title": "Somehow they pulled this off",
      "content": "I consider myself a big comic book marvel fan. My favorite films from the franchise so far, are Cap. American: Winter Soldier and Thor: Ragnarok. As this movie was directed by the same guys as Winter Soldier and Civil War, I went into this movie with sky-high expectations. I am gonna keep this brief: Avengers: Infinity War blew me away! If I should mention just one thing that really amazed me was the character of Thanos. He is so well developed and makes for a super interesting and complex villain. As an audience, we are actually capable of sympathizing with a guy, who wants to kill off half of the universe. It's not about power or dominance. It's about preserving life in a Universe with finite resources - a goal with leads him (and the avengers) into several interesting moral dilemmas. I agree with the other reviews here. This movie is such a beautiful calamity of 10 years of the best superhero entertainment there is. Thinking about it, I can't really grasp how the director pulled this off. So many well developed characters from different story lines are working together in a true cinematic symphony. I give this movie my highest recommendations. It's a must-see for anyone with just a remote interest in the franchise."
    },
    {
      "username": "cartermain",
      "userUrl": "https://www.imdb.com/user/ur89226807",
      "reviewLink": "https://www.imdb.com/review/rw6506593",
      "warningSpoilers": false,
      "date": "20 January 2021",
      "rate": "10",
      "helpful": "258 out of 280 found this helpful.",
      "title": "A film that pulled off the impossible.",
      "content": "Avengers: Infinity War is a film that should be utter crap. A franchise stretching almost twenty films is unheard of. And making a great and satisfying climax to that franchise is nearly impossible. Considering how many characters Marvel had to juggle together with this movie, there was almost no way this movie wouldn't suck.But it didn't. Marvel pulled it off. All of the characters were balanced seemingly effortlessly. The action was amazing. The characters were funny. The story was compelling. Marvel made what should've been an overcrowded mess into one of the best superhero films ever made.This movie will sit you on the edge of your seat for 2 and a half hours. Hats off to the writers, directors, producers, and Marvel Studios.10/10"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw4151538",
      "warningSpoilers": false,
      "date": "2 May 2018",
      "rate": "9",
      "helpful": "42 out of 67 found this helpful.",
      "title": "Extravagant clash of the titans",
      "content": "Have found myself liking or loving a lot of Marvel's previous work, while finding a few faults with most. It is very easy on the most part to see why they are highly regarded critically, though those more critical of their work have raised criticisms that can be agreed with by me. Loved the first 'Avengers' film, while 'Age of Ultron' was more problematic and generally a lesser Marvel effort though still having a good deal to admire. 'Infinity War' for me was the best one, or the one enjoyed most. Would also go far to say it's one of Marvel's overall best, and a perfect example of how to do a superhero film and how to balance a large cast of characters and a lot going on. Can totally see why it has been so positively reviewed and it deserves the positive hype from personal opinion, though would hesitate in calling it flawless or one of the best films ever. More could have been done with the very end, which felt like it ended a little too suddenly without resolving everything to full effect. It may very well have been leaving room for a follow-up, but to me it's always been dangerous somewhat to do that just in case a follow-up doesn't happen.Scarlett Johansson also has far too little to do, with too short screen-time. Black Widow is the only character to me who felt underdeveloped and Johansson struggles to do much with it.However, the rest of the cast are spot on. A big shout out goes to Josh Brolin, who makes for a menacing and melancholic Thanos. Speaking of Thanos, Marvel have tended to underwhelm with their villains, underwriting them and giving them vague or inconsistent motivations. Thanos is easily one of the best Marvel villains along with Hela, one of the most interesting and of surprising complexity where he is a threat but one can see his point of view.Robert Downey Jnr, Chris Evans and Chris Hemsworth are also standouts of a near-uniformly great all-star cast. There are a lot of characters here, but somehow on the most part it didn't feel like there were too many (a big danger with films with many characters and a trap fallen into quite a lot). They hold a lot of intrigue and manage not to be too sided and true to character. Likewise, the story is very eventful with a busy main story and several subplots. Yet it didn't feel sprawling and managed to make sense and never lose engagement. Basically it's a non-stop thrill-ride and tautly paced, with some reveals that leaves one gasping, twists that genuinely shock, rousing entrances and some of the finest action sequences of any Marvel film or any film recently, that are truly exciting and big in scale without being too noisy or exhausting. The climax is truly epic, in scale, spectacle, thrills and emotion. 'Avengers: Infinity War' hugely impresses in the script too, with snappy banter, hilarious quips (along with 'Thor: Ragnarok' this is one of the funniest Marvel films, Thor has the best of it), tension and an emotional poignancy not seen to this extent or as strongly in Marvel films. It's all intelligently handled and the humour didn't feel misplaced or inappropriate to me, this is a Marvel film that delivers on the spectacle and thrills while also having brains and heart. Marvel never disappoints when it comes to the production values. 'Avengers: Infinity War' is not an exception. It's beautifully and atmospherically designed, slickly filmed and edited and the special effects, not overused or abused, are some of the most extravagant and spectacular for any film seen recently. It's tightly directed and dynamically and rousingly scored. Overall, an excellent film and one of my standout viewings of all the films seen so far from the first half, and overall, of 2018. 9/10 Bethany Cox"
    },
    {
      "username": "Platypuschow",
      "userUrl": "https://www.imdb.com/user/ur57590728",
      "reviewLink": "https://www.imdb.com/review/rw4152970",
      "warningSpoilers": false,
      "date": "4 May 2018",
      "rate": "9",
      "helpful": "59 out of 97 found this helpful.",
      "title": "Avengers Infinity War: Marvels crown jewel",
      "content": "Let me be clear Infinity War is not flawless, it has its faults but thankfully they are overshadowed by two hours of awesomeness.Every movie in the Marvel universe for the last decade has ultimately been building up to this therefore expectations were through the roof and for the most part it delivers.Almost every character from the MCU teams up to face its most dangerous foe yet, the mad titan himself Thanos and if you know anything about the comics then going in you'd know to brace yourself for heartache.With all the hype as to who wouldn't survive the film I'm left wondering just how many deaths are permanent, this is a superhero universe after all so never say never.Though the story and Thanos's motivations differ from the comic this can be forgiven as the new story is wafer thin but competent.As you can imagine one of the most exciting things about Infinity War was uniting heroes we've never seen side by side and that certainly delivers on all fronts. The action is thick and fast, despite the dark overtone we have plenty of comedy and teenage Groot didn't ruin the film like I feared he would.Obviously this is not a big finale and merely a high profile chapter in a much larger story but the movie is highly climatic regardless.I am saddened that this wasn't a two parter, alike Civil War (2016) this was a huge story and perhaps should have been broken up across movies.Infinity War is a contender for the best Marvel movie and instead of feeling burnt out after the never ending stream of films this has wet my appetite for more and I can't wait for the next film.Excellent stuff, though where in the blue hell was Ant Man?The Good:Children of ThanosThanosAll out action as expectedTies everything together nicelyThe Bad:Peter Dinklage (Never thought I'd say that)So many characters were spread too thinThings I Learnt From This Movie:If Thanos and Cable ever meet its going to be super weirdDishonest footage/photos are commonplace now (Look up the footage of Hulk in Wakanda running with the rest of the team) Seriously, never happened.Somewhere out there right now are DC fans claiming this is a bad film"
    },
    {
      "username": "eva3si0n",
      "userUrl": "https://www.imdb.com/user/ur116634983",
      "reviewLink": "https://www.imdb.com/review/rw6454407",
      "warningSpoilers": false,
      "date": "8 January 2021",
      "rate": "8",
      "helpful": "23 out of 34 found this helpful.",
      "title": "The first Marvel film I really liked",
      "content": "The first Marvel film I really liked. Surprisingly in the film there are many spectacular scenes, which are well held and the main transition between them is made seamless, which does not make you miss. And the main thing that surprises the film - the ending, it really makes it clear that Marvel now plays big, since began to break up with the main heroes of the giving films."
    },
    {
      "username": "garethvk",
      "userUrl": "https://www.imdb.com/user/ur1210420",
      "reviewLink": "https://www.imdb.com/review/rw4141434",
      "warningSpoilers": true,
      "date": "24 April 2018",
      "rate": "10",
      "helpful": "1,238 out of 2,298 found this helpful.",
      "title": "A Summer Film That IS Even Better Than The Hype",
      "content": "Summer movies often hype themselves as spectacular events not to be missed and their ad campaigns use words like \"epic\", \"spectacle\", and \"smash\" as ways to build the hype to increase advanced box office sales. The summer 2018 film season kicks off in a big way with \"Avengers: Infinity War\" and it is the rare summer film that exceeds is lofty expectations and delivers a crowning achievement for the Marvel Cinematic Universe. When Thanos (Josh Brolin), embarks on a deadly campaign to find and possess the Infinity Stones, he leaves a path of death and destruction in his path. When his pursuit leading him to Earth, Bruce Banner (Mark Ruffalo), and Doctor Strange (Benedict Cumberbatch), who enlist a reluctant Tony Stark (Robert Downey Jr.), to the cause just as the minions of Thanos arrive. With The Avengers fractured and scattered following the events of \"Captain America: Civil War\" the teams find themselves dealing with the threat in various groups as fate steps in to divide many key members of the team. This allows for a great entry by the Guardians of the Galaxy and allows the film to take a very enjoyable path. Essentially the movie weaves separate storylines into one cohesive and very satisfying epic. You have a story with the Guardians as well as one with many of the key Avengers, as well as others with characters old and new. As such it is like a Guardians, Avengers, and Marvel film all rolled into one and each one supports the other very well yet has the charm and identity you would expect. While the tone is very dark as you would expect with literally half of the known universe facing destruction, there is also some solid humor in the film that never once undermines the story or pacing. Naturally the effects are stunning as you would expect as Marvel has put a significant amount of money into the film and it shows in every eye-popping action sequence. What really impressed me the most was that the Russo Brothers never let the FX of the film overshadow the characters and with a very large cast, it was nice to see everyone got their moment and you did not see members of the cast trying to one up each other. There are some real surprise moments along the way and the action is easily the best of any Marvel film to date. Many fans had expressed disappointment with \"Avengers: Age of Ultron\" for me this film is significantly better than the prior film and is everything that a Marvel fan would want in a film. I was also surprised by how well Thanos was portrayed as while you hopefully will not agree with his deductions and methods; you could actually understand his motivations and it help him transcend from the usual megalomaniacs which are so common in films of his type. I am really looking forward to seeing what comes next and make sure you stay through the credits for a bonus scene. Believe the hype, \"Avengers: Infinity War\" is an epic not to be missed and is an example of what a summer event film should be. 5 stars out of 5"
    },
    {
      "username": "jordanthomas_2009-346-914758",
      "userUrl": "https://www.imdb.com/user/ur33196427",
      "reviewLink": "https://www.imdb.com/review/rw4201100",
      "warningSpoilers": false,
      "date": "12 June 2018",
      "rate": "8",
      "helpful": "42 out of 66 found this helpful.",
      "title": "Breathtaking",
      "content": "Infinity War does a brilliant job by seamlessly combining the last few films together. It picks up where Ragnarok left off on the space shuttle with Thor, Loki, Hulk and all the remaining Asgardians. It opens with a distress call as Thanos and his Dark Order have slaughtered most of passengers including some of the remaining Asgardians. He interrogates Thor and beats Hulk so bad he is too scared to ever turn green again. A defeated Hulk/Bruce Banner is then transported to Doctor Strange's Sanctum Sanctorum so he can warn him of Thanos' arrival. It is down to Doctor Strange, Wong, Tony Stark and Spider Man to prevent Thanos' evil minions from destroying New York and taking the time stone. It's a thrilling action sequence that introduces Starks cool new nano-bot armour that creates its own swords and shields. Thanos has been teased since 2012 and the wait has paid off here as he is by far one of the best villains. The story is more about him achieving his goals which is refreshing to see as the villains are normally sidelined in these films. He is so determined to get all six gems, each gem making him stronger. The Avengers and Guardians have to race against time to stop him from finding all six. One sequence on his home planet 'Titan' is worth mentioning and like most of the film, it is breathtaking and tense. His crew (Dark Order) also seem unbeatable as they battle the rest of the Avengers in Wakanda with their alien army which also proves difficult. Thanos gets some interesting backstory, it would have been even better if the menacing Dark Order got some backstory themselves as we never really understand them or their motivations.Even though it enters familiar ground, it is often done differently and most of the time it's unpredictable. It's full of surprises and twists which will leave you exhausted by the end. Although Infinity War feels over stuffed with characters and storylines, the Russo Brothers do an exceptional job by giving each character enough to do. Its great to see some focus on characters like Gamora and Thor as previous films have kept it prominently on characters Iron Man, Hulk and Captain America. That's not to say they don't get anything to do because they do, it's just not as much as usual. This entry really does require you to see all of the ones before it as it can become confusing. They often call back to previous events and storylines, so it's a better experience if you are familiar with all of them. There are also so many fun references like Rocket Racoon's need for artificial limbs, Thor's new haircut and Drax's constant quips. There are too many visual effects shots which could have been avoided using practical effects. The CGI shots don't look bad, but sometimes they can be distracting. However it's a technique that is quicker than any other, and with studio films of this scale that's just a small price to pay. The action scenes are so well directed accompanied by a music score by Alan Silvestri who always adds that extra level of excitement to them. It is a relief to say Infinity War runs well over 2 hours 30 minutes which is the longest Marvel film. There is no point saying its \"baggy\" or \"overlong\" as fans of the franchise will greatly appreciate this and with so much going on the runtime is justified."
    },
    {
      "username": "miacoop",
      "userUrl": "https://www.imdb.com/user/ur125909497",
      "reviewLink": "https://www.imdb.com/review/rw6452244",
      "warningSpoilers": false,
      "date": "7 January 2021",
      "rate": "10",
      "helpful": "17 out of 24 found this helpful.",
      "title": "Amazing",
      "content": "With Thanos come into play you think that the avengers would be able to tackle this problem but no. After re-watching Infinity War multiple times it still gets me because it's sad the ending really is just another cinematic masterpiece which Marvel always pull off and the fight scenes are amazing. Marvel have some of the best actors and the best casts I'm not applaud them for that. No mad Steve was just sexy after mate and I loved it a lot."
    },
    {
      "username": "ACollegeStudent",
      "userUrl": "https://www.imdb.com/user/ur118665987",
      "reviewLink": "https://www.imdb.com/review/rw7652040",
      "warningSpoilers": true,
      "date": "17 December 2021",
      "rate": "9",
      "helpful": "11 out of 16 found this helpful.",
      "title": "The Bar for Super Hero Cinema",
      "content": "Rating: 9.0This went where no other mainstream superhero movie went and killed everyone, allowing Thanos to win. The biggest flaw I can think of with this is that there are other ways to achieve Thanos's goal without killing everyone, and there were some plot grievances like Corvus Glaive somehow sneaking all the way to Shuri in the battle unnoticed, and them not just digging under Wakanda's shield to begin with (they did later in the battle). Also, destroying an infinity stone should cause the universe to collapse in some way as explained in Endgame about taking stones from universes, so I'm not sure why none of the main cast raised this issue when destroying the mind stone was ratified into their gameplan (they might have not known better, though). Otherwise, great pacing, a great soundtrack, crisp visuals, seamless comedy, a compelling and humanized villain, and a haunting ending."
    },
    {
      "username": "Horst_In_Translation",
      "userUrl": "https://www.imdb.com/user/ur3914439",
      "reviewLink": "https://www.imdb.com/review/rw4153546",
      "warningSpoilers": true,
      "date": "4 May 2018",
      "rate": "8",
      "helpful": "15 out of 25 found this helpful.",
      "title": "Taking the genre to the next level",
      "content": "\"Avengers: Infinity War\" is the newest addition to the now already long-running Marvel superhero franchise and in my opinion this movie is a definite contender for best installment of all. These 2.5 hours were directed by Anthony and Joe Russo, who started with Community and then entered the Marvel world with Captain America and for this new Avengers movie, they reunited with writers Markus and McFeely. Let me start by saying that I was a bit critical about previous Marvel films, especially Avengers movies as they frequently united way too many characters without properly elaborating on most of them. And the stories about them failing on their own against the villains, but eventually managing to succeed as a team after overcoming their conflicts and differences was gently-speaking not too new or creative. But this one here is different. Almost all characters have their moment to shine really, well Black Widow could have had a little more than that Hulk moment, but she is the exception. Even those they added new now like the Guardians of the Galaxy and the characters from Black Panther add their fair share of material worth seeing. Peter Dinklage is pretty interesting and memorable as a dwarf (yep!), the stories on romance and male friendship are nice to watch too and even Benedict Cumberbatch is tolerable for once.I think that movies, especially superhero films, often stand and fall with their villain and here we have Thanos played by Josh Brolin as the main antagonist and he is just utterly great and memorable. Maybe you could say that his (self-perceived godly) ambition to erase half the planet is a bit too mathematical, but everything else about him is outstanding and I have virtually no doubt that he will end up as one of the most memorable villains of the movie year 2018. Even in his weaker story lines, like the part with his \"daughter\" that does not feel entirely convincing early on, he shines and elevates the material to a level where it really saves this entire part of the movie. So yes huge thumbs-up for Thanos. And another thumbs-up for virtually everybody else. Except Starlord unfortunately because honestly his grief may have been huge, but the how he basically destroyed the Avengers' effort that had them close to victory was just ridiculous, so to some extent you can blame him for billions of people dying eventually. Or are they really? I believe there will be a new Avengers movie in 2019 by the same team of writers and directors, so the ending may not be as finite as it seemed to be. You can almost call it a duology. Is all hope really lost? We have to wait a year and see. Honestly I doubt it because there will be a Black Panther 2 for sure at some point, so I guess they will find a way to get things right again for the good guys. It will also be interesting to see if they bring back those who died earlier too, not just those that vanished at the very end.Anyway, this film we have here is one that will make a huge impact come awards season 2018/2019 in all technical categories, especially Visual Effects where it is maybe a lock for an Oscar nomination with a great chance to take home the win. Another thing I would like to say about this film is that it is also a triumph in terms of the comedy, which is not always a success in Marvel works. But here there are some really hilarious scenes and as many bad things as I said about Chris Pratt's character earlier, his banter with Thor is hilarious. And there is a lot more of course. Drax is also amazing in that one scene where he stands there doing nothing. You will recognize many other pretty funny moments when you see them. So what is it that made this film so amazing. I would say it is the script this time. It is bold, daring and not scared of anything while never becoming too absurd or unrealistic (and yes that is possible for superhero films *cough* Deadpool *cough* glad we did not see him in here). But the outcome here is the exact opposite of too many cooks spoiling the broth, both character- and writer-wise. You absolutely do not want to miss out on this one and good thing is you really don't need to have seen any other Avengers or Marvel movie to appreciate the quality we were given with this one. I am truly very curious about the sequel and cannot wait to check it out. This third Avengers movie is my favorite 2018 release at the point of April. And it has a huge chance to stay in the top5, probably top3 until the end of the year. It never dragged, which is always a success for this running time and it gets better by the minute the longer it goes. And the way things turn out eventually reminded me a bit of the last Wolverine film \"Logan\". Happy endings are no longer essential. Realism is what it is all about. Highly highly recommended."
    },
    {
      "username": "Dello_",
      "userUrl": "https://www.imdb.com/user/ur103462518",
      "reviewLink": "https://www.imdb.com/review/rw7313922",
      "warningSpoilers": false,
      "date": "6 September 2021",
      "rate": "10",
      "helpful": "12 out of 18 found this helpful.",
      "title": "The standard for every crossover movie",
      "content": "Though this is not my favorite MCU movie I think \"Infinity War\" is the best product the studio produced both because of the really high scope and because of the execution itself. I think the movie is so great because it contains almost everything you could ask (action, humor, heartfelt moments, great CGI, fantastic score, ...) in a balanced way. Furthermore even if the culmination of the MCU happened in \"Endgame\" it was here that every piece of the Marvel Universe was brought together for the first time. I remember to have an astronomical hype at the time and the fact that the movie resulted to be even better than what my hype was making envisioning me is something that I highly count. But the best part of this movie is its villain, Thanos. I loved him (and still do) and he absolutely stole the show and sets up Endgame perfectly. Clearly \"Infinity War\" has its flaws and I am not here to say it is perfect like a 10/10 rating would usually mean, but for what it represented at the time and the way it was delivered I think we couldn't have asked for more."
    }
  ],
  "errorMessage": ""
}