{
  "imDbId": "tt0169547",
  "title": "American Beauty",
  "fullTitle": "American Beauty (1999)",
  "type": "Movie",
  "year": "1999",
  "items": [
    {
      "username": "the-evil-cult",
      "userUrl": "https://www.imdb.com/user/ur2354731",
      "reviewLink": "https://www.imdb.com/review/rw0593815",
      "warningSpoilers": true,
      "date": "15 January 2004",
      "rate": "10",
      "helpful": "1,378 out of 1,526 found this helpful.",
      "title": "Entertaining and Thought-Provoking.",
      "content": "Of the 250+ films I've seen and rated on IMDb, only one other (Schindler's List) is as good as American Beauty. A film like this not only entertains while you're in the theater but also drops subtle questions in your head about the nature of human behavior and the gulf between fantasy and reality. After watching this movie, viewers will think long and hard about their own lives as well as the lives of people around them. The movie spells out the social disillusionment phenomenon everyone experiences but can't really grasp.American Beauty reminds us that, like Lester, we really have no idea what we really want. We're not rational creatures as economists assume we are. Our instinct might lead us to perform one action, yet our brains might tell us to perform the complete opposite. We may lust after material belongings, yet how do we know we will still treasure those material belongings once we obtain them? Lester may lust after Angela, yet once he feels her in his hands and finds out the truth about her sexuality, an entirely different feeling comes over him.Ricky Fits, the drug-dealing boy next door, is able to look beyond conventional notions of attractiveness and find beauty in non-promiscuous, solemn girls as well as in plastic bags floating in the wind. When many criticize the movie, they say, \"Where's the beauty in a plastic bag?\" And that's the point. We live in a world of aesthetic subjectivism. What one person finds attractive, another may find repulsive, yet the urge is there for people to assume aesthetic absolutism. \"It's just a plastic bag! How can there be beauty in it?\" Well, a human being is just an aggregation of tissues, bones, and blood. How is that attractive? It depends on how you look at it. Reality is shaped by perspective.Some people criticize the Ricky Fits character because he records his life experiences on tape and doesn't actually experience them. But time moves inexorably in one direction. Time cannot be stopped. In a physical sense the past and the future don't exist. We are only conscious in the present. Everything we do, everything we achieve, every bit of happiness we experience -- they are all eventually buried in the past by time. Recording subjective beauty is a means by which one can attempt to salvage beauty from the past into the present because time eventually destroys all beauty. If you don't believe me, walk into a pre-school and then walk into a nursing home. Remember that all the old men and women in the nursing home were once little kids.Another profound element of American Beauty is in the tag line: look closer. An individual's behavior is not independent of his environment. Humans are conformists by nature, and humans will modify their behavior to assimilate into existing social categories. If any individual dares to stray from the category to which he has been assigned, he is shouted down and ostracized. No one can resist the urge to conform, so why bother? Everyone is nice in public, yet on the streets they blare their horns, scream, and swear. Some boys I know pretend to hate American Beauty because on the surface it seems like a \"chick flick.\" They force themselves to watch gory horror movies and show off to others how they can stomach intense violence and excessive sex scenes. In American Beauty, Angela acts like a total slut, as many girls seem to be nowadays. In the end, however, she is not what she makes herself out to be. Colonel Fits tries to act like such a man, yet in the end it's all just a giant facade. Civilization is but one giant movie, and members of society must start acting their parts if they want to belong to this civilization. Otherwise, they're outsiders. Try walking into a job interview without a tie. You'll be thrown out. That is the power of convention.What if I asked you this question: What do you want in life? Most people would say, \"happiness.\" But is happiness worth deluding yourself for? Carolyn Burnham shields herself from sadness by adopting a positive-thinking philosophy, a philosophy of self-affirming mantras and harsh self-discipline. Positive thinking may help you attain your goals, but positive thinking also blinds you from reality. Is it wise or moral to change the channel when you hear about mass starvation in Africa so you can enjoy moments of fleeting happiness from a cheap romance movie? Self-help is just a euphemism for self-deception. All humans need some complex fraud to distract them from the harsh and nihilistic realities of life, whether it's religion, money, or even love.In spite of American Beauty's greatness, there are problems. Characters are stereotypical, but viewers will hardly notice unless they're ultra-critical. Anyway, exaggeration is essential in satire so that certain points are made obvious to viewers. Furthermore, Alan Ball's original screenplay is slightly edited. The ending is more optimistic.Problems aside, Sam Mende's debut movie is one of the greatest I've seen. Not only is it entertaining but it is also filled with interesting ideas. It's an important film for society because there's so much society needs to learn. One boy I knew refused to watch American Beauty because, as he said, \"I'm not gonna watch a movie with a name like that!\"Look closer.10/10"
    },
    {
      "username": "RueMorgue",
      "userUrl": "https://www.imdb.com/user/ur0476267",
      "reviewLink": "https://www.imdb.com/review/rw0591850",
      "warningSpoilers": false,
      "date": "29 May 2000",
      "rate": "10",
      "helpful": "613 out of 714 found this helpful.",
      "title": "An Oscar well deserved.",
      "content": "This film is one of a kind. After seeing this film last week, I was left with a hole in the pit of my stomach. It left many questions in my mind, and most of them cannot be answered. In my view, a film that makes me think after I watch it is second-to-none, and this film certainly delivers in that aspect.I was amazed with the vivid imagery in this movie, as well as with the symbolism. However, what makes this film the best of 1999 is the acting. Kevin Spacey shines as Lester Burnham, and Annette Bening (Carolyn Burnham) isn't far behind. Supporting cast members such as Wes Bentley (Ricky Fitts), Thora Birch (Jane Burnham), Mena Suvari (Angela Hayes), and Chris Cooper (Col. Frank Fitts) only add to the drama of this film. I think the most special aspect of this film is how all of the characters intertwine in a way that is believable, yet fantastic at the same time. I congratulate Sam Mendes for his direction of this film, as well as Alan Ball for writing it. I don't think it could have been any better.Rated R in the U.S. for strong sexuality, language, drug content, and violence, the film obviously deserves its rating. However, none of the causes for the R rating are overbearing, and all of them add to the plot-line of this film. While I don't think that this is a film for children, I would suggest that adults should view it with an open mind. I believe that the traits which many of the characters in this film have are found in many people around the world. Perhaps that is why this film hits close to home for so many viewers.While billed by some as a \"comedy-drama\", I don't see anything about this film as funny. Sure, there are some comedic moments, but by the end, those moments were all but forgotten when faced with the grim reality of the conclusion of the events portrayed in this film.If you want to watch a light-hearted film with some elements of comedy and some elements of drama, don't see American Beauty. But if you enjoy films that make you think, and are entertained by an excellent cast, excellent directing, and an excellent screenplay, this film should be at the top of your list.My Rating: 10/10"
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0592440",
      "warningSpoilers": false,
      "date": "14 August 2001",
      "rate": "10",
      "helpful": "195 out of 249 found this helpful.",
      "title": "An American Masterpiece",
      "content": "This is by far one of the best, if not THE, movies of the 90's. \"American Beauty\" stole my vote immediately as I started watching it. The idea and concept of \"American Beauty\" is just some ordinary people on an ordinary block with ordinary lives.Kevin Spacey plays Lester Burnam, a middle aged married man who has lost some hope in life. He has a job that is degrading, a wife who refuses to show any type of loving emotion towards him, a daughter who practically hates herself, and is judged constantly as a looser. But all of a sudden, he sees his daughter's friend, Angela, and something snaps in him to do something with his life. He quits his job and takes, the dreaded by most Americans, a fast food cook job. He starts working out and doing some illegal substances. Even though this sounds like he is ruining his life, it actually helps him and makes him realize how much he loves \"the precious moments in his stupid little life.\" You have no idea what he is talking about I'm sure, but don't worry, you will some day. Kevin Spacey was by far the best actor in 1999 and deserved this Oscar 100%.Annete Benning plays Carol Burnam, Lester's wife. She is a very fake and unsuccessful real estate agent who cannot get a sale. Her image in life is \"in order to be successful, one most project an image of success at all times\". You can tell, she is not happy with her marriage and starts to have an affair with the big boss of the real estate company. Again, seems horrible, but it helps her in the end. Annete was unfortunately robbed of an Oscar for this film.The supporting cast: Thora Birtch who plays Janie, Lester and Carol's daughter, is extremely depressed and hates her body and herself. But when she notices a strange boy next door and develops a relationship with him, she realizes how precious life is and starts communicating with her family. Mena Suvari plays Angela, Janie's best friend, Lester's crush, and a girl who is clearly insecure despite her attempts at showing her sexy side to every guy in town. Wes Bentley plays Ricky, the next door neighbor boy who looks at something as simple as a bag being tossed in the wind as something beautiful. Some say that this was a very stupid scene, but I disagree. His dialog was perfect and made us look twice at something so simple. He won most of our hearts despite having somewhat of an arrogant attitude. Wes without a doubt got robbed of a nomination for this movie. Chris Cooper plays Ricky's father, Col. Frank Fits. He is a military Sergent who is very abusive to his wife and son and is an obvious homophobic that turns into an ironic situation in the end. Chris also should've been nominated.The most stunning character actually to me was Allison Janney who played Barbara Fits, Ricky's mom, and Frank's wife. She was so beautiful and perfect. Her scene in the front room with Frank and Ricky, everything is so quite, and she says \"I'm sorry, what?\". Ricky says \"Mom, no one said anything\". When Ricky gets kicked out by Frank after a horrible accusation, Ricky says \"Mom, I'm leaving\". Instead of being like the average mom and trying to stop him or say things will get better, she knows this is best and says \"OK. Wear a raincoat\". Allison was just amazing and didn't get enough credit for her role.If there could have been nominations for every role in this movie, they were well deserved. This is a terrific movie that should be watched by every adult. It'll make you look again at your life and think. What a great movie.10/10"
    },
    {
      "username": "Antithesys",
      "userUrl": "https://www.imdb.com/user/ur0455949",
      "reviewLink": "https://www.imdb.com/review/rw0592084",
      "warningSpoilers": true,
      "date": "9 September 2000",
      "rate": "10",
      "helpful": "769 out of 935 found this helpful.",
      "title": "Beautiful...so beautiful",
      "content": "American Beauty is the greatest movie ever made.If you haven't already, watch American Beauty by yourself and give yourself some time afterwards to think it over. You will never, ever look at life the same way. It does exactly what movies are meant to do - give us a window into ourselves, and American Beauty does that better than any other film has ever done. No word of dialogue is unnecessary, no character exaggerated, everything is perfect...but if you have seen American Beauty you should know that already. Once you look closer at this movie, and see Beauty in every frame, it becomes so much easier to look closer and see Beauty in everything around you. You think I'm waxing poetic? Then you must not have seen the movie. Every character is a part of each of us: the Lester Burnham of change, the Carolyn of uncertainty and failure, the rebellion of Jane, the defeated Barbara, the false control of Angela and the Colonel, and the real control of Ricky. To me Ricky, not Lester, is the center of this story; he somehow controls or sets in motion the heart of Lester's rebirth and downfall. There are several parts of this movie where I lose control every time I see it, and none more so than the paper bag scene. To me that scene is simply the greatest monologue ever written.I listened to the message of American Beauty - look closely and you can find Beauty in anything - and it changed my life. I rose out of a long, deep depression and started out into the world. Sometimes there is so much Beauty in the world, I can't even stand it, and it feels like my heart is going to burst.This is the most beautiful movie I have ever seen."
    },
    {
      "username": "Rusty-61",
      "userUrl": "https://www.imdb.com/user/ur0363933",
      "reviewLink": "https://www.imdb.com/review/rw0592684",
      "warningSpoilers": true,
      "date": "16 September 1999",
      "rate": "",
      "helpful": "169 out of 222 found this helpful.",
      "title": "Could be the best movie of the year.",
      "content": "And there were a lot of great ones this year. I will also say something even (possibly) bolder--that Kevin Spacey gives the performance of his career. And all us movie geeks know that is saying a LOT, given this man's past roles, and his talent. I used to think he was overrated as an actor. Then I figured OK, I see what all the fuss is about. Now, he's up there with my favorite actors of all time, with James Woods, Steve Buscemi, Robert Deniro...probably in the top 5. I was lucky enough to see a free screening this afternoon and boy, am I glad I had the privilege. In fact, this review might not even be that coherent- it's one of those movies that blows you away so much that you have trouble even putting your feelings into words. The plotline sounds trite when you first describe it (it did to me when I first heard about it), Spacey plays a man who describes himself as a loser, with Annette Bening as his horrible, shrewish, self-absorbed, pathetic b*tch of a wife. His daughter is not all that likeable either, despite the fact that you can understand why she turned out this way, with her as a mother. Just when you think you've met the most dysfunctional family in the world outside of \"Happiness\", you find out about the family who just moved in next door. At first, the strange son seems like the most messed-up member of their brood, but after you get to meet his ex-military, abusive, homophobic, terrifying father and his withdrawn, sad, headcase mother, you realize he is the most normal member of the household by far. Then, the filmwriters toss in Kevin Spacey's lustful obsession with his daughter's sexkitten cheerleader friend, which trust me, is a lot more fun, entertaining, and amusing than it sounds when you read about it. Soon, he is having the most entertaining, amusing midlife crisis ever seen in the history of cinema. He just doesn't give a ***k about what he does or says anymore, and you only wish you could get away with doing the things he does.I found myself laughing out loud in this movie so many times, most of it horrified, amazed laughter at what is happening and the things that are coming out of the character's mouths, especially Spacey's. He had at least a dozen lines that had every member of the audience in hysterics and actual applause and cheers. I can't say enough good things about this movie. You think, after the first five minutes, that you know how the movie will end. Well, Spacey's opening narrative does give it away, but trust me, the events unfold in a way that you will NEVER see coming. You will swear you can see what a character is going to do next, what violent or self-destructice act they will commit, but you turn out to be wrong.Without getting too pretentious here, the movie lives up to it's theme/tagline of \"...look closer\". THe characters are not what they seem, up until the end, and even then they surprise you. At least two characters that you are POSITIVE you have figured out, do or say something that turns all your preconceptions of them upside down, while making your jaw drop, and your heart ache. You will leave the movie with a smile, though, and that is maybe what I expected least of all.Words just cannot do this movie justice. See it for yourself."
    },
    {
      "username": "SD-4",
      "userUrl": "https://www.imdb.com/user/ur0147297",
      "reviewLink": "https://www.imdb.com/review/rw0593418",
      "warningSpoilers": false,
      "date": "22 March 2000",
      "rate": "10",
      "helpful": "452 out of 537 found this helpful.",
      "title": "A deep, wonderful, penetrating film; extraordinary irony in a psychological drama about the American life.",
      "content": "I have come to see the movie with a certain prejudice. Everyone saying that it was so wonderful, so touching, so excited -- I usually tend to go with movies that nobody likes. Nevertheless, this one was a certain exception.It is a wonderful psychological drama, a satire about the American community and about the American life; dark, painful irony and cynicism in the descriptions of life and characters; deep sarcasm on types of people in the community, habits of behaviour such as \"...if you want to succeed, you always have to seem successful...\" or \"never stop smiling\", parasites of the community, and, most importantly, the treatment of people who are \"different\", who are \"freaky\" to some extent; and eventually, there is no character in the film that is not odd in its way, although we have to wait for the very ending of the film, to discover this.With very deep and accurate exaggeration, (most of) the characters in the movie demonstrate the worst, the darkest sides of their personality, while still remaining very human, very touching and very involving the observer. Everyone can find a certain similarity with characters and persons who he met in his life, in the characters described in the film. The tragi-comical events, the little pieces of funny, disturbing irony dripping from almost every episode, lead the observer to exploration of the American Beauty -- the beauty in life, and the way that we fail to find it, for all our life; the way we hide our feelings and emotions, even behind sullen walls of our sepulchre.The acting is truly brilliant, the episodes are built logically, coherently, the dialogues are deep, thrilling, intriguing; every sentence and every word is deeply constructed, containing profound irony and intelligent elements of humors. The plot is very intelligently built, constructing a true indication of the sad situation of the American society, and an excellent ground for the actors.An amazing movie, strongly recommended. 10/10"
    },
    {
      "username": "ryan_lynch",
      "userUrl": "https://www.imdb.com/user/ur0577980",
      "reviewLink": "https://www.imdb.com/review/rw0593291",
      "warningSpoilers": false,
      "date": "26 February 2000",
      "rate": "10",
      "helpful": "531 out of 642 found this helpful.",
      "title": "A little masterpiece...",
      "content": "\"American Beauty\" is tour de force cinema. Sam Mendes' brilliant debut feature depicts a web of characters who yearn for their own 'American Dream' - yet, in the end, only one character truly attains it.Having seen \"Happiness\" only recently, I could not help but draw comparisons: both films centre around a microcosm of society in which the people, in their own unique way, all strive to be successful or simply 'happy'. But here the similarities end: the characters in \"Happiness\" undergo a self-realisation process through which they become increasingly aware of their meaningless existence, and go on to wallow in their own depravity. \"Happiness\" shows no signs of redemption; whereas in \"American Beauty\" the audience is offered a sense of hope, of salvation, though the characters must endure a similar fate, or more accurately, they must endure the way of life in which they are trapped.The pivotal character upon which this theme centres, is the father Lester, played impeccably by Kevin Spacey. He is presented to us as a bit of a loser who plays the subjugated figure in the home and at work. He appears resigned to an unhappy life in which he is treated badly by his wife and daughter and his boss at work. Seemingly beyond redemption, Lester transforms from being a loser.Mendes portrays this transformation admirably well: he shows Lester on his 'path to enlightenment' pushed up against a grim background of suburbanite existence. These early scenes are well balanced, forming a steady rhythm of TV commercial-like vignettes which prove very comical, if at times unsettling. As Lester reflects in the film: \"My life is like a commercial\". And how this rings true: like in \"Happiness\", all the characters hide underneath this veneer of normality and respectability, yet they are all revealed to be nothing but the opposite: depressed, depraved and desperate.Lester's wife, played by Annette Benning, is the most success-driven character in the story which renders her the most hopeless in the film's tone of moral conviction. \"In order to be successful in life one must project the appearance of success\" is the maxim she adopts from the 'king' of real estate, Buddy King. It is a phrase which resonates throughout the film: for Benning's pawn, life is all about keeping-up appearances. This is where Lester differs from her: his emancipation is enabled by him discarding the constraints of 'normal life' and following what his heart desires.Lester is the catalyst in this narrative in which the ancillary characters either follow suit (as does his daughter and Ricky) or pay the price (as does his wife and the Colonel). The irony inherent in this film, and it grows with resonance as the film draws to a conclusion, is that the only character who truly becomes free must sacrifice everything in order to achieve it. Yet it is through his sacrifice that he is able to afford the surviving characters a glimpse of hope in life.This film left me gasping for air: its hyper-realism conveys, at the same time, a portrait of the suburban comedy, a jolting-shock of realisation, and a cathartic sense of hope. Mendes depicts a certain people who, to varying degrees, all strive for a certain 'American Dream', yet so few actually attain it. Though whilst one may have difficulty with tagging this film with the 'feel good' label, the beauty of \"American Beauty\" is that it sits half-way between a desperate cry for help and a reassuring sense of happiness and fulfilment and that is cinema at its best."
    },
    {
      "username": "Philip_Pugh",
      "userUrl": "https://www.imdb.com/user/ur2876046",
      "reviewLink": "https://www.imdb.com/review/rw0593792",
      "warningSpoilers": false,
      "date": "29 November 2003",
      "rate": "10",
      "helpful": "380 out of 476 found this helpful.",
      "title": "Beautiful...",
      "content": "Probably the best film of 1999. This dark comedy drama marks two fantastic feature film debuts with Alan Ball as writer and Sam Mendes as director (both winning oscars for their sterling efforts).Kevin Spacey plays Lester Burnham, a man on the brink of a mid-life crisis, who suddenly becomes obsessed with one of his teenage daughters friends played by Mena Suvari. His daughter (Thora Birch) is, as Lester tells us; \"a typical teenager. Angry, insecure, confused...\". And his wife Caroline (Annette Bening) has an obsession of her own, her public appearance.Life starts off on a downer for the Burnhams and their new neighbours the Fitts despite their lives looking good from the outside.As life begins to improve (with most of the main characters finding what they think is love or new relationships) it soon all comes crashing down in the climactic final day.The writing is nothing short of brilliant and made even more amazing by knowing that it comes from a first time feature film screen writer Alan Ball (who had had years of prior experience writing TV sitcoms - not that you'd be able to guess from the tone of this film).The directing is on a par with the writing and Sam Mendes manages to get some brilliant performances from the great cast, who are all faultless. No doubt Mendes' theatre directing past played a huge part in directing the actors so well.Another person worthy of a mention is the late director of photography Conrad L. Hall, another one of the five oscar recipients for this film.All the elements in this film gel perfectly together to make one superb masterpiece. Not one person, either cast or crew, steals this film or does anymore than anyone else to make this film what it is. Truly an ensemble effort. 10/10."
    },
    {
      "username": "uhmartinez-phd",
      "userUrl": "https://www.imdb.com/user/ur17402599",
      "reviewLink": "https://www.imdb.com/review/rw1762332",
      "warningSpoilers": false,
      "date": "12 November 2007",
      "rate": "10",
      "helpful": "179 out of 236 found this helpful.",
      "title": "Close To Perfection",
      "content": "The intention is so clear that everything else falls into place, perfectly. Kevin Spacey's suburban husband and father reminded me of his character in \"The Ref\" and that could only be a good thing. Annette Bening and her giggle works wonders here. Their marriage is a tabloid version of a \"Who's Afraid To Virginia Woolf\" Which means very close to someone we know. The biggest surprises in the film. besides the amazing dexterity of Sam Mendes at his first outing behind the camera, are West Bentley. Chris Cooper, Thora Brch and Allison Janney. As I'm writing this 8 years after its first release, the Oscars and the whole hullabaloo, I'm very surprised that West Bentley hasn't become a major star. He is amazing in \"American Beauty\" the complexities of his character are based on recognizable human stands, the hardest to face up to and I went where he went. Thora Birch is lovely as the object of his attention and the film, I believe, is here to say."
    },
    {
      "username": "The Woof",
      "userUrl": "https://www.imdb.com/user/ur0477423",
      "reviewLink": "https://www.imdb.com/review/rw0592913",
      "warningSpoilers": false,
      "date": "5 November 1999",
      "rate": "10",
      "helpful": "247 out of 321 found this helpful.",
      "title": "One of my faves of the year...simply great.",
      "content": "This movie was a joy to watch. I didn't know what to expect when I came into it. I had heard the buzz of the acting and the story, etc...but we've all heard that before and had been disappointed, but not so with this one.Kevin Spacey plays this part to a \"T\". He is strong when it requires and meek when it is needed. His emotional rollercoaster ride is a trip to partake in. Annette Bening is marvelous as well. I think they both should be nominated.The support cast is also spectacular. Thora Birch, Wes Bentley, and Mena Suvari all give great performances as the troubled \"Teenagers\" in the film. Of particular mention is Wes Bentley's performance, worthy of a supporting nomination as well.This is a dramatic and funny tale of a man and his life in a state of turmoil and transition. When he happens to see a beautiful friend of his daughter's at a cheerleading exhibition, he is completely infatuated with her beauty. Using this as his inspiration, he attempts to change all aspects of his life. He confronts his marriage, his job, his ego, and his libido.The music in this film is also very well chosen. There are moments when the music fits so perfectly with the scene that they meld together as one to present a perfect emotion.The plot can get rather involved, but you will follow it endlessly to see where you go. I was simply involved, hook, line and sinker.See this movie more than once, and skip some of the other movies out now that are dare I say, trash.This should be on the top of many critic's lists this year and it is certainly on top of mine.My Rating (1 - 10): 10"
    },
    {
      "username": "Jared_Andrews",
      "userUrl": "https://www.imdb.com/user/ur53660798",
      "reviewLink": "https://www.imdb.com/review/rw3527845",
      "warningSpoilers": true,
      "date": "18 August 2016",
      "rate": "7",
      "helpful": "19 out of 25 found this helpful.",
      "title": "Delivers a beautiful, lasting message",
      "content": "When I first watched American Beauty, I was in awe. To many, this feeling was mutual. I, like most viewers, felt as if I had just witnessed the ultimate achievement in cinema—a film that actually changed my life. I thought it was the deepest, most profound film ever. I believed the message. I was ready to appreciate all the beauty in the world.Fast forward a few years, my view changed. American Beauty is creepy and pretentious and stomach churningly awkward and so over the top at times that it elicits eye rolls. I don't mean to rip the movie completely. Upon second viewing, I still enjoyed it immensely. It's aware and insightful, even if it's not quite as profound as everyone believed 15 years ago. In any case, American Beauty remains an Oscar worthy movie, in part, because of the flawless acting of Annette Bening and Kevin Spacey, who play two iconic roles even though they're essentially playing clichés, which is a super under-appreciated accomplishment. Seriously, think about it. They play a nuclear suburban couple in an ordinary neighborhood with an ordinary teenage daughter (despite what Ricky thinks about her) and ordinary family issues. Even the greatest sources of conflict in the movie (her affair and his mid-life crisis) are exceedingly ordinary. And still they manage to give extraordinary and lasting performances. Impressive work.All that ordinary really serves as the point of the film. Ricky, the kid who films stuff, sees things that most people consider ordinary and frames them in his mind as \"beautiful.\" To an extent, he has a wonderful, enlightened perspective. Except for when he crosses the threshold into weird. Case and point: \"Ricky, why are you filming that dead bird?\" \"Because it's beautiful.\" That's an iffy assertion at best, Ricky. I'm all about finding beauty in everyday places, but I find many things a heckuva lot more beautiful than a dead bird. For one, a living bird.American Beauty has a worthwhile message; we've established that. But the message means little if not delivered properly. Thankfully it is.In fact the message delivery is the strength of the film. Its effectiveness lies in its ability to present this family living the American dream, a ubiquitous concept, while exploring it with a deep, multi-perspective approach.It deconstructs the whole concept of the American dream. We see the nuclear family—husband, wife and daughter. They live in a nice house in a beautiful neighborhood. The parents each work good jobs. The daughter attends a nice school. They should all be perfectly happy. Yet As we peel back the layers, we see the flaws. The daughter hates her parents and struggles to fit in at high school. Mom tries and fails to connect with her daughter while she also tries and fails at work. Dad seems to have lost interest in all things aside from lusting after his daughter's teenage friend.They are miserable.This all forces us to ask: this is the American dream? What's so great about this? As the story ultimately winds to its conclusion, it arrives at the restoration of hope in the form of a super weird and creepy character experiencing an epiphany. *NOTE* I'm talking about Lester (Kevin Spacey), not Ricky, even though he is also creepy and weird. I know I hit on this already, but it demands a second mention. Quite frankly Ricky is more than just strange. He's kind of a pompous tool who is largely responsible for taking the movie from profound to \"come on dude, it's just a plastic bag\" levels of pretentiousness. It almost makes me glad President Snow killed him at the end of The Hunger Games 13 years later.How perfect is that role for him? When you picture Ricky 13 years later, can't you totally imagine him designing the layout of a game in which kids fight to the death? It makes perfect sense to me. He would probably think The Hunger Games are beautiful. *END OF NOTE* Anyway, back to Lester's epiphany.Lester turned his life around, in large part, due to his pursuit of a fantasy. But when he had a chance to live that fantasy, he turned it down. That was his epiphany. His real one, not the one he thought he had after smoking weed with Ricky.No, that night with Angela was the moment of his true breakthrough. He realizes that lusting after his daughter's friend is icky. More than that, he started to see things for what they really were. His fantasy girl was really just an innocent, vulnerable teenager. His daughter was really a special young lady he raised. His wife was really the woman he fell in love with.Being with Angela was not what he really wanted. He had what he wanted all along. Even with his current problems, he chose his reality over his fantasy. He had a wife, a daughter, a great life. Somewhere along the way he just forgot.I could probably ramble for another few thousand words about this movie, I better wrap things up.American Beauty sends a worthy message about appreciating the little things in life, the ones most of us take for granted. Experiencing the movie is like swimming through gorgeous ocean water in the Caribbean. It's wonderful, you just have to navigate through the seaweed of affairs and ignore the gross oil spill doubling as a 40 year old guy fantasizing about banging a high school cheerleader.If you can do that, you will take away something useful from this movie. And you'll have a fun time while you do it."
    },
    {
      "username": "reesew18",
      "userUrl": "https://www.imdb.com/user/ur1252248",
      "reviewLink": "https://www.imdb.com/review/rw0592409",
      "warningSpoilers": false,
      "date": "7 July 2001",
      "rate": "10",
      "helpful": "181 out of 218 found this helpful.",
      "title": "a very well done film that continues to amaze me...",
      "content": "When I first saw this movie in theaters, I found it to be very funny. When I rented it at home, I found it to be very sad and complex. Looking at it now, I realize that it is surely one of the most extraordinary films ever to come out of Hollywood. To some it may look trite or cliched, or maybe too un-ordinary to be worthy of its praise, but the overall impact of this film is extremely powerful. After you've seen it, you know you've seen something.A few notable elements stand out. The direction is superb; this is visually a superior film, for the director understands the subtle changes in tone. The writing is equally compelling; the story effortlessly interweaves multiple stories to create one amazing movie. The haunting music is also notable. Lastly is the acting. Kevin Spacey has done excellent films before, and he can add this one to the list. He may be a little to witty to suggest the overshadowed character he portrays, but he simply disappears into the role. Annette Bening is also fine; a less strong role, but she is magnificent none the less. As the teenagers, Thora Birch is able to mesmerize us with one intense look; her \"typical teenager\" role is fleshed out completely. I enjoyed Mena Suvari's character equally. It seemed that she did not receive as much acclaim, but her performance evokes both innocence and experience, and her scenes toward the end give her a depth unlike any other character. And Wes Bentley, as the video-taping boy next door, is easily the most original character. At first he seems a little tense, but, like Spacey, he sinks into the role. His \"purpose\" in the film, unlike anyone else's, is a mystery, thus making him the most enigmatic person.Most films are able to make a lasting impression on its audience, but never has a movie been known to \"move\" its viewers as much as this movie. It truly says something about life, no matter how predictable or tacky it appears, this film disturbingly shows us how to appreciate our individual lives, so therefore, when they are over, we each have something to remember."
    },
    {
      "username": "bootsy-4",
      "userUrl": "https://www.imdb.com/user/ur0391163",
      "reviewLink": "https://www.imdb.com/review/rw0592996",
      "warningSpoilers": false,
      "date": "14 December 1999",
      "rate": "10",
      "helpful": "135 out of 178 found this helpful.",
      "title": "Far and away the best film of the year",
      "content": "What can I say, except that this film really knocked me on my keaster. I went in to the theater not knowing what to expect, but was pretty sure it would be worth the ticket price. Boy was I happy when I left. Not only was it worth the ticket, I paid to see this film two more times. This film is virtually perfect. The acting is superb, the story is magnificent, the narrative is brilliant, and the structure of the film is truly groundbreaking (absolutely loved the last 20 minutes). What really surprised me about this film was how well the cinematography was done. In a small, character driven film such as this, it is very unusual to have such great cinematography. With this film, there is something interesting going on in every scene, not many films you can say that about. In a year where first time directors have made some of the best films, Three Kings, Being John Malkovich, etc... Sam Mendes seems to have out-done them all. Though I have yet to see The Green Mile or Magnolia, I find it hard to believe that either film will out-shine American Beauty. This film should easily win a substantial amount of the Oscars this year. What's up with all the cirtics awards snubbing it so far?"
    },
    {
      "username": "Michael Carruthers",
      "userUrl": "https://www.imdb.com/user/ur1121302",
      "reviewLink": "https://www.imdb.com/review/rw0592327",
      "warningSpoilers": true,
      "date": "6 April 2001",
      "rate": "",
      "helpful": "144 out of 212 found this helpful.",
      "title": "Look closer at this dazzling, powerful masterpiece of a drama.",
      "content": "On a scale of 0 to 100; I gave American Beauty a score of 99.Wow no, I mean that. American Beauty is a film that takes my breath away each time I watch it, and every time I do watch it, I notice something newer, something more exciting and something more funny. There is honestly no other movie like this, and if you haven't seen it, there is something donged in your head, and you must do so now.Lester Burnham (Kevin Spacey) is in a mid-life crisis, caused by his stressed wife Carolyn (Annette Bening) and rebelling teenage daughter Jane (Thora Birch). When Lester and Carolyn go watch Jane cheerleading, they meet Angela Hayes (Mena Suvari), and Lester, caught in sudden lust for Angela, decides to change his life. Angela and Jane's friendship is not all it seems, too, because Angela only brags about how many times she's done it with guys and stuff. That doesn't help an already insecure Jane very much but she finds solace in the arms of the next-door-neighbours' son, Ricky Fitts (Wes Bentley). Ricky, himself from a broken home as well, and Jane find they have a lot in common and eventually turn out to be soulmates.Everything about this film is so darkly clear, it is extremely obvious why the Academy loved it, and it is very obvious to see that I love it. Spacey brings Lester wildly to life in a performance reminiscent of Spacey's acting coach Jack Lemmon. Also on top form is Annette Bening, in an over-controlled performance that is just so instantly loveable. While all the attention went to these performers, it is also Thora Birch (especially), Mena Suvari, Wes Bentley and a quiet Allison Janney that manage to steal the show just as much. Sam Mendes is an excellent director, this is his first feature, and he is a British man directing an American-based film! And he won an Oscar for it! That's an amazing achievement, ditto to Alan Ball, who's script is effectively a stunner and an instant winner.The best film of 1999, the best film of its decade and for now anyways, American Beauty stands tall as the best film ever made."
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw0950116",
      "warningSpoilers": true,
      "date": "21 October 2004",
      "rate": "10",
      "helpful": "24 out of 40 found this helpful.",
      "title": "My Favorite Film From the 90s",
      "content": "American Beauty is a \"love it\" or \"hate it\" film, and you never know if it has more 'love it' or 'hate it' viewers. Personally, I love it -from the first sight, from the last sight, from the eternal sight. It is my favorite film of the 90s, one of my personal twenty favorites ever. I think that American Beauty is an instant classic, and it will stay that way as long as people watch movies.The film is deep, dark, and tragic. The title is American Beauty but it is more like Universal Sadness. It is not about superheroes - it is about very flawed, tired, and shallow people  but just as the tag line says  one must look closer.I live in a town like the one in American Beauty too - nice houses, brick, vinyl, neatly cut grass and flowers. \"The air is fresh and sweet like a child's kiss\". I jog in the mornings or in the evenings and people often sit on their porches or water their lawns or jog just as I do. We always smile at each other and say \"Hi, how are you?\" I always think to myself - what goes on beyond the closed doors of these people that I see? They could be happy with their families and with their jobs. They do look happy. Or, they may be tired and disappointed with their lives, trying to do something to change it - or just letting the days pass by.Leo Tolstoy opened his novel Anna Karenina with the words, \"All happy families are happy in the same way; each unhappy family is unique in its unhappiness\". That's why it is much more interesting for me to try and understand each unhappy family  why did it happen? The family in American Beauty used to be happy - there is even proof - the photograph with three of them, happy, laughing. Where did it go? When? Why? When was the moment in time when two loving people became strangers and prisoners in their own nice house with the beautiful roses outside? These are the questions I kept thinking about when I saw AB for the first time, and I still can not find the answers. Can something be changed? How? What do you do to wake up from the lethargic dream that your life has become? How do you reach the people who are the closest to you? What the hell do you need a $3000 couch for if you can not make love to your wife on it? What is the purpose of material possessions if they become more important than the smile of your daughter? When did you start to think that giving your children the best toys possible would substitute for a talk, for a sincere and honest interest as to what they really worry about? I did not find American Beauty patronizing and simplistic - it asks difficult questions but does not provide you with any easy answers. I still look for those answers. I don't blame the movie for imperfection of its characters - I know they do exist. We don't like them - but can one be mad when looking in the mirror? I want to add a couple of words about Spacey's character, Lester Burnham (BTW, Spacey may stop acting right now, and he probably should after all the flops he has produced since AB, but he will always be remembered for Lester). Lester could say about himself what another flawed but unforgettable character did 25 years before him: \"Well, I tried, didn't I? Goddamnit, at least I did that.\" Lester Burnham died a happy man; the last words he heard in his life were that his daughter was in love - it meant for him that she could feel, that she was alive because love changes us and makes us better. His last sight was that of a picture where happiness and joy were captured forever. In death, he had at last captured that for which he had longed for the most in life  happiness.He died a happy man - not many do."
    },
    {
      "username": "gsh999",
      "userUrl": "https://www.imdb.com/user/ur1154854",
      "reviewLink": "https://www.imdb.com/review/rw8072108",
      "warningSpoilers": false,
      "date": "19 April 2022",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "Perfectly captures the dystopia of the USA at the turn of the millenia",
      "content": "Greed and hate has destroyed the fabric of society in the USA and this film depicts a broken family that could be millions of families in suburban USA. I often think acting doesn't take much skill but movies like American Beauty help me appreciate truly fine acting. The film shows how one man finds redemption by breaking out of the cage his life had become. Despite a tragedy, the film ends on a positive note with the narration of the central character. One of my top 5 favorite movies. Congratulations to everyone who took part in the making of this movie."
    },
    {
      "username": "Pulpthatsfiction",
      "userUrl": "https://www.imdb.com/user/ur16927896",
      "reviewLink": "https://www.imdb.com/review/rw1762724",
      "warningSpoilers": false,
      "date": "12 November 2007",
      "rate": "10",
      "helpful": "73 out of 129 found this helpful.",
      "title": "Look Closer...",
      "content": "The first time I heard about this movie I thought it was this movie and about a man with cancer and then read a lot of good things about and then say some trailers and then I saw it. At first I did not like this movie but than say it again on T.V and then loved it ever since. This is one of the most original films I have ever seen. The performances are one of the best and more Oscars should have been handed out. The directing by Sam Mendes is superb and I'm glad that he won the Oscar. Alan Ball wrote one of the best screenplay and story's ever thought and there's a reason why he won the Oscar and most deserving. This is the Best of the 1990's and that decade had a lot of great movies came out( Goodfellas, L.A Confedintil, Pulp Fiction to name a few). This was the first movie that I saw that was perfect and I had to see it over and over so I can just uncover everything that was in this movie. This movie is in my top ten movies of all time and I'm glad that it's rank number 35 and that one of the reason why I joined this because it was the only website people respect my opinions and agreed with me. Keven Spacey gives his best performance and one of the best of time. Spacey brings a great performance for a really deep and is just a great character. Annette Bening does a great and for some reason missed the Oscar. Chris Copper does a great job and didn't get notice that much, also did Wes Bentley, Mena Suvari and thora Birch did a great job and should have more notice. Sam Mendes does a great directing job and is one the best film debut ever. This film was one the best ever made and should be seen by everyone hows looking for great movie or how just want have fun watching a movie."
    },
    {
      "username": "Bored_Dragon",
      "userUrl": "https://www.imdb.com/user/ur56005872",
      "reviewLink": "https://www.imdb.com/review/rw7055110",
      "warningSpoilers": false,
      "date": "22 June 2021",
      "rate": "10",
      "helpful": "7 out of 10 found this helpful.",
      "title": "Powerful",
      "content": "\"My name is Lester Burnham. This is my neighborhood; this is my street; this is my life. I am 42 years old; in less than a year I will be dead. Of course, I don't know that yet, and in a way, I am dead already.\"\"American Beauty\" is placed in an indefinite suburb somewhere in America (there are indications that it is Chicago), where a seemingly harmonious and quite ordinary family is going through the turbulence caused by the middle age crisis of both parents, as well as the puberty of their teenage daughter.A patriarchal family, ruled by a conservative father, a military man, moves next door to them. While the daughter of our antihero Lester starts a relationship with the neighbor's weird son, and his wife has an affair at work, he, not so secretly, obsessively falls for his daughter's girlfriend.This black humor drama is only seemingly extreme and eccentric, while in fact, it shows quite realistically what many of us go through at various moments in our lives. Admittedly, most only in their heads, and those who dare to take drastic steps usually hide it better. But the fact that most of us would never admit such thoughts and actions does not prevent, but perhaps only makes it easier for us to better connect with the characters and feel their drama more deeply.A strong, well-written story needs actors capable of bringing it to life before our eyes. \"American Beauty\" did not fail in that field either. The excellent character study on paper makes the job much easier, but you can always rely on Kevin Spacey for a really impressive role. A man who somehow manages to be at the same time a nerd and a macho, slimy and sexy, a villain and a victim. Sexual and emotional frustration and the middle age crisis are by no means an excuse for Lester's actions, and yet, Spacey awakens sympathy and compassion in the viewer, rather than repulsion and disgust.Annette Bening skillfully keeps pace with Spacey in the role of a frustrated woman, trapped in a long-extinguished marriage. A woman who, with the last twitches of common sense, tries to balance between a family in disarray and a career that she can never raise to a level that would satisfy her.There is also Thora Birch, an unpopular teen, escaping from the collapse of her family home in a relationship with the eccentric Wes Bentley, as well as the insecure Mena Suvari, who is hiding under the mask of a confident and popular cheerleader. Her transformation from \"Lolita\" that seduces Lester to one of the most impressive scenes in the film, where she is half-naked, trembling under Spacey, does not deserve to remain unmentioned. Although her character is secondary to the others I mentioned and only serves as a support for Spacey's, Mena's performance is unfairly underrated. And last but not least, Chris Cooper who convincingly played a homophobic colonel and stole every scene in which he appears.For me, the two most striking things in this film are the use of red and the unusual disturbing sounds that accompany Lester's fantasies, in contrast to the mainstream rock music that fills the rest of the movie. And of course, the ending is a bit over-the-top, but it perfectly rounds off the story and adds to its strength.The film won five Oscars for best picture, directing, screenplay, cinematography, and Spacey's performance, and was also nominated for editing, music, and leading female role. Each well deserved.10/10."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2263717",
      "warningSpoilers": false,
      "date": "13 June 2010",
      "rate": "10",
      "helpful": "21 out of 39 found this helpful.",
      "title": "Mayn't be the most original movie I have seen, but it is still an outstanding movie",
      "content": "I wasn't expecting to like American Beauty, but I did, loved it more like. The story mayn't be original at first glance, but how the film is written and constructed more than compensates you completely overlook. You may argue the characters are weird and unlikeable, maybe so, but they are quite complex. Lester is a self-described loser who is unwanted by everyone, Carolyn is uptight and sexually frustrated, Jane is the epitome of a sulky teenage daughter and Allison is like a incipient Lolita who Lester becomes smitten with. American Beauty is probably an example of a movie that you may need to see more than once to truly appreciate it, I was like that with Vertigo.What I love about American Beauty is not only the complex characters, but also the stylish filming, haunting score, side-splitting scenarios, the intelligent and darkly funny screenplay and the assured direction from Sam Mendes. Not to mention the performances which are nothing less than impeccable, especially Kevin Spacey who thoroughly deserved his Best Actor Oscar. Annette Bening, Peter Gallagher, Thora Birch and Mena Suvari give wonderful support too. Quintessentially, American Beauty is just a wonderful, funny and brilliantly performed and directed film. 10/10 Bethany Cox"
    },
    {
      "username": "spiderdib",
      "userUrl": "https://www.imdb.com/user/ur114026501",
      "reviewLink": "https://www.imdb.com/review/rw5873874",
      "warningSpoilers": true,
      "date": "2 July 2020",
      "rate": "9",
      "helpful": "8 out of 11 found this helpful.",
      "title": "if a movie changes your life or the way you see it, it is said that it did a great job.",
      "content": "If a movie changes your life or the way you see it, it is said that it did a great job....although it took several years for me to watch this one, I only knew that when it finished, something changed.In American Beauty we follow Lester, a forty-year-old with an unhappy life disguised as being perfect with his wife Carolyn and daughter Jane, just the protagonist that the cinema tries to avoid in his productions being the lie of the American dream, looking as if he had In a coma all his life, he decides to erase the monotony of his existence when he meets Angela, Jane's friend, no matter who he takes between the forces of his chaos, he embarks on a journey on the way to his death.What I am most passionate about seeing this film is the need to destroy the concept of American perfection and what surrounds it, drops of work, marriage, home and ideal work in a rain of real misery, to achieve this we see everything through Lester's eyes, he says it himself ... \"I have lost something, I am not sure what it is, but I know that I did not always feel so sedated\", he begins to change everything to recover what he lost trying to have fewer responsibilities, less work, focusing on himself to break the chains, in the first half-hour of the film we see how there are people who do not try to show that they are happy like Jane but on the other hand there are people who lock themselves in a bubble of perfection to represent a good image and reflect success, just what Carolyn does. We can see the real despair of people like Carolyn in the \"I'll sell this house today\" scene and the final collapse of not achieving it, showing that happiness is a mask that each one desires; the film manages to criticize this system of perfection but not with the desire to make it appear as incorrect or unfair, but it does it so that the audience sees the reaction of these characters to it, it gives us stereotyped characters but capable for the public to identify themselves with them even the most selfish, a man tired of his work (and his life itself), a woman who seems to have everything under control but in reality has no stability, a teenager indifferent to what surrounds her and who doesn't like herself. The characters in the film are profound, objective, out of place, but each one has their own story and is presented in the same way, in addition to the fact that their very existence makes them influence the story greatly, even if they are not the protagonists, something almost impossible to see in the movies where they go in a storyline and forget what is around, here we have characters like Ricky Fitts, a cold boy who knows how to appreciate real beauty, his father, a strict colonel who represses his interior, Angela, a rogue girl who avoids being ordinary and the cause of Lester's awakening, just waking up surprises the audience since we are talking about love 20 years apart but to me, it seems that the relationship of Lester and Angela goes beyond a romance forbidden by age but the insecurity of a teenager and the crisis of a 42-year-old man who seeks to regain youth and his surroundings.I love to see how the film is not only supported by an ingenious story with deep characters and masterful performances such as the Spacey that won him the Oscar, but the photography manages to give careful and precise shots that give it a unique touch, characteristic symbols such as roses and the fullness of red throughout the film, which could well reflect the perfection of materialism and the lust of the characters.The film is not perfect, and it is what it wants, as audience we are immersed in the voice-over of the catharsis of a man who, when he dies, embarks us to the beauty of life and his shipwreck, a portrait of society, to worry about what that people think and finally understand beauty, not the American one, but everything, including a plastic bag dancing in the air."
    },
    {
      "username": "dataconflossmoor",
      "userUrl": "https://www.imdb.com/user/ur1855181",
      "reviewLink": "https://www.imdb.com/review/rw0593744",
      "warningSpoilers": true,
      "date": "27 July 2003",
      "rate": "",
      "helpful": "17 out of 28 found this helpful.",
      "title": "Hang Ups For Breakfast!!!!",
      "content": "Why don't we live in Westport!!, My wife is the one with the balls in the family, I have the hots for my daughter's friend, Some homophobic Neo-Nazi kissed me on the lips, I'll have an affair with a business mentor, I hate my parents because that's what everybody in suburbia does. This only begins to comprise the cacophony of quirks that this family expounds on!! A mid-life crisis occurs when the most exciting thing in your life is masturbation!! Let's nurture the psychotics!! Let's patronize the adolescents!! Let's make excuses and thoroughly believe them!! Cavalier changes are the perfect depiction of the phrase \"Too little too late!!!!\" A remote understanding of family and friends is just too much trouble, so let's just not bother!!! Did you know that dad got his brains blown out!! Oh well!! Nobody knows why!! Daughter and wife and company will eventually think of something else in the very near future....It is a fact that an obscenely mega mortgaged America is incredibly self centered...All these demented problems prevail in sweet suburbia!!! Suburbia is mainstream America, so are these hang ups!! These hang ups and so many more!!! Anybody else care to add to this list feel free to do so!!!"
    },
    {
      "username": "andrew7",
      "userUrl": "https://www.imdb.com/user/ur0482520",
      "reviewLink": "https://www.imdb.com/review/rw0592555",
      "warningSpoilers": false,
      "date": "5 February 2002",
      "rate": "6",
      "helpful": "73 out of 144 found this helpful.",
      "title": "The closer I look, the worse it gets",
      "content": "I first saw this in theaters back in 1999. I loved it. I really really loved it. I've seen it four or five times since, and each time, I like it less. I just saw it again a couple of days ago, and I stopped it before it was over. At that moment, I decided to sell my DVD. It has now been excised from my DVD Collection, about which I have considerable pride.The main reason is that I have come to feel very strongly that this film doesn't know what it wants to say. It takes a bunch of characters, constructs various relationships between them, and sets them loose to run around for two hours, at the end of which, what have we learned? I've heard lots of people make comparisons between this film and another highly acclaimed movie of 1999 which I hate: Fight Club. Both films include philosophically flimsy but highly entertaining critiques of materialism. With Fight Club, the critique on materialism is made by the character who turns out to be the villain of the piece, who seeks to replace it with fascism. In American Beauty, the anti-consumerist is, first of all, a total hypocrite, and second of all, has a life changing epiphany the moment before his death, but never gets a chance to expound upon what that epiphany was.On the hypocrisy charge, consider the oft-quoted scene when Lester Burnham (magnificently portrayed by Kevin Spacey) yells at his wife Carolyn (played in an over-the-top caricature by Annette Bening) for placing too high a value on material things, in this case, a sofa. Fine. He makes a good point. No one else seems to have noticed, however, that this is precisely the same scene where it is revealed that Lester has bought a 1970 Pontiac Firebird. Since we at no time see Lester enjoying the use of his car, the implication is that possession of the object is a good in itself, which is the very apex of materialism.There are lots of other things that we don't see, and I never noticed until I \"looked closer\" how conspicuous they are in their absence. We never see Angela or Jane don a cheerleading uniform after their initial cheerleading scene. They never make any reference to being cheerleaders. The whole concept of cheerleading, then, is merely a mechanism (and quite a contrived, not to mention cliched mechanism at that) to introduce Lester to Angela. I also noticed, when I looked closer, how painfully bad much of the dialogue given to the younger characters is. \"Lame-o\" \"Geekboy\" \"Take a whizz\" It's just horrid. And why, exactly, was Jane looking at a breast augmentation website? First of all, her breasts don't appear to need augmenting (when I saw this in theaters, I thought she must want to reduce her breasts, but upon looking closer, the computer monitor clearly says \"augmentation\", which means a process of adding to).The worst flaw of the film, by far, is the fact that we have one horrible cliche repeated twice in the space of minutes in the final act. The homophobic marine turns out to be a repressed homosexual, and the slutty cheerleader turns out to be a virgin. For the love of God, who let those two howlers slip through. Bad enough that either made the final cut, but both?!! It defies understanding.The scene that made me turn the film off, this final time that I watched it, was the scene were Jane and Ricky decide to run off together. I was never very comfortable with this scene, because, call me conservative, I'm just not thrilled about a girl dropping out of school at the tender age of seventeen (or so) and running off with her drug dealer boyfriend. But what really got my goat was when Ricky ridiculed Angela by calling her ordinary. Fair enough, Angela had it coming. But for Ricky to not only accept Angela's principle that ordinariness is bad, but to use it against her... that bothered me. Ordinariness or lack thereof is not a valid criterion for judging the worth of a human being. Ricky, having been set up (clumsily) as a heroic character, shouldn't have descended to such a twisted and hateful principle.The whole film has the feel of having been made up as it went along. It is radically different from how it was originally planned to go. The prelude sequence and the scene later in the film which it foreshadowed have become utterly pointless since the removal of the subplot about Jane and Ricky being blamed for Lester's murder. Now, that subplot is a bit ridiculous, and was cut for a good reason, I agree. But why leave the set up if you're cutting the payoff? [Notice that Ricky shuts off the camera before Jane says \"You know I'm joking, right?\"]The sequence where Col. Fitts spies on Ricky and Lester is straight out of \"Three's Company.\" Fitts sees just enough to draw the conclusion that the writer wants him to draw, and nothing else. That's a classic example (and the most blatant I can recall from any film) of bad, contrived plotting. What exactly was up with Mrs. Fitts? Presumably, her scenes meant something in some previous, unreleased version of the story. The initial meeting between Lester and Ricky is built on numerous coincidences... Ricky just happens to be working there, and he works there just long enough to meet Lester!!! And what self-respecting drug dealer would give a man $2,000 worth of merchandise on the assumption that he'd be willing/able to pay for it later? It would have been more contrived if Lester happened to have $2,000 in cash while jogging, but \"I know you're good for it\" isn't much better.This film is ambitious. There are lots of individual pieces of greatness in it. There are a lot of really good ideas. But on a fundamental level, it just doesn't work."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw5204179",
      "warningSpoilers": false,
      "date": "21 October 2019",
      "rate": "10",
      "helpful": "5 out of 7 found this helpful.",
      "title": "My 600th review on IMDb and such a perfect movie for it!",
      "content": "Makes me smile at so many scenes, well deserving of the 5 Oscars! The writing and emotions are exquisitely powerful yet somber. I absolutely love Kevin Spacey despite his personal life troubles and Annette Benning blows me out of the water every time. I'm delighted to own such a piece of art on Blu-Ray; American Beauty has been among my top favorites for a very long time I'd say number 8. The Soundtrack is one of the greatest things ever, to me this film is like a perfect tapestry after using the paint brush and Sam Mendes created it so well! Hope my thoughts aren't to over the top I just very much enjoy this movie!"
    },
    {
      "username": "stryker-5",
      "userUrl": "https://www.imdb.com/user/ur0150331",
      "reviewLink": "https://www.imdb.com/review/rw0592543",
      "warningSpoilers": false,
      "date": "26 January 2002",
      "rate": "",
      "helpful": "12 out of 20 found this helpful.",
      "title": "\"I Know I Didn't Always Feel This ... Sedated.\"",
      "content": "Hmmm ... Let's just take a cool, objective look at a few of the comments made by IMDb users who have reviewed \"American Beauty\". \"Haunting.\" \"Riveting.\" \"Brilliant.\" \"More than meets the eye.\" \"Uplifitng.\" \"Never contrived.\" \"By far the best I have ever seen.\" \"Makes you think.\" \"Exceptional.\" \"Never gives stereotypes.\" \"Classic masterpiece.\" \"Movies don't get any better than this.\" And that list is by no means exhaustive. Now let's contemplate the actual film that these people have been watching. Lester Burnham is Suburban Man. An unremarkable individual not valued by his employer and ignored by his family, he has wasted his entire adult life by succumbing to the routine of work and home, and failing to indulge his own individuality. When two key events coincide (the loss of his job and the dawning of a 'crush' on his daughter's friend) Lester is suddenly free to \"beat his drum\", slough off years of conformity and be his eccentric self. Yes, that's right, yet another dull, cliche-ridden suburban situation comedy hinting at inchoate unease deep in the soul of bourgeois America. All the predictable bases are touched during this smug box-office home run - petty snobbery, keeping up appearances, repressed yearnings for Bali Hi, and that profound American lament, \"I've Never Been To Me\". And what does Lester do to express his newfound rebellious individuality? How exactly does he challenge the suburban world which he has rejected? Form a witches' coven? Invent a world language? Assassinate Castro? Reproduce indian cave art using bison dung as paint? No. He drinks beer in front of the TV set, and gets a job in a hamburger joint. Can America's big-budget Dream Factory come up with nothing more exciting than this? Before dealing with the wider themes, I would like to tackle some details which bothered me. What is a gun doing in this story? Are Hollywood's screenwriters so bankrupt of ideas that they can't construct a plot without relying on the dreadfully-overworked device of pistol-packing? The opening shower sequence was embarrassing. Adult jokes are fine by me, bawdy humour is great ... but this was unnecessary and degrading. It simply didn't belong. A narrator who announces that he is dead isn't a clever touch, it's just sloppy work. Is Mena Suvari REALLY the embodiment of American beauty? I find that hard to believe. And what about the total loss of nerve surrounding her character? Isn't this brash film supposed to be proud of its handling of adult issues? So why does the temptress have to be revealed as a trembling little virgin? We hear a great deal of American trumpeting of feminism as a cause. Can't anyone see that this moral cave-in is profoundly anti-feminist? On a similar note, what was Thora Birch's topless shot all about? It defines the term 'gratuitous'. And so, back to the broader picture. \"American Beauty\" isn't any of those amazing things that people have claimed it to be. It isn't even mediocre. It's a tired, self-satisfied, deeply unimaginative rehashing of a format which was outworn by the time \"My Favourite Martian\" hit the TV screen. Challenging the regularity of suburban life isn't clever and isn't funny. It is gut-achingly DULL. The question which arises, then, is why so many people are sincerely convinced that \"American Beauty\" outshines \"Citizen Kane\". I offer this for consideration ... they feel that way because they are told to. It doesn't work every single time, and sometimes it misses spectacularly, but Hollywood knows that as a general rule, advertising pays dividends. Tell people often enough that they need to see this mighty film, and they will accept the premises - both that they need to see it, and that it's mighty. Barnum said that nobody ever went broke by under-estimating the public. There's truth in that. Just provide the bread and the circuses, and the docile populace will take you at your word that the bread is delicious and the circuses thrilling. The public wants what the public gets."
    }
  ],
  "errorMessage": ""
}