{
  "imDbId": "tt0050986",
  "title": "Wild Strawberries",
  "fullTitle": "Wild Strawberries (1957)",
  "type": "Movie",
  "year": "1957",
  "items": [
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1122995",
      "warningSpoilers": false,
      "date": "10 July 2005",
      "rate": "9",
      "helpful": "85 out of 98 found this helpful.",
      "title": "exceptionally well made",
      "content": "Although I'm not the biggest Ingmar Bergman fan, I have really enjoyed some of his movies--especially the one that are not so pessimistic. Although the underlying theme of this movie is aging and impending death, the movie is NOT all pessimism. If it had been, it would have lost my interest early on. Instead, I really enjoyed the film--particularly the fine acting by Victor Sjöström as Professor Borg.The professor is well-respected for his work as a doctor. However, despite his success in his career, he is a failure in his personal relationships. His emotional baggage over the years has prevented him from allowing himself to be close to those he truly loves. This theme mirrors one of the subplots of Through a Glass Darkly, where a father is being destroyed inside by his daughter's mental illness but he CANNOT allow himself to show his anguish--choosing instead to hide in his room with his tears. It is interesting that the same man playing Borg's son (Gunnar Björnstrand) plays the father only a few years later in Through a Glass Darkly.Fortunately, unlike Through a Glass Darkly, there IS evidence that the professor is willing to change his persona, as he begins to open up more through the course of the movie. This appears to be assisted through extensive soul searching and dreams the professor has concerning his past and his own mortality--along with experiences he has during a long drive down the coast of Sweden. Because of this, even his extremely strained relationship with his son appears to hold some hope of improvement by the film's end. This hope for change lifts this movie above some Bergman films that only wallow in hopelessness.FYI--The Criterion version of this DVD is nice due to its running commentary as well as the accompanying documentary. Get this version if you have the chance.Also FYI--After watching many Bergman films and reading about his life, I detect quite a bit of autobiography in this film and his own stuggles with intimacy."
    },
    {
      "username": "DennisLittrell",
      "userUrl": "https://www.imdb.com/user/ur0226855",
      "reviewLink": "https://www.imdb.com/review/rw0062754",
      "warningSpoilers": false,
      "date": "21 June 2004",
      "rate": "10",
      "helpful": "250 out of 273 found this helpful.",
      "title": "When film was an art form",
      "content": "In this symbolic tale of an old man's journey from emotional isolation to a kind of personal renaissance, Ingmar Bergman explores in part his own past, and in doing so rewards us all with a tale of redemption and love.Victor Sjostrom, then 80 years old, stars as Professor Isak Borg whose self-indulgent cynicism has left him isolated from others. Sjostrom, whose work goes back to the very beginning of the Swedish cinema in the silent film era, both as an actor and as a director, gives a brilliant and compelling performance. All the action of the film takes place in a single day with flashbacks and dream sequences to Borg's past as Borg wakes and goes on a journey to receive a \"Jubilee Doctor\" degree from the University of Lund. Bergman wrote that the idea for the film came upon him when he asked the question, \"What if I could suddenly walk into my childhood?\" He then imagined a film \"about suddenly opening a door, emerging in reality, then turning a corner and entering another period of one's existence, and all the time the past is going on, alive.\"Bibi Andersson plays both the Sara from Borg's childhood, the cousin he was to marry, and the hitchhiker Sara who with her two companions befriends him with warmth and affection. The key scene is when the ancient Borg in dreamscape comes upon the Sara of his childhood out gathering wild strawberries. Borg looks on (unnoticed of course) as his brother, the young Sigfrid, ravishes her with a kiss which she returns passionately; and, as the wild strawberries fall from her bowl onto her apron, staining it red, Borg experiences the pain of infidelity and heartbreak once again. Note that in English we speak of losing one's \"cherry\"; here the strawberries symbolize emotionally much the same thing for Sara. Later on in the film as the redemption comes, the present day Sara calls out to Borg that it is he that she really loves, always and forever. Borg waves her away from the balcony, yet we are greatly moved by her love, and we know how touched he is.The two young men accompanying Sara can be seen as reincarnations of the serious and careful Isak Borg and the more carefree and daring Sigfrid. It is as though his life has returned to him as a theater in which the characters resemble those of his past; yet we are not clear in realizing whether the resemblance properly belongs in the old man's mind or is a synchronicity of time returned.Memorable is Ingrid Thulin who plays Mariana, the wife of Borg's son who accompanies him on the auto trip to Lund. She begins with frank bitterness toward the old man but ends with love for him; and again we are emotionally moved at the transformation. What Bergman does so very well in this film is to make us experience forgiveness and the transformation of the human spirit from the negative emotions of jealousy and a cold indifference that is close to hate, to the redemption that comes with love and a renewal of the human spirit. In quiet agreement with this, but with the edge of realism fully intact, is the scene near the end when Borg asks his long time housekeeper and cook if they might not call one another by their first names. She responses that even at her age, a woman has her reputation to consider. Such a gentle comeuppance meshes well with, and serves as a foil for, all that has gone on before on this magical day in an old man's life.See this for Bergman who was just then realizing his genius (The Seventh Seal was produced immediately before this film) and for Sjostrom who had the rare opportunity to return to film as an actor in a leading role many decades past him prime, and made the most of it with a flawless performance, his last major performance as he was to die three years later.(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)"
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw1479581",
      "warningSpoilers": false,
      "date": "20 September 2006",
      "rate": "10",
      "helpful": "56 out of 64 found this helpful.",
      "title": "Stunning Bergman Masterpiece -- Maybe His Best?",
      "content": "\"Wild Strawberries\" profoundly moved me. The theme -- an old man coming up fast on death and wondering if his life has had any meaning -- is an old one for Bergman, and one which he explored ad nauseum throughout the subsequent decades. But here Bergman approaches the question with an uncharacteristic optimism and sense of hope. For once, he seems to come close to finding some peace with the unknowns of life that obviously preoccupied him as an artist, and the movie he gives us is sad but immensely warm; resigned but calm and reflective.An unequivocal masterpiece, and only one of a handful of Bergman films (\"Persona\" and \"Cries and Whispers\" being two others) that don't drive me over the edge when I watch them now.Grade: A+"
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw1120983",
      "warningSpoilers": false,
      "date": "7 July 2005",
      "rate": "10",
      "helpful": "107 out of 121 found this helpful.",
      "title": "One of Master's Most Optimistic, Profound, And Warmest Films.",
      "content": "I first saw \"Wild Strawberries\" many years ago at one of the special screenings in the small theater in Moscow. It was the first Bergman's film I ever saw. This picture is amazing in its emotional impact and in my opinion is one of Bergman's most optimistic, profound, and warm films.\"Wild Strawberries\" provides sincere, intelligent, and emotional contemplations of life's disappointment, regrets, and losses. The main character, seventy-eight-year-old Professor Isak Borg is forced to see his life in a true and painful light, but he also would learn that there is hope.Sparkling cinematography by Gunnar Fisher and superb acting of Bergman's regulars  Ingrid Thulin, Bibi Anderson, Gunnar Bjornstrand, Max von Sydow and especially, the great silent film director, Victor Sjostrom as Professor Borg add to many delights of \"Wild Strawberries\" which also include Bergman's writing/directing with his famous mixing of conscious and unconscious, dreams and reality, the past and the present in the same scene."
    },
    {
      "username": "jonr-3",
      "userUrl": "https://www.imdb.com/user/ur0675293",
      "reviewLink": "https://www.imdb.com/review/rw0062750",
      "warningSpoilers": false,
      "date": "12 January 2004",
      "rate": "10",
      "helpful": "361 out of 382 found this helpful.",
      "title": "A cathartic viewing experience",
      "content": "I'd seen \"Wild Strawberries\" as a college freshman when it was first released, and knew right away I'd be a Bergman fan from then on. I watched it again just last night, January 2004, at age 63, and needless to say got a whole different perspective on the film. Where the surrealist touches, moody photography, and incredibly smooth direction had made the big hit with me as a near boy, as an aging man I found myself--I hesitate to say painfully, but...well, closely--identifying with old Isak Borg in his strange pilgrimage, both interior and exterior, the day he receives his honorary degree at the cathedral in Lund.In the last twenty minutes or so of the movie, I found tears running down my face, not from any thrilling sentimental browbeating (I doubt if Mr. Bergman shot five seconds' worth of sentimentality in his whole long career!) but simply from the cumulative emotional impact of this simple, powerful story and its probing revelation of human character, desire, and chagrin. By the time the film ended, I felt wrung out, disoriented, happy and deeply sad at the same time: it's the experience the Greeks wanted their tragedies to convey to the spectator; they spoke of \"katharsis.\" I experienced it firsthand when I had the great good fortune to see a production (in English) of \"Medea.\" I walked away in tears and scarcely able to think straight for an hour or so. The same thing happened with \"Wild Strawberries.\" This is one of the handful of films I unhesitatingly rate a \"ten.\"A side note: I watched the Criterion Collection DVD. Before the film itself, I watched the hour-long interview conducted in 1998 by Jorn Donner included on the disc. It was remarkable to see how the film Bergman shot ca. 1957 contains many elements that were to be present in his later life--like a foreshadowing of his own old age."
    },
    {
      "username": "sol-kay",
      "userUrl": "https://www.imdb.com/user/ur2706684",
      "reviewLink": "https://www.imdb.com/review/rw1557368",
      "warningSpoilers": false,
      "date": "29 December 2006",
      "rate": "8",
      "helpful": "22 out of 24 found this helpful.",
      "title": "One last time around the strawberry patch.",
      "content": "(Slight Spoilers) A man's life journey is all seen through a number of dreams and hallucinations on his trip, some 400 miles, to the town of Lund where he's to receive a lifetime achievement award for his 50 or so years of service to his fellow man as a doctor and a professor of medicine at his alma mater the Cathedral of Lund.Disturbed by a dream he had the night before Isak Borg decides to take a ride by car, not plane, to Lund for a ceremony thats to be in his honor for his work as a man of medicine. Isak's maid for some 40 years Agda is very upset with her boss' and good friends decision and decides to stay at home, she'll eventually show up at the ceremony, feeling that the old man has somehow lost control of his senses. It turns out that the long car trip together with his daughter-in-law Marianne was one of the best decision that he made in his long life, Isak is 78 years old. The trip that Isak takes will bring back past memories that he so desperately tried to hide from himself. That past will in effect make him not only a better person but bring back the feeling of humanity that he lost not only for himself over these long and empty years. Not only for Isak but for those close to him whom he more or less also lost contact with. Isak,in both his dreams and memories, is seen as a man who is unable to show any real feelings for those around and close to him in the fear of either being rejected as well as showing himself to be hurt by their negative responses.This defect in Isak personality has cost him the love of his life Sara when he was a young man who rejected him for his handsome and openly aggressive older brother Sigfried. We also see that Isak's marriage to his wife, who had long since passed away, Karin was anything but happy with her disgusted with his inability to show her any real feelings and emotions as a husband. Were also shown, in one of Isak's dreams, that she had an affair with another man Ake Fridell, who was anything but passive with her like her husband Isak was, some 40 years ago behind his back. That may have possibly resulted in the birth of his only child his son, who's also a doctor, Evald Marriane's husband.Seeing his 96 year-old mother on his way to Lund we see in her the same human defect that he has in that all of her ten children, who with the exception of Isak are now deceased, never bothered to visit her in her old age. The only time that they had anything to do with her was when they wanted money from the old lady. This coldness and inability to have any attachment to her children is shown not only in both Isak and his mother but in his son Evald who's so disgusted with life and what it had to offer him, like a beautiful and caring wife like Marianne. Evald threatened to walk out on Marianne when after he found out of her being pregnant, I guess by him, she refused his demand of her getting an abortion.Isak is helped on his long trip to Lund not only by Marianne but a number of people they meet and in some cases give a ride along the way. This included a young girl and two of her friend going on a trip to Italy ironically named Sara, a virtual twin of the Sara that he loved and lost as a young man. Later Sara together with Anders and Victor who later as a singing group serenade a surprised and grateful, to the point of tears, Isak after he received his award. Meeting among others along the way to far flung Lund a bickering couple Mr. & Mrs. Alman, who almost had Isak and his passengers killed in a head-on car crash. Isak also met a gas station attendant, Henrik, who was so impressed and grateful by what he did for him and his wife in the past , delivered their first child, that he refused to get paid for filling up Isak's gas-tank.By the time Isak got to Lund and received his lifetime achievement award to the attendance and cheering of the entire town he not only realized all the good that he did as a man of medicine all these years but also all the hurt that he gave to others, if unintentional. With the little time that he has left, Isak was to pass away three years later at the age of 81, Isak is determined to make up for it.Sweet touching yet simple little film about one man's journey back in time who sees how he missed out on the many wonderful things that life had to offer him by being blind to them. Now given a second chance Isak would try as best as he can to both re-live and at the same time correct his past mistakes."
    },
    {
      "username": "Vincentiu",
      "userUrl": "https://www.imdb.com/user/ur13017201",
      "reviewLink": "https://www.imdb.com/review/rw1552739",
      "warningSpoilers": false,
      "date": "24 December 2006",
      "rate": "10",
      "helpful": "96 out of 121 found this helpful.",
      "title": "The only reality",
      "content": "A gorgeous movie about memory and hope. A trip and a form of catharsis. It is not a story of an old man who discovers images of his past, about a marital crisis or some teenagers. It is not a confession. It is a mirror. The same crisis is the \"gift\" of everybody. The same silence, fear and desire are the refuge of a man, a woman, a n American or Irakian. At a moment, at a single moment, you discover your past like only reality. Like your real skin, your only voice, your essential eye. It is not strange. We are the fruits of some experiences. Some books, some people, a family, a child or a wife are the Ganymedes of our hours, our evolution, our death. Our freedom, our gestures, our smile are the trees of their presence. Isak Borg is the image of a age. Our age who grow-up in the noise of every day. The isolation is only way to be yourself. The way to Lund, the relation with Agda, the empty attitude, the projection in Evald, the words are the symbols of a clock who is seed of our conscience. Childhood is only reality of our life."
    },
    {
      "username": "pooch-8",
      "userUrl": "https://www.imdb.com/user/ur0197287",
      "reviewLink": "https://www.imdb.com/review/rw0062716",
      "warningSpoilers": false,
      "date": "16 February 1999",
      "rate": "",
      "helpful": "68 out of 78 found this helpful.",
      "title": "One of Bergman's greatest achievements",
      "content": "Wild Strawberries can be praised for so many reasons, but chief among them in my own mind is the way in which the film so perfectly conveys its themes of self-examination and the contemplation of one's own mortality (particularly through its stunning use of flashbacks). Bergman's autobiographical story also benefits from the brilliant casting of Swedish film legend Victor Sjostrom as Isak Borg, whose towering performance is essential to the success of Wild Strawberries. I read that Bergman based the coffin dream sequence on a frequent nightmare that he had -- and it never ceases to amaze me just how effective it remains even after all these years. Wild Strawberries seems like a quiet, thoughtful, introsepective movie -- and it is; it is also one of world cinema's most impressive motion pictures."
    },
    {
      "username": "iam-1",
      "userUrl": "https://www.imdb.com/user/ur0005435",
      "reviewLink": "https://www.imdb.com/review/rw0062729",
      "warningSpoilers": false,
      "date": "24 January 2000",
      "rate": "8",
      "helpful": "47 out of 50 found this helpful.",
      "title": "Bergman knows how to make you think.",
      "content": "Bergman has been seen by many as being a depressing film makes, who speaks above the heads of most people. Thank God someone does! In this piece of genius, we are asked to consider who God is; what makes a life worthwhile; and whether human nature alters through the generations, or is it just the costumes that change? As usual, the answers are to be provided by the audience. We must chose for ourselves what we think is 'right' or 'just'. Bergman uses the usual pattern for him - a man is on a journey (life) and meets people who are going along the same road (friends and family), and they all head toward the end of their trip (death). They stop in for obligatory visits with relatives and for food (as we all do), receive an honourary degree (fame & success?), and then send the children off to a party held in our honour that we do not attend (funeral). What happens along the way is important, but we always end up in the same place - the end. Wonderful editing techniques, good story, good images, fantastic acting, and more ideas and questions to ponder than one film can hold - or so you thought. It's only after the film ends that these ponderings come to you. During the film, you simply watch a man travel from his home to another city, but this is far from what the film is about. See this film once, think about the questions it poses, then rewind and see it again. You will be rewarded for doing so."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw2661957",
      "warningSpoilers": false,
      "date": "20 August 2012",
      "rate": "7",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Emotional and symbolic masterpiece by the genius Ingmar Berman",
      "content": "¨ Wild strawberries¨ is a spellbinding masterpiece by the great Ingmar Bergman with brilliant acting by Victor Sjostrom (Sweden first movie filmmaker and star , best known for his silent work , who died three years later , aged 81) and awesome cinematography by Gunnar Fischer ; showing a rich tapestry of fears , dreams , anxieties , memories and occasionally over-symbolic frames . This Bergman's landmark film is developed in Sweden , after living a life marked by coldness, an aging professor is forced to confront the emptiness of his existence , taking place a sentimental voyage . This the story about an aging scientist on the rout to accept a prize and he must come to terms with nightmares , surrealist dreams and guilt .The movie displays haunting and powerful scenes ,it's plenty of intellectual images which stay forever in the mind ; resulting to be one of Bergman's warmest and therefore finest movies . Brooding and thought-provoking screenplay , Ingmar Bergman wrote the script while he was in hospital and thought the movie with Victor Sjöström in mind and riddled with a real feeling the joys of youth , age and nature . Although sometimes is slow moving ,however the thoughtful screenplay is narrated with intelligence and sensitivity but are developed ethics and moral issues as death , God , religion , family and aging . Surrealist and impressive images as when the coffin falling from the hearse , one of Bergman's own recurring dreams . Victor Sjostrom , Swedish cinema's best known pioneer and in his final screen appearance , gives a surprisingly moving interpretation as a professor on a touching journey to his redemption . The movie is marvelously paced and acted , and realizes an excellent Sweden reunion actors with usual Bergman's players (Ingrid Thulin , Bibi Andersson , Max Von Sidow as a gas station keeper and Gunner Lindblon, among others) , showing the different characters and exploring their apprehensions , ambitions, fears and circumstances . Glimmer and riveting cinematography by Gunner Fischer (The seventh seal) , he's deemed by many to be one of the world's greatest cameraman , he achieved give the movies on the most natural and simplest look imaginable . Cinematographer Gunnar Fischer says that several scenes had to be shot indoors due to Victor Sjöström's poor health , \"We had to make some very bad back-projection in the car because we never knew if Victor would come back alive the next day.\" Gunnar was subsequently replaced by Sven Nykvist (won an Oscar for Fanny and Alexander) as Bergman's cinematographer . ¨Smultronstället¨ is wonderfully directed by Bergman ,it's a real masterpiece who made his major impact gaining international acclaim and winning Gloden Globe 60 , for the best Foreign film . His realization was during an impressive golden period from 1957-1968 when Bergman made stunning masterpieces, plenty of richly observed characters : The seventh seal , Persona, The communicants , The silence , Virgin spring , Hour of wolf . Rating: Magnificent, but is considered by many (along with The seventh seal) to be the Bergman's best ."
    },
    {
      "username": "thxrvg",
      "userUrl": "https://www.imdb.com/user/ur11935902",
      "reviewLink": "https://www.imdb.com/review/rw1460781",
      "warningSpoilers": true,
      "date": "28 August 2006",
      "rate": "9",
      "helpful": "25 out of 25 found this helpful.",
      "title": "A Magnificent Film",
      "content": "There are moments in Ingmar Bergman's Wild Strawberries where you become so enthralled by an image that you want to dwell on it, until you realize that there are so many such moments that to do so would be to stop at practically every scene in the film. The sheer technical and visual skill that Bergman shows here is unsurprising, insofar as we ought to expect this from him, but it is dazzling, even when it is displayed in a film that, on the surface, has a rather tame premise. An old man, Professor Isak Borg (played to perfection by Victor Sjöström), is driving to Lund, where he is to be honoured. His son's wife, and three spirited young people, two men and a woman, accompany him. They also pick up an utterly depressed couple along the way, only to drop them off when they begin to fight. Interspersed with the present actions are the old man's dreams, and flashbacks to his youth.Out of this material, Bergman crafts a wonderful and touching film about redemption. There is always a tendency to marvel at how an atheist like Bergman can be so deeply involved with religious issues, but many atheists, of course, are atheists precisely as a result of such deep involvement. I don't know enough about Bergman's views on religion to comment on his attitude towards God and religion beyond the basics. What is important, at any rate, is that this film is one in which an old man is redeemed from a miserably lonely and empty existence through contact with others. This is a deeply humanistic view of redemption, and one which is firmly grounded in reality.The film begins with the professor telling us that he has distanced himself from others, because he has shunned human relationships. This has left him feeling empty and alone. The man we see seems nice enough, until we learn from his son's wife, who speaks frankly to him, how this self-imposed exilic state has rendered him selfish and aloof. Through flashbacks and the dream sequences, we learn enough about his life to chart his progress: when young, the girl he loved, Sara, chose his brother over him. The professor married, but the marriage was a bad one; his wife cheated on him, but it apparently did nothing for him. To her, as she states in one of the dream sequences, he was \" cold as ice\". The professor, therefore, is old, lonely, and has an empty existence.How does one find oneself out of that miserable situation? There are three means through which the old man is redeemed. Firstly, the dream sequences serve to warn him of death, which, considering that the man is 78, could come any day. The dream sequences also point out to him just how detached he is from other human beings. In a fantastic scene, he is given a test, which he fails. The point is clear enough: he might be a professor and doctor, but that is nothing if he does not have an understanding of human beings, their emotions and feelings. Secondly, the flashbacks serve to remind him of a time when he was connected with others, as well as of times when he was disconnected from his wife and others. The beautiful scenes of his childhood are marvelously retold, with everyone well dressed in white, and the entire family engaging with each other. Only he is absent, standing in the dark at the threshold, an old man staring at the happy ghosts of the past mingling before him. Lastly, the three young people the professor meets, especially the wonderful Sonia, connect with him on a deeply emotional and innocent level. The girl looks like, and has the same name as, the Sonia who rejected the professor in favour of his brother when he was young. You can interpret this in any way you like, but I think it's obvious that we see here a kind of second chance. In the car, the professor asks Sonia which of the two young men she likes the most. She does not answer firmly. At the end of the film, as the three bid him goodbye, she tells the professor that she loves him the most of all. He brushes it off, but once he gets in bed, there is a great smile on his face. The smile no doubt is a reaction to the whole day's events, but I'm certain that one big reason for his happiness at the end is that Sonia finally chose him, after having rejected him so long ago.What is the overall message of this film? As with all great films, there is no one right answer. What is certain, however, is that Bergman gives us a view of the world that is neither wholly pessimistic nor wholly optimistic, because it is so painfully real. The characters in this film have been bruised. They are broken, and seek a way out of their situation. There is no indication in the film that Bergman suggests that a solution will solve all the problems. Rather, any change for the better can only come once we engage with the past. Through an understanding of our past and our self, we can add a new sense of our self to what the past given. If we can achieve that, through whatever means necessary, then we can be redeemed. In fact, that understanding of ourselves is itself a kind of redemption. Bergman's world is one in which hope is always possible. It can happen to an unsuspecting 78 year old man, and it can happen to us. It is never too late. Every day in our life is a new chance to make something better of ourselves.A+"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2667228",
      "warningSpoilers": false,
      "date": "1 September 2012",
      "rate": "10",
      "helpful": "12 out of 15 found this helpful.",
      "title": "Another one of Bergman's best",
      "content": "Ever since I first saw Wild Strawberries, like with The Seventh Seal, Fanny and Alexander and Cries and Whispers, I was blown away by how well made and thought provoking it was(it is one of his more accessible films too). Ingmar Bergman's direction as ever is superb, there is a certain warmth to how he composes and conveys everything. Wild Strawberries looks gorgeous, it is beautifully shot with atmospheric lighting and scenery. It isn't a Bergman film either without memorable images, and Wild Strawberries has those certainly. Some people may find the symbolism of the nightmares with the handless clocks and runaway hearses somewhat overpowering, I didn't think so, I found them very haunting and even fascinating to watch. It is the more beautiful images where Wild Strawberries really drew me in, the memories of the idyllic summers are among Bergman's most beautiful and finest moments. The score fits perfectly, while the script is incredibly thought-provoking, and the story contrasts innocence with the expectancy of youth with bitterness with the regrets of old age very movingly. Victor Sjöström is on magisterial form being both frosty and vain as his character seizes the chance for redemption. Overall, one of Bergman's finest, a wonderful film in all regards. 10/10 Bethany Cox"
    },
    {
      "username": "SanTropez_Couch",
      "userUrl": "https://www.imdb.com/user/ur2167075",
      "reviewLink": "https://www.imdb.com/review/rw0062739",
      "warningSpoilers": false,
      "date": "22 January 2003",
      "rate": "10",
      "helpful": "133 out of 166 found this helpful.",
      "title": "First Bergman",
      "content": "During the first scene of \"Wild Strawberries,\" I didn't think I'd be able to get through it -- the Swedish was so alien to me it sounded almost comical; it seemed as if every word ended with an \"eer\" sound. But quickly the beautiful black and white photography caught my eye and I was drawn into Isak Borg's story, or rather, his self-examination.The progression of the film is fantastic. Early in the film, Isak has an apparition within a dream and the small events leading up to it, within the dream, are quite brilliant. Throughout the rest of the film there are dreams and recollections; newly discovered secrets of the past that Isak sees for the first time. As he says in the film, \"Dreams, as if I must tell myself something I won't listen to when I'm awake.\"How Bergman shows us the characters is terrific. It's a like a relaxed puzzle that doesn't emphasize any sort of urgency to figure things out. The story unfolds beautifully as we get a deeper sense of Isak, who I assume is an alter ago of Ingmar Bergman at that stage of his life (he was thirty-nine when the film was released).It pains me to know that the majority of people my age would rather watch an Adam Sandler movie or \"The Rock\" than something like this. Hey, I liked \"Big Daddy\" and I love Nicolas Cage, but \"Wild Strawberries\" is one of the few films I've seen that could possibly change the way I live my life. I'm always interested in listening to what aged people have to say about their own life because, well, it can only give me tips about my own, and that's what this film does in a way.There is one sequence in the film that is frightening and \"arty,\" and I don't completely grasp what it means beyond Isak's deterioration and his realization of how people actually feel towards him (he's told earlier in the film as well, but he seems to accept this \"verdict\" more readily), but it doesn't take away from the film; rather, it's an interesting addition to an otherwise satisfying experience. In fact, it's probably the most vital part of the movie -- Isak may not like it, bbut once he gets past it, he has the option to develop.I don't know if the film is a masterpiece -- it's my introduction to Bergman, so once I see \"Cries and Whispers,\" \"Fanny and Alexander,\" \"Persona\" and \"The Seventh Seal\" (if I can get through it, this time) I'll come back to this film with a new perspective, or at least see it as a part of Bergman's whole. I do think this is a great film of its type. It's the kind of film that may require viewings every five or so years, as a sort of reminder.Pauline Kael once said that she didn't think much of Bergman because she'd done her share of soul-wrestling and it wasn't that difficult. The film isn't as challenging as I was expecting it to be, in fact, it's a walk in the park. It's pleasant and rich and beautiful, and the title seems perfect after you've seen the film. It's all about wild strawberries.****"
    },
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw3277908",
      "warningSpoilers": false,
      "date": "16 July 2015",
      "rate": "10",
      "helpful": "7 out of 9 found this helpful.",
      "title": "my favorite film",
      "content": "I remember when a see it first time. the images. the impressions. the feeling than it is a total film. because its virtue is a delicate manner to reflect the feelings of an age and the build of hope. because Bergman does the best choice for the lead role as homage and as reflection of a great career. because the image of empty clock is the most powerful metaphor for define the time and the run against it. because it is a film about each of its viewers. the regrets and the old age. the memories as way to survive and the fear of death. the strange links with the others. the sense of life and the need to have second chances. a masterpiece in a special form. because it has the gentle grace to be not only optimistic but wise support for reflection."
    },
    {
      "username": "disinterested_spectator",
      "userUrl": "https://www.imdb.com/user/ur6503856",
      "reviewLink": "https://www.imdb.com/review/rw3134395",
      "warningSpoilers": true,
      "date": "2 December 2014",
      "rate": "5",
      "helpful": "29 out of 39 found this helpful.",
      "title": "A Nice Old Man Just Can't Catch a Break",
      "content": "There seems to be a consensus that Isak is lonely and isolated because he is cold and aloof. Actually, he does not seem so bad. He is friendly enough with other people, and he appears to be content with his relatively solitary existence. Anyway, Sara, the woman he loved when he was young, married his brother, and somehow that was Isak's fault, because he was cold and aloof. And Karin, the woman he ended up being married to, cuckolded him, but that was also Isak's fault, because he was cold and aloof. He visits his mother, who is cold and aloof. His son Evald is cold and aloof.I suppose the point is that he should have been warm and accessible, and then Sara would have married him and they would have lived happily ever after. Or Karin would have been faithful to him and they would have lived happily ever after. And they would have raised their son Evald to be warm and accessible, so that he and his wife Marianne could have lived happily ever after. And being warm and accessible, Evald would have been happy to hear that Marianne was pregnant, so that they would have a child of their own, whom they could raise to be warm and accessible.Having seen the error of his ways, Isak decides that he will henceforth become warm and accessible. Better late than never. So, he asks Agda, his maid of forty years, if she would like to be on a first-name basis. She rebuffs him."
    },
    {
      "username": "gavin6942",
      "userUrl": "https://www.imdb.com/user/ur1234929",
      "reviewLink": "https://www.imdb.com/review/rw3136323",
      "warningSpoilers": false,
      "date": "5 December 2014",
      "rate": "7",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Farewell, Victor Sjostrom",
      "content": "After living a life marked by coldness, an aging professor (Victor Sjöström) is forced to confront the emptiness of his existence.Star Victor Sjöström had been a gem of Swedish cinema for decades. He worked primarily in the silent era; his best known films include \"The Phantom Carriage\" (1921), \"He Who Gets Slapped\" (1924) and \"The Wind\" (1928). Bergman said this film could not have been made without him, and it makes sense. Not only was Bergman influenced by these early Swedish films, but it makes sense to have a man at the end of his distinguished career.The real standout performance (besides Sjostrom) is Bibi Andersson, who plays Sara. Is it any surprise she starred in more than ten Bergman-directed pictures, including \"Smiles of a Summer's Night\", \"The Seventh Seal\", \"Brink of Life\", \"The Magician\", \"The Passion of Anna\", \"The Touch\" and \"Persona\". If Bergman had a muse, it was Andersson.Bergman has been a strong influence on Woody Allen, and \"Wild Strawberries\" has influenced a whole series of Allen films: \"Stardust Memories\", \"Another Woman\", \"Crimes and Misdemeanors\", and \"Deconstructing Harry\". No less a person than Stanley Kubrick said this was his second favorite film of all time."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0062741",
      "warningSpoilers": false,
      "date": "7 February 2003",
      "rate": "9",
      "helpful": "18 out of 29 found this helpful.",
      "title": "The dream sequences had chills running up my spine...",
      "content": "...and having said that I can say this might be one of Bergman's critically over-rated pictures. Of course there is much to look for, admire, and saturate with his tale of an old professor/doctor on his way to get a degree who looks back on his life, but the road trip scenes, while somewhat fascinating, can't hold a candle to the work that is displayed in the first dream. We see clocks with no hands (no time left for the old timer), a man with a very tightened face, and a coffin that falls right in front of the old man with himself inside of it, reflecting him. That this is one of Bergman's most evocative and powerful scenes goes to show why the film is so praised, and with the other dreams we see much insight into his fears and doubts on his life and what it's meant. But a number of the scenes go nowhere or ponder on events that slow the film down. Wild Strawberries is a film that can be judged as a display of perfect sorrow or longish observation, you decide. Plenty of beautiful outdoor scenery shots though; Max Von Sydow has a cameo as a gas station attendant. Grade: A."
    },
    {
      "username": "ian_harris",
      "userUrl": "https://www.imdb.com/user/ur1594266",
      "reviewLink": "https://www.imdb.com/review/rw0062737",
      "warningSpoilers": false,
      "date": "11 December 2002",
      "rate": "10",
      "helpful": "61 out of 84 found this helpful.",
      "title": "One of the very, very best",
      "content": "Quite simply one of the very, very best movies I have ever seen. Saw it recently for the second time, some 15 to 20 years after seeing it for the first time. First time round I was the age and stage of the traveling youngsters and saw the world through their eyes. This time I could identify more with the son and daughter-in-law characters with just as much conviction. The subtlety and sophistication of this movie defy description. It simply has to be seen to be believed. If you've never seen it, don't just sit there, go see the movie."
    },
    {
      "username": "fred3f",
      "userUrl": "https://www.imdb.com/user/ur3479720",
      "reviewLink": "https://www.imdb.com/review/rw1968635",
      "warningSpoilers": false,
      "date": "31 October 2008",
      "rate": "4",
      "helpful": "54 out of 71 found this helpful.",
      "title": "A Contrarian View",
      "content": "As I look at all the 10 star reviews that others have given this film I wonder if I am being foolhardy in daring to say something to the contrary. I am and have been for many years a Bergman fan. I eagerly saw most of his films as they were released. I love nearly all of them - this one being an exception. Certainly the film is worth seeing - any Bergman film is. But this one is often cited as his best, and there I would strongly disagree. It is about an academic and although professor Borg has to face some of his demons, he comes out on top in then end. I understand why this film is so popular. Academics see themselves in professor Borg and academics have a lot of influence on what is considered art and what isn't. Borg ends up looking good at the end of the film, and academics, although they have their faults like anyone else, like to think that they are worthy of the respect that their position commands. In many, many cases they are - and this is not a diatribe against academics. I just think that Bergman let this character off too easily, particularly when you compare the way he treats his other characters in movies like \"The Hour of the Wolf\", \"The Silence\", \"Shame\" and so on. He plumbs the depths of the soul and takes no prisoners. \"Wild Strawberries\" starts out that way, when the professor flashes back to the key points in his life where he turned away from love, life and reality in favor of academic honor. But ultimately Bergman backs down. The professor, having seen the errors of a lifetime in a few short hours, is shown to be wiser and a better man now as he receives his honorary award. Bergman does not do this in his other films. For me this gives a certain falsity to \"Wild Strawberries\" that I don't see in \"Persona\" for example. Well, everyone will probably disagree with me, - this is such an acclaimed film - but sometimes it is valuable to hear a contrarian opinion even when you don't agree with it."
    },
    {
      "username": "wiseowl-5",
      "userUrl": "https://www.imdb.com/user/ur7836253",
      "reviewLink": "https://www.imdb.com/review/rw1208226",
      "warningSpoilers": true,
      "date": "3 November 2005",
      "rate": "10",
      "helpful": "66 out of 74 found this helpful.",
      "title": "Film as an art form",
      "content": "We trace the journey of an elderly professor who is traveling to receive an honor for a life of accomplishment and service. Along the way he confronts the lack of success in his human relationships as opposed to the success he has enjoyed professionally. A string of encounters with the past and with iconic people he meets gradually bring the contrast into focus for the viewer.I particularly liked the subtle and intelligent storytelling in this film. He tells us before the credits that he is just a boring pedant. We realize as he comes to realize what this has really meant to him. We slowly receive hints of the emotional truths that frame the man's life. He is confronted by traces of how things could have been different.Important points are hinted at without being said--the viewer is left to sort them out. For example, the couple at the gas station convince us in a short and seemingly banal exchange that the Professor was a great healer whose service to those outside his family was anything but sterile. Yet speaking to his daughter-in-law, his smug insistence that a debt must be paid gives us a glimpse at what it must have been like for his son to have been held at emotional bay by bloodless, cold rationalism.This film deserves NOT to be remade, in order to preserve its artistic integrity. It affirms that film can be an art form that touches the soul as opposed to merely a product to be sold."
    },
    {
      "username": "Agent10",
      "userUrl": "https://www.imdb.com/user/ur1696608",
      "reviewLink": "https://www.imdb.com/review/rw0062723",
      "warningSpoilers": false,
      "date": "9 May 2002",
      "rate": "10",
      "helpful": "15 out of 21 found this helpful.",
      "title": "An almost mythical-style film",
      "content": "I watched this film for a class, and virtually everyone groaned over the development. I was the only one with an open mind, and I was thankful for such a condition of spirit. While this film was at times slow, the morphing of different worlds created quite an experience, one which was spiritual and eerie. The dream sequences were amazing, examining the doctor's state of mind through the use of imagery and allegorical conventions. A good film for anyone to experience, and you get to Max von Sydow as a young man."
    },
    {
      "username": "vitaleralphlouis",
      "userUrl": "https://www.imdb.com/user/ur5732819",
      "reviewLink": "https://www.imdb.com/review/rw1124241",
      "warningSpoilers": false,
      "date": "11 July 2005",
      "rate": "10",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Quietly spellbinding -- The Best Movie Ever Made",
      "content": "The film summary missed the point altogether. The professor (doctor) made no \"bad choices\" in his life; no, the \"choice\" that cast a shadow on the professor's entire life was Sara's choice in loving the professor's brother and rejecting the professor. Sara was/is the girl He loved, the girl he will always love; with that light taken out of his life everything remaining is coldness; the quiet hell of living life in the absence of love; an infection that effects his wife, his son, but oddly not the people he served as a doctor. As the story progresses, the professor witnesses a much younger Sara and her two rival young men, an exact reflection of his own situation decades ago. As the loneliness generated the coldness in his life, the one radiant light was his quiet and close-guarded memory of the love he had for Sara, and in the final scene we watch the old man view paradise as he looks back on the time when Sara was still with him, with his family at a country get-together. What adds to the emotional wallop is the realization that the old man is Ingmar Bergman's projection of himself some 40 years hence, Bergman, a man loved by many beautiful women, yet he can see (and fear) the devastation which can destroy even a strong person if such person loses the spark of irreplaceable love. Immediately following this movie, I evaluated my own life; resolving drastic action to avoid (if possible) the pitfall Bergman warned us about with this powerful movie."
    },
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0062735",
      "warningSpoilers": false,
      "date": "12 November 2002",
      "rate": "",
      "helpful": "9 out of 12 found this helpful.",
      "title": "Thoughtful & Thought-Provoking",
      "content": "Thoughtful and thought-provoking, this Ingmar Bergman classic will probably mean different things to different viewers. The deceptively simple story introduces you to characters who are not wholly sympathetic, yet whom you cannot help but care about. It shows their lives to be rather drab for the most part, yet it also brings out how important the events in their lives are to the characters themselves.The story of old Professor Borg driving across Sweden to attend a ceremony in his honor is complemented by just the right measure of dream sequences and flashbacks to his youth, which put the doctor's life into perspective and raise the questions that Bergman wants his viewers to think about. The youthful memories, and the symbols they use, often strike an immediate chord whether you can personally relate to them or not. The dreams are suitably weird without being overblown, and they are always pertinent. All of this is a difficult balance to maintain, and Bergman had a masterful restraint that most film-makers lack, especially today. He trusts his viewers to pay attention, and he wants the emphasis to remain on the important themes, where it should be, and not on cinematic artifice. Of course, \"Wild Strawberries\" also benefits enormously from Victor Sjöström's excellent lead performance, with considerable help from the rest of the cast as well.Since it has little action and little pretense, but much substance, this is the kind of movie that might never be widely popular. But it is a worthwhile experience that will mean something - not always the same thing - to anyone who gives it the attention that it deserves."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw2143900",
      "warningSpoilers": false,
      "date": "20 October 2009",
      "rate": "10",
      "helpful": "6 out of 8 found this helpful.",
      "title": "A Film About Redemption",
      "content": "About thirty years ago I was totally into art films. I went to college film festivals and art theaters. It was an experience. Unfortunately, I was a little too wet behind the ears to have the proper appreciation. I am now retracing my steps and watching these films again, and now I'm seeing why they've withstood the test of time. This is a tremendous film with so much humanity and so much sadness. It's about all of us who have lived out lives a bit thoughtlessly. I think of Kurosawa's \"Ikiru\" as an example of the ultimate in that category. The good doctor has all he can do to make his way to receive an honorary degree. He brings along his daughter-in-law who really doesn't like him mostly because of what he has done to make his son a cynical, harsh man. He has been beset by dreams with faceless men and handless clocks, where time stands still. He is terrified. As we go along we realize that time often does heal and when we repress what really bothers, we flatten out the rough edges. On the long drive, human beings do what they often do. They begin to forgive and understand. If the doctor is an old inflexible being, it becomes obvious that he has had enough when his daughter-in-law levels with him. He begins to draw up his past for review. He sees that his basic sterility was as destructive as if he had been cruel. The deciding factor is a group of kids going to Italy. The travelers pick them up and their infectious youth begins to come to the fore. They begin to offer new insights to the two unhappy people. There is so much in this movie that I can't begin to tell all here. Let the real critics do that, but this is ultimately about how we need to forgive and forget and let life into us. There are some wonderful religious arguments that are, thankfully, never resolved. Everyone is put to the test and the movie teaches us some valuable lessons."
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw1336181",
      "warningSpoilers": false,
      "date": "8 April 2006",
      "rate": "10",
      "helpful": "11 out of 16 found this helpful.",
      "title": "A beautiful, moving masterpiece - Bergman's best",
      "content": "The Swedish Professor Isak Borg (Victor Sjöström) embarks on a journey to Lund in order to receive an award for lifelong achievement in the medical field. After his house maid refuses to go with him (\"We're not married!\") he finds his daughter-in-law (Bibi Andersson) inviting herself along. Little does he know that she holds a great contempt for her father-in-law and is only accompanying him as a way of easily confronting him and expressing her true feelings.Painfully wounded by the prospect of his own daughter-in-law hating him, Borg begins to reflect upon his life in a series of visions, flashbacks and hazy dream sequences.This is my favorite Ingmar Bergman film. Although it's a close call, I'd say this is his overall best movie and is wonderfully, beautifully shot. It's tasteful, just the right running length (short enough not to contain any unnecessary scenes and long enough to feel satisfied when it's over).The point here -- underneath all the layers -- is that we don't have a very long time on earth, and we should make the most out of it. Borg realizes as a frail old man that he has ruined his own life and has no happy memories.It is Bergman's \"Citizen Kane\" or \"Ikiru\" -- a poignant reflection on humanity and a film that, ultimately, can change the way you look at life -- if you open up enough to let it."
    }
  ],
  "errorMessage": ""
}