{
  "imDbId": "tt0050986",
  "title": "Wild Strawberries",
  "fullTitle": "Wild Strawberries (1957)",
  "type": "Movie",
  "year": "1957",
  "language": "en",
  "titleInLanguage": "Wild Strawberries (film)",
  "url": "https://en.wikipedia.org/wiki/Wild_Strawberries_(film)",
  "plotShort": {
    "plainText": "Wild Strawberries is a 1957 Swedish drama film written and directed by Ingmar Bergman. The original Swedish title is Smultronstället, which literally means \"the wild strawberry patch\" but idiomatically signifies a hidden gem of a place, often with personal or sentimental value, and not widely known. The cast includes Victor Sjöström in his final screen performance as an old man recalling his past, as well as Bergman regulars Bibi Andersson, Ingrid Thulin, and Gunnar Björnstrand. Max von Sydow also appears in a small role.\r\nBergman wrote the screenplay while hospitalized. Exploring philosophical themes such as introspection and human existence, Wild Strawberries received wide positive domestic reception upon release, and won the Golden Bear for Best Film at the 8th Berlin International Film Festival. It is often considered to be Bergman's greatest and most moving film and one of the greatest films ever made.",
    "html": "<p>Wild Strawberries is a 1957 Swedish drama film written and directed by Ingmar Bergman. The original Swedish title is Smultronstället, which literally means \"the wild strawberry patch\" but idiomatically signifies a hidden gem of a place, often with personal or sentimental value, and not widely known. The cast includes Victor Sjöström in his final screen performance as an old man recalling his past, as well as Bergman regulars Bibi Andersson, Ingrid Thulin, and Gunnar Björnstrand. Max von Sydow also appears in a small role.</p><p>Bergman wrote the screenplay while hospitalized. Exploring philosophical themes such as introspection and human existence, Wild Strawberries received wide positive domestic reception upon release, and won the Golden Bear for Best Film at the 8th Berlin International Film Festival. It is often considered to be Bergman's greatest and most moving film and one of the greatest films ever made.</p>"
  },
  "plotFull": {
    "plainText": "Wild Strawberries is a 1957 Swedish drama film written and directed by Ingmar Bergman. The original Swedish title is Smultronstället, which literally means \"the wild strawberry patch\" but idiomatically signifies a hidden gem of a place, often with personal or sentimental value, and not widely known. The cast includes Victor Sjöström in his final screen performance as an old man recalling his past, as well as Bergman regulars Bibi Andersson, Ingrid Thulin, and Gunnar Björnstrand. Max von Sydow also appears in a small role.\r\nBergman wrote the screenplay while hospitalized. Exploring philosophical themes such as introspection and human existence, Wild Strawberries received wide positive domestic reception upon release, and won the Golden Bear for Best Film at the 8th Berlin International Film Festival. It is often considered to be Bergman's greatest and most moving film and one of the greatest films ever made.\r\nPlot\r\nGrouchy, stubborn, and egotistical Professor Isak Borg is a widowed 78-year-old physician who specialized in bacteriology. Before specializing, he served as a general practitioner in rural Sweden. He sets out on a long car ride from Stockholm to Lund to be awarded the degree of Doctor Jubilaris 50 years after he received his doctorate from Lund University. He is accompanied by his pregnant daughter-in-law Marianne who does not much like her father-in-law and is planning to separate from her husband, Evald, Isak's only son, who does not want her to have the baby, their first.\r\nDuring the trip, Isak is forced by nightmares, daydreams, old age, and impending death to reevaluate his life. He meets a series of hitchhikers, each of whom sets off dreams or reveries into Borg's troubled past. The first group consists of two young men and their companion, a woman named Sara who is adored by both men. Sara is a double for the love of Isak's youth. He reminisces about his childhood at the seaside and his sweetheart Sara, with whom he remembered gathering strawberries, but who instead married his brother. The first group remains with him throughout his journey. Next Isak and Marianne pick up an embittered middle-aged couple, the Almans, whose vehicle had nearly collided with theirs. The pair exchanges such terrible vitriol and venom that Marianne stops the car and demands that they leave. The couple reminds Isak of his own unhappy marriage. In a dream sequence, Isak is asked by Sten Alman, now the examiner, to read \"foreign\" letters on the blackboard. He cannot. So, Alman reads it for him: \"A doctor's first duty is to ask forgiveness,\" from which he concludes, \"You are guilty of guilt.\"\r\nHe is confronted by his loneliness and aloofness, recognizing these traits in both his elderly mother (whom they stop to visit) and in his middle-aged physician son, and he gradually begins to accept himself, his past, his present, and his approaching death.\r\nBorg finally arrives at his destination and is promoted to Doctor Jubilaris, but this proves to be an empty ritual. That night, he bids a loving goodbye to his young friends, to whom the once bitter old man whispers in response to a playful declaration of the young girl's love, \"I'll remember.\" As he goes to his bed in his son's home, he is overcome by a sense of peace, and dreams of a family picnic by a lake. Closure and affirmation of life have finally come, and Borg's face radiates joy.\r\nCast\r\nVictor Sjöström as Professor Isak Borg\r\nBibi Andersson as Sara (both: Isak's cousin/hitchhiker)\r\nIngrid Thulin as Marianne Borg\r\nGunnar Björnstrand as Evald Borg\r\nJullan Kindahl as Agda, Isak's housekeeper\r\nFolke Sundquist as Anders, hitchhiker\r\nBjörn Bjelfvenstam as Viktor, hitchhiker\r\nNaima Wifstrand as Isak's Mother\r\nGunnel Broström as Berit Alman, angry wife\r\nGunnar Sjöberg as Sten Alman, angry husband / The Examiner\r\nMax von Sydow as Henrik Åkerman, gas station attendant\r\nAnn-Marie Wiman as Eva Åkerman\r\nGertrud Fridh as Karin Borg, Isak's wife\r\nÅke Fridell as Karin's lover\r\nSif Ruud as Aunt Olga\r\nYngve Nordwall as Uncle Aron\r\nPer Sjöstrand as Sigfrid Borg\r\nGio Petré as Sigbritt Borg\r\nGunnel Lindblom as Charlotta Borg\r\nMaud Hansson as Angelica Borg\r\nEva Norée as Anna Borg\r\nGöran Lundquist as Benjamin Borg\r\nPer Skogsberg as Hagbart Borg\r\nLena Bergman as Kristina Borg, twin\r\nMonica Ehrling as Birgitta Borg, twin\r\nProduction\r\nOrigins\r\nBergman's idea for the film originated on a drive from Stockholm to Dalarna during which he stopped in Uppsala, his hometown. Driving by his grandmother's house, he suddenly imagined how it would be if he could open the door and inside find everything just as it was during his childhood. \"So it struck me — what if you could make a film about this; that you just walk up in a realistic way and open a door, and then you walk into your childhood, and then you open another door and come back to reality, and then you make a turn around a street corner and arrive in some other period of your existence, and everything goes on, lives. That was actually the idea behind Wild Strawberries\". Later, he would revise the story of the film's genesis. In Images: My Life in Film, he comments on his own earlier statement: \"That's a lie. The truth is that I am forever living in my childhood.\": p22\r\nDevelopment\r\nBergman wrote the screenplay of Wild Strawberries in Stockholm's Karolinska Hospital (the workplace of Isak Borg) in the late spring of 1957; he'd recently been given permission to proceed by producer Carl Anders Dymling on the basis of a short synopsis. He was in the hospital for two months, being treated for recurrent gastric problems and general stress. Bergman's doctor at Karolinska was his good friend Sture Helander who invited him to attend his lectures on psychosomatics. Helander was married to Gunnel Lindblom who was to play Isak's sister Charlotta in the film. Bergman was at a high point of his professional career after a triumphant season at the Malmö City Theatre (where he had been artistic director since 1952), in addition to the success of both Smiles of a Summer Night (1955) and The Seventh Seal (1957). His private life, however, was in disarray. His third marriage was on the rocks; his affair with Bibi Andersson, which had begun in 1954, was coming to an end; and his relationship with his parents was, after an attempted reconciliation with his mother, at a desperately low ebb.: p17\r\nCasting and pre-production progressed rapidly. The completed screenplay is dated May 31. Shooting took place between July 2, 1957 and August 27, 1957. The scenes at the summer house were filmed in Saltsjöbaden, a fashionable resort in the Stockholm archipelago. Part of the nightmare sequence was shot with predawn summer light in Gamla stan, the old part of central Stockholm. Most of the movie was made at SF's studio and on its back lot at Råsunda in northern Stockholm.\r\nCasting\r\nThe director's immediate choice for the leading role of the old professor was Victor Sjöström, Bergman's silent film idol and early counselor at Svensk Filmindustri, whom he had directed in To Joy eight years earlier. \"Victor,\" Bergman remarked, \"was feeling wretched and didn’t want to;... he must have been seventy eight. He was misanthropic and tired and felt old. I had to use all my powers of persuasion to get him to play the part.\"\r\nIn Bergman on Bergman, he has stated that he only thought of Sjöström when the screenplay was complete, and that he asked Dymling to contact the famous actor and film director. Yet in Images: My Life in Film, he claims, \"It is probably worth noting that I never for a moment thought of Sjöström when I was writing the screenplay. The suggestion came from the film's producer, Carl Anders Dymling. As I recall, I thought long and hard before I agreed to let him have the part.\": p24\r\nDuring the shooting, the health of the 78-year-old Sjöström gave cause for concern. Dymling had persuaded him to take on the role with the words: \"All you have to do is lie under a tree, eat wild strawberries and think about your past, so it's nothing too arduous.\" This was inaccurate and the burden of the film was completely on Sjöström who is in all but one scene of the film. Initially, Sjöström had problems with his lines which made him frustrated and angry. He would go off into a corner and beat his head against the wall in frustration, even to the point of drawing blood and producing bruises. He sometimes quibbled over details in the script. To unburden his revered mentor, Bergman made a pact with Ingrid Thulin that if anything went wrong during a scene, she would take the blame on herself. Things improved when they changed filming times so that Sjöström could get home in time for his customary late afternoon whisky at 5:00. Sjöström got along particularly well with Bibi Andersson.\r\nAs usual, Bergman chose his collaborators from a team of actors and technicians with whom he had worked before in the cinema and the theater. As Sara, Bibi Andersson plays both Borg's childhood sweetheart who left him to marry his brother and a charming, energetic young woman who reminds him of that lost love. Andersson, then twenty one years old, was a member in Bergman's famed repertory company. He gave her a small part in his films Smiles of a Summer Night (1955) and as the jester's wife in The Seventh Seal (1957). She would continue to work for him in many more films, most notably in Persona (1966). Ingrid Thulin plays Marianne, the sad, gentle and warm daughter-in-law of Borg. She appeared in other Bergman films as the mistress in Winter Light (1963) and as one of three sisters in Cries and Whispers (1972). Bergman's first wife, Else Fisher, made a brief uncredited appearance as Borg's mother in the final flashback; their daughter, Lena, played one of Isak's twin sisters.\r\nReception\r\nWild Strawberries received strongly positive reviews in Sweden; its acting, script, and photography were common areas of praise. It was among the films that cemented Bergman's international reputation, but American critics were not unanimous in their praise. A number of reviewers found its story puzzling. In The New York Times, Bosley Crowther lauded the performances of Sjöström and Andersson but wrote, \"This one is so thoroughly mystifying that we wonder whether Mr. Bergman himself knew what he was trying to say.\" The film ranked 7th on Cahiers du Cinéma's Top 10 Films of the Year List in 1959.\r\nIn a 1963 interview with Cinema magazine, director Stanley Kubrick listed the film as his second favourite of all time. It was also listed by Russian filmmaker Andrei Tarkovsky as one of his top ten favorite films. It is now considered one of Bergman's major works. Film critic Derek Malcolm ranked the film at No. 56 on his list of the \"Top 100 Movies\" in 2001. In 2007, the film was ranked at No. 34 by The Guardian's readers poll on the list of \"40 greatest foreign films of all time\". In 2009, the film was ranked at No. 59 on Japanese film magazine kinema Junpo's Top 100 Non-Japanese Films of All Time list.\r\nIn 1972, the work was ranked 10th, in 2002 it was ranked 27th and in 2012, It ranked 63rd on the Sight & Sound critics' poll of the greatest films ever made. That same year the film was voted at number 11 on the 25 best Swedish films of all time list by a poll of 50 film critics and academics conducted by film magazine FLM. Its screenplay was listed in Total Film as one of the 50 best ever written. The film was included in BBC's 2018 list of The 100 greatest foreign language films. In 2022 edition of Sight & Sound's Greatest films of all time list the film ranked 72nd in the director's poll.\r\nOn the review aggregator website Rotten Tomatoes, Wild Strawberries has an approval rating of 96% based on 45 reviews, with an average score of 8.90/10. The site's critical consensus reads: \"Wild Strawberries were never so bittersweet as Ingmar Bergman's beautifully written and filmed look at one man's nostalgic journey into the past.\" On Metacritic, the film has a weighted average score of 88 out of 100 based on 17 critic's reviews, indicating \"universal acclaim\".\r\nAwards and honors\r\nThe film won the Golden Bear for Best Film and the FIPRESCI Prize at the 8th Berlin International Film Festival, \"Best Film\" and \"Best Actor\" at the Mar del Plata Film Festival and won the Golden Globe Award for Best Foreign Film in 1960. The Film was nominated for a BAFTA Award in Best Film From Any Source category in 1959. It was also nominated for an Academy Award for Original Screenplay, but the nomination was refused by Bergman. The film won the Pasinetti Award at 1958 Venice Film Festival. It won the Bodil Award for Best European Film in 1959 and the Nastro d'Argento for Best Non-Italian Film in 1960.\r\nThe film is included on the Vatican Best Films List, recommended for its portrayal of a man's \"interior journey from pangs of regret and anxiety to a refreshing sense of peace and reconciliation\".\r\nInfluence\r\nWild Strawberries influenced the Woody Allen films Stardust Memories (1980), Another Woman (1988), Crimes and Misdemeanors (1989), and Deconstructing Harry (1997). In Stardust Memories, the film's plot is similar in that the protagonist, filmmaker Sandy Bates (Woody Allen), is attending a viewing of his films, while reminiscing about and reflecting on his life and past relationships and trying to fix and stabilize his current ones, which are infused with flashbacks and dream sequences. In Another Woman, the film's main character, Marion Post (Gena Rowlands), is also accused by friends and relatives of being cold and unfeeling, which forces her to reexamine her life. Allen also borrows several tropes from Bergman's film, such as having Lynn (Frances Conroy), Post's sister-in-law, tell her that her brother Paul (Harris Yulin) hates her and having a former student tell Post that her class changed her life. Allen has Post confront the demons of her past via several dream sequences and flashbacks that reveal important information to a viewer, as in Wild Strawberries. In Crimes and Misdemeanors, Allen made reference to the scene in which Isak watches his family have dinner. In Deconstructing Harry, the plot (a writer going on a long drive to receive an honorary award from his old university, while reflecting upon his life's experiences, with dream sequences) essentially mirrors that of Wild Strawberries.\r\nSatyajit Ray's 1966 film Nayak was to some extent inspired by Wild Strawberries.",
    "html": "<p>Wild Strawberries is a 1957 Swedish drama film written and directed by Ingmar Bergman. The original Swedish title is Smultronstället, which literally means \"the wild strawberry patch\" but idiomatically signifies a hidden gem of a place, often with personal or sentimental value, and not widely known. The cast includes Victor Sjöström in his final screen performance as an old man recalling his past, as well as Bergman regulars Bibi Andersson, Ingrid Thulin, and Gunnar Björnstrand. Max von Sydow also appears in a small role.</p><p>Bergman wrote the screenplay while hospitalized. Exploring philosophical themes such as introspection and human existence, Wild Strawberries received wide positive domestic reception upon release, and won the Golden Bear for Best Film at the 8th Berlin International Film Festival. It is often considered to be Bergman's greatest and most moving film and one of the greatest films ever made.</p><br/><h3>Plot</h3><p>Grouchy, stubborn, and egotistical Professor Isak Borg is a widowed 78-year-old physician who specialized in bacteriology. Before specializing, he served as a general practitioner in rural Sweden. He sets out on a long car ride from Stockholm to Lund to be awarded the degree of Doctor Jubilaris 50 years after he received his doctorate from Lund University. He is accompanied by his pregnant daughter-in-law Marianne who does not much like her father-in-law and is planning to separate from her husband, Evald, Isak's only son, who does not want her to have the baby, their first.</p><p>During the trip, Isak is forced by nightmares, daydreams, old age, and impending death to reevaluate his life. He meets a series of hitchhikers, each of whom sets off dreams or reveries into Borg's troubled past. The first group consists of two young men and their companion, a woman named Sara who is adored by both men. Sara is a double for the love of Isak's youth. He reminisces about his childhood at the seaside and his sweetheart Sara, with whom he remembered gathering strawberries, but who instead married his brother. The first group remains with him throughout his journey. Next Isak and Marianne pick up an embittered middle-aged couple, the Almans, whose vehicle had nearly collided with theirs. The pair exchanges such terrible vitriol and venom that Marianne stops the car and demands that they leave. The couple reminds Isak of his own unhappy marriage. In a dream sequence, Isak is asked by Sten Alman, now the examiner, to read \"foreign\" letters on the blackboard. He cannot. So, Alman reads it for him: \"A doctor's first duty is to ask forgiveness,\" from which he concludes, \"You are guilty of guilt.\"</p><p>He is confronted by his loneliness and aloofness, recognizing these traits in both his elderly mother (whom they stop to visit) and in his middle-aged physician son, and he gradually begins to accept himself, his past, his present, and his approaching death.</p><p>Borg finally arrives at his destination and is promoted to Doctor Jubilaris, but this proves to be an empty ritual. That night, he bids a loving goodbye to his young friends, to whom the once bitter old man whispers in response to a playful declaration of the young girl's love, \"I'll remember.\" As he goes to his bed in his son's home, he is overcome by a sense of peace, and dreams of a family picnic by a lake. Closure and affirmation of life have finally come, and Borg's face radiates joy.</p><br/><h3>Cast</h3><ul><li>Victor Sjöström as Professor Isak Borg</li><li>Bibi Andersson as Sara (both: Isak's cousin/hitchhiker)</li><li>Ingrid Thulin as Marianne Borg</li><li>Gunnar Björnstrand as Evald Borg</li><li>Jullan Kindahl as Agda, Isak's housekeeper</li><li>Folke Sundquist as Anders, hitchhiker</li><li>Björn Bjelfvenstam as Viktor, hitchhiker</li><li>Naima Wifstrand as Isak's Mother</li><li>Gunnel Broström as Berit Alman, angry wife</li><li>Gunnar Sjöberg as Sten Alman, angry husband / The Examiner</li><li>Max von Sydow as Henrik Åkerman, gas station attendant</li><li>Ann-Marie Wiman as Eva Åkerman</li><li>Gertrud Fridh as Karin Borg, Isak's wife</li><li>Åke Fridell as Karin's lover</li><li>Sif Ruud as Aunt Olga</li><li>Yngve Nordwall as Uncle Aron</li><li>Per Sjöstrand as Sigfrid Borg</li><li>Gio Petré as Sigbritt Borg</li><li>Gunnel Lindblom as Charlotta Borg</li><li>Maud Hansson as Angelica Borg</li><li>Eva Norée as Anna Borg</li><li>Göran Lundquist as Benjamin Borg</li><li>Per Skogsberg as Hagbart Borg</li><li>Lena Bergman as Kristina Borg, twin</li><li>Monica Ehrling as Birgitta Borg, twin</li></ul><br/><h3>Production</h3><h4>Origins</h4><p>Bergman's idea for the film originated on a drive from Stockholm to Dalarna during which he stopped in Uppsala, his hometown. Driving by his grandmother's house, he suddenly imagined how it would be if he could open the door and inside find everything just as it was during his childhood. \"So it struck me — what if you could make a film about this; that you just walk up in a realistic way and open a door, and then you walk into your childhood, and then you open another door and come back to reality, and then you make a turn around a street corner and arrive in some other period of your existence, and everything goes on, lives. That was actually the idea behind Wild Strawberries\". Later, he would revise the story of the film's genesis. In Images: My Life in Film, he comments on his own earlier statement: \"That's a lie. The truth is that I am forever living in my childhood.\": p22</p><h4>Development</h4><p>Bergman wrote the screenplay of Wild Strawberries in Stockholm's Karolinska Hospital (the workplace of Isak Borg) in the late spring of 1957; he'd recently been given permission to proceed by producer Carl Anders Dymling on the basis of a short synopsis. He was in the hospital for two months, being treated for recurrent gastric problems and general stress. Bergman's doctor at Karolinska was his good friend Sture Helander who invited him to attend his lectures on psychosomatics. Helander was married to Gunnel Lindblom who was to play Isak's sister Charlotta in the film. Bergman was at a high point of his professional career after a triumphant season at the Malmö City Theatre (where he had been artistic director since 1952), in addition to the success of both Smiles of a Summer Night (1955) and The Seventh Seal (1957). His private life, however, was in disarray. His third marriage was on the rocks; his affair with Bibi Andersson, which had begun in 1954, was coming to an end; and his relationship with his parents was, after an attempted reconciliation with his mother, at a desperately low ebb.: p17</p><p>Casting and pre-production progressed rapidly. The completed screenplay is dated May 31. Shooting took place between July 2, 1957 and August 27, 1957. The scenes at the summer house were filmed in Saltsjöbaden, a fashionable resort in the Stockholm archipelago. Part of the nightmare sequence was shot with predawn summer light in Gamla stan, the old part of central Stockholm. Most of the movie was made at SF's studio and on its back lot at Råsunda in northern Stockholm.</p><h4>Casting</h4><p>The director's immediate choice for the leading role of the old professor was Victor Sjöström, Bergman's silent film idol and early counselor at Svensk Filmindustri, whom he had directed in To Joy eight years earlier. \"Victor,\" Bergman remarked, \"was feeling wretched and didn’t want to;... he must have been seventy eight. He was misanthropic and tired and felt old. I had to use all my powers of persuasion to get him to play the part.\"</p><p>In Bergman on Bergman, he has stated that he only thought of Sjöström when the screenplay was complete, and that he asked Dymling to contact the famous actor and film director. Yet in Images: My Life in Film, he claims, \"It is probably worth noting that I never for a moment thought of Sjöström when I was writing the screenplay. The suggestion came from the film's producer, Carl Anders Dymling. As I recall, I thought long and hard before I agreed to let him have the part.\": p24</p><p>During the shooting, the health of the 78-year-old Sjöström gave cause for concern. Dymling had persuaded him to take on the role with the words: \"All you have to do is lie under a tree, eat wild strawberries and think about your past, so it's nothing too arduous.\" This was inaccurate and the burden of the film was completely on Sjöström who is in all but one scene of the film. Initially, Sjöström had problems with his lines which made him frustrated and angry. He would go off into a corner and beat his head against the wall in frustration, even to the point of drawing blood and producing bruises. He sometimes quibbled over details in the script. To unburden his revered mentor, Bergman made a pact with Ingrid Thulin that if anything went wrong during a scene, she would take the blame on herself. Things improved when they changed filming times so that Sjöström could get home in time for his customary late afternoon whisky at 5:00. Sjöström got along particularly well with Bibi Andersson.</p><p>As usual, Bergman chose his collaborators from a team of actors and technicians with whom he had worked before in the cinema and the theater. As Sara, Bibi Andersson plays both Borg's childhood sweetheart who left him to marry his brother and a charming, energetic young woman who reminds him of that lost love. Andersson, then twenty one years old, was a member in Bergman's famed repertory company. He gave her a small part in his films Smiles of a Summer Night (1955) and as the jester's wife in The Seventh Seal (1957). She would continue to work for him in many more films, most notably in Persona (1966). Ingrid Thulin plays Marianne, the sad, gentle and warm daughter-in-law of Borg. She appeared in other Bergman films as the mistress in Winter Light (1963) and as one of three sisters in Cries and Whispers (1972). Bergman's first wife, Else Fisher, made a brief uncredited appearance as Borg's mother in the final flashback; their daughter, Lena, played one of Isak's twin sisters.</p><br/><h3>Reception</h3><p>Wild Strawberries received strongly positive reviews in Sweden; its acting, script, and photography were common areas of praise. It was among the films that cemented Bergman's international reputation, but American critics were not unanimous in their praise. A number of reviewers found its story puzzling. In The New York Times, Bosley Crowther lauded the performances of Sjöström and Andersson but wrote, \"This one is so thoroughly mystifying that we wonder whether Mr. Bergman himself knew what he was trying to say.\" The film ranked 7th on Cahiers du Cinéma's Top 10 Films of the Year List in 1959.</p><p>In a 1963 interview with Cinema magazine, director Stanley Kubrick listed the film as his second favourite of all time. It was also listed by Russian filmmaker Andrei Tarkovsky as one of his top ten favorite films. It is now considered one of Bergman's major works. Film critic Derek Malcolm ranked the film at No. 56 on his list of the \"Top 100 Movies\" in 2001. In 2007, the film was ranked at No. 34 by The Guardian's readers poll on the list of \"40 greatest foreign films of all time\". In 2009, the film was ranked at No. 59 on Japanese film magazine kinema Junpo's Top 100 Non-Japanese Films of All Time list.</p><p>In 1972, the work was ranked 10th, in 2002 it was ranked 27th and in 2012, It ranked 63rd on the Sight & Sound critics' poll of the greatest films ever made. That same year the film was voted at number 11 on the 25 best Swedish films of all time list by a poll of 50 film critics and academics conducted by film magazine FLM. Its screenplay was listed in Total Film as one of the 50 best ever written. The film was included in BBC's 2018 list of The 100 greatest foreign language films. In 2022 edition of Sight & Sound's Greatest films of all time list the film ranked 72nd in the director's poll.</p><p>On the review aggregator website Rotten Tomatoes, Wild Strawberries has an approval rating of 96% based on 45 reviews, with an average score of 8.90/10. The site's critical consensus reads: \"Wild Strawberries were never so bittersweet as Ingmar Bergman's beautifully written and filmed look at one man's nostalgic journey into the past.\" On Metacritic, the film has a weighted average score of 88 out of 100 based on 17 critic's reviews, indicating \"universal acclaim\".</p><br/><h3>Awards and honors</h3><p>The film won the Golden Bear for Best Film and the FIPRESCI Prize at the 8th Berlin International Film Festival, \"Best Film\" and \"Best Actor\" at the Mar del Plata Film Festival and won the Golden Globe Award for Best Foreign Film in 1960. The Film was nominated for a BAFTA Award in Best Film From Any Source category in 1959. It was also nominated for an Academy Award for Original Screenplay, but the nomination was refused by Bergman. The film won the Pasinetti Award at 1958 Venice Film Festival. It won the Bodil Award for Best European Film in 1959 and the Nastro d'Argento for Best Non-Italian Film in 1960.</p><p>The film is included on the Vatican Best Films List, recommended for its portrayal of a man's \"interior journey from pangs of regret and anxiety to a refreshing sense of peace and reconciliation\".</p><br/><h3>Influence</h3><p>Wild Strawberries influenced the Woody Allen films Stardust Memories (1980), Another Woman (1988), Crimes and Misdemeanors (1989), and Deconstructing Harry (1997). In Stardust Memories, the film's plot is similar in that the protagonist, filmmaker Sandy Bates (Woody Allen), is attending a viewing of his films, while reminiscing about and reflecting on his life and past relationships and trying to fix and stabilize his current ones, which are infused with flashbacks and dream sequences. In Another Woman, the film's main character, Marion Post (Gena Rowlands), is also accused by friends and relatives of being cold and unfeeling, which forces her to reexamine her life. Allen also borrows several tropes from Bergman's film, such as having Lynn (Frances Conroy), Post's sister-in-law, tell her that her brother Paul (Harris Yulin) hates her and having a former student tell Post that her class changed her life. Allen has Post confront the demons of her past via several dream sequences and flashbacks that reveal important information to a viewer, as in Wild Strawberries. In Crimes and Misdemeanors, Allen made reference to the scene in which Isak watches his family have dinner. In Deconstructing Harry, the plot (a writer going on a long drive to receive an honorary award from his old university, while reflecting upon his life's experiences, with dream sequences) essentially mirrors that of Wild Strawberries.</p><p>Satyajit Ray's 1966 film Nayak was to some extent inspired by Wild Strawberries.</p><br/>"
  },
  "errorMessage": ""
}