{
  "imDbId": "tt1345836",
  "title": "The Dark Knight Rises",
  "fullTitle": "The Dark Knight Rises (2012)",
  "type": "Movie",
  "year": "2012",
  "items": [
    {
      "publisher": "The Hollywood Reporter",
      "author": "Todd McCarthy",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/dark-knight-rises-film-review-349354/",
      "rate": "100",
      "content": "Makes everything in the rival Marvel universe look thoroughly silly and childish. Entirely enveloping and at times unnerving in a relevant way one would never have imagined, as a cohesive whole this ranks as the best of Nolan's trio, even if it lacks -- how could it not? -- an element as unique as Heath Ledger's immortal turn in The Dark Knight. It's a blockbuster by any standard."
    },
    {
      "publisher": "Total Film",
      "author": "Matthew Leyland",
      "link": "",
      "rate": "100",
      "content": "A smart, stirring spectacle that faces down impossible expectations to pull off a hugely satisfying end to business."
    },
    {
      "publisher": "Empire",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "With spectacle in abundance and sexiness in (supporting) parts, this is superhero filmmaking on an unprecedented scale. Rises may lack the surprise of Begins or the anarchy of Knight, but it makes up for that in pure emotion."
    },
    {
      "publisher": "Time",
      "author": "Richard Corliss",
      "link": "https://entertainment.time.com/2012/07/16/times-review-of-the-dark-knight-rises-to-the-depths-to-the-heights/?iid=ent-main-lede",
      "rate": "100",
      "content": "\"The Avengers\" is kid stuff compared with this meditation on mortal loss and heroic frailty. For once a melodrama with pulp origins convinces viewers that it can be the modern equivalent to Greek myths or a Jonathan Swift satire. TDKR is that big, that bitter - a film of grand ambitions and epic achievement. The most eagerly anticipated movie of summer 2012 was worth waiting for."
    },
    {
      "publisher": "Variety",
      "author": "Justin Chang",
      "link": "https://variety.com/2012/film/reviews/the-dark-knight-rises-1117947904/",
      "rate": "90",
      "content": "While The Dark Knight Rises raises the dramatic stakes considerably, at least in terms of its potential body count, it doesn't have its predecessor's breathless sense of menace or its demonic showmanship, and with the exception of one audacious sleight-of-hand twist, the story can at times seem more complicated than intricate."
    },
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "",
      "rate": "88",
      "content": "The sheer scope of Nolan's vision – with emotion and spectacle thundering across the screen – is staggering. The Dark Knight Rises is the King Daddy of summer movie epics."
    },
    {
      "publisher": "The Guardian",
      "author": "Xan Brooks",
      "link": "https://www.theguardian.com/film/2012/jul/16/the-dark-knight-rises-first-review",
      "rate": "80",
      "content": "The Dark Knight Rises may be a hammy, portentous affair but Nolan directs it with aplomb. He takes these cod-heroic, costumed elements and whisks them into a tale of heavy-metal fury, full of pain and toil, surging uphill, across the flyovers, in search of a climax."
    },
    {
      "publisher": "IndieWire",
      "author": "Eric Kohn",
      "link": "https://www.indiewire.com/2012/07/review-the-dark-knight-rises-brings-christopher-nolans-batman-trilogy-to-a-thundering-mostly-satisfying-conclusion-46206/",
      "rate": "75",
      "content": "A spectacular noir epic that's equal parts murky, bloated, flashy and triumphantly cinematic. Four years after Nolan's \"Batman Begins\" sequel \"The Dark Knight\" rattled audiences with a similar audiovisual overload, the new movie falls into the same rhythm and remains viscerally satisfying even when the story falters."
    },
    {
      "publisher": "",
      "author": "Boxoffice Magazine",
      "link": "https://www.boxofficepro.com/",
      "rate": "70",
      "content": "A fine film in a strong summer, but it lacks the spark that made its immediate predecessor a masterpiece."
    },
    {
      "publisher": "Time Out",
      "author": "David Fear",
      "link": "",
      "rate": "60",
      "content": "Grand scale or no, this feels like a blockbuster on autopilot more often than not, curiously detached and self-importantly somber even by the director's standards - and without the cerebral heft of his best work."
    }
  ],
  "errorMessage": ""
}