{
  "imDbId": "tt0211915",
  "title": "Amélie",
  "fullTitle": "Amélie (2001)",
  "type": "Movie",
  "year": "2001",
  "items": [
    {
      "publisher": "Film Threat",
      "author": "Ross Williams",
      "link": "",
      "rate": "100",
      "content": "Joyous. This is a film that will put a goofy grin on your face from the opening frame, through to the credits, out into the lobby, the whole way home, and possibly even till you fall asleep."
    },
    {
      "publisher": "Philadelphia Inquirer",
      "author": "Steven Rea",
      "link": "https://www.inquirer.com/entertainment/?id=40181&amp;reviewId=3365",
      "rate": "100",
      "content": "A feel-good movie, in the absolute best sense."
    },
    {
      "publisher": "Washington Post",
      "author": "Desson Thomson",
      "link": "",
      "rate": "100",
      "content": "A movie for aesthetically hungry moviegoers: wildly amusing, sometimes sardonic and always touching. There's so much here, and all of it delightful."
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Kimberley Jones",
      "link": "https://www.austinchronicle.com/events/film/",
      "rate": "89",
      "content": "A film that wants you to get happy."
    },
    {
      "publisher": "Miami Herald",
      "author": "Rene Rodriguez",
      "link": "",
      "rate": "88",
      "content": "At two hours, the movie is probably 15 minutes too long -- the final half-hour in particular could have used some trimming -- but complaining about having too much of a good thing makes one sound like a grouch."
    },
    {
      "publisher": "Portland Oregonian",
      "author": "Shawn Levy",
      "link": "",
      "rate": "83",
      "content": "A big-hearted French movie that shines with wit, beauty, humor, sunshine and the love of love."
    },
    {
      "publisher": "New York Post",
      "author": "Lou Lumenick",
      "link": "",
      "rate": "75",
      "content": "A slick, sweet, fast-paced, feel-good romantic fantasy that's fairly irresistible if you can keep your cynicism in check for a couple of hours."
    },
    {
      "publisher": "Village Voice",
      "author": "J. Hoberman",
      "link": "",
      "rate": "70",
      "content": "The screen is saturated with Gallic whimsy and the romance of Montmartre in the person of Amélie."
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "Maitland McDonagh",
      "link": "https://www.tvguide.com/?MI=43167",
      "rate": "60",
      "content": "The lanky, wide-eyed Tautou is so phenomenally charming -- her smile could sweeten vinegar -- as to make Amelie irresistible."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Ronnie Scheib",
      "link": "",
      "rate": "50",
      "content": "The ease with which the perky, big-eyed heroine ingeniously succeeds in improving the lot of everyone around her and the painterly manner in which reality in every inch of the frame is \"improved\" constitute both the \"quirky\" charm and the pure fishiness of the film."
    }
  ],
  "errorMessage": ""
}