{
  "imDbId": "tt0211915",
  "title": "Amélie",
  "fullTitle": "Amélie (2001)",
  "type": "Movie",
  "year": "2001",
  "language": "en",
  "titleInLanguage": "Amélie",
  "url": "https://en.wikipedia.org/wiki/Am%C3%A9lie",
  "plotShort": {
    "plainText": "Amélie (also known as Le Fabuleux Destin d'Amélie Poulain; French pronunciation: ​; English: The Fabulous Destiny of Amélie Poulain) is a 2001 French-language romantic comedy film directed by Jean-Pierre Jeunet. Written by Jeunet with Guillaume Laurant, the film is a whimsical depiction of contemporary Parisian life, set in Montmartre. It tells the story of a shy waitress, played by Audrey Tautou, who decides to change the lives of those around her for the better while dealing with her own isolation. The film features an ensemble cast of supporting roles, including Mathieu Kassovitz, Rufus, Lorella Cravotta, Serge Merlin, Jamel Debbouze, Claire Maurier, Clotilde Mollet, Isabelle Nanty, Dominique Pinon, Artus de Penguern, Yolande Moreau, Urbain Cancelier, and Maurice Bénichou.\r\nAmélie was theatrically released in France on 25 April 2001 by UGC-Fox Distribution and in Germany on 16 August 2001 by Prokino Filmverleih. The film received widespread critical acclaim, with major praise for Tautou's performance, the cinematography, production design, and writing. Amélie won Best Film at the European Film Awards, four César Awards, including Best Film and Best Director, and two British Academy Film Awards, including Best Original Screenplay. It was nominated for five Academy Awards, including Best Foreign Language Film and Best Original Screenplay. The film was a major commercial success, grossing $174.2 million worldwide against a budget of $10 million, and is one of the biggest international successes for a French film.",
    "html": "<p>Amélie (also known as Le Fabuleux Destin d'Amélie Poulain; French pronunciation: ​; English: The Fabulous Destiny of Amélie Poulain) is a 2001 French-language romantic comedy film directed by Jean-Pierre Jeunet. Written by Jeunet with Guillaume Laurant, the film is a whimsical depiction of contemporary Parisian life, set in Montmartre. It tells the story of a shy waitress, played by Audrey Tautou, who decides to change the lives of those around her for the better while dealing with her own isolation. The film features an ensemble cast of supporting roles, including Mathieu Kassovitz, Rufus, Lorella Cravotta, Serge Merlin, Jamel Debbouze, Claire Maurier, Clotilde Mollet, Isabelle Nanty, Dominique Pinon, Artus de Penguern, Yolande Moreau, Urbain Cancelier, and Maurice Bénichou.</p><p>Amélie was theatrically released in France on 25 April 2001 by UGC-Fox Distribution and in Germany on 16 August 2001 by Prokino Filmverleih. The film received widespread critical acclaim, with major praise for Tautou's performance, the cinematography, production design, and writing. Amélie won Best Film at the European Film Awards, four César Awards, including Best Film and Best Director, and two British Academy Film Awards, including Best Original Screenplay. It was nominated for five Academy Awards, including Best Foreign Language Film and Best Original Screenplay. The film was a major commercial success, grossing $174.2 million worldwide against a budget of $10 million, and is one of the biggest international successes for a French film.</p>"
  },
  "plotFull": {
    "plainText": "Amélie (also known as Le Fabuleux Destin d'Amélie Poulain; French pronunciation: ​; English: The Fabulous Destiny of Amélie Poulain) is a 2001 French-language romantic comedy film directed by Jean-Pierre Jeunet. Written by Jeunet with Guillaume Laurant, the film is a whimsical depiction of contemporary Parisian life, set in Montmartre. It tells the story of a shy waitress, played by Audrey Tautou, who decides to change the lives of those around her for the better while dealing with her own isolation. The film features an ensemble cast of supporting roles, including Mathieu Kassovitz, Rufus, Lorella Cravotta, Serge Merlin, Jamel Debbouze, Claire Maurier, Clotilde Mollet, Isabelle Nanty, Dominique Pinon, Artus de Penguern, Yolande Moreau, Urbain Cancelier, and Maurice Bénichou.\r\nAmélie was theatrically released in France on 25 April 2001 by UGC-Fox Distribution and in Germany on 16 August 2001 by Prokino Filmverleih. The film received widespread critical acclaim, with major praise for Tautou's performance, the cinematography, production design, and writing. Amélie won Best Film at the European Film Awards, four César Awards, including Best Film and Best Director, and two British Academy Film Awards, including Best Original Screenplay. It was nominated for five Academy Awards, including Best Foreign Language Film and Best Original Screenplay. The film was a major commercial success, grossing $174.2 million worldwide against a budget of $10 million, and is one of the biggest international successes for a French film.\r\nPlot\r\nAmélie Poulain is born in June 1974 and brought up by eccentric parents who – incorrectly believing that she has a heart defect – decide to home-school her. To cope with her loneliness, Amélie develops an active imagination and a mischievous personality. When Amélie is six, her mother, Amandine, is killed when a suicidal Canadian tourist jumps from the roof of Notre-Dame de Paris and lands on her. As a result, her father, Raphaël, withdraws more and more from society. Amélie leaves home at the age of 18 and becomes a waitress at the Café des 2 Moulins in Montmartre, which is staffed and frequented by a collection of eccentrics. She is single and lets her imagination roam freely, finding contentment in simple pleasures like dipping her hand into grain sacks, cracking crème brûlée with a spoon, and skipping stones along the Canal Saint-Martin.\r\nOn 31 August 1997, startled by the news of the death of Diana, Princess of Wales, Amélie drops a plastic perfume-stopper, which dislodges a wall tile and accidentally reveals an old metal box which contains childhood memorabilia hidden by a boy who lived in her apartment decades earlier. Amélie resolves to track down the boy and return the box to him. She promises herself that if it makes him happy, she will devote her life to bringing happiness to others.\r\nAfter asking the apartment's concierge and several old tenants about the boy's identity, Amélie meets her reclusive neighbour, Raymond Dufayel, an artist with brittle bone disease who replicates Pierre-Auguste Renoir's 1881 painting Luncheon of the Boating Party every year. He recalls the boy's name as \"Bretodeau\". Amélie finds the man, Dominique Bretodeau, and surreptitiously gives him the box. Moved to tears by the discovery and the memories it holds, Bretodeau resolves to reconcile with his estranged daughter and the grandson he has never met. Amélie happily embarks on her new mission.\r\nAmélie secretly executes complex schemes that positively affect the lives of those around her. She escorts a blind man to the Métro station while giving him a rich description of the street scenes he passes. She persuades her father to follow his dream of touring the world by stealing his garden gnome and having a flight attendant friend mail pictures of it posing with landmarks from all over the world. She starts a romance between her hypochondriacal co-worker Georgette and Joseph, a patron of the cafe. She convinces Madeleine Wallace, the concierge of her block of flats, that the husband who abandoned her had sent her a final conciliatory love letter just before his accidental death years before. She plays practical jokes on Collignon, the nasty greengrocer. Mentally exhausted, Collignon no longer abuses his meek, good-natured assistant Lucien. A delighted Lucien subsequently takes charge at the grocery stand.\r\nMr. Dufayel, having observed Amélie, begins a conversation with her about his painting. Although he has copied the same Renoir painting 20 times, he has never quite captured the look of the girl drinking a glass of water. They discuss the meaning of this character, and over several conversations, Amélie begins projecting her loneliness onto the image. Dufayel recognizes this and uses the girl in the painting to push Amélie to examine her attraction to a quirky young man, Nino Quincampoix, who collects the discarded photographs of strangers from passport photo booths. When Amélie bumps into Nino a second time, she realizes she is falling in love with him. He accidentally drops a photo album in the street. Amélie retrieves it.\r\nAmélie plays a cat-and-mouse game with Nino around Paris before returning his treasured album anonymously. After arranging a meeting at the 2 Moulins, Amélie panics and tries to deny her identity. Her co-worker, Gina, concerned for Amélie's well-being, screens Nino for her; Joseph's comment about this misleads Amélie to believe she has lost Nino to Gina. It takes Dufayel's insight to give her the courage to pursue Nino, resulting in a romantic night together and the beginning of a relationship. The film ends as Amélie experiences a moment of happiness she has found for herself.\r\nCast\r\nAudrey Tautou as Amélie Poulain Flora Guiet as young Amélie\r\nFlora Guiet as young Amélie\r\nMathieu Kassovitz as Nino Quincampoix Amaury Babault as young Nino\r\nAmaury Babault as young Nino\r\nAndré Dussollier as The Narrator\r\nRufus as Raphaël Poulain, Amélie's father\r\nSerge Merlin as Raymond Dufayel, \"The Glass Man\"\r\nLorella Cravotta as Amandine Poulain, Amélie's mother\r\nClotilde Mollet as Gina, a fellow waitress\r\nClaire Maurier as Suzanne, the owner of Café des Deux Moulins\r\nIsabelle Nanty as Georgette, the resident hypochondriac\r\nDominique Pinon as Joseph\r\nArtus de Penguern as Hipolito, the writer\r\nYolande Moreau as Madeleine Wallace (Wells, in English subtitled version)\r\nUrbain Cancelier as Collignon, the grocer\r\nJamel Debbouze as Lucien, the grocer's assistant\r\nMaurice Bénichou as Dominique Bretodeau Kevin Fernandes as young Dominique\r\nKevin Fernandes as young Dominique\r\nMichel Robin as Mr. Collignon\r\nAndrée Damant as Mrs. Collignon\r\nClaude Perron as Eva, Nino's colleague\r\nArmelle as Philomène, air hostess\r\nTicky Holgado as Man in a photo\r\nFabienne Chaudat as The woman in a coma\r\nProduction\r\nIn his DVD commentary, Jeunet explains that he originally wrote the role of Amélie for the English actress Emily Watson. In that first draft, Amélie's father was an Englishman living in London. However, Watson's French was not strong, and when she became unavailable to shoot the film, owing to a conflict with the filming of Gosford Park (2001), Jeunet rewrote the screenplay for a French actress. Audrey Tautou was the first actress he auditioned having seen her on the poster for the 1999 film Venus Beauty Institute.\r\nFilming took place mainly in Paris. The Café des 2 Moulins (15 Rue Lepic, Montmartre, Paris) where Amélie works is a real place.\r\nThe filmmakers made use of computer-generated imagery (including computer animation), and a digital intermediate. The studio scenes were filmed in the MMC Studios Coloneum in Cologne (Germany). The film shares many of the themes in its plot with the second half of the 1994 film Chungking Express.\r\nRelease\r\nThe film was released in France, Belgium, and French-speaking western Switzerland in April 2001, with subsequent screenings at various film festivals followed by releases around the world. It received limited releases in North America, the United Kingdom, and Australasia later in 2001.\r\nCannes Film Festival selector Gilles Jacob described Amélie as \"uninteresting\", and therefore it was not screened at the festival, although the version he viewed was an early cut without music. The absence of Amélie at the festival caused something of a controversy because of the warm welcome by the French media and audience in contrast with the reaction of the selector. David Martin-Jones, in an article in Senses of Cinema, stated that the film \" its national identity on its sleeve\" and that this attracted both audiences of mainstream movies and those of arthouse ones.\r\nReception\r\nCritical response\r\nOn Rotten Tomatoes, the film has an 89% approval rating based on 186 reviews, with an average rating of 8.10/10. The website's critical consensus reads, \"The feel-good Amélie is a lively, fanciful charmer, showcasing Audrey Tautou as its delightful heroine.\" On Metacritic, the film has a score of 69 out of 100 based on 31 critics, indicating \"generally positive reviews\".\r\nAlan Morrison from Empire Online gave Amélie five stars and called it \"one of the year's best, with crossover potential along the lines of Cyrano de Bergerac (1990) and Il Postino (1994). Given its quirky heart, it might well surpass them all\". Paul Tatara of CNN praised Amélie's playful nature. In his review, he wrote, \"Its whimsical, free-ranging nature is often enchanting; the first hour, in particular, is brimming with amiable, sardonic laughs\".\r\nThe film was attacked by critic Serge Kaganski of Les Inrockuptibles for an unrealistic and picturesque vision of a bygone French society with few ethnic minorities. Jeunet dismissed the criticism by pointing out that the photo collection contains pictures of people from numerous ethnic backgrounds, and that Jamel Debbouze, who plays Lucien, is of Moroccan descent.\r\nBox office\r\nThe film opened on 432 screens in France and grossed 43.2 million French Franc ($6.2 million) in its opening week, placing it at number one. It stayed in the top 10 for 22 weeks. It was the highest-grossing film in France for the year with a gross of $41 million.\r\nAccolades\r\nAmélie was selected by The New York Times as one of \"The Best 1,000 Movies Ever Made\". The film placed No. 2 in Empire magazine's \"The 100 Best Films of World Cinema\". Paste magazine ranked it second on its list of the 50 Best Movies of the Decade (2000–2009). In August 2016, BBC Magazine conducted a poll on the 21st century's 100 greatest films so far, with Amélie ranking at number 87.\r\nEntertainment Weekly named the film poster one of the best on its list of the top 25 film posters in the past 25 years. It also named Amélie setting up a wild goose chase for her beloved Nino all through Paris as No. 9 on its list of top 25 Romantic Gestures. In 2010, an online public poll by the American Cinematographer – the house journal of the American Society of Cinematographers – named Amélie the best shot film of the decade.\r\nAmelie is rated 37 among the 50 Greatest Romantic Comedies of All Time by Rolling Stone magazine.\r\nSoundtrack\r\nThe soundtrack to Amélie was composed by Yann Tiersen.\r\nMusical adaptation\r\nOn 23 August 2013, composer Dan Messe, one of the founders and members of the band Hem, confirmed speculation that he would be writing the score for a musical adaptation of Amélie, collaborating with Craig Lucas and Nathan Tysen. Messe also confirmed he would be composing all original music for the show and not using the Yann Tiersen score. The musical adaptation premiered at the Berkeley Repertory Theater in August 2015. It opened on Broadway in March 2017 and closed in May 2017. The production started its pre-Broadway engagement at the Ahmanson Theatre in Los Angeles in December 2016, with Phillipa Soo in the title role. A London production opened in 2020, with Australian, German, Dutch, and Finnish productions set to open or resume pending the cessation of restrictions due to the COVID-19 pandemic.\r\nJeunet has distanced himself from the musical due to his distaste for the artform, saying he only sold the rights to raise funds for children's charity \"Mécénat Chirurgie Cardiaque\".\r\nHome media\r\nThe film has no overall worldwide distributor, but Blu-ray Discs have been released in Canada and Australia. The first release occurred in Canada in September 2008 by TVA Films. This version did not contain any English subtitles and received criticisms regarding picture quality. In November 2009, an Australian release occurred. This time the version contained English subtitles and features no region coding. Momentum Pictures released a Blu-ray in the UK on 17 October 2011. The film is also available in HD on iTunes and other digital download services.\r\nIn the United Kingdom, it was 2013's tenth best-selling foreign-language film on physical home video formats, and the year's third best-selling French film (below The Intouchables and Rust and Bone).\r\nInterpretation\r\nFilm interpretation commonly revolves around the color palette being red and green heavy.\r\nLegacy\r\nFor the 2007 television show Pushing Daisies, a \"quirky fairy tale\", American Broadcasting Company (ABC) sought an Amélie feel, with the same chords of \"whimsy and spirit and magic\". Pushing Daisies creator Bryan Fuller said Amélie is his favorite film. \"All the things I love are represented in that movie\", he said. \"It's a movie that will make me cry based on kindness as opposed to sadness\". The New York Times' review of Pushing Daisies reported \"the Amélie influence on Pushing Daisies is everywhere\".\r\nA species of frog was named Cochranella amelie. The scientist who named it said: \"This new species of glass frog is for Amélie, protagonist of the extraordinary movie Le Fabuleux Destin d'Amélie Poulain; a film where little details play an important role in the achievement of joie de vivre; like the important role that glass frogs and all amphibians and reptiles play in the health of our planet\". The species was described in the scientific journal Zootaxa in an article entitled \"An enigmatic new species of Glassfrog (Amphibia: Anura: Centrolenidae) from the Amazonian Andean slopes of Ecuador\".",
    "html": "<p>Amélie (also known as Le Fabuleux Destin d'Amélie Poulain; French pronunciation: ​; English: The Fabulous Destiny of Amélie Poulain) is a 2001 French-language romantic comedy film directed by Jean-Pierre Jeunet. Written by Jeunet with Guillaume Laurant, the film is a whimsical depiction of contemporary Parisian life, set in Montmartre. It tells the story of a shy waitress, played by Audrey Tautou, who decides to change the lives of those around her for the better while dealing with her own isolation. The film features an ensemble cast of supporting roles, including Mathieu Kassovitz, Rufus, Lorella Cravotta, Serge Merlin, Jamel Debbouze, Claire Maurier, Clotilde Mollet, Isabelle Nanty, Dominique Pinon, Artus de Penguern, Yolande Moreau, Urbain Cancelier, and Maurice Bénichou.</p><p>Amélie was theatrically released in France on 25 April 2001 by UGC-Fox Distribution and in Germany on 16 August 2001 by Prokino Filmverleih. The film received widespread critical acclaim, with major praise for Tautou's performance, the cinematography, production design, and writing. Amélie won Best Film at the European Film Awards, four César Awards, including Best Film and Best Director, and two British Academy Film Awards, including Best Original Screenplay. It was nominated for five Academy Awards, including Best Foreign Language Film and Best Original Screenplay. The film was a major commercial success, grossing $174.2 million worldwide against a budget of $10 million, and is one of the biggest international successes for a French film.</p><br/><h3>Plot</h3><p>Amélie Poulain is born in June 1974 and brought up by eccentric parents who – incorrectly believing that she has a heart defect – decide to home-school her. To cope with her loneliness, Amélie develops an active imagination and a mischievous personality. When Amélie is six, her mother, Amandine, is killed when a suicidal Canadian tourist jumps from the roof of Notre-Dame de Paris and lands on her. As a result, her father, Raphaël, withdraws more and more from society. Amélie leaves home at the age of 18 and becomes a waitress at the Café des 2 Moulins in Montmartre, which is staffed and frequented by a collection of eccentrics. She is single and lets her imagination roam freely, finding contentment in simple pleasures like dipping her hand into grain sacks, cracking crème brûlée with a spoon, and skipping stones along the Canal Saint-Martin.</p><p>On 31 August 1997, startled by the news of the death of Diana, Princess of Wales, Amélie drops a plastic perfume-stopper, which dislodges a wall tile and accidentally reveals an old metal box which contains childhood memorabilia hidden by a boy who lived in her apartment decades earlier. Amélie resolves to track down the boy and return the box to him. She promises herself that if it makes him happy, she will devote her life to bringing happiness to others.</p><p>After asking the apartment's concierge and several old tenants about the boy's identity, Amélie meets her reclusive neighbour, Raymond Dufayel, an artist with brittle bone disease who replicates Pierre-Auguste Renoir's 1881 painting Luncheon of the Boating Party every year. He recalls the boy's name as \"Bretodeau\". Amélie finds the man, Dominique Bretodeau, and surreptitiously gives him the box. Moved to tears by the discovery and the memories it holds, Bretodeau resolves to reconcile with his estranged daughter and the grandson he has never met. Amélie happily embarks on her new mission.</p><p>Amélie secretly executes complex schemes that positively affect the lives of those around her. She escorts a blind man to the Métro station while giving him a rich description of the street scenes he passes. She persuades her father to follow his dream of touring the world by stealing his garden gnome and having a flight attendant friend mail pictures of it posing with landmarks from all over the world. She starts a romance between her hypochondriacal co-worker Georgette and Joseph, a patron of the cafe. She convinces Madeleine Wallace, the concierge of her block of flats, that the husband who abandoned her had sent her a final conciliatory love letter just before his accidental death years before. She plays practical jokes on Collignon, the nasty greengrocer. Mentally exhausted, Collignon no longer abuses his meek, good-natured assistant Lucien. A delighted Lucien subsequently takes charge at the grocery stand.</p><p>Mr. Dufayel, having observed Amélie, begins a conversation with her about his painting. Although he has copied the same Renoir painting 20 times, he has never quite captured the look of the girl drinking a glass of water. They discuss the meaning of this character, and over several conversations, Amélie begins projecting her loneliness onto the image. Dufayel recognizes this and uses the girl in the painting to push Amélie to examine her attraction to a quirky young man, Nino Quincampoix, who collects the discarded photographs of strangers from passport photo booths. When Amélie bumps into Nino a second time, she realizes she is falling in love with him. He accidentally drops a photo album in the street. Amélie retrieves it.</p><p>Amélie plays a cat-and-mouse game with Nino around Paris before returning his treasured album anonymously. After arranging a meeting at the 2 Moulins, Amélie panics and tries to deny her identity. Her co-worker, Gina, concerned for Amélie's well-being, screens Nino for her; Joseph's comment about this misleads Amélie to believe she has lost Nino to Gina. It takes Dufayel's insight to give her the courage to pursue Nino, resulting in a romantic night together and the beginning of a relationship. The film ends as Amélie experiences a moment of happiness she has found for herself.</p><br/><h3>Cast</h3><ul><li>Audrey Tautou as Amélie Poulain Flora Guiet as young Amélie</li><li>Flora Guiet as young Amélie</li><li>Mathieu Kassovitz as Nino Quincampoix Amaury Babault as young Nino</li><li>Amaury Babault as young Nino</li><li>André Dussollier as The Narrator</li><li>Rufus as Raphaël Poulain, Amélie's father</li><li>Serge Merlin as Raymond Dufayel, \"The Glass Man\"</li><li>Lorella Cravotta as Amandine Poulain, Amélie's mother</li><li>Clotilde Mollet as Gina, a fellow waitress</li><li>Claire Maurier as Suzanne, the owner of Café des Deux Moulins</li><li>Isabelle Nanty as Georgette, the resident hypochondriac</li><li>Dominique Pinon as Joseph</li><li>Artus de Penguern as Hipolito, the writer</li><li>Yolande Moreau as Madeleine Wallace (Wells, in English subtitled version)</li><li>Urbain Cancelier as Collignon, the grocer</li><li>Jamel Debbouze as Lucien, the grocer's assistant</li><li>Maurice Bénichou as Dominique Bretodeau Kevin Fernandes as young Dominique</li><li>Kevin Fernandes as young Dominique</li><li>Michel Robin as Mr. Collignon</li><li>Andrée Damant as Mrs. Collignon</li><li>Claude Perron as Eva, Nino's colleague</li><li>Armelle as Philomène, air hostess</li><li>Ticky Holgado as Man in a photo</li><li>Fabienne Chaudat as The woman in a coma</li></ul><br/><h3>Production</h3><p>In his DVD commentary, Jeunet explains that he originally wrote the role of Amélie for the English actress Emily Watson. In that first draft, Amélie's father was an Englishman living in London. However, Watson's French was not strong, and when she became unavailable to shoot the film, owing to a conflict with the filming of Gosford Park (2001), Jeunet rewrote the screenplay for a French actress. Audrey Tautou was the first actress he auditioned having seen her on the poster for the 1999 film Venus Beauty Institute.</p><p>Filming took place mainly in Paris. The Café des 2 Moulins (15 Rue Lepic, Montmartre, Paris) where Amélie works is a real place.</p><p>The filmmakers made use of computer-generated imagery (including computer animation), and a digital intermediate. The studio scenes were filmed in the MMC Studios Coloneum in Cologne (Germany). The film shares many of the themes in its plot with the second half of the 1994 film Chungking Express.</p><br/><h3>Release</h3><p>The film was released in France, Belgium, and French-speaking western Switzerland in April 2001, with subsequent screenings at various film festivals followed by releases around the world. It received limited releases in North America, the United Kingdom, and Australasia later in 2001.</p><p>Cannes Film Festival selector Gilles Jacob described Amélie as \"uninteresting\", and therefore it was not screened at the festival, although the version he viewed was an early cut without music. The absence of Amélie at the festival caused something of a controversy because of the warm welcome by the French media and audience in contrast with the reaction of the selector. David Martin-Jones, in an article in Senses of Cinema, stated that the film \" its national identity on its sleeve\" and that this attracted both audiences of mainstream movies and those of arthouse ones.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>On Rotten Tomatoes, the film has an 89% approval rating based on 186 reviews, with an average rating of 8.10/10. The website's critical consensus reads, \"The feel-good Amélie is a lively, fanciful charmer, showcasing Audrey Tautou as its delightful heroine.\" On Metacritic, the film has a score of 69 out of 100 based on 31 critics, indicating \"generally positive reviews\".</p><p>Alan Morrison from Empire Online gave Amélie five stars and called it \"one of the year's best, with crossover potential along the lines of Cyrano de Bergerac (1990) and Il Postino (1994). Given its quirky heart, it might well surpass them all\". Paul Tatara of CNN praised Amélie's playful nature. In his review, he wrote, \"Its whimsical, free-ranging nature is often enchanting; the first hour, in particular, is brimming with amiable, sardonic laughs\".</p><p>The film was attacked by critic Serge Kaganski of Les Inrockuptibles for an unrealistic and picturesque vision of a bygone French society with few ethnic minorities. Jeunet dismissed the criticism by pointing out that the photo collection contains pictures of people from numerous ethnic backgrounds, and that Jamel Debbouze, who plays Lucien, is of Moroccan descent.</p><h4>Box office</h4><p>The film opened on 432 screens in France and grossed 43.2 million French Franc ($6.2 million) in its opening week, placing it at number one. It stayed in the top 10 for 22 weeks. It was the highest-grossing film in France for the year with a gross of $41 million.</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Award</th><th scope=\"col\">Category</th><th scope=\"col\">Recipient</th><th scope=\"col\">Result</th></tr><tr><th scope=\"row\" rowspan=\"5\"><span>Academy Awards</span></th><td><span class=\"mw-redirect\">Best Foreign Language Film</span></td><td><span>France</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Screenplay</span></td><td>Guillaume Laurant and <span>Jean-Pierre Jeunet</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Art Direction</span></td><td><span>Aline Bonetto</span> and <span>Marie-Laure Valla</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Bruno Delbonnel</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound</span></td><td><span>Vincent Arnardi</span>, <span>Guillaume Leriche</span>, <span>Jean Umansky</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"row\" rowspan=\"9\"><span>British Academy Film Awards</span></th><td><span>Best Film</span></td><td><i>Amélie</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Direction</span></td><td>Jean-Pierre Jeunet</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress in a Leading Role</span></td><td><span>Audrey Tautou</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Screenplay</span></td><td>Guillaume Laurant and Jean-Pierre Jeunet</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Cinematography</span></td><td>Bruno Delbonnel</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Production Design</span></td><td>Aline Bonetto</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Editing</span></td><td><span>Hervé Schneid</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Film Music</span></td><td><span>Yann Tiersen</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Not in the English Language</span></td><td rowspan=\"2\"><i>Amélie</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"row\" rowspan=\"12\"><span class=\"mw-redirect\">César Awards</span></th><td><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Jean-Pierre Jeunet</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actress</span></td><td>Audrey Tautou</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Best Supporting Actor</span></td><td><span>Jamel Debbouze</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Rufus</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actress</span></td><td><span>Isabelle Nanty</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Writing</span></td><td>Guillaume Laurant and Jean-Pierre Jeunet</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td>Bruno Delbonnel</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Production Design</span></td><td>Aline Bonetto</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Costume Design</span></td><td>Madeline Fontaine</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Editing</span></td><td>Hervé Schneid</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Music</span></td><td>Yann Tiersen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\" rowspan=\"4\"><span>European Film Awards</span></th><td><span>Best Film</span></td><td rowspan=\"2\">Jean-Pierre Jeunet</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actress</span></td><td>Audrey Tautou</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td>Bruno Delbonnel</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\"><span>French Syndicate of Cinema Critics</span></th><td>Best French Film</td><td rowspan=\"2\"><i>Amélie</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\"><span>Golden Eagle Award</span></th><td><span class=\"mw-redirect\">Best Foreign Language Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\"><span class=\"mw-redirect\">Golden Globe Awards</span></th><td><span>Best Foreign Language Film</span></td><td rowspan=\"2\">Jean-Pierre Jeunet</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"row\"><span>Karlovy Vary International Film Festival</span></th><td><span>Crystal Globe</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\"><span>Toronto International Film Festival</span></th><td><span>People's Choice Award</span></td><td><i>Amélie</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><p>Amélie was selected by The New York Times as one of \"The Best 1,000 Movies Ever Made\". The film placed No. 2 in Empire magazine's \"The 100 Best Films of World Cinema\". Paste magazine ranked it second on its list of the 50 Best Movies of the Decade (2000–2009). In August 2016, BBC Magazine conducted a poll on the 21st century's 100 greatest films so far, with Amélie ranking at number 87.</p><p>Entertainment Weekly named the film poster one of the best on its list of the top 25 film posters in the past 25 years. It also named Amélie setting up a wild goose chase for her beloved Nino all through Paris as No. 9 on its list of top 25 Romantic Gestures. In 2010, an online public poll by the American Cinematographer – the house journal of the American Society of Cinematographers – named Amélie the best shot film of the decade.</p><p>Amelie is rated 37 among the 50 Greatest Romantic Comedies of All Time by Rolling Stone magazine.</p><br/><h3>Soundtrack</h3><p>The soundtrack to Amélie was composed by Yann Tiersen.</p><br/><h3>Musical adaptation</h3><p>On 23 August 2013, composer Dan Messe, one of the founders and members of the band Hem, confirmed speculation that he would be writing the score for a musical adaptation of Amélie, collaborating with Craig Lucas and Nathan Tysen. Messe also confirmed he would be composing all original music for the show and not using the Yann Tiersen score. The musical adaptation premiered at the Berkeley Repertory Theater in August 2015. It opened on Broadway in March 2017 and closed in May 2017. The production started its pre-Broadway engagement at the Ahmanson Theatre in Los Angeles in December 2016, with Phillipa Soo in the title role. A London production opened in 2020, with Australian, German, Dutch, and Finnish productions set to open or resume pending the cessation of restrictions due to the COVID-19 pandemic.</p><p>Jeunet has distanced himself from the musical due to his distaste for the artform, saying he only sold the rights to raise funds for children's charity \"Mécénat Chirurgie Cardiaque\".</p><br/><h3>Home media</h3><p>The film has no overall worldwide distributor, but Blu-ray Discs have been released in Canada and Australia. The first release occurred in Canada in September 2008 by TVA Films. This version did not contain any English subtitles and received criticisms regarding picture quality. In November 2009, an Australian release occurred. This time the version contained English subtitles and features no region coding. Momentum Pictures released a Blu-ray in the UK on 17 October 2011. The film is also available in HD on iTunes and other digital download services.</p><p>In the United Kingdom, it was 2013's tenth best-selling foreign-language film on physical home video formats, and the year's third best-selling French film (below The Intouchables and Rust and Bone).</p><br/><h3>Interpretation</h3><p>Film interpretation commonly revolves around the color palette being red and green heavy.</p><br/><h3>Legacy</h3><p>For the 2007 television show Pushing Daisies, a \"quirky fairy tale\", American Broadcasting Company (ABC) sought an Amélie feel, with the same chords of \"whimsy and spirit and magic\". Pushing Daisies creator Bryan Fuller said Amélie is his favorite film. \"All the things I love are represented in that movie\", he said. \"It's a movie that will make me cry based on kindness as opposed to sadness\". The New York Times' review of Pushing Daisies reported \"the Amélie influence on Pushing Daisies is everywhere\".</p><p>A species of frog was named Cochranella amelie. The scientist who named it said: \"This new species of glass frog is for Amélie, protagonist of the extraordinary movie Le Fabuleux Destin d'Amélie Poulain; a film where little details play an important role in the achievement of joie de vivre; like the important role that glass frogs and all amphibians and reptiles play in the health of our planet\". The species was described in the scientific journal Zootaxa in an article entitled \"An enigmatic new species of Glassfrog (Amphibia: Anura: Centrolenidae) from the Amazonian Andean slopes of Ecuador\".</p><br/>"
  },
  "errorMessage": ""
}