{
  "imDbId": "tt0052357",
  "title": "Vertigo",
  "fullTitle": "Vertigo (1958)",
  "type": "Movie",
  "year": "1958",
  "items": [
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0066252",
      "warningSpoilers": false,
      "date": "19 June 2001",
      "rate": "",
      "helpful": "301 out of 386 found this helpful.",
      "title": "Distinctive & Unforgettable Masterpiece",
      "content": "One of the many things that made Hitchcock such a great director is that he did not just stick to the same formula time after time; all of his best movies have their own unique feel and characteristics. \"Vertigo\" is particularly distinctive, both as a complex story filled with suspense, and as a fascinating study in psychological tension. While it lacks the humor of some of Hitchcock's other masterpieces, and sometimes moves rather slowly, it is unforgettable, and a great achievement by the director and his cast.If you have never seen it, you will enjoy it more if you do not know too much about the plot, although the actual story is somewhat secondary to the ways that the characters are tested and their weaknesses exposed by the various events. Hitchcock uses a complicated story, interesting characters, lavish visual detail, and deliberate pacing, plus a fine musical score by the incomparable Bernard Hermann, to produce a mysterious, almost unearthly, atmosphere. The tension rarely lets up, and the viewer is caught up completely in it, at times almost to the point of discomfort. It's the kind of film that repays careful attention, as almost every moment is filled with significant detail.There are also some great acting performances. Jimmy Stewart is outstanding in a role far different from his usual screen persona. He enables the viewer to sympathize completely with him, even as we cringe at many of his character's actions and decisions. Kim Novak is completely convincing in a difficult dual role, and the movie would not have been as compelling without her fine performance. The rest of the cast all have much smaller roles, but are all quite good too, especially Barbara Bel Geddes as Scottie's (Stewart's) old friend, who provides important insight into Scottie's character.\"Vertigo\" is a classic by any standard. It's a must-see that remains just as impressive with each viewing."
    },
    {
      "username": "slabihoud",
      "userUrl": "https://www.imdb.com/user/ur3748972",
      "reviewLink": "https://www.imdb.com/review/rw1007137",
      "warningSpoilers": true,
      "date": "26 January 2005",
      "rate": "10",
      "helpful": "165 out of 187 found this helpful.",
      "title": "Let there be color!",
      "content": "Since there are already so many real good comments on this film I want to focus on only one aspect.Vertigo is a great example for what color films really can look like! Not only do I want to praise the quality of the Technicolor dye transfer prints but also more the way Hitchcock used color to create moods. Many directors used light to create moods in black and white movies but only very few ever got so far as to use the much greater palette of colors for the same purpose. One wonders why. Some directors decide for an overall color look, which is often done in the lab, but not on the set.Vertigo is full of scenes where the colors have been saturated or changed to create a special feeling. Hitchcock even went so far as to openly dye some frames is bright unnatural colors. He played around with colors in all his color films but never as much as in this one. Think for example on James Stewart's nightmare in the middle of the film. There are frames dyed purple and green; the cemetery scenes are red, inserted to the rhythm of the music with normal frames. Kim Novak is often bathed in colored light like in the famous hotel room scene, where she appears like a ghost with all the green light around her.The shading is also important. In the scene in the bookshop we hear a dark and sad story while at the same time the light dimes down to simulate dusk. In the scene where Judy remembers the real events in the bell tower it starts with an outdoor scene, which we have already seen but it is now much darker than the first time. In the sequence where Stewart follows Novak to the cemetery everything feels unnatural since every scene glows through the use of a filter that creates a blur.The non-color of Kim Novak's dress as Madeleine is also a very important aspect in the film. She has to color her hair to become Madeleine again at the end of the picture.The way color is used in this film gives it this dreamlike quality that allows endless interpretations. A true masterpiece!"
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw2098519",
      "warningSpoilers": false,
      "date": "19 July 2009",
      "rate": "10",
      "helpful": "92 out of 125 found this helpful.",
      "title": "You're not lost. Mother's here.",
      "content": "John \"Scottie\" Ferguson is a San Francisco cop who decides to quit the service after his acrophobia results in him being unable to save the life of a colleague. Whilst taking it easy he gets a call from an old school friend, Gavin Elster, asking him if he wouldn't mind doing a little bit of detective work for him. The job is simply to tail his wife because she's obsessed with an ancestress who committed suicide, and the wife, Madeline, is showing signs of herself being suicidal. Ferguson tails her diligently and as the tail progresses, Ferguson himself starts to become ever obsessed about the demur blonde Madeline. As the story twists and turns, Ferguson's obsession will have far reaching consequences for both parties... Vertigo is Alfred Hitchcock's most discussed, dissected and critically reappraised film, based on a novel by Pierre Boileau called D'Entre Les Morts, (also writer of Diabolique), Vertigo was not well liked on its release and unable to be viewed for some time due to copyright, the film was restored from a destroyed negative into a glorious 70mm print, and now in all its glory it can be seen as one of the greatest films to have ever been made. What is most striking about Vertigo, outside of Hitchcock baring his innermost that is, is that its plot on the surface is simplicity personified, but delving deeper, and repeat viewings are a necessity, its apparent that Vertigo is a chilling force of cinema, taking great delight in gnawing away at your perceptions, perhaps even your own capabilities as a human being. Very much a film of two great halves, Vertigo first seems intent on being an almost ghost story like mystery. Once the prologue has introduced us to Ferguson's fear of heights, we then enter an almost dream like sequence of events as Ferguson tails the troubled Madeline, the suggestion of reincarnation bleakly leading to death hangs heavy as Hitchcock pulls his atmospheric strings. Then the film shifts into dark territory as obsessions and nods to Dante's Inferno and feverish dreams take control, Hitchcock, as we have come to learn over the years, lays out his soul for us the audience to partake in, the uneasy traits sitting side by side with fascination of the story. All of which is leading us to a spine tingling finale that is as hauntingly memorable as it is shocking, the end to our own dizzying journey that Alfred and his team have taken us on. Technically the film is magnificent, the opening credits from Saul Bass brilliantly prep us for what is about to unfold, while Bernard Herrmann's score is as good as anything he ever did, unnerving one minute, swirlingly romantic the next, a truly incredible score. Hitchcock himself is firing from the top draw, introducing us to the brilliant zoom-forward-track-back camera technique to induce the feeling of Vertigo itself, with that merely a component of two hours of gorgeous texture lined with disturbing little peccadilloes. The two leads are arguably doing their respective career best work, James Stewart as Scottie Ferguson goes real deep to play it out with an edgy believability that decries his aw-shucks trademark of years since past. Kim Novak as Madeline is perhaps the quintessential Hitchcock blonde, perfect with the duality aspects of the role and playing off Stewart's ever creepy descent with seamlessly adroit skill. It however should be noted that Hitchcock and his loyal subjects had to work hard to get Novak right for the role, but the result proves that Novak had ability that sadly wasn't harnessed on too many other occasions. Vertigo is a film that I myself wasn't too taken with on my first viewing, it's only during revisits that the piece has come to grab me by the soul and refuse to let go, it not only holds up on revisits, it also gets better with each subsequent viewing, it is simply a film that demands to be seen as many times as possible. Not only one of the greatest American films ever made, one of the greatest films ever made...period, so invest your soul in it, just the way that Hitchcock himself so clearly did. 10/10"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2667180",
      "warningSpoilers": false,
      "date": "31 August 2012",
      "rate": "9",
      "helpful": "33 out of 43 found this helpful.",
      "title": "Creepy and engaging.",
      "content": "It's rather strange that this film was a box office flop, as it's one of Alfred Hitchcock's better movies. The only problem with \"Vertigo\" is that in order to really enjoy it, you need to turn off your brain and just accept the movie. If you think the plot out TOO MUCH, you'll find yourself asking too many questions and not just enjoying the film...like my oldest daughter did.The film is the story of a somewhat creepy ex-cop (James Stewart). When the film begins, he's emotionally scarred in an accident-an accident that leaves him with a HUGE case of psychologically-based vertigo. He decides to quit the job and is soon approached by an old friend--who wants to hire him to follow his emotionally disturbed wife. What happens next is very weird--and later becomes really creepy. I could say A LOT more but think it's best you just see the film--it has quite a few twists and turns that are bound to catch you by surprise.Overall, a wonderfully original film. The only deficit, for some, is that although Stewart was a wonderful actor, he was too old for this role. Still, I could look past this and enjoyed it immensely."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1230128",
      "warningSpoilers": true,
      "date": "3 December 2005",
      "rate": "9",
      "helpful": "124 out of 181 found this helpful.",
      "title": "Detective Obsessed",
      "content": "Although it got at best mixed reviews when first released, Vertigo is now considered one of Alfred Hitchcock's classic films. A tribute to the players, the director, and the composer of that haunting musical score that will stay with you forever.The music is probably more important here than in most films, let alone most Hitchcock films. Because for most of the first half of the film and a great deal of the second half, it is without dialogue. In fact Kim Novak does not have a spoken line until about 48 minutes into the little more than 2 hour feature. She's under James Stewart's surveillance and the whole story of his growing obsession with her is told through his facial expressions and through Bernard Herrmann's music.Stewart is a cop retired on disability who is hired by an old college friend Tom Helmore to follow his wife. Helmore tells Stewart a tale about his wife falling under the spirit of her dead great grandmother who committed suicide. The wife he's following is played by Kim Novak. Novak in fact makes a suicide attempt and by jumping into San Francisco bay and Stewart jumps in and saves her.In a brief prologue the reason for Stewart's disability is told. While on the police force, he lost a man while pursuing the suspect in a rooftop chase. Another cop was killed trying to save Stewart who had slipped and was hanging on to a roof gutter for his dear life. After that Stewart acquired an understandable fear of heights with accompanying dizziness, vertigo.Later on at an old mission which has significance for Novak's family, Novak runs up to the top of the bell tower and Stewart because of his Vertigo can't pursue her to prevent her from jumping off and taking her life.Later on he spots Kim Novak again with a different color hair and this time essentially stalks her until they meet. By now he's totally obsessed with the dead Novak who he fell in love with.Alfred Hitchcock is plumbing some depths of the human psyche in Vertigo. Certainly good old all American Jimmy Stewart would not be one you would think of casting as a voyeur and a stalker. But he pulls off the performance in probably the film with the least dialogue Alfred Hitchcock ever made since sound came in.Kim Novak is hauntingly beautiful in Vertigo, she has to be or the whole plot would make no sense. Barbara Bel Geddes is in this also as Stewart's girl friend who finds herself losing him to an obsession with a ghost. She also serves as a sounding board for Stewart as he expresses some of his feelings to her.This was the first of two films Stewart and Novak made together. Ironically enough the second one, Bell Book and Candle, is about a witch played by Novak who actually uses witchcraft to ensnare Stewart. Given Stewart's obsession with Novak in Vertigo, if Hitchcock had thrown in witchcraft into the plot, the audience would certainly have believed it.Of course this is an Alfred Hitchcock film and therefore not all is as it seems. I can't sat any more, but there are no happy endings for anyone in this haunting film."
    },
    {
      "username": "lastliberal",
      "userUrl": "https://www.imdb.com/user/ur2171244",
      "reviewLink": "https://www.imdb.com/review/rw1815591",
      "warningSpoilers": false,
      "date": "7 February 2008",
      "rate": "9",
      "helpful": "21 out of 27 found this helpful.",
      "title": "One final thing I have to do... and then I'll be free of the past.",
      "content": "Oscar ignored this fantastic film by Hitchcock starring James Stewart. It gave nomination for Art and Set decoration and Sound. Small acknowledgment of an outstanding film.James Stewart was outstanding as a detective that was duped by his \"friend (Tom Helmore).\" We were all led on an adventure that made absolutely no sense until we were shown the result. This film really had me going! Kim Novak was also excellent in her role as the wife. She was so good that I had no idea that she was anything more than object of Stewart's obsession. Hitchcock had me going her also.This was an excellent movie and should have had more recognition."
    },
    {
      "username": "AaronCapenBanner",
      "userUrl": "https://www.imdb.com/user/ur23589178",
      "reviewLink": "https://www.imdb.com/review/rw2885984",
      "warningSpoilers": false,
      "date": "13 October 2013",
      "rate": "9",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Mesmerizing.",
      "content": "Alfred Hitchcock directed this mesmerizing film that stars Jimmy Stewart as John 'Scottie' Ferguson, a retired San Francisco policeman who is approached by old college friend Gavin Elster(played by Tom Helmore) who wants him to follow his wife Madeline(played by Kim Novak) who has been acting strangely. Scottie does follow her, and becomes obsessed by her beauty and behavior, eventually falling in love with her, with devastating consequences. Though that is only the start of the mystery... Barbara Bel Geddes costars as Scottie's friend Midge, still in love with him, despite jilting him years before. Superbly directed and acted film has an ingenious story and stunning imagery, making this an unforgettable romantic mystery, with a stunning ending...though if you have the DVD, watch the extra feature on the lost extended ending, which is fascinating, and changes the tone of the film as a result!"
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw1959205",
      "warningSpoilers": true,
      "date": "12 October 2008",
      "rate": "8",
      "helpful": "21 out of 28 found this helpful.",
      "title": "Only the most shallow man would fail to be impressed by appearances.",
      "content": "\"Vertigo\" is considered Hitchcock's masterpiece by high-brows and viewed as a slow, dull movie by proletarians. Indulge this Olympian generalizations for a moment. If you don't know the story by now, it goes something like this. Jimmy Stewart is a San Francisco detective retired from the force because he contracted a severe case of acrophobia on the job. An old college friend, Gavin Elster, hires him to follow Elster's wife, Madeleine (Kim Novak) around. Elster is afraid Madeleine is going nuts. Stewart takes the job and is soon hooked on the lovely Madeleine. He rescues her from a suicide attempt, lugs her unconscious body to his own apartment, undresses her, and puts her in his bed until she recovers. Stewart and Madeleine fall in love, but she's still balmy and climbs to the tower of an old church to kill herself. Stewart can't follow because of his acrophobia. He blames himself. Later, while wandering the city streets, he spots a girl named Judy Barton (also Kim Novak) who resembles the departed Madeleine. Stewart gets to know her, squires her around, and step-by-step has her dress and groom herself exactly like his lost love. Then he discovers that Judy IS in fact his lost love. Judy was in cahoots with Gavin Elster and Stewart was a victim of a hoax designed to get rid of Elster's real wife. It ends tragically.It's neither a masterpiece nor dull, really. I don't doubt for a minute that it's Hitchcock's most personal movie. Cripes, he's got this luscious blond he keeps dressing and undressing, gorgeous and sexy, but also unattainable and ghostly. (A ghost of substantial heft, though.) That was always Hitchcock's fantasy, the icy Nordic who would attack you in the back seat of a taxi. (Poor Alma Reville, his wife, a rather homely brunette dwarf.) On top of the personal interest that Hitchcock lavished on the story, he adds some technical dazzle. Not too much. The acrophobic detective stares down the tall campanile and the camera simultaneously zooms in and dollies back. The tactic was so successful it's been imitated a number of times. And when Stewart and Novak finally kiss and make love in her green-lighted apartment, the director has them and the camera on a turntable that slowly revolves and shows us varied haunting backdrops. And the movie wouldn't be what it is without Bernard Hermann's romantic and oneiristic score.The whole film is meant to be dream-like and that's why it's understandable that some people would see it as irritatingly slow. It follows Edgar Allan Poe's theory of literary aesthetics. Poe threw reason off the bell tower and went for eerie effects, period. A man buries a murder victim under the floor but nails a cat in with the body by mistake. How can anyone miss a cat that's in the burial chamber? I can imagine viewers now, squirming, and asking, \"Where the hell is the logic in this movie?\" Let's put it this way. You are a girl named Judy Barton. You're pretty but have no marketable skills. A very wealthy man comes to you and offers you money to help him kill his wife. All you have to do is impersonate the wife and trap a former detective named Jimmy Stewart into falling in love with you and then lead him to a place where the wife can be safely killed and still look like suicide.Then, after the rich dude takes off for Europe, leaving you to become your slovenly self, you accidentally run into the victimized Stewart on the streets. (In a city of 700,000.) He doesn't recognize you, naturally, because now, having reverted to your original persona, you look like an overly made-up hooker. But he follows you home, knocks on your door, introduces himself, and asks you for a date. I ask you -- the discerning, sophisticated, somewhat street-savvy viewer -- would you accept? Would you date a man who will almost inevitably find out you're a murderess? One slip of the tongue could do it. The only person stupid enough to accept would also bury a black cat alongside a dead body.Kim Novak is a lot more effective as Madeleine than as Judy. The latter persona is coarse but tender too. The former is elegant and speaks in a ghostly whisper. Kim Novak was probably right for the part. As Judy, she has these overemphatic eyebrows that lend her the appearance of a Universal monster, perhaps one of the lesbian vampires that smiles as she pours you the drugged wine. But of Hitchcock's other actresses at the time, who else could have done better? The photography is splendid. And the director takes us on a Cook's Tour of many of the Bay Area landmarks -- Ernie's restaurant (now gone), Muir Woods almost, The Palace of the Legion of Honor, Fort Point, Mission San Juan Bautista (which has no tower), Point Lobos. And every day is perfectly sunny. Stewart re-dresses Novak at an expensive shop that was Ransohoff's at the time. It, too, is now gone but I took my wife to its less expensive replacement and insisted she buy a signature gray suit with a soft white shirt and a pair of brown heels. She swore she would do no such thing. After a slight scuffle, not nearly as athletic as the papers made it out to be, we wound up with some cheap scrap of an apron. (She never wore it.) It's only in a film in which there is no place for common sense, let alone genuine logic, that a man can create a new woman or resurrect an old one.I find it a fascinating movie, technically almost perfect, and worth repeated viewings if they're not repeated too often. (It's pretty depressing.) It's at once demanding and rewarding. And I'm certainly glad Hitchcock made it, if only to get it out of his system."
    },
    {
      "username": "JohnHowardReid",
      "userUrl": "https://www.imdb.com/user/ur12596887",
      "reviewLink": "https://www.imdb.com/review/rw4077612",
      "warningSpoilers": true,
      "date": "1 March 2018",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "A masterpiece of nightmarish excitement!",
      "content": "At the time of Vertigo's release, very few critics commented upon Bernard Herrmann's powerful music score which contributes so greatly to the movie's overall mood, atmosphere and almost unnerving suspense. The stars also were not given their due. In the most emotionally complex and technically demanding role of his career, James Stewart is totally convincing. He looks and acts like a man obsessed, a readily identifiable hero battling with age and infirmity to recreate an impossible, lost love. Stewart is not only utterly credible, but engrossingly sympathetic. On the other hand, Kim Novak (in by far the best performance of her career - she replaced Hitch's first choice, Vera Miles, at short notice when Vera became pregnant) combines a brassily self-confident manner with an odd aura of vulnerability. She is exactly the lost child of Stewart's obsessive dreams."
    },
    {
      "username": "BA_Harrison",
      "userUrl": "https://www.imdb.com/user/ur0945066",
      "reviewLink": "https://www.imdb.com/review/rw2876273",
      "warningSpoilers": false,
      "date": "26 September 2013",
      "rate": "5",
      "helpful": "49 out of 74 found this helpful.",
      "title": "I love Hitchcock but...",
      "content": "Although often regarded as one of Hitchcock's finest thrillers, Vertigo failed to impress me as much as I had hoped. There are the expected Hitchcock visual flourishes (plus one really trippy scene that is downright freaky), the dreamlike score by Bernard Hermann is suitably eerie, and Barbara Bel Geddes plays a fun character, but most other aspects of this so-called classic left me cold.James Stewart is rather wooden in his role but is suitably matched by Kim Novak, whose pencilled eyebrows have more screen presence than the rest of her (not surprising given how huge they are!); Hitch must have been directing on Valium, such is the slowness of the pace; and the story is really mundane, with little in the way of excitement or suspense save for the opening rooftop chase scene. Quite what other Hitchcock fans are raving about when they claim this is amongst his best work is beyond me—I struggled to stay awake."
    },
    {
      "username": "TxMike",
      "userUrl": "https://www.imdb.com/user/ur0438066",
      "reviewLink": "https://www.imdb.com/review/rw0066456",
      "warningSpoilers": true,
      "date": "5 July 2003",
      "rate": "",
      "helpful": "79 out of 124 found this helpful.",
      "title": "\"I know, I know. I have acrophobia, which gives me vertigo, and I get dizzy.\" (Scottie to Midge)",
      "content": "Although it was only modestly successful in theaters, time has been kind to VERTIGO and now many believe this is Hitchcock's masterpiece. Time was NOT kind to the original prints of the film, and in the mid-1990s Universal Studios put up one million dollars for a two-year restoration of the film. This is covered completely in a fairly fascinating 29-minute extra on the DVD, originally broadcast as an A&E special. The entire original film-making process is covered, the movie was first called \"From Among The Dead\", and includes current interviews with many principals, including Novak and Bel Geddes, plus the techniques used for the restoration. This special edition DVD should be a must-own for any fan of the film VERTIGO. The sound and picture are just fabulous for a film made in 1957.My review, following, contains certain SPOILERS which are necessary for my summary. Please read no further if you have not seen the film. Watch the film first, you will not be disappointed.The film starts with cops chasing a crook on SF rooftops, Scottie (James Stewart, 49) misses one roof, is hanging high from a gutter, cop returns to offer assistance, but instead falls to his death. This traumatic experience triggers the vertigo in Scottie, makes him unsuited for police work, he quits, and Midge (Barbara Bel Geddes) tells him only another emotional shock will bring him out of it. Midge, an artist, not so secretly wants Scottie, but while they are good friends, he just doesn't love her.Old college friend, wealthy shipbuilding magnate, hires Scottie to follow his wife who had been acting strangely. He meets Madaleine (Kim Novak, 24) and follows her to find that she visits the grave of Carlotta, who died at 25 in 1857, also visits the portrait of Carlotta at the art museum, has \"visions\" of being in a Spanish mission, all indications are that the dead Carlotta is taking over Madaleine's mind. While following her, saving her from a jump into SF Bay, and keeping her from jumping into the Pacific, Scottie is falling in love with her, the first time he has had such feelings.Scottie feels he needs to take Madeleine to the old mission 100 miles south of SF to free her of this possession, but instead she climbs up the mission bell tower, Scottie is unable to follow quickly enough, his vertigo holding him back, he hears a scream, sees what looks like Madeleine's body falling to the red tile roof below, dead. A quick inquest ruled it a suicide, the friend gets out of shipbuilding, travels, while Scottie tries to get over his great loss, his first ever love, includes a stay in a mental hospital.Not too long after, Scottie sees a woman remarkably similar to Madeleine walking to her residence, a hotel, he follows her, knocks on the door, she is dressed differently, has different color hair, a different personality, speaks differently, and says she is Judy, from Kansas, has lived there 3 years, even shows Scottie her ID to prove it. But Scottie has not gotten over Madeleine, is obsessed with recreating her, asks Judy to dress like her, get her hair colored, all the while Judy just wishes Scottie would like her for who she is, not because she looks like someone else. But she gets completely back to the Madeleine look, same clothes, same hair color.By now we have seen through Judy's flashback what is really going on. The wealthy husband had hired Judy to impersonate his wife, Madeleine, and had set up the incident at the mission so that he could shove the already dead wife off, Scottie would be the manipulated witness that she had climbed the stairs and jumped off, and after being paid off, Judy could resume her life. To her detriment, he also gave her the heirloom, Carlotta's necklace, and her wearing that is what got Scottie suspicious of the whole scheme. He catches on, brings Judy back to the mission, they climb to the bell, a nun approaches to see what is going on, Judy panics and falls to her death on the roof. Scottie no longer was in love with her, feeling lied to and manipulated, he has no emotion, but goes to the edge of the ledge and looks down, his vertigo gone. The emotional shock that Midge spoke of has cured him.The story is a tragedy of two lives that only through misfortune become intertwined, Scottie's and Judy's. He is not young, now retired, and had never found true love. In Madeliene he thinks he found it, only to be shocked then disillusioned when the full truth came out. When Judy died, he was back where the film started. Maybe Midge was the one after all. Judy was very flawed, enough to participate in a murder plot and feel no apparent guilt over it. All she wanted was to be loved by Scottie, but a relationship built on fraud has no chance, especially since Scottie was an honest man.James Stewart is known for his ability to play an \"everyman\" character, and is superb as Scottie. Kim Novak is a bigger mystery. She was not the first choice for the role, received it virtually by default, but after watching the movie it is hard to imagine anyone else playing the dual roles of Madeleine and Judy, she pulls it off so well. A big bonus is her commentary on the making-of extra, seeing her after all these years. She was only 24 when Vertigo was filmed, but she looked 40, a glamorous and beautiful 40. Actresses today who are 24 often still play teenagers. How things have changed in the movies!"
    },
    {
      "username": "Infofreak",
      "userUrl": "https://www.imdb.com/user/ur0381265",
      "reviewLink": "https://www.imdb.com/review/rw0066427",
      "warningSpoilers": false,
      "date": "15 January 2003",
      "rate": "",
      "helpful": "115 out of 175 found this helpful.",
      "title": "Hitchcock's most stunning achievement. A fascinating masterpiece which improves with each year and viewing.",
      "content": "I get a bit tongue-tied talking about Hitchcock's greatest movies because they are just so remarkable, so astonishing, so entertaining, so multi-levelled, that it's very difficult to put into words what makes them great. Hitchcock made some of the greatest movies ever made, and 'Vertigo', though by no means his most accessible film, is quite possibly his crowning achievement. It is without any doubt a masterpiece, and I cannot fault it in any way. Every time I watch it I am knocked out, and every time I see something new, some nuance or moment that I appreciate more than I did the previous viewing. Jimmy Stewart, one of the most popular movie star in Hollywood history, gives a remarkable performance throughout, one of the best in his career. Stewart had worked with Hitchcock before, and had always been superb, especially in the much copied suspense classic 'Rear Window' a few years prior to this, but he plays against type in 'Vertigo' and is jaw-droppingly good. It's difficult to remember now that 'Vertigo' is regarded as a movie milestone, that it received many bad reviews when it was originally released, and was a relative failure for Hitchcock. A lot of this had to do with Stewart's intense performance I think, and also the difficult subject matter. 'Vertigo' is essentially a tale of sexual obsession, something most people were probably not expecting at the time! Almost as good as Stewart is Kim Novak ('The Man With The Golden Arm') in a role that she will always be remembered for. 'Vertigo' is a virtuoso piece from Hitchcock, and a movie that will no doubt continue to inspire other film makers over the years to come. However the most important thing about it is that it is still wonderful viewing, and a movie experience that you will never forget. In my mind it is one of the three of four greatest American movies. Simply astonishing."
    },
    {
      "username": "dbdumonteil",
      "userUrl": "https://www.imdb.com/user/ur1219578",
      "reviewLink": "https://www.imdb.com/review/rw0066264",
      "warningSpoilers": false,
      "date": "12 August 2001",
      "rate": "10",
      "helpful": "79 out of 124 found this helpful.",
      "title": "Among the very best.",
      "content": "In Boileau-Narcejac's French novel \"D'Entre les Morts\"= from among the Dead\"),the revelation only comes in the last pages,but Hitchcock lets the cat out of the bag long before the end. Boileau-Narcejac's novel is a pure detective story,but the Master wanted more:the movie already outdistances the book in a first part visually wonderful,with memorable scenes,wrapped in mystery ,such as the one with the sequoia,symbol of immortality or the one down by the sea,to rival with the best romantic movies of all time.In the second part,Hitchcock explains in the Truffaut's book,we know but Scottie( James Stewart) does not .And he tries to recreate a dead woman,to transform Judy into Madeleine.This folie à deux ends where the first tragedy occurred ,which gives the movie a strength that the book had not.Read it and you'll realize how its end ,speaking in terms of cinema,had to be modified for the screen.That's Hitchcock's genius.When Boileau/Narcejac learned that Hitchcock wanted to transfer \"Celle Qui N'Etait PLus \" (=les Diaboliques\" )to the screen,they immediately wrote \"D'Entre les Morts \" on the same pattern for Hitchcock to direct."
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw2161551",
      "warningSpoilers": false,
      "date": "21 November 2009",
      "rate": "10",
      "helpful": "14 out of 18 found this helpful.",
      "title": "This film takes repeated viewings to really appreciate it...",
      "content": "... and perhaps that is why it bombed upon initial release.When Vertigo was first released in 1957, it was not that popular in theaters and was pretty much universally panned by critics. In 1992, when the British Film Institute performed a survey of the world film critics to compile an all-time ten-best list that comes out every decade, Vertigo came in at fourth place. It didn't even make that list in 1962 or 1972. Part of the reason for the delayed popularity of the film could be that it requires repeated viewings to really gain an appreciation of it. Such repeated viewings were not possible for most viewers until the advent of home video systems and cable around 1980.It is unusual to see a director produce his best work after the age of 50, but that is exactly what Alfred Hitchcock did. Starting in 1948 with \"Rope\" and ending with \"The Birds\" in 1963, this was the era of his most inspired films. \"Vertigo\", in my opinion, is the best film of his entire body of work.As for the film itself, it is a brilliantly twisted movie infused with touches of genius and madness that focuses on the interconnected nature of love and obsession. Interwoven with this main theme is a crime mystery that is revealed to and solved for the audience but not the protagonist, James Stewart's character, for the last 45 minutes of the film.Alongside these themes is the issue of lost opportunities - how we grieve over them, and whether or not what we perceive as lost opportunities were ever \"real\" opportunities in the first place. This issue is raised not only for Scotty (James Stewart), but for just about everybody else in the cast too. This includes Scotty's college girlfriend (Barbara Bel Geddes) who has remained his friend through the years and obviously still harbors thoughts of what might have been if only she had accepted Scotty's marriage proposal years before.Besides the excellent acting and superb plot, the score is outstanding as is the cinematography, especially the visual darkness of the mission San Juan Bautista versus the angelic beauty of Madeleine which belies what is really going on. I highly recommend this film to anyone who has the time to watch it more than once. Just one viewing won't do it justice."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0066357",
      "warningSpoilers": false,
      "date": "13 February 2000",
      "rate": "10",
      "helpful": "39 out of 58 found this helpful.",
      "title": "Favorite Hitchcock and likely one of the most challenging, harrowing great films ever",
      "content": "Alfred Hitchcock's Vertigo is probably his most discussed film, and I believe that since it is so controversial- and yet living up to such hype by having a level of mystery, daring and true human interest that is open to interpretation- it gets better with every passing year. It deserves more credit than it gets (like most of Hitchcock's films) and though it is well credited with it's intrigue, I think that Psycho (not that it is a bad film) gets more credit than this film should get. There are at least a few reasons for this, arguably of course. One, the acting is spectacular including James Stewart in one of his very best turns as the weary, emotionally perplexed and obsessed cop with a slight fear of heights and a 'thing' for a certain 'dead' woman. Hitchcock's leading lady here Kim Novak, is equally interesting and ambiguous as the leading lady (or ladies). Two, the atmosphere Hicthcock invokes in this film is just right for the psychological tailspin that Stewart gets into, with the usage of lighting, real San Fransisco locations, and particularly the color green all to perfect, eerie effect. And three, there's Bernard Herrmann's score, on par with the Psycho score though maybe even better as a straight piece of classical music in the guise of tense, haunting movie music. It's also the kind of picture that is a MUST if you've already seen it, or even if not, and it comes around town on the big screen as all the images and dark scenes come into great view. Not one of the more outright 'fun' Hitchcock films, with the few chuckles plain comic relief, and maybe his best serious work. A++"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2163455",
      "warningSpoilers": false,
      "date": "24 November 2009",
      "rate": "10",
      "helpful": "27 out of 39 found this helpful.",
      "title": "A thriller of undeniable complexity, and impeccably acted and directed-Hitchcock's masterpiece!",
      "content": "I am a massive Hitchcock fan; this great director ain't called the Master of Suspense for nothing. Anyway, Vertigo is one of the truly great Hitchcocks. It is a thriller of undeniable complexity not only in plot but also in characterisation. It is implausible too i give you that. I will admit the first time I saw this, I didn't understand this, then again this is the sort of film that you need to see more than once. In all departments, this movie is a masterpiece and my all time favourite Hitchcock. For those who say this is the worst movie ever, you would beg to differ if you saw genuine crapfests like Disaster Movie, Home Alone 4, NeverEnding Story 3 and Superbabies:Baby Geniuses 2. They are a trillion times worse than this without a shadow of a doubt.What makes this movie great? When I re watched this, I got goosebumps. It is quite chilling, suspenseful and extremely haunting. The complex plot tells of a retired cop with a terror of heights who is hired by Gavin Elster to follow his suicidal wife. In the end, he falls in love with her but can't stop her falling to her death. Months later he sees a woman bearing strong resemblance to her, and is drawn into a web of deceit and obsession. There are so many strong moments here, especially Scotty following Madeline up the tower only to witness her falling to her death, but also of the San Francissco locations giving a dreamlike quality to an already dark and complex movie. The screenplay is sophisticated and sharp as well. And I have to mention Bernard Hermann's score, it was phenomenal, along with Miklos Rosza's score for Spellbound and Hermann's for Psycho this is the most memorable score in any Hitchcock film, and is guaranteed to have your hairs standing up on the back of your necks.The direction from Hitchcock is simply masterly. The cinematography isn't dated at all. It is stylish and full of contrasts of dark and bright colours, and is also very brooding and intense. I had very little problem with the film's pace and length; in fact let me rephrase that I had no problem with it. I felt actually that Torn Curtain had a much slower pace, and for me that film while good is one of my least favourite Hitchcock movies. The acting I thought was exceptional. Kim Novak starts off a little wooden, but she is certainly very beautiful and enigmatic. In the duel role of the suicidal wife and the woman bearing resemblance to her, she does an in general excellent job, considering both are extremely demanding roles. About James Stewart, whether he was a racist I don't know, but simply I don't care. Whether you are racist or not, it shouldn't matter when it comes to acting and films. What matters is that Stewart was a great actor who rarely gave a bad performance. In this film, he gives one of his best performances, shattering his Mister-Nice-Guy persona with a dark, brooding and truly complex characterisation. Barbara Bel Geddes also gives a terrific performance as Midge.All in all, a superb film, that deserves recognition as one of Hitchcock's best films. Seriously, it is one of the most effective depictions of romantic fatalism in all of cinema. An unforgettable masterpiece, 10/10 Bethany Cox"
    },
    {
      "username": "filipemanuelneto",
      "userUrl": "https://www.imdb.com/user/ur53053227",
      "reviewLink": "https://www.imdb.com/review/rw3469834",
      "warningSpoilers": false,
      "date": "14 May 2016",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "One of the most surprising films I've seen.",
      "content": "Scottie Ferguson is a police officer, retired because of fear of heights. His life changes when he accepts to watch a woman at the request of her husband, who suspects that his wife has been visited by a ghost. Directed by Alfred Hitchcock, has script Alec Coppel and Samuel A. Taylor, with the participation of James Stewart and Kim Novak.This film is considered by experts one of the best films ever made. I never understood why but, nevertheless, is one of Hitchcock's films that I most like to see. The script is very good, mixing love, obsession, loyalty, madness and mystery in an irresistible recipe that takes the seal of quality of one of the most brilliant masters of suspense in cinema. The ending is baffling. Technically impeccable, this film has an excellent picture, sound effects and a soundtrack where the emphasis is given to the opening theme that, in all fairness, became one of the most famous of Bernard Herrmann. The performance of the actors also deserves congratulations. Stewart shows why Hitchcock was so fond of working with him and Novak can perfectly be, at the same time, the damsel in distress and the femme fatale, who leads men to act without thinking.Essential for all Hitchcock fans, this film is a must-see for any lover of suspense and mystery. It's a film that can be seen by teenage audiences, despite having some more dramatic scenes, and probably will please the majority of audiences."
    },
    {
      "username": "krumski",
      "userUrl": "https://www.imdb.com/user/ur0594212",
      "reviewLink": "https://www.imdb.com/review/rw0066360",
      "warningSpoilers": true,
      "date": "17 February 2000",
      "rate": "5",
      "helpful": "80 out of 104 found this helpful.",
      "title": "SPOILERS GALORE! If you've never seen the movie, DON'T READ this review!",
      "content": "I suppose this is some kind of masterpiece, what with the absolutely overwhelming photography, powerful score and all - but I must say I just couldn't get into it. We're made to be patient through a looooong exposition (Scottie following her around), which I didn't mind at first because I said, \"Hey it's Hitchcock - the payoff will be worth it.\" Well, it wasn't. Scottie's obsession was inexplicable to me (and, yes, I realize that Kim Novak is hot); maybe the writing was weak in not giving him a strong and clear enough motivation for going over the edge (what were his other romantic attachments like? Why is *this* one in particular so extremely excessive? Knowing these things would help) or maybe it's just that I can't buy Jimmy Stewart in this type of role. He projects too much groundedness, dignity and common sense for him to be convincing as this kind of obsessional basket case (the scene with him in the asylum was particularly embarrassing and unconvincing; he doesn't look \"crazy\" - he looks like Jimmy Stewart just refusing to say his lines). Maybe an actor a bit more rumpled and on the edge - Robert Mitchum, say - could have brought the part off better (and I'm a *huge* Jimmy Stewart fan, just so you don't get the wrong idea).My biggest problem, however, is with the final third of the movie. Excuse me, but I just don't think it was a good idea to reveal the murder plot and its actual machinations two-thirds of the way into the film. Not knowing for certain up until the very end whether \"Judy\" was really \"Madeleine\" or whether Scottie was indeed just imagining things would have been much MUCH more effective. It would have pulled the viewer in, kept him guessing and psychologically on edge all the way through. Once you know that Scottie is \"correct\" in his assumption, not only is the tension gone and you're no longer immediately connected to the story, also you can't truly buy his craziness or obsession as a thematic point since, after all, he's \"right.\" I believe this to be one of the all-time biggest scripting mistakes in the history of cinema. Hitchcock has said, though, that suspense is not what he was primarily after in this movie. He wanted to reveal the murder plot early so it wouldn't get in the way of the attention paid to Scottie's disintegration. But without the suspense, Scottie's disintegration just looks stupid. It's like the end of the movie has already come and gone, and yet the director is still forcing us to sit through a drawn-out and pointless epilogue that just takes foreeeeeever. . . And the ending - what's with that?! She sees a nun and so she jumps off the roof? It's absolutely RIDICULOUS - so abrupt and nonsensical, as if the editor suddenly told Hitchcock that he had to end the film RIGHT NOW, and he had to think of something fast. Clearly, the best ending (if the film had to go this long) would have been for her to slip off the edge, and then have Scottie try but fail to save her - thus mirroring his failure to save the cop at the beginning of the movie from falling, giving the whole thing a neat little symmetry. That Hitchcock failed to see the absolute rightness of this conclusion makes me wonder about his status as a cinematic genius.Well, ok, I won't go that far - Hitch's reputation is safe. But Vertigo's isn't; this is no masterpiece, and far from the director's greatest work. Instead, this is the one film where he deserted his \"popcorn\" approach to creating thrills and opted for a more pensive and \"mature\" style, thinking this would prove him the artist so many denied that he was. It does just the opposite - by playing down what he did best (building and sustaining suspense), Hitchcock is left rudderless, and his attempt at \"adult\" themes just look embarrassing. It's beautiful to look at, of course - one of the most sumptuous visual experiences in the entire history of movies. The redwoods scene, and the Golden Gate Bridge - fantastic! The scenes in the museum, too - absolutely ravishing. But, alas, great photography does not make a great movie. If only Vertigo were a coffee table book, then it might truly deserve the classic status it has been accorded. I don't know, I guess if you're a fan of the technical aspects of cinema, and love Hitchcock for his visual bravura and like to analyze his technique, there's probably a lot here for you to enjoy (and is no doubt why it's so loved by other directors). But if you're like me, and enjoy Hitchcock films for their pure ability to keep you tense and on the edge of your seat, Vertigo is not the film to watch."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw0066310",
      "warningSpoilers": false,
      "date": "5 May 1999",
      "rate": "10",
      "helpful": "13 out of 17 found this helpful.",
      "title": "Makes the Brain Spin",
      "content": "Having experienced vertigo myself, the dizzying, confusing, frightening mind spinning, \"think you're going to die\" kind of feeling, I can empathize with the Jimmie Stewart protagonist. Make him a hero who has enough hangups from trauma to last a lifetime. Put into the plot a series of misrepresentations of fact and you have this movie. I think what I like the most is that we have this man trying to put his life together, but he doesn't know what to do to make it work. He also is deep in depression, caused by personal loss. Along comes Kim Novak, the carbon copy of his lost love. He falls into a sick reconstruction of his past life, but the fear is still there and won't go away until he is able to confront his ghosts. Once again, the Hitchcock hero fumbles his way along, trying to discover while being pursued. There is that threat there all the time. The cinematography is excellent. The method used to show the feeling he gets when he looks down, is pure genius. The framing of scenes. The stairway in the tower. The scenes by the bay. Novak's \"coming out\" is really spooky, so captivating and yet unsettling. The true test of a movie, for me, is always going to be that there is something to see after several viewings. Hitchcock's films, especially the really good ones, allow me a lifetime of rediscovery; I feel that directors like Hitchcock are a gift to humanity. This film is one of the reasons I feel this way."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw2168783",
      "warningSpoilers": false,
      "date": "5 December 2009",
      "rate": "10",
      "helpful": "23 out of 33 found this helpful.",
      "title": "A Masterpiece of Obsession",
      "content": "While pursuing a criminal on the roofs of the buildings in San Francisco, Detective John \"Scottie\" Ferguson (James Stewart) has a severe trauma when his partner falls off the roof trying to save him. He suffers from acrofobia and is retired from the police force, since his fear of heights provokes vertigo on him. He is contacted by the former mate from college Gavin Elster (Tom Helmore), who runs the shipyard of his wife Madeleine Elster (Kim Novak), and Gavin asks him to follow his wife. Gavin explains that she has an odd behavior and seems to be possessed by the spirit of Carlotta Valdes, having blanks of memory every now and then and presenting suicidal tendencies. The skeptical Scottie follows the beautiful blonde on the next morning: she buys some flowers and is drawn to places from the past related to Carlotta Valdes, visiting her grave in an ancient cemetery; staring her portrait for a long time in a museum; and finally moving to the Hotel McKittrick where Carlotta lived. In the end of the day, Scottie reports his findings to Gavin. When Madeleine jumps in the water of San Francisco Bay, Scottie rescues her and brings her home. He has a crush on her and they fall in love for each other. When they go together to a mission outside San Francisco, Madeleine runs to the bell tower of the church and the disabled Scottie is unable to reach her; she jumps off the tower, committing suicide. There is a trial and the traumatized Scottie is interned with a breakdown. When he is discharged from the hospital, he meets the brunet seller Judy Barton by chance and her resemblance with Madeleine is amazing. Scottie approaches to Judy and expect to have a second chance in love until he sees a souvenir of a killing. \"Vertigo\" is a masterpiece of obsession of Alfred Hitchcock. The timeless complex story is perfect and full of suspense and psychological and sexual tensions. Kim Novak is extremely sexy and has an extraordinary performance in her double role and James Stewart is awesome as usual performing a charismatic character that becomes obsessed when he sees Judy. Barbara Bel Geddes performs an important support character that helps to develop James Stewart's character. The open conclusion is also excellent and the music score is also spectacular and gives a suspenseful touch of class to this film. This time, the cameo of Alfred Hitchcock is walking in front of the entrance of the shipyard carrying what seems to be a musical instrument. My vote is ten.Title (Brazil): \"Um Corpo que Cai\" (\"A Body that Falls\")"
    },
    {
      "username": "slokes",
      "userUrl": "https://www.imdb.com/user/ur2375356",
      "reviewLink": "https://www.imdb.com/review/rw0949412",
      "warningSpoilers": true,
      "date": "18 October 2004",
      "rate": "9",
      "helpful": "29 out of 40 found this helpful.",
      "title": "Falling In Love...Or Just Falling?",
      "content": "Alfred Hitchcock made a career movie with \"Vertigo,\" one of several career movies of his, but maybe the most enduring. On the surface, it's a love story with a mystery, bright and shiny, maybe his most sumptuous feast of the senses. But it has a cold heart.James Stewart is the key to the film. I think a lot of people misjudge the film by misjudging his character, police detective John \"Scotty\" Ferguson. They see him and see the guy who played amiable dipso Elwood P. Dowd in \"Harvey\" or noble Mr. Smith or George Bailey. The secret of Scotty is he's no nice guy, though. He's more than a bit of a heel, a hard and greedy man eminently deserving of the roasting he gets in Henry Jones' postmortem. Watch Stewart in Hitchcock's \"Rope\" or the unjustly overlooked \"Carbine Williams,\" and you see the hardness Hitchcock was after, and got, from his lead here.Scotty does a lot of mean things in \"Vertigo,\" actions that feed his illness and lead to his doom. The character of Midge, subtly portrayed by Barbara Bel Geddes, is a key for understanding this. His casual stoking early on of Midge's flames of unreturned desire, especially when viewed in retrospect, burns through their happy banter and demonstrates how miserable a man he is, nowhere more brilliantly or ruthlessly than when he cuts her off from his life over a silly gag. Watch \"Vertigo\" more than once, and you may find yourself hating the guy as much as I do. But you still follow his path of doom with total sympathy; because of the elegant, enveloping way Hitchcock draws you into this world of passion, cut off from all bounds of propriety, even space and time.If Scotty was played by anyone other than Stewart, it's hard to imagine \"Vertigo\" packing the punch it does. You wouldn't have enough tolerance for the character to stick with his story. In its own day, \"Vertigo\" was a bit of a misfire, probably because audiences felt alienation from the Stewart image they were accustomed to. Yet now viewed from a decent remove, you get more of what Hitchcock was after, and respond to it better.Still, it's easy to understand people not liking \"Vertigo\" the first time they see it. At least that's true with me. I didn't like \"Vertigo\" the first time I saw it. Here's what helps you find the right handle. Fall in love with the wrong person. Become bitterly disappointed. See the one that you loved in the face of passersby, in odd places, and in your dreams. Then you begin to get it. Life is a series of hellos and goodbyes, as Billy Joel once sang, and trying to hold on too long is a recipe for self-inflicted pain.Talking too much about \"Vertigo\" is not a good idea. There's too many obvious spoilers in recounting the plot of the film, in explaining why Kim Novak is so flat-out stupendous in her performance, and how you are left feeling by film's end. \"Vertigo\" is a uniquely personal film, not only for Hitchcock, but for a broad array of viewers who like me have latched onto its tragic story.That's not to say it's perfect. There's a murder mystery wrapped up in \"Vertigo,\" and all the pieces don't exactly fit when you think about them later. Hitchcock called it \"icebox talk,\" something to leave the viewer pondering after the film was over, but maybe he left a few more loose ends than he should have this time around.Still, what \"Vertigo\" is after is not making sense but magic, and it succeeds wonderfully, nowhere more so then when it bends the laws of reality. Take the moment when the bookstore owner tells the sad tale of Carlotta Valdez while the lights of the room around him dim in eerie, unnatural sympathy. Or the way the flowers in the shop Madeleine visits seem to glow in unearthly splendor as Ferguson, his eyes glowing strangely too, spies on his prey.You may not like this film the first time you see it, but if you are left disturbed and uneasy from the experience, you owe it to yourself to see it again. \"Vertigo\" is a film that keeps on giving, with all the power and mystery of unrequited love, but unlike most forms of infatuation, this film has a way of returning the ardor with which it is held. Utterly timeless."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw2020847",
      "warningSpoilers": true,
      "date": "9 February 2009",
      "rate": "10",
      "helpful": "39 out of 56 found this helpful.",
      "title": "A fascinating psychological suspense masterpiece which worked on the audience on several levels...",
      "content": "Scottie Ferguson is a retired detective with a paralyzing fear of heights He had quit detective work after he sees a colleague falling to his death, and nearly he looses his own life at the same time while chasing a crook across some San Francisco rooftops An old college friend gives him the job of following his blonde wife Madeleine who had some kind of mental problem or might even be possessed from beyond the grave by a figure from the past whose portrait she stares at in a museum Scottie follows Madeleine around San Francisco and when she tries to drown herself in San Francisco Bay, he rescues her and falls promptly in love with her But Scottie' s vertigo made him powerless to save her when she climbed to the top of the bell tower at the mission at San Juan Batista, and jumped from the tower to her fatal end Scottie must spend the second part of the movie regaining from the trauma His loyal ex-fiancée Midge helps him overcome his psychological torment One year later, completely recovered from his nervous breakdown, he meets a red-haired woman who seems the living image of Madeleine...Stewart gives a terrific performance of a man recognizing his own limits, suffering by his acrophobia... When he is given the chance to pursue this enigmatic woman, his boring life takes on new meaning... He is drawn into her romantic obsession with the past Madeline makes him feel important in her life This is something totally new to his world: a lovely straight-forward woman who takes him into a haunting dream... When he fails to keep her alive, his real world was suddenly shattered Stewart delivers an accurate portrait of an annoyed human being searching for the unattainable He is a pragmatic man dealing with events in the light of his intuition Kim Novak is so delicate as Madeleine Her performance is skilled and highly refined She is a pretty woman, very sensitive, not sensual, yet conscious of her charm and magic This fascinating suspense masterpiece reveals something new with each viewing Note: Hitchcock appears after eleven minutes of the beginning of the film, walking past a Shipbuilding Co."
    },
    {
      "username": "XRANDY",
      "userUrl": "https://www.imdb.com/user/ur1042144",
      "reviewLink": "https://www.imdb.com/review/rw0066263",
      "warningSpoilers": false,
      "date": "2 August 2001",
      "rate": "",
      "helpful": "24 out of 30 found this helpful.",
      "title": "Classic Hitchcock and Stewart",
      "content": "An interesting psychological piece that richly displays Hitchcock's talents. It is unfair to compare this film to the suspense thrillers of today which are subjected to more realism in sex and violence. Hitchcock had to be more subtle in 1958, where I'm sure a work like this, that seems tame by today's standards, appeared bizarre and risqué. Also the acting here seems histrionic; not that people actually spoke like that in the 50s but the audiences liked such dictionally refined dialogue back then as opposed to the lines of modern-day scripts that more accurately portray the way individuals speak. James Stewart and Kim Novak are appealing on numerous levels, the former mainly because he doesn't wander far from the amiable joe we have come to expect (even though he does weird-out near the conclusion) and the latter because she maintains a veneer of vulnerability that we can relate to. This is not a film I especially like (I couldn't watch it again and again) but I respect for its strong filmmaking."
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw1473217",
      "warningSpoilers": false,
      "date": "12 September 2006",
      "rate": "9",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Accomplished If Not \"Fun\" Hitchcock Drama",
      "content": "Considered by many to be Hitchcock's masterpiece, \"Vertigo\" may be tough to warm up to on a first viewing. It's an enigmatic and extremely slow-moving film, and it feels personal in ways that many of Hitchcock's other, more playful movies don't. You get the sense that Hitch is working through his personal demons on screen -- the fetishes and obsessions that played such a major role in so many of his films leading up to \"Vertigo\" feel like characters in and of themselves here.James Stewart delivers a frightening performance as a man who plunges into a world of weird sexual obsession when a woman with whom he's formed a romantic attachment dies (or seems to). He finds another woman who looks amazingly like the first, and proceeds to force a complete physical makeover on her in an attempt to recreate his former love. Kim Novak plays the two women in her typical icy fashion; for once, her stilted, awkward acting works for a role and comes off as an attribute rather than a liability.In its new remastered life on DVD, \"Vertigo\" looks stunning. San Francisco and its surroundings are bathed in ethereal, dream-like lighting, and Hitchcock pays more attention to art direction and the use of color than he ever had previously. Also, there's that amazing swirling Bernard Herrmann score that haunts the film, and accompanies one of the most memorable opening credits sequences ever filmed.There are still a number of other Hitchcock films I would rather watch before \"Vertigo,\" and many others that I would qualify as much more fun, but I can't deny that this one certainly has an allure.Grade: A"
    },
    {
      "username": "ThomasDrufke",
      "userUrl": "https://www.imdb.com/user/ur39517558",
      "reviewLink": "https://www.imdb.com/review/rw3524760",
      "warningSpoilers": false,
      "date": "13 August 2016",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Karma, Deception, and Obsession.",
      "content": "Alfred Hitchcock wowed audiences for decades with an immense talent of deception and artistic flare, and perhaps no movie was a better showcase for those talents than his 1958 hit Vertigo. An impressive tale about obsession.In honor of Alfred Hitchcock's birthday, I decided to re-watch Vertigo and reevaluate just how well it holds up upon repeated viewings. There's nothing quite like the shock of watching it for the first time, but I had a chance to dig my teeth into the legendary performances of James Stewart and Kim Novak while being dazzled by Hitchcock's meticulously crafted story.One of the most impressive aspects about Vertigo is that it's clearly framed as a story about someone with Vertigo dealing with a peculiar case, but really, it's about obsession, and a man digging just a little bit too deep into a case. A theme that Christopher Nolan seemed to take into his film, Memento, in 2000. Vastly different stories, but similar execution from the director's chair.An easy way to identify a film's tone is through the score, and Hitchcock always seemed to get the best out of the legend, Bernard Herrmann. His score here is both haunting and alluring. I love the way he balanced the score with the uncomfortable feeling we get as an audience watching Stewart's character obsess, along with the noir- ish love story that forms as well.Amidst Hitchcock's mind boggling story are a few darn good performances by Stewart and Novak. Stewart, typically known strictly in likable protagonist roles, finds himself in a more complex and even unlikable alley. There's certainly times where the lines between protagonist and antagonist are blurred, but Stewart does a great job at rounding out his character. Novak, on the other-hand, plays a more mysterious role but nonetheless just as significant. Aside from the characters in Psycho, Novak may have had the most difficult time portraying just who Hitchcock desired for this role. If there was ever a Hitchcock blonde who deserved a Best Actress Oscar, I think it was Novak.Overall, Vertigo holds up just as well as the first time I watched it, and perhaps even better in some aspects. There's a reason this film is at the top of so many greatest films of all time lists.+Hitchcock's colorful direction+Stewart and Novak were at the top of their game+Herrmann's score+Themes still hold up10/10"
    }
  ],
  "errorMessage": ""
}