{
  "imDbId": "tt0052357",
  "title": "Vertigo",
  "fullTitle": "Vertigo (1958)",
  "type": "Movie",
  "year": "1958",
  "language": "en",
  "titleInLanguage": "Vertigo (film)",
  "url": "https://en.wikipedia.org/wiki/Vertigo_(film)",
  "plotShort": {
    "plainText": "Vertigo is a 1958 American psychological thriller film directed and produced by Alfred Hitchcock. The story was based on the 1954 novel D'entre les morts (From Among the Dead) by Boileau-Narcejac. The screenplay was written by Alec Coppel and Samuel A. Taylor. The film stars James Stewart as former police detective John \"Scottie\" Ferguson, who has retired because an incident in the line of duty has caused him to develop acrophobia (an extreme fear of heights) and vertigo, a false sense of rotational movement. Scottie is hired by an acquaintance, Gavin Elster, as a private investigator to follow Gavin's wife, Madeleine (Kim Novak), who is behaving strangely.\r\nThe film was shot on location in the city of San Francisco, California, as well as in Mission San Juan Bautista, Big Basin Redwoods State Park, Cypress Point on 17-Mile Drive, and Paramount Studios in Hollywood. It is the first film to use the dolly zoom, an in-camera effect that distorts perspective to create disorientation, to convey Scottie's acrophobia. As a result of its use in this film, the effect is often referred to as \"the Vertigo effect\". In 1996, the film underwent a major restoration to create a new 70 mm print and DTS soundtrack.\r\nVertigo received mixed reviews upon initial release, but is now cited as a classic Hitchcock film and one of the greatest films ever made. In 1989, it was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\". The film appears repeatedly in polls of the best films by the American Film Institute, including a 2007 ranking as the ninth-greatest American movie ever. Attracting significant scholarly attention, it replaced Citizen Kane (1941) as the greatest film ever made in The Sight & Sound Greatest Films of All Time 2012 poll, and came in 2nd in 2022.",
    "html": "<p>Vertigo is a 1958 American psychological thriller film directed and produced by Alfred Hitchcock. The story was based on the 1954 novel D'entre les morts (From Among the Dead) by Boileau-Narcejac. The screenplay was written by Alec Coppel and Samuel A. Taylor. The film stars James Stewart as former police detective John \"Scottie\" Ferguson, who has retired because an incident in the line of duty has caused him to develop acrophobia (an extreme fear of heights) and vertigo, a false sense of rotational movement. Scottie is hired by an acquaintance, Gavin Elster, as a private investigator to follow Gavin's wife, Madeleine (Kim Novak), who is behaving strangely.</p><p>The film was shot on location in the city of San Francisco, California, as well as in Mission San Juan Bautista, Big Basin Redwoods State Park, Cypress Point on 17-Mile Drive, and Paramount Studios in Hollywood. It is the first film to use the dolly zoom, an in-camera effect that distorts perspective to create disorientation, to convey Scottie's acrophobia. As a result of its use in this film, the effect is often referred to as \"the Vertigo effect\". In 1996, the film underwent a major restoration to create a new 70 mm print and DTS soundtrack.</p><p>Vertigo received mixed reviews upon initial release, but is now cited as a classic Hitchcock film and one of the greatest films ever made. In 1989, it was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\". The film appears repeatedly in polls of the best films by the American Film Institute, including a 2007 ranking as the ninth-greatest American movie ever. Attracting significant scholarly attention, it replaced Citizen Kane (1941) as the greatest film ever made in The Sight & Sound Greatest Films of All Time 2012 poll, and came in 2nd in 2022.</p>"
  },
  "plotFull": {
    "plainText": "Vertigo is a 1958 American psychological thriller film directed and produced by Alfred Hitchcock. The story was based on the 1954 novel D'entre les morts (From Among the Dead) by Boileau-Narcejac. The screenplay was written by Alec Coppel and Samuel A. Taylor. The film stars James Stewart as former police detective John \"Scottie\" Ferguson, who has retired because an incident in the line of duty has caused him to develop acrophobia (an extreme fear of heights) and vertigo, a false sense of rotational movement. Scottie is hired by an acquaintance, Gavin Elster, as a private investigator to follow Gavin's wife, Madeleine (Kim Novak), who is behaving strangely.\r\nThe film was shot on location in the city of San Francisco, California, as well as in Mission San Juan Bautista, Big Basin Redwoods State Park, Cypress Point on 17-Mile Drive, and Paramount Studios in Hollywood. It is the first film to use the dolly zoom, an in-camera effect that distorts perspective to create disorientation, to convey Scottie's acrophobia. As a result of its use in this film, the effect is often referred to as \"the Vertigo effect\". In 1996, the film underwent a major restoration to create a new 70 mm print and DTS soundtrack.\r\nVertigo received mixed reviews upon initial release, but is now cited as a classic Hitchcock film and one of the greatest films ever made. In 1989, it was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\". The film appears repeatedly in polls of the best films by the American Film Institute, including a 2007 ranking as the ninth-greatest American movie ever. Attracting significant scholarly attention, it replaced Citizen Kane (1941) as the greatest film ever made in The Sight & Sound Greatest Films of All Time 2012 poll, and came in 2nd in 2022.\r\nPlot\r\nAfter a rooftop chase in which a fellow policeman falls to his death, San Francisco detective John \"Scottie\" Ferguson retires out of fear of heights and vertigo. Scottie tries to conquer his fear, but his ex-fiancée, underwear designer Marjorie 'Midge' Wood, says that another severe emotional shock may be the only cure.\r\nGavin Elster, an acquaintance from college, asks Scottie to follow his wife, Madeleine, claiming that she has been behaving strangely and her mental state is abnormal. Scottie reluctantly agrees and follows Madeleine to a florist, where she buys a bouquet, to the Mission San Francisco de Asís and the grave of Carlotta Valdes (1831–1857), and to the Legion of Honor art museum, where she gazes at the Portrait of Carlotta. He watches her enter the McKittrick Hotel, but upon investigation, she does not seem to be there.\r\nA local historian explains that Carlotta Valdes committed suicide: she had been the mistress of a wealthy married man and borne his child; the otherwise childless man kept the child and cast Carlotta aside. Gavin reveals that Carlotta (who he fears is possessing Madeleine) is Madeleine's great-grandmother, although Madeleine has no knowledge of this and does not remember the places she has visited. Scottie tails Madeleine to Fort Point and when she leaps into the bay, he rescues her.\r\nThe next day, Madeleine stops to deliver a letter of gratitude to Scottie, and they decide to spend the day together. They travel to Muir Woods and Cypress Point on 17-Mile Drive, where Madeleine runs down towards the ocean. Scottie grabs her and they embrace. The following day, Madeleine visits Scottie and recounts a nightmare. Scottie identifies its setting as Mission San Juan Bautista, the childhood home of Carlotta. He drives her there and they express their love for each other. Madeleine suddenly runs into the church and up the bell tower. Scottie, halted on the steps by his acrophobia, sees Madeleine plunge to her death.\r\nThe death is declared a suicide. Gavin does not fault Scottie, but Scottie breaks down, becomes clinically depressed and is sent to a sanatorium, almost catatonic. Following his release, Scottie frequents the places that Madeleine visited, often imagining that he sees her. One day, he notices a woman on the street who reminds him of Madeleine, despite her different appearance. Scottie follows her to her hotel room, where she identifies herself as Judy Barton, from Salina, Kansas.\r\nJudy has a flashback revealing that she was the person Scottie knew as \"Madeleine Elster.\" She was impersonating Gavin's wife in an elaborate murder scheme. Judy drafts a letter to Scottie explaining her involvement: Gavin deliberately took advantage of Scottie's acrophobia to substitute his wife's freshly killed body in the apparent \"suicide jump.\" However, Judy rips up the letter and continues the charade because she loves Scottie.\r\nThey begin seeing each other, but Scottie remains obsessed with \"Madeleine.\" He asks Judy to change her clothes and dye her hair to resemble Madeleine. After Judy complies, hoping that they may finally find happiness together, he notices her wearing the necklace portrayed in Carlotta's painting. Scottie realizes the truth and insists on driving Judy back again to the Mission.\r\nThere, he tells her he must re-enact the event that led to his madness, admitting he now understands that \"Madeleine\" and Judy are the same person, and that Judy was Gavin's mistress before being cast aside, just as Carlotta was. Scottie forces her up the bell tower and makes her admit her deceit. Scottie reaches the top, finally conquering his acrophobia. Judy confesses that Gavin paid her to impersonate a \"possessed\" Madeleine. Judy begs Scottie to forgive her because she loves him. He embraces Judy, but a shadowy figure — actually a nun investigating the noise — rises from the tower's trapdoor, startling her. Judy suddenly lunges backward and accidentally falls to her death. Scottie, bereaved once again but cured of his fear of heights, stands on the ledge while the nun rings the mission bell.\r\nCast\r\nJames Stewart as John \"Scottie\" Ferguson\r\nKim Novak as Judy Barton / Madeleine Elster\r\nTom Helmore as Gavin Elster\r\nBarbara Bel Geddes as Marjorie \"Midge\" Wood\r\nHenry Jones as the coroner\r\nRaymond Bailey as Scottie's doctor\r\nEllen Corby as the manager of the McKittrick Hotel\r\nKonstantin Shayne as bookstore owner Pop Leibel\r\nLee Patrick as the car owner mistaken for Madeleine\r\nAlfred Hitchcock makes his customary cameo appearance walking in the street in a gray suit and carrying a trumpet case.\r\nThemes and interpretations\r\nCharles Barr in his monograph dedicated to the study of Vertigo has stated that the central theme of the film is psychological obsession, concentrating in particular on Scottie as obsessed with the women in his life. As Barr states in his book, \"This story of a man who develops a romantic obsession with the image of an enigmatic woman has commonly been seen, by his colleagues as well as by critics and biographers, as one that engaged Hitchcock in an especially profound way; and it has exerted a comparable fascination on many of its viewers. After first seeing it as a teenager in 1958, Donald Spoto had gone back for 26 more viewings by the time he wrote The Art of Alfred Hitchcock in 1976. In a 1996 magazine article, Geoffrey O'Brien cites other cases of 'permanent fascination' with Vertigo, and then casually reveals that he himself, starting at age 15, has seen it 'at least thirty times'.\"\r\nCritics have interpreted Vertigo variously as \"a tale of male aggression and visual control; as a map of female Oedipal trajectory; as a deconstruction of the male construction of femininity and of masculinity itself; as a stripping bare of the mechanisms of directorial, Hollywood studio and colonial oppression; and as a place where textual meanings play out in an infinite regress of self-reflexivity.\" Critic James F. Maxfield has suggested that Vertigo can be interpreted as a variant on the Ambrose Bierce short story \"An Occurrence at Owl Creek Bridge\" (1890), and that the main narrative of the film is actually imagined by Scottie, whom we see dangling from a building at the end of the opening rooftop chase.\r\nProduction\r\nDevelopment\r\nThe screenplay of Vertigo is an adaptation of the French novel D'entre les morts (From Among the Dead) by Pierre Boileau and Thomas Narcejac. Hitchcock had attempted to buy the rights to the previous novel by the same authors, Celle qui n'était plus (She Who Was No More), but he failed, and it was made instead by Henri-Georges Clouzot as Les Diaboliques. Although François Truffaut once suggested that D'entre les morts was specifically written for Hitchcock by Boileau and Narcejac, Narcejac subsequently denied that this was their intention. However, Hitchcock's interest in their work meant that Paramount Pictures commissioned a synopsis of D'entre les morts in 1954, before it had even been translated into English (it appeared in translation as The Living and the Dead in 1956).\r\nIn the book, Judy's involvement in Madeleine's death was not revealed until the denouement. At the script stage, Hitchcock suggested revealing the secret two-thirds of the way through the film, so that the audience would understand Judy's mental dilemma. After the first preview, Hitchcock was unsure whether to keep the \"letter writing scene\" or not. He decided to remove it. Herbert Coleman, Vertigo's associate producer and a frequent collaborator with Hitchcock, felt the removal was a mistake. However, Hitchcock said, \"Release it just like that.\" James Stewart, acting as mediator, said to Coleman, \"Herbie, you shouldn't get so upset with Hitch. The picture's not that important.\" Hitchcock's decision was supported by Joan Harrison, another member of his circle, who felt that the film had been improved. Coleman reluctantly made the necessary edits. When he received news of this, Paramount head Barney Balaban was very vocal about the edits and ordered Hitchcock to \"Put the picture back the way it was.\" As a result, the \"letter writing scene\" remained in the final film.\r\nWriting\r\nThere were three screenwriters involved in the writing of Vertigo. Hitchcock originally hired playwright Maxwell Anderson to write a screenplay, but rejected his work, which was titled Darkling, I Listen, a quotation from Keats's Ode to a Nightingale. According to Charles Barr in his monograph dedicated to Vertigo, \"Anderson was the oldest (at 68), the most celebrated for his stage work and the least committed to cinema, though he had a joint script credit for Hitchcock's preceding film The Wrong Man. He worked on adapting the novel during Hitchcock's absence abroad, and submitted a treatment in September 1956.\"\r\nA second version, written by Alec Coppel, again left the director dissatisfied. The final script was written by Samuel A. Taylor—who was recommended to Hitchcock due to his knowledge of San Francisco— from notes by Hitchcock. Among Taylor's creations was the character of Midge. Taylor attempted to take sole credit for the screenplay, but Coppel protested to the Screen Writers Guild, which determined that both writers were entitled to a credit, but to leave Anderson out of the film writing credits.\r\nCasting\r\nVera Miles, who was under personal contract to Hitchcock and had appeared on both his television show and in his film The Wrong Man, was originally scheduled to play Madeleine. She modeled for an early version of the painting featured in the film. Following delays, including Hitchcock becoming ill with gallbladder problems, Miles became pregnant and had to withdraw from the role. The director declined to postpone shooting and cast Kim Novak as the female lead. By the time Novak had delayed prior film commitments and a vacation promised by Columbia Pictures, the studio that held her contract, Miles had given birth and was available for the film. Nevertheless, Hitchcock proceeded with Novak. Columbia head Harry Cohn agreed to lend Novak to Vertigo if Stewart would agree to co-star with Novak in Bell, Book and Candle, a Columbia production released in December 1958.\r\nFilming\r\nInitial on-site principal photography\r\nVertigo was filmed from September to December 1957. Principal photography began on location in San Francisco in September 1957 under the working title From Among the Dead (the literal translation of D'entre les morts). The film uses extensive location footage of the San Francisco Bay Area, with its steep hills and tall arching bridges. In the driving scenes shot in the city, the main characters' cars are almost always pictured heading down the city's steeply inclined streets. In October 1996, the restored print of Vertigo debuted at the Castro Theatre in San Francisco with a live on-stage introduction by Kim Novak, providing the city a chance to celebrate itself. Visiting the San Francisco film locations has something of a cult following as well as modest tourist appeal. Such a tour is featured in a subsection of Chris Marker's documentary montage Sans Soleil.\r\nThe scene in which Madeleine fell from the tower was filmed at Mission San Juan Bautista, a Spanish mission in San Juan Bautista, California. Associate producer Herbert Coleman's daughter Judy Lanini suggested the mission to Hitchcock as a filming location. A steeple, added sometime after the mission's original construction and secularization, had been demolished following a fire, so Hitchcock added a bell tower using scale models, matte paintings, and trick photography at the Paramount studio in Los Angeles. The original tower was much smaller and less dramatic than the film's version. The tower's staircase was later assembled inside a studio.\r\nList of shooting locations\r\nScottie's apartment (900 Lombard Street) is one block downhill from the \"crookedest street in the world\". The facade of the building remained mostly intact until 2012, when the owner of the property erected a wall enclosing the entrance area on the Lombard side of the building.\r\nThe rooftop chase took place on Taylor Street between 1302 and 1360. 1308 Taylor Street went up for sale in 2016 for $2.2 million.\r\nThe Mission San Juan Bautista, where Madeleine falls from the tower, is a real place, but the tower had to be matted in with a painting using studio effects; Hitchcock had first visited the mission before the tower was torn down due to dry rot, and was reportedly displeased to find it missing when he returned to film his scenes. The original tower was much smaller and less dramatic than the film's version.\r\nThe Carlotta Valdes headstone featured in the film (created by the props department) was left at Mission Dolores. Eventually, the headstone was removed as the mission considered it disrespectful to the dead to house a tourist attraction grave for a fictional person. All other cemeteries in San Francisco were evicted from city limits in 1912, so the screenwriters had no other option but to locate the grave at Mission Dolores.\r\nMadeleine jumps into the sea at Fort Point, underneath the Golden Gate Bridge.\r\nThe gallery where Carlotta's painting appears is the California Palace of the Legion of Honor in San Francisco. The Carlotta Valdes portrait was lost after being removed from the gallery, but many of the other paintings in the background of the portrait scenes are still on view.\r\nWhat purports to be Muir Woods National Monument in the film is in fact Big Basin Redwoods State Park; however, the cutaway of the redwood tree showing its age was copied from one that can still be found at Muir Woods.\r\nThe coastal region where Scottie and Madeleine first kiss is Cypress Point, along the 17 Mile Drive near Pebble Beach. However, the lone tree they kiss next to was a prop brought specially to the location.\r\nThe domed building Scottie and Judy walk past is the Palace of Fine Arts.\r\nCoit Tower appears in many background shots. Hitchcock once said that he included it as a phallic symbol. Also prominent in the background is the tower of the San Francisco Ferry Building.\r\nThe exterior of the sanatorium where Scottie is treated was St. Joseph's Hospital, located at 355 Buena Vista East, across from Buena Vista Park. The hospital, which was not a sanatorium, was closed in 1979 and then converted into condominiums. The building, built in 1928, is on the National Register of Historic Places.\r\nGavin and Madeleine's apartment building \"The Brocklebank\" at 1000 Mason Street on Nob Hill, still looks essentially the same. It is across the street from the Fairmont Hotel, where Hitchcock usually stayed when he visited and where many of the cast and crew stayed during filming. Shots of the surrounding neighborhood feature the Flood Mansion and Grace Cathedral. Barely visible is the Mark Hopkins Hotel, mentioned in an early scene in the movie.\r\nThe \"McKittrick Hotel\" was a privately owned Victorian mansion from the 1880s at Gough and Eddy Streets. It was torn down in 1959 and is now an athletic practice field for Sacred Heart Cathedral Preparatory School. The St. Paulus Lutheran Church, seen across from the mansion, was destroyed in a fire in 1995.\r\nPodesta Baldocchi is the flower shop Madeleine visits as she is being followed by Scottie. The shop's location at the time of filming was 224 Grant Avenue. The Podesta Baldocchi flower shop now does business from a location at 410 Harriet Street.\r\nThe Empire Hotel is a real place, called the York Hotel, and now (as of January 2009) the Hotel Vertigo at 940 Sutter Street. Judy's room was created, but the green neon of the \"Hotel Empire\" sign outside is based on the actual hotel's sign (it was replaced when the hotel was renamed).\r\nErnie's (847 Montgomery St.) was a real restaurant in Jackson Square, one mile from Scottie's apartment. It is no longer operating.\r\nOne short scene shows Union Square at dawn. Pop Leibel's bookstore, the Argosy, was not a real location, but one recreated on the Paramount lot in imitation of the real-life Argonaut Book Store, which still exists near Sutter and Jones.\r\nElster's fictitious Dogpatch shipyard office was filmed at the real (or simulated with mattes) Union Iron Works shipyard, by then the post-WW2 Bethlehem Steel shipyard. Elster's office has a MIssion telephone exchange (MI or 64) prefix, regarding which Midge says \"Why, that's Skid Row\", probably because the city's southern MIssion exchange served all of the south-of-slot (SoMa today) and southern (Mission District) phones, and this shipyard area of course met the description of a Skid Row.\r\nSubsequent studio shooting\r\nFollowing 16 days of location shooting, the production moved to Paramount's studios in Hollywood for two months of filming. Hitchcock preferred to film in studios as he was able to control the environment. Once sufficient location footage had been obtained, interior sets were designed and constructed in the studio.\r\nHitchcock popularized the dolly zoom in this film, leading to the technique's sobriquet, amongst several others, \"the Vertigo effect\". This \"dolly-out/zoom-in\" method involves the camera physically moving away from a subject whilst simultaneously zooming in (a similar effect can be achieved in reverse), so that the subject retains its size in the frame, but the background's perspective changes. Hitchcock used the effect to look down the tower shaft to emphasise its height and Scottie's disorientation. Following difficulties filming the shot on a full-sized set, a model of the tower shaft was constructed, and the dolly zoom was filmed horizontally. The \"special sequence\" (Scottie's nightmare sequence) was designed by artist John Ferren, who also created the painting of Carlotta used in the film.\r\nThe rotating patterns in the title sequence were done by John Whitney, who used a mechanical computer called the M5 gun director, AKA the Kerrison Predictor, which was used during World War II to aim anti-aircraft cannons at moving targets. This made it possible to produce an animated version of shapes (known as Lissajous curves) based on graphs of parametric equations by mathematician Jules Lissajous.\r\nCostume design\r\nHitchcock and costume designer Edith Head used color to heighten emotion. Grey was chosen for Madeleine's suit in an attempt to be psychologically jarring, as it is not usually a blonde's color. In contrast, Novak's character wore a white coat when she visited Scottie's apartment, which Head and Hitchcock considered more natural for a blonde to wear.\r\nAlternative ending\r\nA coda to the film was shot that showed Midge at her apartment, listening to a radio report (voiced by San Francisco TV reporter Dave McElhatton) describing the pursuit of Gavin Elster across Europe. Midge switches the radio off when Scottie enters the room. They then share a drink and look out of the window in silence. Contrary to reports that this scene was filmed to meet foreign censorship needs, this tag ending had originally been demanded by Geoffrey Shurlock of the U.S. Production Code Administration, who had noted: \"It will, of course, be most important that the indication that Elster will be brought back for trial is sufficiently emphasized.\"\r\nHitchcock finally succeeded in fending off most of Shurlock's demands (which included toning down erotic allusions) and had the alternative ending dropped. The footage was discovered in Los Angeles in May 1993, and was added as an alternative ending on the LaserDisc release, and later on DVD and Blu-ray releases.\r\nMusic\r\nThe score was written by Bernard Herrmann. It was conducted by Muir Mathieson and recorded in Europe because there was a musicians' strike in the U.S.\r\nIn a 2004 special issue of the British Film Institute's (BFI) magazine Sight & Sound, director Martin Scorsese described the qualities of Herrmann's famous score:\r\nHitchcock's film is about obsession, which means that it's about circling back to the same moment, again and again ... And the music is also built around spirals and circles, fulfillment and despair. Herrmann really understood what Hitchcock was going for — he wanted to penetrate to the heart of obsession.\r\nGraphic design\r\nGraphic designer Saul Bass used spiral motifs in both the title sequence and the movie poster, emphasizing what the documentary Obsessed with Vertigo calls, \"Vertigo's psychological vortex\". Bass's unconventional framing of actress Audrey Lowell's facial features in the first images of the titles was indebted to Bauhaus photography. According to her 1997 Guardian interview Kim Novak wanted to do the opening title sequence but Harry Cohn insisted Hitchcock pay full rate for the single day's shooting and so another face was chosen.\r\nRelease\r\nVertigo premiered in San Francisco on May 9, 1958, at the Stage Door Theater at Mason and Geary (now the August Hall nightclub). While Vertigo did break even upon its original release, earning $3.2 million in North American distributor rentals against its $2,479,000 cost, it earned significantly less than other Hitchcock productions.\r\nRestoration and re-release\r\nIn October 1983, Rear Window and Vertigo were the first two films reissued by Universal Pictures after the studio acquired the rights from Hitchcock's estate. These two films and three others – The Man Who Knew Too Much (1956), The Trouble with Harry (1955), and Rope (1948) – had been kept out of distribution by Hitchcock since 1968. Cleaning and restoration were performed on each film when new 35 mm prints were struck.\r\nIn 1996, the film was given a lengthy and controversial restoration by Robert A. Harris and James C. Katz and re-released to theaters. The new print featured restored color and newly created audio, using modern sound effects mixed in DTS digital surround sound. In October 1996, the restored Vertigo premiered at the Castro Theatre in San Francisco, with Kim Novak and Patricia Hitchcock in person. At this screening, the film was exhibited for the first time in DTS and 70mm, a format with a similar frame size to the VistaVision system in which it was originally shot.\r\nSignificant color correction was necessary because of the fading of original negatives. In some cases a new negative was created from the silver separation masters, but in many instances this was impossible because of differential separation shrinkage, and because the 1958 separations were poorly made. Separations used three individual films: one for each of the primary colors. In the case of Vertigo, these had shrunk in different and erratic proportions, making re-alignment impossible.\r\nAs such, significant amounts of computer assisted coloration were necessary. Although the results are not noticeable on viewing the film, some elements were as many as eight generations away from the original negative, in particular the entire \"Judy's Apartment\" sequence, perhaps the most pivotal sequence in the entire film. When such large portions of re-creation become necessary, then the danger of artistic license by the restorers becomes an issue, and the restorers received some criticism for their re-creation of colors that allegedly did not honor the director's and cinematographer's intentions. The restoration team argued that they did research on the colors used in the original locations, cars, wardrobe, and skin tones. One breakthrough moment came when the Ford Motor Company supplied a well-preserved green paint sample for a car used in the film. As the use of the color green in the film has artistic importance, matching a shade of green was a stroke of luck for restoration and provided a reference shade.\r\nWhen restoring the sound, Harris and Katz wanted to stay as close as possible to the original, and had access to the original music recordings that had been stored in the vaults at Paramount. However, as the project demanded a new 6-channel DTS stereo soundtrack, it was necessary to re-record some sound effects using the Foley process. The soundtrack was remixed at the Alfred Hitchcock Theatre at Universal Studios. Aware that the film had a considerable following, the restoration team knew that they were under particular pressure to restore the film as accurately as possible. To achieve this, they used Hitchcock's original dubbing notes for guidance of how the director wanted the film to sound in 1958. Harris and Katz sometimes added extra sound effects to camouflage defects in the old soundtrack; i.e., \"hisses, pops, and bangs\". In particular, they added extra seagull cries and a foghorn to the scene at Cypress Point. The new mix has also been accused of putting too much emphasis on the score at the expense of the sound effects.\r\nHome media\r\nIn 1996, director Harrison Engle produced a documentary about the making of Hitchcock's classic, Obsessed with Vertigo. Narrated by Roddy McDowall, the film played on American Movie Classics, and has since been included with DVD versions of Vertigo. Surviving members of the cast and crew participated, along with Martin Scorsese and Patricia Hitchcock. Engle first visited the Vertigo shooting locations in the summer of 1958, just months after completion of the film.\r\nVertigo was first released on DVD in March 1998. On October 4, 2011, the film was re-issued on DVD by Universal Pictures Home Entertainment as part of the Alfred Hitchcock: The Essentials Collection. Subsequently, the film was released on Blu-ray on September 25, 2012, as part of the Alfred Hitchcock: The Masterpiece Collection. In May 2014, the film was re-released as a stand-alone Blu-ray edition. Some home video releases, such as the 2005 Hitchcock Masterpiece Collection DVD set, contain the original mono track as an option.\r\nIn October 2014, a new 4K restoration was presented at the Castro Theatre in San Francisco. This version gives credit to Harris and Katz at the end of the film, and thanks them for providing some previously unknown stereo soundtracks. This version, however, removes some of the \"excessive\" Foley sound that was added in the 1996 restoration.\r\nReception\r\nContemporaneous reception\r\nThe initial reception expressed in film reviews for Vertigo was mixed. Variety wrote the film showed Hitchcock's \"mastery\", but felt the film was \"too long and slow\" for \"what is basically only a psychological murder mystery\". Similarly, Philip K. Scheuer of the Los Angeles Times admired the scenery, but found the plot took \"too long to unfold\" and felt it \"bogs down in a maze of detail\". Scholar Dan Auiler says that this review \"sounded the tone that most popular critics would take with the film\". However, the Los Angeles Examiner loved it, admiring the \"excitement, action, romance, glamor and crazy, off-beat love story\". The New York Times film critic Bosley Crowther also gave Vertigo a positive review by explaining that \" secret is so clever, even though it is devilishly far-fetched.\" Richard L. Coe of The Washington Post praised the film as a \"wonderful weirdie,\" writing that \"Hitchcock has even more fun than usual with trick angles, floor shots and striking use of color. More than once he gives us critical scenes in long shots establishing how he's going to get away with a couple of story tricks.\" John McCarten of The New Yorker wrote Hitchcock \"has never before indulged in such farfetched nonsense.\"\r\nContemporaneous response in England was summarized by Charles Barr in his monograph on Vertigo stating: \"In England, the reception was if anything rather less friendly. Of the 28 newspaper and magazine reviews that I have looked at, six are, with reservations, favourable, nine are very mixed, and 13 almost wholly negative. Common to all of these reviews is a lack of sympathy with the basic structure and drive of the picture. Even the friendlier ones single out for praise elements that seem, from today's perspective, to be marginal virtues and incidental pleasures – the 'vitality' of the supporting performances (Dilys Powell in The Sunday Times), the slickness with which the car sequences are put together (Isobel Quibley in The Spectator)\".\r\nIn France, Éric Rohmer noted in Cahiers du Cinéma that \"Vertigo, so they say, repelled Americans. French critics, on the contrary, seem to be giving it a warm welcome.\" Praising the film's formal technique, he wrote that \"ideas and forms follow the same road, and it is because the form is pure, beautiful, rigorous, astonishingly rich, and free that we can say that Hitchcock’s films, with Vertigo at their head, are about ideas, in the noble, platonic sense of the word.\"\r\nAdditional reasons for the mixed response initially were that Hitchcock fans were not pleased with his departure from the romantic-thriller territory of earlier films, and that the mystery was solved with one-third of the film left to go. Orson Welles disliked the film, telling his friend, director Henry Jaglom, that the movie was \"worse\" than Rear Window, another film that Welles disliked. In an interview with François Truffaut, Hitchcock stated that Vertigo was one of his favourite films, with some reservations. Hitchcock blamed the film's failure on the 49-year-old Stewart looking too old to play a convincing love interest for the 24-year-old Kim Novak.\r\nA young Martin Scorsese viewed the film with his friends during its original run in New York City, and later recalled that \"even though the film was not well received at the time... we responded to the film very strongly. didn't know why... but we really went with the picture.\"\r\nHitchcock and Stewart received awards at the San Sebastián International Film Festival, including a Silver Seashell for Best Director (tied with Mario Monicelli for Big Deal on Madonna Street (aka Persons Unknown)) and Best Actor (also tied, with Kirk Douglas in The Vikings). The film was nominated for two Academy Awards, in the technical categories Best Art Direction – Black-and-White or Color (Hal Pereira, Henry Bumstead, Samuel M. Comer, Frank McKelvy) and Best Sound (George Dutton).\r\nRe-evaluation\r\nOver time the film has been re-evaluated by film critics and has moved higher in esteem in most critics' opinions. Every ten years since 1952, the British Film Institute's film magazine, Sight & Sound, has asked the world's leading film critics to compile a list of the 10 greatest films of all time. In the 1962 and 1972 polls, Vertigo was not among the top 10 films in voting. Only in 1982 did Vertigo enter the list, and then in 7th place. By 1992 it had advanced to 4th place, by 2002 to 2nd, and in 2012 to 1st place in both the crime genre, and overall, ahead of Citizen Kane in 2nd place; in 2022, the Sight & Sound poll ranked Vertigo 2nd place. In the 2012 Sight & Sound director's poll of the greatest films ever made Vertigo was ranked 7th. In the earlier 2002 version of the list the film ranked 6th among directors. In 2022 edition of the list the film ranked 6th in the director's poll. In 1998 Time Out conducted a poll and Vertigo was voted the 5th greatest film of all time. The Village Voice ranked Vertigo at No. 3 in its Top 250 \"Best Films of the Century\" list in 1999, based on a poll of critics. Entertainment Weekly voted it the 19th Greatest film of all time in 1999. In January 2002, the film was voted at No. 96 on the list of the \"Top 100 Essential Films of All Time\" by the National Society of Film Critics. In 2009, the film was ranked at No. 10 on Japanese film magazine Kinema Junpo's Top 10 Non-Japanese Films of All Time list. In 2022, Time Out magazine ranked the film at No.15 on their list of \"The 100 best thriller films of all time\".\r\nCommenting upon the 2012 results, the magazine's editor Nick James said that Vertigo was \"the ultimate critics' film. It is a dream-like film about people who are not sure who they are but who are busy reconstructing themselves and each other to fit a kind of cinema ideal of the ideal soul-mate.\" In recent years, critics have noted that the casting of James Stewart as a character who becomes disturbed and obsessive ultimately enhances the film's unconventionality and effectiveness as suspense, since Stewart had previously been known as an actor of warmhearted roles.\r\nAlready in the 1960s, the French Cahiers du cinéma critics began re-evaluating Hitchcock as a serious artist, rather than just a populist showman. The film ranked 8th on Cahiers du Cinéma's Top 10 Films of the Year List in 1959. However, even François Truffaut's important 1962 book of interviews with Hitchcock (not published in English until 1967) devotes only a few pages to Vertigo. Dan Auiler has suggested that the real beginning of Vertigo's rise in adulation was the British-Canadian scholar Robin Wood's Hitchcock's Films (1968), which calls the film \"Hitchcock's masterpiece to date and one of the four or five most profound and beautiful films the cinema has yet given us\".\r\nAdding to its mystique was the fact that Vertigo was one of five Hitchcock-owned films removed from circulation in 1973. When Vertigo was re-released in theaters in October 1983, and then on home video in October 1984, it achieved an impressive commercial success and laudatory reviews. Similarly adulatory reviews were written for the October 1996 showing of a restored print in 70mm and DTS sound at the Castro Theater in San Francisco. In his 1996 review of the film, film critic Roger Ebert gave the film four stars out of four and included it in his Great Movies list.\r\nA small minority of critics have expressed dissenting opinions. In his 2004 book Blockbuster, British film critic Tom Shone suggested that Vertigo's critical re-evaluation has led to excessive praise, and argued for a more measured response. Faulting Sight & Sound for \"perennially\" putting the film on the list of best-ever films, he wrote, \"Hitchcock is a director who delights in getting his plot mechanisms buffed up to a nice humming shine, and so the Sight and Sound team praise the one film of his in which this is not the case – it's all loose ends and lopsided angles, its plumbing out on display for the critic to pick over at his leisure.\"\r\nIn 1989, Vertigo was recognized as a \"culturally, historically and aesthetically significant\" film by the United States Library of Congress and selected for preservation in the National Film Registry in the first year of the registry's voting.\r\nIn 2005, Vertigo came in second (to Goodfellas) in British magazine Total Film's book 100 Greatest Movies of All Time. In 2008, an Empire poll of readers, actors, and critics named it the 40th greatest movie ever made. The film was Voted at No. 8 on the list of \"100 Greatest Films\" by the prominent French magazine Cahiers du cinéma in 2008. In 2010, The Guardian ranked it as the 3rd-best crime film of all time. Vertigo ranked 3rd in BBC's 2015 list of the 100 greatest American films.\r\nOn review aggregator Rotten Tomatoes, the film holds an approval rating of 93% based on 87 reviews, with an average rating of 8.90/10. The website's critics consensus reads,\"An unpredictable scary thriller that doubles as a mournful meditation on love, loss, and human comfort\". As of January 2021, Vertigo is one of only eight films with a 100 (perfect) score on the movie critic aggregator website, Metacritic (two other Hitchcock films, Notorious and Rear Window, are also on the list).\r\nThe most recent edition of the American Film Institute's top 100 films of all-time, released in 2007, placed Vertigo at #9 up 52 positions from its placement at #61 in the original 1998 listing.\r\nAmerican Film Institute recognition\r\nAFI's 100 Years...100 Movies (1998) #61\r\nAFI's 100 Years...100 Thrills (2001) #18\r\nAFI's 100 Years...100 Passions (2002) #18\r\nAFI's 100 Years of Film Scores (2005) #12\r\nAFI's 100 Years...100 Movies (10th Anniversary Edition) (2007) #9\r\nAFI's 10 Top 10 (2008) #1 Mystery\r\nThe San Francisco locations have become celebrated amongst the film's fans, with organised tours across the area. In March 1997, the cultural French magazine Les Inrockuptibles published a special issue about Vertigo's locations in San Francisco, Dans le décor, which lists and describes all actual locations.\r\nDirector Martin Scorsese has listed Vertigo as one of his favorite films of all time.\r\nAlong with the renewed public appreciation of the movie, it is receiving increased academic attention; The Annual International Vertigo conference, for example, showcases recent scholarship, as in its 2018 conference at Trinity College Dublin.\r\nCritical works on Vertigo\r\nVariety review from 1958\r\nRobin Wood's chapter on \"Vertigo\" in Hitchcock's Films\r\nMolly Haskell's essay, \"With Paintbrush and Mirror: 'Vertigo' & 'As You Desire Me'\" in The Village Voice\r\nLaura Mulvey's Visual Pleasure and Narrative Cinema, popularizing the concept of the male gaze\r\nRoger Ebert's 1996 Review\r\nClassification as film noir\r\nCritical opinion is divided on whether Vertigo should be considered a film noir. Some consider it a film noir on the basis of plot and tone and various motifs, despite its having a modernist graphic design typical of the 1950s and a more modern set design, which would otherwise remove it from the category of film noir. Others say the combination of color and the specificity of Hitchcock's vision exclude it from the category. On the general issue of noir and visual style, see Ballinger and Graydon (2007), p. 31. Christopher (1998) and Silver and Ward (1992), for instance, do not include Vertigo in their filmographies. Ottoson (1981) does not include Vertigo in his canon. By contrast, Hirsch (2001) describes Vertigo as among those Hitchcock films that are \"richly, demonstrably noir\" (p. 139).\r\nDerivative works\r\nKalangarai Vilakkam, a 1965 Tamil film adaptation of Vertigo.\r\nOne on Top of the Other, a 1969 giallo film directed by Lucio Fulci, is heavily influenced by Vertigo.\r\nObsession, a 1976 film by Brian De Palma, is heavily influenced by Vertigo, while his 1984 thriller Body Double combines the plot elements of both Vertigo and Rear Window.\r\nHigh Anxiety, a 1977 film by Mel Brooks, is a parody of suspense films directed by Alfred Hitchcock, but leans on Vertigo in particular.\r\nChris Marker's 1983 video-essay Sans Soleil makes reference to the movie, declaring it the only film \"capable of portraying impossible memory\" over footage of Vertigo's shooting locations and stills from the film.\r\nHarvey Danger's song \"Carlotta Valdez,\" from the 1997 album Where Have All the Merrymakers Gone?, summarizes the plot of the film.\r\nJoseph Kahn's 1997 music video for Faith No More's \"Last Cup of Sorrow\" is a parody of Vertigo with singer Mike Patton in the Scottie Ferguson role and Jennifer Jason Leigh in the Madeleine/Judy role.\r\nSuzhou River, a 2000 Chinese film by Lou Ye which critics saw as an homage to Vertigo.\r\nMulholland Drive, a 2001 film written and directed by David Lynch (who cited Vertigo as an influence), uses a similar double-identity theme involving a blonde woman in a grey suit skirt in grave danger, and the film noir premise of tragic love, betrayal and murder that drove Hitchcock's film.\r\nThe Testament of Judith Barton, a 2012 novel by Wendy Powers and Robin McLeod, tells the back-story of Kim Novak's character.\r\nAlfred Hitchcock – Vertigo, an adventure game by developer Pendulo Studios and publisher Microids.\r\nFrancesco Ferrari Mines the Mission: A Homage to Vertigo, an original 2018 novel by Joseph Covino Jr., third in the San Francisco-set Francesco Ferrari private detective series, takes its template from both the Vertigo novel and film.\r\nPotential remake\r\nIn March 2023, it was reported that Paramount Pictures acquired the remake rights to the film with Steven Knight set to write the script, and Robert Downey Jr. set to star for Davis Entertainment and Team Downey.",
    "html": "<p>Vertigo is a 1958 American psychological thriller film directed and produced by Alfred Hitchcock. The story was based on the 1954 novel D'entre les morts (From Among the Dead) by Boileau-Narcejac. The screenplay was written by Alec Coppel and Samuel A. Taylor. The film stars James Stewart as former police detective John \"Scottie\" Ferguson, who has retired because an incident in the line of duty has caused him to develop acrophobia (an extreme fear of heights) and vertigo, a false sense of rotational movement. Scottie is hired by an acquaintance, Gavin Elster, as a private investigator to follow Gavin's wife, Madeleine (Kim Novak), who is behaving strangely.</p><p>The film was shot on location in the city of San Francisco, California, as well as in Mission San Juan Bautista, Big Basin Redwoods State Park, Cypress Point on 17-Mile Drive, and Paramount Studios in Hollywood. It is the first film to use the dolly zoom, an in-camera effect that distorts perspective to create disorientation, to convey Scottie's acrophobia. As a result of its use in this film, the effect is often referred to as \"the Vertigo effect\". In 1996, the film underwent a major restoration to create a new 70 mm print and DTS soundtrack.</p><p>Vertigo received mixed reviews upon initial release, but is now cited as a classic Hitchcock film and one of the greatest films ever made. In 1989, it was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\". The film appears repeatedly in polls of the best films by the American Film Institute, including a 2007 ranking as the ninth-greatest American movie ever. Attracting significant scholarly attention, it replaced Citizen Kane (1941) as the greatest film ever made in The Sight & Sound Greatest Films of All Time 2012 poll, and came in 2nd in 2022.</p><br/><h3>Plot</h3><p>After a rooftop chase in which a fellow policeman falls to his death, San Francisco detective John \"Scottie\" Ferguson retires out of fear of heights and vertigo. Scottie tries to conquer his fear, but his ex-fiancée, underwear designer Marjorie 'Midge' Wood, says that another severe emotional shock may be the only cure.</p><p>Gavin Elster, an acquaintance from college, asks Scottie to follow his wife, Madeleine, claiming that she has been behaving strangely and her mental state is abnormal. Scottie reluctantly agrees and follows Madeleine to a florist, where she buys a bouquet, to the Mission San Francisco de Asís and the grave of Carlotta Valdes (1831–1857), and to the Legion of Honor art museum, where she gazes at the Portrait of Carlotta. He watches her enter the McKittrick Hotel, but upon investigation, she does not seem to be there.</p><p>A local historian explains that Carlotta Valdes committed suicide: she had been the mistress of a wealthy married man and borne his child; the otherwise childless man kept the child and cast Carlotta aside. Gavin reveals that Carlotta (who he fears is possessing Madeleine) is Madeleine's great-grandmother, although Madeleine has no knowledge of this and does not remember the places she has visited. Scottie tails Madeleine to Fort Point and when she leaps into the bay, he rescues her.</p><p>The next day, Madeleine stops to deliver a letter of gratitude to Scottie, and they decide to spend the day together. They travel to Muir Woods and Cypress Point on 17-Mile Drive, where Madeleine runs down towards the ocean. Scottie grabs her and they embrace. The following day, Madeleine visits Scottie and recounts a nightmare. Scottie identifies its setting as Mission San Juan Bautista, the childhood home of Carlotta. He drives her there and they express their love for each other. Madeleine suddenly runs into the church and up the bell tower. Scottie, halted on the steps by his acrophobia, sees Madeleine plunge to her death.</p><p>The death is declared a suicide. Gavin does not fault Scottie, but Scottie breaks down, becomes clinically depressed and is sent to a sanatorium, almost catatonic. Following his release, Scottie frequents the places that Madeleine visited, often imagining that he sees her. One day, he notices a woman on the street who reminds him of Madeleine, despite her different appearance. Scottie follows her to her hotel room, where she identifies herself as Judy Barton, from Salina, Kansas.</p><p>Judy has a flashback revealing that she was the person Scottie knew as \"Madeleine Elster.\" She was impersonating Gavin's wife in an elaborate murder scheme. Judy drafts a letter to Scottie explaining her involvement: Gavin deliberately took advantage of Scottie's acrophobia to substitute his wife's freshly killed body in the apparent \"suicide jump.\" However, Judy rips up the letter and continues the charade because she loves Scottie.</p><p>They begin seeing each other, but Scottie remains obsessed with \"Madeleine.\" He asks Judy to change her clothes and dye her hair to resemble Madeleine. After Judy complies, hoping that they may finally find happiness together, he notices her wearing the necklace portrayed in Carlotta's painting. Scottie realizes the truth and insists on driving Judy back again to the Mission.</p><p>There, he tells her he must re-enact the event that led to his madness, admitting he now understands that \"Madeleine\" and Judy are the same person, and that Judy was Gavin's mistress before being cast aside, just as Carlotta was. Scottie forces her up the bell tower and makes her admit her deceit. Scottie reaches the top, finally conquering his acrophobia. Judy confesses that Gavin paid her to impersonate a \"possessed\" Madeleine. Judy begs Scottie to forgive her because she loves him. He embraces Judy, but a shadowy figure — actually a nun investigating the noise — rises from the tower's trapdoor, startling her. Judy suddenly lunges backward and accidentally falls to her death. Scottie, bereaved once again but cured of his fear of heights, stands on the ledge while the nun rings the mission bell.</p><br/><h3>Cast</h3><ul><li>James Stewart as John \"Scottie\" Ferguson</li><li>Kim Novak as Judy Barton / Madeleine Elster</li><li>Tom Helmore as Gavin Elster</li><li>Barbara Bel Geddes as Marjorie \"Midge\" Wood</li><li>Henry Jones as the coroner</li><li>Raymond Bailey as Scottie's doctor</li><li>Ellen Corby as the manager of the McKittrick Hotel</li><li>Konstantin Shayne as bookstore owner Pop Leibel</li><li>Lee Patrick as the car owner mistaken for Madeleine</li></ul><p>Alfred Hitchcock makes his customary cameo appearance walking in the street in a gray suit and carrying a trumpet case.</p><br/><h3>Themes and interpretations</h3><p>Charles Barr in his monograph dedicated to the study of Vertigo has stated that the central theme of the film is psychological obsession, concentrating in particular on Scottie as obsessed with the women in his life. As Barr states in his book, \"This story of a man who develops a romantic obsession with the image of an enigmatic woman has commonly been seen, by his colleagues as well as by critics and biographers, as one that engaged Hitchcock in an especially profound way; and it has exerted a comparable fascination on many of its viewers. After first seeing it as a teenager in 1958, Donald Spoto had gone back for 26 more viewings by the time he wrote The Art of Alfred Hitchcock in 1976. In a 1996 magazine article, Geoffrey O'Brien cites other cases of 'permanent fascination' with Vertigo, and then casually reveals that he himself, starting at age 15, has seen it 'at least thirty times'.\"</p><p>Critics have interpreted Vertigo variously as \"a tale of male aggression and visual control; as a map of female Oedipal trajectory; as a deconstruction of the male construction of femininity and of masculinity itself; as a stripping bare of the mechanisms of directorial, Hollywood studio and colonial oppression; and as a place where textual meanings play out in an infinite regress of self-reflexivity.\" Critic James F. Maxfield has suggested that Vertigo can be interpreted as a variant on the Ambrose Bierce short story \"An Occurrence at Owl Creek Bridge\" (1890), and that the main narrative of the film is actually imagined by Scottie, whom we see dangling from a building at the end of the opening rooftop chase.</p><br/><h3>Production</h3><h4>Development</h4><p>The screenplay of Vertigo is an adaptation of the French novel D'entre les morts (From Among the Dead) by Pierre Boileau and Thomas Narcejac. Hitchcock had attempted to buy the rights to the previous novel by the same authors, Celle qui n'était plus (She Who Was No More), but he failed, and it was made instead by Henri-Georges Clouzot as Les Diaboliques. Although François Truffaut once suggested that D'entre les morts was specifically written for Hitchcock by Boileau and Narcejac, Narcejac subsequently denied that this was their intention. However, Hitchcock's interest in their work meant that Paramount Pictures commissioned a synopsis of D'entre les morts in 1954, before it had even been translated into English (it appeared in translation as The Living and the Dead in 1956).</p><p>In the book, Judy's involvement in Madeleine's death was not revealed until the denouement. At the script stage, Hitchcock suggested revealing the secret two-thirds of the way through the film, so that the audience would understand Judy's mental dilemma. After the first preview, Hitchcock was unsure whether to keep the \"letter writing scene\" or not. He decided to remove it. Herbert Coleman, Vertigo's associate producer and a frequent collaborator with Hitchcock, felt the removal was a mistake. However, Hitchcock said, \"Release it just like that.\" James Stewart, acting as mediator, said to Coleman, \"Herbie, you shouldn't get so upset with Hitch. The picture's not that important.\" Hitchcock's decision was supported by Joan Harrison, another member of his circle, who felt that the film had been improved. Coleman reluctantly made the necessary edits. When he received news of this, Paramount head Barney Balaban was very vocal about the edits and ordered Hitchcock to \"Put the picture back the way it was.\" As a result, the \"letter writing scene\" remained in the final film.</p><h4>Writing</h4><p>There were three screenwriters involved in the writing of Vertigo. Hitchcock originally hired playwright Maxwell Anderson to write a screenplay, but rejected his work, which was titled Darkling, I Listen, a quotation from Keats's Ode to a Nightingale. According to Charles Barr in his monograph dedicated to Vertigo, \"Anderson was the oldest (at 68), the most celebrated for his stage work and the least committed to cinema, though he had a joint script credit for Hitchcock's preceding film The Wrong Man. He worked on adapting the novel during Hitchcock's absence abroad, and submitted a treatment in September 1956.\"</p><p>A second version, written by Alec Coppel, again left the director dissatisfied. The final script was written by Samuel A. Taylor—who was recommended to Hitchcock due to his knowledge of San Francisco— from notes by Hitchcock. Among Taylor's creations was the character of Midge. Taylor attempted to take sole credit for the screenplay, but Coppel protested to the Screen Writers Guild, which determined that both writers were entitled to a credit, but to leave Anderson out of the film writing credits.</p><h4>Casting</h4><p>Vera Miles, who was under personal contract to Hitchcock and had appeared on both his television show and in his film The Wrong Man, was originally scheduled to play Madeleine. She modeled for an early version of the painting featured in the film. Following delays, including Hitchcock becoming ill with gallbladder problems, Miles became pregnant and had to withdraw from the role. The director declined to postpone shooting and cast Kim Novak as the female lead. By the time Novak had delayed prior film commitments and a vacation promised by Columbia Pictures, the studio that held her contract, Miles had given birth and was available for the film. Nevertheless, Hitchcock proceeded with Novak. Columbia head Harry Cohn agreed to lend Novak to Vertigo if Stewart would agree to co-star with Novak in Bell, Book and Candle, a Columbia production released in December 1958.</p><h4>Filming</h4><h4>Initial on-site principal photography</h4><p>Vertigo was filmed from September to December 1957. Principal photography began on location in San Francisco in September 1957 under the working title From Among the Dead (the literal translation of D'entre les morts). The film uses extensive location footage of the San Francisco Bay Area, with its steep hills and tall arching bridges. In the driving scenes shot in the city, the main characters' cars are almost always pictured heading down the city's steeply inclined streets. In October 1996, the restored print of Vertigo debuted at the Castro Theatre in San Francisco with a live on-stage introduction by Kim Novak, providing the city a chance to celebrate itself. Visiting the San Francisco film locations has something of a cult following as well as modest tourist appeal. Such a tour is featured in a subsection of Chris Marker's documentary montage Sans Soleil.</p><p>The scene in which Madeleine fell from the tower was filmed at Mission San Juan Bautista, a Spanish mission in San Juan Bautista, California. Associate producer Herbert Coleman's daughter Judy Lanini suggested the mission to Hitchcock as a filming location. A steeple, added sometime after the mission's original construction and secularization, had been demolished following a fire, so Hitchcock added a bell tower using scale models, matte paintings, and trick photography at the Paramount studio in Los Angeles. The original tower was much smaller and less dramatic than the film's version. The tower's staircase was later assembled inside a studio.</p><h4>List of shooting locations</h4><ul><li>Scottie's apartment (900 Lombard Street) is one block downhill from the \"crookedest street in the world\". The facade of the building remained mostly intact until 2012, when the owner of the property erected a wall enclosing the entrance area on the Lombard side of the building.</li><li>The rooftop chase took place on Taylor Street between 1302 and 1360. 1308 Taylor Street went up for sale in 2016 for $2.2 million.</li><li>The Mission San Juan Bautista, where Madeleine falls from the tower, is a real place, but the tower had to be matted in with a painting using studio effects; Hitchcock had first visited the mission before the tower was torn down due to dry rot, and was reportedly displeased to find it missing when he returned to film his scenes. The original tower was much smaller and less dramatic than the film's version.</li><li>The Carlotta Valdes headstone featured in the film (created by the props department) was left at Mission Dolores. Eventually, the headstone was removed as the mission considered it disrespectful to the dead to house a tourist attraction grave for a fictional person. All other cemeteries in San Francisco were evicted from city limits in 1912, so the screenwriters had no other option but to locate the grave at Mission Dolores.</li><li>Madeleine jumps into the sea at Fort Point, underneath the Golden Gate Bridge.</li><li>The gallery where Carlotta's painting appears is the California Palace of the Legion of Honor in San Francisco. The Carlotta Valdes portrait was lost after being removed from the gallery, but many of the other paintings in the background of the portrait scenes are still on view.</li><li>What purports to be Muir Woods National Monument in the film is in fact Big Basin Redwoods State Park; however, the cutaway of the redwood tree showing its age was copied from one that can still be found at Muir Woods.</li><li>The coastal region where Scottie and Madeleine first kiss is Cypress Point, along the 17 Mile Drive near Pebble Beach. However, the lone tree they kiss next to was a prop brought specially to the location.</li><li>The domed building Scottie and Judy walk past is the Palace of Fine Arts.</li><li>Coit Tower appears in many background shots. Hitchcock once said that he included it as a phallic symbol. Also prominent in the background is the tower of the San Francisco Ferry Building.</li><li>The exterior of the sanatorium where Scottie is treated was St. Joseph's Hospital, located at 355 Buena Vista East, across from Buena Vista Park. The hospital, which was not a sanatorium, was closed in 1979 and then converted into condominiums. The building, built in 1928, is on the National Register of Historic Places.</li><li>Gavin and Madeleine's apartment building \"The Brocklebank\" at 1000 Mason Street on Nob Hill, still looks essentially the same. It is across the street from the Fairmont Hotel, where Hitchcock usually stayed when he visited and where many of the cast and crew stayed during filming. Shots of the surrounding neighborhood feature the Flood Mansion and Grace Cathedral. Barely visible is the Mark Hopkins Hotel, mentioned in an early scene in the movie.</li><li>The \"McKittrick Hotel\" was a privately owned Victorian mansion from the 1880s at Gough and Eddy Streets. It was torn down in 1959 and is now an athletic practice field for Sacred Heart Cathedral Preparatory School. The St. Paulus Lutheran Church, seen across from the mansion, was destroyed in a fire in 1995.</li><li>Podesta Baldocchi is the flower shop Madeleine visits as she is being followed by Scottie. The shop's location at the time of filming was 224 Grant Avenue. The Podesta Baldocchi flower shop now does business from a location at 410 Harriet Street.</li><li>The Empire Hotel is a real place, called the York Hotel, and now (as of January 2009) the Hotel Vertigo at 940 Sutter Street. Judy's room was created, but the green neon of the \"Hotel Empire\" sign outside is based on the actual hotel's sign (it was replaced when the hotel was renamed).</li><li>Ernie's (847 Montgomery St.) was a real restaurant in Jackson Square, one mile from Scottie's apartment. It is no longer operating.</li><li>One short scene shows Union Square at dawn. Pop Leibel's bookstore, the Argosy, was not a real location, but one recreated on the Paramount lot in imitation of the real-life Argonaut Book Store, which still exists near Sutter and Jones.</li><li>Elster's fictitious Dogpatch shipyard office was filmed at the real (or simulated with mattes) Union Iron Works shipyard, by then the post-WW2 Bethlehem Steel shipyard. Elster's office has a MIssion telephone exchange (MI or 64) prefix, regarding which Midge says \"Why, that's Skid Row\", probably because the city's southern MIssion exchange served all of the south-of-slot (SoMa today) and southern (Mission District) phones, and this shipyard area of course met the description of a Skid Row.</li></ul><h4>Subsequent studio shooting</h4><p>Following 16 days of location shooting, the production moved to Paramount's studios in Hollywood for two months of filming. Hitchcock preferred to film in studios as he was able to control the environment. Once sufficient location footage had been obtained, interior sets were designed and constructed in the studio.</p><p>Hitchcock popularized the dolly zoom in this film, leading to the technique's sobriquet, amongst several others, \"the Vertigo effect\". This \"dolly-out/zoom-in\" method involves the camera physically moving away from a subject whilst simultaneously zooming in (a similar effect can be achieved in reverse), so that the subject retains its size in the frame, but the background's perspective changes. Hitchcock used the effect to look down the tower shaft to emphasise its height and Scottie's disorientation. Following difficulties filming the shot on a full-sized set, a model of the tower shaft was constructed, and the dolly zoom was filmed horizontally. The \"special sequence\" (Scottie's nightmare sequence) was designed by artist John Ferren, who also created the painting of Carlotta used in the film.</p><p>The rotating patterns in the title sequence were done by John Whitney, who used a mechanical computer called the M5 gun director, AKA the Kerrison Predictor, which was used during World War II to aim anti-aircraft cannons at moving targets. This made it possible to produce an animated version of shapes (known as Lissajous curves) based on graphs of parametric equations by mathematician Jules Lissajous.</p><h4>Costume design</h4><p>Hitchcock and costume designer Edith Head used color to heighten emotion. Grey was chosen for Madeleine's suit in an attempt to be psychologically jarring, as it is not usually a blonde's color. In contrast, Novak's character wore a white coat when she visited Scottie's apartment, which Head and Hitchcock considered more natural for a blonde to wear.</p><h4>Alternative ending</h4><p>A coda to the film was shot that showed Midge at her apartment, listening to a radio report (voiced by San Francisco TV reporter Dave McElhatton) describing the pursuit of Gavin Elster across Europe. Midge switches the radio off when Scottie enters the room. They then share a drink and look out of the window in silence. Contrary to reports that this scene was filmed to meet foreign censorship needs, this tag ending had originally been demanded by Geoffrey Shurlock of the U.S. Production Code Administration, who had noted: \"It will, of course, be most important that the indication that Elster will be brought back for trial is sufficiently emphasized.\"</p><p>Hitchcock finally succeeded in fending off most of Shurlock's demands (which included toning down erotic allusions) and had the alternative ending dropped. The footage was discovered in Los Angeles in May 1993, and was added as an alternative ending on the LaserDisc release, and later on DVD and Blu-ray releases.</p><h4>Music</h4><p>The score was written by Bernard Herrmann. It was conducted by Muir Mathieson and recorded in Europe because there was a musicians' strike in the U.S.</p><p>In a 2004 special issue of the British Film Institute's (BFI) magazine Sight & Sound, director Martin Scorsese described the qualities of Herrmann's famous score:</p><blockquote>Hitchcock's film is about obsession, which means that it's about circling back to the same moment, again and again ... And the music is also built around spirals and circles, fulfillment and despair. Herrmann really understood what Hitchcock was going for — he wanted to penetrate to the heart of obsession.</blockquote><h4>Graphic design</h4><p>Graphic designer Saul Bass used spiral motifs in both the title sequence and the movie poster, emphasizing what the documentary Obsessed with Vertigo calls, \"Vertigo's psychological vortex\". Bass's unconventional framing of actress Audrey Lowell's facial features in the first images of the titles was indebted to Bauhaus photography. According to her 1997 Guardian interview Kim Novak wanted to do the opening title sequence but Harry Cohn insisted Hitchcock pay full rate for the single day's shooting and so another face was chosen.</p><br/><h3>Release</h3><p>Vertigo premiered in San Francisco on May 9, 1958, at the Stage Door Theater at Mason and Geary (now the August Hall nightclub). While Vertigo did break even upon its original release, earning $3.2 million in North American distributor rentals against its $2,479,000 cost, it earned significantly less than other Hitchcock productions.</p><h4>Restoration and re-release</h4><p>In October 1983, Rear Window and Vertigo were the first two films reissued by Universal Pictures after the studio acquired the rights from Hitchcock's estate. These two films and three others – The Man Who Knew Too Much (1956), The Trouble with Harry (1955), and Rope (1948) – had been kept out of distribution by Hitchcock since 1968. Cleaning and restoration were performed on each film when new 35 mm prints were struck.</p><p>In 1996, the film was given a lengthy and controversial restoration by Robert A. Harris and James C. Katz and re-released to theaters. The new print featured restored color and newly created audio, using modern sound effects mixed in DTS digital surround sound. In October 1996, the restored Vertigo premiered at the Castro Theatre in San Francisco, with Kim Novak and Patricia Hitchcock in person. At this screening, the film was exhibited for the first time in DTS and 70mm, a format with a similar frame size to the VistaVision system in which it was originally shot.</p><p>Significant color correction was necessary because of the fading of original negatives. In some cases a new negative was created from the silver separation masters, but in many instances this was impossible because of differential separation shrinkage, and because the 1958 separations were poorly made. Separations used three individual films: one for each of the primary colors. In the case of Vertigo, these had shrunk in different and erratic proportions, making re-alignment impossible.</p><p>As such, significant amounts of computer assisted coloration were necessary. Although the results are not noticeable on viewing the film, some elements were as many as eight generations away from the original negative, in particular the entire \"Judy's Apartment\" sequence, perhaps the most pivotal sequence in the entire film. When such large portions of re-creation become necessary, then the danger of artistic license by the restorers becomes an issue, and the restorers received some criticism for their re-creation of colors that allegedly did not honor the director's and cinematographer's intentions. The restoration team argued that they did research on the colors used in the original locations, cars, wardrobe, and skin tones. One breakthrough moment came when the Ford Motor Company supplied a well-preserved green paint sample for a car used in the film. As the use of the color green in the film has artistic importance, matching a shade of green was a stroke of luck for restoration and provided a reference shade.</p><p>When restoring the sound, Harris and Katz wanted to stay as close as possible to the original, and had access to the original music recordings that had been stored in the vaults at Paramount. However, as the project demanded a new 6-channel DTS stereo soundtrack, it was necessary to re-record some sound effects using the Foley process. The soundtrack was remixed at the Alfred Hitchcock Theatre at Universal Studios. Aware that the film had a considerable following, the restoration team knew that they were under particular pressure to restore the film as accurately as possible. To achieve this, they used Hitchcock's original dubbing notes for guidance of how the director wanted the film to sound in 1958. Harris and Katz sometimes added extra sound effects to camouflage defects in the old soundtrack; i.e., \"hisses, pops, and bangs\". In particular, they added extra seagull cries and a foghorn to the scene at Cypress Point. The new mix has also been accused of putting too much emphasis on the score at the expense of the sound effects.</p><h4>Home media</h4><p>In 1996, director Harrison Engle produced a documentary about the making of Hitchcock's classic, Obsessed with Vertigo. Narrated by Roddy McDowall, the film played on American Movie Classics, and has since been included with DVD versions of Vertigo. Surviving members of the cast and crew participated, along with Martin Scorsese and Patricia Hitchcock. Engle first visited the Vertigo shooting locations in the summer of 1958, just months after completion of the film.</p><p>Vertigo was first released on DVD in March 1998. On October 4, 2011, the film was re-issued on DVD by Universal Pictures Home Entertainment as part of the Alfred Hitchcock: The Essentials Collection. Subsequently, the film was released on Blu-ray on September 25, 2012, as part of the Alfred Hitchcock: The Masterpiece Collection. In May 2014, the film was re-released as a stand-alone Blu-ray edition. Some home video releases, such as the 2005 Hitchcock Masterpiece Collection DVD set, contain the original mono track as an option.</p><p>In October 2014, a new 4K restoration was presented at the Castro Theatre in San Francisco. This version gives credit to Harris and Katz at the end of the film, and thanks them for providing some previously unknown stereo soundtracks. This version, however, removes some of the \"excessive\" Foley sound that was added in the 1996 restoration.</p><br/><h3>Reception</h3><h4>Contemporaneous reception</h4><p>The initial reception expressed in film reviews for Vertigo was mixed. Variety wrote the film showed Hitchcock's \"mastery\", but felt the film was \"too long and slow\" for \"what is basically only a psychological murder mystery\". Similarly, Philip K. Scheuer of the Los Angeles Times admired the scenery, but found the plot took \"too long to unfold\" and felt it \"bogs down in a maze of detail\". Scholar Dan Auiler says that this review \"sounded the tone that most popular critics would take with the film\". However, the Los Angeles Examiner loved it, admiring the \"excitement, action, romance, glamor and crazy, off-beat love story\". The New York Times film critic Bosley Crowther also gave Vertigo a positive review by explaining that \" secret is so clever, even though it is devilishly far-fetched.\" Richard L. Coe of The Washington Post praised the film as a \"wonderful weirdie,\" writing that \"Hitchcock has even more fun than usual with trick angles, floor shots and striking use of color. More than once he gives us critical scenes in long shots establishing how he's going to get away with a couple of story tricks.\" John McCarten of The New Yorker wrote Hitchcock \"has never before indulged in such farfetched nonsense.\"</p><p>Contemporaneous response in England was summarized by Charles Barr in his monograph on Vertigo stating: \"In England, the reception was if anything rather less friendly. Of the 28 newspaper and magazine reviews that I have looked at, six are, with reservations, favourable, nine are very mixed, and 13 almost wholly negative. Common to all of these reviews is a lack of sympathy with the basic structure and drive of the picture. Even the friendlier ones single out for praise elements that seem, from today's perspective, to be marginal virtues and incidental pleasures – the 'vitality' of the supporting performances (Dilys Powell in The Sunday Times), the slickness with which the car sequences are put together (Isobel Quibley in The Spectator)\".</p><p>In France, Éric Rohmer noted in Cahiers du Cinéma that \"Vertigo, so they say, repelled Americans. French critics, on the contrary, seem to be giving it a warm welcome.\" Praising the film's formal technique, he wrote that \"ideas and forms follow the same road, and it is because the form is pure, beautiful, rigorous, astonishingly rich, and free that we can say that Hitchcock’s films, with Vertigo at their head, are about ideas, in the noble, platonic sense of the word.\"</p><p>Additional reasons for the mixed response initially were that Hitchcock fans were not pleased with his departure from the romantic-thriller territory of earlier films, and that the mystery was solved with one-third of the film left to go. Orson Welles disliked the film, telling his friend, director Henry Jaglom, that the movie was \"worse\" than Rear Window, another film that Welles disliked. In an interview with François Truffaut, Hitchcock stated that Vertigo was one of his favourite films, with some reservations. Hitchcock blamed the film's failure on the 49-year-old Stewart looking too old to play a convincing love interest for the 24-year-old Kim Novak.</p><p>A young Martin Scorsese viewed the film with his friends during its original run in New York City, and later recalled that \"even though the film was not well received at the time... we responded to the film very strongly. didn't know why... but we really went with the picture.\"</p><p>Hitchcock and Stewart received awards at the San Sebastián International Film Festival, including a Silver Seashell for Best Director (tied with Mario Monicelli for Big Deal on Madonna Street (aka Persons Unknown)) and Best Actor (also tied, with Kirk Douglas in The Vikings). The film was nominated for two Academy Awards, in the technical categories Best Art Direction – Black-and-White or Color (Hal Pereira, Henry Bumstead, Samuel M. Comer, Frank McKelvy) and Best Sound (George Dutton).</p><h4>Re-evaluation</h4><p>Over time the film has been re-evaluated by film critics and has moved higher in esteem in most critics' opinions. Every ten years since 1952, the British Film Institute's film magazine, Sight & Sound, has asked the world's leading film critics to compile a list of the 10 greatest films of all time. In the 1962 and 1972 polls, Vertigo was not among the top 10 films in voting. Only in 1982 did Vertigo enter the list, and then in 7th place. By 1992 it had advanced to 4th place, by 2002 to 2nd, and in 2012 to 1st place in both the crime genre, and overall, ahead of Citizen Kane in 2nd place; in 2022, the Sight & Sound poll ranked Vertigo 2nd place. In the 2012 Sight & Sound director's poll of the greatest films ever made Vertigo was ranked 7th. In the earlier 2002 version of the list the film ranked 6th among directors. In 2022 edition of the list the film ranked 6th in the director's poll. In 1998 Time Out conducted a poll and Vertigo was voted the 5th greatest film of all time. The Village Voice ranked Vertigo at No. 3 in its Top 250 \"Best Films of the Century\" list in 1999, based on a poll of critics. Entertainment Weekly voted it the 19th Greatest film of all time in 1999. In January 2002, the film was voted at No. 96 on the list of the \"Top 100 Essential Films of All Time\" by the National Society of Film Critics. In 2009, the film was ranked at No. 10 on Japanese film magazine Kinema Junpo's Top 10 Non-Japanese Films of All Time list. In 2022, Time Out magazine ranked the film at No.15 on their list of \"The 100 best thriller films of all time\".</p><p>Commenting upon the 2012 results, the magazine's editor Nick James said that Vertigo was \"the ultimate critics' film. It is a dream-like film about people who are not sure who they are but who are busy reconstructing themselves and each other to fit a kind of cinema ideal of the ideal soul-mate.\" In recent years, critics have noted that the casting of James Stewart as a character who becomes disturbed and obsessive ultimately enhances the film's unconventionality and effectiveness as suspense, since Stewart had previously been known as an actor of warmhearted roles.</p><p>Already in the 1960s, the French Cahiers du cinéma critics began re-evaluating Hitchcock as a serious artist, rather than just a populist showman. The film ranked 8th on Cahiers du Cinéma's Top 10 Films of the Year List in 1959. However, even François Truffaut's important 1962 book of interviews with Hitchcock (not published in English until 1967) devotes only a few pages to Vertigo. Dan Auiler has suggested that the real beginning of Vertigo's rise in adulation was the British-Canadian scholar Robin Wood's Hitchcock's Films (1968), which calls the film \"Hitchcock's masterpiece to date and one of the four or five most profound and beautiful films the cinema has yet given us\".</p><p>Adding to its mystique was the fact that Vertigo was one of five Hitchcock-owned films removed from circulation in 1973. When Vertigo was re-released in theaters in October 1983, and then on home video in October 1984, it achieved an impressive commercial success and laudatory reviews. Similarly adulatory reviews were written for the October 1996 showing of a restored print in 70mm and DTS sound at the Castro Theater in San Francisco. In his 1996 review of the film, film critic Roger Ebert gave the film four stars out of four and included it in his Great Movies list.</p><p>A small minority of critics have expressed dissenting opinions. In his 2004 book Blockbuster, British film critic Tom Shone suggested that Vertigo's critical re-evaluation has led to excessive praise, and argued for a more measured response. Faulting Sight & Sound for \"perennially\" putting the film on the list of best-ever films, he wrote, \"Hitchcock is a director who delights in getting his plot mechanisms buffed up to a nice humming shine, and so the Sight and Sound team praise the one film of his in which this is not the case – it's all loose ends and lopsided angles, its plumbing out on display for the critic to pick over at his leisure.\"</p><p>In 1989, Vertigo was recognized as a \"culturally, historically and aesthetically significant\" film by the United States Library of Congress and selected for preservation in the National Film Registry in the first year of the registry's voting.</p><p>In 2005, Vertigo came in second (to Goodfellas) in British magazine Total Film's book 100 Greatest Movies of All Time. In 2008, an Empire poll of readers, actors, and critics named it the 40th greatest movie ever made. The film was Voted at No. 8 on the list of \"100 Greatest Films\" by the prominent French magazine Cahiers du cinéma in 2008. In 2010, The Guardian ranked it as the 3rd-best crime film of all time. Vertigo ranked 3rd in BBC's 2015 list of the 100 greatest American films.</p><p>On review aggregator Rotten Tomatoes, the film holds an approval rating of 93% based on 87 reviews, with an average rating of 8.90/10. The website's critics consensus reads,\"An unpredictable scary thriller that doubles as a mournful meditation on love, loss, and human comfort\". As of January 2021, Vertigo is one of only eight films with a 100 (perfect) score on the movie critic aggregator website, Metacritic (two other Hitchcock films, Notorious and Rear Window, are also on the list).</p><p>The most recent edition of the American Film Institute's top 100 films of all-time, released in 2007, placed Vertigo at #9 up 52 positions from its placement at #61 in the original 1998 listing.</p><p>American Film Institute recognition</p><ul><li>AFI's 100 Years...100 Movies (1998) #61</li><li>AFI's 100 Years...100 Thrills (2001) #18</li><li>AFI's 100 Years...100 Passions (2002) #18</li><li>AFI's 100 Years of Film Scores (2005) #12</li><li>AFI's 100 Years...100 Movies (10th Anniversary Edition) (2007) #9</li><li>AFI's 10 Top 10 (2008) #1 Mystery</li></ul><p>The San Francisco locations have become celebrated amongst the film's fans, with organised tours across the area. In March 1997, the cultural French magazine Les Inrockuptibles published a special issue about Vertigo's locations in San Francisco, Dans le décor, which lists and describes all actual locations.</p><p>Director Martin Scorsese has listed Vertigo as one of his favorite films of all time.</p><p>Along with the renewed public appreciation of the movie, it is receiving increased academic attention; The Annual International Vertigo conference, for example, showcases recent scholarship, as in its 2018 conference at Trinity College Dublin.</p><h4>Critical works on Vertigo</h4><ul><li>Variety review from 1958</li><li>Robin Wood's chapter on \"Vertigo\" in Hitchcock's Films</li><li>Molly Haskell's essay, \"With Paintbrush and Mirror: 'Vertigo' & 'As You Desire Me'\" in The Village Voice</li><li>Laura Mulvey's Visual Pleasure and Narrative Cinema, popularizing the concept of the male gaze</li><li>Roger Ebert's 1996 Review</li></ul><h4>Classification as film noir</h4><p>Critical opinion is divided on whether Vertigo should be considered a film noir. Some consider it a film noir on the basis of plot and tone and various motifs, despite its having a modernist graphic design typical of the 1950s and a more modern set design, which would otherwise remove it from the category of film noir. Others say the combination of color and the specificity of Hitchcock's vision exclude it from the category. On the general issue of noir and visual style, see Ballinger and Graydon (2007), p. 31. Christopher (1998) and Silver and Ward (1992), for instance, do not include Vertigo in their filmographies. Ottoson (1981) does not include Vertigo in his canon. By contrast, Hirsch (2001) describes Vertigo as among those Hitchcock films that are \"richly, demonstrably noir\" (p. 139).</p><br/><h3>Derivative works</h3><ul><li>Kalangarai Vilakkam, a 1965 Tamil film adaptation of Vertigo.</li><li>One on Top of the Other, a 1969 giallo film directed by Lucio Fulci, is heavily influenced by Vertigo.</li><li>Obsession, a 1976 film by Brian De Palma, is heavily influenced by Vertigo, while his 1984 thriller Body Double combines the plot elements of both Vertigo and Rear Window.</li><li>High Anxiety, a 1977 film by Mel Brooks, is a parody of suspense films directed by Alfred Hitchcock, but leans on Vertigo in particular.</li><li>Chris Marker's 1983 video-essay Sans Soleil makes reference to the movie, declaring it the only film \"capable of portraying impossible memory\" over footage of Vertigo's shooting locations and stills from the film.</li><li>Harvey Danger's song \"Carlotta Valdez,\" from the 1997 album Where Have All the Merrymakers Gone?, summarizes the plot of the film.</li><li>Joseph Kahn's 1997 music video for Faith No More's \"Last Cup of Sorrow\" is a parody of Vertigo with singer Mike Patton in the Scottie Ferguson role and Jennifer Jason Leigh in the Madeleine/Judy role.</li><li>Suzhou River, a 2000 Chinese film by Lou Ye which critics saw as an homage to Vertigo.</li><li>Mulholland Drive, a 2001 film written and directed by David Lynch (who cited Vertigo as an influence), uses a similar double-identity theme involving a blonde woman in a grey suit skirt in grave danger, and the film noir premise of tragic love, betrayal and murder that drove Hitchcock's film.</li><li>The Testament of Judith Barton, a 2012 novel by Wendy Powers and Robin McLeod, tells the back-story of Kim Novak's character.</li><li>Alfred Hitchcock – Vertigo, an adventure game by developer Pendulo Studios and publisher Microids.</li><li>Francesco Ferrari Mines the Mission: A Homage to Vertigo, an original 2018 novel by Joseph Covino Jr., third in the San Francisco-set Francesco Ferrari private detective series, takes its template from both the Vertigo novel and film.</li></ul><br/><h3>Potential remake</h3><p>In March 2023, it was reported that Paramount Pictures acquired the remake rights to the film with Steven Knight set to write the script, and Robert Downey Jr. set to star for Davis Entertainment and Team Downey.</p><br/>"
  },
  "errorMessage": ""
}