{
  "imDbId": "tt0073195",
  "title": "Jaws",
  "fullTitle": "Jaws (1975)",
  "type": "Movie",
  "year": "1975",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "One of the most effective thrillers ever made."
    },
    {
      "publisher": "Empire",
      "author": "Ian Nathan",
      "link": "",
      "rate": "100",
      "content": "It was the complete nightmare that invented the \"summer blockbuster\", launched the genius on a global scale and delivered an astonishingly effective thriller built on a very primal level: fear."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Ty Burr",
      "link": "",
      "rate": "100",
      "content": "Steven Spielberg overcame the lumpy plotting of Peter Benchley's novel to create an efficient, graceful fright machine in Jaws."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "100",
      "content": "The first is the best. When it comes to this kind of thriller, no movie has been able to top Jaws, although many have tried. And, as the years go by, it seems increasingly unlikely that anything will come close."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1975/film/reviews/jaws-1200423515/",
      "rate": "100",
      "content": "Robert Shaw [is] absolutely magnificent as a coarse fisherman finally hired to locate the Great White Shark; and Richard Dreyfuss, in another excellent characterization as a likeable young scientist."
    },
    {
      "publisher": "CineVue",
      "author": "John Bleasdale",
      "link": "",
      "rate": "100",
      "content": "Importantly, Spielberg instinctively knows exactly when to keep his camera still and allow what's in front of it to take precedence."
    },
    {
      "publisher": "The New York Times",
      "author": "Vincent Canby",
      "link": "",
      "rate": "80",
      "content": "If you think about Jaws for more than 45 seconds you will recognize it as nonsense, but it's the sort of nonsense that can be a good deal of fun, if you like to have the wits scared out of you at irregular intervals."
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "From the outrageously frightening opening--in which a beautiful young woman skinny-dipping in the moonlight is devoured by the unseen shark--to the claustrophobic climax aboard Quint's fishing boat, Spielberg has us in his grip and rarely lets go."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Gene Siskel",
      "link": "https://www.chicagotribune.com/news/ct-xpm-1999-10-15-9910200025-story.html",
      "rate": "75",
      "content": "What this movie is about, and where it succeeds best, is the primordial level of fear. The characters, for the most part, and the non-fish elements in the story, are comparatively weak and not believable. [20 June 1975]"
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "40",
      "content": "Steven Spielberg's mechanical thriller is guaranteed to make you scream on schedule (John Williams's score even has the audience reactions programmed into the melodies), particularly if your tolerance for weak motivation and other minor inconsistencies is high."
    }
  ],
  "errorMessage": ""
}