{
  "imDbId": "tt0073195",
  "title": "Jaws",
  "fullTitle": "Jaws (1975)",
  "type": "Movie",
  "year": "1975",
  "items": [
    {
      "username": "zkonedog",
      "userUrl": "https://www.imdb.com/user/ur7826013",
      "reviewLink": "https://www.imdb.com/review/rw3655766",
      "warningSpoilers": false,
      "date": "6 March 2017",
      "rate": "10",
      "helpful": "63 out of 69 found this helpful.",
      "title": "So Much More Than Just A \"Shark Movie\"",
      "content": "Reputationally-speaking, \"Jaws\" will forever be known for two things: director Steven Spielberg's unique \"shark-eye view\" camera work and building of suspense, and composer John Williams' two note \"attack\" motif that became as iconic as any piece of music ever created. Perhaps those two aspects alone would have been enough to make \"Jaws\" an iconic film--who knows. But the fact is, this 1975 effort is about so much more than just suspense/horror. It is one of the most well-rounded, complete movies ever made.For a very basic overview, \"Jaws\" tells the story of the coastal town of Amity, which suddenly and inexplicably becomes the hunting grounds for a rogue Great White shark. Sheriff Brody (Roy Scheider) wants to close down the beaches until further notice, but is opposed every step of the way by city official Vaughn (Murray Hamilton), who worries about the potential loss of tourist business. When the attacks continue, however, Brody enlists the help of shark expert Hooper (Richard Dreyfuss) and grizzled boatsman Quint (Robert Shaw) to help hunt down the giant predator.As stated, the general premise and music here are well-known. But what always strikes me with each \"Jaws\" re-watch is how much it is a human drama as opposed to a horror piece driven by a villain (the shark, in this case).The first half of \"Jaws\" takes place almost entirely \"on land\", if you will, and focuses more on the politics of fear and commerce than anything supernatural or scary. If there are ever any doubts as to whether that material holds up, they can easily be put to rest after viewing the film through a pandemic context. Substitute \"global contagious disease\" for \"mindless, unstoppable shark\" and it's as relevant today as ever.The second half leans more towards \"adventure sea chase\", and is buoyed by ocean scenes that, despite being filmed 45+ years ago now, do not seen old or outdated in the least. Masterful cinematography almost always holds up, and Spielberg's behind-the-camera decisions certainly do here as well. Even then though, in the midst of a brutal and thrilling chase, Spielberg stops the action for a touching scene in which the three seaman bond over song and shared experiences.In order to fully exhibit such depth of character, great acting is required--and given here in spades. \"Jaws\" features a collection of unique characters that are always a joy to revisit. Scheider as the \"why-won't- anyone-listen-to-me!\" sheriff lets viewers relate to the story in a much more personal aspect, while Dreyfuss' Hooper is insightful, hilarious, and provides some of the best dialogue of the whole show. Of course, Shaw as Quint is singularly iconic, juxtaposing jocularity and complexity perfectly within his single character.Perhaps the greatest compliment I can give \"Jaws\" is that every time I see it, I can't help but be swept away in all its winning aspects. Whether it be the drama, emotion, music, thrills, adventure, visuals, acting, or just overall heart of the piece, there is not a single scene wasted or underutilized. I have absolutely no doubt that it will remain just as visceral of an experience going forward as it was for those sitting in the theaters in 1975."
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw2923378",
      "warningSpoilers": false,
      "date": "17 December 2013",
      "rate": "10",
      "helpful": "235 out of 269 found this helpful.",
      "title": "One of the experiences that made me fall in love with movies",
      "content": "I will never forget the first time I saw Jaws. I was glued to the seat from start to finish. I jumped, I held my breath; this was one of the experiences that made me fall in love with movies. This was probably the first film where I completely forgot everything around me. I was there, in that boat, in that gloomy cabin, with those people - everything seemed so real (and alas, the sea never looked the same again). When I watch it these days I still marvel: the atmosphere and the performances in this film are simply magical. Spielberg without the schmalz. He has never been better.My vote: 10 out of 10Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw7709799",
      "warningSpoilers": false,
      "date": "1 January 2022",
      "rate": "9",
      "helpful": "36 out of 43 found this helpful.",
      "title": "Even with very dated technology, this is a great film to watch.",
      "content": "Back in 1975, \"Jaws\" made a huge splash (pardon the pun) in theaters. It set all sorts of box office records and made the covers of magazines all over the country. And, the film was seen as groundbreaking and amazing. When seen today, it's still a great film to watch even with it's very dated technology. In other words, the shark often looks very fake but the story is so good and handled so well, you really don't care. Excellent acting, a very nice script and excellent direction make this a definite must-see."
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw1891212",
      "warningSpoilers": false,
      "date": "12 June 2008",
      "rate": "10",
      "helpful": "57 out of 71 found this helpful.",
      "title": "Jaws",
      "content": "A man eating shark is terrorising the holiday island of Amity. Police chief Martin Brody, shark hunter Quint and marine biologist Matt Hooper set sail in the hope of killing the great white monster.Jaws is responsible for many things, it's responsible for propelling director Steven Spielberg's career into the stratosphere, it was responsible for a downturn in the package holiday trade, and it was responsible for shaping the summer blockbuster release practise's. There are many other things which one doesn't need to bore you with, it's just true to say that Jaws is firmly ensconced in movie history, if one hasn't seen it then one surely knows about it, it is, even today, part of popular culture.But is it any good? Is it worthy of a long standing reputation as one of the greatest monster movies of all time? Hell yes it is, one or two easily overlooked flaws aside, it busted the box office {world wide} and tapped into a primal fear that resides in the majority of mankind, the unseen that resides in the sea.Jaws sets out its marker right from the start with a truly shocking and attention grabbing opening sequence, from then on in Spielberg {learning from Hitchcock for sure} tweaks the tension to have the audience living on their nerves, even as character building {by way of Brody's family arc} sedates the pace, we just know that it's all relative to an extension of fear and terror that is around the next corner. After the first victims remains are found Brody glances out at the ocean, Spielberg perfectly framing the shot to say so much that we are about to be witness to. Jolts and shocks pop up from time to time to help build the unease whilst Spielberg makes the audience wait before we even see what it is that so coldly and efficiently destroys man, and then the claustrophobic switch as our brave protagonists are out at sea on Quint's boat, unaware that the giant menace is now hunting them, eyes as black as death itself.So many great scenes linger for all time in the memory, the entrance of Quint is a hum dinger, a mournful widow reducing Brody to a stunned realism, the Indianappolis monologue, the bigger boat! Just some of the reasons why I personally love cinema so much. The score from John Williams is as effective as any for the genre and Robert Hoyt's sound team's work furthers the dread unfolding. The cast are superb and uniformly excellent, casting aside technical problems {and genuine resentment at times} to portray this story with verve and genuine depth of feeling. Yet Roy Scheider {Brody}, Robert Shaw {Quint} and Richard Dreyfuss {Hooper} were from from original choices, Charlton Heston was wanted for the role of Brody, Sterling Hayden and Lee Marvin were both mooted for Quint, and John Voight was Spielberg's preferred choice for Hooper, whilst Jaws author {and co screen writer here} Peter Benchley was heading for the top by asking for Newman, Redford and McQueen!! Imagine that!Still it all turned out well in the end because Jaws stands the test of time as one of the best films of its type to have ever been made. No amount of complaining about continuity and a rough looking mechanical shark will ever dim its appeal, even as I revisited it recently for the hundredth time I still got tingles all over my body, file it along side King Kong in the pantheon of Monster Masterpieces, 10/10 always, now go enjoy your dip in the ocean."
    },
    {
      "username": "fairlesssam",
      "userUrl": "https://www.imdb.com/user/ur74484494",
      "reviewLink": "https://www.imdb.com/review/rw3714494",
      "warningSpoilers": false,
      "date": "23 May 2017",
      "rate": "9",
      "helpful": "107 out of 126 found this helpful.",
      "title": "A monster of a movie",
      "content": "I re-watched this film recently and was blown away by the absolute suspense it invoked in me. My daughter (whom is 17) and I were both stunned at the quality and realism of a film made in 1975!! Our TV is 55 inches which showed the movie off to it's full potential and it certainly did not disappoint.That iconic moment of the young lady going skinny dipping in the dark with her male friend is utterly haunting. You know the horror of what's going to happen, the buoy dinging in the background gives you the chills. Steven Spielberg captures pure terror in that scene.Jaws completely absorbs you, as the trio of shark hunters venture off to try to snare the great white you begin to feel part of their adventure. You fear for them, get excited with them and dread what will happen next. When that fishing line starts spinning your heart starts pumping. This is pure class.The dynamics of Richard Dreyfuss, Roy Scheider and Robert Shaw's relationship(s) work brilliantly. The differences in their characters persona's is such that they rub each other up the wrong way, disrespect one another and wind each other up but in the end they are there for each other and develop a bond that I think surprises them all.As things begin to unravel your heart goes out to the trio and trepidation is the only way forward. They have the fight of their life on their hands, their bravery is boundless. You feel in awe of them. An absolute legend of a movie which I am grateful to have been able to watch and enjoy."
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0142109",
      "warningSpoilers": false,
      "date": "13 April 2003",
      "rate": "10",
      "helpful": "226 out of 315 found this helpful.",
      "title": "If this movie scares you to the point where you can't go back into the water, then Spielberg has done job well done",
      "content": "Jaws is a movie the I grew up with, it's like the first real horror film I ever watched. What a great one to start with, right? This movie not only scarred me out of the water, I was afraid to go to the bathroom! I thought Jaws was going to pop up out of the toilet and bite my butt! :D I know it was silly, but that was how much Jaws effected me. I know also that it has not lost it's effect to this day. I'm questioning, because it seems like all the terrific horror films came out of the 70's.Jaws is based on the best seller book by Peter Benchley. Steven Spielberg, before he was STEVEN Spielberg turned this horrifying book and made it into a reason to hate sharks. He brilliantly took what could have been a cheesy movie and turned it into a classic that will never be forgotten. To this day, I still need a friend to hold onto, it's that score! Duh na... duh na.... dun dun dun dun.... Oh, my gosh, that music just scares the heck out of me! On such a low budget, Jaws not only turned into one of the greatest horror movies of all time, it turned into one of the greatest movies, period.Jaws starts off with one of the most terrifying scenes in horror movie cinema, a young pretty girl goes into the water and is brutally attacked and killed by an unknown creature in the water. The next day Chief Brody investigates suspecting a shark attack, and urges the mayor, Larry Vaughn, to shut down the beach, but afraid of a panic and less tourists, Larry ignores the chief's suggestions and keeps the beach open leading to another attack on a young boy. Brody calls in Matt Hooper, a marine scientist to see if they can find the shark. But when another attack ensues and almost kills Brody's young son, Michael, he, Matt, and a cocky man, Quint go out to find Jaws themselves.This turns into several of the greatest cinematic scenes of all time, like the \"Indianapolis\" speech brilliantly given by Quint, how he describes seeing his first shark was just so intense and you couldn't turn away from the screen. Then, one thing that is interesting about this movie, you do not see the shark until Brody is just chucking blood to attract the shark over his shoulder and Jaws appears roaring out of the water! \"We're gonna need a bigger boat!\" he replies to Quint. And then the scene where Jaws jumps onto the boat and Quint is trapped sliding into Jaw's, well, jaws! That's the scene that nightmares are made out of! Jaws is one of my favorite films of all time. It's one of those films that should never be missed, because it is so important. To many, including myself, the shark looks fake, but it's your imagination that gets with you. Spielberg embraced that and you could tell there was just something special about him. Jaws will scare you out of the water just like The Exorcist scared you to the church! 10/10"
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw3264283",
      "warningSpoilers": false,
      "date": "24 June 2015",
      "rate": "",
      "helpful": "29 out of 36 found this helpful.",
      "title": "One of the Greatest Films Ever Made",
      "content": "Jaws (1975) **** (out of 4) Steven Spielberg's classic about a man-eating Great White shark stalking the beaches of Amity and the three men who go out to try and kill it. Seriously, is there anyone who doesn't know the plot to this masterpiece? Considering all the production trouble on this thing it would be amazing to get a half-way decent film yet for some reason, perhaps the movie Gods were shining down, we ended up with one of the greatest films ever made. This is without question one of the greatest films to deal with tension as Spielberg masterfully handles all the material. The movie is like an amazing roller coaster as we get one scare after another until the end when we just get our senses attacked from all around. Millions of people have discussed the greatness of this film so it's hard to pick one thing but I'd say the greatest achievement of the film is the simple adventure it gives us.Even though we get some very intense scenes the screenplay is smart enough to give us other things to go with. We got some nice black humor in the witty dialogue but we also get a good buddy picture with Roy Scheider, Robert Shaw and Richard Dreyfuss delivering memorable characters. The three of them together are so different yet all three are like people I'm sure each viewer has met so it's easy to connect with them and it makes the film all the more fun when we go on this adventure.The film, of course, benefits from the brilliant John Williams score, which is perhaps the most memorable in film history. Bruce, the name given to the shark, caused most of the problems during filming but you wouldn't know that by just watching the picture. The look of the shark is incredible and Spielberg certainly made the right decision of keeping it hidden and just revealing bits and pieces as the movie went along. The first glimpse in the pond is hauntingly shocking and each sighting just grows more and more tension. The director also knows how to build suspense without us seeing the shark as we're constantly viewing objects floating (the dock, the barrels) to imply that the creature is there.What's even more amazing is that this film scared people so badly that they refused to go into the water yet the most suspenseful scene is probably the now legendary speech by Shaw about his time on the USS Indianapolis. It goes without saying but the three leads are all terrific in their roles and I really can't think of too many movies that have as many memorable characters as the ones here. We also get strong supporting work from Murray Hamilton as the Mayor and Lorraine Gary as Brody's wife.For me this ranks as one of the greatest adventures ever captured on film because everyone involved makes it feel so real. When the men get on the boat to go after the shark you feel as if you're really there. When the camera is underwater given a POV shot of the shark, you feel as if you're in the water. The final death scene in the movie also just happens to be one of the most terrifying ever captured on film and it might even be the most brutal. The movie is a true masterpiece of suspense and I think it would be fair that nothing has come close to this in the past 35 years. Like PSYCHO, we've had a lot of rips of imitations but nothing has come close to the same power and it's doubtful anything ever will."
    },
    {
      "username": "Idiot-Deluxe",
      "userUrl": "https://www.imdb.com/user/ur64426811",
      "reviewLink": "https://www.imdb.com/review/rw3577228",
      "warningSpoilers": true,
      "date": "8 November 2016",
      "rate": "10",
      "helpful": "68 out of 82 found this helpful.",
      "title": "JAWS = Timeless Cinema",
      "content": "It's true, few movies tell a story better and in a more compelling way than JAWS - the original summer blockbuster, which was a world-wide smash-hit or \"phenomenon\" upon it's initial release in May of 1975. Forty-one years later it still stands as one of the best movies of all time and having seen it well over 100 times in the past 30 years, I can firmly attest to it's extreme longevity and at this point it would seem JAWS' ability to entertain me, myself and the masses is indefatigable. In other words: JAWS IS ETERNAL. An ageless, universally beloved masterpiece and due to the films great originality, it has always been easy for me to admire it.The films great cast of Roy Scheider, Richard Dreyfus, Robert Shaw, Lorraine Grey and Murray Hamilton really pull together here and throughout the film they play off each other beautifully, the cast exudes a type of \"naturalistic chemistry\" that's rarely attained in movies. That's one of the key reasons why JAWS is such a cohesive and enduring movie and if you haven't noticed over the years, all of the scenes in this movie gel perfectly, with not a single scene being wasted or without purpose. Deftly directed by a 27 year-old Steven Spielberg throughout the course of mid 1974 to early 1975, the production was a troubled one (primarily due to malfunctioning mechanical sharks) and the budget ballooned to several times it's original estimate, but as the film resoundingly shows they succeeded in creating a gripping masterpiece of cinema - that's often mimicked in one way or another, but has certainly never been bettered.Set in the fictitious locale of Amity Island (as most know, in actuality it was filmed in and around Martha's Vineyard Massachusetts) JAWS tells the story of a once-pleasant sea-side community, that suddenly finds itself being terrorized, by a huge Great White shark \"That's a 20-footer... 25, 3-tons of em'\" that's gone -rogue- and has staked a claim off the beaches of Amity Island. Naturally this causes confusion and commotion among the town folk, bounties are set, amateur shark-hunters recklessly take to the water and throughout the bloody-tension-filled affair, the towns various entities of local government are constantly clashing with each other; in other words lots of friction and stubborn, thick-headed resistance bubble up and the tension is at times so thick, you can cut it with a knife. Basically what it is, is enough people have to be eaten by the shark, before the mayor and his circle of cronies finally pull their heads out of the sand and come to the same obvious conclusion - that Martin Brody, the sharp-witted and instinctual sheriff had already concluded. So add governmental haranguing as yet another element weaved into this intricate, yet cohesive story.The film is bi-sected into two distinctly different acts, with the first half taking place mostly on the dry ground of Amity Island, with a few boating and swimming excursions, but still largely land-based. However, in the second half, we find ourselves adrift at sea aboard Quint's boat, for the remainder of the movie - which most would agree is the more exciting part. The role of the shark-hunter \"Quint\" is BRILLIANTLY played by the late-great Robert Shaw and is, by far, the films most-memorable and most-colorful character. Rarely is a film character so vividly well put together and as memorable as the cantankerous Quint, with his voice being the key reason; plus he has some mighty colorful \"fisherman's tales\" to tell, as you will find out. You can thank the numerous other \"bigger names\" that, for varying reasons, turned down that role of which there were several, with Charlton Heston and Robert Mitchum being just a couple of them. The action and excitement are all cranked up several notches in the latter half of the film, with much tension between the three ship mates, Brody, Matt Hooper (a marine biologist) and the ever-salty Quint. This iconic film concludes with what's literally \"Smile you son-of-a!\" an explosive finale! That which has long stood as one of cinema's most memorable, if not improbable, endings.The Music: As Steven Spielberg has said, the music of John Williams is half the movie and it easily ranks as one of the most memorable and effective film scores of all-time. A powerful and ingenious orchestral score, dripping with gloomy atmosphere and with much in the way of toothy serrated menace and of course JAWS has what's probably the best-known movie theme ever written. Williams' award-winning music for JAWS not only took his career to the next level, but in a very big way helped resuscitate a dying art-form; that of course being large-scale orchestral film scores, which had been in steady decline since the mid to late 1960's. Williams' score for Star Wars just two years later would yet further benefit that cause to even greater effect.On The Oscar Front: JAWS took home three Oscar's (for, best sound recording, best score and best film editing) and damn well should of had another or two, Best Picture being one of them.Ultimately JAWS stands as a grand and regal film classic - that only an idiot (or a heretic) would not like.......and yes, because of this movie and it's infinitely lesser sequels, I shudder at the mere thought of being in the ocean.**Update**: The wreck site of Quint's ship the U.S.S. Indianapolis was discovered on August 19th 2017, by a deep-sea search team lead by Microsoft billionaire Paul Allen 72 years after her infamous sinking. Her watery grave rests some 18,000 feet below the surface of the Philippine Sea.Thanks Paul, it's been a long time coming."
    },
    {
      "username": "EmmeCHammer",
      "userUrl": "https://www.imdb.com/user/ur87640589",
      "reviewLink": "https://www.imdb.com/review/rw4889397",
      "warningSpoilers": false,
      "date": "26 May 2019",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "Classic",
      "content": "I hate reading reviews from people who think movies were always made with CGI , we'll my young friends there was a time when it took genius filmmakers to make a masterpiece movie not just a computer doing all the work. You do realize this was 1975 and was a one of a kind Cinematic Masterpiece. Receiving oscars because it was great, ahead of its time. Also starting the career of Spielberg. Some of you people (that's right I said it ) make me laugh thinking movies started in the 2000s, go back and watch it and then realize it's time of release and the impact it had on the Cinema, before you say it's not groundbreaking and surely before YOU can compare it to Sharknado, Meg, and other ridiculous CGI hacks! People will be talking about this CLASSIC long after you and I are making our meaningless reviews, 10*s if ever a movie deserves it."
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw3534117",
      "warningSpoilers": true,
      "date": "29 August 2016",
      "rate": "10",
      "helpful": "25 out of 33 found this helpful.",
      "title": "Spielberg's original blockbuster",
      "content": "On the fictional New England resort island of Amity tourism is the main industry and each summer the beaches are backed with people hoping to swim in its beautiful waters the last thing the authorities want is news that a shark has killed somebody. When I girl disappears at sea it is first assumed she just drowned but when her body is found the Island's new Police Chief, Martin Brody, wants to close the beaches but the mayor is determined to keep them open and pressures the local doctor to certify that she was killed by a boat a second death, just off a crowded beach, causes a major panic and the mother of the victim offers a three thousand dollar reward to whoever catches the shark. This attracts everybody with a boat but doesn't impress local fisherman Quint, who demands $10,000, or shark expert Matt Hooper, who Brody invited to the island. After further deaths Brody, Quint and Hooper set of in Quint's boat, the Orca, to hunt down the great white shark that has been terrorising the island. Once they find the shark it becomes clear that catching it will not be easy.This iconic film has certainly stood the test of time and is as gripping as ever. The story is relatively simple without any real twists and that is one of its strengths. It is very much a film of two halves; the first land based as Brody tries to get the town authorities to take the shark seriously and the second out at sea as Brody, Quint and Hooper hunt down the shark. These three, brilliantly played by Roy Scheider, Robert Shaw and Richard Dreyfuss respectively, are great characters and the scenes between then on the boat are a delight; sometimes tense, sometimes funny and, when Quint tells the story of what happened when the USS Indianapolis was sunk positively chilling. The shark effects are pretty impressive, only in the final scenes does in took a bit rubbery; of course it helps that we aren't shown too much of the shark early on. The music, by John Williams, is great not just the famous 'shark theme' but also the other music. There are plenty of scary moments throughout the film; some at least as frightening as horror films largely because of its familiar setting and the fact that even though shark attacks are rare we all know that they do occasionally happen. Overall this is a great film that can be enjoyed by most people if you don't mind a few scares. It is a must see for anybody who enjoys classic movies."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw8474382",
      "warningSpoilers": false,
      "date": "21 August 2022",
      "rate": "8",
      "helpful": "13 out of 16 found this helpful.",
      "title": "Hunter Gatherers, Hunted then Gathered...",
      "content": "There are perils when it comes to beach and sea, on occasion they might make you want to flee, a large mandible or two, clamping down right over you, could be one, and you'll become, an absentee (or an amputee if your lucky).Three of the best performances from three outstanding actors of their day make this a perpetually piercing picture of perfection."
    },
    {
      "username": "eht5y",
      "userUrl": "https://www.imdb.com/user/ur3675458",
      "reviewLink": "https://www.imdb.com/review/rw0142199",
      "warningSpoilers": false,
      "date": "23 July 2004",
      "rate": "",
      "helpful": "319 out of 431 found this helpful.",
      "title": "One of the Greatest Thrillers Ever Made",
      "content": "'Jaws' is the original summer blockbuster, setting the standard by which all others are measured. It's the Michael Jordan of cinema: there will never be another 'Jaws,' simply because the film so profoundly changed the way movies are made and marketed.Based on Peter Benchley's bestselling novel, 'Jaws' centers around the fictional North Atlantic resort island of Amity, which finds itself terrorized by an enormous great white shark. Our hero is Martin Brody, a New York cop who took the job as Chief of the Amity PD to get his family out of the city and then finds himself in the midst of an unprecedented crisis none of his prior experience has prepared him for. The remains of young Christine Watkins are found on the beach, the apparent victim of a shark attack(Chrissie Watkins' death scene at the opening of the movie is one of the most legendary in the history of film). Chief Brody wants to close the beaches, but is refused permission by Mayor Larry Vaughn (Murray Hamilton) and the Amity selectmen, all of whom fear that news of a shark attack off of Amity will threaten the summer tourist trade, on which the town depends for its very survival. The Mayor and his lackies persuade Chief Brody that such incidents are always isolated, and, inexperienced in such matters, he grudgingly agrees to keep quiet.Consequently, the shark kills again (and again), and Chief Brody eventually finds himself dealing both with his own moral guilt for agreeing to hush up the first shark attack and with an enormous human and social catastrophe which appears to be his sole responsibility. Help comes first in the form of Matt Hooper (Richard Dreyfuss, in the role that propelled him to stardom), an icthyologist and oceanographer dispatched to Amity to lend his expertise. Together, Hooper and Brody struggle in vain against both the shark and Mayor Vaughan, who is certain that keeping the beaches open for the sake of the town's economy (and his own real-estate business) is worth the gamble.Finally, Brody and Hooper charter an expedition with the enigmatic, vaguely malevolent Quint (Robert Shaw), Amity's most feared and respected shark hunter, to find and kill the shark and save the town from financial disaster. What ensues is an epic, archetypal man vs. beast quest that would make Herman Melville and Joseph Campbell proud. Our shark, it turns out, is way above average size, terrifically swift and powerful, and uncannily smart, to boot. Hooper, the scientist, is awestruck at having encountered the Bigfoot of the sea; Quint, the crafty fisherman with a serious chip on his shoulder against sharks, realizes he has met the ultimate test of his skills; Brody, who swims poorly and is afraid of water, must overcome abject fear and disorientation just to maintain his composure. Robert Shaw's Quint is one of the greatest anti-heroes the movies have ever seen. He is funny and frightening all at once, and the famous soliloquy in which he recalls the tragic sinking of the USS Indianapolis--where, over the course of a week waiting for rescue, at least 90 US Navy personnel died from shark attack wounds--is one of the most chilling and unforgettable performances ever committed to film. 'Jaws' is the movie that made Steven Spielberg's career, and it's among his finest. It's easy to forget because of his enormously successful blockbusters that Spielberg is a phenomenally skillful and artful director. His timing is superb, he mixes horror with comedy to brilliant effect, he gets great performances out of his actors, and his love for special effects has never overwhelmed his understanding of the importance of story and character. That said, the most brilliant aspect of 'Jaws' was a serendipitous accident.The special effects team had yet to fully troubleshoot 'Bruce,' the mechanical shark, by the time filming was to begin. Under tight budget restraints and enormous studio pressure, Spielberg had no choice but to press on while his crew labored vainly to make the shark work in the cold and corrosive north Atlantic seawater. To compensate for the absence of the non-functional fake shark, Spielberg used shots from the shark's point of view and John Williams' famous two-note theme to create the illusion of the shark's presence in the early scenes. Fortunately the crew was ultimately able to get Bruce into operational status in time to film the big showdown, and some of the scenes are filled in with live-shark footage filmed by Australian underwater video pioneers Ron and Valerie Taylor. Consequently, the audience's fear is magnified by the fact that, for the majority of the film, they cannot see the shark, creating suspense towards the climax of the confrontation between man and beast on Quint's fishing boat.'Jaws' succeeds on almost every level. It is terrifying without being grotesque, and spectacular without being unbelievable (if the shark looks a little fake, remember that, at the time 'Jaws' was released, 'Space Invaders' was on the cutting edge of computer graphics design and there was no such thing as 'Shark Week on the Discovery Channel'). Roy Scheider's Brody is a quintessential everyman, an average guy beset by fear and guilt who finds himself in extraordinary circumstances and rises to the occasion. Dreyfuss' Hooper is brash and brave enough not to come off as nerdy or self-righteous, and his friendship with Brody becomes the backbone of the movie (Spielberg and screenwriter Carl Gottlieb wisely deviated from the novel in regards to the character of Hooper, who was originally Brody's nemesis). Robert Shaw's Quint is a modern-day Captain Ahab, a worthy foe for the malevolent shark. The suspense is potent and the action thrilling, but the humor, emotion, and character development make this movie much more than a summer blockbuster."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw3717564",
      "warningSpoilers": false,
      "date": "27 May 2017",
      "rate": "10",
      "helpful": "13 out of 17 found this helpful.",
      "title": "All this machine does is eat, sleep and make baby sharks.",
      "content": "A great white shark terrorises a small community.One of the best films ever made, the originality and impact of this movie astounds me to this day. It's a movie you catch watch again and again without it become tiresome.For anyone with a fear of open water, such as me, you will not want to even dip a toe in the sea ever again. It is however so much more then just a scare fest that vilifies Sharks, the characters are excellent, Roy Scheider and Richard Dreyfuss are wonderful, both giving incredibly memorable performances.The film is iconic in so many ways, the scene where the camera pans around Schneider after the Shark attacks on the beach is iconic. The music is arguably the most famous ever created for a film, who doesn't know the Jaws theme.The shark itself is also well imagined, they create the terror without showing you too much, had there been a rubbish plastic shark throughout (as the later films did) it would have lost impact, as it stands this film is iconic, scary, an iconic thriller.Perfection 10/10."
    },
    {
      "username": "TigerHeron",
      "userUrl": "https://www.imdb.com/user/ur24363367",
      "reviewLink": "https://www.imdb.com/review/rw8383821",
      "warningSpoilers": false,
      "date": "30 July 2022",
      "rate": "9",
      "helpful": "7 out of 7 found this helpful.",
      "title": "It holds up",
      "content": "I saw this movie again after a few decades. There are a lot of movies from past eras that don't hold up over time, but this one does. It's just as suspenseful as it was in 1975. But the best reason to watch it is Robert Shaw's performance. You hardly ever see those type of personalities in movies anymore."
    },
    {
      "username": "Boba_Fett1138",
      "userUrl": "https://www.imdb.com/user/ur1416505",
      "reviewLink": "https://www.imdb.com/review/rw0142196",
      "warningSpoilers": false,
      "date": "19 July 2004",
      "rate": "10",
      "helpful": "115 out of 207 found this helpful.",
      "title": "Spielberg turns weak story into a cinematic masterpiece.",
      "content": "Every once in a while the right talented people are at the right place together and come up with a masterpiece. \"Jaws\" is definitely one of those movies, that is thanks to the amazing cast and the crew the classic masterpiece that it is today.Let's face it, the story is dumb and silly and in a way very average. Spielberg magically turns the silly story into a tense exciting thriller with brilliant dialogue and classic scene's. Mark my words, \"Jaws\" is a movie that will never be considered outdated.Everything in the movie works so well! The acting, the dialogue, the tension, the typical Spielberg humor, the music, everything! It's hard to name just one thing why this movie is such a masterpiece. It is the mix of everything combined that makes the movie work. Probably my favorite thing about the movie would be the dialogue, they are very raw and performed well by the perfect cast. Another thing of course would be the music and I'm not just talking about the main theme but about the entire musical score in general.The cast is great but they are mainly great together. All of the Scheider/Shaw/Dreyfuss scene's are like three ingredients thrown together and the end result of it is pure gold.And than Bruce the shark. Yes, he really looks believable even now days.A real classic masterpiece that launched Spielberg's career10/10http://bobafett1138.blogspot.com/"
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw0142135",
      "warningSpoilers": true,
      "date": "9 August 2003",
      "rate": "9",
      "helpful": "45 out of 73 found this helpful.",
      "title": "A well-made film which efficiently manipulate its elements of suspense and horror...",
      "content": "The film opens with a shot of a group of teenagers enjoying a campfire out on Amity beach... A couple leaves the group for a midnight swim... The silhouette of a woman is seen in full flight toward the sea... Her dress, bra, and panties fly toward her drunk admirer who can't make a fist to catch them... In a delicate splash, Chrissie goes swimming in the cold ocean, drawing herself into deeper water... When a wave of pressure lifts her up and eases her down, her face begins to show a certain fear... Her eyes go to the beach where her friend, too drunk to stand, is struggling with his shoe...Chrissie turns and starts for shore... But her expression freezes... Something terrible is hurting her underneath... She struggles with all her forces, but she is soon submerged in a horrifying scene... Police Chief Martin Brody (Roy Scheider) reacts quickly to the news of shark attack, and emerges with enough poster-board, wooden stakes, nails, paint and brushes to close every beach on the island... But as Amity is a beautiful summer resort with clean air, clear water, and beautiful white sand beaches... Mayor Larry Vaughn (Murray Hamilton) tries with his town officials to convince the insecure police chief to file the incident as a 'boating accident.' Brody reluctantly agrees, but later regrets his decision after few more fatal incidents... The shark has claimed Amity Island as his territory...Quint (Robert Shaw), an eccentric old shark killer, offers to kill the menacing Great White Shark for ten thousand dollars... Matt Hooper (Richard Dreyfuss), an arrogant young oceanographer, proves that the giant shark that killed Christine Watkins is still on the loose... 'They caught a shark. Not the shark,' he determines... and predicts future outbursts of attack activity in the area...Brody, Quint and Hooper become allied in a life-and-death hunt... They go after the monstrous creature with rifles and poison pistols... They try to tire him, slowing him down with coiled ropes and barrels... They fight him with everything, harpoons, poles, gaffs and compressed air tanks...Shaw is absolutely convincing as the colorful master fisherman whose obsession for destroying sharks was triggered by an actual incident in World War II... Scheider is quiet likable as the dedicated family man who doesn't even like the water, swimming or boating... His line to Quint ('You're going to need a bigger boat.\") suggests a specific cause...Dreyfuss manages to humanize the picture while stealing it... Spielberg alarms us with unexpected twists, and heart-stopping scenes wonderfully engaging... His grasp for sustaining the feeling of terror comes not only from what we see, but from what we're afraid we're going to see... He uses an imposing classical score to prepare the audience for something really scary that is about to show up... With every breath, every thought, heart beat and movement, the realism of the increasing menace is present from the opening to the end... And believe me, we are never allowed the relief of looking away from the screen"
    },
    {
      "username": "iainsmith-18061",
      "userUrl": "https://www.imdb.com/user/ur80802455",
      "reviewLink": "https://www.imdb.com/review/rw6369994",
      "warningSpoilers": false,
      "date": "16 December 2020",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "The Best",
      "content": "Still the best movie of its time and doesn't ever grow old to this day. Absolutely genius of a movie and the actors cast in this well that was true genius ."
    },
    {
      "username": "Movie Nuttball",
      "userUrl": "https://www.imdb.com/user/ur1132073",
      "reviewLink": "https://www.imdb.com/review/rw0142080",
      "warningSpoilers": false,
      "date": "27 December 2002",
      "rate": "10",
      "helpful": "75 out of 131 found this helpful.",
      "title": "Jaws!!!",
      "content": "Jaws is an epic movie and it is My favorite shark film.Great acting by Roy Scheider and Richard Dreyfuss but the acting was superb in My opinion by Robert Shaw!The shark itself was awesome!The view of the water in Jaws is spooky and it makes you feel that anything can be in it!The music by John Williams is great and the direction by Steven Spielberg is terrific!Jaws has three other sequels but they aren't classics like this!If you like shark movies and haven't seen Jaws or even if you have check out Jaws today!"
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0141800",
      "warningSpoilers": false,
      "date": "1 September 2000",
      "rate": "",
      "helpful": "95 out of 172 found this helpful.",
      "title": "The Ultimate Popcorn Movie",
      "content": "\"Jaws\" is a thrill-ride of suspense that continues to deliver the goods to the audience 25 years later. The plot is somewhat thin: a large shark is terrorizing the tourists at the local beach. However, with that said Steven Spielberg's direction is amazing. The young director (only 28 at the time) showed unlimited potential that would only increase with age. A great accomplishment that could have been a multi-million dollar bust. 5 stars out of 5."
    },
    {
      "username": "baumer",
      "userUrl": "https://www.imdb.com/user/ur0355122",
      "reviewLink": "https://www.imdb.com/review/rw0141962",
      "warningSpoilers": true,
      "date": "26 June 1999",
      "rate": "10",
      "helpful": "47 out of 77 found this helpful.",
      "title": "The best film ever made.",
      "content": "I saw this film when I was about 8 years old. And what I remember most about it, is thinking that I had found the most frightening film that I had ever seen. When I asked my parents if there really was a Jaws and they reassured me there wasn't, I still thought they were lying ( and they were, he does exist, I'm sure of it ). To this day, almost 20 years later, I am still frightened to go swimming. I have been to the Caribbean twice in my life. Once to the Bahamas with my high school graduating class and once to Acapulco for March Break. Neither time did my classmates or friends venture into the water because of me. \" Did yo know that most shark attacks happen in three feet of water of less? \" I asked them. Needless to say the hotel pool was well utilized on both trips.Jaws is perfect on every level of film making. It has incredibly well developed characters, so well that we feel their fears and their bravado when we are supposed to. The direction is some of the best I have ever seen. We are but marionettes in Spielberg's fingers. When he wants us to feel, he pulls our strings and masterfully we feel scared or horrified or even amused. A perfect example of this is the killing of the Kinter kid, the second death of the movie.The scene starts off shortly after Chrissie Watkins is killed. There are people playing on the beach and in the water. Brody ( the police chief ) is sitting tentatively watching things intently. He hears screams from a young girl. But of course they are playful screams. Then we see a man playing fetch the stick with his dog. Finally we meet Alex Kinter. He goes out on his raft into the water. Then we see the shots from under water. It's as if something is approaching. We're really not sure if we are being teased here or not. But then we see a stick floating in the water and the man calling out for his dog. But he is not there. Then we see more kids splashing and then we cut to a shot approaching the Kinter boy on his raft from under water. And the music. And then...... well, we all know what happens. Now that is a director masterfully manipulating us.Jaws stands up to and surpasses any film these days that is considered brilliant and it surpasses anything that came before it. This film should have cleaned up at the Oscars. After all, what film is remembered more? One Flew Over the Cuckoo's Nest ( a very good film ) or Jaws? The answer is quite clear."
    },
    {
      "username": "martimusross",
      "userUrl": "https://www.imdb.com/user/ur12048299",
      "reviewLink": "https://www.imdb.com/review/rw7785544",
      "warningSpoilers": false,
      "date": "21 January 2022",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "An Absolute Must See, This Is How To Make A Movie!",
      "content": "JawsI watched this on My Home cinema on a big screen and it really needs to be seen this way I can't say how much I enjoyed it, it really was a revelation re-visiting this classic.Just about everything was in place the acting was just incredible between Robert Shaw, Roy Scheider and Richard Dreyfus, it was a masterclass in acting it really was.The score was unbelievable and the iconic programmatic theme with the piano notes and strings at the bottom just embodied an imagined creeping threat. I could hear bits of Westside Story as well as any Bernard Herrmann as an influence it was masterful!I'd forgotten how much of the movie was about politics and a small town and the threat to its livelihood from a man eating shark, the fashions were also great as was the styling.But the key fantastic thing is the way the camera moved, moving in at the right moment on a characters face moving back to show the panorama and actually making believable a large rubber shark it was absolutely amazing.Overall I'm giving this a 10 out of 10 it would be churlish of me to deduct a point for some of the scenes where the shark looked less than believable but hey ho for entertainment value alone it's a 10."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1505337",
      "warningSpoilers": false,
      "date": "24 October 2006",
      "rate": "9",
      "helpful": "21 out of 34 found this helpful.",
      "title": "Jaws Is To Spielberg As Psycho Is To Hitchcock",
      "content": "Of the many blockbuster films Steven Spielberg directed, I wonder if this might wind up as his most famous years from now. Like Hitchcock and \"Psycho,\" it certainly was his most shocking and scariest film. For months, people were afraid to go into the ocean after seeing this film. Few people knew what a Great White Shark looked like, but they have ever since this film came out!No, it doesn't hold the terror it did when released about 30 years ago, but it is still scary, still entertaining and moves at a fast pace. This is a quick two hours of movie-watching. The shark, which can look a little phony on occasions, is still frightening and the music has held up even better than the special-effects. The creepy music whenever the shark is near still can get your adrenaline flowing!I didn't find any of the human beings too appealing. The more I watch this, the more I wish the shark had eaten more of them, like Richard Dreyfuss and Murray Hamilton."
    },
    {
      "username": "drawlife",
      "userUrl": "https://www.imdb.com/user/ur14294603",
      "reviewLink": "https://www.imdb.com/review/rw3061445",
      "warningSpoilers": true,
      "date": "3 August 2014",
      "rate": "10",
      "helpful": "14 out of 18 found this helpful.",
      "title": "A cinematic achievement.",
      "content": "I know what some of you may think, the shark looks fake, sure it does, but put yourself into the shoes of a movie-goer in the summer of 1975.Jaws is one of the greatest films ever made, not because of it's technical achievement at the time being, but because how Steven Spielberg, frankly took a far-fetched idea and made it scary. Jaws has a simple story of a twenty-five foot great white shark terrorizing civilians of Amity Island. Eventually, the town's chief of police(Roy Scheider), a marine biologist(Richard Dreyfuss), and a fisherman(Robert Shaw) are tasked to taking down the shark. The film was known for have technical difficulties with the animatronic shark, but that was a blessing in disguise. Because of this, Spielberg manages to create tension and fear among the audience because you don't see the shark at all. Leaving your imagination to do all the work. The opening scene is downright terrifying hearing the woman screaming in agony, being dragged around by a shark we cannot see. Also the use of barrels was a stroke of genus by Spielberg and his team as it implied that the shark was near or present. What really makes this film work are the three leads. They share an impeccable chemistry between each other. Brody is a paranoid police chief, effectively portrayed by the great Roy Scheider, Richard Dreyfuss is hilarious as the wisecracking marine biologist Matt Hooper, who frequently butt heads with the rough and tough fisherman Quint, brilliantly portrayed by Robert Shaw. The three leads make these character believable and so the audience can go on a real journey with them. I cannot see this film without Steven Spielberg. In the end he put all this together, with no script, no crew, technical malfunctions, and scrutiny. How Spielberg managed to pull this movie off under massive pressure is beyond me. It's a testament on how great he is. Give credit to the writers Peter Benchley, Carl Gottlieb, and uncredited writer Howard Sackler for providing the film's story and sharp dialog. Who can also forget the incredible score by John Williams. Outstanding. Along with Star Wars, Jaws was pivotal in establishing the modern Hollywood business model, and the start of the blockbuster trend. 10/10"
    },
    {
      "username": "Amthermandes",
      "userUrl": "https://www.imdb.com/user/ur9755277",
      "reviewLink": "https://www.imdb.com/review/rw3831393",
      "warningSpoilers": false,
      "date": "14 October 2017",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "The Epitome of Suspense",
      "content": "No movie can beat the brilliance of \"Jaws\" within the world of suspense and horror. Some movies have come close, others have even matched it and gone on as legends themselves. But none have, or ever will, surpass this Spielberg masterpiece.Everything about this movie is flawless. It's most famous for its editing and direction. There is nothing to nit-pick. Just go see it, and I will withhold judgement if for some reason you dislike it in any way. For those who are big fans of Jaws, and have not yet seen the movie that launched Spielberg's career, go watch it, it's called \"Duel.\""
    },
    {
      "username": "bsideleau-62176",
      "userUrl": "https://www.imdb.com/user/ur130886872",
      "reviewLink": "https://www.imdb.com/review/rw6754246",
      "warningSpoilers": false,
      "date": "28 March 2021",
      "rate": "10",
      "helpful": "19 out of 22 found this helpful.",
      "title": "Modern filmmakers need to take cues from Jaws",
      "content": "Watching Jaws today, the film has just as much impact as it did back in 1975. Why? Because, rather than relying on special effects, the film relies on characters, dialogue and atmosphere. The shark's presence is always felt, even though it is rarely seen. However, what you remember most from this film are the characters. The interaction on the boat between the three leads is cinema perfection. The filmmakers of today have lost their way in a sea of weightless CGI and meaningless noise. A true masterpiece \"monster movie\" begins with good characters and atmosphere, the effects are merely the icing on the cake."
    }
  ],
  "errorMessage": ""
}