{
  "imDbId": "tt0071853",
  "title": "Monty Python and the Holy Grail",
  "fullTitle": "Monty Python and the Holy Grail (1975)",
  "type": "Movie",
  "year": "1975",
  "items": [
    {
      "username": "MaxBorg89",
      "userUrl": "https://www.imdb.com/user/ur5156288",
      "reviewLink": "https://www.imdb.com/review/rw1327523",
      "warningSpoilers": false,
      "date": "28 March 2006",
      "rate": "10",
      "helpful": "103 out of 125 found this helpful.",
      "title": "WHAT is the capital of Assyria? I don't know that!",
      "content": "I do know, however, that Monty Python and the Holy Grail is one of the funniest movies ever made. Let's face it, if the Python hadn't showed up in 1969, someone would have created them by now, or the world would be a much sadder place. Alongside Life of Brian, which is the sextet's masterpiece, Holy Grail is an excellent start if you want to get addicted to their surreal humor.As suggested in the title, the film deals with the Arthurian stories, freely reinterpreted by the Python ensemble: after recruiting his knights, including Sir Lancelot (John Cleese), Sir Robin (Eric Idle), Sir Bedevere (Terry Jones) and Sir Galahad (Michael Palin), King Arthur (Graham Chapman) embarks on a mission from God (also Chapman, voice only though): to seek and find the Holy Grail. No need to say, the journey is going to be perilous, but also hilarious, our heroes doing their \"best\" to screw everything up.As in Life of Brian, there are so many good bits choosing just one or two feels reductive and disrespectful, given the material. It's pure comedy gold from start to finish, a non-stop gag marathon: from the mock Scandinavian subtitles in the opening credits to the argument about swallows, from the Killer Rabbit to the Black Knight and the jaw-dropping epilogue, you will keep grinning like never before (if you're unfamiliar with these comedians, that is). Actually, after some serious thinking I can select two particular sequences as particularly memorable: the Knights who say \"Ni!\" and the Bridge of Death. The rest of the film is ace too, but those two scenes are the ones I can't stop thinking of fondly whenever the movie is mentioned.Oh, and let's not forget Terry Gilliam's vital contribution: he doesn't appear that much as an actor (his Bridgekeeper is absolute genius, though), but he compensates that with the remarkable animations used to depict part of this epic adventure. Speaking of epic, this picture has one of the most brilliant tag-lines in comedy history, if not film history in general.Oh yes, the world wouldn't be quite the same without the Monty Python. Even the most miserable person on the planet will laugh like a lunatic after viewing any of their films.P.S. Ni!"
    },
    {
      "username": "vladymirror",
      "userUrl": "https://www.imdb.com/user/ur2514416",
      "reviewLink": "https://www.imdb.com/review/rw0137128",
      "warningSpoilers": false,
      "date": "27 August 2003",
      "rate": "",
      "helpful": "302 out of 359 found this helpful.",
      "title": "the ultimate nonsense comedy",
      "content": "Well, this is unquestionably one of the funniest movies ever made. The first time a saw it I laughed to tears and this is the only time that counts. The first time you get the best experience. I really envy those who haven't seen it yet. From the opening scene to the sudden ending this one won't let you leave the room. Especially the opening scene: \"Are you trying to say that coconuts migrate\" or when John Cleese trying to be Tarzan, hanging on the rope said: \"Can somebody give me a push.\" An absolute masterpiece. Considering the low budget that the creators of the movie had at their disposal would probably make \"The Holy Grail\" the best movie in this genre-silly nonsense kind of stuff. It shows the great creativity and acting capabilities of the Monty Python crew. It comes to say that a movie can be made with a little bit of money - a great movie. 10 out of 10"
    },
    {
      "username": "Manthorpe",
      "userUrl": "https://www.imdb.com/user/ur2809796",
      "reviewLink": "https://www.imdb.com/review/rw0137152",
      "warningSpoilers": false,
      "date": "16 February 2004",
      "rate": "10",
      "helpful": "235 out of 290 found this helpful.",
      "title": "They could grab it by the husk.....",
      "content": "King Arthur and his Knights of the Round Table set out on a quest to find the Holy Grail...as told to do so by a cartoon God that lives in the clouds... Easily the most hilarious and original comedy ever made, Monty Python and the Holy Grail claims it's undisputed throne through insanely ridiculous situations and characters that will very likely never be duplicated. Pure comedic genius that doesn't go stale with age or decades of competition having been released. Simply seeing the way comedy films are made today, this film will very likely have a long reign before anything can even hold a candle to it. An absolute belly-laugh fest that never lets up.Only the cast of Monty Python could have pulled this film off, with each actor playing many different characters...all hilarious! The genius in the actors' lines themselves are truly to be admired. The comedic style of talking in circles is one technique that most comedies do not try to do, simply because they can't compete with the genius of this film, which uses it flawlessly. Those that do try usually fall flat on their faces. Two particularly excellent examples of this can be seen in the beginning scene, in which the characters discuss the origins of coconuts.....and the other when Lancelot breaks into the swamp castle to save the \"damsel in distress.\" This is merely one technique that the cast has perfected to conjure up laughs consistently throughout the entire film. The only way that I can imagine that someone might not like this film is if they simply do not enjoy it's type of humor. Too bad for them.Another hilarious technique used in the film is the use of comedy in the background. From people slamming cats against poles for no apparent reason, to people filling up baskets with mud in the fields....all very strange and hilarious at the same time. It's also simply amazing that all of the characters are played by the same group of actors, which shows the great range all of them have. Some are simply unrecognizable from one character to the other and it sometimes takes a good eye to pick them out, which makes it fun. And I don't want to ruin it for anyone, but this film takes some turns that no sane person could see coming.Ridiculous characters in ridiculous situations equals ridiculous laughter.The epitome of all-star comedy that will no doubt continue to stand the test of time. Kudos to Gilliam and the rest of the Python crew. If you haven't seen it yet, make it your first priority in life!"
    },
    {
      "username": "mjw2305",
      "userUrl": "https://www.imdb.com/user/ur3174947",
      "reviewLink": "https://www.imdb.com/review/rw1004234",
      "warningSpoilers": false,
      "date": "22 January 2005",
      "rate": "9",
      "helpful": "83 out of 115 found this helpful.",
      "title": "Monty Python at their best",
      "content": "In the Realm of King Arthur, the Monty Python team set out on a quest to recruit the best Knights in the kingdom and find the Holy Grail.This is Classic Python Mayhem, where we encounter Killer rabbits, Knights who go Nee! and Horny Nuns who lure the unsuspecting in with there Grail Shaped Beacon.The Cast all give Typically Hilarious Performances, bringing another must see to the Python Loving Audience.If You Like Monty Python, you'll love it, if you don't then stay away.If you've never seen Monty Python before then give it a try, yes it's dated but its still great fun.9/10Also see, The Life Of Brian and The Meaning of Life"
    },
    {
      "username": "lambiepie-2",
      "userUrl": "https://www.imdb.com/user/ur0874373",
      "reviewLink": "https://www.imdb.com/review/rw0137110",
      "warningSpoilers": true,
      "date": "18 May 2003",
      "rate": "10",
      "helpful": "116 out of 165 found this helpful.",
      "title": "The King of Comedies!",
      "content": "The first time I saw this was on CBS at 11:30 on a Friday night. I had seen a few Monty Python shows on PBS, so I knew who they were, and I was very interested in seeing this.This film shows you just what all around comedy is all about.It starts during the opening credits and ends in a way you don't see coming. The songs are....memorable. The drawings/animation are imaginative for its time and the Monty Python troupe was at its shining best playing a host of characters from the days of King Arthur. If you don't laugh at this today, you have no funny bone! Many other reviewers here hit this film on the nose, there isn't much more to add to how brilliant this piece of work it.This is one of my all time favorites and is one of the top 10 films of all time."
    },
    {
      "username": "uckpshh",
      "userUrl": "https://www.imdb.com/user/ur3921337",
      "reviewLink": "https://www.imdb.com/review/rw0941308",
      "warningSpoilers": false,
      "date": "3 October 2004",
      "rate": "10",
      "helpful": "339 out of 429 found this helpful.",
      "title": "The reason Robin Williams isn't in a nut house.",
      "content": "This is perhaps one of the greatest, funniest parodies in the history of film. I think the greatest definition of irony is that to be believably stupid on screen, you have to be very intelligent. This is a rare occasion where something can be so stupid that it's funny, with the addition of feeling you got your money's worth at the end. Examples of failures would be anchorman, austin powers, scary movie etc. The gore and clichés of three headed, and goofy \"NI!\" yelling knights are what give this movie discreet beauty.Did I mention that the acting is also very good for a movie of this sort. All of the main characters, as they do in the series, take on numerous characters, all of whom are well established and each have their quirks about them. This was a well written, well thought out, and perfectly directed, low budget comedy. The funniest of any monty python film, and amongst the top comedies of all time. I laughed from beginning to end and bruised one of my lungs. I highly recommend this film to anyone. This is living proof that all you need is a good script and good actors."
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0137138",
      "warningSpoilers": true,
      "date": "27 October 2003",
      "rate": "10",
      "helpful": "72 out of 109 found this helpful.",
      "title": "The Silliest Film Ever Made...",
      "content": "From a technical viewpoint, \"Monty Python and the Holy Grail\" could be called a seriously flawed and impaired film. Filmed on location in the UK with a minimal budget and regular \"Python\" cast members, I seriously doubt that anyone working on the project at the time had believed it would spark such a cultural phenomenon. And revisiting the movie now, post its release 28 years ago, is magical.First-time viewers may be puzzled by the film's odd opening--in fact, stories of those who thought that they had entered into the wrong screening room come in abundance. But as soon as the voice of the coarse British man is audible the viewer realizes that he or she has been duped once again by the Python Troupe.King Arthur and his Knights of the Round Table have been sent on a most glorious quest by God Himself--to seek and maintain the Holy Grail, the legendary cup that Christ drank from during The Last Supper, prior to His execution, and which later caught His blood as he was left danging upon the cross.But the seriousness surrounding the Holy Grail is left wholly untouched by the members of Monty Python--instead, we follow King Arthur and his men as they come upon an odd assortment of characters, including The Black Knight, Dennis, The Knights Who Say \"Ni!\", and The Killer Rabbit, all of whom hinder the daring soldiers in their quest for the Holy Grail.Many people will find the humor of \"Monty Python and the Holy Grail\" ingenious, while others will find the exact same jokes and stints repetitive and ridiculous. I myself did not enjoy the film the first time I saw it as a child, but over the years I have come to appreciate its humor a bit more. I still find the jokes a bit too stretched out at times, and certain gags, though hilarious the first ten times, get a bit humorless the twentieth time around (the coconuts, for example, which are amazingly silly when first introduced, soon become tiring when they are treated as the highlight of a joke repetitively). However, often enough the jokes introduced at certain points in the films are merely played in the background further into the film--for example, the fact that the men do not ride on horses is quite a major idea the first time it is revealed, and becomes the central subject of a conversation between Arthur and the man atop the castle battlements. But later on the notion of no horses is played smaller and in the background as so we can concentrate on the current jokes at hand, as well as the missing horses as an added bonus.There is absolutely nothing to truthfully discuss about \"Monty Python and the Holy Grail,\" other than to say that at first it seems quite obnoxious, but it starts to grow on you. And this movie has definitely made a deep dig into our culture. In fact, on the commentary track for the newer DVD, John Cleese mentions that a pro American football player (or \"footballer\" as the English call them) and his buddy were thinking of a plan in the midst of a serious game. Their strategy was this on the field: Run away! Run away!There are countless classic scenes, including the battle between The Black Knight and King Arthur (\"I've had worse!\"); the scene where Sir Lancelot the Brave (or Launcelot, as the script for the film names him) storms the Swamp Castle in hopes of rescuing a fair maiden and, in result, ends up destroying everything in his path (including the candle mounted along the wall leading to the spiralling staircase), saying that he gets a bit frantic and over-excited in this genre; Sir Robin and the Three-Headed Knight (\"...when danger reared its ugly head he bravely turned his tail and fled...\"); The Knights Who Say \"Ni!\" and their request for a shrubbery; the Killer Rabbit's attack on Arthur's merry men. That's just to name a few memorable scenes.\"Monty Python and the Holy Grail\" may be the silliest film ever put on celluloid. It rarely makes sense, sometimes falls a bit flat, but always puts a smile on your face. And that's an achievement."
    },
    {
      "username": "thehappychuckler",
      "userUrl": "https://www.imdb.com/user/ur95169662",
      "reviewLink": "https://www.imdb.com/review/rw5150302",
      "warningSpoilers": false,
      "date": "29 September 2019",
      "rate": "9",
      "helpful": "24 out of 29 found this helpful.",
      "title": "\"I am your king.\" \"Well, I didn't vote for you.\"",
      "content": "Monty Python (or John Cleese, Michael Palin, Terry Jones, Terry Gilliam, Graham Chapman and Eric Idle) brought their brilliant wit and smart humour to theatrical audiences back in 1975 with this nice little gem. If you have never seen Monty Python before it will either change your life and how you look at comedy or you will scratch your head and wonder what is so funny.In this farcical story King Arthur (to me a brilliant performance and played extremely straight by Graham Chapman) armed with his Knights of the Round Table is on his search for the Holy Grail.They come face to face with deadly black knights, killer rabbits and lonely lustful nuns to name a few.There really isn't a low point in the film as the laughs keep coming and ridiculous characters keep showing up. My favourite scenes are King Arthur's sword fight with the black knight (John Cleese), meeting the Knights Who Say Ni! lead by Michael Palin and dealing with the bridgekeeper (Terry Gilliam) of the Bridge of Death.While this is a film from Python about one thing that being King Arthur's quest for the Holy Grail it still to me has the soul of sketch comedy due to silly characters that show up for generally one scene and then you move onto the next character. Which to me is completely fine. I think this group may have been the absolute best at sketch comedy.Last night my fiancee, my sister, my niece and I went and saw this at a theatre, but it was very interactive. They gave you two halves of coconuts and lines to shout out to the screen. If you are a fan of Monty Python or this film it is not just highly recommended it is a must for those people."
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw2452835",
      "warningSpoilers": true,
      "date": "3 July 2011",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "The Movie Doesn't Break the Fourth Wall ... It Pulverises it ...",
      "content": "To review \"Monty Python & the Holy Grail\", there are five schools, I mean three : 1--- The Ecstatic Review : One of the greatest laugh riots ever committed on the big screen, an epic quest of absurdity like only the glorious Monty Python could have lead.2--- The Not-so-ecstatic-but-no-less-enthusiastic Review : Damn, I wish the movie was longer, couldn't they get more budget, it's such a shame. Oh, well, I had a great time, and only for the opening credits, the movie deserves its reputation.1--- The Ecstatic Review (again): You don't get it, Harold, that's exactly the point, it's a low-budget film, and its apparently low quality contributed to the high popularity of the film. Man, it's called a parody.2--- The Not-so-ecstatic-but-no-less-enthusiastic Review : I know, what a parody is, Bernard, thank you. But my point was that the movie could have been so much better if only *** WE APOLOGIZE FOR THE FAULT IN THE REVIEW. HAROLD AND BERNARD HAVE BEEN SACKED *** 3--- The Not-ecstatic-not-really-enthusiastic-in-fact-quite-negative Review : This movie is so flawed I don't even know where to start, hell, they didn't even have horses and Aaaaarggggh! *** WE APOLOGIZE AGAIN, FOR THE NEGATIVITY EXPRESSED IN THAT REVIEW. THE AUTHOR HAS BEEN S WELL, SHALL WE SAY, HE MET WITH AN UNFORTUNATE ACCIDENT *** As I was saying, to review \"Monty Python & the Holy Grail\", there are three, I mean two schools of review that actually can both be fused into one unique review, MINE, so let me be the bard to sing the praises of this epic tale of hilarity through : I--- The Self-Hedonistic-Introspectively-Tautological Review : The comic genius of the film is so surrealistic it goes beyond any reasonable attempt to measure, judge and therefore give it a proper review. It would be like answering the eternal question : \"What's the airspeed velocity of an unladen swallow?\" I think one should consider the wisdom of Sir Bevedere who said that \"The Earth is banana shaped\", an interestingly fruity allusion which is not without reminding Newton's apple that would revolutionize the law of Physics and originate one of the most important principles governing the film, the one I call 1/ The 'Tarte Tatin' principle :This culinary example might satisfy the descendants of the French \"Ka-niggets\", the tart was basically invented when a woman who burnt her apple pie rescued it by putting the pastry on the apples and turning out the upside down tart. The result became a famous and delicious dessert. \"Monty Python and the Holy Grail\" works the same way, it's botched, disjointed, irreverent, turning into derision every cinematic mechanism of the epic genre, but the result is just one of the funniest laugh-out-loud comedies and one of the perfect examples of the level of sophistication and unlimitedness that absurdity can reach, the one I call 2/ The 'Red Nose' principle : \"Monty Python and the Holy Grail\" is a succession of incoherent episodic sketches governed by strong coherence in absurd style and surrealistic comedy, and vice versa. The film is the celebration of the boundlessness of comedy. Here's a mathematical demonstration that would have made Sir Bevedere proud : let's admit, by hypothesis, that there was one limit \"NI\" that comedy could never exceed. Now, what is the definition of comedy? According to the Oxford dictionary, it's a \"professional entertainment consisting of jokes and sketches, intended to make an audience laugh\". Now, if \"NI\" existed, that would mean that there would be no comedic purposes in anything above that \"Nl\" level, which indirectly means that there's absolutely no one who would ever laugh to any subject implying the use of comedy above the \"Nu\" sorry the \"NI\" level, in other words, anything above the \"Nl\" level could be admitted as 100% serious. But consider that total seriousness is so psychologically oppressive that it inevitably implies the use of a comical element to relieve the tension. And the use of a comic relief is even more necessary in a totally serious narrative. So, from a reductio-ad-absurdum, I've demonstrated that even in the existence of a limit above which we can't laugh, we realize that not only we can, but we should. Quod Erat Demonstratum. Whatever seriousness you build, whatever order you create, it's meant to collapse. That's the principle, the one I call 3/ The 'Castle of Cards' principle :The castle of cards has only one goal in its short existence, to collapse. It's the perfect demonstration of the ephemeral essence of any organized and perfectly structured entity. And the higher it gets, the closer is the cataclysm. What's that to mean? \"Monty Python & the Holy Grail\" highlights the eternal victory of anarchy over order, and how even anarchy can be appealing. It's a perfect assemblage of chaotic situations, that gets your mind acclimated to the so universal and true unpredictability of life. Nothing can surprise you, yet everything is absolutely surprising : a three-headed knight, a black knight who continues the fight even if he's totally chopped off, a witch with a fake noise, a castle full of virgins with nymphomaniac impulses, a harmless bunny that can decapitate you in one second, and one of the worst cases of cinematic party pooping ever. Everything is built up until it dramatically ends in one of the most brilliantly abrupt endings, demonstrating the inevitable destruction of every measurable structure. World was created from chaos and it will end up in chaos in such a pointlessness that absurdity is the only language that could define it. Also ...*** ANY ATTEMPT TO TAKE THIS REVIEW SERIOUSLY WILL BE PUNISHED BY MOOSE TRAMPLING, ACCORDING TO THE SEVERE BUT FAIR LAW OF SVENSONLUNDERJUNGERGUNDESON***"
    },
    {
      "username": "Infofreak",
      "userUrl": "https://www.imdb.com/user/ur0381265",
      "reviewLink": "https://www.imdb.com/review/rw0137098",
      "warningSpoilers": false,
      "date": "25 March 2003",
      "rate": "",
      "helpful": "24 out of 33 found this helpful.",
      "title": "I used to think this was the funniest movie ever made.",
      "content": "Being brought up on Python going to see this movie on its original release was one of the highlights of my movie going childhood. For many years I thought 'Monty Python and the Holy Grail' was the funniest movie ever made. Now over twenty five years later repetition and familiarity may not have ruined the movie completely but they have spoiled my enjoyment somewhat. Even so it's still a comedy classic and I envy anyone who is watching it for the first time. Python (Cleese, Chapman, Palin, Jones, Idle and Gilliam) were on top form throughout, and apart from one or two less successful bits it's hilarious stuff, and arguably their most consistent movie. (I still think their TV work was their best, the non-linear sketch format suiting their style more than extended pieces). Python bores can quote this verbatim but don't let them put you off. This is one wacked out romp full of fun and surprises, and still has more laughs than 90% of today's so-called comedies. Highly recommended."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2240287",
      "warningSpoilers": false,
      "date": "24 April 2010",
      "rate": "9",
      "helpful": "11 out of 14 found this helpful.",
      "title": "Another hilarious comedy from the Pythons!",
      "content": "After the brilliant Life of Brian, I was looking forward to watching Monty Python and the Holy Grail. And I loved it, I don't think it is quite as good as Life of Brian, but it is definitely one of the better Monty Python comedies for sheer hilarity and fun. The story like Life of Brian isn't the strongest component but this is in no way a criticism and yes the special effects are cheesy but perhaps that was the intention. My only problem with the film was that the ending is a little flat, but that is a minor criticism compared to how much I loved this film. The script is irreverent and highly quotable, and the soundtrack is even funnier. As a comedy it is wonderfully inventive, that debunks the Dark Ages and legends of chivalry through King Arthur, The Black Knight, God and the \"knights who say ni\". Comedy highlights include the trial with Connie Booth's witch and the Holy Hand Grenade of Antioch sequence. Even the sets are quite well designed and authentic. And the acting is simply wonderful, John Cleese, Terry Jones(the encounter with Dennis's mother was hilarious), Graham Chapman, Terry Gilliam, Michael Palin and Eric Idle perfectly live up to their exceptional talents. Overall, a great comedy and a great film. 9.5/10 Bethany Cox"
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1332304",
      "warningSpoilers": false,
      "date": "3 April 2006",
      "rate": "8",
      "helpful": "77 out of 130 found this helpful.",
      "title": "Pure Lunacy",
      "content": "Well, if you want original humor, meaning something different than what you normally see - this is your ticket. The above statement was true 30 years ago, and still holds. It's just silly, far-out humor.It's not all winners, no comedy is, but there are enough of them, and enough classic bizarre scenes that it's always a hoot to re-visit this film from time to time. The only problem I have with it are the cheap shots in gives - in typical 1970s fashion - of anything Biblical. But, it's not that bad and most of the film is pretty innocent.It's pretty much one ludicrous scene after another. I mean, where else do you see a knight fighting on after his legs are chopped off, then his arms?!! Or a killer rabbit? It was almost like watching a Marx Brothers film 40 years later with '70s irreverence.Don't let the PG rating fool you. This would be an easy PG-13 today with all the blood, some cursing and the violence. I know some young kids, however - nice kids, too - who love this film as much as adults, so it can't be too offensive. If I had to describe this movie in one word it would be \"lunacy.\""
    },
    {
      "username": "Movie_Muse_Reviews",
      "userUrl": "https://www.imdb.com/user/ur2496397",
      "reviewLink": "https://www.imdb.com/review/rw2054845",
      "warningSpoilers": false,
      "date": "19 April 2009",
      "rate": "10",
      "helpful": "9 out of 11 found this helpful.",
      "title": "The most memorable comedy of all time",
      "content": "Name another context where the line \"your mother was a hamster and your father smelt of elderberries\" is funny. If it's not John Cleese as the taunting Frenchman or said in that very same obnoxiously fake French accent, it's about as funny as missing tea time.\"The Holy Grail,\" far and away the greatest comedic work of the Monty Python gang of Graham Chapman, Eric Idle, John Cleese, Michael Palin and Terry Gilliam is a masterful example of the power of improvisational humor and satire. It is also testament that nonsense, when executed properly, is brilliance.No comedy can even touch what King Arthur and the knights of the round table's divinely charged quest for the Holy Grail does. Whether it is a rant about various forms of government, a tragically flawed scientific logic for burning witches or knights who keep sacred words like \"Ni\" and demand shrubberies, just about everything in the film is memorable, quotable or at least highly enjoyed by those with bad recall abilities.The Middle Ages is perfect fodder for Monty Python, mixing a definite sense of history with tales of fantasy -- the ideal balance for satire and nonsensical fun. But truly, comedy is about timing and execution and no one does it better. The subtleties of \"I'm not dead yet\" and \"i'm getting better\" are examples. Delivered in another way they could miss the mark entirely, but the Python crew gets just about anything to be funny. A definite improvisational element keeps the scenes fresh and all the more hilarious.\"Holy Grail\" nails joke after joke and only lacks a satisfying end. Still, the sheer comedic genius of the rest of the film is so good that the whole unit is meaningless. You don't walk away thinking it's a bad ending, you start quoting the taunting Frenchman, or the leader of the nights who say \"Ni!\" or the Black Knight. That's what makes the film a true classic."
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw1224001",
      "warningSpoilers": false,
      "date": "24 November 2005",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Classic British Humor!",
      "content": "As we all know, the Brits have fantastic humor. They have brought us some of the finest comedies: Bridget Jones, Shaun of the Dead, Love Actually, etc. \"Monty Python\" is a classic comedy that should not be missed by anyone. I mean, seriously, these scenes and jokes are off the wall hilarious! \"Kanighets!\" and \"'Tis but a scratch\" were my favorite lines and scenes from the film. This is such classic and slapstick humor that I miss in movies these days. This film is rightly on the top 250 and is one of those films you should see before you die. Trust me, this is guaranteed laughter on the floor! If you don't laugh, you must be dead or something because I couldn't breathe while I was laughing so hard.10/10"
    },
    {
      "username": "josephrygaard",
      "userUrl": "https://www.imdb.com/user/ur26103399",
      "reviewLink": "https://www.imdb.com/review/rw5057347",
      "warningSpoilers": false,
      "date": "13 August 2019",
      "rate": "8",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Before Watching: Monty Python and the Holy Grail (1975)",
      "content": "\"Monty Python and the Holy Grail\" (1975) is a genius piece of British comedy. If you want to get as much out of it as possible, there are a few things you need to keep in mind before watching:This movie is absolute nuts. First some cautions, though - there is some gore and blood (although so over-the-top is comedic), a few scenes which might be classified as religiously offensive, and a longer scene which is highly sexually suggestive. All these things can be uncomfortable for people that are sensitive to the respective categories and should in that case be taken into account.As for the rest of the movie, it is insane. Humor is usually created when there is a plot-twist that deviates from one's expectations, and in that sense, this movie is nothing but humor. Its sole purpose is to make sure the viewer never stands steady and comfortable in what to expect, and that this the only expectation one can have. If quirky yet brilliant and genius humor like this is appreciated, Monty Python and the Holy Grail is an absolute feast, and make sure to watch the Special Editions that features the short \"Dentist On the Job.\"My personal grade: a hilarious 8/10. If you found this helpful, check my profile for more reviews."
    },
    {
      "username": "wwe7961",
      "userUrl": "https://www.imdb.com/user/ur23619158",
      "reviewLink": "https://www.imdb.com/review/rw2305248",
      "warningSpoilers": false,
      "date": "3 September 2010",
      "rate": "10",
      "helpful": "29 out of 44 found this helpful.",
      "title": "An example of why British humor is much smarter than ours.",
      "content": "This is how to make a comedy. Laughs can be found throughout, and the 4th wall falls apart throughout the film without any actors chewing the scenery. The movie from the first scene, and on is great. The acting is wonderful. Everybody in the cast delivers the jokes hilariously. Also the the actors never seem to overact at all. There are a few jokes that go on for to long, but it is aware of this. If only another comedy that doesn't deserve to have its name mentioned (cough Disaster Movie cough) was self-aware that the jokes it had were to long. It really is a shame that British people can say that they have awesome comedies like this, and we have a lot of awful comedies like (sigh) Disaster Movie. This film is a work of genius.4 stars out of 4"
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0993342",
      "warningSpoilers": false,
      "date": "6 January 2005",
      "rate": "10",
      "helpful": "8 out of 11 found this helpful.",
      "title": "It grows on you- it's one of the most delightful exercises in the ridiculous in cinema history",
      "content": "For years I did not watch or listen to Monty Python, and in retrospect I can't entirely remember why. I remember seeing a couple of scenes from \"The Holy Grail\" on television when I was younger (the notorious 'black knight' scene and the harem of girls in the castle) and not finding it uproarious as I might have expected. Maybe I'm just not into British comedy, I thought ignorantly. Then I finally gave into it, as I got to be a big fan of Terry Gilliam's films, and discovered as well that John Cleese is one of the funniest people to ever come out of Britain. Life of Brian was surprisingly witty and fun as it dug its claws into a subject of some controversy. Then I went on to this film, and it took two times to watch the film until I found it to definitely be a truly masterful effort in the delirious.The first time some of the jokes and gags and puns and visuals flew over my head, but as an emotional experience (if one could call it that) was immediate- many of the parts were funny as hell, even if I didn't think the whole was. The second time around everything fit, I laughed harder at the jokes I laughed at before, and I was officially a fan of the movie. Like another comedy classic than came out a year previous to Holy Grail, Blazing Saddles, the whole story is rather inconsequential when it comes to the set-pieces and actors in the various roles. King Arthur and the knights see a strange, God-like figure in the sky (my biggest laugh the first time around, one of many genius illustrations from Gilliam) who tells them to find the Holy Grail. So off they go, and encounter a plethora of trials and tribulations along the way.In fact, the whole film is an act of stream-of-consciousness (as was the television show, Flying Circus) where the animated bits are instrumental in taking the shape of the story, or 'skits' in the film. My personal favorites were the 'black knight', the knights who say 'ni', the 'killer rabbit' (one of the great comedy surprises I have had recently), and the boy who \"just wants to...sing!\". But even when a weaker bit might come along, it may be a bit that doesn't lack the fine visual detail and look provided by Gilliam and Terry Jones, or with some form of wit (i.e. I didn't find the \"bring out your dead\" scene as extraordinary, but I wouldn't doubt it's original).Although many say that Monty Python and the Holy Grail, which starts and ends with total disregard (and fitfully so) for all logical rules in storytelling, that it's one of the funniest films ever made (which it very well could be), I feel only very slightly reserved in recommending it to anyone. If you're in the mood for a bloody, moody, very low-budget dip into medieval satire by five of Britain's most talented writer/actors (not to mention to 'token' American), it's for you. But it may prove too silly, and maybe too sporadic, to work as a whole. One thing that I can say without a doubt, however, is that it serves as an audacious move in post-modern comedy. To put it another way, Monty Python (not just this film but the TV show, movies, and albums) were a major influence on the guys who do South Park. It's crude, odd fun practically by necessity- you know what you're getting right when \"Dentist on the Job\" is just 'accidentally dropped in before the movie even starts! A+"
    },
    {
      "username": "drystyx",
      "userUrl": "https://www.imdb.com/user/ur8977071",
      "reviewLink": "https://www.imdb.com/review/rw1544729",
      "warningSpoilers": false,
      "date": "14 December 2006",
      "rate": "10",
      "helpful": "13 out of 20 found this helpful.",
      "title": "Warning-you could laugh yourself to death",
      "content": "You really could laugh yourself to death watching this movie. It is nothing but hilarious. Monty Python keeps pounding and pounding you with gag after gag, and lead you down a road, but suddenly its a bridge, no, its an ocean. One of the things that really makes this hilarious is the grand spectacle that dazzles you with attention to grand sound effects, and then the next scene may be purposely cheap sets, all to make you laugh yourself to death. There is crude humor, and what I think can fairly be described as dark humor-you might not think its funny to see an animal with big teeth rip several knights to death, or a knight have his arms and legs cut off, but Monty Python will make you laugh at it. I personally think they're akin to Marx Brothers comedy, or Mel Brooks-hilarious with likable people in outrageous situations."
    },
    {
      "username": "tlcglitznglam",
      "userUrl": "https://www.imdb.com/user/ur4315882",
      "reviewLink": "https://www.imdb.com/review/rw1374528",
      "warningSpoilers": false,
      "date": "22 May 2006",
      "rate": "3",
      "helpful": "116 out of 172 found this helpful.",
      "title": "an acquired taste...",
      "content": "All my life I've heard how funny Monty Python and the Holy Grail was but I had never seen it. Being in college, a group of my friends all wanted to watch it so I decided to join, excited to finally see this movie for which I've heard so much praise. I could see how people find the movie funny but I could not get into it. I kept wanting to leave but was determined to see it through to its end... and actually, I'm glad I did because the ending \"credits\" where it's several minutes of music playing to a black screen was the only thing that made me laugh from the movie. I respect the movie because it so widely loved so I'm not trying to bash it, yet I definitely think, as with any sort of humor, it is not for everyone. There are countless types of humor: dry, sarcastic, physical, nonsense, political etc. and everyone has their own taste as to which they prefer. With a movie like Monty Python, which has a very certain type of humor attached to it, there are bound to be those who dislike it. I only leave this comment to let those of you who have not yet seen the movie hear a \"different\" sort of opinion, as nearly all of the comments here highly praise the movie."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2967605",
      "warningSpoilers": false,
      "date": "24 February 2014",
      "rate": "8",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Ground breaking iconic movie",
      "content": "King Arthur (Graham Chapman) is traveling around looking for knights to sit with him at the round table. After gathering several knights, God comes to them with a quest to retrieve the Holy Grail.This is the ground breaking comedy that introduced so many to the offbeat humor of Monty Python. The comedy is sweet and charming. It starts right off the bat with the rolling of the moose credits. The movie is comedy legend and holds up well over time. The jokes are still good, whether it's Michael Palin tempted at Castle Anthrax or the killer rabbit. Sure it's very geeky to watch and enjoy this although it's a little bit more sophisticated than it appears."
    },
    {
      "username": "jameta4all",
      "userUrl": "https://www.imdb.com/user/ur7371687",
      "reviewLink": "https://www.imdb.com/review/rw1303287",
      "warningSpoilers": false,
      "date": "28 February 2006",
      "rate": "",
      "helpful": "24 out of 29 found this helpful.",
      "title": "You'll love it or hate it",
      "content": "Monty Python will always be loved or hated depending on your personality. And this is Monty Python at its typical best. If you like daft jokes, killer fluffy animals, bad accents and intelligent discussions that will most likely go over your head the first time round, then you will love The Holy Grail.The jokes vary from obvious visual puns (coconut halves to represent horses) and audio puns (\"I am Roger the Shrubber\") to more subtle and intelligent jokes (\"I thought we were an autonomous collective\" / the Witch-burning scene). The greatest thing about the Holy Grail is that there's something for everyone. No one is left out.What many don't realise is the sophisticated intelligence behind the jokes that many of later generations don't understand (back in the Life of Brian - Romani Ite Domun - which wouldn't have such impact on the youngsters who never had to suffer through Latin classes) such as the witch burning scene, where it was true that any means possible was used to warp the natural and legal laws to create the desired result i.e. one less warty woman in the village, and how the mish-mash of Celtic tribes were suddenly forced to become a diplomacy (\"Strange women lying in ponds distributing swords is no basis for a system of government. Supreme executive power derives from a mandate from the masses, not from some farcical aquatic ceremony!\"). It always reminds me of Blackadder - how so many great jokes were wasted by bad timing or bad judgement on the audience's vocabulary.And for those who can't keep up with historical jokes, there's the Black Knight, Tim, and Zoot to keep you occupied. They sure as hell make me laugh.So if you like daft humour, go for it! But promise to check out the subtle jokes as well. It's worth the effort, and you'll learn a little about history too."
    },
    {
      "username": "crazychap",
      "userUrl": "https://www.imdb.com/user/ur3714584",
      "reviewLink": "https://www.imdb.com/review/rw0972267",
      "warningSpoilers": true,
      "date": "4 December 2004",
      "rate": "",
      "helpful": "13 out of 18 found this helpful.",
      "title": "Fetchez la vache",
      "content": "I also recommend anyone to see this film, otherwise, I will \"fetchez la vache\", which is among my favourite lines of the movie. I saw it first when I was a kid but I didn't really get it-- obviously, you don't understand what social critique and mockery are when you're 9 years old. But when I saw it again recently, I just bursted out with laughter, from the deliberate errors in the opening credits to the French Guards to the killer rabbit and so forth. For 90 minutes, Me and my flatmate laughed out so loudly that Sarah, one of our neighbours, almost called the police on us-- I didn't see any reason why she should. She didn't do it because she eventually went along and laughed out loud, too! I dated her for that 3 days later!"
    },
    {
      "username": "padiyark",
      "userUrl": "https://www.imdb.com/user/ur0746867",
      "reviewLink": "https://www.imdb.com/review/rw2518498",
      "warningSpoilers": false,
      "date": "14 November 2011",
      "rate": "10",
      "helpful": "13 out of 19 found this helpful.",
      "title": "Now watch this movie or I shall taunt you for a second time!",
      "content": "I will preface this by saying that while I'm not a big Monty Python fan, when they get it right, it is brilliant. The show had some great sketches, but some were just bizarre and incomprehensible. The movie is 100% on the mark, starting from the titles with subtitles to its off the wall ending.It would be a disservice to explain the movie and the great scenes in this review. But a few things to note.First, when you take into account that this film was done in 1974, most medieval movies of the time were glamorous set pieces with handsome knights and beautiful princesses. The Pythons skewered this notion completely: Arthur and his knights were commonplace blokes, and the sets were in some muggy, ugly areas. This may have been a budgetary issue, but interestingly enough, they probably depicted medieval England more authentically than even films nowadays.Second, the amount of times the fourth wall is broken are numerous, and just goes to shows how dementedly hilarious the movie gets, but yet still holds the story well.That said, if you have never seen Monty Python (who hasn't?), this is a whole different level of comedy--yes, silly is about right, but not in the crude \"Paul Blart\" or \"Larry the Cable Guy\" type of silly, but at the same time, not the cerebral \"Dr. Strangelove\" type of silliness.Must watch."
    },
    {
      "username": "moviemeister1",
      "userUrl": "https://www.imdb.com/user/ur2507545",
      "reviewLink": "https://www.imdb.com/review/rw0984350",
      "warningSpoilers": true,
      "date": "23 December 2004",
      "rate": "10",
      "helpful": "23 out of 35 found this helpful.",
      "title": "Much fun inside",
      "content": "This has got to be one of the side-splittingly funniest films of all time.No one can deliver such cerebral humor as the pythonians,and this is truly their finest hour(OK,so its about an hour and a half).This film doesn't even wait for the show to begin to start you laughing,it goes for the throat during the opening credits(sorry I don't want to ruin it for you).It made me laugh till my tears were crying.If you are a single chap, and you want to know if a certain girl is right for you,then try this.Bring her to your home,cook her a wonderful meal,complete with a great bottle of wine,then plop her down in front of the telly and start this video(or DVD,whatever).If she is not laughing hysterically within ten minutes,then turn off the box,and break up with her immediately,as she has an impaired humor center in her brain(and will only cause you tremendous misery in the coming years).I only wish I had known of the \"python Challenge\" during my dating days.It would have saved me years of unremitting heartache(as well as thousands in legal fees). Please trust me on this one,it might just save your life.I give this movie an unrepentant 10,but would give it a 20+ if it were an option."
    },
    {
      "username": "gregory-anderson-2",
      "userUrl": "https://www.imdb.com/user/ur9919264",
      "reviewLink": "https://www.imdb.com/review/rw1340312",
      "warningSpoilers": false,
      "date": "13 April 2006",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Beautiful Absurdity",
      "content": "To watch this film aptly you must know three things. First, you must expect no overarching narrative. Second, you must realise these characters will be one-dimensional, at best. And third, you must tell me what is average air-speed velocity of an unladen swallow? Pray that you must never cross the gorge of eternal peril. Except when venturing near Castle Anthrax, where the punishment of oral sex with 17-19 blondes and brunettes awaits the foolhardy. Instead sit down, stay still, and appreciate the consistently spot-on sketches from the Python boys.Now for something completely different. This is a mind-expanding film, scathing of the mythology that built these fair islands of Blighty. Classic lines, completely confident, a crew and cast having fun. This is a film to show your grandchildren. Just remember to ask them, \"African or European?\" AAA..."
    }
  ],
  "errorMessage": ""
}