{
  "imDbId": "tt6966692",
  "title": "Green Book",
  "fullTitle": "Green Book (2018)",
  "type": "Movie",
  "year": "2018",
  "items": [
    {
      "publisher": "Film Threat",
      "author": "Andy Howell",
      "link": "",
      "rate": "90",
      "content": "Green Book is a real crowd pleaser — aside from the banter between the oppositely-minded characters, it has clear heroes and villains. The writers do manage to sneak a few nuances in, especially when discussing Shirley feeling out of place in both the white and black communities."
    },
    {
      "publisher": "Film Journal International",
      "author": "Kevin Lally",
      "link": "https://www.boxofficepro.com/",
      "rate": "85",
      "content": "There’s something almost inevitable about these real-life characters getting a feature showcase, so unusual, engaging and inspiring is their journey from antagonism to deep friendship."
    },
    {
      "publisher": "Variety",
      "author": "Peter Debruge",
      "link": "https://variety.com/2018/film/festivals/green-book-review-1202937442/",
      "rate": "80",
      "content": "Featuring a pair of terrific performances by Viggo Mortensen as a goombah with a heart of gold and Mahershala Ali as multilingual composer-musician Don Shirley, the story may be unique, yet it goes pretty much exactly the way you might expect."
    },
    {
      "publisher": "IndieWire",
      "author": "Eric Kohn",
      "link": "https://www.indiewire.com/features/general/green-book-review-viggo-mortensen-mahershala-ali-tiff-2018-1202002888/",
      "rate": "75",
      "content": "It’s an obvious but enjoyable period piece — and a throwback to another era of Hollywood filmmaking, resurrected in the 21st century with two of the best actors working today, who elevate this didactic form of storytelling above the market standard for schmaltz."
    },
    {
      "publisher": "The Playlist",
      "author": "Victor Stiff",
      "link": "",
      "rate": "75",
      "content": "Green Book is an on-the-nose social commentary that is told with such craftsmanship, earnestness, and comedic expertise that you’re still excited to go along for the ride."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Jake Cole",
      "link": "",
      "rate": "75",
      "content": "Peter Farrelly manages to respect the severity of the characters’ social context while ensuring that Green Book never steps outside its protagonists’ relationship, a delicate balancing act that credibly makes a feel-good, effervescent comedy out of its thorny subject matter without ever sanitizing it."
    },
    {
      "publisher": "Movie Nation",
      "author": "Roger Moore",
      "link": "https://rogersmovienation.com/2018/10/25/movie-review-green-book-is-cinematic-comfort-food-for-the-holidays/",
      "rate": "75",
      "content": "Green Book invites you to come along for the ride, the comfort food, the socio-political sparks and the laughs."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Todd McCarthy",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/green-book-review-1142433/",
      "rate": "70",
      "content": "Distinctive and amusing turns by Viggo Mortensen and Mahershala Ali make Peter Farrelly’s first solo feature outing a lively and likable diversion."
    },
    {
      "publisher": "The Guardian",
      "author": "Benjamin Lee",
      "link": "https://www.theguardian.com/film/2018/sep/11/green-book-review-charming-deep-south-road-trip-is-worth-taking",
      "rate": "60",
      "content": "There’s clearly a more nuanced drama to be made from this story but given the scale, there’s still a lot here to praise."
    },
    {
      "publisher": "Screen Daily",
      "author": "Tim Grierson",
      "link": "https://www.screendaily.com/reviews/green-book-toronto-review/5132594.article",
      "rate": "60",
      "content": "Green Book is a thoroughly predictable and conventional true-life drama, but at least Viggo Mortensen and Mahershala Ali make for decent company along the road."
    }
  ],
  "errorMessage": ""
}