{
  "imDbId": "tt6966692",
  "title": "Green Book",
  "fullTitle": "Green Book (2018)",
  "type": "Movie",
  "year": "2018",
  "items": [
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw4591778",
      "warningSpoilers": false,
      "date": "19 January 2019",
      "rate": "10",
      "helpful": "585 out of 661 found this helpful.",
      "title": "I Was Captivated",
      "content": "I saw Don Shirley perform in college in 1966. At the time I simply thought he was a hell of a pianist, using that bass and cello to come up with a unique sound. So when this movie came along, I thought \"I saw that guy!\" I know the critics are being hard on this film, but I sat for two hours, totally captivated. I know there are stereotypes. Could that be because the repeated actions against minorities and the actions of racists have become so commonplace they seem like stereotypes. I believe the performances of these two fine actor made the show. There is a subtlety to this movie that transcends many others of its type. Yes, there are Southern cops; yes, there are men's rooms that are off limits; yes, there are simplistic views of racism by white New Yorkers. But what I got was a realistic presentation of an evolving friendship. Shirley is abrasive and self-centered; Lip is clueless most of the time. And I believed in them. See this film."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw6517374",
      "warningSpoilers": false,
      "date": "23 January 2021",
      "rate": "10",
      "helpful": "49 out of 54 found this helpful.",
      "title": "A captivating watch, with sensational acting.",
      "content": "Not often these days so I give ten stars to a film, with Green Book however, I had no other choice, this film had me totally captivated.It's a fascinating story, I had no idea that it was based on true events, temporarily losing his job at a club, Tony Lip Vallelonga gets a job driving for Doctor Don Shirley. Shirley has a specific reason for touring in the deep south.It's one hell of a journey (I know it's a term that's easily bandied about in films, but it's appropriate here,) physically and emotionally, it's a battle of wills, ideas, concepts, each man learns something from the other. You see the true horror of what Shirley faced in day to day life, from buying a suit, to eating dinner.The acting, is simply outstanding, you couldn't put a pin between Viggo Mortensen and Mahershala Ali, the pair are unbelievable in this film, it's no wonder awards came flooding in.It looks sensational, they brought 1962 to life, and the music throughout is spot on.I laughed, I sobbed, I connected, a cinematic triumph, Green Book is an incredible film. 10/10."
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5483344",
      "warningSpoilers": false,
      "date": "14 February 2020",
      "rate": "",
      "helpful": "152 out of 175 found this helpful.",
      "title": "Green Book",
      "content": "This film proves why movies can be so powerful with a touching, poignant and some times funny story of opposites attract. Enjoyed every moment although it isn't always easy to watch. Mortenson and Ali shine and there are strong supporting roles as well."
    },
    {
      "username": "Instant_Palmer",
      "userUrl": "https://www.imdb.com/user/ur39322316",
      "reviewLink": "https://www.imdb.com/review/rw5855443",
      "warningSpoilers": false,
      "date": "26 June 2020",
      "rate": "9",
      "helpful": "89 out of 99 found this helpful.",
      "title": "Ranks #5 on my IMDb Top 25 Best Buddy Films List. A Feel Good Movie at its Core",
      "content": "Ignore the sour grapes criticism from Spike Lee. This was THE best film of 2018, and one of the best-ever feel-good buddy/road films. There is something very sincere about this film - it is understated in its messaging, and keeps the focus on the evolving bond and respect that grows between two polar opposite personalities. A well-made film, with first-rate acting, that makes you feel this good without feeling \"manipulated\", is a rare treat indeed. Highly recommended."
    },
    {
      "username": "taylor_king-890-815491",
      "userUrl": "https://www.imdb.com/user/ur24207576",
      "reviewLink": "https://www.imdb.com/review/rw4477733",
      "warningSpoilers": false,
      "date": "25 November 2018",
      "rate": "10",
      "helpful": "742 out of 857 found this helpful.",
      "title": "\"Green Book\" is Gold",
      "content": "We loved Green Book along with the sold-out crowd who applauded loudly at the end. Based on true story of piano virtuoso, Don Shirley's road trip through the south during the 60's, the film pays tribute to his genius and courage as a black man who tries hard to soar above the ugliness of the times. The elegant trappings of his home and his success as a concert pianist leave him arrogantly cold and lonely, but his life begins to change when he hires Tony as his road trip driver. With a history as nightclub bouncer with Mafia connections in New York, Tony is the antithesis of Don's perfection and their evolving relationship on the road makes the movie soar above the ordinary and become magical. Viggo and Ali in the main roles are remarkable, and it's funny and endearing to watch them discard stereotypes and discover their mutual humanity. What we liked best is the movie teaches without preaching, it all unfolds through a myriad of natural moments between two great actors and a strong supporting cast. Top all this off with a really good soundtrack, excellent direction and production values, and an audience that laughed out loud and vigorously applauded at the end...this one is a true 10!"
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw4700597",
      "warningSpoilers": true,
      "date": "5 March 2019",
      "rate": "9",
      "helpful": "18 out of 20 found this helpful.",
      "title": "\"It takes courage to change people's hearts.\"",
      "content": "In an awards season that offered five Best Picture nominations based on real life stories, that might have been a record in itself. Having seen them all, I think the Academy probably got it right this year in celebrating \"Green Book\" as it's big winner. It does tend to be formulaic in it's treatment of a white racist working for a black professional musician, who by their association come to understand a little bit about each other and form a bond that survives their two month road trip. But the relationship between Dr. Don Shirley (Mahershala Ali) and Tony 'Lip' Vallelonga (Viggo Mortensen) is never sugar coated. The dialog between the two men is unusually grating most of the time to be funny, though there are moments of humor that break through. It's hard to imagine how this association came to be in the first place, as the two men are so diametrically opposed in temperament, style and erudition. But underlying Tony's acceptance of a job offer came a profound sense of honor and loyalty to his employer, one that couldn't be shaken by mob acquaintances, dirty cops, or genteel elite who profess surface politeness while refusing service to a member of the black race. What particularly struck me was how the only time Dr. Shirley looked really happy was when he played at the Orange Bird saloon in the Deep South, casting aside his refined demeanor to really play his heart out for an audience that responded so enthusiastically. What the two men learn about each is directly at the heart of the story, one which transcends race, religion and background in an effort to understand what makes people similar rather than the differences that keep them apart."
    },
    {
      "username": "Top_Dawg_Critic",
      "userUrl": "https://www.imdb.com/user/ur64798417",
      "reviewLink": "https://www.imdb.com/review/rw4554831",
      "warningSpoilers": false,
      "date": "2 January 2019",
      "rate": "8",
      "helpful": "159 out of 210 found this helpful.",
      "title": "A perfect example of Yin & Yang - and black and white has nothing to do with it.",
      "content": "Outstanding true story film showing that color doesn't define us, but how we act ourselves and towards others, does.Great performances from the entire cast, especially Viggo Mortensen and Mahershala Ali who were perfectly cast and convincing in their roles. It was also great to see comedian Sebastian Maniscalco in this film as well.Writer, director and producer Peter Farrelly nailed every aspect of this biography.The score, cinematography, sets and visuals were all on point.I'm not a fan of slow paced long films, but this was was close to an exception. I feel if the pace was picked up a bit and/or the 130 min run-time edited down to around 110 mins, this would have been a perfect 10 from me.Excellent drama and comedy perfectly positioned throughout the film.A well deserved 8/10 from me."
    },
    {
      "username": "BassLightyear",
      "userUrl": "https://www.imdb.com/user/ur68099745",
      "reviewLink": "https://www.imdb.com/review/rw4687918",
      "warningSpoilers": false,
      "date": "26 February 2019",
      "rate": "7",
      "helpful": "230 out of 264 found this helpful.",
      "title": "A review as a respons to other (negative) reviews.",
      "content": "I understand why a lot of critics don't like this film, but at the same time I feel like they're making up their minds about what they think the movie is - or should - be about. They (who disagree with the film) will say that it diminishes the horrors that the black community faced in America during the 50's - and because of that they think it's a bad film. But I thought it was a good film; in my opinion it's not a movie about Shirley and his struggles facing ruthless racism - it's about Tony Lip's psychologically reforming journey changing his mind about black people through the witnessing of Shirley's experiences. And it's that central story line the critics are disagreeing with and eschews the whole film on the premiss that it should've been about something else (Shirley journey - not Tony's).There are thousands - if not millions - of films about racism towards black people and their culture, and Green Book had a different perspective than the rest of them - by not focusing on the racism but on how the racism changed a man who wasn't a target of it. But that's obviously a big no-no according to these critics.To me Green Book is about a white man thoroughly changing his whole mindset about something that he'd been conditioned to abide to his whole life."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw5312777",
      "warningSpoilers": false,
      "date": "10 December 2019",
      "rate": "8",
      "helpful": "32 out of 40 found this helpful.",
      "title": "A re-awakening journey",
      "content": "My main reason for watching 'Green Book' was due to me wanting to see as many 2018 films as possible, and that it had won the Best Picture Oscar (so naturally wanted to see too that it was that good). Like Viggo Mortensen as an actor, the film's concept was appealing and it looked appetising. Word of mouth, including from very trusted friends online and in real life, was very positive so there were plenty of other reasons too.'Green Book' turned out to be when watching a very good film and nearly a great one with many fantastic things. Wouldn't go as far to say that it is my favourite film of 2018, and as far as the other Best Picture nominees go there was a preference for 'Roma' and 'The Favourite', but if to put it in a group of either best, solid middle and worst films of the year 'Green Book' would be closest to being in the best category of those three groups. It is a very, very well done film and its good intentions are evident throughout and noble.It could have done with more grit in places, really do appreciate that it was trying not to be heavy-handed or trying to offend with a quite heavy theme but they could have done more with it and given a little more depth to what there was. Not saying it wasn't there, quite the contrary, just wish there was more.Credit is due for the laudable and successful efforts in making the story accessible and it is one that easy to like and get into, but actually it could have afforded to do a little more risk-taking and have a little more complexity.Viggo Mortensen though brings a lot of charm and entertainment value to his role, and Mahershala Ali is a dignified and very moving contrast. Their chemistry is wholly natural and beautifully irresistible (never feeling contrived or rushed) which provides a lot of 'Green Book's' heart, while their characters are more than just characters and instead feel very human. This is very different territory for director Peter Farrelly and it is surprisingly restrained direction from him and it suits the material very well. It's a lovely looking film too and affectionately photographed, while the music is beautifully chosen and fitted some nice nostalgic song choices here.The script is thoughtful, charming and also moving, and regardless of anybody feeling that it is a little too accessible and could have done with more grit the story kept me riveted and left me moved, inspired and like my heart had been warmed. The YMCA scene is a powerful one and a character development turning point handled beautifully.Summing up, one of those very good and nearly great films. 8/10"
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw4681925",
      "warningSpoilers": false,
      "date": "23 February 2019",
      "rate": "7",
      "helpful": "332 out of 491 found this helpful.",
      "title": "Not to say it isn't a decent movie...",
      "content": "... just that it's so inoffensive, safe, and cliche that I feel like I've seen it a million times before. Mortensen and Ali are terrific actors, and I am thankful for them. Without their charisma (and Viggo's willingness to shove insane amounts of food down his throat), I fear Green Book would be dead on arrival.Mostly, I think this is a movie that's desperately afraid of 'offending' anyone. For instance: if there's a scene with racist cops, there will also be a scene with a good cop down the road, just to make clear that the movie is not stating or suggesting that 'all cops are/were racist'. It's also funny that the good-cop scene happens in the snow, to let us know the characters are back in a blue state, where supposedly life wasn't so bad for a black man after all! This is one of the many simplistic moves that indicate to me that the filmmakers were willing to sacrifice the complexities of their themes for a feel-good entertainment.The script wants both characters to 'learn' from each other and eventually change and grow, but to make this happen, it turns them into unrealistic caricatures. It's a bit frightening how Shirley is portrayed as a complete ignorant of black culture, but it had to be this way so Tony can be the one to 'introduce' him to it. Tony's transformation comes simply from witnessing racism first hand, as if he never experienced such a thing in his life before - maybe another consequence of this being a blue state-red state movie??So besides the performances, that speak for themselves, I think it's a very uninspired effort. At one point the characters leave the car for no reason other than to have a dramatic confrontation in the rain, as if rainy night equals 'dramatic weight'. I saw it in a packed movie theater and people seemed to enjoy it. You can't blame them. The movie has a 'now everything's fine' conclusion that can leave audiences in a good state of mind - but it also shows how simplistic it really is."
    },
    {
      "username": "Art Snob",
      "userUrl": "https://www.imdb.com/user/ur0109692",
      "reviewLink": "https://www.imdb.com/review/rw4353903",
      "warningSpoilers": false,
      "date": "22 September 2018",
      "rate": "9",
      "helpful": "322 out of 407 found this helpful.",
      "title": "Critic-proof festival hit should be big holiday winner",
      "content": "Some of my movie friends were stunned when I mentioned in a thread that this was my \"People's Choice Award\" vote for TIFF 2018 (it won, btw). I generally go for weightier fare, so my being won over by a PG-13 road film with the familiar \"they-couldn't-have-been-more-different\" premise directed by the auteur co-responsible for such recent classics as \"Dumb and Dumber To\" and \"The Three Stooges\" elicited a virtual double-take.But I couldn't help it ... it really WAS the best film I saw (out of 17), and far and away the most entertaining. I think this is largely because it's based on a real-life story about the beginning of a lifelong friendship - a story that has writing participation by the son of one of the real-life characters. There's definitely an air of authenticity to the events as they unfold that could never occur with a purely contrived plot. Consider: A college-educated concert pianist of Jamaican descent hires a temporarily-unemployed Italian-American nightclub bouncer who's streetwise but academically dim to drive him to venues in the Deep South back in 1962. That's not a setup that a Hollywood script written from scratch would ever have come up with.The two lead actors really click. Mahershala Ali makes a nice Oscar follow-up playing the aloof pianist passenger to Viggo Mortensen's \"b.s. artist\" driver. Ali is certain to get another nomination; Mortensen's performance may be a little too broad to garner one, but he delivers exactly what's called for. And he makes a believable Italian-American, which is impressive considering that he's Danish.I'm allergic to preaching and heavy-handedness in movies no matter what the message, and with the exception of one borderline scene, I'd say that the movie nicely sidesteps these proclivities that surface so often in socially-conscious films.The music and FX are excellent. When an actor plays a piano player, there's always the challenge of making the playing look believable. It doesn't get any better than it gets here - Ali's piano playing is every bit as convincing as Margot Robbie's ice skating in I, TONYA. You never see a disconnect between hands and body as he's filmed against a variety of backgrounds. And if I could bet on an Oscar win right now, it would be Kris Bowers for Best Original Score. (He also supplies Ali's hands, which should clinch it.)Top everything off with a Capra-esque Christmas Eve finale and a closing line that sends everyone home smiling, and it all adds up to a monster hit. Its commercial payoff could be huge - the movie practically begs for a TV series spinoff, and the real-life characters remained friends until they both died in 2013.So congratulations to Peter Farrelly on his graduation from co-directing lowbrow fare to solo-directing middlebrow (i.e. mass-appeal) fare. You can't deny the talent and craftsmanship it takes to make a mainstream movie that works as well as this one does."
    },
    {
      "username": "martindonovanitaly",
      "userUrl": "https://www.imdb.com/user/ur83434961",
      "reviewLink": "https://www.imdb.com/review/rw4536868",
      "warningSpoilers": false,
      "date": "26 December 2018",
      "rate": "8",
      "helpful": "623 out of 702 found this helpful.",
      "title": "Are We There Yet?",
      "content": "A journey of reawakening in a Country like ours - Gore Vidal called it the United States Of Amnesia - the absurdity of the behavior in the Southern communities even the kindest ones have a jarring effect. Viggo Mortensen is sheer perfection as the all American Italian. The opening of his heart and of his mind is a total joy and Mahershala Ali provides another magnetic character to his already rich list of magnetic characters but what makes this film fly so high is the humanity that Mortensen and Ali infuse their characters with. I loved them and Green Book provided me with one of the most satisfying endings of 2018. It leaves you with the hopeful thought that perhaps we're not there yet but that we are on our way. Happy New Year!"
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw4687347",
      "warningSpoilers": false,
      "date": "26 February 2019",
      "rate": "9",
      "helpful": "27 out of 36 found this helpful.",
      "title": "America in the Early 60´s",
      "content": "In 1962, the Italian-American Tony \"Lip\" Vallelonga (Viggo Mortensen) is as family man happily married with children with his beloved wife Dolores (Linda Cardellini). When the night-club Copacabana where he works as a bouncer closes for two months to be refurbished, Tony needs to find a two-month job to support his family. He accepts to become the driver of the classical Afro-American pianist Dr. Don Shirley (Mahershala Ali) in a tour with two other Caucasian musicians through the racist South of America. He receives a Green Book, a travel guide with references of safe locations to black people and along their journey, they develop friendship and respect for each other.The Oscar winner \"Green Book\" is a great film that discloses the racial segregation in the early 60´s in America. The touching story of friendship and injustice has magnificent performances of Viggo Mortensen and Mahershala Ali. The screenplay blends drama, music and comedy and is based on a true story. \"Green Book\" is a film that really deserves the Oscar. My vote is nine.Title (Brazil): \"Green Book: O Guia\" (\"Green Book: The Guide\")"
    },
    {
      "username": "MrDHWong",
      "userUrl": "https://www.imdb.com/user/ur18374284",
      "reviewLink": "https://www.imdb.com/review/rw4602997",
      "warningSpoilers": false,
      "date": "24 January 2019",
      "rate": "9",
      "helpful": "10 out of 11 found this helpful.",
      "title": "A delightful road movie with terrific performances from both of its actors",
      "content": "Green Book is a comedy-drama film directed and co-written by Peter Farrelly (Dumb & Dumber, There's Something About Mary). Starring Viggo Mortensen and Mahershala Ali, it is a delightful road movie with terrific performances from both of its actors.In 1962, New York bouncer Frank \"Tony Lip\" Vallelonga (Viggo Mortensen) is looking for extra money after the nightclub he works at closes for renovations. Thanks to one of his friends, Tony lands a job as a chauffeur for \"Doc\" Don Shirley (Mahershala Ali), a talented African-American pianist embarking on a concert tour of the American Deep South. Due to the strong animosity against African-Americans in the Deep South, Tony is required to take on extra work along the way as he is also required to use his skills as a bouncer to protect Doc and ensure he has a safe journey with his band.Heartfelt and funny, Green Book takes what could have been another generic road trip movie and turns it into one of the most interesting depictions of an otherwise unlikely friendship. Viggo Mortensen and Mahershala Ali have superb chemistry with each other and the film's witty screenplay frequently had me looking forward to every moment of dialogue between both of them, especially during the driving scenes. The film also does a fantastic job of establishing the prejudiced atmosphere of the American Deep South in the 1960s without making its citizens seem too much like caricatures of typical white supremacists. Director Peter Farrelly near-flawlessly balances the film's comedy and drama, which is surprising as he is primarily known for his work only in the former genre. He has certainly shown he is more than capable of handling films like this and I am hopeful he can keep this up in any future projects he may end up involved in.I rate it a solid 9/10"
    },
    {
      "username": "Lotus-3",
      "userUrl": "https://www.imdb.com/user/ur0245282",
      "reviewLink": "https://www.imdb.com/review/rw4345399",
      "warningSpoilers": false,
      "date": "18 September 2018",
      "rate": "9",
      "helpful": "465 out of 547 found this helpful.",
      "title": "Greatful to have seen this",
      "content": "I saw this at the premier at TIFF and was thrilled to learn the story is about a real friendship. This is not a typical road movie, or buddy film. Given the lead actors, I knew it would be something special, and it is. Entertaining, funny in parts, hard to accept in others - as a white american who wasn't around in the 1960's, the racism was mind boggling and I couldn't help but feel shame. Green Book has so many layers - family, culture, honesty, dignity, genius, respect, acceptance, stereotypes, racism, music, class, friendship, and fried chicken. Whatever your views, race, or age - this film is not 'preachy', but you should appreciate an honest portrayal of a difficult time & place in history. I'll use the term an \"unlikely friendship\", but knowing the two men were real makes it fantastic. I'm so grateful to have learned about them and their lives. I only wish there had been a Q&A afterward."
    },
    {
      "username": "rphshell",
      "userUrl": "https://www.imdb.com/user/ur85295821",
      "reviewLink": "https://www.imdb.com/review/rw4480504",
      "warningSpoilers": false,
      "date": "26 November 2018",
      "rate": "10",
      "helpful": "327 out of 420 found this helpful.",
      "title": "Finally...Well-written, well-acted Movie",
      "content": "This picture should be up for BEST PICTURE. It has everything: great acting, solid script-writing (something that Hollywood really needs), and lots of humor. I wish that Hollywood would make more pictures like this."
    },
    {
      "username": "perica-43151",
      "userUrl": "https://www.imdb.com/user/ur89494061",
      "reviewLink": "https://www.imdb.com/review/rw5422540",
      "warningSpoilers": false,
      "date": "20 January 2020",
      "rate": "9",
      "helpful": "16 out of 19 found this helpful.",
      "title": "Very authentic",
      "content": "This is a nice movie with a very authentic story behind it. Both lives of the genius composer-musician, and his once driver tough-Italian guy, who ended up acting in mafia movies and series from Godfather to Sopranos, together with his son who won 2 Oscars, are very interesting, and the story has its authenticity to stand as its greatest strength. This is how it was in the 60s. Well acted it gives a piece of that atmosphere, it is not the most stylistically innovative movie, but it is not the point. The story, which comes-off initially as anti-Italian, wins you over slowly by its charm, and the fact that it was written by Italian son of one of the protagonists, reveals that it is sincere and gently self-mocking, but with the heart in the right place, exactly like the unlikely duo - not perfect, but entirely and heartwarmingly human. In the writing since the 80s, it gives 0 fs about the PC hyst eria, and can in fact teach our dear ment ally deficient woke friends what is the true face of disc rimination and how the real life heroes of the 60s, that they would in their stup ididty surely despise, in fact look like."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw4680213",
      "warningSpoilers": false,
      "date": "22 February 2019",
      "rate": "7",
      "helpful": "24 out of 34 found this helpful.",
      "title": "heart's in the right place",
      "content": "It's 1962 New York City. \"Tony Lip\" Vallelonga (Viggo Mortensen) is a nightclub bouncer and a tough guy ingratiating himself with gangsters. When his workplace gets shut down for a two month renovation, he gets a job driving peculiar classical pianist Dr. Don Shirley (Mahershala Ali) to his concerts in the deep south.There are issues but the movie has its heart in the right place. I don't mind the racist Tony Lip finding redemption and friendship in Shirley. Viggo is doing it pretty broadly but the main problem is Shirley. There are scenes where Farrelly is desperate for humor but it only heightens my disbelief. First is the cringeworthy KFC. It's crazy that a man has never had fried chicken despite coming from the south. The point should have been that he prefers not to eat fried chicken (and watermelon and collard greens and grits). It's not that he doesn't like it. He avoids it to avoid his roots. The same goes for the music. He's a musician for heaven's sake. Maybe he's not up to date but he had probably studied aspects of modern music and he's probably met a few of those artists. It's all wrong. His broadly played homosexuality is also a little awkward. I was really scared where Farrelly was taking that until it was saved by Tony who as a nightclub bouncer claims to have seen it all. It's a nice surprising twist to his character and in keeping with his transactional nature. Even the letter writing could be improved if some forethought had occurred. There is no reason why Dolores would go gaga over the letters when she suspects that it's Shirley's writing. She should hold back on the affection with the other girls going gaga. Only when she gets the house letter does she goes head over heels. It would show that she knows him best. These little nagging issues keep the movie from being great although I still enjoyed it."
    },
    {
      "username": "SeriousMayhem",
      "userUrl": "https://www.imdb.com/user/ur27886138",
      "reviewLink": "https://www.imdb.com/review/rw5492085",
      "warningSpoilers": false,
      "date": "17 February 2020",
      "rate": "9",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Easy to digest and heartwarming feelgood movie",
      "content": "While you could argue if the topic raised in the movie is really suited for a feelgood movie such as this, when the credits rolled, I could wholeheartedly say yes.For once it's not dark, gloomy and preachy drama about America's 1960's racism. No, this is an uplifting and hopeful tale of two men, getting closer together and evolve beyond the beliefs they have been brought up with or the semi-hardcoded (mis)conceptions of things that simply are a certain way for them, mostly because of groupthink and indirect group pressure to behave a certain way.The acting is strong and I especially liked Viggo Mortensen's portayal of Tony Lip, even if he came across as a bit of a caricature at times. The same issue I had with a couple of supporting characters.Mahershala Ali gives an equally strong performance, even though his character has some small flaws when it comes to believability.I found myself being able to easily ignore any flaws because I just really liked the movie as a whole.The story is easy to digest and despite the topic, not very deep, but that is fine. We know what it is about, and that is more than enough in this case. It also knows when it's a tearjerker and it's not ashamed of it.You can top it all off with beautiful classical and sixties era music.All in all, a very entertaining and loveable movie. 9/10, well deserved."
    },
    {
      "username": "MOscarbradley",
      "userUrl": "https://www.imdb.com/user/ur1683855",
      "reviewLink": "https://www.imdb.com/review/rw4584553",
      "warningSpoilers": false,
      "date": "15 January 2019",
      "rate": "9",
      "helpful": "34 out of 55 found this helpful.",
      "title": "A good old-fashioned feel-good movie",
      "content": "If \"Green Book\" does win the Oscar for Best Picture, as some people think it might, then I for one won't complain. There are, of course, better pictures, (\"Roma\" and \"The Favourite\" to name two), but this extremely well-made, nicely directed, intelligently scripted, (if at times a little too obvious in its heart-tugging sentimentality), and very well acted movie ticks all the boxes. It's a feelgood film of the old-fashioned kind that can look back at the bad old days of segregation rather smugly from its 21st Century perspective without feeling particularly smug.It's a movie about how two mismatched people, (a chain-smoking, rough speaking Italian-American and an African-American you might even call 'uppity'), who, on a long road trip in the Deep South in the early sixties, bestow on each other the gifts of friendship and humanity. Even if you knew nothing of the 'true' story of the musician Don Shirley and his driver you can predict the outcome from the get-go. Of course, it also helps that it's also very funny despite the seriousness of the material and that leads Viggo Mortensen and Mahershala Ali are so damn good, (Ali's second Oscar in three years looks like it's already in the bag). It is, then, something of a treat and might even convince you to seek out the music of Don Shirley."
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw4546747",
      "warningSpoilers": false,
      "date": "30 December 2018",
      "rate": "10",
      "helpful": "46 out of 78 found this helpful.",
      "title": "The film, Mortensen n Ali, they all deserve an Oscar.",
      "content": "This film is about the real-life friendship formed between an African American n an Italian bouncer during a road trip thru the Jim Crow South n the Sundown towns during the racial segregation period. Mortensen was convincing as the family-devoted, street-smart bouncer with a fat belly. By the way his appetite was awesome. Ali convincingly portrayed the loneliness n his eyes subtly channelized emotions of sadness. The film dealt with many issues without being preachy. Apart from the film's important message, the acting by the leads r top notch. Mortensen n Ali shud be given Oscars for their performances. One of the best part is the ending which takes place on a Christmas meal."
    },
    {
      "username": "theojhyman",
      "userUrl": "https://www.imdb.com/user/ur0613223",
      "reviewLink": "https://www.imdb.com/review/rw4393417",
      "warningSpoilers": false,
      "date": "12 October 2018",
      "rate": "9",
      "helpful": "107 out of 161 found this helpful.",
      "title": "Fantastic film, another music themed Oscar nominee",
      "content": "Just caught this as the surprise film of the London Film Festival. Such a well written drama with heart, soul and comedic touches, brilliantly performed by the two main actors, and given such an authentic 1962 shiny look to the film by the production designer and cinematographer. A truly great true story with themes that all audiences can connect with - namely, music, family, race, sexuality, friendship and love - and Viggo Mortensen probably gives the performance of a lifetime. Will surely rival A Star is Born at the Oscars in many of the same categories."
    },
    {
      "username": "tavm",
      "userUrl": "https://www.imdb.com/user/ur11228318",
      "reviewLink": "https://www.imdb.com/review/rw4617266",
      "warningSpoilers": false,
      "date": "31 January 2019",
      "rate": "9",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Green Book was one of the best films of last year!",
      "content": "Just watched this with my movie theatre-working friend. This was the true story of Tony Lip (Vallelonga) and his working relationship as the chauffer and associate of pianist Dr. Don Shirley during the early '60s as they travel throughout much of the South for the pianist's concert engagements. It's quite a touching and occasionally funny story co-written by Tony's son Nick. Nice surprise to hear it was mostly shot in Louisiana, where I live, even during a snow scene when it actually snowed in my state during December of '17! My friend and I really liked this one so that's a high recommendation!"
    },
    {
      "username": "ColoDrz",
      "userUrl": "https://www.imdb.com/user/ur43166661",
      "reviewLink": "https://www.imdb.com/review/rw4536104",
      "warningSpoilers": false,
      "date": "26 December 2018",
      "rate": "10",
      "helpful": "327 out of 399 found this helpful.",
      "title": "Simply wonderful in its portrayal of humanity",
      "content": "Green Book is a wonderful story of overcoming self-condemnation, and the resulting freedom it provides. As the film begins, Tony is locked in a prison of judgment and rejection, not from any conscious effort on his own but rather his circumstances and environment. As the self-assured and self-aware character of Dr. Shirley is introduced into Tony's life, Tony embarks on a journey of self-discovery in which he is forced to confront his own preconceived notions which ultimately stem from his skewed view of himself. As Dr. Shirley helps Tony to see himself as a man beyond his own limiting thoughts, Tony is finally able to step into his true nature as friend to Dr. Shirley. Everywhere in this film we are reminded that people are complicated, but beyond these complications we are also reminded that everyone is the same, just looking for love and acceptance. The scene where Dolores reads Tony's letter to her cousins is spectacular in this regard. It's interesting that none of the other reviews mention the YMCA scene and aftermath, which for me was the pinnacle moment that the power shifted for these two characters confronting their own strengths and weaknesses. This film is simply wonderful in its portrayal of humanity, and the people we need in our lives. While it comes to light that Tony's wife Dolores is completely aware of her husband's imperfections and shortcomings, she loves him just the same. But it is confrontation, not love, that is necessary to bring about Tony's redemption, demonstrating that the people who spur us to deep, personal growth are never who or what we expect."
    },
    {
      "username": "MarteParte",
      "userUrl": "https://www.imdb.com/user/ur60765637",
      "reviewLink": "https://www.imdb.com/review/rw4585103",
      "warningSpoilers": false,
      "date": "15 January 2019",
      "rate": "9",
      "helpful": "148 out of 191 found this helpful.",
      "title": "Respect demands respect",
      "content": "A very inspiring film. I walked out of the cinema feeling like there is good even in the unlikeliest of people. The dialogue was well written, and the main characters were equally as loveable. Viggo Mortensens acting was only overshadowed by that of Mahershala Ali, whose portrayal of an educated african-american man living in 1960's america was both heartwrenching and absolutely hilarious. While Mortensen stood for most of the comic relief, I found myself laughing the hardest from Ali's deadpan deliveries through the character of Dr. Shirley.The story of a black man who struggles to gain the respect of his fellow african-americans, while simultaneously resisting and pulling at the roots of the racism and oppression which keeps him from being as successful as the americans and europeans who should be his equals by all measures musical and educational.While the story and plot left little to be desired. I felt one or two jokes were shoe-horned in and would have been better discarded. The visual tone was fitting to the film, but the camerawork was nothing out of the ordinary. Not all films call for out-of-this-world originality in all marks however. And this film allows the audience to focus on what is really important."
    }
  ],
  "errorMessage": ""
}