{
  "imDbId": "tt6966692",
  "title": "Green Book",
  "fullTitle": "Green Book (2018)",
  "type": "Movie",
  "year": "2018",
  "language": "en",
  "titleInLanguage": "Green Book (film)",
  "url": "https://en.wikipedia.org/wiki/Green_Book_(film)",
  "plotShort": {
    "plainText": "Green Book is a 2018 American biographical comedy-drama film directed by Peter Farrelly. Starring Viggo Mortensen and Mahershala Ali, the film is inspired by the true story of a 1962 tour of the Deep South by African American pianist Don Shirley and Italian American bouncer and later actor Frank \"Tony Lip\" Vallelonga, who served as Shirley's driver and bodyguard. Written by Farrelly alongside Lip's son Nick Vallelonga and Brian Hayes Currie, the film is based on interviews with Lip and Shirley, as well as letters Lip wrote to his then-wife. It is named after The Negro Motorist Green Book, a guide book for African American travelers founded by Victor Hugo Green in 1936 and published until 1966.\r\nGreen Book had its world premiere at the Toronto International Film Festival on September 11, 2018, where it won the People's Choice Award. It was then theatrically released in the United States on November 16, 2018, by Universal Pictures, and grossed $321 million worldwide. The film received positive reviews from critics, with praise for the performances of Mortensen and Ali, although it also drew some criticism of its depiction of both race and Shirley.\r\nGreen Book received numerous awards and nominations. It won the Academy Award for Best Picture, Best Original Screenplay, and Best Supporting Actor (for Ali). It also won the Producers Guild of America Award for Best Theatrical Motion Picture, the Golden Globe Award for Best Motion Picture – Musical or Comedy, and the National Board of Review award for the best film of 2018, and was chosen as one of the top 10 films of the year by the American Film Institute. Ali also won the Golden Globe, Screen Actors Guild, and BAFTA Awards for Best Supporting Actor.",
    "html": "<p>Green Book is a 2018 American biographical comedy-drama film directed by Peter Farrelly. Starring Viggo Mortensen and Mahershala Ali, the film is inspired by the true story of a 1962 tour of the Deep South by African American pianist Don Shirley and Italian American bouncer and later actor Frank \"Tony Lip\" Vallelonga, who served as Shirley's driver and bodyguard. Written by Farrelly alongside Lip's son Nick Vallelonga and Brian Hayes Currie, the film is based on interviews with Lip and Shirley, as well as letters Lip wrote to his then-wife. It is named after The Negro Motorist Green Book, a guide book for African American travelers founded by Victor Hugo Green in 1936 and published until 1966.</p><p>Green Book had its world premiere at the Toronto International Film Festival on September 11, 2018, where it won the People's Choice Award. It was then theatrically released in the United States on November 16, 2018, by Universal Pictures, and grossed $321 million worldwide. The film received positive reviews from critics, with praise for the performances of Mortensen and Ali, although it also drew some criticism of its depiction of both race and Shirley.</p><p>Green Book received numerous awards and nominations. It won the Academy Award for Best Picture, Best Original Screenplay, and Best Supporting Actor (for Ali). It also won the Producers Guild of America Award for Best Theatrical Motion Picture, the Golden Globe Award for Best Motion Picture – Musical or Comedy, and the National Board of Review award for the best film of 2018, and was chosen as one of the top 10 films of the year by the American Film Institute. Ali also won the Golden Globe, Screen Actors Guild, and BAFTA Awards for Best Supporting Actor.</p>"
  },
  "plotFull": {
    "plainText": "Green Book is a 2018 American biographical comedy-drama film directed by Peter Farrelly. Starring Viggo Mortensen and Mahershala Ali, the film is inspired by the true story of a 1962 tour of the Deep South by African American pianist Don Shirley and Italian American bouncer and later actor Frank \"Tony Lip\" Vallelonga, who served as Shirley's driver and bodyguard. Written by Farrelly alongside Lip's son Nick Vallelonga and Brian Hayes Currie, the film is based on interviews with Lip and Shirley, as well as letters Lip wrote to his then-wife. It is named after The Negro Motorist Green Book, a guide book for African American travelers founded by Victor Hugo Green in 1936 and published until 1966.\r\nGreen Book had its world premiere at the Toronto International Film Festival on September 11, 2018, where it won the People's Choice Award. It was then theatrically released in the United States on November 16, 2018, by Universal Pictures, and grossed $321 million worldwide. The film received positive reviews from critics, with praise for the performances of Mortensen and Ali, although it also drew some criticism of its depiction of both race and Shirley.\r\nGreen Book received numerous awards and nominations. It won the Academy Award for Best Picture, Best Original Screenplay, and Best Supporting Actor (for Ali). It also won the Producers Guild of America Award for Best Theatrical Motion Picture, the Golden Globe Award for Best Motion Picture – Musical or Comedy, and the National Board of Review award for the best film of 2018, and was chosen as one of the top 10 films of the year by the American Film Institute. Ali also won the Golden Globe, Screen Actors Guild, and BAFTA Awards for Best Supporting Actor.\r\nPlot\r\nIn the Bronx in 1962, Italian American bouncer Tony Lip searches for new employment while the Copacabana is closed for renovations. He is invited to an interview with Dr. Don Shirley, an African American pianist in need of a driver for his eight-week concert tour through the Midwest and Deep South. Don hires Tony on the strength of his references. They embark with plans to return to New York City on Christmas Eve. Don's record label gives Tony a copy of The Negro Motorist Green Book, a guide for African American travelers to find motels, restaurants, and filling stations that would serve them in the Jim Crow South.\r\nTony and Don initially clash as Tony feels uncomfortable being asked to act with more refinement, while haughty Don is displeased by Tony's habits. As the tour progresses, Tony is impressed with Don's talent on the piano and is increasingly appalled by the discriminatory treatment that Don receives from his hosts and the general public when he is not onstage. In Louisville, Kentucky, a group of white men beat Don and threaten his life in a bar before Tony rescues him. He instructs Don not to go out without him for the rest of the tour.\r\nThroughout the journey, Don helps Tony write eloquent letters to his wife, which deeply move her. Tony encourages Don to get in touch with his own estranged brother, but Don is hesitant, observing that he has become isolated by his professional life and achievements. Don is later found in a homosexual encounter with a white man at a pool, and Tony bribes officers to prevent his arrest. In Mississippi, the two are arrested after police officers pull them over late at night in a sundown town, and Tony punches one officer after being insulted. While in jail, Don asks to phone his lawyer and instead uses the call to reach Attorney General Robert F. Kennedy, who pressures the governor and police officers to release the two. Once they are free and back on the road, Don reprimands Tony for his distasteful actions, and a heated argument erupts regarding race relations and meritocracy. The two eventually find a hotel for the night, and manage to reconcile.\r\nOn the night of Don's final performance in Birmingham, Alabama, he is refused entry into the whites-only dining room of the country club where he has been hired to perform. Tony threatens the owner, and Don refuses to play since they refuse to serve him in the room with his audience. Tony and Don leave the venue and instead have dinner at a black blues club, where Don joins the band on piano. The pair head north in an attempt to make it home by Christmas Eve but are caught in a blizzard. They are then once again pulled over by a police officer. Worried they are about to get the same treatment, both are surprised when the officer turns out be friendly and only pulled them over because he noticed one of their tires was flat. The officer then helps them fix the tire and they are able to make it home. Tony invites Don to have dinner with his family, but Don declines. Sitting alone at home, Don changes his mind and returns to Tony's home, where he receives a surprisingly warm welcome by Tony's extended family.\r\nThe end title cards show real-life photos of Don and Tony. It states that Don continued to tour and create music, while Tony went back to his work at the Copacabana, and that they remained friends until dying months apart in 2013.\r\nCast\r\nViggo Mortensen as Tony Lip\r\nMahershala Ali as Dr. Don Shirley\r\nLinda Cardellini as Dolores, Tony's wife\r\nSebastian Maniscalco as Johnny Venere, Dolores' brother\r\nDimiter D. Marinov as Oleg, Dr. Shirley's cellist\r\nMike Hatton as George, Dr. Shirley's bassist\r\nVon Lewis as Bobby Rydell, Copa Singer\r\nBrian Stepanek as Graham Kindell, country club manager\r\nJoseph Cortese as Gio Loscudo\r\nIqbal Theba as Amit, Don's servant\r\nP. J. Byrne as Record Exec\r\nDon Stark as Jules Podell\r\nIn addition, Tony and Dolores Vallelonga's son, Frank Jr., appears as his own uncle, Rudy (Rodolfo) Vallelonga (who says, \"I'm just saying, we're an arty family\"), while their younger son (and the film's co-producer and co-screenwriter), Nick, appears as Augie, the Mafioso who offers Tony a job doing \"things\" while the Copacabana is under renovation. The real Rodolfo Vallelonga appears as his own father, Grandpa Nicola Vallelonga, while the real Louis Venere appears as his own father, Grandpa Anthony Venere. Another co-producer and co-screenwriter, Brian Currie, plays the Maryland State Trooper who helps out in the snow storm. Actor Daniel Greene, who frequently appears in films directed by the Farrelly brothers, portrays Macon Cop #1.\r\nProduction\r\nViggo Mortensen began negotiations to star in the film in May 2017 and was required to gain 40–50 pounds (18–23 kg) for the role. Peter Farrelly was set to direct from a screenplay written by Nick Vallelonga (Tony Lip's son), Brian Currie, and himself.\r\nOn November 30, 2017, the lead cast was set with Mortensen, Mahershala Ali, Linda Cardellini and Iqbal Theba confirmed to star. Production began that week in New Orleans. Sebastian Maniscalco was announced as part of the cast in January 2018. Score composer Kris Bowers also taught Ali basic piano skills and was the stand-in when closeups of hands playing were required.\r\nWriting\r\nThe script was written by Vallelonga's son Nick Vallelonga, as well as Brian Hayes Currie and Peter Farrelly, after conversations with his father and Shirley.\r\nMusic\r\nFor the film's soundtrack, Farrelly incorporated an original score by composer Kris Bowers and one of Shirley's own recordings. The soundtrack also includes rarities from 1950s and 1960s American music recommended to him by singer Robert Plant, who was dating a friend of Farrelly's wife at the time he had finished the film's script. During dinner on a double date, his wife and her friend stepped outside to smoke and the director asked Plant for advice on picking songs for the film that would be relatively unknown to contemporary audiences. This prompted Plant to play Farrelly songs via YouTube, including Sonny Boy Williamson II's \"Pretty 'Lil Thing\" and Robert Mosley's \"Goodbye, My Lover, Goodbye\".\r\nIn an interview with Forbes, the director explained that the soundtrack ended up not only avoiding rote nostalgia, \"but also those songs were really inexpensive and I did not have a huge budget so I was able to come up with some sensational pop songs from the time that were long forgotten.\" The music played at the black blues club toward the end of the film featured the piano performance of Étude Op. 25, No. 11 (Chopin), known as the Winter Wind etude by Chopin, was not included in the soundtrack release.\r\nA soundtrack album was released digitally on November 16, 2018 and physically on November 30, 2018, by Milan Records, featuring Bowers' score, songs from the plot's era, and a piano recording by Shirley. According to the label, it was streamed approximately 10,000 times per day during January 2019. This rate doubled the next month as the album surpassed one million streams worldwide and became the highest-streamed jazz soundtrack in Milan's history.\r\nRelease\r\nGreen Book began a limited release in 20 cities, in the United States, on November 16, 2018, and expanded nationwide on November 21, 2018. The film was previously scheduled to begin its release on the 21st. The studio spent an estimated $37.5 million on prints and advertisements for the film.\r\nThe film had its world premiere at the Toronto International Film Festival on September 11, 2018. It also opened the 29th New Orleans Film Festival on October 17, 2018, screened at AFI Fest on November 9, 2018 and was programmed as the surprise film at the BFI London Film Festival.\r\nOn November 7, 2018, during a promotional panel discussion, Mortensen said the word \"nigger\". He prefaced the sentence with, \"I don't like saying this word\", and went on to compare dialogue \"that's no longer common in conversation\" to the period in which the film is set. Mortensen apologized the next day, saying that \"my intention was to speak strongly against racism\" and that he was \"very sorry that I did use the full word last night, and will not utter it again\".\r\nHome media\r\nGreen Book was released on DVD and Blu-ray on March 12, 2019, by Universal Pictures Home Entertainment. The film was made available for purchase on streaming video in digital HD from Amazon Video and iTunes on February 19, 2019. It was also released on DVD and Blu-Ray by Entertainment One through 20th Century Fox Home Entertainment in the UK in 2018.\r\nReception\r\nBox office\r\nGreen Book grossed $85.1 million in the United States and Canada, and $236.7 million in other territories, for a total worldwide gross of $321.8 million, against a production budget of $23 million. Deadline Hollywood calculated the net profit of the film to be $106 million, when factoring together all expenses and revenues.\r\nThe film made $312,000 from 25 theaters in its opening weekend, an average of $12,480 per venue, which Deadline Hollywood called \"not good at all\", although TheWrap said it was a \"successful start,\" and noted strong word-of-mouth would likely help it going into its wide release. The film had its wide expansion alongside the openings of Ralph Breaks the Internet, Robin Hood and Creed II, and was projected to gross around $7–9 million over the five-day weekend, November 21 to 25. It made $908,000 on its first day of wide release and $1 million on its second. It grossed $5.4 million over the three-day weekend (and $7.4 million over the five), finishing ninth. Deadline wrote that the opening was \"far from where to be to be considered a success,\" and that strong audience word of mouth and impending award nominations would be needed in order to help the film develop box office legs. Rival studios argued that Universal went too wide too fast: from 25 theaters to 1,063 in less than a week.\r\nIn its second weekend the film made $3.9 million, falling just 29% and leading some industry insiders to think it would achieve $50 million during awards season. In its third weekend of wide release, following its Golden Globe nominations, it dropped 0% and again made $3.9 million, then made $2.8 million the following weekend. In its eighth weekend, the film made $1.8 million (continuing to hold well, dropping just 3% from the previous week). It then made $2.1 million in its ninth weekend (up 18%) and $2.1 million in its 10th. In the film's 11th week of release, following the announcement of its five Oscar nominations, it was added to 1,518 theaters (for a total of 2,430) and made $5.4 million, an increase of 150% from the previous weekend and finishing sixth at the box office. The weekend following its Best Picture win, the film was added to 1,388 theaters (for a total of 2,641) and made $4.7 million, finishing fifth at the box office. It marked a 121% increase from the previous week, as well as one of the best post-Best Picture win bumps ever, and largest since The King's Speech in 2011.\r\nGreen Book was a surprise success overseas, especially in China where it debuted to a much higher-than-expected $17.3 million, immediately becoming the second highest-grossing Best Picture winner in the country behind Titanic (1997). As of March 7, 2019, the largest international markets for the film were China ($26.7 million), France ($10.7 million), the United Kingdom ($10 million), Australia ($7.8 million) and Italy ($8.6 million). By March 13, China's total had grown to $44.5 million. On March 31 the film passed $300 million at the global box office, including $219 million from overseas territories. Its largest markets to-date were China ($70.7 million), Japan ($14.6 million), France ($14 million) Germany ($13.5 million) and the UK ($12.9 million).\r\nCritical response\r\nOn review aggregator Rotten Tomatoes, the film holds an approval rating of 77% based on 363 reviews, with an average rating of 7.2/10. The website's critical consensus reads: \"Green Book takes audiences on an excessively smooth ride through bumpy subject matter, although Mahershala Ali and Viggo Mortensen's performances add necessary depth.\" On Metacritic the film has a weighted average score of 69 out of 100, based on 52 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film a rare average grade of \"A+\" on an A+ to F scale, while PostTrak reported filmgoers gave it a 91% positive score, with 80% saying they would definitely recommend it.\r\nWriting for The San Francisco Chronicle, Mick LaSalle praised Ali and Mortensen and said: \"...there's something so deeply right about this movie, so true to the time depicted and so welcome in this moment; so light in its touch, so properly respectful of its characters, and so big in its spirit, that the movie acquires a glow. It achieves that glow slowly, but by the middle and certainly by the end, it's there, the sense of something magical happening, on screen and within the audience.\" Steve Pond of TheWrap wrote, \"The movie gets darker as the journey goes further South, and as the myriad indignities and humiliations mount. But our investment in the characters rarely flags, thanks to Mortensen and Ali and a director who is interested in cleanly and efficiently delivering a story worth hearing.\"\r\nJazz artist Quincy Jones said to a crowd after a screening: \"I had the pleasure of being acquainted with Don Shirley while I was working as an arranger in New York in the '50s, and he was without question one of America's greatest pianists ... as skilled a musician as Leonard Bernstein or Van Cliburn ... So it is wonderful that his story is finally being told and celebrated. Mahershala, you did an absolutely fantastic job playing him, and I think yours and Viggo's performances will go down as one of the great friendships captured on film.\"\r\nSome critics thought Green Book perpetuated racial stereotyping by advancing the white savior narrative in film. Salon said the film combines \"the white savior trope with the story of a bigot's redemption\". Peter Farrelly told Entertainment Weekly that he was aware of the white savior trope before filming and sought to avoid it. He said he had long discussions with the actors and producers on the point, and believes that it was not advanced by the film, saying it is \"about two guys who were complete opposites and found a common ground, and it's not one guy saving the other. It's both saving each other and pulling each other into some place where they could bond and form a lifetime friendship.\"\r\nNew York Times writer Wesley Morris characterized the film as being a \"racial reconciliation fantasy\". Morris argues that the film represents a specific style of racial storytelling \"in which the wheels of interracial friendship are greased by employment, in which prolonged exposure to the black half of the duo enhances the humanity of his white, frequently racist counterpart\". Writing a positive appreciation in The Hollywood Reporter, Kareem Abdul-Jabbar noted that \"filmmakers are history’s interpreters, not its chroniclers.\"\r\nCriticism from Shirley's relatives\r\nDespite some praise, Shirley's relatives condemned the film because they thought it misrepresented the pianist's relationship with his family and they were not contacted by studio representatives until after development started. Shirley's brother, Maurice Shirley, said, \"My brother never considered Tony to be his 'friend'; he was an employee, his chauffeur (who resented wearing a uniform and cap). This is why context and nuance are so important. The fact that a successful, well-to-do black artist would employ domestics that did NOT look like him, should not be lost in translation.\" However, his brother's statements are contradicted by audio recordings from the 2010 documentary \"Lost Bohemia\" which featured interviews with Don Shirley and Vallelonga. In one of them, Shirley said that \"I trusted him implicitly. You see, Tony got to be, not only was he my driver. We never had an employer/employee relationship.\" The interviews also supported other events depicted in the film.\r\nWriter-director Peter Farrelly said that he was under the impression that there \"weren't a lot of family members\" still alive, that they did not take major liberties with the story, and that relatives of whom he was aware had been invited to a private screening for friends and family. Tony Vallelonga's son, Nick – and the film's co-writer – acknowledged that he was sorry that he had offended members of the Shirley family because he did not speak to them. He told Variety that \"Don Shirley himself told me not to speak to anyone\" and that Shirley \"approved what I put in and didn't put in.\" Actor Mahershala Ali apologized to Shirley's nephew Edwin Shirley III, saying that \"I did the best I could with the material I had\" and that he was not aware that there were \"close relatives with whom I could have consulted to add some nuance to the character.\" Don Shirley Trio cellist Jüri Täht (Oleg in the film) was still alive at the time the film premiered and he was surprised to see a stage of his life depicted in a movie. He did not know anything about the making of the film. He was deeply hurt by the fact that he was made a Russian in the film.\r\nAwards and nominations\r\nGreen Book has received numerous award nominations. In addition to winning the People's Choice Award at the Toronto International Film Festival in September 2018, Green Book was nominated for five awards at the 91st Academy Awards, winning three awards for Best Picture, Best Original Screenplay and Best Supporting Actor for Mahershala Ali. Green Book was the fifth film to win Best Picture without a Best Director nomination. Green Book had five nominations at the 76th Golden Globe Awards, with the film winning Best Motion Picture – Musical or Comedy. The National Board of Review awarded it Best Film, and it was also recognized as one of the Top 10 films of the year by the American Film Institute.",
    "html": "<p>Green Book is a 2018 American biographical comedy-drama film directed by Peter Farrelly. Starring Viggo Mortensen and Mahershala Ali, the film is inspired by the true story of a 1962 tour of the Deep South by African American pianist Don Shirley and Italian American bouncer and later actor Frank \"Tony Lip\" Vallelonga, who served as Shirley's driver and bodyguard. Written by Farrelly alongside Lip's son Nick Vallelonga and Brian Hayes Currie, the film is based on interviews with Lip and Shirley, as well as letters Lip wrote to his then-wife. It is named after The Negro Motorist Green Book, a guide book for African American travelers founded by Victor Hugo Green in 1936 and published until 1966.</p><p>Green Book had its world premiere at the Toronto International Film Festival on September 11, 2018, where it won the People's Choice Award. It was then theatrically released in the United States on November 16, 2018, by Universal Pictures, and grossed $321 million worldwide. The film received positive reviews from critics, with praise for the performances of Mortensen and Ali, although it also drew some criticism of its depiction of both race and Shirley.</p><p>Green Book received numerous awards and nominations. It won the Academy Award for Best Picture, Best Original Screenplay, and Best Supporting Actor (for Ali). It also won the Producers Guild of America Award for Best Theatrical Motion Picture, the Golden Globe Award for Best Motion Picture – Musical or Comedy, and the National Board of Review award for the best film of 2018, and was chosen as one of the top 10 films of the year by the American Film Institute. Ali also won the Golden Globe, Screen Actors Guild, and BAFTA Awards for Best Supporting Actor.</p><br/><h3>Plot</h3><p>In the Bronx in 1962, Italian American bouncer Tony Lip searches for new employment while the Copacabana is closed for renovations. He is invited to an interview with Dr. Don Shirley, an African American pianist in need of a driver for his eight-week concert tour through the Midwest and Deep South. Don hires Tony on the strength of his references. They embark with plans to return to New York City on Christmas Eve. Don's record label gives Tony a copy of The Negro Motorist Green Book, a guide for African American travelers to find motels, restaurants, and filling stations that would serve them in the Jim Crow South.</p><p>Tony and Don initially clash as Tony feels uncomfortable being asked to act with more refinement, while haughty Don is displeased by Tony's habits. As the tour progresses, Tony is impressed with Don's talent on the piano and is increasingly appalled by the discriminatory treatment that Don receives from his hosts and the general public when he is not onstage. In Louisville, Kentucky, a group of white men beat Don and threaten his life in a bar before Tony rescues him. He instructs Don not to go out without him for the rest of the tour.</p><p>Throughout the journey, Don helps Tony write eloquent letters to his wife, which deeply move her. Tony encourages Don to get in touch with his own estranged brother, but Don is hesitant, observing that he has become isolated by his professional life and achievements. Don is later found in a homosexual encounter with a white man at a pool, and Tony bribes officers to prevent his arrest. In Mississippi, the two are arrested after police officers pull them over late at night in a sundown town, and Tony punches one officer after being insulted. While in jail, Don asks to phone his lawyer and instead uses the call to reach Attorney General Robert F. Kennedy, who pressures the governor and police officers to release the two. Once they are free and back on the road, Don reprimands Tony for his distasteful actions, and a heated argument erupts regarding race relations and meritocracy. The two eventually find a hotel for the night, and manage to reconcile.</p><p>On the night of Don's final performance in Birmingham, Alabama, he is refused entry into the whites-only dining room of the country club where he has been hired to perform. Tony threatens the owner, and Don refuses to play since they refuse to serve him in the room with his audience. Tony and Don leave the venue and instead have dinner at a black blues club, where Don joins the band on piano. The pair head north in an attempt to make it home by Christmas Eve but are caught in a blizzard. They are then once again pulled over by a police officer. Worried they are about to get the same treatment, both are surprised when the officer turns out be friendly and only pulled them over because he noticed one of their tires was flat. The officer then helps them fix the tire and they are able to make it home. Tony invites Don to have dinner with his family, but Don declines. Sitting alone at home, Don changes his mind and returns to Tony's home, where he receives a surprisingly warm welcome by Tony's extended family.</p><p>The end title cards show real-life photos of Don and Tony. It states that Don continued to tour and create music, while Tony went back to his work at the Copacabana, and that they remained friends until dying months apart in 2013.</p><br/><h3>Cast</h3><ul><li>Viggo Mortensen as Tony Lip</li><li>Mahershala Ali as Dr. Don Shirley</li><li>Linda Cardellini as Dolores, Tony's wife</li><li>Sebastian Maniscalco as Johnny Venere, Dolores' brother</li><li>Dimiter D. Marinov as Oleg, Dr. Shirley's cellist</li><li>Mike Hatton as George, Dr. Shirley's bassist</li><li>Von Lewis as Bobby Rydell, Copa Singer</li><li>Brian Stepanek as Graham Kindell, country club manager</li><li>Joseph Cortese as Gio Loscudo</li><li>Iqbal Theba as Amit, Don's servant</li><li>P. J. Byrne as Record Exec</li><li>Don Stark as Jules Podell</li></ul><p>In addition, Tony and Dolores Vallelonga's son, Frank Jr., appears as his own uncle, Rudy (Rodolfo) Vallelonga (who says, \"I'm just saying, we're an arty family\"), while their younger son (and the film's co-producer and co-screenwriter), Nick, appears as Augie, the Mafioso who offers Tony a job doing \"things\" while the Copacabana is under renovation. The real Rodolfo Vallelonga appears as his own father, Grandpa Nicola Vallelonga, while the real Louis Venere appears as his own father, Grandpa Anthony Venere. Another co-producer and co-screenwriter, Brian Currie, plays the Maryland State Trooper who helps out in the snow storm. Actor Daniel Greene, who frequently appears in films directed by the Farrelly brothers, portrays Macon Cop #1.</p><br/><h3>Production</h3><p>Viggo Mortensen began negotiations to star in the film in May 2017 and was required to gain 40–50 pounds (18–23 kg) for the role. Peter Farrelly was set to direct from a screenplay written by Nick Vallelonga (Tony Lip's son), Brian Currie, and himself.</p><p>On November 30, 2017, the lead cast was set with Mortensen, Mahershala Ali, Linda Cardellini and Iqbal Theba confirmed to star. Production began that week in New Orleans. Sebastian Maniscalco was announced as part of the cast in January 2018. Score composer Kris Bowers also taught Ali basic piano skills and was the stand-in when closeups of hands playing were required.</p><h4>Writing</h4><p>The script was written by Vallelonga's son Nick Vallelonga, as well as Brian Hayes Currie and Peter Farrelly, after conversations with his father and Shirley.</p><h4>Music</h4><p>For the film's soundtrack, Farrelly incorporated an original score by composer Kris Bowers and one of Shirley's own recordings. The soundtrack also includes rarities from 1950s and 1960s American music recommended to him by singer Robert Plant, who was dating a friend of Farrelly's wife at the time he had finished the film's script. During dinner on a double date, his wife and her friend stepped outside to smoke and the director asked Plant for advice on picking songs for the film that would be relatively unknown to contemporary audiences. This prompted Plant to play Farrelly songs via YouTube, including Sonny Boy Williamson II's \"Pretty 'Lil Thing\" and Robert Mosley's \"Goodbye, My Lover, Goodbye\".</p><p>In an interview with Forbes, the director explained that the soundtrack ended up not only avoiding rote nostalgia, \"but also those songs were really inexpensive and I did not have a huge budget so I was able to come up with some sensational pop songs from the time that were long forgotten.\" The music played at the black blues club toward the end of the film featured the piano performance of Étude Op. 25, No. 11 (Chopin), known as the Winter Wind etude by Chopin, was not included in the soundtrack release.</p><p>A soundtrack album was released digitally on November 16, 2018 and physically on November 30, 2018, by Milan Records, featuring Bowers' score, songs from the plot's era, and a piano recording by Shirley. According to the label, it was streamed approximately 10,000 times per day during January 2019. This rate doubled the next month as the album surpassed one million streams worldwide and became the highest-streamed jazz soundtrack in Milan's history.</p><br/><h3>Release</h3><p>Green Book began a limited release in 20 cities, in the United States, on November 16, 2018, and expanded nationwide on November 21, 2018. The film was previously scheduled to begin its release on the 21st. The studio spent an estimated $37.5 million on prints and advertisements for the film.</p><p>The film had its world premiere at the Toronto International Film Festival on September 11, 2018. It also opened the 29th New Orleans Film Festival on October 17, 2018, screened at AFI Fest on November 9, 2018 and was programmed as the surprise film at the BFI London Film Festival.</p><p>On November 7, 2018, during a promotional panel discussion, Mortensen said the word \"nigger\". He prefaced the sentence with, \"I don't like saying this word\", and went on to compare dialogue \"that's no longer common in conversation\" to the period in which the film is set. Mortensen apologized the next day, saying that \"my intention was to speak strongly against racism\" and that he was \"very sorry that I did use the full word last night, and will not utter it again\".</p><h4>Home media</h4><p>Green Book was released on DVD and Blu-ray on March 12, 2019, by Universal Pictures Home Entertainment. The film was made available for purchase on streaming video in digital HD from Amazon Video and iTunes on February 19, 2019. It was also released on DVD and Blu-Ray by Entertainment One through 20th Century Fox Home Entertainment in the UK in 2018.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Green Book grossed $85.1 million in the United States and Canada, and $236.7 million in other territories, for a total worldwide gross of $321.8 million, against a production budget of $23 million. Deadline Hollywood calculated the net profit of the film to be $106 million, when factoring together all expenses and revenues.</p><p>The film made $312,000 from 25 theaters in its opening weekend, an average of $12,480 per venue, which Deadline Hollywood called \"not good at all\", although TheWrap said it was a \"successful start,\" and noted strong word-of-mouth would likely help it going into its wide release. The film had its wide expansion alongside the openings of Ralph Breaks the Internet, Robin Hood and Creed II, and was projected to gross around $7–9 million over the five-day weekend, November 21 to 25. It made $908,000 on its first day of wide release and $1 million on its second. It grossed $5.4 million over the three-day weekend (and $7.4 million over the five), finishing ninth. Deadline wrote that the opening was \"far from where to be to be considered a success,\" and that strong audience word of mouth and impending award nominations would be needed in order to help the film develop box office legs. Rival studios argued that Universal went too wide too fast: from 25 theaters to 1,063 in less than a week.</p><p>In its second weekend the film made $3.9 million, falling just 29% and leading some industry insiders to think it would achieve $50 million during awards season. In its third weekend of wide release, following its Golden Globe nominations, it dropped 0% and again made $3.9 million, then made $2.8 million the following weekend. In its eighth weekend, the film made $1.8 million (continuing to hold well, dropping just 3% from the previous week). It then made $2.1 million in its ninth weekend (up 18%) and $2.1 million in its 10th. In the film's 11th week of release, following the announcement of its five Oscar nominations, it was added to 1,518 theaters (for a total of 2,430) and made $5.4 million, an increase of 150% from the previous weekend and finishing sixth at the box office. The weekend following its Best Picture win, the film was added to 1,388 theaters (for a total of 2,641) and made $4.7 million, finishing fifth at the box office. It marked a 121% increase from the previous week, as well as one of the best post-Best Picture win bumps ever, and largest since The King's Speech in 2011.</p><p>Green Book was a surprise success overseas, especially in China where it debuted to a much higher-than-expected $17.3 million, immediately becoming the second highest-grossing Best Picture winner in the country behind Titanic (1997). As of March 7, 2019, the largest international markets for the film were China ($26.7 million), France ($10.7 million), the United Kingdom ($10 million), Australia ($7.8 million) and Italy ($8.6 million). By March 13, China's total had grown to $44.5 million. On March 31 the film passed $300 million at the global box office, including $219 million from overseas territories. Its largest markets to-date were China ($70.7 million), Japan ($14.6 million), France ($14 million) Germany ($13.5 million) and the UK ($12.9 million).</p><h4>Critical response</h4><p>On review aggregator Rotten Tomatoes, the film holds an approval rating of 77% based on 363 reviews, with an average rating of 7.2/10. The website's critical consensus reads: \"Green Book takes audiences on an excessively smooth ride through bumpy subject matter, although Mahershala Ali and Viggo Mortensen's performances add necessary depth.\" On Metacritic the film has a weighted average score of 69 out of 100, based on 52 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film a rare average grade of \"A+\" on an A+ to F scale, while PostTrak reported filmgoers gave it a 91% positive score, with 80% saying they would definitely recommend it.</p><p>Writing for The San Francisco Chronicle, Mick LaSalle praised Ali and Mortensen and said: \"...there's something so deeply right about this movie, so true to the time depicted and so welcome in this moment; so light in its touch, so properly respectful of its characters, and so big in its spirit, that the movie acquires a glow. It achieves that glow slowly, but by the middle and certainly by the end, it's there, the sense of something magical happening, on screen and within the audience.\" Steve Pond of TheWrap wrote, \"The movie gets darker as the journey goes further South, and as the myriad indignities and humiliations mount. But our investment in the characters rarely flags, thanks to Mortensen and Ali and a director who is interested in cleanly and efficiently delivering a story worth hearing.\"</p><p>Jazz artist Quincy Jones said to a crowd after a screening: \"I had the pleasure of being acquainted with Don Shirley while I was working as an arranger in New York in the '50s, and he was without question one of America's greatest pianists ... as skilled a musician as Leonard Bernstein or Van Cliburn ... So it is wonderful that his story is finally being told and celebrated. Mahershala, you did an absolutely fantastic job playing him, and I think yours and Viggo's performances will go down as one of the great friendships captured on film.\"</p><p>Some critics thought Green Book perpetuated racial stereotyping by advancing the white savior narrative in film. Salon said the film combines \"the white savior trope with the story of a bigot's redemption\". Peter Farrelly told Entertainment Weekly that he was aware of the white savior trope before filming and sought to avoid it. He said he had long discussions with the actors and producers on the point, and believes that it was not advanced by the film, saying it is \"about two guys who were complete opposites and found a common ground, and it's not one guy saving the other. It's both saving each other and pulling each other into some place where they could bond and form a lifetime friendship.\"</p><p>New York Times writer Wesley Morris characterized the film as being a \"racial reconciliation fantasy\". Morris argues that the film represents a specific style of racial storytelling \"in which the wheels of interracial friendship are greased by employment, in which prolonged exposure to the black half of the duo enhances the humanity of his white, frequently racist counterpart\". Writing a positive appreciation in The Hollywood Reporter, Kareem Abdul-Jabbar noted that \"filmmakers are history’s interpreters, not its chroniclers.\"</p><h4>Criticism from Shirley's relatives</h4><p>Despite some praise, Shirley's relatives condemned the film because they thought it misrepresented the pianist's relationship with his family and they were not contacted by studio representatives until after development started. Shirley's brother, Maurice Shirley, said, \"My brother never considered Tony to be his 'friend'; he was an employee, his chauffeur (who resented wearing a uniform and cap). This is why context and nuance are so important. The fact that a successful, well-to-do black artist would employ domestics that did NOT look like him, should not be lost in translation.\" However, his brother's statements are contradicted by audio recordings from the 2010 documentary \"Lost Bohemia\" which featured interviews with Don Shirley and Vallelonga. In one of them, Shirley said that \"I trusted him implicitly. You see, Tony got to be, not only was he my driver. We never had an employer/employee relationship.\" The interviews also supported other events depicted in the film.</p><p>Writer-director Peter Farrelly said that he was under the impression that there \"weren't a lot of family members\" still alive, that they did not take major liberties with the story, and that relatives of whom he was aware had been invited to a private screening for friends and family. Tony Vallelonga's son, Nick – and the film's co-writer – acknowledged that he was sorry that he had offended members of the Shirley family because he did not speak to them. He told Variety that \"Don Shirley himself told me not to speak to anyone\" and that Shirley \"approved what I put in and didn't put in.\" Actor Mahershala Ali apologized to Shirley's nephew Edwin Shirley III, saying that \"I did the best I could with the material I had\" and that he was not aware that there were \"close relatives with whom I could have consulted to add some nuance to the character.\" Don Shirley Trio cellist Jüri Täht (Oleg in the film) was still alive at the time the film premiered and he was surprised to see a stage of his life depicted in a movie. He did not know anything about the making of the film. He was deeply hurt by the fact that he was made a Russian in the film.</p><br/><h3>Awards and nominations</h3><p>Green Book has received numerous award nominations. In addition to winning the People's Choice Award at the Toronto International Film Festival in September 2018, Green Book was nominated for five awards at the 91st Academy Awards, winning three awards for Best Picture, Best Original Screenplay and Best Supporting Actor for Mahershala Ali. Green Book was the fifth film to win Best Picture without a Best Director nomination. Green Book had five nominations at the 76th Golden Globe Awards, with the film winning Best Motion Picture – Musical or Comedy. The National Board of Review awarded it Best Film, and it was also recognized as one of the Top 10 films of the year by the American Film Institute.</p><br/>"
  },
  "errorMessage": ""
}