{
  "imDbId": "tt0110357",
  "title": "The Lion King",
  "fullTitle": "The Lion King (1994)",
  "type": "Movie",
  "year": "1994",
  "items": [
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0342377",
      "warningSpoilers": true,
      "date": "31 October 2003",
      "rate": "10",
      "helpful": "278 out of 307 found this helpful.",
      "title": "One of my favorite movies of all time!",
      "content": "Seriously, I know that sounds stupid as this is an animated movie, but why can't we have a favorite movie that's animated? If you ask me this is Disney's best animated film of all time. Why do you ask? The animation is just beautiful, the story is powerful and moving, the characters are terrific, the villain is one of Disney's most monstrous and the songs are out of this world incredible! Not only is it my favorite animated movie, this is one of my favorite soundtracks, with the strong power of Elton John The Lion King is absolutely beautiful and a pleasure to watch still to this day. I have to say also that this story is just so beautiful, it's still one of the movies that will always bring a tear to my eye. When I was 17 years old, I begged my dad to take me to the re-release of The Lion King, him and I being the only adults besides the parents who took their children to see the movie, Simba's father dies and I started balling! My dad looks around and said \"Krissy, stop it!\" and I just said \"But it's so saaaaad! Simba's daddy!\", yes I'm a sap, I can't help it, this is a powerful movie.In the Pride Lands, Rafiki, a wise old monkey, anoints Simba, the newborn cub of King Mufasa and Queen Sarabi, and presents him to a gathering of animals at Pride Rock. Taking advantage of the cub's naive nature, Simba's scheming uncle Scar, who is very angry because Simba's birth means that he's no longer next in line to the throne tells him about the elephant graveyard, a place where Mufasa has forbidden Simba to go. Simba asks his mother if he can go to the water-hole with his best friend, Nala, but they go to the graveyard instead. There, the cubs are met by Shenzi, Banzai and Ed, 3 hyenas who try to kill them, but they are rescued by Mufasa. But Scar doesn't give up there, he lures Simba into a gorge for a \"surprise from his father\" while the hyenas create a wildebeest stampede. Alerted by Scar, Mufasa races to rescue Simba from the stampede. He saves his son but is left clinging to the edge of a steep cliff. Scar flings his brother into the stampede below. Simba sees his father fall and rushes down the cliff after him, only to find him dead. Scar convinces Simba that he was responsible for his father's death and recommends that he runs away from the Pride Lands to avoid punishment. In a distant desert, Simba is found unconscious by Timon and Pumbaa, a duo who adopt and raise the cub under their worry-free philosophy, Hakuna Matata. When Simba has grown into an adult he is discovered by Nala, who tells him that Scar, through his irresponsibility, has turned the Pride Lands into a barren wasteland. She asks Simba to return and take his place as king but Simba refuses, still believing he caused his father's death. Rafiki arrives and persuades Simba to return to the Pride Lands, and face Scar once and for all.I know that still that Beauty and the Beast is the only animated film to get a best picture nomination, but I don't understand why The Lion King didn't get the same treatment. I adore this film with such a passion, I will always defend it to the high end. I still watch this movie, ever since it's theatrical release in 1994, I still sing, dance, and rehears the lines back and forth. How could you not at least with Hakuna Matata? Timon is my idol, he's so care free, funny, and awesome during his drag hula scene \"Luau! If you're hungry for a hunk of fat and juicy meat, eat my buddy Pumbaa here, 'cause he's a tasty treat come on down and dine, on this tasty swine, all you gotta is get in line, are you achin',? For some bacon? He's a big pig. You can be a big pig, too. Oy! Ahhhh!\", best scene ever in film history! OK, not in history, but one of my favorites, it always has me on the floor laughing till my stomach hurts. If you seriously haven't seen this movie, see it! Who said that animated movies can't be true art? The Lion King is a fantastic film and deserves all it's praise and more.10/10"
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0342243",
      "warningSpoilers": false,
      "date": "1 January 2000",
      "rate": "10",
      "helpful": "443 out of 518 found this helpful.",
      "title": "The Best Animated Film I Have Ever Seen",
      "content": "The Lion King is a great film. Along with a great story (inspired by William Shakespeare's Hamlet), terrific animation, and an all star cast of voices, there are the lessons that are learned from this film (despite being a little rough for the younger children). Like responsibility and honor.I rank this animated film among the great films I have ever seen. It was part of my childhood and it is a film experience I will never forget. And hopefully, you won't either. A++"
    },
    {
      "username": "claudonio",
      "userUrl": "https://www.imdb.com/user/ur0494482",
      "reviewLink": "https://www.imdb.com/review/rw0342245",
      "warningSpoilers": false,
      "date": "20 January 2000",
      "rate": "10",
      "helpful": "365 out of 417 found this helpful.",
      "title": "A Film For All Ages",
      "content": "This is a film that can entertain anyone young or old, I usually don't care for animated movies but this film is the real deal, this is one of disney's best animated movies. The animation is top notch and flawless. This film also features superb work from the vocal cast James Earl Jones, Jeremy Irons, Whoopi Goldberg. This is a standout."
    },
    {
      "username": "Special-K88",
      "userUrl": "https://www.imdb.com/user/ur1596208",
      "reviewLink": "https://www.imdb.com/review/rw0342202",
      "warningSpoilers": false,
      "date": "14 March 2002",
      "rate": "",
      "helpful": "98 out of 115 found this helpful.",
      "title": "simply a wonderful, heartfelt tale for all ages",
      "content": "Delightful animated feature from Walt Disney Pictures about a naive young lion cub destined for greatness. Born the son of a beloved and authoritative king he's groomed to be the next ruler of the kingdom, but along the way he encounters tragic detours at the hands of his villainous uncle and scheming hyena henchmen. Years later—as an adult—he decides to embrace his destiny and take his proper place in the Circle of Life. Warm, intelligent, laugh-out loud funny film is a triumph in every aspect; unforgettable songs, snappy dialogue, remarkable animation, and a stellar cast of voices make this a treat for all ages. A rousing adventure that you can enjoy again and again, and arguably one of the finest animated films ever made. ****"
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0342309",
      "warningSpoilers": true,
      "date": "3 July 2002",
      "rate": "",
      "helpful": "141 out of 173 found this helpful.",
      "title": "So Good in So Many Ways.",
      "content": "Outstanding animated feature from Disney that sports outstanding songs by Elton John, a compelling story and first-class animation. Young lion cub Simba is to be king, but he leaves after he believes he was the reason for his father's death (of course this is not so). As he grows up, he goes on a journey of love, friendship and discovery which will lead him back to his rightful place in the world. Excellent. 5 stars out of 5."
    },
    {
      "username": "movieguy1021",
      "userUrl": "https://www.imdb.com/user/ur1303993",
      "reviewLink": "https://www.imdb.com/review/rw0342337",
      "warningSpoilers": false,
      "date": "28 December 2002",
      "rate": "9",
      "helpful": "120 out of 153 found this helpful.",
      "title": "The Lion King: 9/10",
      "content": "Released Christmas Day in 2002 to IMAX and large format screens, The Lion King makes a triumphant return to the screen after eight years. Its every bit as majestic and great as it has been before.The Lion King Mufasa (James Earl Jones) just had a baby cub named Simba. All of the animals come to the ceremony, except for Mufasa's brother Scar (Jeremy Irons). Scar desperately wants to be King, but can't. As long as Mufasa and Simba are there. Soon Simba is able to walk and talk and is voiced by Jonathon Taylor Thomas. After hearing about an elephant graveyard from Scar, he and his friend Nala (Niketa Calame) visit it. They meet three bumbling hyenas: Banzai (Cheech Marin), Shenzi (Whoopi Goldberg), and Ed (Jim Cummings), but they manage to leave unhurt. Scar is upset that the hyenas didn't do the job, so he orders a stampede to wipe out both of them, but it only takes care of Mufasa. Scar convinces Simba that he killed Mufasa, not Scar. So Simba flees into exile.The Lion King really benefits from the larger screen. Its lavish landscapes will be able to capture you more, and you can really savor the animation. Disney didn't need any humans, so they could spend all of the time on a great story and lush landscapes. In fact, its camera movement was so majestic that you actually felt like you were part of the pride of lions.The music boomed and really created the atmosphere. Although I had seen this picture before, I still was tense because of the way the music played out. Most of the time, I would just roll my eyes at the attempt to make me nervous. But Hans Zimmer's music really bowled me over and made my heart do calisthenics. Unlike such new Disney pics like Lilo and Stitch, the songs actually did some good. They took you out of a somewhat dreary mood and put a smile on your face and made your feet want to tap along. There were only a few, but they were very entertaining. And the Circle of Life song at the beginning was beautiful, with its perfect pictures and perfect sound.I really like James Earl Jones (he's pretty diverse), and this time was no exception. He seemed to act like he didn't want to do this role, but he couldn't contain his excitement for wanting to do voice-overs again (he had done some work in The Simpsons before). Matthew Broderick redeemed himself for me (after the atrocious Ferris Bueller's Day Off) by showing a strong voicing as the adult Simba. Cheech Marin, Whoopi Goldberg, and Jim Cummings really had good chemistry together, even though they didn't have much screen time. Irons was really good and creepy as Scar (one of those who you can't help but hate), and if that is him really singing, brava!Be warned, The Lion King isn't really for youngsters. It had intense thematic elements that should have warranted a PG, instead of those that don't deserve it (Lilo and Stitch, again). The mood that the music and the script brought out could damper your day, so be warned.This is one movie where you can feel for the characters. You don't say `haha, he's dead', you say `Gasp! I'm so sad!' If it weren't for the gifted scriptwriters, this movie would be kaput and a nothing, not the best Disney movie ever made.The Lion King is a majestic movie, not without humor, that is for almost all to see.My rating: 9/10Rated G for intense thematic elements."
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5476882",
      "warningSpoilers": false,
      "date": "11 February 2020",
      "rate": "",
      "helpful": "23 out of 27 found this helpful.",
      "title": "The Lion King",
      "content": "A film that only get better with repeat viewings and age, The Lion King is a fantastic animated masterpiece that is among Disney's finest achievements. Stellar voice work, great musical score, beautiful to look at and emotionally complex and riveting."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2024643",
      "warningSpoilers": false,
      "date": "17 February 2009",
      "rate": "10",
      "helpful": "27 out of 35 found this helpful.",
      "title": "This is my sister's favourite film, and one of mine!",
      "content": "This is a fantastic movie, and I am not lying! my 13 year old sister loves this movie, and I can't fault this either. It was one of the first movies I ever saw, so that accounts for how much I love it. The animation is superb, the backgrounds look so rich, and for once, there are no stiff movements. The highlights were the stampede and the fight between Scar and Simba. The music by Hans Zimmer is outstanding, a perfect mix of African chants and pure Hollywood. The songs are absolutely great, I had no idea that Elton John could write like that. The best song is \"Can you feel the Love Tonight?\" but the others go without fault, \"Circle of Life\" is so spirit rousing especially. Likewise with the voice overs. Jonathan Taylor Thomas is very likable as Young Simba, and Matthew Broderick, while not as good, is above average too. James Earl Jones lends his booming voice to the majestic King Mufassa, and Nathan Lane, Rowan Atkinson and Whoopi Goldberg provide flawless comic relief. The vocal standout is Jeremy Irons as Scar, who frightened me when I was little. Scar is up there with the best Disney villains, like Jafar, Malificent and Frollo. The humour here is fantastic, and you cry here a bit here as well. I highly recommend the stage version in the West End, and the sequels are actually two of the better DTV sequels.10/10. Bethany Cox"
    },
    {
      "username": "gdswalia",
      "userUrl": "https://www.imdb.com/user/ur5267588",
      "reviewLink": "https://www.imdb.com/review/rw1077708",
      "warningSpoilers": false,
      "date": "10 May 2005",
      "rate": "10",
      "helpful": "319 out of 372 found this helpful.",
      "title": "The best Disney animated film ever...",
      "content": "The best Disney animated film ever...This film had it all, it was funny, emotional, had family drama, and above all, great animation and songs! My personal favorite character is Rafiki, the Baboon! I still cant forget the line he says to Simbe, \"Past can hurt, but as I see it, you can either run from it, or learn from it!\" it is so true! i loved Zazu's weirdness, and shenzi's humor, above all, i loved Pumba's innocence and Timon's intelligence! In short, i found the film the best film ever... The voice cast is also great. Mathew did complete justice to Simba, and what can I say about Mufasa, He is the best King, and dad anyone can ever get! The movie is not meant for kids, its meant to teach every adult a lesson...to find our place in the great \"Circle Of Life\". I give this film a perfect 10."
    },
    {
      "username": "chadgeri",
      "userUrl": "https://www.imdb.com/user/ur1434526",
      "reviewLink": "https://www.imdb.com/review/rw0342205",
      "warningSpoilers": false,
      "date": "22 April 2002",
      "rate": "10",
      "helpful": "145 out of 176 found this helpful.",
      "title": "By far, the greatest Disney movie ever made...",
      "content": "This movie is, quite seriously, the Citizen Kane of Disney animation. Every animated movie from Disney ever since has been a failed attempt to recreate the masterpiece that this film is. This movie is an anomaly in a market usually dominated by formulaic kiddie-fare. Unlike most films from animation studios, this movie will enthrall you, whether you're 5 years old, or 50. An epic plot, intriguing characters, great music and hillarious moments make this film a family classic that will endure through the ages. 10/10"
    },
    {
      "username": "kaydrelia",
      "userUrl": "https://www.imdb.com/user/ur104527547",
      "reviewLink": "https://www.imdb.com/review/rw5008960",
      "warningSpoilers": true,
      "date": "21 July 2019",
      "rate": "10",
      "helpful": "35 out of 40 found this helpful.",
      "title": "Masterpiece, the new one doesnt compare",
      "content": "Watched the new one, and I think I had a disgusted look on my face the entire time. The music, the visuals, the dialogue, the voice acting, etc. Rewatched this one and remembered why this was my favorite Disney movie growing up. From mufasa's death to the goofy hyenas, to the bond between rafiki, simba and mufasa. The music that everyone knows every word to, and scar's ability to deliver each line perfectly. This movie is magic, the new one seems to tech focused and forgot what made lion king so beloved to begin with, its unfortunate. Hoping the circle of life makes it way around and the end of remakes draws close (see what I did there lol). Until then, lion king from the 90s will stay on my shelf and my kids will watch with me. This new one will never end up in my cart and I wont confuse my kids by watching it either. Thank you 90s Disney for the magic!"
    },
    {
      "username": "Maintenance_Guys",
      "userUrl": "https://www.imdb.com/user/ur9398872",
      "reviewLink": "https://www.imdb.com/review/rw1441890",
      "warningSpoilers": true,
      "date": "7 August 2006",
      "rate": "",
      "helpful": "148 out of 173 found this helpful.",
      "title": "This is what kid's movies should be like...",
      "content": "I find it hard to believe that kid's movies these days will ever be called classics in years to come (excluding Pixar movies). In my mind, this is the last classic hand drawn film, and it upsets me that I have to wait for another five years for it to come out on DVD. This film deals with great issues and involves a huge conflict for the main character, something that recent kid/family films lack. It is funny and lighthearted when it should be, and heartfelt and serious when it needs it. I believe that everybody should see this movie, regardless of your age. It may just be the last good movie that Disney will ever do without the help of Pixar."
    },
    {
      "username": "moviesleuth2",
      "userUrl": "https://www.imdb.com/user/ur2879151",
      "reviewLink": "https://www.imdb.com/review/rw2109086",
      "warningSpoilers": false,
      "date": "9 August 2009",
      "rate": "10",
      "helpful": "20 out of 26 found this helpful.",
      "title": "A dazzling, joyous piece of film-making",
      "content": "Of all the animation classics from the Walt Disney Company, there is perhaps none that is more celebrated than \"The Lion King.\" Its acclaim is understandable: this is quite simply a glorious work of art.\"The Lion King\" gets off to a fantastic start. The film's opening number, \"The Circle of Life,\" is outstanding. The song lasts for about four minutes, but from the first sound, the audience is floored. Not even National Geographic can capture something this beautiful and dramatic. Not only is this easily the greatest moment in film animation, this is one of the greatest sequences in film history.The story that follows is not as majestic, but the film has to tell a story. Actually, the rest of the film holds up quite well. The story takes place in Africa, where the lions rule. Their king, Mufasa (James Earl Jones) has just been blessed with a son, Simba (Jonathan Taylor Thomas), who goes in front of his uncle Scar (Jeremy Irons) as next in line for the throne. Scar is furious, and sets in motion plans to usurp the throne for himself. After a tragedy occurs and Mufasa is killed, Scar persuades Simba to flee, leaving himself as king. Simba grows up in exile, but he learns that while he can run away from his past, he can never escape it.When viewing the film, it is obvious that \"The Lion King\" is quite different from its predecessors (and successors). This is an epic story that contains more dramatic power than all the other Disney films combined. While there are definitely some light-hearted moments, there is no denying the dark drama that takes up the bulk of the story. While it could be argued that Disney is the champion of family entertainment, this film is not for the very young. Some of the sequences are very dark and violent, many bordering on frightening, even for the older crowd.The voice actors are terrific. Jonathan Taylor Thomas brings a large dose of innocence to Young Simba. He's mischievous, but also terribly naive. His older counterpart, voiced by Matthew Broderick, equals him. He's older, but no less mature. The voices are so similar that it's almost impossible not to believe that they are the same character at different ages. Perhaps no one could have been better suited for the role of Mufasa than James Earl Jones. His baritone voice gives the Mufasa a quality of great power and wisdom; there is no question that his role is king. As Scar, Jeremy Irons is pitch-perfect. The drawing of the character is villainous, but Irons' vocal work complements the animation to create one of the most memorable, and vicious, villains in Disney history. He's unquestionably evil, but he's also clever, which makes him all the more dangerous. Manipulation, not violence is his greatest weapon. Providing some much needed comic relief are Nathan Lane and Ernie Sabella as Timon and Pumbaa, two other outcasts (a meerkat and a warthog), and Rowan Atkinson as Zazu. While there is definite fun from these characters, neither the actors nor the filmmakers allow them to go over-the-top and destroy the mood of the film.Disney's animated features are known for their gorgeous artwork. Nowhere is this more apparent than in \"The Lion King.\" Every single frame is jaw-dropping. The colors are rich, and the drawings are sharp and beautiful. One of the pitfalls of animation (both computer and hand-drawn) is that there is sometimes a visible distance between the subject and the background, making it seem as if the figure animation was cut and pasted on the background (this is obviously what happens, but it is up to the artists to make sure that it isn't noticeable). There is none of that here.Throughout the Golden Age of Disney animation, the films have been musicals. \"The Lion King\" is no different, and the songs are brilliant. All of the numbers are standouts (\"Can You Feel the Love Tonight\" won the Oscar, but in my opinion, \"The Circle of Life\" was better). In the cases of Simba and Nala (Simba's girlfriend), both young and old, there is a noticeable difference between the speaking and singing parts (everyone else does their own singing and speaking), but never mind. It still works, and that's what's important.\"The Lion King\" is not flawless, but on first viewing, they aren't noticeable, and it is likely that the young won't ever notice them. \"Beauty and the Beast\" was the first animated film to get an Oscar nomination for Best Picture (it lost to \"The Silence of the Lambs\"), and is thus far the only animated film to receive such an honor. That being the case, it's hard to understand why \"The Lion King\" was not given the same distinction. The two films are more or less equal in quality, and the nominees for the honor that year were not strong.If you haven't already, see \"The Lion King.\" You won't be disappointed."
    },
    {
      "username": "David_l_s",
      "userUrl": "https://www.imdb.com/user/ur4090425",
      "reviewLink": "https://www.imdb.com/review/rw1244268",
      "warningSpoilers": false,
      "date": "21 December 2005",
      "rate": "10",
      "helpful": "146 out of 182 found this helpful.",
      "title": "TLK is Great",
      "content": "I watched the film today and I have come to the conclusion that this Disney film is one classic that will keep on delivering to Disney fans like myself...TLK is a wonderful film with great characters and songs with a powerful message that you can always find your way back no matter how hard the journey...I think The Lion King is one of the best Disney animated films matching with the power of Bambi and Brother Bear.I love how Disney Works hard to deliver the best in Animation,Song,And MagicI do believe that 2006 and many years from now The Lion King will Shine and still Roar with Success...Thank-You Disney For The Lion King"
    },
    {
      "username": "suicune_tudor",
      "userUrl": "https://www.imdb.com/user/ur8185858",
      "reviewLink": "https://www.imdb.com/review/rw1227005",
      "warningSpoilers": false,
      "date": "28 November 2005",
      "rate": "10",
      "helpful": "191 out of 242 found this helpful.",
      "title": "A living masterpiece",
      "content": "This is truly one of the best Disney movies ever. I really enjoyed it when I first seen it, about when I was 6, and since then I watched it over and over again. I simply LOOOOVED the music. It's one of the best soundtracks I've ever heard. And, speaking of soundtrack, I just can't tell in words how much I love the song \"Can You Feel The Love Tonight\". Is one of my favorite songs ever. I truly believe that this motion picture could easily be nominated for The Best Picture, but The Best Song and the Best Original Score is really enough. I wonder if they will ever think to make a prequel of this movie in order to understand who is Mufasa, Scar, Sarabi and the other characters. In short, this movie will be remembered in the next 100 years. Truly."
    },
    {
      "username": "Lady_Targaryen",
      "userUrl": "https://www.imdb.com/user/ur6643268",
      "reviewLink": "https://www.imdb.com/review/rw1217669",
      "warningSpoilers": true,
      "date": "16 November 2005",
      "rate": "10",
      "helpful": "17 out of 25 found this helpful.",
      "title": "My favorite cartoon from Disney!",
      "content": "The Lion King is a classic from Disney. I remember going to the movie theater/cinema and watching the film...I was exactly 8 years old. And until now, with 19 years old, the good sensation of watching this movie is the same as that time. My mother even bought me Simba's doll! =)The story takes place in Africa, where Simba, son of Mufasa, is very well protected by his dad.(sometimes with the help of Zazu, a bird that is kind of a counselor of the king Mufasa)Everything goes well, but there is one problem: Scar, Mufasa's brother, is jealous because he is not the king of the jungle, and decides to do a plan to kill Simba and Mufasa. Simba escapes, but Mufasa dies; Scar tells Simba that he is guilty for Mufasa's death,and the terrified Simba runs away, too sad of what happened. Far from his kingdom, Simba meets Pumbaa and Timon, who takes care of him and teaches about Hakuna's Matata philosophy. Everything will be very well for a long time, until Simba meet again his childhood friend Nala ,who tells him about the horrible things Scar is doing in the old Kingdom."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw1327689",
      "warningSpoilers": false,
      "date": "28 March 2006",
      "rate": "9",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Wonderful Music and Rhythms",
      "content": "This is an outstanding work of animation. I realize that it has been criticized for political incorrectness. The fact of the matter is that it has strong female characters as well as male, and it's about a vision of monarchy. I have the greatest respect for female role models but I really don't see this as a worthy criticism. It's a great story of defeat and betrayal and renewal. It has delightful individual characters, dressed up to show their beings in a clever way. It has the most despicable villains with Scar and the Hyenas. It has the Henry II thing about duty. It doesn't glorify fooling around as one of my colleagues told me. The free life is OK but at some time you must follow your heart and redeem yourself. The music is outstanding; another triumph or the Disney team. There are three or four numbers that are so critical to a complete understanding of the events of the story. The sound effects person should have been rewarded because sound is so critical in this. From the stampede to the forbidden areas of the kingdom. I watched this about sixty times with my small children and never really tired of it. I would put this at the top of any list of animated adventures."
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw5047176",
      "warningSpoilers": false,
      "date": "8 August 2019",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "A Disney classic",
      "content": "In the African savannah King Mufasa, a lion, rules over the Pride Lands. He explains to his son, a young cub named Simba, that one day he will be the king... but before that he has a lot to learn. There are dangers, even for lions. The greatest danger comes from Simba's Uncle Scar; an embittered lion with a Machiavellian streak. Scar wants to rule but to do that he needs to rid himself of Mufasa and Simba... he has plans. One day Scar's plan works; Mufasa is dead and Simba leaves the Pride Lands believing he is to blame for his father's death. He grows up learning to take things easy with new friends Pumbaa and Timon, a warthog and meerkat. Scar now rules the pride with the help of the hyenas. When Simba learns of how bad things have got in the Pride Lands he will have to decide whether to continue the easy life or fight to make things better.This film is definitely one of Disney's classics; it has a fine story, some great characters and catchy songs. Simba is a decent protagonist even if the plot demands that he isn't too strong early on and Scar is a great villain; as are his trio of hyena acolytes. Given the film's 'U' certificate I was surprised at how dark it is in places; some scenes might disturb younger viewers as characters are often in real danger. The voice cast is very impressive; notably Jeremy Irons, as Scar, James Earl Jones, as Mufasa, and Rowan Atkinson, as Zazu the hornbill who is Mufasa's majordomo. As one would expect from Disney the animation and character designs are all really good. Overall I'd definitely recommend this for all but the youngest children and adults alike."
    },
    {
      "username": "thediggens",
      "userUrl": "https://www.imdb.com/user/ur23966498",
      "reviewLink": "https://www.imdb.com/review/rw3029064",
      "warningSpoilers": false,
      "date": "5 June 2014",
      "rate": "9",
      "helpful": "5 out of 5 found this helpful.",
      "title": "A Modern Classic",
      "content": "The Lion King is by general consensus the greatest Disney film from their glorious renaissance period (1989-1999), and is undoubtedly worthy of such recognition. Notably, it is the highest rated Western animation on IMDb's own Top 250, which while flawed and imprecise is a good indicator of quality.A loose adaption of Shakespeare's Hamlet, The Lion King is visually stunning, the peak of hand-drawn animation, with a strong voice cast and a wide selection of memorable tunes. It is a tight ~80 minutes, and one sometimes forgets just how quick the movie moves, yet it does so deftly. The characters are well defined, and the arc of Simba's growth, the core of the film, evolves satisfyingly. One could question whether more time should have been spent on Simba's growth in the middle act (there is incredulous imagery as Simba grows exponentially next to the stasis of Timon and Pumba), but to meander so would ask it to be an entirely different film.While it is not uncommon for a side character or two overshadow the main (see the Genie in Aladdin), Matthew Broderick and Jonathan Taylor Thomas (adult and young Simba respectively) are at risk from nearly all of the phenomenal cast. James Earl Jones is a commanding presence, and Jeremy Irons as Scar steals every scene. The 'fools' of the film, be it Timon & Pumba, the Hyena trio or even Zazu, all provide the levity believably, that would otherwise leave an incredibly sombre film. Nala is powerful, though one must note that she seems at times far more capable than Simba to actually achieve anything. Nevertheless, Simba's coming-of-age arc, while predictable, is enjoyable, helped along by fantastic charisma and choice songs.The fact that the film has spawned a wildly successful musical gives a strong indication of the quality of the music, but what is less said is how beautiful the film is. As The Lion King was being released, works were already moving away from hand-drawn animation, with Toy Story released a year later. And The Lion King might be the peak of hand-drawn, with an enormous palate of creativity and variety. The opening vista for 'Circle of Life', the bursts of colour in 'Can't wait to be King' and the sombre tone of 'Be Prepared' all are gorgeous. Yet, special mention must go to the Stampede scene, one of the finest scenes of animation ever.One thing I've developed from multiple viewings is how Timon and Pumba might be the weakest part of the movie. First, their 'life lessons' are essentially reversed by Rafiki. Certainly they are qualified to the point of being narratively sidelined. They feel contrived and even a detraction from the meat of the movie. Their role is the fast food portion of the film- the quick fix over more meatier bits of the film. The entertainment provided is enjoyable regardless, and is essential to round off the movie as Disney.The Lion King is endlessly re-watchable, catchy, fun, while remaining a fantastic piece of cinema and an invaluable part of the Disney canon. Magnificent."
    },
    {
      "username": "Dontcallmekeys",
      "userUrl": "https://www.imdb.com/user/ur5379811",
      "reviewLink": "https://www.imdb.com/review/rw1131960",
      "warningSpoilers": true,
      "date": "21 July 2005",
      "rate": "10",
      "helpful": "31 out of 39 found this helpful.",
      "title": "A Timeless Film",
      "content": "Ah...\"The Lion King.\" There's so much I can say about this movie but all my comments always come down to one thing: this movie is beautiful. Pure genius. A timeless story. I might be a little biased in my beliefs, seeing as the first movie I remember seeing in theatres is \"The Lion King\" and I still watch it on a regular basis and know all the words but I'm sure there are plenty of people out there who agree with what I have to say. \"The Lion King\" is beautiful; hands down, it is the best Disney film ever created.The story is something that everyone can relate to, whether they are a lion ;) or not. Simba is destined to become king one day and just can't wait to rule the throne; everyone can relate to wanting to grow up and become an adult, to do whatever they want and not have to worry about anything. His father tries to teach him that, despite the fact that he will one day be grown and king, his life will not be easy. Simba has to learn his lesson the hard way when his Uncle Scar, who, too, wants the throne, kills his father and convinces Simba that it was his fault. Suddenly, growing up doesn't seem so great anymore (I can *really* relate to that).And so, Simba flees his home and comes across Timon and Pumbaa, two other outcasts. They teach Simba the \"Hakuna Matata\" lifestyle, something that idealizes a life free of stress, worry and responsibility. Now, don't we all wish we could live this way? No worries for the rest of our days... But when Simba's childhood friend Nala returns, he realizes that he can't live Hakuna Matata forever, for he does have a responsibility to his pride and his homeland. Simba understands that he must grow up, as we all do, and does what's right.The songs are catchy and fit the movie well (the original songs, of course, though \"The Morning Report\" isn't too bad) and the score is haunting and beautiful. Along with the art work, the music captures the heart of Africa.With the types of shows that children watch these days (boy, doesn't that make me sound old?), it's a wonder they'll learn in virtues and values at all. \"The Lion King\" is a great teacher when it comes to learning lessons that will carry throughout their lifetime. \"The Lion King\" teaches children that it's all right to be a kid but you must understand and accept responsibility for things you can and cannot control. Everyone has a place in The Circle of Life and we must find it; the film also teaches that we will encounter bad and even terrible things during our lifetime but we must accept them and move on. These are important, meaningful lessons; heck, I even used them in my SAT essay! \"The Lion King\" is a film for every generation and is a powerful film that all children should see. I'm past my childhood now and I still watch it whenever I get the chance; I look forward to sharing it with my children.A timeless film!"
    },
    {
      "username": "miadarlingtxn",
      "userUrl": "https://www.imdb.com/user/ur79715629",
      "reviewLink": "https://www.imdb.com/review/rw3787202",
      "warningSpoilers": false,
      "date": "23 August 2017",
      "rate": "9",
      "helpful": "28 out of 34 found this helpful.",
      "title": "great film",
      "content": "this was, and still is,a great movie I love it, and hope that everyone gets to experience it for themselves, I've watched it many times and it is always good no matter how many times you have seen it,the songs are great and so are all the characters and the story is incredible, great for all ages and I really recommend it to anyone who hasn't already watched it."
    },
    {
      "username": "OllieSuave-007",
      "userUrl": "https://www.imdb.com/user/ur0437174",
      "reviewLink": "https://www.imdb.com/review/rw2897599",
      "warningSpoilers": false,
      "date": "1 November 2013",
      "rate": "8",
      "helpful": "6 out of 8 found this helpful.",
      "title": "Exciting original story from Disney.",
      "content": "This movie's story was written solely by Disney Studios, about a young lion, Simba, who was forced into exile by his evil Uncle Scar, who wants to take control of the jungle before Simba claims it. Life in the jungle declines under Scar's rule as Simba abandons his identity and meets new friends, Timon and Pumbaa, in another part of the jungle.Roger Allers and Rob Minkoff directed an exciting movie, adopting more of what I think are some of mainstream Hollywood's intense drama and comedy styles, seen in such parts like Uncle Scar and his crafty hyena goons chasing away poor Simba like gangsters pursuing a helpless hero, and the parts of the more modern day jokes and punchlines made by Timon and Pumbaa. The movie is also full of drama and action that will attract an audience of all ages, providing a great source of entertainment. It is compelling to see how Simba tries to wrestle his way out of his doubts as he tries to find his true identity and compelling to see Simba's family try to overcome adversary under Scar's rule. This is also a powerful story about courage, duty and identity (noticable as Simba tries to find his way) and the importance of family. Hans Zimmer did a good job on the music score and Elton John wrote some memorable songs like \"Circle of Life\" and \"Can You Feel The Love Tonight.\" The toe-tapping \"I Just Can't Wait To Be King\" is my favorite.The characters are likable and, like the plot's style, take on more of a mainstream Hollywood approach. This movie differs from the more earlier films such as \"Cinderella\" and \"The Jungle Book,\" and even the later films such as \"The Little Mermaid\" and \"Beauty and the Beast.\" \"The Lion King\" doesn't have that Disney touch you've come to expect and love in many of the fairytale and adventure movies, signaling that Disney films have evolved immensely over time. Even though it's not one of the more conventional Disney films, \"The Lion King\" is still a very good movie to watch due to its original concept, captivating story and memorable characters.Grade B+"
    },
    {
      "username": "dipto31121978",
      "userUrl": "https://www.imdb.com/user/ur22591913",
      "reviewLink": "https://www.imdb.com/review/rw3755877",
      "warningSpoilers": false,
      "date": "16 July 2017",
      "rate": "10",
      "helpful": "23 out of 29 found this helpful.",
      "title": "Its a 10",
      "content": "\"The best movie I ever watched in any form or any in language\".No, I am not exaggerating! It is the best movie ever, whether in human form or in animated. I can't find a single flaw in The Lion King (1994). Someone could argue that the story is not original, Disney just twisted it. Someone could also argue that i didn't watch that much of movies to judge \"The Best Ever\" but as I said, this the best movie I ever saw. The story is nice and free flowing and without any unnecessary bumpers. One can not recognized the voices behind the characters, because the characters are so prominent. Music! Let me say I am not very fond of English pop songs, but I could hum almost most of the songs of this movie, so I would say, music is that nice. Animation is superb, landscapes are eye catching, dialogues are sharp and comedy is at its best. What more might I say?Beside everything, you can say how crazy I am about this movie by my name. Enjoy the movie, don't leave the seat. Hakuna Matata!"
    },
    {
      "username": "bblack1-699-968577",
      "userUrl": "https://www.imdb.com/user/ur43883460",
      "reviewLink": "https://www.imdb.com/review/rw3034612",
      "warningSpoilers": true,
      "date": "15 June 2014",
      "rate": "9",
      "helpful": "6 out of 7 found this helpful.",
      "title": "You Are More Than What You Have Become",
      "content": "So...I'm going to try not to be too biased here...I'm going to compose myself the best I can...But, I'm not going to lie, that's going to be really hard seeing as though I AM IN LOVE WITH THIS MOVIE!!! I know a lot of people say this film is overrated and all that jazz, but LOOK AT THIS FILM and tell me you don't love it too!ANIMATION: Spectacular! This movie looks great! Of course it has an epic, grand quality about it, and the animation really takes it to another level! The stampede scene has got to be one of the biggest scenes ever put to traditional animation!SONGS/MUSIC: This movie brings us the Tim Rice/Elton John team. Even though there's no Alan Menken or Howard Ashman, these songs are still great! They fit the movie's tone, they're not out of place, and they are ALL memorable! This Disney movie has the best soundtrack - there is no Number One hit song from this film - ALL the songs are Number One! I don't just love the songs, but I am in mad love with Hans Zimmer's score! It's beautiful! It tells the story and fits the mood perfectly! The main theme, \"Lea Halalela,\" is fan-frickin-tastic! Gosh, if that theme were a woman, I'd marry her! But the music is what takes us to Africa (which country are we in? I don't know...), and if it weren't for Lebo M's contributions, NO music in this movie would be great!ROMANCE: For as much as I love this movie, I have to admit that this is one of the weak aspects of the film. I love the \"Can You Feel the Love Tonight\" number; I love the song, and I love looking at the animation. But...why is the song here? Why is this scene here? First of all, it doesn't match the story at all. It feels like the scene takes place because...Disney movies have romance scenes! Secondly, I don't believe Simba and Nala are in love. Look at how other Disney films show love: characters are smiling, singing, happy, and would do anything to be with their romantic interest. Here, Simba and Nala are arguing and yelling at each other after the scene. I'll tell you what, though, if you look at Nala as she's laying on her back during the song number, look at how she looks at Simba. That says, \"I want you, lion man.\"CHARACTERS: I am in love with these characters! Much like the \"Beauty and the Beast\" gang, there's not a person...or animal...in this movie I don't dislike! My two favorite characters are Mufasa and Rafiki. Mufasa wreaks of power! The reason we hate Scar so much is because he kills Mufasa, who we love so much! He is the father of Disney movie fathers - Disney fathers period! He says one of my favorite lines: \"Look inside yourself, Simba. You are more than what you have become.\" OOOH, that line just OOZES power - just BLEEDS power!!! Rafiki is awesome because he is both funny and wise. He knows just what to say and just what to do for the right moment. He has funny lines like \"It means you are a baboon, and I am not!\" Yet he knows when to hit Simba over the head with a stick and tell him to learn from his mistakes. Go Rafiki!STORY: I think the story is excellent. I love watching it, I love watching Simba's arc, I think it is brilliant...Though, there's one other problem the movie has that lies in the story. After Mufasa dies and Simba cries over his body, Scar comes and tells him to run away. Question: if they're all alone, why doesn't Scar just kill Simba himself? At first I thought it was because he didn't want Simba's blood on his hands, but that can't be right. First of all, he has Mufasa's blood on his hands. Second of all, he has a violent fight with Simba at the end of the movie. If Scar wants the throne so badly that he puts together an attack against two children, a Nazi team of hyenas, and a wildebeest stampede, I don't think he was above killing a child. The movie could have been over just like that; why didn't he kill Simba? The only reason I can come up with is \"If he killed him, there'd be no movie.\" Well, that's weak. If that's the case, then the movie didn't need to happen. We should have gotten a better reason for the following events that took place.CONCLUSION: Despite the two problems I have with the movie, I still adore it! It's epic, it's dramatic, it's funny, it's musical! It is large! It has one of the saddest moments ever in Disney. It is one of the studio's biggest movies for a reason! Find out for yourself in the big Circle of Life! BOOYIKA!"
    },
    {
      "username": "masonsaul",
      "userUrl": "https://www.imdb.com/user/ur94560739",
      "reviewLink": "https://www.imdb.com/review/rw4995537",
      "warningSpoilers": false,
      "date": "14 July 2019",
      "rate": "10",
      "helpful": "6 out of 8 found this helpful.",
      "title": "One of Disney's best",
      "content": "The Lion King is one of Disney's all time best films with a great combination of humour and emotion. The animation is incredible and it's extremely well paced. The performances from all of it's excellent cast are great. Hans Zimmer's score is amazing. All of the songs are all fantastic and it's consistently very funny. Its also extremely emotional and comes to a very satisfying and thrilling conclusion."
    }
  ],
  "errorMessage": ""
}