{
  "imDbId": "tt0129167",
  "title": "The Iron Giant",
  "fullTitle": "The Iron Giant (1999)",
  "type": "Movie",
  "year": "1999",
  "items": [
    {
      "username": "Wizard-8",
      "userUrl": "https://www.imdb.com/user/ur0101706",
      "reviewLink": "https://www.imdb.com/review/rw0501582",
      "warningSpoilers": false,
      "date": "6 August 1999",
      "rate": "10",
      "helpful": "247 out of 292 found this helpful.",
      "title": "YES!!!!! NO SONG OR DANCE NUMBERS!!!!!!",
      "content": "What a GREAT movie! Not just for kids, but adults as well. Kids will love it on one level, and adults will love it on another level. Even adults who are not parents will love it!There's humor, there's action, there's nostalgia, there's the perfect capture of being a child, there are positive messages (be yourself, don't kill, etc.), there's satire, there are adults who are not stupid and not comic relief....there's GREAT WRITING!AND NO SONG AND DANCE NUMBERS! Also, there are NO COMIC-RELIEF ANIMAL SIDEKICKS! Take that, Disney! I know some people might be resisting this movie, because it looks like it's aimed for kids - and they might be expecting a Disney clone (and we all know the bad results of Disney wannabes).....but TRUST ME. Give this movie a chance - you'll love it!Is there ANYTHING wrong with it? Well, the only thing that bugged me (just a little) were some close-ups of the characters - these certain close-ups had a \"sketchy\" look a la the movies \"We're Back!\" and \"Balto\".Fortunately, there's very little of this. Other than that - this is a PERFECT MOVIE!"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2159746",
      "warningSpoilers": false,
      "date": "18 November 2009",
      "rate": "10",
      "helpful": "43 out of 51 found this helpful.",
      "title": "Outstanding on all levels!",
      "content": "The Iron Giant was a beautiful, funny and touching movie, that is one of the best non-Disney animated movies I have seen along with The Prince of Egypt, The Secret of NIMH, Watership Down and Castle of Cagliostro. There wasn't a single thing I hated about the movie, for me it was outstanding on every level. The animation was absolutely gorgeous, with stunning colourful backgrounds and brilliant character animation especially on the Iron Giant himself. The music by Michael Kamen was consistently excellent, and never overpowered the story. In fact at times it even enhanced the drama. And the film has a beautiful message not to mention a sweet story. The characters were delightful, Hogarth isn't annoying at all and the Iron Giant isn't scary in the slightest. Strictly speaking he has to be one of the most gentle and poignant characters in an animated film. There are plenty of effective scenes like the explosive climax and the scene with the dead deer is a real tear jerker. I will admit I was worried initially when I saw the voice cast, but everybody involved did a superb job. Jennifer Aniston and Harry Connick Jnr were perfect, in their most understated performances. Both get stick about being untalented, but for me their vocal contributions in this film suggests otherwise, while Christopher MacDonald almost steals the film as the FBI agent. Eli Marienthal is very sweet and likable as Hogarth too, and watch out for John Mahoney and Cloris Leachman. All in all, an outstanding film, that if you mind me saying so is the best animated film of 1999 and one of the best films of that year too. I may be wrong but I do think it is highly underrated on IMDb. 10/10 Bethany Cox"
    },
    {
      "username": "dpenny",
      "userUrl": "https://www.imdb.com/user/ur0550735",
      "reviewLink": "https://www.imdb.com/review/rw0501599",
      "warningSpoilers": false,
      "date": "29 December 1999",
      "rate": "10",
      "helpful": "408 out of 442 found this helpful.",
      "title": "a masterpiece, plain and simple",
      "content": "I'm 25 years old. I have no children. So why am I praising a 'kid's movie' which nobody saw? Because I have never seen a film pack the emotional wallop 'The Iron Giant' provided.The film's plot is similar to 'E.T.' - a young boy meets an alien robot from outer space, who is stranded on earth, and runs afoul of paranoid government agents. Not to knock the Spielberg film, but what makes 'The Iron Giant' the better film is that the young boy is the teacher. It is he who has to teach the Giant about the beauty of life, the difference between good and evil, and choices we have to make. The Iron Giant, it turns out, is a weapon, who has to struggle against his own nature. The film has an obvious (and timely) gun control message, but its real message is about the choice we make when dealing with other people. We can use our powers for good or lash out at everyone around us.I dare not give away the climax. All I will say is that it features a sacrifice absolutely breaktaking and emotionally shattering (albeit somewhat blunted by the ending). The animation is gorgeous, Michael Kamen's score is perfect, and the film beautifully evokes the 1950s.Sadly, poor marketing kept audiences away in droves. All I can say is, to heck with the box office gross. Despite Warner's appearant desire to pretend the film never existed, the word is getting around about what a magical film this is, and I have no doubt it will join 'It's a Wonderful Life' as a film which bombed in theatres but became a classic over the years. See it now, so you can say you discovered it before everyone else did."
    },
    {
      "username": "Don-102",
      "userUrl": "https://www.imdb.com/user/ur0187170",
      "reviewLink": "https://www.imdb.com/review/rw0501609",
      "warningSpoilers": false,
      "date": "22 January 2000",
      "rate": "10",
      "helpful": "99 out of 117 found this helpful.",
      "title": "An Absolute Wonder Which Cherishes Its Influences - The Best Animated Feature Ever !",
      "content": "Animated movies have long been considered strictly for children. The old Disney classics that started it all are indeed aimed at kids, but are still very watchable, even for adults. With the advent of TOY STORY and its countless mimics, animated feature films have taken long strides to be considered worthy of serious attention. THE IRON GIANT is just such an animated piece. The 87 minute wonder is, to put it mildly, incredible. Everything about it is good. I've also never seen so many influences and references in an animated film before.This is a movie with a heart the size of the title character. A gentle, gigantic robot is rocketed to earth and befriends a 10 year old boy. The kid has a single mother (voiced nicely by Jennifer Aniston) and he is just looking for a friend, whether it be a squirrel, or even a 50 foot tall machine. The familiar premise is obviously out of Spielberg's E.T. One scene even has the giant reaching out his finger to the boy in much the same way ET did to 10 year old Elliott when he departed this earth. E.T. was an out of this world fantasy that took place on this earth. Here, it is animated and almost just as effective.IRON GIANT takes place during 1957 in a small town in Maine. The 1950's was a time when the American public was fearful of atomic bombs and the possibility of alien life off the earth. Live-action sci-fi films of the 1950's always depicted the arrival of \"dangerous\" alien life and our efforts to destroy it. THE DAY THE EARTH STOOD STILL is an influence on this film for evident reasons. Ultimately, the characters in that classic learn from the extra-terrestrial being and realize the dangers of the A-Bomb. It is amazing to see an animated feature which can relay this same type of message some 50 years later.A beautiful and touching ode to BAMBI is witnessed about halfway through. It also brings back some tearful moments from the key scene in that great, hand-drawn film. Here, we see both hand-drawn imagery coupled with a computer-generated \"iron giant\". The title character is actually a 3D composition done digitally, mixed with the 2D action surrounding him. There are some highly imaginative shots of the robot mixing in with the film's environment. At one point, he appears to be a lighthouse until the lights begin to blink. I guess robots must blink too. Enough analysis. I loved this movie. It is ranked #81 on the top list by other user authors for a reason. Not only is it escapist, fantastic entertainment for kids, adults, and seniors alike, it is an animated picture like no other. It combines the joy of SNOW WHITE and PINOCCHIO, the commentary of 1950's science fiction, and the wizardry and laughter of TOY STORY and its sequel. Do not miss this enchanting flick.RATING: ****"
    },
    {
      "username": "Gouda-3",
      "userUrl": "https://www.imdb.com/user/ur0105627",
      "reviewLink": "https://www.imdb.com/review/rw0501804",
      "warningSpoilers": false,
      "date": "11 August 1999",
      "rate": "",
      "helpful": "170 out of 187 found this helpful.",
      "title": "A delightful surprise",
      "content": "\"The Iron Giant\" is the kind of animated film you wish there was more of. It respects the audience's intelligence, it has genuine emotion without resorting to schmaltz, and best of all it balances fantasy (well, science fiction) with believability. I think Warner Brothers animation has out-Disneyed Disney by adding thoughtful writing to clean, understated animation. What a concept!The story is deceptively simple: Iron Giant falls from the sky at the dawn of the Space Race and befriends a young boy. But within that framework we get a double story, one for the grown ups and one for the kids, but the message is essentially the same one: paranoia and violence begets violence. I appreciate very much, as others who have commented, that no one burst into incongruous song and that there were no cutesy animal sidekicks. I should add that there were no clever yet implausible plot twists, nor were there any stock characters. The bad guy gets a little overheated, true, but he is never the embodiment of all things evil. The townspeople are your average small town Americans, not bumpkins. Mom is, well, mom-ish, caring but neither shrewish nor prone to whimpering outbursts. And our hero is plucky but not annoyingly precocious.A BIG plus for this film is how well it weds the computer animation to the hand-drawn animation, a feat that the Big Mouse hasn't mastered yet. Even as recently as \"Tarzan\" it is glaringly apparent what parts are computer graphics and which aren't, and the contrast is very distracting. \"The Iron Giant\" makes a virtue of streamlined animation that draws your eye to the beauty of its color and motion.It was a very VERY distinct and unusual pleasure to be treated to a film such as this. Give us more . . . please!"
    },
    {
      "username": "Figaro-6",
      "userUrl": "https://www.imdb.com/user/ur0411294",
      "reviewLink": "https://www.imdb.com/review/rw0501779",
      "warningSpoilers": false,
      "date": "9 August 1999",
      "rate": "10",
      "helpful": "182 out of 203 found this helpful.",
      "title": "The Best of Two Worlds: Adult and Kid",
      "content": "All too often, \"family films\" are only infantile, simplistic formulas with a few self-referential and pop-culture jokes thrown in to try and keep adults awake. But then along comes something like \"The Iron Giant\", which is sophisticated enough to demand respect while maintaining a mythic and pure-hearted tone that actually does appeal to the kid in everybody.\"The Iron Giant\" is refreshingly non-Disney in no end of ways. Characters seem real and chosen to fit the story, instead of being a superficial reshuffling of an old formula. The animation definitely has its eye-popping moments, but there are also scenes of great wonderment, pathos, and humour that only top-drawer animation can convey. The Giant itself is a great character, who only becomes MORE interesting as the film continues (another huge break from Disney). No scene is wasted in this film, either; every set piece, even the really funny ones, helps either to establish the \"world\" of the movie, or to advance the plot. At no time do you feel that you are merely waiting for the story to crank up again.\"The Iron Giant\" is funny, exhilarating, and touching as well. It's sad to see it failing at the box office, as a blunt reminder that the success of films is often in direct proportion to their publicity budget. Hopefully, though, word-of-mouth will come to its rescue. Go see it! Tell your friends! Then go again! (Repeat as necessary.)P.S. I find myself comparing the Iron Giant character to Martin Donovan's character in \"Amateur\". If there is anyone else on earth who has seen both films you may wish to entertain the notion yourself."
    },
    {
      "username": "flickjunkie-3",
      "userUrl": "https://www.imdb.com/user/ur0934203",
      "reviewLink": "https://www.imdb.com/review/rw0501694",
      "warningSpoilers": false,
      "date": "22 November 2000",
      "rate": "",
      "helpful": "86 out of 107 found this helpful.",
      "title": "Exquisite.",
      "content": "The Iron Giant is a critically acclaimed piece of animated cinema. I wasn't expecting it to be that good, but The Iron Giant was an amazing movie, it is easily the most exquisite animated movie I have ever seen.Hogarth Hughes (Eli Marenthal) is obsessed by the opportunites offered by science fiction, the possibility of an alien take-over or, at the very least, an attack from outer space. The original story, which the late Poet Laureate had set in England, saw the innocent Titan of the title emerge from the sea; here he is a visitor from another galaxy.The Iron Giant is an amazing piece of animation, the voice-overs were done perfectly, the actors obviously enjoyed themselves, the animated art direction and cinematography was beautiful and the giant itself is just...breathtaking.The Iron Giant is not just another silly little kiddies movie, it is perfection in filmmaking. Please, for the love of God, make your life better and see this brilliant film.I rate The Iron Giant 10 out of 10."
    },
    {
      "username": "pooch-8",
      "userUrl": "https://www.imdb.com/user/ur0197287",
      "reviewLink": "https://www.imdb.com/review/rw0501783",
      "warningSpoilers": false,
      "date": "2 August 1999",
      "rate": "",
      "helpful": "54 out of 69 found this helpful.",
      "title": "Guns kill.",
      "content": "An ambitious take on Ted Hughes' 1968 children's book The Iron Man, director Brad Bird's The Iron Giant works well as both archetype-infused allegory and heartstring-tugging tale of friendship. Set in small town Maine in the 1950s at the height of Cold War paranoia, the film explores the relationship between a lonely, fatherless boy (a photo on a nightstand hints that the father was a combat pilot killed in WWII) and a monstrously huge, hulking metal behemoth (the origins of which are brilliantly left to the imagination). The animation marks a welcome contrast from the virtually ubiquitous Disney template, with the human characters bearing a stylized, comic book exaggeration that fits perfectly with the story material. The Iron Giant has more than enough imagination and sparkle to interest kids and adults, and nicely balances its action-adventure aspirations with a solidly-crafted sense of moral purpose."
    },
    {
      "username": "Rectangular_businessman",
      "userUrl": "https://www.imdb.com/user/ur13538926",
      "reviewLink": "https://www.imdb.com/review/rw1596529",
      "warningSpoilers": false,
      "date": "11 February 2007",
      "rate": "10",
      "helpful": "20 out of 26 found this helpful.",
      "title": "A new classic",
      "content": "\"The Iron Giant\" is simply one of the best animated movies ever made. Brad Bird, the talented man that worked in shows like \"The Simpsons\" and directed the great animated film \"The Incredibles\" is the man responsible for this masterpiece. That man is a genius who is able to turn the simplest stories into gold, having an entire career of very good films. Even his \"Mission Impossible\" film (A franchise which I particularly don't like)managed to be worth-watching.Now \"The Iron Giant\" is one of my favorite films, and it is the best movie directed by Brad Bird, having not only a great animation style, but also a memorable story (Which shows that kid's films could have deep and complex stories)and many intesting characters, The Giant itself is a fascinating creature, which could be easily considered one of the most endearing figures from the entire animation history.Movies like this are enough proof that making a \"children's film\" is not a excuse for a lack of quality. It is for movies like this that I'm a fan of animation."
    },
    {
      "username": "Anansi00",
      "userUrl": "https://www.imdb.com/user/ur3891488",
      "reviewLink": "https://www.imdb.com/review/rw0976005",
      "warningSpoilers": false,
      "date": "11 December 2004",
      "rate": "9",
      "helpful": "84 out of 96 found this helpful.",
      "title": "What more animated movie should be: a thoughtful, funny, touching story.",
      "content": "After seeing this movie, I was overcome by a strange feeling. I realized that I had found a treasure where I had least expected it. The Iron Giant is intelligent, funny, touching, and visually superb, and should show the world that an animated movie does not need to be A) computer-animated, or B) based on a fairy tale to be successful. One of the best American-made children's movies I have seen in a decade: 8.5/10.0Now, I'm a 17-year-old who is slowly transitioning into the domain of movie buffdom, which basically means that I am watching a stream of movies based on recommendations from friends, critics, and the IMDb Top 250 list. I got this one almost by accident after the local rental place could not find the movie I was really after, choosing it basically on the knowledge that it was the previous project of Brad Bird, director of The Incredibles (a personal favorite). After watching it, I felt like calling up every mother I knew and telling her to have her children (and herself) watch this.The Iron Giant revolves around an adventurous young boy in 1950s small-town America who discovers a gigantic robot out in the woods that has arrived on Earth from goodness-knows-where. He befriends the robot, while trying to keep him safe from a nosy government agent. The story seldom lags, with a series of comical adventures connected by the boy's growing relationship with his friend. This movie is very appealing as entertainment. The voices are well-done, and the scenery is also terrific. Most importantly, though, is the animation, which is a bright spot from this time period. The characters are well-drawn, especially the Giant, who through terrific design, lifelike movements, and clever small touches (i.e., the eyes) seems both alien and human, imposing and childlike. Furthermore, the animation is comical. I don't know when I have ever seen slapstick or punchlines so well-complimented by the animation. The script, written by Bird and based off the book The Iron Man, is also very well done. Though the movie relies upon a few minor crutches common to children's movies, it is still very original and clever.One thing that I must point out about this movie is its morals. Throughout the movie, the main moral of the story, about the Iron Giant learning and choosing to be good, is actually fairly adroitly handled. At no point when the subject comes up, including standard sentimental climax, does the idea seem contrived. Throughout the movie, evidence of Bird's influence by comic books is quite evident, and his ultimate message about heroes (variations of which will resurface in The Incredibles) is relevant and sincere. However, I do have to say that the secondary moral, about the evils of xenophobia and paranoia, both of which are embodied by the movie's antagonist, the government agent and the military, are very politically charged. While this may sound initially controversial and politically charged for a kids' movie (the second of which I do not deny), I noticed that it was in large part a thoughtful spoof of Cold War America, with jokes as well as valuable lessons about \"duck and cover\" and 1950s nuclear edginess that I found very clever.On a final note, I do have to point out that this movie had me laughing hard, but more importantly, it brought me closer to tears than any animated movie I can remember (including Bambi), closer than I like to admit. I wish that I had discovered it sooner, and I hope that everyone gets the chance to experience it the way I did."
    },
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw3716955",
      "warningSpoilers": false,
      "date": "26 May 2017",
      "rate": "10",
      "helpful": "18 out of 24 found this helpful.",
      "title": "Great entertainment ,,, AND a piece of history",
      "content": "Belated review written in 2017.Animation has greatly advanced in the last few decades but nonetheless this entry, at the turn of the millennium, is special.It marked the debut of writer/director Brad Bird, now considered a god in the animation studio.The story is so simple it almost seems unworthy. But in the hands of a master, what you will see is perfection in writing and directing and casting and voice work.Suitable for all ages, will remain a classic for years to come."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw0501618",
      "warningSpoilers": false,
      "date": "7 February 2000",
      "rate": "8",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Much More Than a Cartoon",
      "content": "Sometimes when watching an animated feature, I spend my time saying, \"What great animation.\" When this happens, I wonder if I am doing what the producers wanted me to do. Like so many things, should I be so enamored with the technical part of the movie that I am distracted from the content. As I watched \"The Iron Giant\" I realized I had forgotten it was an animated feature. Don't get me wrong. I knew the enormous title character was animated, but the relationships among the characters and the intelligence of the script caused me to forget that these weren't actors. The movie is filled with tender moments, especially as they relate to our feelings of our own mortality. What I enjoyed is that the grownups aren't treated as garden variety bad guys. Even the military, which is nearly always portrayed as evil, finds itself in a contradictory position--having to go on faith. The animation is wonderful, but so are the \"performances.\" No spoilers here, but I think the ending is a lovely tribute to the spirit of the life force in all of us--even those of us not made of metal. See this. It is one of the better movies of the year."
    },
    {
      "username": "Soujiro",
      "userUrl": "https://www.imdb.com/user/ur0368346",
      "reviewLink": "https://www.imdb.com/review/rw0501806",
      "warningSpoilers": false,
      "date": "12 August 1999",
      "rate": "",
      "helpful": "62 out of 81 found this helpful.",
      "title": "Surprisingly Good Fun For Anyone",
      "content": "It's nice to see an elegantly crafted piece of animation come out of America. How did they manage it? The writing is great the animation is excellent and the voice acting is superb. I don't think I've liked an English animated film this much since The Plague Dogs. The film doesn't talk down to it's audience, and instead tells a simple story very well. My only complaint would be that Hogarth is somewhat of a smart-alec at times, but I guess this is the era of Leave it To Beaver.Many of the situations are standard movie-fare, the ex-lax in the food, the helmet on the bed, but it's nice to see them in an animated film for a change. As an anime fan, the realism of the movie didn't impress me as much as the quality of the writing, voice acting, and the music and sound effects. I particularly remember the sound of the power lines snapping and the musical score building up to the climax of the film.The character design for the giant is excellent, it's amazing how they could draw out very subtle emotions without noticeably distorting the face. I bawled like a baby near the end.Finally, most importantly for me, there are NO CHEAP LAUGHS in the movie. One of the best moments in the movie for me was when Hogarth is running through the woods and he slams his face into a low branch. The theater full of kids raised on recent Disney crap bursts into laughter, but wait, there's no stupid sound effect, he's not hopping back up to his feet instantly with a ridiculous lump or distorted face or little birds flying around his head, he's still on the ground ... and what's that coming out of his nose.. it CAN'T BE.. it IS, a trickle of BLOOD. The kids (and parents) quickly cease their laughter. I couldn't stop smiling because I knew then that like me, they actually cared about the character on the screen and frankly that doesn't happen very often.Tarzan was a small step in the right direction, and near the end of the long path beginning with that step is The Iron Giant."
    },
    {
      "username": "p.greenwood",
      "userUrl": "https://www.imdb.com/user/ur0877608",
      "reviewLink": "https://www.imdb.com/review/rw1448150",
      "warningSpoilers": false,
      "date": "14 August 2006",
      "rate": "10",
      "helpful": "30 out of 34 found this helpful.",
      "title": "Stunning and magical",
      "content": "I had heard many great things about the iron giant in the last few years but was one of those films I never got round to seeing. I picked up a copy of the special edition DVD expecting an entertaining animated film. What I actually got was not just one of the best animated films I have seen but one of the best films ever. It takes you to another world but never strays from reality and when watching it you forget it's animated. The characters are so well written it puts most live action films to shame. If you pass this off as a kids film you will be missing out on one of the most immersing and emotional experiences you can get from a film. The voice cast are perfect, the animation stunning and the fact this film flopped when released is nothing short of criminal. I urge anyone even with only a passing interest in cinema to watch this film and prepare to be amazed. Brad Bird must be one of the best directors working in animation and after seeing the incredibles the iron giant was no fluke."
    },
    {
      "username": "yusufpiskin",
      "userUrl": "https://www.imdb.com/user/ur34435688",
      "reviewLink": "https://www.imdb.com/review/rw6426008",
      "warningSpoilers": false,
      "date": "31 December 2020",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Timeless Cult Masterpiece",
      "content": "This was one of my favorite films growing up and it holds up extremely well. Apparently, this bombed during its initial release, as it was caught between the old ways of animated films and the new breath of fresh air in Pixar. Brad Bird will become well known for the latter's stellar films, but his directorial debut may be his crowning achievement.Set during the height of the Cold War in the '50s, the story follows a young boy named Hogarth, who lives with his single mother in a small town in Maine. He's obsessed with science fiction movies and comic books and finds a paternal relationship and friendship with an otherworldly giant robot. The film balances its obvious E.T. inspired storyline with its Superman-esque inspiration as well. It's seeped with 50's iconography and mood too, giving the audience a lot of insight into the Cold War and the red scare that was so prevalent at the time the movie was taking place. Its period piece offers much more subtext than a traditionally animated film.Every character is charming and well rounded, whether it be Hogarth himself, Annie, Kent Mansley, Dean, or the Iron Giant himself. All the voice actors do extremely well too, especially Vin Diesel in the titular role, whose soft-spoken giant's relationship with Hogarth is the emotional backbone for the film. The animation and art style is beautiful, and adds to the depth of each character with exaggerated facial expressions, and offers a lot more focus on the emotions of the characters. The computer animation of the iron giant gives it an otherworldly perspective.The Iron Giant is one of the best-animated films of all time, and a classic that can be enjoyed by anyone. It's an emotionally warm film full of vibrant animation, great characters, and a story that offers much heart and joy."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0501725",
      "warningSpoilers": true,
      "date": "26 June 2001",
      "rate": "",
      "helpful": "12 out of 18 found this helpful.",
      "title": "Mechanized Animation",
      "content": "Spoilers herein.I will admit that this is very skilled storytelling: I am really impressed with how singlemindedly every element of this film is coordinated to give a single feel which sustains -- it has to because there is no story development to speak of. So rather than focus on managing evolution of drama, `Iron' focuses on evocation of a single `feel.' And they do that well enough for me. I actually did participate in those duck and cover drills.What I find more interesting is the approach they took to the production of the film, which I find highly self-referential, and which may be the cause of a subtle effect for the viewer. At least I like to think so.The giant is drawn not by a human animator -- instead it is a three-dimensional model created in the computer. The computer then `renders' the 2-D image according to directions. The resulting figure is assembled in a scene that has hand-drawn human characters. In a very real sense, this character of a robot is acted by a robot, while the human characters are `acted' (drawn) by humans.As with all cartoony films, the voices are what you really `see' so far as the drama. But in terms of the images -- which is what all film experiences are about -- what you really see is a conflict among the religions of animators very much like what you see on the screen. That it is set in a pre-computer, but post-nuclear age -- that the lines drawn are not ones of coexistence but of good and evil -- says a lot about Bird's take on all this. A very intimate and effective film on filmmaking. Probably shouldn't be on IMDB's `science fiction' list though."
    },
    {
      "username": "lei wulong",
      "userUrl": "https://www.imdb.com/user/ur0554652",
      "reviewLink": "https://www.imdb.com/review/rw0501601",
      "warningSpoilers": false,
      "date": "31 December 1999",
      "rate": "10",
      "helpful": "80 out of 99 found this helpful.",
      "title": "A very good movie....",
      "content": "Hmmm, what to say...well.... it was really good. I've seen it several times, and I've enjoyed it immensely each time for different reasons. Analytically I find the animation incredible. The characters are extremely alive and quite realistic, not because of incredible drawing, well, actually, yes: the way the characters are drawn, and animated, is incredible. From the jerking, swaying and swooshing of body parts to the magnificent and CONSISTENT use of eyes, eyebrows and cheekbones to show real emotions, it's definite that this movie is a masterpiece in terms of animation. The backgrounds are wonderfully lush, and evoke a wonderful sense of everything that shows fall for the beautiful season it is. I love animation, and I love good looking landscapes, so the artists behind this movie are making a fan out of me very quickly.I admire (analytically) most of all the enormous apparance of little details in the film: the season sublty changes from fall to winter; the characters are always doing something, even if they aren't directly in focus (the best ad-libbing a director could dream of); I also think in some parts of the movie the little details actually become crucial to the movie's strength and validity (the time and setting of the story help it to make more sense, also, the \"duck and cover\" scene)You know, I think it's amazing when sometimes a movie can move you so much, talking about it's good qualities seems like child's play. This is the kind of movie that you can watch over and over and take a long time to get sick of. We all have movies like that, very few can do that to us, but we have them. I'm realising as I write that I like this movie very much, because I've written two or three paragraphs and have not even started talking about the iron giant yet.The animation and expression of emotion in the giant, who is a computer graphics animated character, a hundred feet tall and with a certain old time sci fi persona to him, equals and even surpasses it's traditionally animated companions. There were scenes in the movie that the giant almost made me cry because of his expressions. The director, Brad Bird I think, should earn good credit for his work bringing the giant to life. The giant was very organic and fluid, always animated and extremely alive, without really trying to be. After a while it obvious he's not your average rigid robot.It's hard not to give away details when you write a lot, but thankfully I haven't really given anything away. I will say this...the movie is about not prejudging things you are unfamiliar with, big or small, and it's about doing what is right and not using gray areas and politics as an excuse not to do the right thing. The movie explores the strange concept of finding friendship, love, and innocence inbetween past guilts and prejudices. It is one of the most well rounded, enriching, thought provoking movies I have seen in my lifetime, and the best part is that it wasn't the visual effects that made me say that...something other feature animation companies have used a a string to lead me on for almost a decade. I feel like I just recovered from an extended brainwashing experiment. I've learned my lesson. No longer will movies that use stunning graphics to redeem themselves be an interest to me. Rather I will watch movies for the messages they give and the depth those movies have. If anything Brad Bird must have tried to make the giant as close in simplicity to the regular animated characters as possible, because you CANNOT tell the difference between CG and traditional in this movie. Exceptional stuff.I can't imagine anyone I know not liking this movie. I've shown it to a LOT of people, college students mostly, of all races and religions, with different prides and prejudices, the result, amazingly, always seems to be the same: I have some after movie comments here, and I quote:\"Wow!\" ; \"That was NICE!\"; \"That was SO...GOOD!\" ;\"That giant is crucial, dog!\" ;\"It was good...yeah...I liked it!\",; and \"Dang man, that joint TIGHT!\". If you actually read this review all the way, that's nice. Now forget everything I bumbled about and go see this movie, that way you can spent less time writing your own review than you did reading mine."
    },
    {
      "username": "Simon_Says_Movies",
      "userUrl": "https://www.imdb.com/user/ur7051754",
      "reviewLink": "https://www.imdb.com/review/rw2072274",
      "warningSpoilers": false,
      "date": "26 May 2009",
      "rate": "10",
      "helpful": "14 out of 20 found this helpful.",
      "title": "As touching, funny and timely a film as any committed to celluloid",
      "content": "Having to compete with Disney, Dreamworks and Pixar, Warner Brother's animation has never been at the forefront of the animation industry. Apparently all they needed was the brilliant Brad Bird to quell any doubt about their capabilities. The Iron Giant is one of the final films to be presented in the traditional animation form, but even this flick had begun the transition to computer generated visuals. A number of characters, including the giant, were inserted digitally over the hand drawn background, taking special care to perform this imperfectly so as to contrast the rougher backdrop. The finished piece is a visually flawless and captivating film and ranks among the best animated features to ever grace the screen.Brad Bird who began with significant role in The Simpson's cartoon, marks his feature film debut, and would follow up with the even superior films The Incredibles and Ratatouille. The Iron Giant is part political statement, part satire and part family fare, but contains more substance then most children's films, containing passionate and is reminiscent of classics such as ET and The Lion King. Based on the book by Ted Hughes, the tale tells of a young boy in Rockwell, Maine named Hogarth Hughes voiced by unknown Eli Marienthal who, if you must put a face to the voice played Stiffler's younger brother in American Pie, in Cold War era 1958. His mother voiced by Jennifer Aniston, works late shifts at a local diner, his father has been killed (presumably in combat, as we see from a photograph he was a fighter pilot) and Hogarth who has been moved up a grade, finds himself lonely and misunderstood.On a stormy night, a mysterious object crashes off the coast, which to Hogarth's surprise (and everyone's for that matter) is a giant metal eating robot. Finding the creature to be as harmless and confused as a young boy, he befriends the behemoth, stashing him away in a local scrap yard, who the owner (voiced by Harry Connick Jr.) is not especially pleased about. After the giants shenanigans begin to be noticed, a federal agent, brilliantly voiced by Christopher McDonald, comes to investigate ands comes to suspect Hogarth may know something.The scenes where Hogarth attempts to hide the creature are the most hilarious, one sequence after the giant loses his hand (which can walk on its own once severed) our young protagonist attempts to sneak it out of the house. But don't be fooled, the iron Giant is less comedy then it is bold statement, but don't let this turn you off either.Bird's piece is riddled with political commentary on the Cold War and its effect on America and the society's obsession with warfare, weapons and at what cost freedom can be obtained, issues such as morality and death, and explores the human gift of free will, as both a blessing and as a means to do harm. The Giant, despite having every few lines is surprisingly layered and human, and has an innocence covering an inner evil turmoil. The message that you are who you chose to be is reminiscent throughout the whole film, but it never for a second feels preachy. The climax is a thrilling as any action picture, which I will say may be slightly too violent for younger children, and the closing act is as touching as any committed to celluloid.The Iron Giant is a dazzling tale and complex experience which is bound to keep you involved, entertained and will give you something to think about after leaving the theatre. Ranking as one of the best films of 1999, if The Iron Giant marks the end of the reign of the traditional animation style, I say that no finer adieu could be given in this world, or any, dare I say it, beyond this Earth.Read all my reviews at: http://www.simonsaysmovies.blogspot.com"
    },
    {
      "username": "TheMysteriousReviewer",
      "userUrl": "https://www.imdb.com/user/ur127588122",
      "reviewLink": "https://www.imdb.com/review/rw8034891",
      "warningSpoilers": false,
      "date": "5 April 2022",
      "rate": "10",
      "helpful": "7 out of 9 found this helpful.",
      "title": "An Underrated Animated Masterpiece",
      "content": "I'm going to say one thing. When I first saw this back in 2016, it did seem interesting to me. I thought it would be just an enjoyable sci fi film. But honestly, I did not expect this to be one of my favorite animated movies. The Iron Giant may possibly be the best animated movie Warner Bros has produced worldwide. At first, it seemed it was just gonna have a little cheesy giant monster film. But this is more than that. The story was incredibly written that's about a giant robot that is taught to be a civilized monster. It has profited a lot of character development. And this has presented top notch animation with some of the best effects for an animated film. It's not enough to make a reason how I consider this a masterpiece. It's how heartfelt it is. If you have actually seen monster movies, the setting is in the 50s. And you'll see they normally either take over cities or destroy the world. But this is a lot different. This is about how the giant learns about the world, what happens in life and why everyone would be afraid of him. I'm not gonna spoil it, but let's say that the ending has been a true example. No matter what, you got to watch this film. The one thing that shocked me is it wasn't much successful at the box office. And now many people has given so much attention many years later. Not only is this one of the most underrated movies I've seen, but also one of the most feel good movies I've seen. As the giant himself said it best, souls never die."
    },
    {
      "username": "supernma",
      "userUrl": "https://www.imdb.com/user/ur9237072",
      "reviewLink": "https://www.imdb.com/review/rw2110812",
      "warningSpoilers": false,
      "date": "13 August 2009",
      "rate": "10",
      "helpful": "14 out of 20 found this helpful.",
      "title": "One of the most underrated films of all time",
      "content": "This certainly ranks as one of the finest examples of cinema in recent pop culture memory. Intelligent, funny, tragic, and deeply moving, we'd be so lucky to ever see an American animated film strike such chords again. The look of the film is superb, and it's underlying themes and messages resonate even more strongly today. Containing a boldly pacifist theme, the film tells a story of a mechanism of war--meant to destroy--that, through the innocence of a little boy, learns to sacrifice in the name of peace and understanding, as apposed to killing in the name of ownership and power. I hope,as years pass, more and more people come to discover this gem so that they can share their experience with the Iron Giant, as well."
    },
    {
      "username": "krasnegar",
      "userUrl": "https://www.imdb.com/user/ur0492753",
      "reviewLink": "https://www.imdb.com/review/rw0954496",
      "warningSpoilers": false,
      "date": "30 October 2004",
      "rate": "",
      "helpful": "11 out of 15 found this helpful.",
      "title": "Attention to Detail",
      "content": "Having been nine in 1957 myself, i appreciate the incredible amount of attention to verisimilitude that this film exhibits -- even the wide turn-ups on Hogarth's jeans, for example.Another thing i was interested by is the fact that we are never told *why* Hogarth's mom is a single parent... but i seem to recall a framed photo somewhere in the house showing a pilot standing by a jet fighter. I knew a couple of kids my age whose dads had never come home from a place called Korea.There are some glitches -- a 1959 Cadillac in a scrapyard in 1957, for instance, or going skinny-dipping in a lake in Maine in late October; and i'm fairly sure that (a) There was no \"Spirit\" comic in publication in 1957 and that (b) the \"Spirit\" comic cover shown is actually a painting \"Spirit\" creator Will Eisner did in the late 70s/early 80s for a reprint series.The references to films of the period -- the sand pit from \"Invaders from Mars\", the tank disintegration for \"The Day the Earth Stood Still\" and the animated \"Brain from Planet Arous\" on teevee are neat, too.Looking forward to next Friday's opening of Brad Bird's new film, \"The Incredibles\", though i suspect that \"Iron Giant\" will prove to be the stronger of the two..."
    },
    {
      "username": "bogiefan-2",
      "userUrl": "https://www.imdb.com/user/ur0999040",
      "reviewLink": "https://www.imdb.com/review/rw0996477",
      "warningSpoilers": true,
      "date": "10 January 2005",
      "rate": "10",
      "helpful": "15 out of 19 found this helpful.",
      "title": "One of my favourite films - animated or otherwise",
      "content": "Like most reviewers here, I stumbled across The Iron Giant. Frankly, I don't know how I missed it in the theatres, but I picked up a used VHS copy a few years back and fell for it. I recently purchased the DVD version and have rekindled my appreciation for this lovely film.In addition to being a polished gem of a morality play, it is well animated, and well voice-acted. Perhaps Hogarth is portrayed as too obvious a scamp and Kent is too over-the-top in his zeal but the subtlety in the Iron Giant's limited movements and \"vocabulary\" more than make up for it. In any case, this is an animated film - we should expect \"cartoonish\" characters, right? Perhaps it was the total lack of cutesy animals doing Disneyesque song-and-dance numbers, but I found myself noticing the \"acting\" of these characters. Don't worry, I snapped out of it soon enough...Unlike some, I didn't see TIG as a slam against militarism. In fact, the General here (nicely voiced by John Mahoney) shows a considerable amount of balance. Rather, the film is about personal growth and change, respect for life, values, and the bond of friendship. This side of the film works so well that the Giant's utterance of one word - \"Superman\" - toward the end of the film sent me searching for the tissues. (word of advice: keep them handy).Do yourself and your kids and watch this film. Appropriate (IMO) for ages 3 and over (including adults!)."
    },
    {
      "username": "BabelAlexandria",
      "userUrl": "https://www.imdb.com/user/ur115227177",
      "reviewLink": "https://www.imdb.com/review/rw6611327",
      "warningSpoilers": false,
      "date": "19 February 2021",
      "rate": "9",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Who Is the Iron Giant, and Why has he Come to Earth?",
      "content": "Neither of these questions is answered in this charming movie, based on a novel by Ted Hughes, but it doesn't seem to matter. The Iron Giant is highly emotional film, but in an understated way. The scenes of 1950s small town Maine were highly evocative without being overly nostalgic. Hogarth is a great role model for young boys, even if he can be a bit impulsive and doesn't always listen to authority figures: he cares deeply for animals, and in this case, his robot friend, whom he looks after and instructs as if a young child. Not having experienced that era myself, the depiction of the Iron Giant nonetheless reminded of postwar Science Fiction covers, as in Tales to Astonish, etc., even if his gentle character did not. And I liked the anti-gun theme: Hogarth's toy gun \"triggers\" the self-defense mechanism in the robot, who gradually learns of his strength and automated programming, and, with the help of Hogarth, fights it: \"I am not a gun.\" I also appreciated the ambiguity of the robot: is it aliens? Russians? Does it matter?Watched in February 2021, all three of us really enjoyed it. Sienna: \"one of the best we've seen in a long time.\""
    },
    {
      "username": "youarenotgoliath",
      "userUrl": "https://www.imdb.com/user/ur27093440",
      "reviewLink": "https://www.imdb.com/review/rw6721822",
      "warningSpoilers": false,
      "date": "20 March 2021",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Cult Classic",
      "content": "I've seen this movie a billion times, and now that I have kids, I get to watch it a billion more. Love it."
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw2097734",
      "warningSpoilers": false,
      "date": "18 July 2009",
      "rate": "9",
      "helpful": "3 out of 4 found this helpful.",
      "title": "You are who you choose to be.",
      "content": "It's the 1950s and young Hogarth Hughes happens upon a visitor from space ..... in the form of a giant iron man.Delightful animation adaptation of Ted Hughes' much beloved 1968 novel \"The Iron Man\". Set during the period of time when Cold War and sci-fi paranoia was prevalent, The Iron Giant embraces these themes and stokes them with lessons of friendship, hatred, death and pertinent reminders of pacifism. Directed by Brad Bird and scripted by Tim McCanilies and Andy Brent Forrester, The Iron Giant is one of those rare animation animals that delights the kids as much as it does the watching adults. Though the actual giant himself, with all his dazzling weaponry, is the star attraction on show, it's the iron colossus' inner conflict that gives the film its heart. Aided by his friend, young Hogarth, good old iron decides he doesn't want to be a big weapon, but the authorities, as is nearly always the way, just can't let it be. The unflinching attitude that ran through many of the 50s sci-fi schlockers was one of being \"because we don't understand it, lets destroy it\" is something that Ted Hughes and the film makers here capture perfectly. Sophisticated and intelligent in its approach and delivery, this is definitely one of the better animated film's from the modern age. 9/10Voice work comes from Jennifer Anniston, Harry Connick Jr, Vin Diesel, James Gammon, Christopher McDonald, M. Emmet Walsh and Eli Marienthal."
    }
  ],
  "errorMessage": ""
}