{
  "imDbId": "tt0338013",
  "title": "Eternal Sunshine of the Spotless Mind",
  "fullTitle": "Eternal Sunshine of the Spotless Mind (2004)",
  "type": "Movie",
  "year": "2004",
  "items": [
    {
      "publisher": "The Hollywood Reporter",
      "author": "Kirk Honeycutt",
      "link": "",
      "rate": "100",
      "content": "Not only (Kaufman's) most accessible and romantic screenplay, it's his most complete. The third act works like a charm and pulls all his themes, characters and conflicts together beautifully."
    },
    {
      "publisher": "Premiere",
      "author": "Glenn Kenny",
      "link": "",
      "rate": "100",
      "content": "A wildly imaginative, hugely entertaining tour de force that asks big questions about life and love and fate while never ceasing to fully engage the viewer."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "",
      "rate": "100",
      "content": "Watching Eternal Sunshine, you don't just watch a love story -- you fall in love with what love really is."
    },
    {
      "publisher": "Variety",
      "author": "Todd McCarthy",
      "link": "https://variety.com/2004/film/awards/eternal-sunshine-of-the-spotless-mind-2-1200534526/",
      "rate": "90",
      "content": "If films about coping with memory loss and/or reverse-order storytelling now constitute a mini-genre, then Eternal Sunshine of the Spotless Mind is arguably the best of the lot."
    },
    {
      "publisher": "Time",
      "author": "Richard Corliss",
      "link": "",
      "rate": "90",
      "content": "Kaufman may be counting on the audience's will, insistence and yearning to create a coherent love story from the shards and shrapnel he provides us."
    },
    {
      "publisher": "Village Voice",
      "author": "J. Hoberman",
      "link": "",
      "rate": "90",
      "content": "It's a baroque and intermittently brilliant brain twister so convoluted that it inevitably deposits the viewer in an alternate universe."
    },
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "https://www.rollingstone.com/tv-movies/tv-movie-reviews/",
      "rate": "88",
      "content": "Chases so many ideas that it threatens to spin out of control. But with our multiplexes stuffed with toxic Hollywood formula, it's a gift to find a ballsy movie that thinks it can do anything, and damn near does."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "88",
      "content": "This is unlike any other film I have seen... it's a great romance. It's willingness to flout conventions and eschew formulas is just one of many things to celebrate about this charmingly eccentric movie."
    },
    {
      "publisher": "The New Yorker",
      "author": "Anthony Lane",
      "link": "",
      "rate": "80",
      "content": "There aren't many performers who can deliver the fullness of heart that such a plot demands, but Winslet is one of them. [22 March 2004, p. 102]"
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "Peter Rainer",
      "link": "",
      "rate": "80",
      "content": "For most of Eternal Sunshine, I found myself fighting off Gondry's hyperactive intrusions in order to get at the melancholia at its core. Fortunately, the idea behind this movie is so richly suggestive that it carries you past Gondry's image clutter."
    }
  ],
  "errorMessage": ""
}