{
  "imDbId": "tt0338013",
  "title": "Eternal Sunshine of the Spotless Mind",
  "fullTitle": "Eternal Sunshine of the Spotless Mind (2004)",
  "type": "Movie",
  "year": "2004",
  "items": [
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0902530",
      "warningSpoilers": false,
      "date": "2 June 2004",
      "rate": "10",
      "helpful": "907 out of 1,044 found this helpful.",
      "title": "\"Eternal Sunshine of the Spotless Mind\" is a bizarre but wonderful movie, a very strange and remarkably tender experience.",
      "content": "\"How happy is the blameless vestal's lot! The world forgetting, by the world forgot. Eternal sunshine of the spotless mind! Each pray'r accepted, and each wish resign'd.\" - Alexander PopeMichel Gondry's \"Eternal Sunshine of the Spotless Mind\" is a bizarre but wonderful movie, a very strange and remarkably tender experience, which I suppose is only to be expected from screenwriter Charlie Kaufman, the man behind \"Being John Malkovich.\"The film was produced by Focus Features (\"Lost in Translation,\" \"21 Grams\"), a company which strives to offer original, quality films to the true cinema lovers. If the company keeps producing films this good, they may become hugely successful in the future, if not already.The previews portrayed the movie as a bouncy, cheery comedy in the vein of \"Adaptation,\" the last film written for the big screen by Charlie Kaufman, when it is really a tender movie about love and romance. This is Jim Carrey's best performance to date, and may open the eyes of his prejudiced haters who have only imagined him as Ace Ventura and a certain cable guy for his entire career. No snippy quotes, outrageous humor or bizarre antics in \"Sunshine\" -- Carrey plays a true, realistic, three-dimensional character named Joel Barrish, who plans to have memories of his girlfriend, Clementine (Kate Winslet), erased by a new company called Lacuna, after he discovers that she herself has had the procedure performed only a week before. Joel meets with the company's founder, Dr. Howard Mierzwiak (Tom Wilkinson), and is informed that the procedure -- although \"technically\" brain damage -- is on par with a heavy night of drinking. \"Nothing you'll miss much,\" he is told, as he plunges into a bizarre world of long forgotten memories.The entire process of the operation is quite fascinating, really, if a bit reminiscent of an idea founded by none other than one of Kaufman's favorite writers, Philip K. Dick, who wrote the source short story for the Ah-nuld movie \"Total Recall.\" All items relating to the person you want erased from your brain are assembled together, and the technicians at Lacuna (Mark Ruffalo and Elijah Wood) then \"map\" an outline of your memories, which are supposedly stemmed together. I have my doubts about the seriousness and remote possibility of such a procedure being performed, and the explanation is quite simply utter bull, but we don't care because the entire erasing of Joel's memories serves as a backdrop for a deeper meaning: If you could forget about past romances, would you really want to? And if so, would you be willing to sacrifice all the good ones, along with the bad ones?The conclusion that \"Sunshine\" arrives at is, to be totally truthful, as honest as can be. During the procedure, Joel's subconscious realizes that it doesn't want to let go of its memories of Clementine, and so begins a strange labyrinth of fragmented memories, constantly changing surroundings, and mental materializations of Clementine. The movie is like a very bizarre dream, when you're trying to interact with people, but they're not responding, and you shout and try to get their attention but they don't seem to notice. Joel's entire odyssey of the interior of his mind makes \"Being John Malkovich\" look normal -- but as I didn't like \"Malkovich\" very much, and thought its strangeness was unjustified, it fits perfectly in \"Sunshine\" -- there are some great special effects, such as when Joel is wandering through his own memories, drifting in and out of sleep, hearing the voices of the technicians erasing his memories and watching as objects and areas around him vanish and deconstruct. It's so bizarre but yet also so beautiful. Gondry was a former music video director (his complete works are available on DVD) and he is the perfect candidate for this project, having worked with Kaufman before on the 2001 flop \"Human Nature.\" It seems that he has finally found a unique directing style that ties in perfectly with the underlying themes of the movie.There is a very deep message in \"Sunshine,\" and it is arguably Kaufman's deepest film to date. Love and romance and memories of both have rarely been examined as thought-provokingly and tenderly as they are in this wonderful motion picture. The movie has a very profound message that all viewers should pay attention to. There are many small intricacies in the film, surely picked up on more thoroughly on repeat viewings, and the entire construction of the movie is completely enthralling and intelligent. I saw two people leave the rather empty theater during the screening I attended. It tanked in the US and I predict it will do the same in the UK, which is a shame, because this is the smartest film of 2004 and has the most to say about our lives than any other film this year. While everyone flocks to see the new Denzel Washington action movie, \"Eternal Sunshine of the Spotless Mind\" is forgotten, which is quite depressing -- people would rather spend their money on forgettable entertainment than view something unique that has something important at its core.I think what the movie finally asks us after its long, emotional journey, is would we want our own memories erased? And if so, what would the consequences be? A lesser film might examine this idea poorly -- \"Sunshine\" is not. It is perfect in almost every conceivable way, and anyone who complains that it is not original must be joking -- in my entire lifetime, this is one of the most unique film experiences I have ever had.\"Eternal Sunshine of the Spotless Mind\" is a beautiful movie, eloquently voiced by Gondry, firmly constructed and rooted in an eerie nightmarish fantasy land where anything is possible. It's beautiful, it's bizarre, it's exceptional, it's funny, it's lovely, it's touching, it's witty, and it's one of the best movies I have ever seen."
    },
    {
      "username": "tccandler",
      "userUrl": "https://www.imdb.com/user/ur0327799",
      "reviewLink": "https://www.imdb.com/review/rw0902240",
      "warningSpoilers": true,
      "date": "26 March 2004",
      "rate": "10",
      "helpful": "1,070 out of 1,207 found this helpful.",
      "title": "Meet me in Montauk...",
      "content": "How happy is the blameless vestal's lot! The world forgetting, by the world forgot. Eternal sunshine of the spotless mind! Each pray'r accepted, and each wish resign'd. -- Alexander Pope==> I confess to being an idealist and a romantic. This type of film appeals to people like me... the ones who believe in love at first sight, soul mates, destiny, yada yada yada. The Charlie Kaufman penned 'Eternal Sunshine of the Spotless Mind' is as fresh and original as some of his other screenplays (Being John Malkovich, Human Nature, Adaptation), but adds a romantic depth that makes this one of the most complete film going experiences I have ever had.There was an exchange during the film between our two leads, Joel and Clementine, played with poignancy and nuance by Jim Carrey and Kate Winslet, that echoed what I was feeling about the film.Clementine: This is it Joel. It's going to be gone soon.Joel: I know.Clementine: What do we do?Joel: Enjoy it.Luckily for me, I knew I was going to be able to revisit the film many times in my life. The depth of the film manifests itself in the fact that the soul mates, Joel and Clem, both know that their time is running out and that they will never be able to meet again.Most films might choose to highlight this type of heartbreak with the death of a loved one or a bittersweet farewell at a train station. But not Charlie Kaufman. He is bored by clichés. Rather, he chooses to dazzle us with the complexities of the human mind and all of its glorious possibilities. He is a master storyteller that is unlike any other I am aware of.Joel (Carrey) is socially inept. He has had girlfriends, but none that really meant anything. It is as if he has never had a significant relationship of any kind. But, one day, he meets Clementine. \"Don't make any jokes about my name\", she warns him. She is wild and kooky, changing her hair color from red to orange to blue to green depending on her current mood. She seems the polar opposite of Joel, but they click. They click in ways even they can't pinpoint. But from the moment they meet, they know there is something special there.However, after a silly argument breaks up their relationship, Clementine decides to visit Lacuna Inc., a company that specializes in wiping troubling memories away forever. She has decided to erase the memory of Joel. When Joel hears this from some friends, he angrily decides to do the same to Clementine, erasing her completely from his mind.The erasing process involves a mapping of the memories and an all night process of erasure that is \"technically brain damage\", according to the doctor. The bulk of the film takes place during the process, inside Joel's mind. The most recent memories are first to go and we watch as they slowly disappear into nothingness. Those recent memories are bitter as we witness the arguments and the boredom of their relationship. But as the time rewinds, the memories get better. We travel backwards and watch Joel and Clem during their best moments, loving life and loving each other. As this happens, Joel desperately regrets his decision. He wants the inevitable erasure to stop, but he is completely powerless. Soon she will be gone and he won't even remember that he forgot her. The film focuses on his attempts to foil the process and retain some of her in the recesses of his mind.'Eternal Sunshine' is directed by Michel Gondry who also helmed 'Human Nature'. He has a flare that accompanies Kaufman's words with perfect symmetry. This film bounces around on its timeline almost hysterically, but the director never lets us get lost. We always feel in control of our senses and our emotions. It is a tribute to Carrey and Winslet that they were able to do the same.Jim Carrey has pulled off a rather remarkable transformation that I would have deemed impossible a decade ago. He is becoming a brilliant actor with qualities that resemble Jimmy Stewart and Tom Hanks. He is a fabulous everyman who is sympathetic and knowing, interesting and kind. He deserves tremendous praise for this role. Kate Winslet is consistently brilliant in every film. She is easily one of the very best actresses we have. Here she plays against type, and embodies a fascinating woman who craves attention but needs intimacy. Hers is a beautiful performance that will go overlooked. It is easy to understand why Joel falls in love with Clementine.I think fans of Charlie Kaufman will be thrilled with this brilliant entry in to his collection. I think the film will appeal to those who loved the recent masterpiece 'Lost in Translation' or Tom Tykwer's recent beauty, 'Heaven'. It is a romantic fantasy with real emotions and real characters that will resonate with the viewer who isn't entirely closed to sentiment. When Clementine whispers \"Meet me in Montauk\" into Joel's ear... it's hard to hold back a tear.This will easily be one of the best films of 2004. It is the antithesis of the typical romantic Hollywood fare. I loved every minute of its refreshing originality. The film has passion and flare and brilliant wit, all framed by an intelligent script that deals in absurdity while managing to maintain an intimate realism. These characters feel real. You root for them. You want them to meet again and give it another chance. It is a film that will only get better over time, as our memory of it waxes and wanes its way into our hearts.TC CANDLER"
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0953156",
      "warningSpoilers": false,
      "date": "27 October 2004",
      "rate": "10",
      "helpful": "405 out of 487 found this helpful.",
      "title": "an modern artistic triumph for all involved",
      "content": "Michel Gondry, credited as the director and co-writer of Eternal Sunshine of the Spotless Mind, is only partly responsible for the success that the film achieves. He implements a awe-inspiring blend of style to a story that is perfectly non-linear. But then there is also the madman genius of the current screen writing plane- Charlie Kaufman- who has written three of the most ingenious, funny, and human of \"little\" Hollywood movies (Being John Malkovich, Adaptation, Confessions of a Dangerous Mind). He understands, and perhaps likely experienced to a degree, what a relationship holds to- the truth, to understanding, and then when it ends, how out memory changes the relationship. Enter in the concept that makes 'Eternal Sunshine' something of a un-official science fiction film - the Lacuna corporation, led by Tom Wilkinson's character, can erase just one person out of your memory, all of the experiences that you and the significant other had. So, when Joel (Jim Carrey) goes in to erase his memory of Clementine (Kate Winslet) after finding out she did just the same, he enters into a mind-warp. He goes through memories they had, happy ones, sad ones, some that are just what makes up what you have emotionally with the one you've loved. And sometimes, and to the behest of the assistants of Lacuna (Kirsten Dunst, Elijah Wood, Mark Ruffalo), Joel doesn't want them all to be erased.As I mentioned, the plot is non-linear, which could've gone the wrong way if not done with skill. With a film like 21 Grams, which has a talented director and cast, the non-linear structure isn't necessary. But it's an asset that the story doesn't start from A to Z. To assist Gondry with this, he has the extraordinary Ellen Kuras as DP and Valdís Óskarsdóttir, an editor from Iceland. Their collaboration is crucial with Gondry and Kaufman (and co-writer Pierre Bismuth), as they bring all of these un-real images a real quality. Quite simply, there isn't a finer example of surrealism crossbred with realism in any other American film so far this year. The usage of lights, cuts, and with the kinds of special effects not expected (i.e. no CGI), add to the effect it has on a viewer. That the characters of Joel and Clementine are as enveloping as they are is also a credit to Kaufman.But then there's one more part that completes the success of the film - the acting. Jim Carrey, very simply, is at his very best. He finds a balance from certain scenes in being like people we see everyday, feeling low, not much of interest, inward. And then when the memory erases begin, we get to see him act funny, but not like the kind of humor he brought with Ace Ventura or Dumb and Dumber. This is Carrey knowing this character just well enough to play off his counterpart, played by Winslet. She, meanwhile, is perhaps at her best. Her character is eccentric, funny, insightful, and wanting. She pulls it off. As do the supporting actors.There's not much more I can say about this film, except to say that even after seeing it three times, I feel like I could watch it over and over and see a new shot, a new sequence, and new set of emotions tied to things. It's one of the great romantic dramedies of the decade."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2343283",
      "warningSpoilers": false,
      "date": "24 November 2010",
      "rate": "10",
      "helpful": "81 out of 93 found this helpful.",
      "title": "Absolutely wonderful",
      "content": "When I first saw Eternal Sunshine of the Spotless Mind, I wasn't expecting to love it, let alone like it. What a surprise when I saw it! I think this film is wonderful in every aspect, truly beautiful and packs a full emotional punch. In fact, if you don't mind me saying so, it is one of my favourite films of the 2000s.I especially loved how Eternal Sunshine of the Spotless Mind was shot. The whole film looks beautiful, not only with the cinematography which is indeed spellbinding but also in the scenery which was nothing short of amazing. Another impressive asset was the soundtrack/score. Eternal Sunshine of the Spotless Mind doesn't have the best soundtrack/score I have ever heard in my life, but the score makes the film all the more moving, while the soundtrack is well selected and appropriate.I was also very taken with the story. Eternal Sunshine of the Spotless Mind has one beautifully constructed story I can tell you, with an almost poignant message about it. It is strange and bizarre yes, but neither of those are bad, quite the contrary. Then there is the script which is both poignant and funny, not to mention very deep. The pacing very rarely feels boring if at all, and the direction is adept.I have very little to complain about Eternal Sunshine of the Spotless Mind's performances either. As good as the supporting performances are especially from the always splendid Tom Wilkinson, I have to give the real kudos to the leads. Jim Carrey has done some good performances in some good films, The Mask, Liar Liar, The Cable Guy and Bruce Almighty showcase his comedy talents wonderfully, but this and The Truman Show show he is perfectly good at drama too. He is very understated here, but it works as he still manages to be likable all the same. The real star though is Kate Winslet. A beautiful and captivating actress, Winslet is absolutely perfect in her role.Overall, wonderful film. Bizarre yes, but very tender and poignant helped by the exceptional performances and cinematography. 10/10 Bethany Cox"
    },
    {
      "username": "Superunknovvn",
      "userUrl": "https://www.imdb.com/user/ur1390493",
      "reviewLink": "https://www.imdb.com/review/rw0902562",
      "warningSpoilers": false,
      "date": "2 July 2004",
      "rate": "10",
      "helpful": "292 out of 344 found this helpful.",
      "title": "Perfect - a movie that puts 99% of all contemporary movies to shame",
      "content": "There's only one way to describe \"Eternal Sunshine Of The Spotless Mind\": perfect. It's been one week since I saw the movie and I still cannot stop thinking about it. Was the ending happy or sad? I cannot tell, but it's deeply touching.Charlie Kaufman is incredible. How does he come up with all these original, flawless scripts? Finally there's someone who uses the possibilities of cinema to the fullest. I love the way Kaufman shows the fate of individuals and derives universally true rules from it. The content of his story is always highly philosophical without ever being smart alec.Some say \"Eternal Sunshine...\" was over-directed. I disagree. Having read the script, I know that Gondry deserves lots of credit for bringing this beautiful story to life. Sure, there are five creepy images per minute, but have you ever seen such an original, weird picture? Mind you, I'm not saying that lots of effects automatically make for a good direction, but in this case it really helped to underline the story, not distracting from it.Jim Carrey... wow! I've always liked him as the hilarious Comedian he is, but I never thought that his performances in \"The Truman Show\" and \"Man On The Moon\" were that much of a departure from his funny-man side. As Joel, however, he is a completely different person. It's like Jim Carrey had a serious twin brother. Unbelievable. I bow to this performance! Give this man more chances to show his acting abilities, I say!Finally I have to mention Beck's cover of \"Everybody's Gotta Learn Sometime\", which fits perfectly into the movie and won't leave my CD-Player for the next months.A movie like \"Eternal Sunshine...\" really shows how much time and money Hollywood wastes on producing crap like \"Bad Boys\" or \"The Fast & The Furious\", and its box office result demonstrates how little people care about quality in movies. Personally, I have found my first contender for best motion picture of the year. I need to see the movie again, because I have a feeling that this one gets even better with each viewing. I can't wait until it's released on DVD.I feel the need to say more, but I can't put my feelings into (English) words. All I can say is: GO SEE THIS MOVIE! You won't regret it."
    },
    {
      "username": "mstomaso",
      "userUrl": "https://www.imdb.com/user/ur3824745",
      "reviewLink": "https://www.imdb.com/review/rw1360560",
      "warningSpoilers": false,
      "date": "6 May 2006",
      "rate": "10",
      "helpful": "116 out of 139 found this helpful.",
      "title": "It's OK (very OK)",
      "content": "Very nicely crafted science fiction love story. More of an experience than a film.What? Sci Fi? Well yes. A simple science fiction device, memory erasure, is the vehicle for this beautifully shot, brilliantly edited and directed love fable. The fact that this is a good film does not disqualify it from the sci fi genre. In fact, would-be sci fi writers and film-makers should take note of this.But Eternal Sunshine is a love story first and last, in all respects. The characters are what John Irving would call \"L.A. dysfunctional\", although they don't live in L.A. Carrey and Winslet are deeply insecure people with little going for them but good looks (which they try to disguise), fairly sweet dispositions, and a desire for companionship. They meet on Valentine's Day in Montauk, where they have both seemingly traveled 'on a lark', and the entire experience of the film seems to derail from this point forward. Chronological, linear story-telling becomes impossible because the characters are having their memories erased in order to assuage the pain of their separation. No spoilers, so let me stop right there.If I have made Eternal Sunshine seem like it might be too much of a challenge or too disturbing for an evening's light entertainment, be not afraid. Certainly there are occasional disturbing elements, and the characters themselves are all neurotic enough to have walked off the street and onto the screen. But the film is so artistically rendered, and so well thought-out that what could have been a nightmare really becomes a fantastic post-modern love fable. It's also one of those great films that becomes predictable after a while, but is so delightfully portrayed and satisfying that it does not matter.The acting is exceptionally good. I would expect nothing else from this cast. Winslet is especially remarkable for her ability to play a young North East American better than most American actresses could. How this genius has been passed up in each of her 4 Oscar nominations to date is inexplicable. Carrey's talent is undeniable, though I dislike many of the films he chooses to take on. His performance here is easily as good as his award-worthy performances in the Truman Show, Bruce Almighty, and Man on the Moon.We spend a lot of time inside people's heads in this film, yet the camera never becomes a member of the cast as it does in films like \"Being John Malkovich\". I can pay no higher compliment to the production team. This is a very difficult thing to accomplish, and it is done with flawless simplicity in Eternal Sunshine. This film has just joined Shakespeare in Love, Wild at Heart, and Brokeback Mountain among my favorite all-time love stories. This is the first Michel Gondry film I have seen. I am going to make sure it is not the last."
    },
    {
      "username": "Matt_Layden",
      "userUrl": "https://www.imdb.com/user/ur1878251",
      "reviewLink": "https://www.imdb.com/review/rw1020113",
      "warningSpoilers": false,
      "date": "13 February 2005",
      "rate": "10",
      "helpful": "110 out of 135 found this helpful.",
      "title": "Best Film of 2004",
      "content": "Joel (Jim Carrey) is a rather milquetoast man who meets up with free spirit Clementine (Kate Winslet), and they become romantically involved. However, they endure a messy breakup and Clementine goes to a business called Lacuna, Inc., where she has all of her memories of Joel erased. Not wanting to be left out, Joel also goes to have his memory erased. However, soon after it begins, Joel realizes that he wants to keep the memory of Clementine, so he tries to reverse the process.Well, if you're familiar with Kaufman's work, then you know what your getting yourself into. This is just as weird if not weirder than his previous work, Being John Malkovich. I knew what I was getting myself into, but 90% of the movie I was saying to myself \"What the hell is going on?\", but in a good way. It opens with Joel calling in sick for work and going on a different train, heading for Montauk. He meets Clementine and they hit it off. Now this is about 15 minutes into the movie, then out of nowhere come the opening credit sequence. I will admit, I thought it would be different, but I'm glad that it is the way it is, the movie is 80% of the time in Joel's head.If you think you know Carrey, think again. This movie is his best performance, better than Majestic, Truman show and all of his comedic roles (which is what I love him for). Just looking at his face from the second we see him, we feel his pain, then like that, we feel his joy, embarrassment and hate. Just awesome acting on his part, and Winslet was great as the free spirit who never seems satisfied. The supporting cast all work well in their small, yet important roles. Oscar nominations for Winslet and (crosses fingers) Carrey.But if I were to bet any money on any Oscar nominations it would obviously be the writing, what a mess, but beautifully constructed. You think to yourself, is that scene really necessary? Then ten minutes later you think to yourself how brilliant it was, that's beautiful, crazy, give me whatever he's smoking kind of writing. Charlie Kaufman's writing is always clever, but this time he's one-upped himself by making something simultaneously bizarre and emotionally engaging. It seemed like his earlier movies were clever for the sake of cleverness, but 'Eternal Sunshine' manages to dazzle you with it's originality and it's poignancy. The fact that this movie was able to wrap such profound loss, emotional tenderness, and hope in such a self-consciously stylized package illustrates the incredible talent of the people behind it.Michel Gondry's use of vibrant coloring and quick camera movement give the film a very involving first hand feeling. The constant use of the handy cam is very all involving for the viewer, and I suppose that this is exactly what is needed in such a personal movie. His work on the dream sequences is incredible as well. He decides to use more practical effects than what we see today with computers. Eternal Sunshine is a tragic, yet beautiful film that sits at the top of my list of \"Best of 2004\"."
    },
    {
      "username": "JAKastner",
      "userUrl": "https://www.imdb.com/user/ur1907398",
      "reviewLink": "https://www.imdb.com/review/rw0902147",
      "warningSpoilers": true,
      "date": "19 March 2004",
      "rate": "9",
      "helpful": "380 out of 463 found this helpful.",
      "title": "The Moose Hole - Review of Eternal Sunshine of the Spotless Mind",
      "content": "It happens to both the best and worst of us at some time in our lives. Love . If you haven't experienced this yet just wait, you will. It is inevitable that at some time in our journey through life that we will come across someone that fascinates us so profoundly that we feel as though we could spend the rest of our lives with this magnetic individual. There is no exact science to the concept of love. Many believe that the idea of love goes beyond the reasonable or the logical to a more diverse level of the illogical, irrational, and the unreasonable. Why is it that we find ourselves attracted to people that, on the surface, seem as though they would never be compatible with our own lifestyle? Why is it that when we do fall in love with a certain individual and think at first that this is a perfect match, we find over time that less tolerable marks are more frequent on the surface? And why is it that we overlook some individuals that, although at first there is no real 'love connection' per say, we seem to have a somewhat pure liking for someone and that it takes us longer then it should to see that person for who they really are to us? Love is a complicated subject that can't be taught, it can only be experienced for what it is . utterly confusing and yet at the same time completely fulfilling.The story is a twisted and complicated tale from the same man who brought movie-going audiences such award-savvy features as Being John Malkovich and Adaptation. Joel Barish seems like the average, normal guy who stays pretty isolated from communicating his true feelings to others and yet reveals spectacular insight only to the confines of his journal. He doesn't like going on impulses and gut feelings but rather relies more on common sense and the logical sense of self-direction. That is until he meets Clementine. They flirt with each other and eventually find themselves falling in love with one another . That is until one day Joel finds out that Clementine has undergone a radical procedure to have him erased from her memory because she was unhappy. So, in an act of self-gratification, Joel decides to undergo the procedure himself, erasing every argument, every embarrassment, every thought he has had involving Clementine. But as the procedure goes on, Joel begins to realize that beyond the quarrels and the less flattering incidents there were beautiful memories that he never wants to forget. So he does the unthinkable . Joel attempts to outrun the erasers through a dizzying chase through his mind. The story for Eternal Sunshine of the Spotless Mind is hauntingly brilliant and, in some cases, personally gratifying. The concepts and the feelings expressed behind the script of this film hit so hard to home that it feels as though we our seeing our own love lives played out on screen. Granted Sunshine does tend to veer off into the ridiculously absurd but when evaluating what one takes away from this film, it is pure genius.Quite amazingly this low budgeted independent feature showcases a surprising amount of A-list talent but manages to have those performers express well beyond their famous names. Jim Carrey, who has unsuccessfully attempted to make a mark in drama with lead performances in Man on the Moon and The Majestic, gives a thoroughly convincing and commanding performance in the role of Joel Barish. And Carrey's performance is only complimented by his interaction with Kate Winslet, who acts opposite of him as Clementine. Though the two give dramatically different personas to their characters and look as if they would never be quite compatible with each other based on surface actions, which is the idea the filmmakers are trying to express. It's not what is right in front of us that should define a relationship; it is the memories themselves and the experiences of the two individuals. Elijah Wood, in his first role outside the Lord of the Rings franchise which recently wrapped up in December, gives an effective performance as a man one can't help but despise for his methods of obtaining someone's affection but at the same time feel pity for his plight, which is that he feels love eludes him. And Kirsten Dunst performs well within the film despite her appearance that protrudes a sense of innocence that feels off-base or awkward that distracts from the actions of her character. Not to say that she doesn't perform well or that the character is a pointless one, not in the least, but perhaps it is the fact that her innocence, based on her name and the characters she has played, carries a stigma with her role.Overall, Sunshine, as awkward and thoroughly confusing at it may seem and is, manages to express, in the most informal of ways, the feelings and thoughts we should all have when examining a relationship, in that it is not the superficial features but the underlining memories that make it all worth while. When a relationship hits that unfortunate moment where it all seems to be breaking down, we, as human beings, seem to instantly draw ourselves to the negative aspects of that person, as Joel did early in the procedure, in an attempt of sorts to make everything right within our mind. What Eternal Sunshine successfully expresses is that when breaking down the relationship moment by moment, more often then not the happier events outweigh the bad and that should be our determining factor to keep the relationship going. Too many moments are wasted on gut-instincts and logic, when it comes to love one must live every moment for what it is because we only have one shot in this world and we might as well make it worthwhile. What happens if that relationship doesn't work? You pick yourself up, let the relationship go, and, in time, move on. If you try your best and nothing seems to work in that relationship then perhaps it will never work and you shouldn't play out a fantasy that you know will never be. We have all experienced moments where we feel as though there is opportunity to ask someone out or express how one feels for a certain individual but have chickened out due to nerves, 'gut-instincts', or views of superficial matters. Eternal Sunshine promotes the ideology of living within the present and letting the course of the matter play out as it may. If we all relied on nerves and logic, would anyone really fall in love?"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2874538",
      "warningSpoilers": false,
      "date": "23 September 2013",
      "rate": "9",
      "helpful": "36 out of 43 found this helpful.",
      "title": "most imaginative concept",
      "content": "Joel Barish (Jim Carrey) falls for Clementine Kruczynski (Kate Winslet) from the first moment they meet on a train. After a bad breakup, Clementine erases Joel from her memories. He decides to do the same to her. Patrick (Elijah Wood), Stan (Mark Ruffalo), and Mary (Kirsten Dunst) are the three slacker technicians who are running Dr. Mierzwiak (Tom Wilkinson)'s machine. As his memories are eliminated, he starts to fall in love with Clementine all over again. He struggles to hold on to his memories before it's all gone.The premise is amazing, but it's the imaginative visualization of the process that puts in on another level. Jim Carrey pours his heart into this very difficult disjointed performance. It's very effecting and probably one of his best non-impersonation performance. In its core, it's a beautiful love story. It's funny. It's poignant."
    },
    {
      "username": "aalborgen-21673",
      "userUrl": "https://www.imdb.com/user/ur69433834",
      "reviewLink": "https://www.imdb.com/review/rw5572979",
      "warningSpoilers": false,
      "date": "23 March 2020",
      "rate": "9",
      "helpful": "85 out of 89 found this helpful.",
      "title": "I didn't get it the first time I watched it",
      "content": "The first time I saw this movie I found it confusing, a little artsy for my taste and I didn't get it.But I didn't come in here to give it a 1 point rating or a damning review just because I didn't get it. It would be kind of stupid to pass judgement on a film that I didn't fully understand.Some years later I watched it for the second time. My ex had just left me, and I don't remember how and why I came by this movie again. But the second time I got it. And how life would be like a bleak dessert, frozen in time, in the eternal sunshine of a spotless mind.And after watching it a second time I felt hopeful again."
    },
    {
      "username": "soriano329",
      "userUrl": "https://www.imdb.com/user/ur8211248",
      "reviewLink": "https://www.imdb.com/review/rw1518838",
      "warningSpoilers": true,
      "date": "11 November 2006",
      "rate": "10",
      "helpful": "131 out of 151 found this helpful.",
      "title": "Brilliantly Original and Wonderfully Magical",
      "content": "Eternal Sunshine of the Spotless Mind is the most well written movie since Pulp Fiction, and the best movie since the turn of the century. It's originality is unprecedented, putting screenwriter Charlie Kaufman (Adaptation) up there with the greats. And every time you watch it, you will gain a new understanding of the characters and story.Just imagine, instead of dealing with the pain and suffering of your past, you can erase people and moments from your memory, and move on with your life, without giving it another thought. Imagine your bad relationships can disappear. You bad experiences obliterated. Your bad times gone. Dr. Howard Mierzwiak makes this all possible.Meet Joel Barish (Carrey), an archetypal lost American, a passive soul wandering through his own life in a cloud of dissatisfaction. One day, his shyness and antisocial tendencies led him to meet the free spirit Clementine (Winslet), changing his life forever.They break up, and Clementine impulsively decides to \"erase\" Joel from her memory. Joel, upon hearing this, also signs up for the procedure. But midway through, he changes his mind. Then the chase begins, as Joel and Clementine try to outrun the erasers, hiding in his childhood and humiliation.Meanwhile, Kirsten Dunst, Elijah Wood, and Mark Ruffalo, the ones performing the procedure on Joel, have their own troubles with romance, memory erasure, and Clementine, all due to the procedure offered by Dr. Mierzwiak.Although Carrey spends most of the movie in an induced coma, his outstanding performance proves to us that his talents go far beyond his Ace Ventura days. And Winslet's spectacular performance didn't go unnoticed either, earning her another Oscar nod.To say the least, Eternal Sunshine will change your life. Kaufman shows us that you must take the good along with the bad, because if you forget, you are destined to repeat your mistakes. Joel doesn't realize he made a mistake until he gets past their bad moments, and remembers all the good times he and Clementine had together. This movie gives a new meaning to \"You never know what you've got until it's gone.\"Eternal Sunshine of the Spotless Mind is a brilliant work of originality. With all the crap Hollywood has been turning out in recent years, this will feel like a blast of fresh air. Kaufman's masterpiece is inspirational, and, unlike most Hollywood films, makes you think. It'll make you realize that at the end of the day, our memories are all we really have, and when they're gone, we're gone."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8740487",
      "warningSpoilers": false,
      "date": "17 December 2022",
      "rate": "9",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Weird and wonderful.",
      "content": "Joel and Clementine have reached breaking point in their relationship, every action, every word triggers the other, so much so, that they each undergo a procedure to remove all trave of the other.How wonderful a thought, being able to remove all trace of an ex, better still having them remove all trace of you.It has taken me years to get this film, years, I simply didn't get it, I'd tried several times over the years, it just never clicked, until now. If you're frustrated by the first twenty minutes, I urge you to give it another try.We've all been there, hurt by a relationship, pushed to the point of despair, how wonderful it would be to remove all trace, it's a wonderful concept, but real life doesn't allow for that, however in film, anything is possible.Wonderfully nightmarish, but sweet and tender at times too, the moments of hate and loathing are eclipsed by Joel and Clem's tender scenes.The only thing I can think of that had similar vibes, was Total Recall, dissimilar in most aspects, but that whole memory manipulation theme is similar.I have forever been a fan of Jim Carrey, and I would regard this as one of his best performances, he's terrific, as is Kate Winslet, the pair combined so well.9/10."
    },
    {
      "username": "rje58",
      "userUrl": "https://www.imdb.com/user/ur0402036",
      "reviewLink": "https://www.imdb.com/review/rw0902157",
      "warningSpoilers": false,
      "date": "24 March 2004",
      "rate": "",
      "helpful": "651 out of 820 found this helpful.",
      "title": "Great, if you can relate...",
      "content": "If you can relate to the underlying theme of love longed for, love given and received, and love lost, this is a great film. If you have come to understand that acceptance can -sometimes- be a great thing and not a compromise or a 'settle for' - this is a moving film.As crazy and almost surreal as elements of this film are, it somehow remains honest and real. That seems like a contradiction... life is contradictory, isn't it?Carrey and Winslet both turn in superb performances, as do the supporting cast. An incredible film that most of the people who 'get it' will love - but I suspect there will be more than a small percentage who won't understand it or can't relate to it and they will (understandably) dislike it."
    },
    {
      "username": "doctec",
      "userUrl": "https://www.imdb.com/user/ur2670807",
      "reviewLink": "https://www.imdb.com/review/rw0902186",
      "warningSpoilers": false,
      "date": "22 March 2004",
      "rate": "",
      "helpful": "272 out of 319 found this helpful.",
      "title": "Interior Landscape",
      "content": "Of all Kaufman's screenplays that delve into the interior landscapes of its characters, Eternal Sunshine is the most fully formed and moving story of the bunch, a rumination on the possibilities and consequences inherent in making the process of removing unwanted memories from your consciousness as easy as going for a checkup. Kaufman here plays on our desire to forget the bad things that happen to us and what happens when we are given the power to forget those things permanently, and the conclusion he arrives at is that it ultimately creates as many - if not more - problems than it solves. At the very least, it can result in making the same mistakes again (\"Those who ignore history are doomed to repeat it\"); at the worst, it eliminates the possibility of our ever reconciling and coming to terms with our life experiences, the way we relate to the people who help to shape our lives and whose lives we shape through ours.The film explores these ideas in a novel and engaging way: by taking the audience inside the mind of Joel Barish (Jim Carrey), a man who, after breaking up with his girlfriend Clementine Kruczynski (Kate Winslett), discovers later that she has had her memory of him wiped clean from her mind. He finds out how she had this procedure done and, despondent not only about the breakup but even more so about her having completely erased him from her mind, searches out the doctor who performed the procedure and signs up to have the same procedure done to him, so that he may also have no memory of her. He is rendered unconscious for the procedure but his subconscious is still active. Once the procedure is initiated and he becomes aware that his memories of the woman he loved - and still loves - are vanishing from his brain, he starts having second thoughts and wants the procedure stopped. His challenge then becomes to figure out how to protect as much of his memory of her as he can, and to find a way stop the procedure despite the fact that he is in an unconscious state.The manner in which he comes to realize and confront his dilemma is played out entirely within his interior landscape, a realm which (as anyone who remembers their dreams upon waking from sleep can attest) is a very surreal extension of our day-to-day experiences. Michel Gondry's visual style and direction works exceptionally well here in conveying the slippery, chaotic unpredictability of the worlds we construct from our memories and experiences; the clever interplay between this interior world and the goings-on of the outside world helps keep the viewer off-balance just enough to illuminate the fuzzy line of demarcation separating the two worlds and the peculiar manner in which they play off one another.Jim Carrey and Kate Winslett do an exceptional job of bringing this abstract story concept to life with characters that are endearing, poignant, believable and utterly human. The supporting players are equally impressive: Tom Wilkinson as the mind-eraser doctor, Mark Ruffalo and Elijah Wood as the technicians, Kiersten Dunst as the receptionist all have relationships to the main protagonists and to one another that come to light as the story unfolds and help to propel the plot; as friends of Joel and Clementine, David Cross and Jane Adams are hilarious as a couple who seem to be stuck in the same rut that compelled the protagonists to break up and have each other erased from their respective minds. Kaufman juggles all these relationships masterfully and in such a way as to ensure none of them are superfluous to the ideas he is trying to get across in this story.While there are elements of the plot that seem to place this movie in the realm of science fiction, the focus of the movie stays on the interior states, emotions and relationships between the characters. As such, the film is more of a romantic comedy than anything - albeit unlike any other romantic comedy you're ever likely to see. I saw a late showing of this movie with my girlfriend the day it was released at a local multiplex and there were only 20 or so people in the theater, yet at the film's conclusion everyone broke out in a spontaneous round of applause. This gives an idea of how compelling this movie can be. If you give this film a chance to creep under your skin, you will likely find yourself reflexively thinking about your feelings toward the important people in your life, as well how you relate to those feelings, as well as your memories and how you relate to them. A thought provoking, moving and entertaining film - I can imagine that a working title of this film might have been \"Warts And All.\""
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw2312808",
      "warningSpoilers": true,
      "date": "19 September 2010",
      "rate": "10",
      "helpful": "16 out of 20 found this helpful.",
      "title": "Absolute power corrupts absolutely",
      "content": "This film has both Jim Carrey and Kate Winsett playing roles that you are probably unaccustomed to seeing them in. Jim Carrey plays plain-vanilla introvert Joel and Winsett plays extroverted salesgirl Clementine who likes to express herself by dying her hair an odd combination of colors and dressing up potatoes like Barbie Dolls. At the time he meets Clementine, Joel is living with someone named Naomi that he mentions several times during the film in only positive terms as \"very nice\". Joel must be searching for something other than \"very nice\" since this doesn't prevent him from throwing over this woman that the audience never sees for the unpredictable unknown quantity, Clementine. However, eventually the relationship ends so badly for this mismatched couple that Clementine has all memory of their relationship erased from her mind by a company that has the technology to provide such a service.When Joel discovers what she has done he is so hurt that he wants the same thing done to him so that he can erase the pain. The process takes an entire night, and during this process Joel relives all of the moments he and Clementine had together and realizes that Clementine brought enough happiness into his life that he doesn't want her erased from his mind after all. However, he is now unconscious and unable to communicate his wishes to those handling the procedure. Thus, he tells Clementine - inside his mind - what is going on and they attempt to hide from the \"mind erasers\" in places in his memories where he would have never taken her. Specifically, he takes her to particularly humiliating points in his childhood and adolescence. It seems telling that the pair have been together for two years yet Joel has apparently never told Clementine about any of these memories, apparently having shut her out of selective portions of his life. However, these evasion tactics are no match for the mind-erasing team of Lacuna Inc., and ultimately Clementine is cleansed from Joel's mind. Just before the last memory of her is erased, she tells Joel to meet her in a particular spot that was special to both of them. The next day he awakes, is drawn to this prearranged meeting place for reasons he doesn't understand, and she is there. Neither one of them knows who the other is, but the relationship is beginning to start all over again when a disgruntled Lacuna employee gives them their files, which include tapes of what both Joel and Clementine thought of one another at the the time each requested to have the other erased. They listen to each others tapes and are both shocked and embarrassed. These are not flattering revelations, to say the least. Will they decide to part before all of these awful things start happening all over again, or will they take a chance? Watch and find out.The plot may be hard to follow as it bends back and forth through time, but it is worth it, and Jim Carrey gives the best performance he has given since \"The Truman Show\". The movie has a lot to say about how we are the product of our memories and our choices - both the bad and the good. It also illustrates how absolute power corrupts through the unconscionable actions of some of the employees of Lacuna Inc. who start out helping people and end up helping themselves. You'll find yourself catching something you missed before each time you watch it. I highly recommend this film."
    },
    {
      "username": "hecklerdanny",
      "userUrl": "https://www.imdb.com/user/ur1847551",
      "reviewLink": "https://www.imdb.com/review/rw0980979",
      "warningSpoilers": true,
      "date": "18 December 2004",
      "rate": "10",
      "helpful": "267 out of 344 found this helpful.",
      "title": "Fantastic",
      "content": "Here's the basic plot. Clemintine and Joel have a long, rocky relationship. Clemintine decides to get Joel erased from her memory, so Joel decides to do the same, only while Joel is in the process of the erasing, he comes back around to the really sweet, nice memories, and realizes that he wants out of the procedure. Now here's what I thought about it. This movie is completely amazing. Totally original story and wonderful directing. Some of the best directing that i've seen in any movie. Some of the best original music too. This is in my top five favorites, and it also boosted Jim Carrey into one of my favorite actors. You know you have a good movie on your hands when the next day you're still thinking about parts of it, and you want to see those parts again. If you haven't seen this, I recommend that you check it out. It's different, in a really good way. There's not much more to tell you about it. If you want to see the Ace Ventura Jim Carrey, than you should absolutely skip this one. But if you want to see a side of him and Kate Winslet that you've never seen, or if you want to see a total original movie with wonderful cinematography and really great music, then by all means, you should absolutely see this one!"
    },
    {
      "username": "nycritic",
      "userUrl": "https://www.imdb.com/user/ur0384847",
      "reviewLink": "https://www.imdb.com/review/rw1065056",
      "warningSpoilers": true,
      "date": "22 April 2005",
      "rate": "10",
      "helpful": "37 out of 51 found this helpful.",
      "title": "Would You Erase Your Mind to Kill the Heart?",
      "content": "That is the question underlying this entire movie, since two-thirds of it is the process of elimination of a man's memories in order to forget the person who caused him some hurt in the recent past.This man is Joel Parish, played (or underplayed) by Jim Carrey who on a train ride to Long Island meets Clementine Krucyzinski (Kate Winslet). Both strike up an uneasy conversation: she being brash, aggressive, he being almost demure. There seems to be something there lingering between them, some connection even when they're totally different, and later we learn, when their affair ends, that she has decided to erase her memories of him and move on, which prompts Joel to do the same.Except he decides he doesn't want to at the last minute.So begins a roller-coaster ride where he tries to salvage anything he can as one by one his memories are being zapped away from him, and to see how he goes from one to the other, often with the surreal assistance of Winslet herself (as she is an integral part of his memories), we definitely get bombarded with frenetic images of Joel's mind literally coming apart at the seams, but we never forget that this is his heart that we're talking about, and in a small performance, Kirsten Dunst reveals just how heartless the procedure can be in a revelatory moment, one that makes us totally root for this odd couple right down to the last scene. One of the most original stories which hit theatres in 2004 and which deservedly won its Best Original Screenplay Oscar even if it lost in acting categories, this is the Movie of 2004."
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw2396922",
      "warningSpoilers": true,
      "date": "10 March 2011",
      "rate": "8",
      "helpful": "5 out of 5 found this helpful.",
      "title": "An interesting sci-fi romance with a difference",
      "content": "Usually when I sit down to watch a Jim Carrey film I end up getting a little irritated by his excessive gurning; thankfully there is none of that here. Carrey plays Joel Barish a man who decides to skip work one day and takes the train to Montauk where he takes a walk on the beach, later he meets Clementine, a girl with bright blue hair who he gets talking to on the way home. He offers to take her home and then something strange happens he goes to see her at the shop she works in and she acts as if she doesn't recognise him and later he is told that she has had all memories of him clinically erased! He goes to the clinic and after learning as much as they are free to tell him decides to have all memories of her erased too. Things then get rather complicated as he relives various moments in an apparently long relationship as they are deleted, during the procedure he realises that he doesn't want to forget her and tries to find a way of protecting at least one memory of her. Meanwhile the people erasing his memories are having their own problems; one of them is trying to seduce Clementine himself and while he is off the other loses Joel so must call in his boss which in tern leads to more secrets being exposed.This is a hard film to describe as much of the action is non-linear and the viewer is deliberately confused about what is happening at any given moment. Jim Carrey and Kate Winslet are great as Joel and Clementine and other cast members, including Kirsten Dunst and Elijah Wood do well too. While this is clearly science fiction due to the memory erasing it doesn't look like stereotypical sci-fi; everything looks like things in the present day look; even the memory erasing machine looked like medical machinery rather than some futuristic device one might expect. Even if you aren't a fan of Jim Carrey films this is worth checking out; in fact I suspect it is worth watching more than once as it felt like the sort of film that will make more sense on the second viewing!"
    },
    {
      "username": "Pukeonthestreet",
      "userUrl": "https://www.imdb.com/user/ur113529171",
      "reviewLink": "https://www.imdb.com/review/rw5476448",
      "warningSpoilers": false,
      "date": "11 February 2020",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Gondry at his best",
      "content": "His imagination is brought straight from his brain to the screen. Such an inventive and original movie with top notch acting making it one of the best films of all time."
    },
    {
      "username": "DonFishies",
      "userUrl": "https://www.imdb.com/user/ur1622466",
      "reviewLink": "https://www.imdb.com/review/rw0902340",
      "warningSpoilers": true,
      "date": "6 April 2004",
      "rate": "10",
      "helpful": "24 out of 31 found this helpful.",
      "title": "Simply brilliant in all dimensions of the word",
      "content": "I had no idea what Eternal Sunshine of the Spotless Mind was about until the end of March. I had heard some small rumblings about it around the Internet for a few months, and also saw a few short TV trailers for it, but that was about it. Basically, all I knew was it was another dramatic Jim Carrey film, written by the same guy who wrote two of the weirdest and somehow great films to come out in a long time, Being John Malkovich and Adaptation. But does this film succeed to be just as weird yet excellent as the other two? Or is it even better? A big yes on both counts would be highly appropriate.The film's main protagonist is Joel (Jim Carrey). He was in a relationship with the very free-spirited Clementine (Kate Winslet), but slowly, they began to pull apart. So, the very impulsive Clementine decides to have a wicked new procedure done to herself in which every memory of Joel is erased from her brain. Of course, Joel fails to find out right away, and only thinks upon various attempts to try to speak to her that she is simply just completely ignoring him. That is until, he finds out about the procedure from friends who were supposed to be keeping it a secret.The company performing the procedures is called Lacuna Inc. Upon heading to Lacuna for answers, Joel finds out from the head doctor, Dr. Howard Mierzwiak (Tom Wilkinson), that he cannot be given any whatsoever, as everything is confidential. The Doctor does however, tell Joel the details of the procedure that Clementine had. After some passing time, Joel decides to have the operation done to him, on the night before Valentine's Day. So Joel goes home that night, takes the special pills given to him and falls asleep on his bed. It is then that Mierzwiak's assistants at Lacuna enter in to perform the procedure.What follows from here, is a seamless blend of both memories of Clementine and Joel within Joel's head, and the real world where Patrick, Stan and Mary (Elijah Wood, Mark Ruffalo and Kirsten Dunst respectively) are performing the procedure on Joel, as well as doing random things around his house. Only everything doesn't go so sweet. After the procedure's initial reactions begin to set in, Joel isn't as enthusiastic as he once was about having it done. So he begins to try to fight off the erasure. This begins to complicate things for the assistants working on him and serves for the main basis of where the film goes from that point.Despite how complicated and bizarre the film may sound, it still is a great and maybe even brilliant film. All the actors shine brightly in their performances, especially Jim Carrey and Kate Winslet. I don't think I've ever seen these two as good as they are in this, both within and outside Joel's head. Their chemistry and romance comes off very well on screen as well as being very believable. The writing is also just as good, if not even better. It must take quite the effort to continue to write films such as these, but the writer, Charlie Kaufman, is seemingly getting better and better with his scripts. By the same token, the scripts are getting stranger and stranger.The editing and look of the film is very well done as well. The film is quite jumpy in many instances, looping back and forth from activity in Joel's brain to the real world outside of it. The way the imagery is shown is quite stylish, and truly shows the complete agonizing nightmare Joel is going through. It is evident that a great deal of time was spent on the final product of the film both by the editors and the director, Michel Gondry. Although Gondry hasn't had a hit film as of yet, he does show off his excellent film-making skills with this film. Hopefully, this director will continue to excel with films like these and become much more mainstream as the years go on.I have nothing but praise for the film. It is definitely a must see. The complete brilliance of every aspect of the film is far superior to many of the \"hit mainstream\" films being released in theatres these days. It can even be considered as a very early candidate for the best picture of the year. If you have the chance to see it, this film is not to be missed.10/10."
    },
    {
      "username": "nicholls905-280-546911",
      "userUrl": "https://www.imdb.com/user/ur31064494",
      "reviewLink": "https://www.imdb.com/review/rw5200168",
      "warningSpoilers": false,
      "date": "20 October 2019",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Incredible",
      "content": "Easily one of the best films from 2004. Kaufman and Gondry are at the height of their skills and Eternal Sunshine of the Spotless Mind is a highlight on their resume. Carrey carries incredible restraint here, but Winslet is one of a kind. Great film that deserved more attention."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw1292625",
      "warningSpoilers": false,
      "date": "15 February 2006",
      "rate": "8",
      "helpful": "14 out of 18 found this helpful.",
      "title": "Real Food for Thought",
      "content": "This is a real mind bender (no pun intended). I really liked the premise because it opens up great implications for us all. How far are we from the manipulation of specific brain centers? We can already do a fair amount. The reality is that even if one can erase memories, we can't curtail the \"butterfly effect \"of our actions. We have trod the earth and the small or large changes we inspire, create something new. Now project love and romance, and, given time, let it percolate. You have Jim Carry and Kate Winslet being \"forced\" back together because despite their minds, they never left. And if the memories were inconsequential in the larger picture, their remnants will continue to influence. Pretty thought provoking. We are more than our memories--we are part of the entire picture."
    },
    {
      "username": "Lady_Targaryen",
      "userUrl": "https://www.imdb.com/user/ur6643268",
      "reviewLink": "https://www.imdb.com/review/rw1297913",
      "warningSpoilers": true,
      "date": "22 February 2006",
      "rate": "9",
      "helpful": "23 out of 31 found this helpful.",
      "title": "You can erase someone from your mind. Getting them out of your heart is another story",
      "content": "''Eternal Sunshine of the Spotless Mind'' is a big and strange name, but it matches perfectly this movie. I can say this is one of my favorite films at all, and one of the things that makes it so special to me, is the fact that it can be interpreted in multiple ways. Jim Carrey finally has a serious role and Kate Winslet is great as Clementine, the very extroverted girl with the most hair varieties you can imagine. (It is different from the British girl characters she is used to play)The story is focused in the relationship of Joel Barish and Clementine Kruczynski. Joel discovered that his ex girlfriend Clementine erased him from her memories, using the procedure of Lacuna's clinic, developed by Dr. Mierzwiak. Angry with that fact, Joel decides to erase his memories with Clem as well, but during the procedure he sees that he actually loves and wants to keep his memories with her. The movie shows their new meeting without remembering each other and Joel's memories of their relationship. The End is enigmatic, but far from the cliché.I really recommend it!aka \"O Brilho Eterno De Uma Mente Sem Lembranças\" - Brazil"
    },
    {
      "username": "acedj",
      "userUrl": "https://www.imdb.com/user/ur96416540",
      "reviewLink": "https://www.imdb.com/review/rw5236326",
      "warningSpoilers": true,
      "date": "4 November 2019",
      "rate": "8",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Jim Carrey show a serious side",
      "content": "This movie is a deep dark look at loss and regret, and the desire to forget forever the things that cause us deep emotional anguish. Jim and Kate play a couple that had a rough break up, despite the fact that they were deeply in love. Jim goes to a company that will come into your house, and while you sleep seek out and destroy painful memories. What makes this interesting, well there are many things that make this movie interesting, but what really stands out is the way that Jim's character struggles within himself to hold on to the memories he so wanted erased initially. This movie is a sobering look at the thing that makes us what we are, our choices and the pain or reward that they bring. Jim Carrey and Kate Winslet do a phenomenal job in this movie."
    },
    {
      "username": "The-Sarkologist",
      "userUrl": "https://www.imdb.com/user/ur27175177",
      "reviewLink": "https://www.imdb.com/review/rw3150869",
      "warningSpoilers": true,
      "date": "29 December 2014",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "To forget is not always the easiest solution",
      "content": "It took me a little while to work this movie out because it was a little odd at the beginning. Okay, I knew it was about how a man (Joel) was having all memory of his ex-girlfriend (Clementine) erased from his memory, and that it is basically a love story in reverse, but as I said the beginning left me a little baffled. Basically Joel goes to the beach and meets Clementine and they begin to hit it off and after their first date he parks outside her house so she can get her toothbrush and some guy comes up to him and asks him what he is doing. Suddenly it jumps to a scene where he is driving home crying, and for a while I thought there was a sudden jump of two years to when they had broken up. When, later on in the movie, the scene where they first met was completely different to the opening scenes of the movie I was under the impression that there was a huge continually stuff up. However, how can a movie, with a huge continually stuff up, get a rating of over 8 on IMDb? Well, all is explained in the end.As I mentioned, this is basically a love story in reverse. The story begins after they have broken up and Joel discovers that Clementine has had him completely erased from his memory, so he goes and visits the same doctor to have the procedure done to him as well. This is when we get to the core of the movie as it jumps between Joel's memory and events going on in Joel's bedroom with the people who are doing the erasing. Thus what we have are in effect two stories going on which at first do not seem to be related at all, but slowly become interrelated.The way this film has been set out makes it quite different to the 'boy meets girl, boy loses girl, and boy gets girl again' typical Hollywood theme. If seen in the normal order then that is basically what the film is, but it isn't. The film begins with the break up and then we watch, through Joel's memories as they are progressively being erased, the relationship as it unfolded. However, the relationship begins with the break up, and then moves through the fights – all of the painful parts – however things begin to change when we get to the good parts – the parts that Joel does not want to forget. Joel knows what is going on, and when he realises that all of the good parts of the relationship are being removed he suddenly wants it to stop, and thus we have this psychological fight where is tries his best to retain his memories, while the doctors on the outside are fighting to complete the process.I guess sometimes, especially when we go through painful experiences, we would like them to be removed from our memory so they do not come back to haunt us, but the question is then raised is that healthy, and is it possible. We are told at the beginning that all evidence of the relationship must be removed because by seeing (or even hearing) one element from that relationship can end up triggering those forgotten memories. This is where the film gets interesting because one of the assistants, who assisted in Clementine having her memory erased, falls in love with her and uses his knowledge to start a relationship with her. However therein lies the problem – while she may have forgotten, he hasn't, and what is worse, he is using the knowledge that he gained from assisting Joel in deepening the relationship, but this has an opposite effect.Then there is what is going on on the outside, but I won't go any further than that because I have already pretty much spoiled the movie (even though I have put a spoiler alert on this review). However, what I picked up in the movie is the idea of removing memories (and it appears that many are well aware of this aspect as well). Just because we have bad memories, or more precisely, memories that hurt us, does not mean that they are useless. First of all our memories define who we are, whether they are pleasant or not, and to remove those memories will end up undermining our character. Secondly, if we seek to remove the bad memories it does not mean that only our good memories will remain. As can be seen in this film, the good memories of the relationship are inextricably tied up with the bad, so by removing the bad, we are also removing the good. It is clear that Joel wanted all of the bad memories removed, but when he suddenly realised that these bad memories were connected to the good memories, and the good memories were also being removed, that was when he wanted it to stop. Finally, just because all of the bad memories are removed does not necessarily mean that we will not repeat the same mistakes. In fact, by removing them means that we are more likely to do so. As Winston Churchill once said: he who forgets the past is doomed to repeat its mistakes."
    }
  ],
  "errorMessage": ""
}