{
  "imDbId": "tt15097216",
  "title": "Jai Bhim",
  "fullTitle": "Jai Bhim (2021)",
  "type": "Movie",
  "year": "2021",
  "items": [
    {
      "username": "santhosh-10290",
      "userUrl": "https://www.imdb.com/user/ur82002563",
      "reviewLink": "https://www.imdb.com/review/rw7503156",
      "warningSpoilers": false,
      "date": "2 November 2021",
      "rate": "10",
      "helpful": "698 out of 821 found this helpful.",
      "title": "Jai Bhim",
      "content": "Excellent Movie. Everybody acted well in the movie. Songs and BGM in the movie were excellent. The movie was so interesting and thrilling. This is the Best Tamil Movie of 2021. Excellent Movie."
    },
    {
      "username": "ahamedmn",
      "userUrl": "https://www.imdb.com/user/ur79409169",
      "reviewLink": "https://www.imdb.com/review/rw7503519",
      "warningSpoilers": true,
      "date": "2 November 2021",
      "rate": "10",
      "helpful": "358 out of 426 found this helpful.",
      "title": "OSCAR LEVEL 🔥",
      "content": "This is a movie which all the people in India should watch. It shows the pain and the problems which the 'Tribes' are faced by Police brutality. Manikandan and Anumol has done a national award peformance. Suriya beautifully carried the movie. Please watch."
    },
    {
      "username": "magadalwarmayur",
      "userUrl": "https://www.imdb.com/user/ur69481828",
      "reviewLink": "https://www.imdb.com/review/rw7503723",
      "warningSpoilers": false,
      "date": "2 November 2021",
      "rate": "7",
      "helpful": "282 out of 335 found this helpful.",
      "title": "What a great film",
      "content": "I'm not a native tamil speaker but I had seen the film trailer which had intrigued me.This film is what I call raw hitting. It hits where it hurts the cast did a great job the casting director did better job of finding such cast.The direction of this film is very grounded it never feels like cliche so does the acting of all cast member.The cinematography of the Film is very simple which gives it more of an indie film vibe .As an Indian you should definitely watch this film because I haven't seen more important film than this in a decade."
    },
    {
      "username": "cs_rahul_kumar",
      "userUrl": "https://www.imdb.com/user/ur104563194",
      "reviewLink": "https://www.imdb.com/review/rw7505474",
      "warningSpoilers": true,
      "date": "3 November 2021",
      "rate": "10",
      "helpful": "363 out of 435 found this helpful.",
      "title": "Suriya's Jai Bhim Deserves To Get An Oscar Award For The Best Movie, And Suriya Deserves To Get The Best Actor Award !!!",
      "content": "In a scene in Jai Bhim, a group of tribals man meet a police office who is heading an inquiry commission about the disappearance of three missing tribals who were being interrogated by the police about a theft case. One man tells him that he was once arrested by cops just for greeting them. Another tells him about how he was arrested just because he tried to slink away fearing them. A woman narrates how her husband was forced to 'confess' to a crime which he had not committed after the cops started molesting her. A young boy mentions that the police picked him up just because they could not get his father, and how that one incident made him a perennial suspect at school. These people are clearly damned if they did, and damned if they didn't.This scene is an echo of the scene that opens the film. We see many prisoners being let out of prison. A few cops from the surrounding police stations are waiting. As each prisoner comes out, he is asked for his caste. If they mention a dominant caste's name, they are asked to leave. But those who belong to a scheduled caste or scheduled tribe, they are told to stand in a corner, only for the waiting cops to pick them up as suspects in the many cases that remain unsolved in their station. When some of them complain that there are too few for them to foist cases on, they are told that they could accuses a few of committing more than one crime.With scenes like these, Jai Bhim powerfully captures the abuse and humiliation that is heaped upon the underprivileged by those in power and the kind of defiance it will take to get them justice. Like Visaaranai and the recent Kavalthurai Ungal Nanban, the film is also a fierce criticism of police brutality. The plot revolves around Rajakannu (Manikandan) and Sengani (Lijomol Jose), a couple who live at Konamalai near Viluppuram. They belong to the Irular tribe, and despite their poverty - they still cannot afford a brick house - they are contented and happy. Especially with their daughter Alli going to school and a second child on its way.But their happiness is dashed when cops come in search of Rajakannu over a robbery. The poor man has become the main suspect just because he happened to be the one who had visited the house where the robbery happened that day to catch a snake. Unable to find him, the police pick up the pregnant Sengani and a few other men from the tribe, including Rajakannu's brother Irutappan. Sengani is later let go - not before being beaten and kicked multiple times - but for Rajakannu and a couple of others, there is no respite from the harrowing violence unleashed upon by the men in khakhi. When Sengani hears that the three men have escaped and their whereabouts unknown, she reached out to Chandru (Suriya), a righteous lawyer who fights for the downtrodden. But can they uncover the truth with an entire system standing against them?Jai Bhim is an unexpected sophomore effort from TJ Gnanavel, who had previously directed the uneven drama Kootathil Oruvan. This is a film that is raw, real and brutal, with gritty filmmaking enhancing the solid writing. It effectively portrays the wrongs that are done to the underprivileged without seeming exploitative or overly melodramatic. Despite being one of the oldest communities in the country, these tribes do not even have any proof to show that they are its citizens and cannot even own a piece of the land. When Mythra (Rajisha Vijayan), a teacher who is part of an adult literacy programme, tries to get them a voter id, the local big shot, who belongs to a dominant caste, retorts, \"Isn't it enough we have to request the lower castes to vote for us? Should we also go to the homes of these fellows?\"Gnanavel gives us some terrific moments of defiance. Lijomol Jose is quietly powerful as Sengani, who gets a couple of rousing scenes when she turns down efforts at a compromise from cops. Manikandan, too, is effective and stands out in the scene when he urges his men to not give in as that will result in their community being branded as criminals. The director also portrays the intimacy between Sengani and Rajakannu in a charming manner.The film is based on a real-life incident involving Justice K Chandru, from his days as a lawyer. Suriya plays this role with the right amount of intensity and earnestness, which helps the character seem grounded even while the film and Sean Roldan's score try to build him up as a can-do-no-wrong superhero. In fact, his introduction scene wouldn't be out of place in a masala movie. But after Soorarai Pottru, this is another notable film for the star as a performer.And his scenes with Prakash Raj, who plays the inquiry commission head, Perumalsamy, give us calm and composed dialogue that act as a counterpoint to the flinching violence and the moving melodrama. The latter lends the role with a great deal of dignity to a character who believes one has to take up a little bit of authoritarianism to protect democracy. So, we have a lawyer who considers the police as the worst and a cop who finds lawyers the worst working together to ensure justice is done. Through these scenes, Gnanavel - as one of the judges in the film mentions - shows how justice can be upheld when law and order work hand in hand.There are only a couple of missteps. After a point, the violence begins to feel like torture porn, even though the film presents these episodes as flashbacks of events that happened over a day or two. And in a narrative sense, Chandru's efforts to unravel the mystery and his battle in court feels somewhat easier because there are no strong antagonists. Both Rao Ramesh as the advocate general and Guru Somasundaram as the public prosecutor never come across as formidable foes for Chandru in court. That said, as Chandru unravels one cover-up after another, the film makes us realise the extent to which unchecked power can go to maintain status quo.But these doesn't lessen the emotional impact of the film, which, along with films like Visaaranai, Kirumi and Kavalthurai Ungal Nanban, is a much-needed antidote to restore the balance in portrayals of the police in an industry overrun by the Singams and the Saamys."
    },
    {
      "username": "rosheenkan",
      "userUrl": "https://www.imdb.com/user/ur133760859",
      "reviewLink": "https://www.imdb.com/review/rw7503134",
      "warningSpoilers": false,
      "date": "2 November 2021",
      "rate": "10",
      "helpful": "249 out of 295 found this helpful.",
      "title": "The Powerful Film",
      "content": "The film is based on true story which was happened 28 years ago.Despite given an 'A' rating for its strong content, the film was real and brutal what we see it is similar to Visaranai and Kavalthurai Ungal Nanban. This is one of the best and powerful legal films. Thus, it's a must.watch."
    },
    {
      "username": "ashishpalatown",
      "userUrl": "https://www.imdb.com/user/ur103412557",
      "reviewLink": "https://www.imdb.com/review/rw7502905",
      "warningSpoilers": false,
      "date": "2 November 2021",
      "rate": "10",
      "helpful": "207 out of 244 found this helpful.",
      "title": "Brilliant movie",
      "content": "The best movie i have seen in a long time. This movie should be send to Oscar , cause it really deserves an oscar for the wonderful performance . Really brilliant cast and directions .."
    },
    {
      "username": "m-ramanan",
      "userUrl": "https://www.imdb.com/user/ur12144093",
      "reviewLink": "https://www.imdb.com/review/rw7511258",
      "warningSpoilers": false,
      "date": "5 November 2021",
      "rate": "10",
      "helpful": "195 out of 238 found this helpful.",
      "title": "It could have become documentary at any point, but not....",
      "content": "RATED 10/10 Language: Tamil Source: Amazon Prime RECOMMENDEDTribal life and their rights are cleverly delivered...at some point i forgot that i am watching movie and seeing their pain in real. The cast and locations are so real...The court room drama and the flashbacks are well balanced and at end credits makes the awe... Kudos to Jo and Surya for producing this movie... At any point this movie could become a documentary, but director brilliantly maintained the mainstream movie entertainment throughout the story telling.... Another big advantage is that you will never feel the preaching/advising tone and it is not biased.It delivers the same pain and feeling of the movie \"Visaranai\".... Must watch."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw7531235",
      "warningSpoilers": true,
      "date": "9 November 2021",
      "rate": "8",
      "helpful": "198 out of 243 found this helpful.",
      "title": "\"It will be quite an uphill battle.\"",
      "content": "There's some serious upvoting for this film here on IMDb; if not for a weighted averaging of the film's rating by viewers, this would be the number one movie of all time having just come out this year, and that by a wide margin. I thought the movie was good for it's portrayal of corrupt authorities taken down by a dedicated attorney, it hit on many of the points that social justice advocates clamor for here in this country. Based on a true story, one can only marvel at the dedication of a man like Chandru (Suriya), who utilized every bit of means and cunning to humiliate the brutal police authorities and their corrupt political allies. Many times it's a difficult story to watch, as the beatings and punishment doled out by district police against members of lower castes approach grotesquely inhumane treatment. Chandru's efforts eventually pay off, and it was inspiring to see him honored by the citizens he represented at the finale, reminiscent of that final scene of Gregory Peck in \"To Kill A Mockingbird\".One note of caution when coming to the IMDb title page - the names of characters listed in the credits don't match the corresponding identification of characters in the film. As an example, actress Lijo Mol Jose portrayed the agonized wife Sengoni in the credits, but in the film, captioning described her as 'Sannamma'. I'm not versed well enough in Indian nomenclature to know if that's a result of translation or some other factor. I would also question the narrative offered at the end of the story that stated the attorney portrayed in the picture was responsible for ninety six thousand cases in six years. To do that, he would have to have been involved with over forty cases per day, every single day for six years, with no days off!"
    },
    {
      "username": "ajaynkumar",
      "userUrl": "https://www.imdb.com/user/ur103063828",
      "reviewLink": "https://www.imdb.com/review/rw7503426",
      "warningSpoilers": false,
      "date": "2 November 2021",
      "rate": "10",
      "helpful": "145 out of 176 found this helpful.",
      "title": "Amazing ..hard-hitting movie",
      "content": "Its must watch ..had hitting real story based story with amazing story and cinematography. Its amazing and mind blowing the writing and acting of evry one is just another level ..its a overall another level movie a another gem by gem surya sir."
    },
    {
      "username": "hxzr-18144",
      "userUrl": "https://www.imdb.com/user/ur66204782",
      "reviewLink": "https://www.imdb.com/review/rw7510679",
      "warningSpoilers": false,
      "date": "4 November 2021",
      "rate": "10",
      "helpful": "141 out of 175 found this helpful.",
      "title": "One of the best movie in todays era.. Splendid and worth every minute.",
      "content": "This was one of the best movies I have watched in recent years.. that too based on true facts.Casting, Story, Acting, Direction every small thing made a masterstroke here.Surya as leading actor lawyer and Lijo Mol Jose as Sengoni made a remarkable and splending performance.Bollywood should learn from this type of movies.. or will just make a remake of same with lowest performance with high budget !!!Once again, was very sad on checking the true facts which the movie brought in front with remarkable drama. Hats-off to all actors."
    },
    {
      "username": "akshatmahajan",
      "userUrl": "https://www.imdb.com/user/ur69496651",
      "reviewLink": "https://www.imdb.com/review/rw7522550",
      "warningSpoilers": false,
      "date": "7 November 2021",
      "rate": "8",
      "helpful": "142 out of 177 found this helpful.",
      "title": "South Indian Industry is rocking",
      "content": "This movie is much needed movie which raises questions on police, custody murders and casteism. Nowadays, South India Cinema is giving us much better movies than bollywood.Story was good, pacing and execution was also good but could have been little bit better, acting was also good (nothing looked fake or forced). Not adding songs in the movie was best choice, that could have ruined the movie. This movie was different than bollywood's legal case stories which have masala, songs and overacting.Overall, will recommend this to everyone. You must give it a try."
    },
    {
      "username": "arunraveendraraj",
      "userUrl": "https://www.imdb.com/user/ur129151743",
      "reviewLink": "https://www.imdb.com/review/rw7502940",
      "warningSpoilers": false,
      "date": "2 November 2021",
      "rate": "10",
      "helpful": "130 out of 159 found this helpful.",
      "title": "Intense must watch",
      "content": "Very excellent Film After soorori Pottru another masterpiece from surya.The film has an excellent story plot with good character's sketch The film successfully narrates the realistic lives in india."
    },
    {
      "username": "jaybhakta-80095",
      "userUrl": "https://www.imdb.com/user/ur123766464",
      "reviewLink": "https://www.imdb.com/review/rw7502933",
      "warningSpoilers": true,
      "date": "2 November 2021",
      "rate": "10",
      "helpful": "121 out of 154 found this helpful.",
      "title": "OSCAR WORTHY, read below.",
      "content": "Its not An opinion only because the performance was great and story was real. Its because if its get world attention at oscars maybe the world and its people can realize police brutality is still alive in every corner of the world. Do not completely dead quiet yet. Its blood boiling story how it happens easily and gets covered up in a believable lie. Justice Chandru is a legend for shedding light."
    },
    {
      "username": "mohamedshakir-03491",
      "userUrl": "https://www.imdb.com/user/ur104289496",
      "reviewLink": "https://www.imdb.com/review/rw7506705",
      "warningSpoilers": false,
      "date": "3 November 2021",
      "rate": "10",
      "helpful": "97 out of 124 found this helpful.",
      "title": "No words! Undoubtedly the best movie of 2021.",
      "content": "We know that this movie is based on a true events. Hats off to Suriya for choosing this kind of a role. What an outstanding performer he is. Rajakannu and his wife that two characters oh my goodness, every single scenes the performance of both 👏 wowwww. I'm damn sure that this movie will take all the awards this year. Don't miss this gem of a movie."
    },
    {
      "username": "ketgup83",
      "userUrl": "https://www.imdb.com/user/ur22864666",
      "reviewLink": "https://www.imdb.com/review/rw7522253",
      "warningSpoilers": false,
      "date": "7 November 2021",
      "rate": "8",
      "helpful": "99 out of 128 found this helpful.",
      "title": "Do Yourself A Favor, Leave Everything And Watch Suriya's Hard-Hitting Drama",
      "content": "Jai Bhim turned out to be a hard-hitting, raw and powerful court-room drama. The purpose of cinema is not just to entertain but also educate and empower the audience. The courtroom drama based movies are always engaging as the prosecutor and defendant both fight to solve the case with solid evidences and innumerable witnesses.Bollywood Films like \"Damini\", \"Jolly LLB\",\"Talvar\" \"Rustom\", \"Pink\" or even \"Section 375\" have been immensely successful in keeping the audience engaged with impeccable dialogues and fantastic screenplay but what makes Jai Bhim different is the beautiful message on morality and equality of a tribal woman who fights for the justice of her husband.Jai Bhim is based on 1995 Habeas Corpus petition in which human right activist cum lawyer K. Chandru ( played by Suriya ), who takes up the case of Irular tribe couple (Rajakannu and Sengeni) where the husband is wrongly convicted by local police for stealing ornaments from village head's house.As Jai Bhim opens, we see that cops segregating the prisoners based on their caste. Among all the caste, the tribal people becomes the easy target for the cops to clear the pending cases under the influence of their political head. We also see how Rajakannu, the main accused in the jewelry case, is forcibly taken away from his family. The film goes back in the flashback mode where life of the tribal couple is beautiful in the serene village where they hone the skills of catching rat for their bosses. As their life progresses, in one of the event Rajakannu and his brothers are caught for the crime which they did not commit. They go through extreme level of police harassment and torture which will be very hard to digest and is completely raw. Enter Chandra a.k.a Suriya who takes up the case when Sengeni narrates the entire incident and request to help find her husband who as per police, has been absconding from the jail.Jai Bhim is one such hair-raising film which is definitely difficult to digest as it gives you goosebumps and eye-popping experience. Screenplay is the hero with nail-biting moments. Art direction is fine while Cinematography is excellent. Suriya is a knight in shining armor. Watch out for him in the second half when he questions the witnesses in the courtroom. It is unforgettable performance which should be lauded for its sheer brilliance. Among the actors - Manikandan and Lijomol Jose are mind-blowing with their natural performances. Prakash Raj does well as IG.Jai Bhim is an experience that needs to be lauded for its impeccable direction, electrifying performances and beautiful message. Excellent 4/5."
    },
    {
      "username": "divyapraba",
      "userUrl": "https://www.imdb.com/user/ur84324474",
      "reviewLink": "https://www.imdb.com/review/rw7502801",
      "warningSpoilers": false,
      "date": "2 November 2021",
      "rate": "9",
      "helpful": "39 out of 46 found this helpful.",
      "title": "TERRIFIC AND GONNA LAST FOR YEARS 🔥",
      "content": "JAI BHIM ✊Emotional ,Hard Hitting And quite intense with No Nonsense cliches towards the entire film...Terrific Cast , Well researched & Gripping Screenplay...Music + Artwork + Cinematography Was best as its peak 🔥Some Films May entertain us , Rare films may disturb us.. JAI BHIM ✊ was one among them & it's Most compelling film I have seen in Recent years.JAI BHIM ✊Much Needed Applause & WatchGonna Fetch multiple accolades in the following yearsOn the Whole .. Tha. Se. Gnanavel Needs A Standing Applause for this film..."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw7547310",
      "warningSpoilers": false,
      "date": "14 November 2021",
      "rate": "8",
      "helpful": "78 out of 100 found this helpful.",
      "title": "Tamil Tragedy, Turmoil & Torture...",
      "content": "This extraordinary story will leave you aghast at the injustice and corruption endemic in the constabulary of India, or at least in the state of Tamil Nadu where these events take place. Based on true events relating to prejudice and persecution, activities that still permeate these societies today, this film is best watched in Tamil with subtitles if the language is not one you own."
    },
    {
      "username": "TreeFiddy53",
      "userUrl": "https://www.imdb.com/user/ur118562022",
      "reviewLink": "https://www.imdb.com/review/rw7502767",
      "warningSpoilers": false,
      "date": "2 November 2021",
      "rate": "8",
      "helpful": "96 out of 125 found this helpful.",
      "title": "Brilliant, hard-hitting & a must watch.",
      "content": "Turns out, the movie is based on a real-life incident from 1993.In times when being a policeman is mostly glorified in Indian cinema, I wasn't expecting a movie about police brutality, something that's usually swept under the rugs, which makes this an important film in Tamil film industry and thanks to streaming services, in Indian Cinema.The storytelling does a great job of making you care enough for Rajakannu and Sengani (both brilliantly played, with Lijomol being the show stealer in this movie) that you empathize with them throughout the movie. Parts of the movie were brutal and hard to watch, don't be surprised if you find yourself shouting \"Okay that's enough! STOP!\" at the events that unfold. Suriya and Prakash Raj play their respective roles with just enough intensity, nothing over the top with this one. Acting by all of the support cast was very well done.As much as this film is about police brutality, this is also about casteism, which is still prevalent in our great country. Movies, both good and bad ones, in the past on this topic have been made, but you can tell if the script is trying too hard to highlight the caste system. This one, I thought, did it just right and didn't overdo it.If you HAVE to, you can find things wrong with the movie - some cinematic liberty, the \"comedic\" elements, some \"mass moments\", were all necessary IMO. That said, this isn't the kind of movie you find flaws in, but the kind that you watch, and learn and grown from as a person. So, I'd request that you simply appreciate the filmmaking, empathize with the characters and learn a thing or two takeaways for real life."
    },
    {
      "username": "nidhunmoviebuff",
      "userUrl": "https://www.imdb.com/user/ur111831007",
      "reviewLink": "https://www.imdb.com/review/rw7503349",
      "warningSpoilers": false,
      "date": "2 November 2021",
      "rate": "8",
      "helpful": "85 out of 110 found this helpful.",
      "title": "A hard-hitting courtroom drama on custodial violence!",
      "content": "Despite being over 2 hours and 45 minutes long, 'Jai Bhim' is an engaging, thoroughly entertaining watch backed by an astonishing real life story of custodial violence, police cover-ups and systemic corruption.Suriya plays a crusading lawyer, hell bent on revealing the truth behind three Irular (Scheduled Tribe) men who go missing while being in police custody.The superstar turns in an impeccable performance as he fastidiously chips away at the truth, only to discover layer upon layer of lies, caste hatred and cruelty.Despite having a big name star at his disposal, director T. J. Gnanavel deserves praise for letting the story take the driver's seat, never reducing to unnecessary 'massy' sequences or masala elements to drive the narrative forward.Lijimol Jose as the wife of Rajakannu (played by Manikandan) is an absolute force of nature in her role, delivering some of the best sequences in the film, turning in a performance a veteran would be proud of.Prakash Raj as usual excels in a supporting role while and Rajisha Vijayan had precious little screen time to make any sizeable impact.The music from Seal Roldan played very significant role, helping the audience to feel the pain of the beleaguered protagonists in the beginning and that of vindication and righteousness towards the climax.Jai Bhim does not rise up to the emotional highs of previous classic dramas based on custodial violence like Visaranai (2015) or Naandhi (2021) but is an immensely engrossing watch. Recommended!"
    },
    {
      "username": "WorldMovie99",
      "userUrl": "https://www.imdb.com/user/ur71194760",
      "reviewLink": "https://www.imdb.com/review/rw7512805",
      "warningSpoilers": false,
      "date": "5 November 2021",
      "rate": "9",
      "helpful": "106 out of 139 found this helpful.",
      "title": "JAI BHIM is Real, Brutal and Thoughtful",
      "content": "Jai Bhim is real. No doubt about it. A real story portrayed with gripping narration. Makes you fixed on the movie. Jai Bhim is brutal. Yes, the horror of stereotyping people. It breaks your heart throughout the event. Jai Bhim is thoughtful in the sense that it will keep you thinking about who is really the culprit in today's society. Finally it will gives you a silver lining throughout the dark episode. An intellectual war between constitution and unconstitutional surpassing caste creed and divisons.Now coming to the movie, Suriya plays the role of a dedicated lawyer. He works for upliftment of the downtrodden and provides justice. He plays the part well, no nonsense behavior normally done by the protagony of south movies. The antagony is well represented. Means he is perfect outwardly but a devil inside. A genuine depiction of villains in real world. The movie progresses as a war between justice and injustice that finally gives an optimistic ending. Like a ray appearing in the dark. The message of awareness that we should cultivate rearding oppression done by law keepers is a mandatory nowadays. I shall remember movies like Jai bhim and Ardh Satya regarding the social issues. Both are good though opposed to one another in story.Prakash Raj is good to watch esp in Positive role. The performances are praiseworthy. All possible edges are covered makes you seated. The BGM is of heightened feel. It is a positive themed movie. One of the best from south. Recommended for social issues in Indian context. It's a strong point also that the movie is based upon a true story, but there is a minor political issue attached with it. It is modified so is slightly unreal with unreal vibes throughout. So a 90/100."
    },
    {
      "username": "xrionitx",
      "userUrl": "https://www.imdb.com/user/ur82216998",
      "reviewLink": "https://www.imdb.com/review/rw7507350",
      "warningSpoilers": false,
      "date": "3 November 2021",
      "rate": "10",
      "helpful": "104 out of 136 found this helpful.",
      "title": "Excellent!",
      "content": "This is what is called as a perfect Movie. The story was good, the acting of all the characters was commendable. This is realistic but a dramatic tinted movie which was really a need of the moment when there are only the fabricated one sided masala films which only glorify the image of the cops, where as that is a rare case. This movie shows the reality. And the harsh truth. Well made."
    },
    {
      "username": "airjordanyk",
      "userUrl": "https://www.imdb.com/user/ur49190579",
      "reviewLink": "https://www.imdb.com/review/rw7504085",
      "warningSpoilers": false,
      "date": "2 November 2021",
      "rate": "10",
      "helpful": "22 out of 25 found this helpful.",
      "title": "A riveting and raw legal drama with mind-blowing performances from Suriya and Lijumol",
      "content": "Director Gnanavel captures the raw nature of police brutality with a high degree of realism, and every scene was emotionally charged. Suriya brings another firebrand performance after SP, and delivers with his impeccable dialogue delivery and mannerism. I'm glad they didn't add any unnecessary mass/commercial scenes just because it is a Suriya film, and even the songs went along with the story instead destroying the pace. Another important mention is Lijomol Jose's performance as the Irular women who nailed it in every scene.If I had to nitpick some minor negatives in the movie. It would be the antagonists. While they did a satisfactory job, perhaps having a more intelligent lawyer to counter Suriya would have added to more intensity, however this barely impacts the film. The runtime could have also been shortened by 10-15 minutes.Jai Bhim is a fantastic movie and frankly I was more emotionally moved by it than Soorarai Pottru. The movie is an eye-opener to police brutality, but isn't over the top in its police bashing either. Instead it provides nuanced perspectives from well-meaning police officers (pay attention to Prakash Raj's role) in an attempt to support a more just legal system.Rating: 9.5/10."
    },
    {
      "username": "vluckylkv",
      "userUrl": "https://www.imdb.com/user/ur86108379",
      "reviewLink": "https://www.imdb.com/review/rw7540509",
      "warningSpoilers": false,
      "date": "12 November 2021",
      "rate": "10",
      "helpful": "68 out of 87 found this helpful.",
      "title": "Agar kuch dekhna hai toh isko jarur dekho",
      "content": "What a movie!! I usually don't cry while watching movies but this movie left me in tears, Suriya and supporting cast performance is top notch. This story will force you to think about social injustice in our society and police custodial death is horrifying truth of our country. It's a must must watch film for everyone. Don't miss."
    },
    {
      "username": "shaeshatriashwin",
      "userUrl": "https://www.imdb.com/user/ur105625839",
      "reviewLink": "https://www.imdb.com/review/rw7506219",
      "warningSpoilers": false,
      "date": "3 November 2021",
      "rate": "10",
      "helpful": "72 out of 92 found this helpful.",
      "title": "Jai Bhim - Best movie Of 2021",
      "content": "Definite National Award Winning Movie. A great social message film with Thrilling Crime ScreenPlay. Suriya's Next Level performance after SP. Supporting Actors done extraordinadry especially by lijomoljose as sengeni & Manikandan as rajakannu stunned everyone by their national award winning perfomance. Prakashraj Comeback film. An impactful must watch film."
    },
    {
      "username": "kishorkure",
      "userUrl": "https://www.imdb.com/user/ur81539173",
      "reviewLink": "https://www.imdb.com/review/rw7507451",
      "warningSpoilers": false,
      "date": "3 November 2021",
      "rate": "10",
      "helpful": "57 out of 72 found this helpful.",
      "title": "Speechless 😢😢",
      "content": "The movie tells us the meaning of Dr Ambedkar's philosophical thoughts, Jai Bhim meaning a journey from Darkness to Light. What a movie!!! Wow!!! Just wow!!!! This movies lets us know the true meaning of fight against injustice. The brutal scenes of the movie really broke my heart many times watching the movie."
    }
  ],
  "errorMessage": ""
}