{
  "imDbId": "tt15097216",
  "title": "Jai Bhim",
  "fullTitle": "Jai Bhim (2021)",
  "type": "Movie",
  "year": "2021",
  "language": "en",
  "titleInLanguage": "Jai Bhim (film)",
  "url": "https://en.wikipedia.org/wiki/Jai_Bhim_(film)",
  "plotShort": {
    "plainText": "Jai Bhim (transl. Victory to Bhim) is a 2021 Indian Tamil-language legal drama film directed by T. J. Gnanavel and produced by Jyothika and Suriya under 2D Entertainment. The film stars Suriya, Lijomol Jose and Manikandan, with Rajisha Vijayan, Prakash Raj, Rao Ramesh and others in supporting roles. The film deals with the subject of police bias and state violence against a marginalised community. Based on a true incident in 1993, which involves a case fought by Justice K. Chandru, it revolves around the lives of Sengeni and Rajakannu, a couple from the Irular tribe. Rajakannu was arrested by the police, and was later missing from the police station. Sengeni seeks the help of an advocate Chandru to seek justice for her husband.\r\nFollowing an official announcement in April 2021, the film began principal photography that month, with many sequences being shot in Chennai and Kodaikanal. Production was halted due to the COVID-19 pandemic and filming resumed in July 2021. It was completed that September. The film's cinematography and editing were handled by S. R. Kathir and Philomin Raj respectively. The music and film score is composed by Sean Roldan. The film's title is a reference to the slogan used by followers of B. R. Ambedkar.\r\nJai Bhim was released on Amazon Prime Video, prior to Diwali, on 2 November 2021, as part of a multi-film deal signed by 2D Entertainment. The film received universal acclaim from critics, who praised the story, performances, direction and social message, and several publications listed the film as one of the best Tamil and Indian films of 2021.",
    "html": "<p>Jai Bhim (transl. Victory to Bhim) is a 2021 Indian Tamil-language legal drama film directed by T. J. Gnanavel and produced by Jyothika and Suriya under 2D Entertainment. The film stars Suriya, Lijomol Jose and Manikandan, with Rajisha Vijayan, Prakash Raj, Rao Ramesh and others in supporting roles. The film deals with the subject of police bias and state violence against a marginalised community. Based on a true incident in 1993, which involves a case fought by Justice K. Chandru, it revolves around the lives of Sengeni and Rajakannu, a couple from the Irular tribe. Rajakannu was arrested by the police, and was later missing from the police station. Sengeni seeks the help of an advocate Chandru to seek justice for her husband.</p><p>Following an official announcement in April 2021, the film began principal photography that month, with many sequences being shot in Chennai and Kodaikanal. Production was halted due to the COVID-19 pandemic and filming resumed in July 2021. It was completed that September. The film's cinematography and editing were handled by S. R. Kathir and Philomin Raj respectively. The music and film score is composed by Sean Roldan. The film's title is a reference to the slogan used by followers of B. R. Ambedkar.</p><p>Jai Bhim was released on Amazon Prime Video, prior to Diwali, on 2 November 2021, as part of a multi-film deal signed by 2D Entertainment. The film received universal acclaim from critics, who praised the story, performances, direction and social message, and several publications listed the film as one of the best Tamil and Indian films of 2021.</p>"
  },
  "plotFull": {
    "plainText": "Jai Bhim (transl. Victory to Bhim) is a 2021 Indian Tamil-language legal drama film directed by T. J. Gnanavel and produced by Jyothika and Suriya under 2D Entertainment. The film stars Suriya, Lijomol Jose and Manikandan, with Rajisha Vijayan, Prakash Raj, Rao Ramesh and others in supporting roles. The film deals with the subject of police bias and state violence against a marginalised community. Based on a true incident in 1993, which involves a case fought by Justice K. Chandru, it revolves around the lives of Sengeni and Rajakannu, a couple from the Irular tribe. Rajakannu was arrested by the police, and was later missing from the police station. Sengeni seeks the help of an advocate Chandru to seek justice for her husband.\r\nFollowing an official announcement in April 2021, the film began principal photography that month, with many sequences being shot in Chennai and Kodaikanal. Production was halted due to the COVID-19 pandemic and filming resumed in July 2021. It was completed that September. The film's cinematography and editing were handled by S. R. Kathir and Philomin Raj respectively. The music and film score is composed by Sean Roldan. The film's title is a reference to the slogan used by followers of B. R. Ambedkar.\r\nJai Bhim was released on Amazon Prime Video, prior to Diwali, on 2 November 2021, as part of a multi-film deal signed by 2D Entertainment. The film received universal acclaim from critics, who praised the story, performances, direction and social message, and several publications listed the film as one of the best Tamil and Indian films of 2021.\r\nPlot\r\nIn 1993, Rajakannu and Sengeni, a couple from the Irula tribe, laboured in the fields of oppressive caste men to control rat infestations and catch venomous snakes. Rajakannu is called to a rich man's dwelling to capture a snake that sneaks inside a room. The next day, a burglary case gets reported when the man's wife reported missing jewellery pieces from her closet and doubts Rajakannu. The police invaded Rajakannu's home and brutally beat and unlawfully detained a pregnant Sengeni. The police also arrest Rajakannu's brother Iruttappan, his sister Pachaiammal, and his brother-in-law Mosakutty and torture them to confess Rajakannu's whereabouts. The police imprison Rajakannu. They tortured him to make him confess to the crime but released Sengeni. Later, she gets informed that all three men in detention are absconding, and the police threaten her further to divulge their whereabouts.\r\nMythra, who teaches adults from the Irula tribe, learns about Chandru, a lawyer who fights cases for tribal communities, and convinces him to seek justice for Sengeni. After listening to Sengeni's narration of events, Chandru files a habeas corpus case in court, but the court advises them to file in a lower court. Chandru asks for a witness examination, which is not the procedure in a habeas corpus case. But Chandru cites the Rajan case, and the court yields. The Solicitor General appearing for the police, based on the police officers' evidence, argues that Rajakannu and the other two had absconded from police custody the night they were arrested. Chandru discovers they were committing perjury and asks the court to investigate Sub-Inspector Gurumurthy, head constable Veerasamy, and constable Kirubakaran.\r\nAdvocate General Ram Mohan takes over the legal case and claims that the three accused have fled to Kerala. Varadarajulu, the employer of Iruttapan, acknowledges that Iruttapan informed him that he had fled after committing a robbery. Chandru discovers that the three policemen in question went to Kerala to make a phone call to Varadarajulu, and Guru mimicked the voice of Iruttapan. The court appoints IG Perumalsamy as the lead officer in this case upon Chandru's request. After searching for weeks, Chandru, Perumalsamy, and Mythra find Rajakannu's corpse in the middle of a road close to the border of Pondicherry the day after he supposedly fled, and they cremate his body. Both believe that Rajakannu did not die due to a car accident but due to lock-up murder.\r\nChandru talks to a pathologist who conducted Rajakannu's postmortem. He believes Rajakannu's death was due to a broken ribcage but believes a car could have run over him and caused this injury. Veerasamy confesses to Ram Mohan that Rajakannu died in custody. Veerasamy called Guru after Rajakannu's death. Guru tells Veerasamy to stage that both had escaped and left Rajakannu on the road, framing his death as due to a car accident. Mosakutty and Iruttapan got sent to another jail in Kerala. After hearing this, Ram Mohan advises them to maintain their narrative in court. Chandru checks the call history of the police station and informs the court that a call to Guru's residence was made at 9:10 p.m., which does not corroborate Veerasamy's evidence. Chandru asks for more time to investigate.\r\nChandru, Mythra, Sengeni, and the Irular tribe campaigned against the injustice that had happened. Chandru finds that Irutappan called Varadarajulu, but the police coerced him to make that call. Mythra finds Iruttapan and Mosakutty, and they testify in court about the torture all three of them went through and how the police officers killed Rajakannu. Perumalsamy says the police officers took bribes from the actual thief. Chandru also says that on the road where they found tyre marks near Rajakannu's corpse. The footprints matched Guru's and Kiruba's footprints. After hearing this evidence, the court announced the verdict: they arrested the police officers who killed Rajakannu. Sengeni will get ₹3 lakhs (equivalent to ₹18 lakh or US$23,000 in 2020) and half a ground land as compensation, and Iruttappan, Mosakutty, and Pachaiamma will get ₹2 lakhs (equivalent to ₹12 lakh or US$15,000 in 2020) each. Sengeni thanks Chandru for his help, and Chandru attends the inauguration of Sengeni's new house, fulfilling Rajakannu's dream to get Sengeni a new home.\r\nCast\r\nSuriya as Adv. Chandru, a lawyer who fights cases for tribal communities\r\nLijomol Jose as Sengeni Rajakannu, a tribal woman who wants justice for her missing husband\r\nManikandan as Rajakannu, Sengeni's husband who dies in police custody\r\nRajisha Vijayan as Mythra, an adult teacher for the Irula tribe (Voice dubbed by Raveena Ravi)\r\nPrakash Raj as IG Perumalsamy, the lead officer of the case\r\nBaby Joshika Maya as Alli Rajakannu, Sengani and Rajakannu's daughter\r\nRao Ramesh as Advocate general Ram Mohan\r\nGuru Somasundaram as PP Chellapandiyan\r\nTamizh as Sub-inspector Gurumoorthy, a casteist cop and one of the murderers\r\nSupergood Subramani as Constable Veerasamy, one of the murderers\r\nBala Hasan as Constable Kirubakaran, one of the murderers\r\nM. Chinraasu as Irutappan, Rajakannu's brother\r\nSubhadra as Pachaiyammal, Rajakannu's sister\r\nRajendran as Mosakutty, Rasakannu's brother-in-law\r\nJayaprakash as DGP Radhakrishnan\r\nM. S. Bhaskar as Sankaran\r\nIlavarasu as Gunasekaran, the village president\r\nKumaravel as Albi Antony, a police officer\r\nJaya Rao as Kathirvel\r\nSujatha Sivakumar as Subbulakshmi\r\nRavi Venkatraman as Inspector Bashyam\r\nSibi Thomas as SP Ashok Varadhan\r\nRaja Rani Pandian as Rajan\r\nShankar Sundaram as Sathyadev\r\nJijoy Rajagopal as Munnar Rajesh\r\nSanjay Swaroop as Judge\r\nKumar Natarajan as Advocate\r\nBava Chelladurai as Krishnan\r\nDavid Solomon Raja as Sasikumar Pandian\r\nAnagoor Raaju as Rajakannu's uncle\r\nDeepa as Irutappan's wife\r\nKaveri as Mosakutty's wife\r\nBigil Siva as Dr. Mahesh\r\nSivaranjani as Gunasekaran's wife\r\nV. Renganathan as Rajakannu's employer\r\nSrikanth as rice mill Owner\r\nRajesh Balachandran as Nataraj\r\nAravind Seiju as Madhan\r\nPandian as Rajan\r\nP. R. Kaalishwaran as Kalyani\r\nS. Ravi as Elumalai\r\nK. Raju as Vinod\r\nP. R. George as Rajesh\r\nBatman as Ravi\r\nKulotungan as jewellery shop owner\r\nDhanasekar as a tea shop owner\r\nRamachandran as Judge\r\nDayalan as jailor\r\nYuva as Arunachalam\r\nDandapani as Ramasamy\r\nAshokan as Kaaliappan\r\nSaravanan as Sekhar\r\nDeva as Sankar\r\nKumarasamy as Janakiraman\r\nSubramanian as Rangarajan\r\nProduction\r\nDevelopment\r\nIn March 2020, media reports surfaced that Suriya would be collaborating with T. J. Gnanavel, director of Kootathil Oruthan (2017) fame, for a legal drama film based on tribal people. Gnanavel earlier worked as dialogue writer in the Tamil-dubbed version of Suriya's Rakta Charitra 2 (2010), which was titled Ratha Sarithram. It was further stated that the film would be based on a true incident in 1993, and Suriya plays the role of a lawyer. His role is based on the real-life of retired Madras High Court Justice and former senior advocate K. Chandru, who faced a legal battle in order to bring justice for an Irular tribe woman. Her husband Rajakannu was arrested due to some unfortunate events and later disappeared from the police station that night. In the hope of justice for Rajakannu, she sought the help of Chandru who went beyond conventional lines to unearth the truth and bring justice to the woman and her family. Gnanavel also met the lawyer and interacted with him for several weeks, to understand further about the case. The team also took a workshop from actor–director R. Madhavan on making a biopic of a prominent individual in a short span of time, following the actor's work on Rocketry: The Nambi Effect (2022).\r\nCasting\r\nThe project was formally announced in April 2021, with Suriya himself producing the film under 2D Entertainment banner. Initially, Roshini Haripriyan was approached for the role of Senggeni. But eventually the role went to Lijomol Jose. In May 2021, Malayalam film Rajisha Vijayan signed in for a pivotal role after her Tamil debut with Karnan (2021). Prakash Raj, Rao Ramesh and K. Manikandan, amongst others, were reportedly signed in for supporting roles, with music composer Sean Roldan, editor Philomin Raj, videographer S. R. Kathir, production designer Jacki and stunt co-ordinator duo Anbariv also a part of the technical crew. The title of the film Jai Bhim (based on the slogan used by followers of B. R. Ambedkar), was announced on 23 July 2021 (Suriya's birthday), with a first look release. The title was already taken by director Pa. Ranjith, a follower of Ambedkar's ideologies, and Suriya said Ranjith gave the film crew the title.\r\nFilming\r\nPrincipal photography began in Kodaikanal during mid-April 2021, with Suriya joining the sets despite shooting for Etharkkum Thunindhavan (2021) in Karaikkudi. As production of the latter was halted due to the COVID-19 pandemic, Suriya began working on the project with the shooting in Kodaikanal, which was further interrupted due to the pandemic and the subsequent lockdown. In July 2021, shooting of the film resumed. Principal photography was wrapped up by September 2021.\r\nPost-production\r\nIn October 2021, the final copy of the film was submitted to the Central Board of Film Certification, which gave the film an \"A\" (adults-only) certificate, as some scenes have content that is suitable only for mature audiences. It is the first time a Suriya-starrer was given this rating since Rakta Charitra 2.\r\nMusic\r\nThe film score and soundtrack is composed by Sean Roldan in his first collaboration with Suriya. The lyrics for the songs were written by Yugabharathi, Raju Murugan and Arivu. In August 2021, Roldan recorded the first track of the film (which was later deciphered as \"Power Song\") with vocals and lyrics written by Arivu. He further recorded the film's background score with orchestrator Matt Dunkley at Abbey Road Studios, London, with a snippet from the recording sessions uploaded to social media during mid-October. The music rights were purchased by Sony Music India, and the first single \"Power Song\" was released on 6 October 2021. The second single \"Thala Kodhum\" sung by Pradeep Kumar was released on 18 October.\r\nThe original soundtrack album consisting of five tracks was released through music streaming platforms on 27 October 2021, with the jukebox being unveiled on YouTube, a day later. After the film's release, Sean Roldan performed few lines from the unreleased hidden track titled \"Manniley Eeramundu\" which was played during the climax of the film, at a chat session and following multiple requests, the makers released the aforementioned track as a single on 15 November 2021.\r\nRelease\r\nStreaming\r\nOn 5 August 2021, 2D Entertainment signed a four-film deal with the streaming service Amazon Prime Video. As part of this deal, four of the studio's upcoming projects would premiere directly on Prime Video while bypassing theatrical release. Jai Bhim was scheduled for a streaming release during November 2021. On 2 October, the makers announced that the film would be released worldwide on 2 November 2021, ahead of the Diwali festival. In addition, the film was dubbed in Hindi, Telugu, Malayalam and Kannada languages. The film was screened at the 9th edition of Noida International Film Festival on 23 January 2022. The film was also showcased under the \"World Competition\" segment at the 20th edition of Pune International Film Festival, held in March 2022.\r\nHome media\r\nThe satellite rights were acquired by Kalaignar TV, and the film had its television premiere on 15 January 2022, coinciding with Pongal.\r\nReception\r\nCritical response\r\nThe film received critical acclaim. The script, performances (of Suriya, Lijomol Jose and Manikandan), direction and technical aspects were praised.\r\nRanjani Krishnakumar of Film Companion wrote, \"Jai Bhim is a solid film held together by craftly writing, thoughtful filmmaking, restrained performances and a true incident of the justice system restoring hope.\" NDTV-based chief critic Saibal Chatterjee gave the film 3.5 out of 5 writing\" The amalgamation of the lead actor's charisma, the urgency of the theme and the force of the no-holds-barred storytelling results in an immersive and riveting film that calls attention to the plight of an oppressed community languishing on the fringes of society.\" S. Srivatsan of The Hindu wrote \"'Jai Bhim' is perhaps one of the boldest films to have come out of Tamil cinema. It doesn't dare turn its back on hitting where it hurts the most, and its politics is not weighed down by the presence of a star like Suriya\" Writing for The Indian Express, Manoj Kumar R. gave the film 4 out of 5 writing \"Suriya feels natural and very comfortable in the role of a firebrand advocate. It is as if he's not just performing the lines written by the director, but he really believes in every word and gesture he delivers in this film.\" Sowmya Rajendran of The News Minute also gave the film 4 out of 5 while writing \"As a courtroom drama and investigative thriller, based on real events, 'Jai Bhim' is head and shoulders above the average fare.\"\r\nM. Suganth of The Times of India gave the film 3.5 out of 5 writing \"Gnanavel gives us some terrific moments of defiance. Lijomol Jose is quietly powerful as Sengani, who gets a couple of rousing scenes when she turns down efforts at a compromise from cops. Manikandan, too, is effective and stands out in the scene when he urges his men to not give in as that will result in their community being branded as criminals. The director also portrays the intimacy between Sengani and Rajakannu in a charming manner\". Ashameera Aiyyappan of Firstpost gave the film 4 out of 5 writing \"Jai Bhim is hard-hitting and intense. Unlike most commercial star vehicles, the film is decisively realistic. It tells a deeply important story with great nuance, ensuring that the people are not reduced to stereotypes.\" Hindustan Times-based Haricharan Pudipeddi wrote \"Jai Bhim also talks about caste-based discrimination, and it doesn't try to sugar-coat things in the process. One of the highlights of Jai Bhim are the courtroom sequences which have been shot in the most realistic fashion. Suriya brings earnestness in his performance and plays the role of a lawyer with a lot of maturity, ensuring that his star image never comes in the way. It's Manikandan, who leaves you stunned with a gut-wrenching performance. Most of his scenes are shot in the interrogation room and he brings out the helplessness of his character effectively. Lijomol Jose as the lone woman standing against system that is rigged against her, is one of the best casting choices in recent times in Tamil cinema.\" A critic from Onmanorama gave the film 3.5 out of 5 writing \"Rather than being a mere courtroom drama, Jai Bhim is a much-needed film from the past that will be relevant in the years to come, with new hope and a new beginning.\"\r\nJanani K. of India Today gave the film 4.5 out of 5 writing \"Jai Bhim is an important film in the history of Tamil cinema. It shows how caste discrimination and injustice kill people. Jai Bhim is a film that also talks about the lack of humanity. Jai Bhim is a must-watch for its hard-hitting content and its ideologies. It's what society needs right now.\" Sudhir Srinivasan, writing for Cinema Express gave the film 3.5 writing that \"despite all the attempts to create an engaging court experience, the film fails to create strong lawyer adversaries for Chandru And yet, for all these missteps that prevent Jai Bhim from being an unforgettable film, it's still necessary to note that this is an important film that documents, with passion and good intentions, the oppression of a community. It's a film co-produced by a star, who's brave enough to almost slide himself into the background. Yes, he's a saviour in this film, sure, but he is not of the henchmen-beating, heroine-advising, agency-robbing kind, and neither is he the centrepoint of this story. Though he's a saviour, you could argue that he's also a 'victim'... of his good conscience. \"It's the only way I can get a good night's sleep,\" he says, explaining his motivation to represent the vulnerable. If only our society created more such victims\". Chief-editor Harish Wankhede's review in The Hindu suggests that the protagonist is \"an Ambedkarite hero who struggles to protect the life and dignity of the tribal people by adopting democratic and legal apparatuses. Further, the film presents the victim Sanggeni not as a powerless and wretched spectator but as a dignified claimant of equal rights and justice. It equally focuses on her brave struggle against the powerful establishment and promotes her as a parallel protagonist of the story.\r\nAccolades\r\nThe film was made available for screening at the 94th Academy Awards, but failed to get nominated.\r\nControversies\r\n\"Cinema has influenced and been a catalyst for social change on multiple occasions Jai Bhim is also one such creation that is part of efforts to instigate social change Viewing as someone who is against positive change in society or encouraging violence against him, is wrong and sets the wrong example. The best thing to do would be to let an art stand for itself without infringing the creators' artistic freedom. If this trend goes on, filmmakers will have to wait outside the houses of politicians to seek their approval before they could go ahead with a script and shoot a film\".\r\n– Bharathiraja, president of Tamil Film Active Producers Association\r\nJai Bhim attracted opposition by the Vanniyar caste group Vanniyar Sangam (the parent organisation of Pattali Makkal Katchi or PMK), regarding a scene involving the character sub-inspector Gurumoorthy, which the PMK leaders claimed insulted the community. PMK leader Anbumani Ramadoss wrote a letter posing a series of questions about the film and how it defamed the community. In the film, an image of a pot of fire (a symbol of the Vanniyar community) was seen on a wall calendar in the sub-inspector's residence.\r\nRamadoss criticised the choice to name the sub-inspector as Gurumoorthy, which he claims defames PMK leader Kaduvetti Guru. While the film used the names of the individuals in the case for their on-screen characters, the sub-inspector's character was not given the analogous individual's name, which was Anthonysamy. Suriya however responded that the film's team did not have any intention of hurting any single individual or a particular community. He also said that \"Through the film, questions have been raised against those in power, it should not be turned into name-politics and diluted.\"\r\nAmid threats from supporters of the PMK and the Vanniyar Sangam, police protection was given to Suriya's residence in T. Nagar, Chennai. Numerous filmmakers, including Vetrimaaran, Lokesh Kanagaraj, Pa. Ranjith, C. S. Amudhan, Prakash Raj (who appeared in the film), Sathyaraj, and Siddharth, publicly spoke up in favour of Suriya, while associations such as South Indian Film Chamber of Commerce, Tamil Film Active Producers Association, and Nadigar Sangam raised objections to the attacks. The hashtag #WeStandWithSuriya started trending on Twitter, to which Suriya responded by thanking fans for their \"overwhelming support\". Gnanavel apologised on Twitter, saying that he takes responsibility for the controversy and that it was unfair to blame Suriya.\r\nA scene in the film where Prakash Raj's character Perumalsamy slaps a pawnbroker for speaking in Hindi and tells him to speak in Tamil sparked controversy on social media and was opposed by BJP. Some stated that it promoted anti-Hindi sentiment, while others countered by saying that Perumalsamy slaps the pawnbroker for trying to confuse him and evade questioning by speaking in a language that he does not understand when he can speak in Tamil. Prakash Raj responded to this by saying that \"they did not see the agony of the tribal people, they did not see and feel terrible about the injustice, they saw only the slap. That is all they understood; this exposes their agenda\", but confirmed that the pawnbroker, who knows Tamil, was indeed trying to evade questioning by speaking in Hindi.\r\nOn 11 August 2022, the Madras High Court quashed criminal proceedings against Suriya and Gnanavel for allegedly hurting the sentiment of the Vanniyar community in the film. While the complainant had said that the film intended to incite violence and hostility on a particular community, the court observed that no such instance had been recorded.\r\nSocial impact\r\nJai Bhim received an overwhelming response from members across the film fraternity, including Kamal Haasan, Siddharth, R. Madhavan, and Sivakarthikeyan, amongst others. Justice K. Chandru, who was closely associated with the film from the story discussions to post-production work had stated in an interview with The Federal, saying that \"the film is not a mere retelling of Sengini's tragic tale, but is more about throwing light on the larger picture of the victimisation of vulnerable communities like the Irula tribe\". M. K. Stalin, the Chief Minister of Tamil Nadu, praised the film saying it had occupied his thoughts all night long. He stated that the core issue of the film reminded him of his own time in prison when arrested in 1976 under MISA (Maintenance of Internal Security Act, 1971) during the emergency period, and that his heart felt very heavy after watching the film. He congratulated Suriya and Gnanavel, and the entire film unit, saying that he wished more such films were made. He complimented Suriya's donation of ₹10 million (US$130,000) to the Pazhangudi Irular Trust for their education. Responding to Stalin's compliments, Suriya said, \"I am running out of words. The compliments of the Chief Minister have fulfilled the intent of Jai Bhim\" and thanked the politician on behalf of the team. Suriya promised to open a fixed deposit of ₹10 lakh in the name of Parvati Ammal. He said, \"The interest accrued for the FD will be handed over to Parvati Ammal every month and it will be ensured that the amount goes to her children after her death\".\r\nIt was IMDb's most popular Indian film of the year. Jai Bhim also became the most-searched film of 2021 in India on Google. It was also fourth in the list of films that were tweeted about most in 2021, according to a report published by Twitter. Several publications including The Indian Express, The News Minute, Hindustan Times, Firstpost, and India Today, listed Jai Bhim as one of the best Tamil films of 2021. According to the social networking site Letterboxd, it was listed in the 15th position of \"highest rated International films of 2021\". A scene from the film was listed on The Oscars' official YouTube channel as a part of the segment \"Scene at the Academy\", with T. J. Gnanavel exploring about the making of the film. Raj Shinde, critic-based at the Indian website ThePrint cited Jai Bhim as one of the examples of how Indian cinema evolved in producing anti-caste films. The screenplay of the film was published as a book and was made available at the Chennai Book Fair of 2023.",
    "html": "<p>Jai Bhim (transl. Victory to Bhim) is a 2021 Indian Tamil-language legal drama film directed by T. J. Gnanavel and produced by Jyothika and Suriya under 2D Entertainment. The film stars Suriya, Lijomol Jose and Manikandan, with Rajisha Vijayan, Prakash Raj, Rao Ramesh and others in supporting roles. The film deals with the subject of police bias and state violence against a marginalised community. Based on a true incident in 1993, which involves a case fought by Justice K. Chandru, it revolves around the lives of Sengeni and Rajakannu, a couple from the Irular tribe. Rajakannu was arrested by the police, and was later missing from the police station. Sengeni seeks the help of an advocate Chandru to seek justice for her husband.</p><p>Following an official announcement in April 2021, the film began principal photography that month, with many sequences being shot in Chennai and Kodaikanal. Production was halted due to the COVID-19 pandemic and filming resumed in July 2021. It was completed that September. The film's cinematography and editing were handled by S. R. Kathir and Philomin Raj respectively. The music and film score is composed by Sean Roldan. The film's title is a reference to the slogan used by followers of B. R. Ambedkar.</p><p>Jai Bhim was released on Amazon Prime Video, prior to Diwali, on 2 November 2021, as part of a multi-film deal signed by 2D Entertainment. The film received universal acclaim from critics, who praised the story, performances, direction and social message, and several publications listed the film as one of the best Tamil and Indian films of 2021.</p><br/><h3>Plot</h3><p>In 1993, Rajakannu and Sengeni, a couple from the Irula tribe, laboured in the fields of oppressive caste men to control rat infestations and catch venomous snakes. Rajakannu is called to a rich man's dwelling to capture a snake that sneaks inside a room. The next day, a burglary case gets reported when the man's wife reported missing jewellery pieces from her closet and doubts Rajakannu. The police invaded Rajakannu's home and brutally beat and unlawfully detained a pregnant Sengeni. The police also arrest Rajakannu's brother Iruttappan, his sister Pachaiammal, and his brother-in-law Mosakutty and torture them to confess Rajakannu's whereabouts. The police imprison Rajakannu. They tortured him to make him confess to the crime but released Sengeni. Later, she gets informed that all three men in detention are absconding, and the police threaten her further to divulge their whereabouts.</p><p>Mythra, who teaches adults from the Irula tribe, learns about Chandru, a lawyer who fights cases for tribal communities, and convinces him to seek justice for Sengeni. After listening to Sengeni's narration of events, Chandru files a habeas corpus case in court, but the court advises them to file in a lower court. Chandru asks for a witness examination, which is not the procedure in a habeas corpus case. But Chandru cites the Rajan case, and the court yields. The Solicitor General appearing for the police, based on the police officers' evidence, argues that Rajakannu and the other two had absconded from police custody the night they were arrested. Chandru discovers they were committing perjury and asks the court to investigate Sub-Inspector Gurumurthy, head constable Veerasamy, and constable Kirubakaran.</p><p>Advocate General Ram Mohan takes over the legal case and claims that the three accused have fled to Kerala. Varadarajulu, the employer of Iruttapan, acknowledges that Iruttapan informed him that he had fled after committing a robbery. Chandru discovers that the three policemen in question went to Kerala to make a phone call to Varadarajulu, and Guru mimicked the voice of Iruttapan. The court appoints IG Perumalsamy as the lead officer in this case upon Chandru's request. After searching for weeks, Chandru, Perumalsamy, and Mythra find Rajakannu's corpse in the middle of a road close to the border of Pondicherry the day after he supposedly fled, and they cremate his body. Both believe that Rajakannu did not die due to a car accident but due to lock-up murder.</p><p>Chandru talks to a pathologist who conducted Rajakannu's postmortem. He believes Rajakannu's death was due to a broken ribcage but believes a car could have run over him and caused this injury. Veerasamy confesses to Ram Mohan that Rajakannu died in custody. Veerasamy called Guru after Rajakannu's death. Guru tells Veerasamy to stage that both had escaped and left Rajakannu on the road, framing his death as due to a car accident. Mosakutty and Iruttapan got sent to another jail in Kerala. After hearing this, Ram Mohan advises them to maintain their narrative in court. Chandru checks the call history of the police station and informs the court that a call to Guru's residence was made at 9:10 p.m., which does not corroborate Veerasamy's evidence. Chandru asks for more time to investigate.</p><p>Chandru, Mythra, Sengeni, and the Irular tribe campaigned against the injustice that had happened. Chandru finds that Irutappan called Varadarajulu, but the police coerced him to make that call. Mythra finds Iruttapan and Mosakutty, and they testify in court about the torture all three of them went through and how the police officers killed Rajakannu. Perumalsamy says the police officers took bribes from the actual thief. Chandru also says that on the road where they found tyre marks near Rajakannu's corpse. The footprints matched Guru's and Kiruba's footprints. After hearing this evidence, the court announced the verdict: they arrested the police officers who killed Rajakannu. Sengeni will get ₹3 lakhs (equivalent to ₹18 lakh or US$23,000 in 2020) and half a ground land as compensation, and Iruttappan, Mosakutty, and Pachaiamma will get ₹2 lakhs (equivalent to ₹12 lakh or US$15,000 in 2020) each. Sengeni thanks Chandru for his help, and Chandru attends the inauguration of Sengeni's new house, fulfilling Rajakannu's dream to get Sengeni a new home.</p><br/><h3>Cast</h3><ul><li>Suriya as Adv. Chandru, a lawyer who fights cases for tribal communities</li><li>Lijomol Jose as Sengeni Rajakannu, a tribal woman who wants justice for her missing husband</li><li>Manikandan as Rajakannu, Sengeni's husband who dies in police custody</li><li>Rajisha Vijayan as Mythra, an adult teacher for the Irula tribe (Voice dubbed by Raveena Ravi)</li><li>Prakash Raj as IG Perumalsamy, the lead officer of the case</li><li>Baby Joshika Maya as Alli Rajakannu, Sengani and Rajakannu's daughter</li><li>Rao Ramesh as Advocate general Ram Mohan</li><li>Guru Somasundaram as PP Chellapandiyan</li><li>Tamizh as Sub-inspector Gurumoorthy, a casteist cop and one of the murderers</li><li>Supergood Subramani as Constable Veerasamy, one of the murderers</li><li>Bala Hasan as Constable Kirubakaran, one of the murderers</li><li>M. Chinraasu as Irutappan, Rajakannu's brother</li><li>Subhadra as Pachaiyammal, Rajakannu's sister</li><li>Rajendran as Mosakutty, Rasakannu's brother-in-law</li><li>Jayaprakash as DGP Radhakrishnan</li><li>M. S. Bhaskar as Sankaran</li><li>Ilavarasu as Gunasekaran, the village president</li><li>Kumaravel as Albi Antony, a police officer</li><li>Jaya Rao as Kathirvel</li><li>Sujatha Sivakumar as Subbulakshmi</li><li>Ravi Venkatraman as Inspector Bashyam</li><li>Sibi Thomas as SP Ashok Varadhan</li><li>Raja Rani Pandian as Rajan</li><li>Shankar Sundaram as Sathyadev</li><li>Jijoy Rajagopal as Munnar Rajesh</li><li>Sanjay Swaroop as Judge</li><li>Kumar Natarajan as Advocate</li><li>Bava Chelladurai as Krishnan</li><li>David Solomon Raja as Sasikumar Pandian</li><li>Anagoor Raaju as Rajakannu's uncle</li><li>Deepa as Irutappan's wife</li><li>Kaveri as Mosakutty's wife</li><li>Bigil Siva as Dr. Mahesh</li><li>Sivaranjani as Gunasekaran's wife</li><li>V. Renganathan as Rajakannu's employer</li><li>Srikanth as rice mill Owner</li><li>Rajesh Balachandran as Nataraj</li><li>Aravind Seiju as Madhan</li><li>Pandian as Rajan</li><li>P. R. Kaalishwaran as Kalyani</li><li>S. Ravi as Elumalai</li><li>K. Raju as Vinod</li><li>P. R. George as Rajesh</li><li>Batman as Ravi</li><li>Kulotungan as jewellery shop owner</li><li>Dhanasekar as a tea shop owner</li><li>Ramachandran as Judge</li><li>Dayalan as jailor</li><li>Yuva as Arunachalam</li><li>Dandapani as Ramasamy</li><li>Ashokan as Kaaliappan</li><li>Saravanan as Sekhar</li><li>Deva as Sankar</li><li>Kumarasamy as Janakiraman</li><li>Subramanian as Rangarajan</li></ul><br/><h3>Production</h3><h4>Development</h4><p>In March 2020, media reports surfaced that Suriya would be collaborating with T. J. Gnanavel, director of Kootathil Oruthan (2017) fame, for a legal drama film based on tribal people. Gnanavel earlier worked as dialogue writer in the Tamil-dubbed version of Suriya's Rakta Charitra 2 (2010), which was titled Ratha Sarithram. It was further stated that the film would be based on a true incident in 1993, and Suriya plays the role of a lawyer. His role is based on the real-life of retired Madras High Court Justice and former senior advocate K. Chandru, who faced a legal battle in order to bring justice for an Irular tribe woman. Her husband Rajakannu was arrested due to some unfortunate events and later disappeared from the police station that night. In the hope of justice for Rajakannu, she sought the help of Chandru who went beyond conventional lines to unearth the truth and bring justice to the woman and her family. Gnanavel also met the lawyer and interacted with him for several weeks, to understand further about the case. The team also took a workshop from actor–director R. Madhavan on making a biopic of a prominent individual in a short span of time, following the actor's work on Rocketry: The Nambi Effect (2022).</p><h4>Casting</h4><p>The project was formally announced in April 2021, with Suriya himself producing the film under 2D Entertainment banner. Initially, Roshini Haripriyan was approached for the role of Senggeni. But eventually the role went to Lijomol Jose. In May 2021, Malayalam film Rajisha Vijayan signed in for a pivotal role after her Tamil debut with Karnan (2021). Prakash Raj, Rao Ramesh and K. Manikandan, amongst others, were reportedly signed in for supporting roles, with music composer Sean Roldan, editor Philomin Raj, videographer S. R. Kathir, production designer Jacki and stunt co-ordinator duo Anbariv also a part of the technical crew. The title of the film Jai Bhim (based on the slogan used by followers of B. R. Ambedkar), was announced on 23 July 2021 (Suriya's birthday), with a first look release. The title was already taken by director Pa. Ranjith, a follower of Ambedkar's ideologies, and Suriya said Ranjith gave the film crew the title.</p><h4>Filming</h4><p>Principal photography began in Kodaikanal during mid-April 2021, with Suriya joining the sets despite shooting for Etharkkum Thunindhavan (2021) in Karaikkudi. As production of the latter was halted due to the COVID-19 pandemic, Suriya began working on the project with the shooting in Kodaikanal, which was further interrupted due to the pandemic and the subsequent lockdown. In July 2021, shooting of the film resumed. Principal photography was wrapped up by September 2021.</p><h4>Post-production</h4><p>In October 2021, the final copy of the film was submitted to the Central Board of Film Certification, which gave the film an \"A\" (adults-only) certificate, as some scenes have content that is suitable only for mature audiences. It is the first time a Suriya-starrer was given this rating since Rakta Charitra 2.</p><br/><h3>Music</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Jai Bhim</th></tr><tr><td colspan=\"2\" class=\"infobox-image\"></td></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\"><span>Sean Roldan</span></div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">27 October 2021</td></tr><tr><th scope=\"row\" class=\"infobox-label\">Recorded</th><td class=\"infobox-data plainlist\">2021</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span class=\"mw-redirect\">Feature film soundtrack</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">22</span>:<span class=\"s\">38</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Language</th><td class=\"infobox-data category\"><span>Tamil</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span>Sony Music</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Producer</span></th><td class=\"infobox-data hlist\"><span>Sean Roldan</span></td></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Sean Roldan</span> chronology</th></tr><tr><td colspan=\"2\" class=\"infobox-full-data\"><table style=\"background: transparent; width: 100%; min-width: 100%; border-collapse: collapse; display: inline-table;\"><tbody><tr style=\"line-height: 1.4em;\"><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em .1em .2em 0\"><i><span class=\"mw-redirect\">Kasada Thapara</span></i><br>(2021)</td><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em .1em\"><i><b>Jai Bhim</b></i><br>(2021)</td><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em 0 .2em .1em\"><i><span>August 16 1947</span></i><br>(2023)</td></tr></tbody></table></td></tr><tr><td colspan=\"2\" class=\"infobox-below\"><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1066479718\"><table class=\"infobox\" style=\"float: right; clear: right; margin:0 0 1.5em 1.5em\"></table></td></tr></tbody></table><p>The film score and soundtrack is composed by Sean Roldan in his first collaboration with Suriya. The lyrics for the songs were written by Yugabharathi, Raju Murugan and Arivu. In August 2021, Roldan recorded the first track of the film (which was later deciphered as \"Power Song\") with vocals and lyrics written by Arivu. He further recorded the film's background score with orchestrator Matt Dunkley at Abbey Road Studios, London, with a snippet from the recording sessions uploaded to social media during mid-October. The music rights were purchased by Sony Music India, and the first single \"Power Song\" was released on 6 October 2021. The second single \"Thala Kodhum\" sung by Pradeep Kumar was released on 18 October.</p><p>The original soundtrack album consisting of five tracks was released through music streaming platforms on 27 October 2021, with the jukebox being unveiled on YouTube, a day later. After the film's release, Sean Roldan performed few lines from the unreleased hidden track titled \"Manniley Eeramundu\" which was played during the climax of the film, at a chat session and following multiple requests, the makers released the aforementioned track as a single on 15 November 2021.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Track listing</caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:40%\">Title</th><th scope=\"col\" style=\"width:30%\">Lyrics</th><th scope=\"col\" style=\"width:30%\">Singer(s)</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Power\"</td><td><span>Arivu</span></td><td>Arivu</td><td class=\"tracklist-length\">3:38</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Thala Kodhum\"</td><td><span>Raju Murugan</span></td><td><span>Pradeep Kumar</span></td><td class=\"tracklist-length\">3:49</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Sendumalli\"</td><td><span>Yugabharathi</span></td><td><span>Ananthu</span>, <span>Kalyani Nair</span></td><td class=\"tracklist-length\">4:11</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Vettakaara Kootam\"</td><td>Yugabharathi</td><td><span>Anthony Daasan</span>, Niranjana Ramanan</td><td class=\"tracklist-length\">3:26</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Polladha Ulagathiley\"</td><td>Yugabharathi</td><td><span>Sean Roldan</span></td><td class=\"tracklist-length\">5:07</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Manniley Eeramundu\"</td><td>Yugabharathi</td><td><span>Vaikom Vijayalakshmi</span></td><td class=\"tracklist-length\">2:24</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"4\" scope=\"row\"><span>Total length:</span></th><td>22:38</td></tr></tbody></table><br/><h3>Release</h3><h4>Streaming</h4><p>On 5 August 2021, 2D Entertainment signed a four-film deal with the streaming service Amazon Prime Video. As part of this deal, four of the studio's upcoming projects would premiere directly on Prime Video while bypassing theatrical release. Jai Bhim was scheduled for a streaming release during November 2021. On 2 October, the makers announced that the film would be released worldwide on 2 November 2021, ahead of the Diwali festival. In addition, the film was dubbed in Hindi, Telugu, Malayalam and Kannada languages. The film was screened at the 9th edition of Noida International Film Festival on 23 January 2022. The film was also showcased under the \"World Competition\" segment at the 20th edition of Pune International Film Festival, held in March 2022.</p><h4>Home media</h4><p>The satellite rights were acquired by Kalaignar TV, and the film had its television premiere on 15 January 2022, coinciding with Pongal.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>The film received critical acclaim. The script, performances (of Suriya, Lijomol Jose and Manikandan), direction and technical aspects were praised.</p><p>Ranjani Krishnakumar of Film Companion wrote, \"Jai Bhim is a solid film held together by craftly writing, thoughtful filmmaking, restrained performances and a true incident of the justice system restoring hope.\" NDTV-based chief critic Saibal Chatterjee gave the film 3.5 out of 5 writing\" The amalgamation of the lead actor's charisma, the urgency of the theme and the force of the no-holds-barred storytelling results in an immersive and riveting film that calls attention to the plight of an oppressed community languishing on the fringes of society.\" S. Srivatsan of The Hindu wrote \"'Jai Bhim' is perhaps one of the boldest films to have come out of Tamil cinema. It doesn't dare turn its back on hitting where it hurts the most, and its politics is not weighed down by the presence of a star like Suriya\" Writing for The Indian Express, Manoj Kumar R. gave the film 4 out of 5 writing \"Suriya feels natural and very comfortable in the role of a firebrand advocate. It is as if he's not just performing the lines written by the director, but he really believes in every word and gesture he delivers in this film.\" Sowmya Rajendran of The News Minute also gave the film 4 out of 5 while writing \"As a courtroom drama and investigative thriller, based on real events, 'Jai Bhim' is head and shoulders above the average fare.\"</p><p>M. Suganth of The Times of India gave the film 3.5 out of 5 writing \"Gnanavel gives us some terrific moments of defiance. Lijomol Jose is quietly powerful as Sengani, who gets a couple of rousing scenes when she turns down efforts at a compromise from cops. Manikandan, too, is effective and stands out in the scene when he urges his men to not give in as that will result in their community being branded as criminals. The director also portrays the intimacy between Sengani and Rajakannu in a charming manner\". Ashameera Aiyyappan of Firstpost gave the film 4 out of 5 writing \"Jai Bhim is hard-hitting and intense. Unlike most commercial star vehicles, the film is decisively realistic. It tells a deeply important story with great nuance, ensuring that the people are not reduced to stereotypes.\" Hindustan Times-based Haricharan Pudipeddi wrote \"Jai Bhim also talks about caste-based discrimination, and it doesn't try to sugar-coat things in the process. One of the highlights of Jai Bhim are the courtroom sequences which have been shot in the most realistic fashion. Suriya brings earnestness in his performance and plays the role of a lawyer with a lot of maturity, ensuring that his star image never comes in the way. It's Manikandan, who leaves you stunned with a gut-wrenching performance. Most of his scenes are shot in the interrogation room and he brings out the helplessness of his character effectively. Lijomol Jose as the lone woman standing against system that is rigged against her, is one of the best casting choices in recent times in Tamil cinema.\" A critic from Onmanorama gave the film 3.5 out of 5 writing \"Rather than being a mere courtroom drama, Jai Bhim is a much-needed film from the past that will be relevant in the years to come, with new hope and a new beginning.\"</p><p>Janani K. of India Today gave the film 4.5 out of 5 writing \"Jai Bhim is an important film in the history of Tamil cinema. It shows how caste discrimination and injustice kill people. Jai Bhim is a film that also talks about the lack of humanity. Jai Bhim is a must-watch for its hard-hitting content and its ideologies. It's what society needs right now.\" Sudhir Srinivasan, writing for Cinema Express gave the film 3.5 writing that \"despite all the attempts to create an engaging court experience, the film fails to create strong lawyer adversaries for Chandru And yet, for all these missteps that prevent Jai Bhim from being an unforgettable film, it's still necessary to note that this is an important film that documents, with passion and good intentions, the oppression of a community. It's a film co-produced by a star, who's brave enough to almost slide himself into the background. Yes, he's a saviour in this film, sure, but he is not of the henchmen-beating, heroine-advising, agency-robbing kind, and neither is he the centrepoint of this story. Though he's a saviour, you could argue that he's also a 'victim'... of his good conscience. \"It's the only way I can get a good night's sleep,\" he says, explaining his motivation to represent the vulnerable. If only our society created more such victims\". Chief-editor Harish Wankhede's review in The Hindu suggests that the protagonist is \"an Ambedkarite hero who struggles to protect the life and dignity of the tribal people by adopting democratic and legal apparatuses. Further, the film presents the victim Sanggeni not as a powerless and wretched spectator but as a dignified claimant of equal rights and justice. It equally focuses on her brave struggle against the powerful establishment and promotes her as a parallel protagonist of the story.</p><h4>Accolades</h4><p>The film was made available for screening at the 94th Academy Awards, but failed to get nominated.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Award</th><th scope=\"col\">Date of ceremony</th><th scope=\"col\">Category</th><th scope=\"col\">Recipient(s) and nominee(s)</th><th scope=\"col\">Result</th><th scope=\"col\" class=\"unsortable\"><abbr title=\"Reference(s)\">Ref.</abbr></th></tr><tr><th><span>Huading Awards</span></th><td>1 December 2022</td><td>Best Global Picture</td><td><span>2D Entertainment</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><th rowspan=\"4\"><span>Ananda Vikatan Cinema Awards</span></th><td rowspan=\"4\">December 2022</td><td>Best Film</td><td><span>2D Entertainment</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"4\"></td></tr><tr><td>Best Director</td><td><span>T. J. Gnanavel</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Actor</td><td><span>Suriya</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Actress</td><td><span>Lijomol Jose</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th rowspan=\"2\" scope=\"row\">Critics Choice Film Awards</th><td rowspan=\"2\">March 2022</td><td>Best Film</td><td><i>Jai Bhim</i> – <span>2D Entertainment</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" style=\"text-align:center;\"><br></td></tr><tr><td>Best Actress</td><td><span>Lijomol Jose</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"row\" rowspan=\"6\"><span>Filmfare Awards South</span></th><td rowspan=\"6\"><span>9 October 2022</span></td><td><span>Best Film – Tamil</span></td><td><span>2D Entertainment</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\" rowspan=\"6\"><br></td></tr><tr><td><span>Best Director – Tamil</span></td><td><span data-sort-value=\"Gnanavel !\"><span>T. J. Gnanavel</span></span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Best Actor – Tamil</span></td><td><span data-sort-value=\"Suriya !\"><span>Suriya</span></span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span data-sort-value=\"Manikandan !\"><span>K. Manikandan</span></span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress – Tamil</span></td><td><span data-sort-value=\"Jose !\"><span>Lijomol Jose</span></span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor – Tamil</span></td><td><span data-sort-value=\"Raj !\"><span>Prakash Raj</span></span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th rowspan=\"3\" scope=\"row\">Noida International Film Festival</th><td rowspan=\"3\">23 January 2022</td><td>Best Film</td><td><i>Jai Bhim</i> – <span>2D Entertainment</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"3\" style=\"text-align:center;\"><br></td></tr><tr><td>Best Actor</td><td><span>Suriya</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Actress</td><td><span>Lijomol Jose</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\" rowspan=\"5\"><span>South Indian International Movie Awards</span></th><td rowspan=\"5\"><span>10–11 September 2022</span></td><td><span class=\"mw-redirect\">Best Actor – Tamil</span></td><td><span data-sort-value=\"Suriya !\"><span>Suriya</span></span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\" rowspan=\"5\"></td></tr><tr><td><span class=\"mw-redirect\">Best Actress – Tamil</span></td><td><span data-sort-value=\"Jose !\"><span>Lijomol Jose</span></span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Supporting Actor – Tamil</td><td><span data-sort-value=\"Manikandan !\"><span>K. Manikandan</span></span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Supporting Actress – Tamil</td><td><span data-sort-value=\"Vijayan !\"><span>Rajisha Vijayan</span></span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Cinematographer – Tamil</span></td><td><span data-sort-value=\"Kathir !\"><span>S. R. Kathir</span></span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><br/><h3>Controversies</h3><blockquote>\"Cinema has influenced and been a catalyst for social change on multiple occasions Jai Bhim is also one such creation that is part of efforts to instigate social change Viewing as someone who is against positive change in society or encouraging violence against him, is wrong and sets the wrong example. The best thing to do would be to let an art stand for itself without infringing the creators' artistic freedom. If this trend goes on, filmmakers will have to wait outside the houses of politicians to seek their approval before they could go ahead with a script and shoot a film\".</blockquote><p>– Bharathiraja, president of Tamil Film Active Producers Association</p><p>Jai Bhim attracted opposition by the Vanniyar caste group Vanniyar Sangam (the parent organisation of Pattali Makkal Katchi or PMK), regarding a scene involving the character sub-inspector Gurumoorthy, which the PMK leaders claimed insulted the community. PMK leader Anbumani Ramadoss wrote a letter posing a series of questions about the film and how it defamed the community. In the film, an image of a pot of fire (a symbol of the Vanniyar community) was seen on a wall calendar in the sub-inspector's residence.</p><p>Ramadoss criticised the choice to name the sub-inspector as Gurumoorthy, which he claims defames PMK leader Kaduvetti Guru. While the film used the names of the individuals in the case for their on-screen characters, the sub-inspector's character was not given the analogous individual's name, which was Anthonysamy. Suriya however responded that the film's team did not have any intention of hurting any single individual or a particular community. He also said that \"Through the film, questions have been raised against those in power, it should not be turned into name-politics and diluted.\"</p><p>Amid threats from supporters of the PMK and the Vanniyar Sangam, police protection was given to Suriya's residence in T. Nagar, Chennai. Numerous filmmakers, including Vetrimaaran, Lokesh Kanagaraj, Pa. Ranjith, C. S. Amudhan, Prakash Raj (who appeared in the film), Sathyaraj, and Siddharth, publicly spoke up in favour of Suriya, while associations such as South Indian Film Chamber of Commerce, Tamil Film Active Producers Association, and Nadigar Sangam raised objections to the attacks. The hashtag #WeStandWithSuriya started trending on Twitter, to which Suriya responded by thanking fans for their \"overwhelming support\". Gnanavel apologised on Twitter, saying that he takes responsibility for the controversy and that it was unfair to blame Suriya.</p><p>A scene in the film where Prakash Raj's character Perumalsamy slaps a pawnbroker for speaking in Hindi and tells him to speak in Tamil sparked controversy on social media and was opposed by BJP. Some stated that it promoted anti-Hindi sentiment, while others countered by saying that Perumalsamy slaps the pawnbroker for trying to confuse him and evade questioning by speaking in a language that he does not understand when he can speak in Tamil. Prakash Raj responded to this by saying that \"they did not see the agony of the tribal people, they did not see and feel terrible about the injustice, they saw only the slap. That is all they understood; this exposes their agenda\", but confirmed that the pawnbroker, who knows Tamil, was indeed trying to evade questioning by speaking in Hindi.</p><p>On 11 August 2022, the Madras High Court quashed criminal proceedings against Suriya and Gnanavel for allegedly hurting the sentiment of the Vanniyar community in the film. While the complainant had said that the film intended to incite violence and hostility on a particular community, the court observed that no such instance had been recorded.</p><br/><h3>Social impact</h3><p>Jai Bhim received an overwhelming response from members across the film fraternity, including Kamal Haasan, Siddharth, R. Madhavan, and Sivakarthikeyan, amongst others. Justice K. Chandru, who was closely associated with the film from the story discussions to post-production work had stated in an interview with The Federal, saying that \"the film is not a mere retelling of Sengini's tragic tale, but is more about throwing light on the larger picture of the victimisation of vulnerable communities like the Irula tribe\". M. K. Stalin, the Chief Minister of Tamil Nadu, praised the film saying it had occupied his thoughts all night long. He stated that the core issue of the film reminded him of his own time in prison when arrested in 1976 under MISA (Maintenance of Internal Security Act, 1971) during the emergency period, and that his heart felt very heavy after watching the film. He congratulated Suriya and Gnanavel, and the entire film unit, saying that he wished more such films were made. He complimented Suriya's donation of ₹10 million (US$130,000) to the Pazhangudi Irular Trust for their education. Responding to Stalin's compliments, Suriya said, \"I am running out of words. The compliments of the Chief Minister have fulfilled the intent of Jai Bhim\" and thanked the politician on behalf of the team. Suriya promised to open a fixed deposit of ₹10 lakh in the name of Parvati Ammal. He said, \"The interest accrued for the FD will be handed over to Parvati Ammal every month and it will be ensured that the amount goes to her children after her death\".</p><p>It was IMDb's most popular Indian film of the year. Jai Bhim also became the most-searched film of 2021 in India on Google. It was also fourth in the list of films that were tweeted about most in 2021, according to a report published by Twitter. Several publications including The Indian Express, The News Minute, Hindustan Times, Firstpost, and India Today, listed Jai Bhim as one of the best Tamil films of 2021. According to the social networking site Letterboxd, it was listed in the 15th position of \"highest rated International films of 2021\". A scene from the film was listed on The Oscars' official YouTube channel as a part of the segment \"Scene at the Academy\", with T. J. Gnanavel exploring about the making of the film. Raj Shinde, critic-based at the Indian website ThePrint cited Jai Bhim as one of the examples of how Indian cinema evolved in producing anti-caste films. The screenplay of the film was published as a book and was made available at the Chennai Book Fair of 2023.</p><br/>"
  },
  "errorMessage": ""
}