{
  "imDbId": "tt0434409",
  "title": "V for Vendetta",
  "fullTitle": "V for Vendetta (2005)",
  "type": "Movie",
  "year": "2005",
  "items": [
    {
      "publisher": "Time",
      "author": "Richard Corliss",
      "link": "",
      "rate": "90",
      "content": "It's a terrific movie. I love the look and the verve of the thing, the confidence of its epic design, its smart use of half a dozen noted British thesps, lending weight and wit to the supporting roles."
    },
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "https://www.rollingstone.com/tv-movies/tv-movie-reviews/",
      "rate": "88",
      "content": "The explosive V for Vendetta is powered by ideas that are not computer-generated. It's something rare in Teflon Hollywood: a movie that sticks with you."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "88",
      "content": "V for Vendetta represents 2006's first memorable motion picture - a visually sumptuous concoction that combines political allegory, bloody action, and a few stunning cinematic moments into a solid piece of entertainment."
    },
    {
      "publisher": "Empire",
      "author": "Dan Jolin",
      "link": "",
      "rate": "80",
      "content": "Setting out more to challenge us with its ideas than make us whoop at the action, Vendetta can be clumsy, but there are enough impressive flourishes to make up for its stumblings."
    },
    {
      "publisher": "The A.V. Club",
      "author": "Keith Phipps",
      "link": "https://www.avclub.com/",
      "rate": "75",
      "content": "Mostly, it's content to remain a compelling, visually striking political mystery with some big ideas woven into it--subversive notions about integrity, liberty, and political change."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "",
      "link": "",
      "rate": "70",
      "content": "Viewers expecting a thrill ride might be disappointed. V engages in a couple of satisfying crime-fighting set pieces, but the story is more occupied with mystery and intrigue. Happily, it almost is entirely free of the hollow pomposity that marred the Wachowskis' last two \"Matrix\" films."
    },
    {
      "publisher": "Variety",
      "author": "",
      "link": "",
      "rate": "50",
      "content": "Suffers from many of same problems as last two installments of producers Andy and Larry Wachowski's \"Matrix\" franchise: indigestible dialogue, pacing difficulties and too much pseudo-philosophical info."
    },
    {
      "publisher": "Village Voice",
      "author": "J. Hoberman",
      "link": "",
      "rate": "50",
      "content": "Absorbing even in its incoherence,V for Vendetta manages to make an old popular mythology new. Impossible not to break into a grin: It's the thought that counts."
    },
    {
      "publisher": "Newsweek",
      "author": "",
      "link": "",
      "rate": "40",
      "content": "The movie plays like a clumsy assault on post-9/11 paranoia. It references \"America's war,\" uses imagery direct from Abu Ghraib and contains dialogue likely to offend anyone who's not, say, a suicide bomber."
    },
    {
      "publisher": "The New Yorker",
      "author": "David Denby",
      "link": "https://www.newyorker.com/magazine/the-current-cinema",
      "rate": "30",
      "content": "The quarter-century-old disgruntled fantasies of two English comic-book artists, amplified by a powerful movie company, and ambushed by history, wind up yielding a disastrous muddle."
    }
  ],
  "errorMessage": ""
}