{
  "imDbId": "tt0434409",
  "title": "V for Vendetta",
  "fullTitle": "V for Vendetta (2005)",
  "type": "Movie",
  "year": "2005",
  "language": "en",
  "titleInLanguage": "V for Vendetta (film)",
  "url": "https://en.wikipedia.org/wiki/V_for_Vendetta_(film)",
  "plotShort": {
    "plainText": "V for Vendetta is a 2005 dystopian political action film directed by James McTeigue (in his feature directorial debut) from a screenplay by the Wachowskis. It is based on the 1988 DC Vertigo Comics limited series of the same title by Alan Moore, David Lloyd, and Tony Weare. The film, set in a future where a fascist totalitarian regime has subjugated the UK, centres on V (portrayed by Hugo Weaving), an anarchist and masked freedom-fighter who attempts to ignite a revolution through elaborate terrorist acts, and on Evey Hammond (portrayed by Natalie Portman) a young woman caught up in V's mission. Stephen Rea portrays a detective leading a desperate quest to stop V.\r\nProduced by Silver Pictures, Virtual Studios and Anarchos Productions, Inc., V for Vendetta was originally scheduled for release by Warner Bros. Pictures on 4 November 2005 (a day before the 400th Guy Fawkes Night), but was delayed; it instead opened in the United States on 17 March 2006 to mostly positive reviews from critics and became a box-office success. Alan Moore, dissatisfied with the film adaptations of his other works, From Hell (2001) and The League of Extraordinary Gentlemen (2003), declined to watch the film and asked to not be credited or paid royalties.\r\nSome political groups have seen V for Vendetta as an allegory of oppression by government; anarchists have used it to promote their beliefs. David Lloyd stated: \"The Guy Fawkes mask has now become a common brand and a convenient placard to use in protest against tyranny—and I'm happy with people using it, it seems quite unique, an icon of popular culture being used this way.\"",
    "html": "<p>V for Vendetta is a 2005 dystopian political action film directed by James McTeigue (in his feature directorial debut) from a screenplay by the Wachowskis. It is based on the 1988 DC Vertigo Comics limited series of the same title by Alan Moore, David Lloyd, and Tony Weare. The film, set in a future where a fascist totalitarian regime has subjugated the UK, centres on V (portrayed by Hugo Weaving), an anarchist and masked freedom-fighter who attempts to ignite a revolution through elaborate terrorist acts, and on Evey Hammond (portrayed by Natalie Portman) a young woman caught up in V's mission. Stephen Rea portrays a detective leading a desperate quest to stop V.</p><p>Produced by Silver Pictures, Virtual Studios and Anarchos Productions, Inc., V for Vendetta was originally scheduled for release by Warner Bros. Pictures on 4 November 2005 (a day before the 400th Guy Fawkes Night), but was delayed; it instead opened in the United States on 17 March 2006 to mostly positive reviews from critics and became a box-office success. Alan Moore, dissatisfied with the film adaptations of his other works, From Hell (2001) and The League of Extraordinary Gentlemen (2003), declined to watch the film and asked to not be credited or paid royalties.</p><p>Some political groups have seen V for Vendetta as an allegory of oppression by government; anarchists have used it to promote their beliefs. David Lloyd stated: \"The Guy Fawkes mask has now become a common brand and a convenient placard to use in protest against tyranny—and I'm happy with people using it, it seems quite unique, an icon of popular culture being used this way.\"</p>"
  },
  "plotFull": {
    "plainText": "V for Vendetta is a 2005 dystopian political action film directed by James McTeigue (in his feature directorial debut) from a screenplay by the Wachowskis. It is based on the 1988 DC Vertigo Comics limited series of the same title by Alan Moore, David Lloyd, and Tony Weare. The film, set in a future where a fascist totalitarian regime has subjugated the UK, centres on V (portrayed by Hugo Weaving), an anarchist and masked freedom-fighter who attempts to ignite a revolution through elaborate terrorist acts, and on Evey Hammond (portrayed by Natalie Portman) a young woman caught up in V's mission. Stephen Rea portrays a detective leading a desperate quest to stop V.\r\nProduced by Silver Pictures, Virtual Studios and Anarchos Productions, Inc., V for Vendetta was originally scheduled for release by Warner Bros. Pictures on 4 November 2005 (a day before the 400th Guy Fawkes Night), but was delayed; it instead opened in the United States on 17 March 2006 to mostly positive reviews from critics and became a box-office success. Alan Moore, dissatisfied with the film adaptations of his other works, From Hell (2001) and The League of Extraordinary Gentlemen (2003), declined to watch the film and asked to not be credited or paid royalties.\r\nSome political groups have seen V for Vendetta as an allegory of oppression by government; anarchists have used it to promote their beliefs. David Lloyd stated: \"The Guy Fawkes mask has now become a common brand and a convenient placard to use in protest against tyranny—and I'm happy with people using it, it seems quite unique, an icon of popular culture being used this way.\"\r\nPlot\r\nIn the near future, Britain is ruled by the Norsefire political party, a fascist and authoritarian regime led by High Chancellor Adam Sutler, which controls the populace through propaganda, and imprisons or executes those deemed undesirable, including immigrants, homosexuals, and people of alternative religions.\r\nEvey Hammond is the daughter of parents who became activists after her brother perished in the St Mary's school terrorist attack fourteen years earlier; they were detained when she was 12 years old and later died in prison. One evening, a Guy Fawkes masked vigilante, \"V\", rescues her from assault by the secret police and has her witness his destruction of the Old Bailey via bombs. The following morning, on November 5, V hijacks the state-run television network to address the nation, claiming credit for the attack and encouraging the populace to resist Norsefire by joining him outside the Houses of Parliament on Guy Fawkes Night in one year's time. Evey is knocked unconscious while aiding V's escape, and he takes her with him to avoid her arrest and likely execution.\r\nV kills Norsefire propagandist Lewis Prothero, Dr. Delia Surridge, and, with Evey's assistance, Anthony Lilliman, the Bishop of London. Evey flees after betraying V, hoping to be forgiven by Norsefire. Assigned to capture V, Chief Inspector Eric Finch uses Surridge's journal and information from former covert operative William Rookwood (actually V in disguise), discovering that, two decades earlier, Surridge led biological weapon research and human experimentation at the Larkhill Detention Facility on behalf of Norsefire, creating the \"St Mary's Virus\". Although dozens of political prisoners died during experimentation, an amnesiac in cell \"V\" developed mutated immunities and disfigurements as well as physical enhancements and eventually destroyed Larkhill during his escape. Peter Creedy, head of the secret police, faked a terrorist attack by releasing the virus at targets including St. Mary's and used the resulting public fear to embed Norsefire in power. Simultaneously, the company manufacturing the cure enriched party members such as Prothero and Lilliman.\r\nEvey takes shelter with her former boss, talkshow host Gordon Dietrich, who shows her his collection of illegal materials such as subversive paintings, an antique Quran, and homoerotic photographs. Emboldened by Evey and V, he satirizes Sutler on his show, leading to his and Evey's arrest and his eventual execution. She takes solace in a note hidden in her cell written by Valerie Page, a woman imprisoned in the cell next to V's, detailing her hopes despite her impending death. Tortured and facing her own execution, Evey refuses to submit to her captors and is released, finding herself in V's lair. V had intercepted Evey before Creedy's men and subjected her to false imprisonment so she could learn to live without fear. Although initially angry at V, Evey realizes that he has been avenging Valerie and the other Larkhill victims and promises to return to see him before November 5. To kill the otherwise unreachable High Chancellor, V convinces Creedy to kill Sutler and replace him in exchange for V's surrender.\r\nAs November 5 approaches, V has hundreds of thousands of Guy Fawkes masks distributed across the nation, leading to a rise in masked, anonymous chaos and eventually riots after the secret police kill a young masked girl. V shares a dance with Evey before leading her to the shuttered London underground he restored over the previous decade. Not intending to survive the night, V bequeaths the decision to start the explosive-filled train to Evey. Although she pleads that he abandon his crusade and leave with her, he refuses. Creedy meets V and executes Sutler before demanding V unmask. Despite being shot and heavily injured, V kills Creedy and his men, stating that the idea he represents is more important than his identity. V returns to Evey, dying in her arms after admitting he loves her, and Finch finds her placing V's body aboard the train but allows her to start it after she affirms that the people need hope. With Sutler and Creedy dead, the military forces in London stand down as countless citizens dressed as V descend on Parliament and witness its destruction. Finch asks for V's true identity, to which Evey replies, \"He was all of us\".\r\nCast\r\nNatalie Portman as Evey Hammond, an employee of the state-run British Television Network who is rescued by V from a gang of London's secret police and subsequently becomes involved in his life.\r\nHugo Weaving as V, a masked, charismatic and skilled anarchist terrorist who had been the unwilling subject of experimentation by Norsefire. James Purefoy originally portrayed the character, but left six weeks into filming. He remained uncredited, with Weaving replacing him on set and redubbing Purefoy's scenes.\r\nStephen Rea as Eric Finch, the Chief inspector of New Scotland Yard and Minister of Investigations (the \"Nose\"), is the lead inspector in the V investigation, who, during his investigation, uncovers an unspeakable government crime. When asked whether the politics attracted him to the film, Rea replied \"Well, I don't think it would be very interesting if it was just comic-book stuff. The politics of it are what gives it its dimension and momentum, and of course I was interested in the politics. Why wouldn't I be?\"\r\nStephen Fry as Gordon Deitrich, a closeted gay talk show host. When asked in an interview what he liked about the role, Fry replied \"Being beaten up! I hadn't been beaten up in a movie before and I was very excited by the idea of being clubbed to death.\"\r\nJohn Hurt as Adam Sutler, the former Conservative Member of Parliament and Under-Secretary for Defence. High Chancellor Sutler is the founder of Norsefire and is Britain's authoritarian elected leader. Hurt played a contrary role in another dystopian film: Winston Smith, a victim of the state in the film adaptation of Nineteen Eighty-Four. Hurt also portrays two \"Fake Sutler\" actors lampooning him in an episode of Gordon Deitrich's talk show.\r\nTim Pigott-Smith as Peter Creedy, Norsefire's Party leader and the head of Britain's secret police (the \"Finger\").\r\nRupert Graves as Dominic Stone, Chief Inspector Finch's sergeant.\r\nRoger Allam as Lewis Prothero, the \"Voice of London\", a propagandist for Norsefire, and formerly the Commander of Larkhill concentration camp.\r\nBen Miles as Roger Dascombe, the head of the government's propaganda division (the \"Mouth\") and chief executive of the British Television Network.\r\nSinéad Cusack as Dr Delia Surridge, the former head physician at the Larkhill Detention Centre, now a coroner.\r\nNatasha Wightman as Valerie Page, a lesbian imprisoned for her sexuality. Imogen Poots as Young Valerie Page\r\nImogen Poots as Young Valerie Page\r\nJohn Standing as Anthony Lilliman, a corrupt bishop at Westminster Abbey.\r\nEddie Marsan as Brian Etheridge, the head of the government's audio-surveillance division (the \"Ear\").\r\nClive Ashborn as Guy Fawkes, the historical figure involved in the failed Gunpowder Plot of 1605.\r\nGuy Henry as Conrad Heyer, the head of the government's visual-surveillance division (the \"Eye\").\r\nThemes and interpretations\r\nV for Vendetta sets the Gunpowder Plot as V's historical inspiration, contributing to his choice of timing, language, and appearance. For example, the names Rookwood, Percy and Keyes are used in the film, which are also the names of three of the Gunpowder conspirators. The film creates parallels to Alexandre Dumas's The Count of Monte Cristo, by drawing direct comparisons between V and Edmond Dantès. (In both stories, the hero escapes an unjust and traumatic imprisonment and spends decades preparing to take vengeance on his oppressors under a new persona.) The film is also explicit in portraying V as the embodiment of an idea rather than an individual through V's dialogue and by depicting him without a past, identity or face. According to the official website, \"V's use of the Guy Fawkes mask and persona functions as both practical and symbolic elements of the story. He wears the mask to hide his physical scars, and in obscuring his identity – he becomes the idea itself.\"\r\nAs noted by several critics and commentators, the film's story and style mirror elements from Gaston Leroux's The Phantom of the Opera. V and the Phantom both wear masks to hide their disfigurements, control others through the leverage of their imaginations, have tragic pasts, and are motivated by revenge. V and Evey's relationship also parallels many of the romantic elements of The Phantom of the Opera, where the masked Phantom takes Christine Daaé to his subterranean lair to re-educate her.\r\nAs a film about the struggle between freedom and the state, V for Vendetta takes imagery from many classic totalitarian icons both real and fictional, including the Third Reich and George Orwell's Nineteen Eighty-Four. For example, Adam Sutler primarily appears on large video screens and on portraits in people's homes, both common features among modern totalitarian regimes and reminiscent of the image of Big Brother. There is also the state's use of mass surveillance, such as closed-circuit television, on its citizens – reminiscent of the comprehensive mass surveillance systems currently deployed in many nations, such as China. The name Adam Sutler is intentionally similar to Adolf Hitler. Like the so-called Führer, Sutler is given to hysterical speech. Also like Hitler, Sutler is a racial purist, although Jews have been replaced by Asians and Muslims as the focus of Norsefire ethnoreligious propaganda and persecution. Valerie was sent to a detention facility for her lesbianism and then had medical experiments performed on her, reminiscent of the persecution of homosexuals in Nazi Germany and the Holocaust.\r\nWe felt the novel was very prescient to how the political climate is at the moment. It really showed what can happen when society is ruled by government, rather than the government being run as a voice of the people. I don't think it's such a big leap to say that things like that can happen when leaders stop listening to the people.\r\n—James McTeigue, director\r\nThe filmmakers added topical references relevant to a 2006 audience. According to the Los Angeles Times, \"With a wealth of new, real-life parallels to draw from in the areas of government surveillance, torture, fear mongering and media manipulation, not to mention corporate corruption and religious hypocrisy, you can't really blame the filmmakers for having a field day referencing current events.\" There are also references to an avian flu pandemic, as well as pervasive use of biometric identification and signal-intelligence gathering and analysis by the regime.\r\nFilm critics, political commentators and other members of the media have also noted the film's numerous references to events surrounding the George W. Bush administration in the United States. These include the hoods and sacks worn by the prisoners in Larkhill that have been seen as a reference to the Abu Ghraib torture and prisoner abuse. The Homeland Security Advisory System and rendition are also referenced. One of the forbidden items in Gordon's secret basement is a protest poster with a mixed US–UK flag with a swastika and the title \"Coalition of the Willing, To Power\" which combines the \"Coalition of the Willing\" with Friedrich Nietzsche's concept of will to power.\r\nDespite the America-specific references, the filmmakers have always referred to the film as adding dialogue to a set of issues much broader than the US administration. When James McTeigue was asked whether or not BTN was based on Fox News Channel, McTeigue replied, \"Yes. But not just Fox. Everyone is complicit in this kind of stuff. It could just as well been the Britain's Sky News Channel, also a part of News Corp.\"\r\nProduction\r\nDevelopment\r\nThe film was made by many of the same filmmakers involved in The Matrix series. In 1988, producer Joel Silver acquired the rights to two of Alan Moore's works: V for Vendetta and Watchmen. After the release and relative success of Road House, writer Hilary Henkin was brought on to flesh out the project with an initial draft – one that bears little, if any, relation to the finished product, with the inclusion of overtly satirical and surrealistic elements not present in the graphic novel, as well as the removal of much of the novel's ambiguity, especially in regard to V's identity. The Wachowskis were fans of V for Vendetta and in the mid-1990s, before working on The Matrix, wrote a draft screenplay that closely followed the graphic novel. During the post-production of the second and third The Matrix films, they revisited the screenplay and offered the director's role to James McTeigue. All three were intrigued by the original story's themes and found them to be relevant to the contemporary political landscape. Upon revisiting the screenplay, the Wachowskis set about making revisions to condense and modernise the story, while at the same time attempting to preserve its integrity and themes. James McTeigue cites the film The Battle of Algiers as his principal influence in preparing to film V for Vendetta.\r\nMoore explicitly disassociated himself from the film due to his lack of involvement in its writing or directing, as well as due to a continuing series of disputes over film adaptations of his work. He ended cooperation with his publisher, DC Comics, after its corporate parent, Warner Bros., failed to retract statements about Moore's supposed endorsement of the film. Moore said that the script contained plot holes and that it ran contrary to the theme of his original work, which was to place two political extremes (fascism and anarchism) against one another. He argues his work had been recast as a story about \"current American neoconservatism vs. current American liberalism\". Per his wishes, Moore's name does not appear in the film's closing credits. Co-creator and illustrator David Lloyd supports the film adaptation, commenting that the script is very good but that Moore would only ever be truly happy with a complete book-to-screen adaptation. In 2021, Lloyd revealed that Moore had actually wanted to make V for Vendetta into a movie around the time the comic book was originally being conceived.\r\nCasting\r\nJames Purefoy was originally cast as V, but dropped out after six weeks into filming. Although at the time it was reported this was because of difficulties wearing the mask for the entire film, he later stated that it was really due to creative differences on how V should be portrayed. He was replaced by Hugo Weaving, who had previously worked with Joel Silver and the Wachowskis on The Matrix series.\r\nDirector James McTeigue first met Natalie Portman during the filming of Star Wars: Episode II – Attack of the Clones, on which he worked as assistant director. In preparation for the role, Portman worked with dialect coach Barbara Berkery to speak in a British accent, studied films such as The Weather Underground, and read the autobiography of Menachem Begin. She received top billing for the film. Her role in the film has parallels to her role in Léon: The Professional. According to Portman: \"the relationship between V and Evey has a complication the relationship in that film. There's moments when it's father/daughter. There's moments when it's like lovers, it has moments when it's mentor/student. And many times all at once.\"\r\nFilming\r\nV for Vendetta was filmed in London, England, and in Potsdam, Germany, at Babelsberg Studios. Much of the film was shot on sound stages and indoor sets, with location work done in Berlin for three scenes: the Norsefire rally flashback, Larkhill, and Bishop Lilliman's bedroom. The scenes that took place in the abandoned London Underground were filmed at the disused Aldwych tube station. Filming began in early March 2005 and lasted through early June 2005. V for Vendetta is the final film shot by cinematographer Adrian Biddle, who died of a heart attack on 7 December 2005, 4 days prior to its world debut.\r\nTo film the final scene at Westminster, the area from Trafalgar Square and Whitehall up to Parliament and Big Ben had to be closed for three nights from midnight until 5 am. This was the first time the security-sensitive area (home to 10 Downing Street and the Ministry of Defence) had ever been closed to accommodate filming. Prime Minister (at the time of filming) Tony Blair's son, Euan, worked on the film's production and is said (according to an interview with Stephen Fry) to have helped the filmmakers obtain the unparalleled filming access. This drew criticism of Blair from MP David Davis due to the film's content. However, the filmmakers denied Euan Blair's involvement in the deal, stating that access was acquired through nine months of negotiations with fourteen different government departments and agencies.\r\nPost-production\r\nThe film was designed to have a retrofuturistic look, with heavy use of grey tones to give a dreary, stagnant feel to totalitarian London. The largest set created for the film was the Shadow Gallery, which was made to feel like a cross between a crypt and an undercroft. The Gallery is V's home as well as the place where he stores various artefacts forbidden by the government. Some of the works of art displayed in the gallery include The Arnolfini Portrait by Jan van Eyck, Bacchus and Ariadne by Titian, a Mildred Pierce poster, St. Sebastian by Andrea Mantegna, The Lady of Shalott by John William Waterhouse and statues by Giacometti. One of the major challenges in the film was how to bring V to life from under an expressionless mask. Thus, considerable effort was made to bring together lighting, acting, and Weaving's voice to create the proper mood for the situation. Since the mask muffled Weaving's voice, his entire dialogue was re-recorded in post-production.\r\nMusic and soundtrack\r\nThe V for Vendetta soundtrack was released by Astralwerks Records on 21 March 2006. The original scores from the film's composer, Dario Marianelli, make up most of the tracks on the album. The soundtrack also features three vocals played during the film: \"Cry Me a River\" by Julie London, a cover of The Velvet Underground song \"I Found a Reason\" by Cat Power and \"Bird Gerhl\" by Antony and the Johnsons. As mentioned in the film, these songs are samples of the 872 blacklisted tracks on V's Wurlitzer jukebox that V \"reclaimed\" from the Ministry of Objectionable Materials. The climax of Tchaikovsky's 1812 Overture appears at the end of the track \"Knives and Bullets (and Cannons too)\". The Overture's finale is played at key parts at the beginning and end of the film.\r\nThree songs were played during the ending credits which were not included on the V for Vendetta soundtrack. The first was \"Street Fighting Man\" by the Rolling Stones. The second was a special version of Ethan Stoller's \"BKAB\". In keeping with revolutionary tone of the film, excerpts from \"On Black Power\" (also in \"A Declaration of Independence\") by black nationalist leader Malcolm X, and from \"Address to the Women of America\" by feminist writer Gloria Steinem were added to the song. Gloria Steinem can be heard saying: \"This is no simple reform ... It really is a revolution. Sex and race, because they are easy and visible differences, have been the primary ways of organising human beings into superior and inferior groups and into the cheap labour on which this system still depends.\" The final song was \"Out of Sight\" by Spiritualized.\r\nAlso in the film were segments from two of Antonio Carlos Jobim's classic bossa nova songs, \"The Girl From Ipanema\" and \"Quiet Nights of Quiet Stars\". These songs were played during the \"breakfast scenes\" with V and Deitrich and were one of the ways used to tie the two characters together. Beethoven's Symphony No.5 also plays an important role in the film, with the first four notes of the first movement signifying the letter \"V\" in Morse code. Gordon Deitrich's Benny Hill-styled comedy sketch of Chancellor Sutler includes the \"Yakety Sax\" theme. Inspector Finch's alarm clock begins the morning of 4 November with the song \"Long Black Train\" by Richard Hawley, which contains the foreshadowing lyrics \"Ride the long black train ... take me home black train.\"\r\nDifferences between the film and the graphic novel\r\nThe film's story was adapted from Alan Moore and David Lloyd's graphic novel V for Vendetta; this was originally published between 1982 and 1985 in the British comic anthology Warrior, and then reprinted and completed by DC. Moore's comics were later compiled into a graphic novel and published again in the United States under DC's Vertigo imprint and in the United Kingdom under Titan Books.\r\nThere are several fundamental differences between the film and the original source material. Alan Moore's original story was created as a response to British Thatcherism in the early 1980s and was set as a conflict between a fascist state and anarchism, while the film's story was changed by the Wachowskis to fit a modern US political context. Alan Moore, however, charged that, in doing so, the story turned into an American-centric conflict between liberalism and neoconservatism, and abandoned the original anarchist–fascist themes. Moore states that \"here wasn't a mention of anarchy as far as I could see. The fascism had been completely defanged. I mean, I think that any references to racial purity had been excised, whereas actually, fascists are quite big on racial purity.\" Furthermore, in the original story, Moore attempted to maintain moral ambiguity, and not to portray the fascists as caricatures, but as realistic, rounded characters. The time limitations of a film meant that the story had to omit or streamline some of the characters, details, and plotlines from the original story.\r\nMany of the characters from the graphic novel underwent significant changes for the film. V is characterised in the film as a romantic freedom fighter who shows concern over the loss of innocent life. However, in the graphic novel, he is portrayed as ruthless, willing to kill anyone who gets in his way. Evey Hammond's transformation as V's protégée is also much more drastic in the novel than in the film. Gordon, a very minor character in both versions, is also drastically changed. In the novel, Gordon is a small-time criminal who takes Evey into his home after V abandons her on the street. The two share a brief romance before Gordon is killed by a Scottish gang. In the film, however, Gordon is a well-mannered colleague of Evey's, and is later revealed to be gay. He is arrested by Fingermen for broadcasting a political parody on his TV program, and is later executed when a Quran is found in his possession.\r\nRelease\r\nThe film adopts extensive imagery from the 1605 Gunpowder Plot, in which a group of Catholic conspirators plotted to destroy the Houses of Parliament in order to spark a revolution in Great Britain. The film was originally scheduled for release on the weekend of 5 November 2005, the Plot's 400th anniversary, with the tag line \"Remember, remember the 5th of November\", taken from a traditional British rhyme memorialising the event. However, the marketing angle lost much of its value when the release date was pushed back to 17 March 2006. Many have speculated that the delay was caused by the London tube bombing on the 7 July and the failed 21 July bombing. The filmmakers have denied this, saying that the delays were due to the need for more time to finish the visual effects production. V for Vendetta had its first major premiere on 11 December 2005, at Butt-Numb-A-Thon, followed by a premiere on 13 February 2006 at the Berlin Film Festival. It opened for general release on 17 March 2006 in 3,365 cinemas in the United States, the United Kingdom and six other countries.\r\nMarketing\r\nPromotion\r\nThe cast and filmmakers attended several press conferences that allowed them to address issues surrounding the film, including its authenticity, Alan Moore's reaction to it and its intended political message. The film was intended to be a departure from some of Moore's original themes. In the words of Hugo Weaving: \"Alan Moore was writing about something which happened some time ago. It was a response to living in Thatcherite Britain ... This is a response to the world in which we live today. So I think that the film and the graphic novel are two separate entities.\" Regarding the film's controversial political content, the filmmakers have said that the film is intended more to raise questions and add to a dialogue already present in society, rather than provide answers or tell viewers what to think.\r\nBooks\r\nThe original graphic novel by Moore and Lloyd was re-released as a hardback collection in October 2005 to tie into the film's original release date of 5 November 2005. The film renewed interest in Alan Moore's original story, and sales of the original graphic novel rose dramatically in the United States.\r\nA novelisation of the film, written by Steve Moore and based on the Wachowskis' script, was published by Pocket Star on 31 January 2006. Spencer Lamm, who has worked with the Wachowskis, created a \"behind-the-scenes\" book. Titled V for Vendetta: From Script to Film, it was published by Universe on 22 August 2006.\r\nBox office\r\nBy December 2006, V for Vendetta had grossed $134,686,457, of which $70,511,035 was from the United States. The film led the U.S. box office on its opening day, taking in an estimated $8,742,504, and remained the number one film for the remainder of the weekend, taking in an estimated $25,642,340. Its closest rival, Failure to Launch, took in $15,604,892. The film debuted at number one in the Philippines, Singapore, South Korea, Sweden and Taiwan. V for Vendetta also opened in 56 IMAX cinemas in North America, grossing $1.36 million during the opening three days.\r\nDVD sales were successful, selling 1,412,865 DVD units in the first week of release which translated to $27,683,818 in revenue. By the end of 2006, 3,086,073 DVD units had been sold, bringing in slightly more than its production cost with $58,342,597. As of September 2018, the film has grossed over $62 million from DVD and Blu-ray sales in the United States.\r\nThe film was also successful in terms of merchandise sales, with hundreds of thousands of Guy Fawkes masks from the film having been sold every year since the film's release, as of 2011. Time Warner owns the rights to the image and is paid a fee with the sale of each official mask.\r\nHome media\r\nV for Vendetta was released on DVD in the US on 1 August 2006, in three formats: a single-disc wide-screen version, a single-disc full-screen version, and a two-disc wide-screen special edition. The single disc versions contain a short (15:56) behind-the-scenes featurette titled \"Freedom! Forever! Making V for Vendetta\" and the film's theatrical trailer, whereas the two-disc special edition contains three additional documentaries, and several extra features for collectors. On the second disc of the special edition, a short Easter egg clip of Natalie Portman on Saturday Night Live can be viewed by selecting the picture of wings on the second page of the menu. The film has also been released on the HD DVD high definition format, which features a unique 'in-film experience' created exclusively for the disc.\r\nIts Blu-ray edition was a top seller in the United States in late May 2008. It released on 4K Ultra HD Blu-Ray in October 2020.\r\nReception\r\nCritical response\r\nOn review aggregator Rotten Tomatoes, the film holds a 73% approval rating based on 258 reviews, with an average rating of 6.80/10. The website's critics consensus reads, \"Visually stunning and thought-provoking, V For Vendetta's political pronouncements may rile some, but its story and impressive set pieces will nevertheless entertain.\" Metacritic, which uses a weighted average, assigned the film a score of 62 out of 100 based on 39 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale.\r\nEbert and Roeper gave the film a \"two thumbs up\" rating. Roger Ebert stated that V for Vendetta \"almost always has something going on that is actually interesting, inviting us to decode the character and plot and apply the message where we will\". Margaret Pomeranz and David Stratton from At the Movies stated that despite the problem of never seeing Weaving's face, there was good acting and an interesting plot, adding that the film is also disturbing, with scenes reminiscent of Nazi Germany.\r\nJonathan Ross from the BBC blasted the film, calling it a \"woeful, depressing failure\" and stating that the \"cast of notable and familiar talents such as John Hurt and Stephen Rea stand little chance amid the wreckage of the Wachowski siblings' dismal script and its particularly poor dialogue.\" Sean Burns of Philadelphia Weekly gave the film a 'D', criticising the film's treatment of its political message as being \"fairly dim, adolescent stuff,\" as well as expressing dislike for the \"barely decorated sets with television-standard overlit shadow-free cinematography by the late Adrian Biddle. The film is a visual insult.\" On Alan Moore removing his name from the project, Burns says \"it's not hard to see why,\" as well as criticising Portman's performance: \"Portman still seems to believe that standing around with your mouth hanging open constitutes a performance.\"\r\nHarry Guerin from the Irish TV network RTÉ states the film \"works as a political thriller, adventure and social commentary and it deserves to be seen by audiences who would otherwise avoid any/all of the three\". He added that the film will become \"a cult favourite whose reputation will only be enhanced with age.\" Andy Jacobs for the BBC gave the film two stars out of five, remarking that it is \"a bit of a mess ... it rarely thrills or engages as a story.\"\r\nV for Vendetta received few awards, although at the 2007 Saturn Awards Natalie Portman won the Best Actress award. The film was nominated for the Hugo Award for Best Dramatic Presentation, Long Form in 2007. V was included on Fandomania's list of The 100 Greatest Fictional Characters. Empire magazine named the film the 418th greatest movie of all time in 2008.\r\nPolitical response\r\nV for Vendetta deals with issues of totalitarianism, homosexuality, Islamophobia and terrorism. Its controversial story line and themes have been the target of both criticism and praise from sociopolitical groups.\r\nOn 17 April 2006, the New York Metro Alliance of Anarchists organised a protest against DC Comics and Time Warner, accusing it of watering down the story's original message in favour of violence and special effects. David Graeber, an anarchist scholar and former professor at Yale University, was not upset by the film. \"I thought the message of anarchy got out in spite of Hollywood.\" However, Graeber went on to state: \"Anarchy is about creating communities and democratic decision making. That's what is absent from Hollywood's interpretation.\"\r\nFilm critic Richard Roeper dismissed right-wing Christian criticism of the film on the television show Ebert and Roeper, saying that V's \"terrorist\" label is applied in the film \"by someone who's essentially Hitler, a dictator.\"\r\nLGBT commentators have praised the film for its positive depiction of gay people. Sarah Warn of AfterEllen called the film \"one of the most pro-gay ever\". Warn went on to praise the central role of the character Valerie \"not just because it is beautifully acted and well-written, but because it is so utterly unexpected.\"\r\nDavid Walsh of the World Socialist Web Site criticised V's actions as \"antidemocratic,\" calling the film an example of \"the bankruptcy of anarcho-terrorist ideology;\" Walsh writes that because the people have not played any part in the revolution, they will be unable to produce a \"new, liberated society.\"\r\nThe film was broadcast on China's national TV station, China Central Television (CCTV) on 16 December 2012 completely uncensored, surprising many viewers. While many believed that the government had banned the film, the State Administration of Radio, Film and Television stated that it was not aware of a ban; CCTV makes its own decisions on whether to censor foreign films. Liu Shanying, a political scientist at the Chinese Academy of Social Sciences who used to work for CCTV, speculated that the showing indicated that Chinese film censorship is getting loosened.",
    "html": "<p>V for Vendetta is a 2005 dystopian political action film directed by James McTeigue (in his feature directorial debut) from a screenplay by the Wachowskis. It is based on the 1988 DC Vertigo Comics limited series of the same title by Alan Moore, David Lloyd, and Tony Weare. The film, set in a future where a fascist totalitarian regime has subjugated the UK, centres on V (portrayed by Hugo Weaving), an anarchist and masked freedom-fighter who attempts to ignite a revolution through elaborate terrorist acts, and on Evey Hammond (portrayed by Natalie Portman) a young woman caught up in V's mission. Stephen Rea portrays a detective leading a desperate quest to stop V.</p><p>Produced by Silver Pictures, Virtual Studios and Anarchos Productions, Inc., V for Vendetta was originally scheduled for release by Warner Bros. Pictures on 4 November 2005 (a day before the 400th Guy Fawkes Night), but was delayed; it instead opened in the United States on 17 March 2006 to mostly positive reviews from critics and became a box-office success. Alan Moore, dissatisfied with the film adaptations of his other works, From Hell (2001) and The League of Extraordinary Gentlemen (2003), declined to watch the film and asked to not be credited or paid royalties.</p><p>Some political groups have seen V for Vendetta as an allegory of oppression by government; anarchists have used it to promote their beliefs. David Lloyd stated: \"The Guy Fawkes mask has now become a common brand and a convenient placard to use in protest against tyranny—and I'm happy with people using it, it seems quite unique, an icon of popular culture being used this way.\"</p><br/><h3>Plot</h3><p>In the near future, Britain is ruled by the Norsefire political party, a fascist and authoritarian regime led by High Chancellor Adam Sutler, which controls the populace through propaganda, and imprisons or executes those deemed undesirable, including immigrants, homosexuals, and people of alternative religions.</p><p>Evey Hammond is the daughter of parents who became activists after her brother perished in the St Mary's school terrorist attack fourteen years earlier; they were detained when she was 12 years old and later died in prison. One evening, a Guy Fawkes masked vigilante, \"V\", rescues her from assault by the secret police and has her witness his destruction of the Old Bailey via bombs. The following morning, on November 5, V hijacks the state-run television network to address the nation, claiming credit for the attack and encouraging the populace to resist Norsefire by joining him outside the Houses of Parliament on Guy Fawkes Night in one year's time. Evey is knocked unconscious while aiding V's escape, and he takes her with him to avoid her arrest and likely execution.</p><p>V kills Norsefire propagandist Lewis Prothero, Dr. Delia Surridge, and, with Evey's assistance, Anthony Lilliman, the Bishop of London. Evey flees after betraying V, hoping to be forgiven by Norsefire. Assigned to capture V, Chief Inspector Eric Finch uses Surridge's journal and information from former covert operative William Rookwood (actually V in disguise), discovering that, two decades earlier, Surridge led biological weapon research and human experimentation at the Larkhill Detention Facility on behalf of Norsefire, creating the \"St Mary's Virus\". Although dozens of political prisoners died during experimentation, an amnesiac in cell \"V\" developed mutated immunities and disfigurements as well as physical enhancements and eventually destroyed Larkhill during his escape. Peter Creedy, head of the secret police, faked a terrorist attack by releasing the virus at targets including St. Mary's and used the resulting public fear to embed Norsefire in power. Simultaneously, the company manufacturing the cure enriched party members such as Prothero and Lilliman.</p><p>Evey takes shelter with her former boss, talkshow host Gordon Dietrich, who shows her his collection of illegal materials such as subversive paintings, an antique Quran, and homoerotic photographs. Emboldened by Evey and V, he satirizes Sutler on his show, leading to his and Evey's arrest and his eventual execution. She takes solace in a note hidden in her cell written by Valerie Page, a woman imprisoned in the cell next to V's, detailing her hopes despite her impending death. Tortured and facing her own execution, Evey refuses to submit to her captors and is released, finding herself in V's lair. V had intercepted Evey before Creedy's men and subjected her to false imprisonment so she could learn to live without fear. Although initially angry at V, Evey realizes that he has been avenging Valerie and the other Larkhill victims and promises to return to see him before November 5. To kill the otherwise unreachable High Chancellor, V convinces Creedy to kill Sutler and replace him in exchange for V's surrender.</p><p>As November 5 approaches, V has hundreds of thousands of Guy Fawkes masks distributed across the nation, leading to a rise in masked, anonymous chaos and eventually riots after the secret police kill a young masked girl. V shares a dance with Evey before leading her to the shuttered London underground he restored over the previous decade. Not intending to survive the night, V bequeaths the decision to start the explosive-filled train to Evey. Although she pleads that he abandon his crusade and leave with her, he refuses. Creedy meets V and executes Sutler before demanding V unmask. Despite being shot and heavily injured, V kills Creedy and his men, stating that the idea he represents is more important than his identity. V returns to Evey, dying in her arms after admitting he loves her, and Finch finds her placing V's body aboard the train but allows her to start it after she affirms that the people need hope. With Sutler and Creedy dead, the military forces in London stand down as countless citizens dressed as V descend on Parliament and witness its destruction. Finch asks for V's true identity, to which Evey replies, \"He was all of us\".</p><br/><h3>Cast</h3><ul><li>Natalie Portman as Evey Hammond, an employee of the state-run British Television Network who is rescued by V from a gang of London's secret police and subsequently becomes involved in his life.</li><li>Hugo Weaving as V, a masked, charismatic and skilled anarchist terrorist who had been the unwilling subject of experimentation by Norsefire. James Purefoy originally portrayed the character, but left six weeks into filming. He remained uncredited, with Weaving replacing him on set and redubbing Purefoy's scenes.</li><li>Stephen Rea as Eric Finch, the Chief inspector of New Scotland Yard and Minister of Investigations (the \"Nose\"), is the lead inspector in the V investigation, who, during his investigation, uncovers an unspeakable government crime. When asked whether the politics attracted him to the film, Rea replied \"Well, I don't think it would be very interesting if it was just comic-book stuff. The politics of it are what gives it its dimension and momentum, and of course I was interested in the politics. Why wouldn't I be?\"</li><li>Stephen Fry as Gordon Deitrich, a closeted gay talk show host. When asked in an interview what he liked about the role, Fry replied \"Being beaten up! I hadn't been beaten up in a movie before and I was very excited by the idea of being clubbed to death.\"</li><li>John Hurt as Adam Sutler, the former Conservative Member of Parliament and Under-Secretary for Defence. High Chancellor Sutler is the founder of Norsefire and is Britain's authoritarian elected leader. Hurt played a contrary role in another dystopian film: Winston Smith, a victim of the state in the film adaptation of Nineteen Eighty-Four. Hurt also portrays two \"Fake Sutler\" actors lampooning him in an episode of Gordon Deitrich's talk show.</li><li>Tim Pigott-Smith as Peter Creedy, Norsefire's Party leader and the head of Britain's secret police (the \"Finger\").</li><li>Rupert Graves as Dominic Stone, Chief Inspector Finch's sergeant.</li><li>Roger Allam as Lewis Prothero, the \"Voice of London\", a propagandist for Norsefire, and formerly the Commander of Larkhill concentration camp.</li><li>Ben Miles as Roger Dascombe, the head of the government's propaganda division (the \"Mouth\") and chief executive of the British Television Network.</li><li>Sinéad Cusack as Dr Delia Surridge, the former head physician at the Larkhill Detention Centre, now a coroner.</li><li>Natasha Wightman as Valerie Page, a lesbian imprisoned for her sexuality. Imogen Poots as Young Valerie Page</li><li>Imogen Poots as Young Valerie Page</li><li>John Standing as Anthony Lilliman, a corrupt bishop at Westminster Abbey.</li><li>Eddie Marsan as Brian Etheridge, the head of the government's audio-surveillance division (the \"Ear\").</li><li>Clive Ashborn as Guy Fawkes, the historical figure involved in the failed Gunpowder Plot of 1605.</li><li>Guy Henry as Conrad Heyer, the head of the government's visual-surveillance division (the \"Eye\").</li></ul><br/><h3>Themes and interpretations</h3><p>V for Vendetta sets the Gunpowder Plot as V's historical inspiration, contributing to his choice of timing, language, and appearance. For example, the names Rookwood, Percy and Keyes are used in the film, which are also the names of three of the Gunpowder conspirators. The film creates parallels to Alexandre Dumas's The Count of Monte Cristo, by drawing direct comparisons between V and Edmond Dantès. (In both stories, the hero escapes an unjust and traumatic imprisonment and spends decades preparing to take vengeance on his oppressors under a new persona.) The film is also explicit in portraying V as the embodiment of an idea rather than an individual through V's dialogue and by depicting him without a past, identity or face. According to the official website, \"V's use of the Guy Fawkes mask and persona functions as both practical and symbolic elements of the story. He wears the mask to hide his physical scars, and in obscuring his identity – he becomes the idea itself.\"</p><p>As noted by several critics and commentators, the film's story and style mirror elements from Gaston Leroux's The Phantom of the Opera. V and the Phantom both wear masks to hide their disfigurements, control others through the leverage of their imaginations, have tragic pasts, and are motivated by revenge. V and Evey's relationship also parallels many of the romantic elements of The Phantom of the Opera, where the masked Phantom takes Christine Daaé to his subterranean lair to re-educate her.</p><p>As a film about the struggle between freedom and the state, V for Vendetta takes imagery from many classic totalitarian icons both real and fictional, including the Third Reich and George Orwell's Nineteen Eighty-Four. For example, Adam Sutler primarily appears on large video screens and on portraits in people's homes, both common features among modern totalitarian regimes and reminiscent of the image of Big Brother. There is also the state's use of mass surveillance, such as closed-circuit television, on its citizens – reminiscent of the comprehensive mass surveillance systems currently deployed in many nations, such as China. The name Adam Sutler is intentionally similar to Adolf Hitler. Like the so-called Führer, Sutler is given to hysterical speech. Also like Hitler, Sutler is a racial purist, although Jews have been replaced by Asians and Muslims as the focus of Norsefire ethnoreligious propaganda and persecution. Valerie was sent to a detention facility for her lesbianism and then had medical experiments performed on her, reminiscent of the persecution of homosexuals in Nazi Germany and the Holocaust.</p><blockquote>We felt the novel was very prescient to how the political climate is at the moment. It really showed what can happen when society is ruled by government, rather than the government being run as a voice of the people. I don't think it's such a big leap to say that things like that can happen when leaders stop listening to the people.</blockquote><p>—James McTeigue, director</p><p>The filmmakers added topical references relevant to a 2006 audience. According to the Los Angeles Times, \"With a wealth of new, real-life parallels to draw from in the areas of government surveillance, torture, fear mongering and media manipulation, not to mention corporate corruption and religious hypocrisy, you can't really blame the filmmakers for having a field day referencing current events.\" There are also references to an avian flu pandemic, as well as pervasive use of biometric identification and signal-intelligence gathering and analysis by the regime.</p><p>Film critics, political commentators and other members of the media have also noted the film's numerous references to events surrounding the George W. Bush administration in the United States. These include the hoods and sacks worn by the prisoners in Larkhill that have been seen as a reference to the Abu Ghraib torture and prisoner abuse. The Homeland Security Advisory System and rendition are also referenced. One of the forbidden items in Gordon's secret basement is a protest poster with a mixed US–UK flag with a swastika and the title \"Coalition of the Willing, To Power\" which combines the \"Coalition of the Willing\" with Friedrich Nietzsche's concept of will to power.</p><p>Despite the America-specific references, the filmmakers have always referred to the film as adding dialogue to a set of issues much broader than the US administration. When James McTeigue was asked whether or not BTN was based on Fox News Channel, McTeigue replied, \"Yes. But not just Fox. Everyone is complicit in this kind of stuff. It could just as well been the Britain's Sky News Channel, also a part of News Corp.\"</p><br/><h3>Production</h3><h4>Development</h4><p>The film was made by many of the same filmmakers involved in The Matrix series. In 1988, producer Joel Silver acquired the rights to two of Alan Moore's works: V for Vendetta and Watchmen. After the release and relative success of Road House, writer Hilary Henkin was brought on to flesh out the project with an initial draft – one that bears little, if any, relation to the finished product, with the inclusion of overtly satirical and surrealistic elements not present in the graphic novel, as well as the removal of much of the novel's ambiguity, especially in regard to V's identity. The Wachowskis were fans of V for Vendetta and in the mid-1990s, before working on The Matrix, wrote a draft screenplay that closely followed the graphic novel. During the post-production of the second and third The Matrix films, they revisited the screenplay and offered the director's role to James McTeigue. All three were intrigued by the original story's themes and found them to be relevant to the contemporary political landscape. Upon revisiting the screenplay, the Wachowskis set about making revisions to condense and modernise the story, while at the same time attempting to preserve its integrity and themes. James McTeigue cites the film The Battle of Algiers as his principal influence in preparing to film V for Vendetta.</p><p>Moore explicitly disassociated himself from the film due to his lack of involvement in its writing or directing, as well as due to a continuing series of disputes over film adaptations of his work. He ended cooperation with his publisher, DC Comics, after its corporate parent, Warner Bros., failed to retract statements about Moore's supposed endorsement of the film. Moore said that the script contained plot holes and that it ran contrary to the theme of his original work, which was to place two political extremes (fascism and anarchism) against one another. He argues his work had been recast as a story about \"current American neoconservatism vs. current American liberalism\". Per his wishes, Moore's name does not appear in the film's closing credits. Co-creator and illustrator David Lloyd supports the film adaptation, commenting that the script is very good but that Moore would only ever be truly happy with a complete book-to-screen adaptation. In 2021, Lloyd revealed that Moore had actually wanted to make V for Vendetta into a movie around the time the comic book was originally being conceived.</p><h4>Casting</h4><p>James Purefoy was originally cast as V, but dropped out after six weeks into filming. Although at the time it was reported this was because of difficulties wearing the mask for the entire film, he later stated that it was really due to creative differences on how V should be portrayed. He was replaced by Hugo Weaving, who had previously worked with Joel Silver and the Wachowskis on The Matrix series.</p><p>Director James McTeigue first met Natalie Portman during the filming of Star Wars: Episode II – Attack of the Clones, on which he worked as assistant director. In preparation for the role, Portman worked with dialect coach Barbara Berkery to speak in a British accent, studied films such as The Weather Underground, and read the autobiography of Menachem Begin. She received top billing for the film. Her role in the film has parallels to her role in Léon: The Professional. According to Portman: \"the relationship between V and Evey has a complication the relationship in that film. There's moments when it's father/daughter. There's moments when it's like lovers, it has moments when it's mentor/student. And many times all at once.\"</p><h4>Filming</h4><p>V for Vendetta was filmed in London, England, and in Potsdam, Germany, at Babelsberg Studios. Much of the film was shot on sound stages and indoor sets, with location work done in Berlin for three scenes: the Norsefire rally flashback, Larkhill, and Bishop Lilliman's bedroom. The scenes that took place in the abandoned London Underground were filmed at the disused Aldwych tube station. Filming began in early March 2005 and lasted through early June 2005. V for Vendetta is the final film shot by cinematographer Adrian Biddle, who died of a heart attack on 7 December 2005, 4 days prior to its world debut.</p><p>To film the final scene at Westminster, the area from Trafalgar Square and Whitehall up to Parliament and Big Ben had to be closed for three nights from midnight until 5 am. This was the first time the security-sensitive area (home to 10 Downing Street and the Ministry of Defence) had ever been closed to accommodate filming. Prime Minister (at the time of filming) Tony Blair's son, Euan, worked on the film's production and is said (according to an interview with Stephen Fry) to have helped the filmmakers obtain the unparalleled filming access. This drew criticism of Blair from MP David Davis due to the film's content. However, the filmmakers denied Euan Blair's involvement in the deal, stating that access was acquired through nine months of negotiations with fourteen different government departments and agencies.</p><h4>Post-production</h4><p>The film was designed to have a retrofuturistic look, with heavy use of grey tones to give a dreary, stagnant feel to totalitarian London. The largest set created for the film was the Shadow Gallery, which was made to feel like a cross between a crypt and an undercroft. The Gallery is V's home as well as the place where he stores various artefacts forbidden by the government. Some of the works of art displayed in the gallery include The Arnolfini Portrait by Jan van Eyck, Bacchus and Ariadne by Titian, a Mildred Pierce poster, St. Sebastian by Andrea Mantegna, The Lady of Shalott by John William Waterhouse and statues by Giacometti. One of the major challenges in the film was how to bring V to life from under an expressionless mask. Thus, considerable effort was made to bring together lighting, acting, and Weaving's voice to create the proper mood for the situation. Since the mask muffled Weaving's voice, his entire dialogue was re-recorded in post-production.</p><h4>Music and soundtrack</h4><p>The V for Vendetta soundtrack was released by Astralwerks Records on 21 March 2006. The original scores from the film's composer, Dario Marianelli, make up most of the tracks on the album. The soundtrack also features three vocals played during the film: \"Cry Me a River\" by Julie London, a cover of The Velvet Underground song \"I Found a Reason\" by Cat Power and \"Bird Gerhl\" by Antony and the Johnsons. As mentioned in the film, these songs are samples of the 872 blacklisted tracks on V's Wurlitzer jukebox that V \"reclaimed\" from the Ministry of Objectionable Materials. The climax of Tchaikovsky's 1812 Overture appears at the end of the track \"Knives and Bullets (and Cannons too)\". The Overture's finale is played at key parts at the beginning and end of the film.</p><p>Three songs were played during the ending credits which were not included on the V for Vendetta soundtrack. The first was \"Street Fighting Man\" by the Rolling Stones. The second was a special version of Ethan Stoller's \"BKAB\". In keeping with revolutionary tone of the film, excerpts from \"On Black Power\" (also in \"A Declaration of Independence\") by black nationalist leader Malcolm X, and from \"Address to the Women of America\" by feminist writer Gloria Steinem were added to the song. Gloria Steinem can be heard saying: \"This is no simple reform ... It really is a revolution. Sex and race, because they are easy and visible differences, have been the primary ways of organising human beings into superior and inferior groups and into the cheap labour on which this system still depends.\" The final song was \"Out of Sight\" by Spiritualized.</p><p>Also in the film were segments from two of Antonio Carlos Jobim's classic bossa nova songs, \"The Girl From Ipanema\" and \"Quiet Nights of Quiet Stars\". These songs were played during the \"breakfast scenes\" with V and Deitrich and were one of the ways used to tie the two characters together. Beethoven's Symphony No.5 also plays an important role in the film, with the first four notes of the first movement signifying the letter \"V\" in Morse code. Gordon Deitrich's Benny Hill-styled comedy sketch of Chancellor Sutler includes the \"Yakety Sax\" theme. Inspector Finch's alarm clock begins the morning of 4 November with the song \"Long Black Train\" by Richard Hawley, which contains the foreshadowing lyrics \"Ride the long black train ... take me home black train.\"</p><br/><h3>Differences between the film and the graphic novel</h3><p>The film's story was adapted from Alan Moore and David Lloyd's graphic novel V for Vendetta; this was originally published between 1982 and 1985 in the British comic anthology Warrior, and then reprinted and completed by DC. Moore's comics were later compiled into a graphic novel and published again in the United States under DC's Vertigo imprint and in the United Kingdom under Titan Books.</p><p>There are several fundamental differences between the film and the original source material. Alan Moore's original story was created as a response to British Thatcherism in the early 1980s and was set as a conflict between a fascist state and anarchism, while the film's story was changed by the Wachowskis to fit a modern US political context. Alan Moore, however, charged that, in doing so, the story turned into an American-centric conflict between liberalism and neoconservatism, and abandoned the original anarchist–fascist themes. Moore states that \"here wasn't a mention of anarchy as far as I could see. The fascism had been completely defanged. I mean, I think that any references to racial purity had been excised, whereas actually, fascists are quite big on racial purity.\" Furthermore, in the original story, Moore attempted to maintain moral ambiguity, and not to portray the fascists as caricatures, but as realistic, rounded characters. The time limitations of a film meant that the story had to omit or streamline some of the characters, details, and plotlines from the original story.</p><p>Many of the characters from the graphic novel underwent significant changes for the film. V is characterised in the film as a romantic freedom fighter who shows concern over the loss of innocent life. However, in the graphic novel, he is portrayed as ruthless, willing to kill anyone who gets in his way. Evey Hammond's transformation as V's protégée is also much more drastic in the novel than in the film. Gordon, a very minor character in both versions, is also drastically changed. In the novel, Gordon is a small-time criminal who takes Evey into his home after V abandons her on the street. The two share a brief romance before Gordon is killed by a Scottish gang. In the film, however, Gordon is a well-mannered colleague of Evey's, and is later revealed to be gay. He is arrested by Fingermen for broadcasting a political parody on his TV program, and is later executed when a Quran is found in his possession.</p><br/><h3>Release</h3><p>The film adopts extensive imagery from the 1605 Gunpowder Plot, in which a group of Catholic conspirators plotted to destroy the Houses of Parliament in order to spark a revolution in Great Britain. The film was originally scheduled for release on the weekend of 5 November 2005, the Plot's 400th anniversary, with the tag line \"Remember, remember the 5th of November\", taken from a traditional British rhyme memorialising the event. However, the marketing angle lost much of its value when the release date was pushed back to 17 March 2006. Many have speculated that the delay was caused by the London tube bombing on the 7 July and the failed 21 July bombing. The filmmakers have denied this, saying that the delays were due to the need for more time to finish the visual effects production. V for Vendetta had its first major premiere on 11 December 2005, at Butt-Numb-A-Thon, followed by a premiere on 13 February 2006 at the Berlin Film Festival. It opened for general release on 17 March 2006 in 3,365 cinemas in the United States, the United Kingdom and six other countries.</p><h4>Marketing</h4><h4>Promotion</h4><p>The cast and filmmakers attended several press conferences that allowed them to address issues surrounding the film, including its authenticity, Alan Moore's reaction to it and its intended political message. The film was intended to be a departure from some of Moore's original themes. In the words of Hugo Weaving: \"Alan Moore was writing about something which happened some time ago. It was a response to living in Thatcherite Britain ... This is a response to the world in which we live today. So I think that the film and the graphic novel are two separate entities.\" Regarding the film's controversial political content, the filmmakers have said that the film is intended more to raise questions and add to a dialogue already present in society, rather than provide answers or tell viewers what to think.</p><h4>Books</h4><p>The original graphic novel by Moore and Lloyd was re-released as a hardback collection in October 2005 to tie into the film's original release date of 5 November 2005. The film renewed interest in Alan Moore's original story, and sales of the original graphic novel rose dramatically in the United States.</p><p>A novelisation of the film, written by Steve Moore and based on the Wachowskis' script, was published by Pocket Star on 31 January 2006. Spencer Lamm, who has worked with the Wachowskis, created a \"behind-the-scenes\" book. Titled V for Vendetta: From Script to Film, it was published by Universe on 22 August 2006.</p><h4>Box office</h4><p>By December 2006, V for Vendetta had grossed $134,686,457, of which $70,511,035 was from the United States. The film led the U.S. box office on its opening day, taking in an estimated $8,742,504, and remained the number one film for the remainder of the weekend, taking in an estimated $25,642,340. Its closest rival, Failure to Launch, took in $15,604,892. The film debuted at number one in the Philippines, Singapore, South Korea, Sweden and Taiwan. V for Vendetta also opened in 56 IMAX cinemas in North America, grossing $1.36 million during the opening three days.</p><p>DVD sales were successful, selling 1,412,865 DVD units in the first week of release which translated to $27,683,818 in revenue. By the end of 2006, 3,086,073 DVD units had been sold, bringing in slightly more than its production cost with $58,342,597. As of September 2018, the film has grossed over $62 million from DVD and Blu-ray sales in the United States.</p><p>The film was also successful in terms of merchandise sales, with hundreds of thousands of Guy Fawkes masks from the film having been sold every year since the film's release, as of 2011. Time Warner owns the rights to the image and is paid a fee with the sale of each official mask.</p><h4>Home media</h4><p>V for Vendetta was released on DVD in the US on 1 August 2006, in three formats: a single-disc wide-screen version, a single-disc full-screen version, and a two-disc wide-screen special edition. The single disc versions contain a short (15:56) behind-the-scenes featurette titled \"Freedom! Forever! Making V for Vendetta\" and the film's theatrical trailer, whereas the two-disc special edition contains three additional documentaries, and several extra features for collectors. On the second disc of the special edition, a short Easter egg clip of Natalie Portman on Saturday Night Live can be viewed by selecting the picture of wings on the second page of the menu. The film has also been released on the HD DVD high definition format, which features a unique 'in-film experience' created exclusively for the disc.</p><p>Its Blu-ray edition was a top seller in the United States in late May 2008. It released on 4K Ultra HD Blu-Ray in October 2020.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>On review aggregator Rotten Tomatoes, the film holds a 73% approval rating based on 258 reviews, with an average rating of 6.80/10. The website's critics consensus reads, \"Visually stunning and thought-provoking, V For Vendetta's political pronouncements may rile some, but its story and impressive set pieces will nevertheless entertain.\" Metacritic, which uses a weighted average, assigned the film a score of 62 out of 100 based on 39 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale.</p><p>Ebert and Roeper gave the film a \"two thumbs up\" rating. Roger Ebert stated that V for Vendetta \"almost always has something going on that is actually interesting, inviting us to decode the character and plot and apply the message where we will\". Margaret Pomeranz and David Stratton from At the Movies stated that despite the problem of never seeing Weaving's face, there was good acting and an interesting plot, adding that the film is also disturbing, with scenes reminiscent of Nazi Germany.</p><p>Jonathan Ross from the BBC blasted the film, calling it a \"woeful, depressing failure\" and stating that the \"cast of notable and familiar talents such as John Hurt and Stephen Rea stand little chance amid the wreckage of the Wachowski siblings' dismal script and its particularly poor dialogue.\" Sean Burns of Philadelphia Weekly gave the film a 'D', criticising the film's treatment of its political message as being \"fairly dim, adolescent stuff,\" as well as expressing dislike for the \"barely decorated sets with television-standard overlit shadow-free cinematography by the late Adrian Biddle. The film is a visual insult.\" On Alan Moore removing his name from the project, Burns says \"it's not hard to see why,\" as well as criticising Portman's performance: \"Portman still seems to believe that standing around with your mouth hanging open constitutes a performance.\"</p><p>Harry Guerin from the Irish TV network RTÉ states the film \"works as a political thriller, adventure and social commentary and it deserves to be seen by audiences who would otherwise avoid any/all of the three\". He added that the film will become \"a cult favourite whose reputation will only be enhanced with age.\" Andy Jacobs for the BBC gave the film two stars out of five, remarking that it is \"a bit of a mess ... it rarely thrills or engages as a story.\"</p><p>V for Vendetta received few awards, although at the 2007 Saturn Awards Natalie Portman won the Best Actress award. The film was nominated for the Hugo Award for Best Dramatic Presentation, Long Form in 2007. V was included on Fandomania's list of The 100 Greatest Fictional Characters. Empire magazine named the film the 418th greatest movie of all time in 2008.</p><h4>Political response</h4><p>V for Vendetta deals with issues of totalitarianism, homosexuality, Islamophobia and terrorism. Its controversial story line and themes have been the target of both criticism and praise from sociopolitical groups.</p><p>On 17 April 2006, the New York Metro Alliance of Anarchists organised a protest against DC Comics and Time Warner, accusing it of watering down the story's original message in favour of violence and special effects. David Graeber, an anarchist scholar and former professor at Yale University, was not upset by the film. \"I thought the message of anarchy got out in spite of Hollywood.\" However, Graeber went on to state: \"Anarchy is about creating communities and democratic decision making. That's what is absent from Hollywood's interpretation.\"</p><p>Film critic Richard Roeper dismissed right-wing Christian criticism of the film on the television show Ebert and Roeper, saying that V's \"terrorist\" label is applied in the film \"by someone who's essentially Hitler, a dictator.\"</p><p>LGBT commentators have praised the film for its positive depiction of gay people. Sarah Warn of AfterEllen called the film \"one of the most pro-gay ever\". Warn went on to praise the central role of the character Valerie \"not just because it is beautifully acted and well-written, but because it is so utterly unexpected.\"</p><p>David Walsh of the World Socialist Web Site criticised V's actions as \"antidemocratic,\" calling the film an example of \"the bankruptcy of anarcho-terrorist ideology;\" Walsh writes that because the people have not played any part in the revolution, they will be unable to produce a \"new, liberated society.\"</p><p>The film was broadcast on China's national TV station, China Central Television (CCTV) on 16 December 2012 completely uncensored, surprising many viewers. While many believed that the government had banned the film, the State Administration of Radio, Film and Television stated that it was not aware of a ban; CCTV makes its own decisions on whether to censor foreign films. Liu Shanying, a political scientist at the Chinese Academy of Social Sciences who used to work for CCTV, speculated that the showing indicated that Chinese film censorship is getting loosened.</p><br/>"
  },
  "errorMessage": ""
}