{
  "imDbId": "tt0264464",
  "title": "Catch Me If You Can",
  "fullTitle": "Catch Me If You Can (2002)",
  "type": "Movie",
  "year": "2002",
  "items": [
    {
      "publisher": "The A.V. Club",
      "author": "Nathan Rabin",
      "link": "http://survey-smiles.com/",
      "rate": "100",
      "content": "Part of Spielberg's skill as a filmmaker comes in choosing the right collaborators. Janusz Kaminski's gorgeous cinematography, Michael Kahn's graceful editing, Jeff Nathanson's clever script, and John Williams' score all work well in unison, but the film's masterstroke is the casting of Walken as DiCaprio's utterly decent father."
    },
    {
      "publisher": "Time",
      "author": "Richard Schickel",
      "link": "",
      "rate": "90",
      "content": "Results in about the nicest movie you could ask for at the holidays: a gently funny, sweetly adventurous film that makes you feel genuinely good, that is to say, entirely unconned by false sentiment or sharp, overmanipulative Hollywood practices."
    },
    {
      "publisher": "Boston Globe",
      "author": "Ty Burr",
      "link": "",
      "rate": "88",
      "content": "Nothing if not a celebration of our willingness to be gulled by life's charming strangers."
    },
    {
      "publisher": "Slate",
      "author": "David Edelstein",
      "link": "",
      "rate": "80",
      "content": "Feels more like The Bill Clinton Story than \"Primary Colors\" (1998). It's a paean to naughty boys who dream of potency and become enraptured by their own scams -- a great American archetype."
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Rick Groen",
      "link": "",
      "rate": "75",
      "content": "The movie could have used a further dose of the resonance Walken gives it, and a more intellectually adventurous director might have brought the theme close to home."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Michael Wilmington",
      "link": "",
      "rate": "75",
      "content": "Brilliant performances by DiCaprio as Frank Jr. and Christopher Walken as his fallen father - and an enjoyable one by Tom Hanks."
    },
    {
      "publisher": "Seattle Post-Intelligencer",
      "author": "William Arnold",
      "link": "",
      "rate": "75",
      "content": "DiCaprio could hardly be better. He brings this outrageous character and his demons to life with skill, sympathy and a symphony of small, telling touches."
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "Peter Rainer",
      "link": "",
      "rate": "70",
      "content": "Breezily enjoyable but thin."
    },
    {
      "publisher": "Baltimore Sun",
      "author": "Michael Sragow",
      "link": "https://www.baltimoresun.com/entertainment/movies/bal-to.catchme25dec25,0,4821248.story?coll=bal%2Dartslife%2Dmovies",
      "rate": "63",
      "content": "Spielberg's inchoate attempts at cultural observation stretch the movie out and dilute the giddiness instead of adding a pleasurable spike. When the movie doesn't feel inflated, it feels soggy."
    },
    {
      "publisher": "Salon",
      "author": "Charles Taylor",
      "link": "https://www.salon.com/2002/12/25/catch_me/",
      "rate": "60",
      "content": "Well-enough made and highly watchable, but it lacks the one thing that would put some swing in its step and some swagger in its attitude: a sense of jazz."
    }
  ],
  "errorMessage": ""
}