{
  "imDbId": "tt0103639",
  "title": "Aladdin",
  "fullTitle": "Aladdin (1992)",
  "type": "Movie",
  "year": "1992",
  "items": [
    {
      "publisher": "Empire",
      "author": "Olly Richards",
      "link": "https://www.empireonline.com/movies/reviews/aladdin-review/",
      "rate": "100",
      "content": "The movie that brought a hip new sensibility to animated features and which still stands up in the age of Pixar and DreamWorks thanks largely to a blistering improv turn from Robin Williams."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Kenneth Turan",
      "link": "https://www.latimes.com/archives/la-xpm-1992-11-11-ca-38-story.html",
      "rate": "100",
      "content": "Aladdin is a film of wonders. To see it is to be the smallest child, open-mouthed at the screen's sense of magic, as well as the most knowing adult, eager to laugh at some surprisingly sly humor."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Ty Burr",
      "link": "https://ew.com/article/1992/11/13/aladdin-3/",
      "rate": "100",
      "content": "Despite a similar setting-the never-never land of the Arabian Nights — the new movie is hipper, faster, more topical."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/aladdin",
      "rate": "88",
      "content": "This is a fun motion picture on all levels, and, while it doesn't quite measure up to the standard established by Beauty, it's still one of the year's best bets for pure entertainment."
    },
    {
      "publisher": "Variety",
      "author": "Brian Lowry",
      "link": "https://variety.com/1992/film/reviews/aladdin-2-1200431030/",
      "rate": "80",
      "content": "Floridly beautiful, shamelessly derivative and infused with an irreverent, sophisticated comic flair thanks to Robin Williams' vocal calisthenics, Aladdin probably won't equal its beastly predecessor but should still enjoy a magic carpet ride through the holiday season."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/aladdin-1992",
      "rate": "75",
      "content": "Aladdin is good but not great, with the exception of the Robin Williams sequences, which have a life and energy all their own."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "75",
      "content": "The animation seeks to dazzle, but with a self-consciousness that's relatively new to the Disney studio. The results are fun and fast moving, but far from sublime."
    },
    {
      "publisher": "The New York Times",
      "author": "Janet Maslin",
      "link": "https://www.nytimes.com/1992/11/11/movies/review-film-disney-puts-its-magic-touch-on-aladdin.html",
      "rate": "70",
      "content": "The fundamentals here go beyond first-rate: animation both gorgeous and thoughtful, several wonderful songs and a wealth of funny minor figures on the sidelines, practicing foolproof Disney tricks. Only when it comes to the basics of the story line does Aladdin encounter any difficulties."
    },
    {
      "publisher": "Time Out",
      "author": "",
      "link": "",
      "rate": "70",
      "content": "Visually, it's a treat, a perfect marriage of hi-tech graphics and the traditional Disney virtue of strong characterisation and colour. The script crackles with wit and life. Williams' Genie is matched by Freeman's malevolent Jafar, and by Gottfried as Jafar's wisecracking parrot Iago. The only disappointments are the wet Aladdin and his sweetheart Jasmine and five rather ordinary original songs."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Ed Gonzalez",
      "link": "",
      "rate": "38",
      "content": "Aladdin is ultimately less offensive than patently ridiculous, mostly because its ethnic white noise is really just an excuse for Robin Williams—as a postmodern blabbermouthed genie who grants Aladdin three wishes—to put on the most elaborate, narcissistic circus act in the history of cinema."
    }
  ],
  "errorMessage": ""
}