{
  "imDbId": "tt0103639",
  "title": "Aladdin",
  "fullTitle": "Aladdin (1992)",
  "type": "Movie",
  "year": "1992",
  "items": [
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0302749",
      "warningSpoilers": true,
      "date": "23 November 2003",
      "rate": "10",
      "helpful": "113 out of 125 found this helpful.",
      "title": "I'd put it in with the Disney classics",
      "content": "Aladdin is such an awesome move that still gets me excited to this day, I remember when I was 7 and I saw this in the theater and I just had so much fun. I am such a dork, I still love a lot of the Disney movies that I loved as a kid, but I think the reason that I love Aladdin so much is because this is one of the last Disney movies that was hand drawn animation, the reason I love hand drawn animation is because it feels more personal and that the crew put their heart and soul into it, you can tell by watching it. They got a great cast of voice actors including Scott Weinger from Full House and the always entertaining and hilarious Robin Williams. Robin was just a perfect choice for Genie, he brought a lot of energy to the movie and makes the genie a great character. Who knew that a kid's version of the Arabian Nights tale could be so great? This is a great Disney movie that I guarantee you're going to love.On a dark night, when Jafar attempts to access the Cave of Wonders, a magical cave which holds treasures beyond the wildest belief, above all is a magical oil lamp containing a genie is hidden. He and his talking parrot, Iago, learn that the only one who can enter the Cave of Wonders is the metaphorical \"Diamond in the Rough\". Meanwhile, in the palace of Agrabah, Jasmine, the beautiful teenage daughter of the Sultan, must be married before her upcoming birthday, but she rejects every prince she meets, as she wants to be married for true love and not merely for wealth. Later, Jasmine, frustrated with having her life lived for her climbs over the palace walls, and sees the marketplace for the first time, where she meets the street urchin Aladdin and his monkey, Abu, and the two young people are seen to be falling for each other. Jafar uses a machine to see that the \"diamond in the rough\" is Aladdin. Jafar sends a group of guards to capture Aladdin while Jasmine is still with him. Jasmine tells Jafar to release him, but Jafar lies and tells her he is already dead. Jafar, disguised as an elderly man, releases Aladdin from prison and leads him to the Cave of Wonders. They are told by the tiger-shaped head of the cave to touch nothing but the lamp. Aladdin enters the cave and encounters a magic carpet before finding the lamp. Abu tries to steal a ruby and causes the cave to start collapsing, but the carpet helps them to the entrance. Jafar takes the lamp from them and tries to kill them but Abu takes the lamp back and bites his arm, causing him to knock Abu back into the cave just as it collapses. When Aladdin awakens, Abu gives him the lamp which he had snatched from Jafar. After rubbing it, a genie is unleashed, revealing that he will grant Aladdin three wishes. Aladdin dupes the genie into freeing them from the cave without using up a wish. While contemplating his wishes, Aladdin asks the genie to make him into a prince so he can marry Jasmine. Iago later steals the genie's lamp back and brings it to Jafar, who becomes the genie's new master and uses his first wish to become sultan. Jafar then wishes to become a powerful sorcerer, Jafar then keeps the Sultan, the Genie, and Jasmine as his slaves. Aladdin must figure a way to save all of them and make things right again.Aladdin is just a great movie that I promise you'll love, it has great characters, beautiful animation, and a terrific and catchy soundtrack that you'll be singing all day. This was one of the rare Disney movies that you pretty much loved ALL the characters, even Iago who is voiced by Gilbert Gottfried, the voice is a bit much but he is great as well. I personally love both the carpet and the genie. Who knew that a carpet could have so much personality? I absolutely adore the \"Friend Like Me\" scene, it was incredible to watch and had terrific animation! If for some odd reason you haven't somehow seen this movie, I highly recommend that you do, this will probably go down in your favorites as well.10/10"
    },
    {
      "username": "Boba_Fett1138",
      "userUrl": "https://www.imdb.com/user/ur1416505",
      "reviewLink": "https://www.imdb.com/review/rw0950861",
      "warningSpoilers": false,
      "date": "23 October 2004",
      "rate": "9",
      "helpful": "88 out of 103 found this helpful.",
      "title": "Great songs and a good villain make \"Aladdin\" a Disney classic.",
      "content": "This movie has three elements that are important for an animated Disney movie: Great songs, a good villain and a great sidekick.The songs and music in general are just great and very memorable. Jafar is a great villain mainly because he is voiced by Jonathan Freeman who has got a good and scary voice. But what is maybe the best element of the movie is Robin Williams as the blue genie. The blue genie is like a jokemachine that once it is started can't stop again and keeps you laughing.The story is good and the pace is high. \"Aladdin\" is not too short and it's not too long, it's not too immature and it's not too mature, it's a perfect movie for the entire family with a wonderful love story (even though it's no \"Beauty and the Beast\") and good animations with some good looking early computer effects.9/10"
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1571053",
      "warningSpoilers": false,
      "date": "12 January 2007",
      "rate": "10",
      "helpful": "55 out of 68 found this helpful.",
      "title": "Robin Williams, Great Songs Make This One Of The Best Animated Films Ever",
      "content": "I can think of three quick reasons why this has remained one of the best animated movies ever: 1 - Very good, very catchy songs that still sound good 15 years later; 2 - excellent, colorful visuals; 3 - the unique humor of Robin Williams, who seems to spout a joke-a- second. In fact, you have to pay close attention to hear Williams' lines because they come so fast and furious. Actually, at times they are too fast. You hardly have time to laugh or digest what he just said when another line hits you. Williams' genie character doesn't appear on screen until after the first third of the film is over.Without all those jokes - and the great visuals that go with those gags (things popping up like Saturday morning cartoons), this would just be a routine Disney animated film. Part of the normal Disney fare includes a hero who is a good guy but a liar and a heroine who is the typical wasp-waisted beauty who is rebellious against the rules of the day. The villain is an \"Oil Can Harry\" mustached dastardly employee of the king who desires king-like powers. His scenes, however, are tempered with humor thanks to his New York City-sounding obnoxious parrot, who provides most of the movie's slapstick humor.Maybe the best attribute of this film is simply how fast it moves, meaning it's very, very entertaining."
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw2534639",
      "warningSpoilers": false,
      "date": "19 December 2011",
      "rate": "10",
      "helpful": "24 out of 29 found this helpful.",
      "title": "Forever a favorite of mine ...",
      "content": "I will never forget the first time I watched \"Aladdin\", I was with a group of friends waiting in the airport for the plane that would take us from Orlando to Paris at the time when \"Aladdin\" was the 'big thing' in the USA while some previews of \"The Lion King\" were starting to screen. \"Aladdin\" will forever be associated to that wonderful week I spent in Disneyland, and it's only fitting if the movie is my favorite Disney film, slightly edging-out \"The Jungle Book\".I know I can get all rational in this review, analyzing what makes \"Aladdin\" such an appealing film and using the expected words of 'Disney Renaissance' and a comparison with the glorious Best Picture nominee predecessor. I can also talk about the animation, the music, the extraordinary multi-vocal performance of Robin Williams as Genie but I don't feel like getting rational. I love the film for personal reasons that are essentially due to the excellent timing of this film in its penetration of my pre-adolescent life. \"Aladdin\" took a forever cherished place as one of the last treasures that enriched my childhood even playing a pivotal role in the way I would start enjoying cartoons.\"Kid's day in the USA!\" was the motto of the week that was celebrating the 65th birthday of Mickey Mouse, and for a kid who never traveled outside his country, going to Disneyland was the most unexpected destination, the most extraordinary trip I would never have dared to dream of. This is when I discovered \"Aladdin\", through the 'Prince Ali' fanfare endlessly performed during the parades, through the films' images aired on TV; something was strangely attracting me to the film. And I guess the fact that I knew the story helped a lot: I grew up with a French cartoon from 1969, titled 'Aladin and the Magic Lamp' recorded in an 80's videocassette, a movie I can recite (and sing) by heart, and there was also an obscure Manga 'Aladdin' film we watched at school before the summer holidays.Needless to say I was already familiar with the story, and seeing it translated into Disney language was something I was excited to see. Would they talk about Aladdin's deceased father Mustapha? Would he live with his mother? What kind of roles would Genie play? Well one thing matters apart from these questions: I knew the story and I could understand the film even if I didn't speak English at that time it wouldn't have helped me anyway because the airport was very noisy, so I just sat on my luggage, eating some candies, and I could understand who was who and what was everyone's scheme: obviously, Aladdin wanted to be a prince to marry the princess and Jafar to marry the princess to become the prince, and between them, the Genie would come to fulfill their dreams. So, I saw the film and I loved it.And for one year, before I would see it again, the music of 'Pince Ali' and 'A Whole New World' was the musical remembrance of that magical week in Disney World. And when I saw it again, it took another dimension: I finally understood the subtleties of the stories, I learned all the songs after repetitive viewings, and for months and months, I was transported by the 'Prince Ali' parade and its climactic conclusion and the romantic 'A Whole New World' and its beautiful opening, when Jasmine jumps on the carpet and the zoomed-out Rajah looks smaller and smaller, watching from the balcony. I saw the film so many times during my pre-teen years that I would never forget the first sensations it immersed me into, with an unexpected awkward one.I must confess that Jasmine was one of my first movie crushes and my idea of the ideal woman as a kid, I don't know why but the way she looked during the 'love at first sight moment' hypnotized me and the moment where I always melt occurs in the carpet ride, when Aladdin gives her the apple, when you understand that she understood who the Prince Ali is, there are no words to describe how incredibly sexy she looks at that very moment. The crush didn't last of course, and as I grew older and was disappointed with the 'Return of Jafar' sequel and the TV series, my interest for \"Aladdin\" declined and it was reduced to 'kid's stuff I used to like'.And then 10 years later, as a student, I saw the film again on my computer, eating a pizza, and something magical happened when the 'Whole New World' music started during the closing credits, my heart was inundated by a nostalgic torrent, so immense that I couldn't stop crying because it reminded me of the privileged place the movie occupied once in my heart. The magic was back, and whenever I was spending a good time with friends, we were having fun listening to these old Disney songs, and the clip of 'A Whole New World' was a must-see and how glad I was to discover that I wasn't the only one who 'liked' Jasmine.I feel so concerned by this film and so deeply attached to it, that I don't want to spoil this review with critical or ecstatic reviews, the film is just thrilling, romantic, adventurous, and features certainly the greatest cast of supporting characters without it being the counterpart of a dull hero or heroine, there's not a single minute of the film that seems pointless and wasted and certainly not with a character like Genie. That's the best I could do to rationally 'explain' my love for \"Aladdin\".But maybe because loving a film can also depend on external factors that influence your judgment, in the case of \"Aladdin\", everything contributed to make this my favorite Disney film ... for sentimental reasons yes, but who ever said they were wrong?"
    },
    {
      "username": "aesgaard41",
      "userUrl": "https://www.imdb.com/user/ur0909646",
      "reviewLink": "https://www.imdb.com/review/rw0302713",
      "warningSpoilers": false,
      "date": "5 September 2001",
      "rate": "10",
      "helpful": "88 out of 114 found this helpful.",
      "title": "Vintage Robin Williams",
      "content": "I did not care to see this movie, but I was such a big Robin Williams that I rented it long after it stopped playing in the theaters. From the first few scenes I was spellbound by the voices and the script.I can still mimmick nearly all of the Genie's themes as well as see myself play Aladdin in a live action version of this movie with Paula Abdul as Jasmine and John De Lancie as Jafar. Jasmine in this movie has the same sexual innocence as Ariel the Little Mermaid and Krysta of Fern Gully. The songs are infectious, especially \"Friend Like Me\" and \"A Whole New World.\" The whole movie is one big roller coaster ride augmented by the raucous wit of Robin Williams and his own talent for mimmicry and improvisation. Ten Stars way up!"
    },
    {
      "username": "gazzo-2",
      "userUrl": "https://www.imdb.com/user/ur0447031",
      "reviewLink": "https://www.imdb.com/review/rw0302681",
      "warningSpoilers": false,
      "date": "16 October 1999",
      "rate": "",
      "helpful": "40 out of 51 found this helpful.",
      "title": "great fun",
      "content": "This movie was the biggest film of '92, and it's easy to see why-a lotta fun, as a terrific Robin Williams performance carries it to heights it otherwise would not have gone to. Great animation, fine songs, a decent plot--what is there not to like? I will admit some of the Arab characters seemed to be stereotyped-but no more so than in Mulan or Tarzan or whatever; animation seems to stereotype Everything.A great movie, ***1/2 outta ****, a fave then and now."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2024709",
      "warningSpoilers": false,
      "date": "17 February 2009",
      "rate": "10",
      "helpful": "20 out of 27 found this helpful.",
      "title": "Aladdin is a beautifully constructed film. that is for me one of Disney's best!",
      "content": "Aladdin is a brilliant movie. Sure, it isn't as good as Beauty and the Beast, but I think it is definitely one of my favourite Disney movies. It is beautifully constructed, with some of the best animation sequences of recent times. The music score is just delightful. How can I ever forget the animated sequence to \"A Whole New World?\" Perfect. Jafar is one of Disney's finest villains, voiced with relish by Jonathan Freeman. Unfortunately, like Shere Kahn, he was another Disney villain that was ruined by a DTV sequel. Aladdin and Jasmine's romance is so believable, and while people have said they are bland, they do appeal to you soon enough. And for me Jasmine along with Esmeralda is one of the sexiest female Disney characters. I actually found it hard to tell what was computer animated, whereas there have been some movies that make a mess of that. I want to guess what is computer animated. The best aspect of this movie, is a hilarious performance from Robin Williams as the Genie If he hadn't ad-libbed so many of his lines, the script could have won an Oscar- that said his genie was a perfect match and fitted with the story very well. Some people say the movie starts off slow. But with the songs and animation, that really isn't an issue. The movie also spawned the best DTV sequel, the King of Thieves. 10/10. Bethany Cox"
    },
    {
      "username": "grahamsj3",
      "userUrl": "https://www.imdb.com/user/ur0492558",
      "reviewLink": "https://www.imdb.com/review/rw0302703",
      "warningSpoilers": false,
      "date": "7 February 2001",
      "rate": "7",
      "helpful": "63 out of 85 found this helpful.",
      "title": "Hilarious",
      "content": "I think this is one of the funniest films that Disney has ever done. This is due entirely to Robin William's brilliant voice of the Genie. He is wonderful in this role. I think the animation is pretty fair although I dislike the \"generic\" people that Disney's shop is putting out these days. They all share the same basic facial structure and eyes, so there is not much difference between any of the characters. It's not like Sleepy, Doc and Sneezy, who all looked very different. Still, this is a great and funny film. It is totally clean and not very violent so it is appropriate for every member of the family. Give this one a try and you'll have a great time watching it!"
    },
    {
      "username": "dcldan",
      "userUrl": "https://www.imdb.com/user/ur8406248",
      "reviewLink": "https://www.imdb.com/review/rw1266161",
      "warningSpoilers": false,
      "date": "15 January 2006",
      "rate": "8",
      "helpful": "42 out of 52 found this helpful.",
      "title": "Fantastic!",
      "content": "Magic, adventures, laughs, love... This film has everything mixed, and the result is quite good! The film is about the classic tale of \"Aladdin and the magic lamp\", so the story is well known by everybody. Despite it is for children, the quality of the characters is very good, the story, though predictable and typical, results interesting and, which is more important, it males us to spend a good hour and a half. The songs (typical in Disney) never are boring, and are surprisingly well mixed with images. In addition, action scenes are well ended and most characters are very charismatic. Aladdin is sympathetic form the beginning and most secondary characters are simply perfect. The \"acting\" of the Genius is superb in his strangeness and absurd, and Yafar is well remembered as one of the \"best\" bad ones of the history of cinema. It exhales an immense aura of evilness hardly ever seen in a movie... To sum up, one of the best (maybe the best) Disney film made, which everything to have a nice afternoon with your children or just spending a nice time laughing and remembering when you were a child."
    },
    {
      "username": "Atreyu_II",
      "userUrl": "https://www.imdb.com/user/ur15836141",
      "reviewLink": "https://www.imdb.com/review/rw1699755",
      "warningSpoilers": false,
      "date": "24 July 2007",
      "rate": "8",
      "helpful": "15 out of 18 found this helpful.",
      "title": "A whole new world. A new fantastic point of view...",
      "content": "The 31st animated Disney classic is one of Disney's best known movies. It also takes us to a whole new world, a new fantastic point of view. This one takes place in Saudi Arabia. I've always liked this movie.\"Aladdin\" is very entertaining and great fun. It is hilarious, creative, imaginative and romantic. It isn't a faultless movie, but it's a little difficult not to like it.I'll start by talking about the characters. The blue Genie is, without a doubt, the most amusing, hilarious, imaginative and genial Genie ever created. Robin Williams steals the show as the Genie's voice. With his incredible talent to do voices, he's hilariously awesome and fantastic as the Genie's voice (and also as the voice of the enigmatic merchant that appears at the beginning, who happens to be an interesting character).Iago is the funniest character of this movie, along with the Genie. Nobody better than Gilbert Gottfried to voice the sarcastic parrot. Iago is simply hilarious! He's rude, grumpy, sarcastic, hungry for power, malicious, obnoxious and foul-tempered. He has an irritating voice but in a funny way, as well as a great talent to perfectly mimic other characters's voices. However, deep down inside he has a heart. I also love his hate for crackers. I don't see why does he hates crackers so much, but that also makes him so funny! Besides, a parrot with teeth?? lol!Jafar is a great villain. Although often calm and humorous (for example, he keeps calling \"Prince Abooboo\" to \"Prince Ali\"), he also represents the worst and most ambitious kind of villain and he is one of the most dangerous Disney villains. And he does possess a snake-like tone of voice sometimes.Princess Jasmine, what can I say? Have you ever seen a more beautiful Disney princess? She's just gorgeous! Despite her strong and challenging personality, I like her anyway.The Sultan is a funny dude. The Magic Carpet is lovable, one of my favorite characters from the movie. Aladdin himself is a nice guy, poor but kind-hearted (although dishonest, immature and selfish sometimes).Abu is funny mostly because of his vocal sounds, very Donald Duck-like. The Cave of Wonders is an amazing character. It is a giant tiger's head with an absolutely fantastic and brutal deep-throat voice.\"Aladdin\" is a festival of magic, special effects, bombastic humor and jokes.By the way, I absolutely love the song \"A Whole New World\". The version sung by Aladdin and Jasmine is great, but the original version of Peabo Bryson and Regina Belle is better, deeper and more romantic and classic. It's a very romantic and joyful song, which is always a pleasure to listen. \"Arabian Nights\" is a nice song as well...I'd only wish that \"Aladdin\" hadn't become a victim of its own success. It inspired 2 sequels and several stories with these characters.This should definitely be on Top 250."
    },
    {
      "username": "British_Aussie_chick",
      "userUrl": "https://www.imdb.com/user/ur5301911",
      "reviewLink": "https://www.imdb.com/review/rw1079397",
      "warningSpoilers": false,
      "date": "13 May 2005",
      "rate": "10",
      "helpful": "125 out of 144 found this helpful.",
      "title": "This film is so good!",
      "content": "I grew up watching this film and along with Beauty and the Beast and Cinderella it is one of my favourite Disney films. I love it! Robin Williams is so good in it. He's hilarious. This film isn't just for kids but for the whole family. I think I was about 5 when I first saw it and at 14 I still watch it and so do my parents. I haven't seen the sequels because I heard that Robin Williams wasn't in them and decided that they wouldn't be as good without him. He was made for the part. The songs are amazing. I love singing along to \"A Whole new World\". I'm hoping to get the soundtrack soon. I also love the film because I have the same name as the princess in it! I would definitely recommend it to everyone. You're never too old to watch a classic Disney film."
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5498180",
      "warningSpoilers": false,
      "date": "21 February 2020",
      "rate": "",
      "helpful": "12 out of 16 found this helpful.",
      "title": "My favorite animated movie.",
      "content": "From start to finish, Aladdin is timeless classic! Very funny, very exciting and intense, amazing visuals, and excellent pacing! The story is also amazing, as are the characters. Holy crap do the characters in this movie rock! They all play a very important role in the movie. You have Aladdin and Abu as two fearless adventurers/thieves, Jasmine as one of the best and most charming Disney princesses of all time, Jafar as the highly cunning, intelligent, and awesome sorcerer and one of the best Disney villains of all time, Iago, who has to be the best henchman of any villain in any movie (he and Jafar are the best together), and of course, the Genie. From his design to his style to pretty much everything there is about him, he absolutely steals the show! From the moment he appears during the movie, he is just seems so much like the the star of the movie. Robin Williams as the Genie is one of the best performances in any animated movie. Aladdin is such an awesome movie that I can't give it anything other than 10 out of 10"
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6145021",
      "warningSpoilers": false,
      "date": "3 October 2020",
      "rate": "9",
      "helpful": "13 out of 19 found this helpful.",
      "title": "'Wake up and smell the hummus'...",
      "content": "... or falafel or baba ghanoush, they all smell and taste outstanding, as outstanding as this piece of delicious and delightful Disney animation that gives satisfaction to the most devouring of cinephiles appetites. The cherry on the cake being the unique and brilliant voice of the genie, the voice of a true entertainer and genieus, the voice of the unforgettable, the one and only - Robin Williams. It just so happens to have an endearingly beautiful story as well."
    },
    {
      "username": "mattkratz",
      "userUrl": "https://www.imdb.com/user/ur0812029",
      "reviewLink": "https://www.imdb.com/review/rw0302704",
      "warningSpoilers": false,
      "date": "2 March 2001",
      "rate": "9",
      "helpful": "28 out of 48 found this helpful.",
      "title": "great work, Robin!",
      "content": "Robin Williams is marvelous as the genie. Try to keep up! True, the film gets a little stereotypical and formulaic. But the energy and story will keep you entertained. The usual be yourself message at the end can be found just about anywhere, but I'm sure you won't mind.Half the fun of an animated film is trying to pick out all the actors' voices. Try and catch Williams, Scott Weinger, and Gilbert Gottfried.Another Disney classic!*** out of ****"
    },
    {
      "username": "ironhorse_iv",
      "userUrl": "https://www.imdb.com/user/ur34049683",
      "reviewLink": "https://www.imdb.com/review/rw2885097",
      "warningSpoilers": true,
      "date": "11 October 2013",
      "rate": "8",
      "helpful": "7 out of 10 found this helpful.",
      "title": "Aladdin grant the fan's wishes, by being a great film. A whole new world.",
      "content": "Aladdin is a key piece to the comeback of Disney. Before Aladdin, Disney was still struggling after a long period of fail animated block-busters films. The biggest blow to the company, came in 1981's The Fox and the Hound when long-time animator Don Bluth left Disney, taking 11 Disney animators with him. Disney came back with 1989's Little Mermaid and 1991's Beauty and the Beast, but with the success of Aladdin, Disney spark the era known as the Disney Renaissance, that continue until the early 2000's. These film restore public and critical interest back into Disney. Aladdin was a very controversial choice for a kid's movie when it came out. Aladdin is based on the Arab folktale of Aladdin and the magic lamp. It's still unknown if Aladdin is not actually part or not part of the 1001 Arabian Nights stories. The tale of Aladdin was somewhat violence and had various forms of erotica. The original story had Aladdin, with the help of his magical ring full of Djin, kidnapped Jasmine on her honeymoon. How romantic, a kidnapping movie! Glad, they change the plot somewhat from the original tale. One of the verses of the opening song \"Arabian Nights\" in the film had to be altered following protests from the American-Arab Anti-Discrimination Committee (ADC) due to its violence lyrics about cutting ears. There is also protest raise by another scene where Aladdin is mistaken by critics due to the line, 'Good Kitty, take off' which the critics thought he was saying 'Good teenagers, take off your clothes'. Because of the controversy, Disney replaced the phrase with \"Down, kitty\" on the DVD release. People have also took noticed with the similarities between Aladdin and Richard Williams's film The Thief and the Cobbler AKA The Princess and the Cobbler (1993). Though Aladdin was released prior to The Thief and the Cobbler, The Thief and the Cobbler was started much earlier in the 1960s, so they have been dispute who rip off who even up to today. The film story is about Aladdin (voiced by Scott Weigner) a poor but kind-hearted Agrabah thief who finds himself arrested for thievery. Jafar (voiced by Jonathan Freeman) promise him a reward in return for retrieving the lamp from the Cave of Wonders, a mysterious magical cave. Jafar tries to betray him for the lamp, and Aladdin find himself trapped in the collapsed cave. In the collapsed cave, Aladdin rubs the lamp, unexpectedly unleashing Genie (Voiced by Robin Williams), who reveals he will grant Aladdin three wishes. Seeing this as his way out, Aladdin created a new life as Prince Ali to get closer to the princess Jasmine (voice by Linda Larkin). Jafar starts to question Prince Ali believing him as the poor thief that he betrayed and start to make plans to steal the lamp once and for all. The movie has a great message for the children about being yourself and not allow yourself to be imprisoned. Glad they didn't go with the Greed is good message. The animation is great. Even today, I have to say when the Cave of Wonders, Sand Tiger come alive, it brings chills down my neck. The magic carpet ride through the cave was collapsing was intense. I can't help thinking of those scenes, even now. The music to the film is ground breaking good to hear. Composer Alan Menken and songwriters Howard Ashman and Tim Rice were praised for creating a soundtrack that is amazing. I love 'A Whole New World'. One of the best love songs of the 1990's. It has an amazing melody that complements the scenery very well. I too love how the song speeds up, giving it a very romantic yet magical and adventurous feel to it. The other songs like 'Friends like me', 'Street Rat', 'One Jump Ahead' and 'Prince Ali' also work. I do have to say the 2004, Special Edition released kinda ruin it, by having a new song \"Proud of Your Boy\", performed by Clay Aiken which I thought was mediocre. Now there has been a couple of fan theories that goes with this film, that I like to address like The Merchant is the Genie. Both look very similar, and it seems to make sense because Robin Williams voices both characters. Another variation of this same theory says the man made the whole story up to sell the lamp, so Aladdin wasn't really a true story. The last theory is the most outlandish. Some people think that Aladdin takes place in a Post- Apocalyptic future where technological marvels had been long forgotten and been taking as magic. Some critics even think the Magic Carpet is a time- traveling device. The Genie proves this theory by making impressions of ancient, long-dead celebrities like Groucho Marx, and Jack Nicholson. Still, it can make sense that the Genie is an all-powerful being who can see into the future, so he can make jokes like those, but why would he make jokes that Aladdin wouldn't get. The truth is, Robin Williams was making cultural references jokes to get more people to see the film. Much of Robin Williams' dialogue was ad-libbed and it was estimated that Williams improvised 52 characters for animation to work on. It was no surprised that the film has so many in-jokes impersonality as Robin is known for that at the time. This was a new type of Disney humor that wasn't in much kids movies at the time. Disney would later use this type of humor in other animation films like 2001's Emperor New Groove, and 1997's Hercules. In an odd way, Aladdin also take place in the same period as Hercules, so a crossover was used in later projects. Check out, Disney's first direct-to-video sequel, 1994's The Return of Jafar and the TV Show. 1996's Aladdin and the King of Thieves was OK so check it. Overall: Aladdin is a great nostalgia movie that takes us back to when we were kids. Worth watching."
    },
    {
      "username": "taeweth",
      "userUrl": "https://www.imdb.com/user/ur8837900",
      "reviewLink": "https://www.imdb.com/review/rw1263157",
      "warningSpoilers": false,
      "date": "11 January 2006",
      "rate": "10",
      "helpful": "66 out of 82 found this helpful.",
      "title": "Great movie!",
      "content": "Simply a classic. The movie Aladdin is hilariously told with many many MANY funny moments. The genie his an all-time high in this classic film about a street rat and a princess. A great movie for young kids, but even adults will love the wonderfully amusing lines throughout the story. The songs in the movie are well-known and catchy. I even had a guy since one of them to a girl at a school dance! Everyone recognizes them, and it is our duty to make sure the next generations continues to appreciate such a wonderful work of art.A great movie for the entire family to sit down and watch together, it's good sometimes to take a blast to the past and enjoy some of those good ol' movies."
    },
    {
      "username": "mig28lx",
      "userUrl": "https://www.imdb.com/user/ur0690838",
      "reviewLink": "https://www.imdb.com/review/rw1103893",
      "warningSpoilers": false,
      "date": "15 June 2005",
      "rate": "8",
      "helpful": "83 out of 128 found this helpful.",
      "title": "Random Thoughts on \"Aladdin\"",
      "content": "Just watched this recently, on the new-and-improved DVD which features a restored print, and it looks spectacular. The story is slightly shallower than the best of Disney's films, but this is balanced by the sheer lunacy of Robin Williams' bad, blue Genie. Whoever first thought of putting Robin Williams in a Disney flick should get a Pulitzer, or a Nobel, or something. The comic timing of his riffs combined with the comic timing of the animators transform the Genie from a \"Deus Ex Machina\" into the soul of \"Aladdin.\"I have a tiny issue with the fact that the most recent VHS and DVD prints of the movie have bowed to pressure from activist groups and altered a line in the opening song. The original line was, \"...where they cut if your ear if they don't like your face/It's barbaric, but hey, it's home.\" The revised line reads, \"...where the land is immense and the heat is intense/It's barbaric, but hey, it's home.\" Protesters claimed the original line perpetuated a negative stereotype of Arab countries and peoples. But...but...but marketplaces and cities in Arabian countries still cut the hands off convicted thieves. And there's even a scene in the film which threatens to relieve the princess of an appendage. They're not being negative; they're being accurate. And, oh yeah, IT'S A CARTOON. But that's just my opinion."
    },
    {
      "username": "Lady_Targaryen",
      "userUrl": "https://www.imdb.com/user/ur6643268",
      "reviewLink": "https://www.imdb.com/review/rw1268622",
      "warningSpoilers": true,
      "date": "18 January 2006",
      "rate": "8",
      "helpful": "9 out of 13 found this helpful.",
      "title": "Imagine if you had three wishes....",
      "content": "Aladdin is one of my favorite movies from Disney, and when I watched it for the first time I was 7 years old. Aladdin is a poor boy and he lives at the streets with his best friend Abu, a little and cute monkey. One day, at the market, he helps Princess Jasmine thinking that she is a regular girl,but under Jafar's orders (sultan's adviser)Aladdin is thrown in jail.Jasmine stays furious with Jafar's orders, but Jafar being an evil bastard, says to her that he asked to kill Aladdin. But many things that Jafar didn't think become true, and one of them is that Aladdin escaped from prison, and is the only person who can enter in a cave where the magical lamp is.(I don't need to say that he is the one who takes the lamp and become Genie's friend) But many things will happen, including Aladdin and Jasmine's meet as prince and princess."
    },
    {
      "username": "suspiria10",
      "userUrl": "https://www.imdb.com/user/ur1683802",
      "reviewLink": "https://www.imdb.com/review/rw1061609",
      "warningSpoilers": false,
      "date": "17 April 2005",
      "rate": "7",
      "helpful": "8 out of 11 found this helpful.",
      "title": "S10 Reviews: Aladdin (1992)",
      "content": "Disney animation strikes pay dirt again with \"Aladdin\". Aladdin is an orphaned \"street rat\" who, with his cheeky monkey Abu takes what they need to survive the harsh reality of their situation. All with a song in his heart. But Aladdin gets mixed up in a nefarious plot by Jafar (and his hilariously funny foul-mouth parrot Iago) the adviser to the sultan. Like most of the cinematic madmen Jafar has hatched up a glorious scheme to bring the world to its knees but there is a catch. A person pf pure spirit is the only one who can grab a mystical lamp which is the heart of his plan. When things go wrong for Jafar (thanks to that quick monkey) Aladdin discovers the secret of the lamp and the comic hilarity that lay inside. Aladdin gets three wishes from the *ahem* Genie in the bottle (voiced by the perfectly cast Robin Williams) and Al's life will never be the same. Will Aladdin fulfill his deepest desires or will he rescue the princess and take a magic carpet ride into the sunset? \"Aladdin\" is a beautiful melding of computer generated and standard animation that paved the way for Disney's best feature (The Lion King). Wonderfully magical story with some seriously crazy comedians at work, \"Aladdin\" is great fun for the whole family."
    },
    {
      "username": "mark.waltz",
      "userUrl": "https://www.imdb.com/user/ur0968789",
      "reviewLink": "https://www.imdb.com/review/rw6511362",
      "warningSpoilers": true,
      "date": "21 January 2021",
      "rate": "10",
      "helpful": "5 out of 8 found this helpful.",
      "title": "This out beauties the beast.",
      "content": "It's a shame that voice acting has never been honored at the Academy other than personal recognition for their talents because Robin Williams certainly deserved an Oscar for his work here. Once you start to get used to the Broadway style voices for these middle eastern characters, you can truly enjoy this, and that's pretty much my only gripe about my favorite modern Disney animated musical.The tongue was definitely in Robin Williams' cheek that the animators utilized to enhance his characterization of the genie in this update of the famous classic tale. Of course, the character of street beggar and thief Aladdin is far too clean cut so it takes some dramatic license to accept this aspect of the leading hero, certainly not how Sabu played similar characters in the 1930's and 40's. Here, he's like something out of teenbeat rather than someone stealing to avoid starving.The story is enhanced by the songs and of course how Williams, Scott Weigert (Aladdin's voice, sung by Brad Kane) and Linda Larkin (providing the voice of feisty Princess Jasmine, sung by Lea Salonga), and the delightful villainy of Jonathan Freeman as the deadpan Jafar, a role he played live decades later in the Broadway musical.The styles utilized here will be recognized from many cultural references of even the most obscure mediums, with Williams utilizing his knowledge of the classic comics and other personalities to mimic them with respect. had to spend on badly, it would have dated this instantly but because of how it's done, that aspect of this will remain dateless. It's magical and romantic and certainly one for the entire family as well as people without families. In fact, this will be of interest to young boys who will enjoy the adventure aspect of it since it's much more than the typical Disney princess mentality."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw4187867",
      "warningSpoilers": true,
      "date": "2 June 2018",
      "rate": "7",
      "helpful": "3 out of 4 found this helpful.",
      "title": "\"You ain't never had a friend like me!\"",
      "content": "No question Robin Williams delivers in a trademark role here as the wise cracking, ad-libbing Blue Genie, but I also got a kick out of Gilbert Gottfried's voice work for Iago the Parrot. And that's saying something, because otherwise, in a take it or leave it situation with Gottfried, I'd always leave it. The story is classic Disney, colorful and song filled, with an interesting balance of villains and heroes. The back and forth with the magic lamp gets a little played out after a while, but I thought the ending had an ironic twist with Sorceror Jafar (Jonathan Freeman) wishing to be the most powerful genie in the world. In effect, he got double whammied by the law of unintended consequences and a severe lesson in 'be careful what you wish for'."
    },
    {
      "username": "Spleen",
      "userUrl": "https://www.imdb.com/user/ur0035229",
      "reviewLink": "https://www.imdb.com/review/rw0302680",
      "warningSpoilers": false,
      "date": "30 September 1999",
      "rate": "8",
      "helpful": "9 out of 15 found this helpful.",
      "title": "One of Disney's weaker recent efforts",
      "content": "`Aladdin' caused a few ripples of shock in animation circles. It seemed that Disney had started to pick up some tricks from Warner Brothers, like the rapid-fire topical references and Hollywood-star-of-the-day caricature. Most people were pleased. It's orthodoxy in animation circles that the Warner Brothers style is a great one, much more lively than Disney's.I beg to differ. Warner Brothers cartoons are under-characterised, talky, brash WITHOUT being energetic, and they don't age well. They fail to be comic despite the fact that every other virtue is sacrificed for comedy's sake. I wish it to be said that none of this applies to the very fine efforts of Chuck Jones. SOME of his cartoons are masterpieces. But some - the Pepe Le Pew series, for example - are dreadful; and what has happened here, I think, is that he has been poisoned by the Warner Brothers style. So too has `Aladdin' been poisoned. In another decade everyone will have forgotten why Robin Williams was meant to be so funny and we will watch the genie only for Eric Goldberg's animation - which is technically superb, but a bit too literal, and too willing to follow Williams's lead.There are a couple of other flaws in `Aladdin' that will become more obvious as the years roll. For one thing, the computer generated images just don't fit the other images. (The Cave of Wonders is a visual debacle, which is sad, considering how good the rest of the art direction is.) More importantly, Aladdin isn't an appealing hero. Get this for shallow: he refuses to free the genie from servitude in order to perpetuate a deceit practised on Jasmine because of a crisis of confidence that, so far as one can tell from the opening song, he doesn't really feel.Of course we all know the film was a huge success, and it's not hard to see why: it offered the best character animation in the world, expertly staged songs, an uncynical look at an old story - all of the usual things, with a luscious princess thrown in. Like ALL of Disney's recent animated films it's easy to enjoy. But consider the other two of these films worked on by the team of Musker and Clements: `The Little Mermaid' and `Hercules'. `Aladdin', as much fun as it is, clearly lacks the heart of the former and the energy and technical brilliance of the latter, without offering a value-for-money trade off. But don't let this stop you watching it."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3358860",
      "warningSpoilers": false,
      "date": "21 November 2015",
      "rate": "8",
      "helpful": "5 out of 9 found this helpful.",
      "title": "Robin Williams outshines",
      "content": "Jafar, Grand Vizier to the Sultan sends a con into the Cave of Wonders to retrieve the magic lamp. The guard demands a Diamond in the Rough and devours the man. Princess Jasmine is tired of palace life and the Sultan's constant attempt to find her a husband. She sneaks out into the market where good-natured thief Aladdin with his monkey Abu saves her from getting her hand chopped off. Jafar orders Aladdin's capture and then helps him escape to steal the lamp. Aladdin manages to survive and release the Genie (Robin Williams). He promises to grant Genie his freedom with his third wish.Robin Williams is utterly brilliant. His personality is so big that he outshines almost everybody except the villain. Jafar is a terrific villain in the vein of traditional Disney. Aladdin and Jasmine suffer from being overshadowed by the side characters. There are a couple of nice catchy tunes. This is generally a good animated movie with an outstanding voice performance."
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6220075",
      "warningSpoilers": false,
      "date": "30 October 2020",
      "rate": "9",
      "helpful": "5 out of 7 found this helpful.",
      "title": "Aladdin",
      "content": "A very fun movie that contains fun characters especially the genie, the carpet, the monkey and the parrot, and Robin Williams is better than Will Smith in the performance of the Genie character"
    },
    {
      "username": "moonspinner55",
      "userUrl": "https://www.imdb.com/user/ur0989035",
      "reviewLink": "https://www.imdb.com/review/rw2041843",
      "warningSpoilers": false,
      "date": "23 March 2009",
      "rate": "6",
      "helpful": "7 out of 15 found this helpful.",
      "title": "Lots of color and pep, good songs but derivative elements...",
      "content": "Arabian Nights tale via the Disney people, presented in the much-missed, regrettably vanquished hand-drawn era of animation. The Sultan's daughter must marry a prince in three days or be forced to wed her father's version of a concierge, who drips with disdain and evil; meanwhile, young rogue Aladdin and his pet monkey have been allowed into a hallowed cave of treasures where they rescue a manic genie from a magic lamp. In-jokes aside, the movie visually borrows from other Disney product (particularly \"Sleeping Beauty\" towards the end), not to mention \"Raiders of the Lost Ark\". It doesn't seem to have much spirit of its own apart from Robin Williams and his vocal hamming (which was seen as a tour-de-force in its time). There are funny bits and pieces, beautiful designs and scene transitions, and the romance between the young people comes off well. It's a little screechy and a little staid, with illogical rewrites to the Aladdin legend which do nothing but prolong the inevitable; however, the Disney magic is in evidence and the film is satisfying on a non-think level. **1/2 from ****"
    }
  ],
  "errorMessage": ""
}