{
  "imDbId": "tt0103639",
  "title": "Aladdin",
  "fullTitle": "Aladdin (1992)",
  "type": "Movie",
  "year": "1992",
  "language": "en",
  "titleInLanguage": "Aladdin (1992 Disney film)",
  "url": "https://en.wikipedia.org/wiki/Aladdin_(1992_Disney_film)",
  "plotShort": {
    "plainText": "Aladdin is a 1992 American animated musical fantasy comedy film produced by Walt Disney Feature Animation and released by Walt Disney Pictures. The 31st Disney animated feature film and the fourth produced during the Disney Renaissance, it is based on the Arabic folktale of the same name from the One Thousand and One Nights. The film was produced and directed by John Musker and Ron Clements from a screenplay they co-wrote with the writing team of Ted Elliott and Terry Rossio. Featuring the voices of Scott Weinger, Robin Williams, Linda Larkin, and Jonathan Freeman, the film follows the titular Aladdin, an Arabian street urchin, who finds a magic lamp containing a genie. With the genie's help, Aladdin disguises himself as a wealthy prince and tries to impress the Sultan in order to win the heart of his free-spirited daughter, Princess Jasmine, as the Sultan's evil vizier Jafar plots to steal the magic lamp for his own uses.\r\nLyricist Howard Ashman first pitched the idea, and the screenplay went through three drafts before then-Disney Studios president Jeffrey Katzenberg agreed to its production. The animators based their designs on the work of caricaturist Al Hirschfeld, and computers were used for both finishing the artwork and creating some animated elements. The musical score was written by Alan Menken and features six songs with lyrics written by both Ashman and Sir Tim Rice, who took over after Ashman's death.\r\nAladdin was released on November 11, 1992. It received positive reviews from critics (particularly for Williams' performance). It was a commercial success, becoming the highest-grossing film of 1992 with an earning of over $504 million in worldwide box office revenue. Upon release, it became the first animated feature to reach the half-billion-dollar mark and was the highest-grossing animated film of all time until it was surpassed by The Lion King (1994).\r\nAladdin garnered two Academy Awards, as well as other accolades for its soundtrack, which had the first and only number from a Disney feature to earn a Grammy Award for Song of the Year, for the film's \"A Whole New World,\" sung by Peabo Bryson and Regina Belle. The film's home video VHS release also set a sales record and grossed about $500 million in the United States. Aladdin's success led to various derived works and other material inspired by the film, including two direct-to-video sequels The Return of Jafar (1994) and Aladdin and the King of Thieves (1996), an animated television series, and a Broadway adaptation. A live-action film adaptation directed by Guy Ritchie was released on May 24, 2019.",
    "html": "<p>Aladdin is a 1992 American animated musical fantasy comedy film produced by Walt Disney Feature Animation and released by Walt Disney Pictures. The 31st Disney animated feature film and the fourth produced during the Disney Renaissance, it is based on the Arabic folktale of the same name from the One Thousand and One Nights. The film was produced and directed by John Musker and Ron Clements from a screenplay they co-wrote with the writing team of Ted Elliott and Terry Rossio. Featuring the voices of Scott Weinger, Robin Williams, Linda Larkin, and Jonathan Freeman, the film follows the titular Aladdin, an Arabian street urchin, who finds a magic lamp containing a genie. With the genie's help, Aladdin disguises himself as a wealthy prince and tries to impress the Sultan in order to win the heart of his free-spirited daughter, Princess Jasmine, as the Sultan's evil vizier Jafar plots to steal the magic lamp for his own uses.</p><p>Lyricist Howard Ashman first pitched the idea, and the screenplay went through three drafts before then-Disney Studios president Jeffrey Katzenberg agreed to its production. The animators based their designs on the work of caricaturist Al Hirschfeld, and computers were used for both finishing the artwork and creating some animated elements. The musical score was written by Alan Menken and features six songs with lyrics written by both Ashman and Sir Tim Rice, who took over after Ashman's death.</p><p>Aladdin was released on November 11, 1992. It received positive reviews from critics (particularly for Williams' performance). It was a commercial success, becoming the highest-grossing film of 1992 with an earning of over $504 million in worldwide box office revenue. Upon release, it became the first animated feature to reach the half-billion-dollar mark and was the highest-grossing animated film of all time until it was surpassed by The Lion King (1994).</p><p>Aladdin garnered two Academy Awards, as well as other accolades for its soundtrack, which had the first and only number from a Disney feature to earn a Grammy Award for Song of the Year, for the film's \"A Whole New World,\" sung by Peabo Bryson and Regina Belle. The film's home video VHS release also set a sales record and grossed about $500 million in the United States. Aladdin's success led to various derived works and other material inspired by the film, including two direct-to-video sequels The Return of Jafar (1994) and Aladdin and the King of Thieves (1996), an animated television series, and a Broadway adaptation. A live-action film adaptation directed by Guy Ritchie was released on May 24, 2019.</p>"
  },
  "plotFull": {
    "plainText": "Aladdin is a 1992 American animated musical fantasy comedy film produced by Walt Disney Feature Animation and released by Walt Disney Pictures. The 31st Disney animated feature film and the fourth produced during the Disney Renaissance, it is based on the Arabic folktale of the same name from the One Thousand and One Nights. The film was produced and directed by John Musker and Ron Clements from a screenplay they co-wrote with the writing team of Ted Elliott and Terry Rossio. Featuring the voices of Scott Weinger, Robin Williams, Linda Larkin, and Jonathan Freeman, the film follows the titular Aladdin, an Arabian street urchin, who finds a magic lamp containing a genie. With the genie's help, Aladdin disguises himself as a wealthy prince and tries to impress the Sultan in order to win the heart of his free-spirited daughter, Princess Jasmine, as the Sultan's evil vizier Jafar plots to steal the magic lamp for his own uses.\r\nLyricist Howard Ashman first pitched the idea, and the screenplay went through three drafts before then-Disney Studios president Jeffrey Katzenberg agreed to its production. The animators based their designs on the work of caricaturist Al Hirschfeld, and computers were used for both finishing the artwork and creating some animated elements. The musical score was written by Alan Menken and features six songs with lyrics written by both Ashman and Sir Tim Rice, who took over after Ashman's death.\r\nAladdin was released on November 11, 1992. It received positive reviews from critics (particularly for Williams' performance). It was a commercial success, becoming the highest-grossing film of 1992 with an earning of over $504 million in worldwide box office revenue. Upon release, it became the first animated feature to reach the half-billion-dollar mark and was the highest-grossing animated film of all time until it was surpassed by The Lion King (1994).\r\nAladdin garnered two Academy Awards, as well as other accolades for its soundtrack, which had the first and only number from a Disney feature to earn a Grammy Award for Song of the Year, for the film's \"A Whole New World,\" sung by Peabo Bryson and Regina Belle. The film's home video VHS release also set a sales record and grossed about $500 million in the United States. Aladdin's success led to various derived works and other material inspired by the film, including two direct-to-video sequels The Return of Jafar (1994) and Aladdin and the King of Thieves (1996), an animated television series, and a Broadway adaptation. A live-action film adaptation directed by Guy Ritchie was released on May 24, 2019.\r\nPlot\r\nA peddler shows the viewers an oil lamp amongst his wares, and begins to tell the story of the lamp.\r\nJafar, a ruthless sorcerer and the royal vizier of the Middle Eastern city of Agrabah, seeks a lamp hidden within the Cave of Wonders. The cave's guardian tells him that only one person is worthy to enter: \"the diamond in the rough\", whom Jafar later identifies as a young street urchin named Aladdin. Meanwhile, Princess Jasmine is upset by her obligation to marry a prince due to the law rather than for love. Concealing herself, she escapes the palace and is saved from an angry merchant by Aladdin and his pet monkey Abu. As a bond between Aladdin and Jasmine develops, the palace guards capture Aladdin on Jafar's orders, during which Jasmine reveals herself. She confronts Jafar to demand Aladdin's release, but he lies to her, saying Aladdin has been executed.\r\nDisguised as an elderly beggar, Jafar frees Aladdin and Abu and brings them to the cave, ordering them to retrieve the lamp. The guardian grants Aladdin entry, but warns him to touch nothing but the lamp. Aladdin finds both the lamp and a magic carpet inside, but Abu greedily grabs a large jewel, triggering the cave's collapse. Aladdin gives the lamp to Jafar, who throws him and Abu into the collapsing cave, though not before Abu steals it back. Trapped, Aladdin rubs the lamp and meets the genie who lives inside it. The Genie grants Aladdin three wishes, though Aladdin tricks him into freeing them all from the cave without using a wish. Upon learning that the Genie desires to be released from servitude, Aladdin promises to use his last wish to free him. Aladdin uses his first wish to become a prince, intending to woo Jasmine.\r\nJafar's parrot minion Iago suggests to his master that he can become Sultan by marrying Jasmine. Aladdin, as \"Prince Ali Ababwa,\" arrives in Agrabah with a large host, but Jasmine is angered when her father, the Sultan, discusses her marriage with only Aladdin and Jafar. As a means of apologizing, Aladdin takes Jasmine on a ride with the magic carpet. When she infers his true identity, he claims that he only dresses as a commoner to escape the stresses of royal life. After Aladdin brings Jasmine home, the palace guards capture him on Jafar's behest and throw him into the sea. The Genie appears and saves Aladdin at the cost of his second wish. Aladdin returns to the palace and exposes Jafar's plot, prompting the latter to flee, but not before he glimpses the lamp and determines Aladdin's true identity.\r\nFearing that he will lose Jasmine if the truth is revealed, Aladdin breaks his promise and refuses to free the Genie. Iago steals the lamp, and Jafar becomes the Genie's new master. He uses his first two wishes to become both Sultan and the world's most powerful sorcerer. He then exposes Aladdin, exiling him, Abu, and the carpet to a frozen wasteland. The three escape and return to Agrabah, where Jasmine tries to help Aladdin steal the lamp back. Jafar notices and overpowers her, Abu, and the carpet with his magic. Aladdin taunts Jafar for being less powerful than the Genie, tricking him into using his last wish to become an all-powerful genie himself. Now bound to his new lamp, Jafar ends up trapped inside it, taking Iago with him. The Genie then throws Jafar's lamp far into the desert, banishing Jafar and Iago to the Cave of Wonders for 10,000 years.\r\nWith Agrabah returned to normal, the Genie encourages Aladdin to use his third wish to regain his royal title and legally marry Jasmine. Aladdin instead decides to keep his promise and frees the Genie. Realizing Aladdin's nobility, the Sultan changes the law to allow Jasmine to marry whoever she chooses. The Genie bids the group a fond farewell and leaves to explore the world, while Aladdin and Jasmine start their new life together.\r\nCast\r\nScott Weinger as Aladdin, a poor yet kind-hearted Agrabah thief. For his audition, Weinger sent in a homemade audition tape as Aladdin with his mother playing the Genie, and after several callbacks found out six months later that he had been cast as the title character. Aladdin's supervising animator was Glen Keane. Brad Kane provides Aladdin's singing voice.\r\nRobin Williams as the Genie, a hyperactive jinn with great power that can only be exercised when his master wishes it. He serves as the film's comic relief. Clements and Musker had written the role of the Genie for Robin Williams and, when met with resistance, created a reel of a Williams stand-up animation of the Genie. The directors asked Eric Goldberg, Genie's supervising animator, to animate the character over one of Williams' old stand-up comedy routines to pitch the idea to the actor. The resulting test, where Williams' stand-up about schizophrenia was translated into Genie growing another head to argue with himself, made Williams \"laugh his ass off\" and convinced him to sign on for the role. Williams' appearance in Aladdin marks the beginning of a transition in animation to use celebrity voice actors rather than specifically trained voice actors in animated films.Williams also voices a peddler who appears at the beginning of the film, who the directors confirmed to be the same Genie in disguise narrating the story. The peddler's singing voice was provided by Bruce Adler.\r\nWilliams also voices a peddler who appears at the beginning of the film, who the directors confirmed to be the same Genie in disguise narrating the story. The peddler's singing voice was provided by Bruce Adler.\r\nLinda Larkin as Jasmine, the princess of Agrabah and daughter of the Sultan, who is bored with life in the royal palace. Larkin was chosen for the role of Jasmine nine months after her audition, and had to adjust, or lower, her high-pitched voice to reach the voice the filmmakers were looking for in the character. Jasmine's supervising animator was Mark Henn. Lea Salonga provides Jasmine's singing voice.\r\nJonathan Freeman as Jafar, the power-hungry Grand vizier of Agrabah. Freeman was the first actor cast and spent one year and nine months recording his dialogue. He later readjusted his voice after Weinger and Larkin were cast as he felt \"Jafar had to be seen as a real threat to Aladdin and Jasmine,\" as he was originally envisioned as an irritable character, but the directors decided that a calm villain would be scarier. Jafar's supervising animator was Andreas Deja, while Jafar's beggar and snake forms are animated by Kathy Zielinski.\r\nFrank Welker as Abu, Aladdin's kleptomaniac pet monkey with a falsetto voice. Welker also voices Jasmine's tiger Rajah and the Cave of Wonders. Duncan Marjoribanks was the supervising animator for Abu, Aaron Blaise was the supervising animator for Rajah, and Goldberg was the supervising animator for the Cave of Wonders.\r\nGilbert Gottfried as Iago, Jafar's sardonic, hot-tempered parrot assistant. Although he is not anthropomorphic at all, he uses his ability to mimic speech to communicate on a human level. Will Finn was the supervising animator for Iago.\r\nDouglas Seale as the Sultan, the naive yet friendly ruler of Agrabah, who desperately tries to find a suitor for his daughter Jasmine. The Sultan's supervising animator was David Pruiksma.\r\nJim Cummings as Razoul, the Captain of the Guards. Phil Young and Chris Wahl animated him and the other guards.\r\nCharlie Adler as Gazeem, a thief that Jafar sends into the Cave of Wonders at the beginning of the film, but is trapped inside for being unworthy. Gazeem was animated by T. Daniel Hofstedt.\r\nCorey Burton as Prince Achmed, an arrogant prince whom Jasmine rejects as a suitor.\r\nProduction\r\nScript and development\r\nIn 1988, lyricist Howard Ashman pitched the idea of an animated musical adaptation of Aladdin. Ashman had written a 40-page film treatment remaining faithful to the plot and characters of the original story, but envisioned as a campy 1930s-style musical with a Cab Calloway/Fats Waller-like Genie. Along with partner Alan Menken, Ashman composed several songs and added original characters such as Aladdin's friends named Babkak, Omar, and Kassim to the story.: 216 However, Michael Eisner did not think a story set in the Middle East would be commercially appealing, and their project was removed from active development. Ashman and Menken were later recruited to compose songs for Beauty and the Beast (1991). Linda Woolverton, who had also worked on Beauty and the Beast, used their treatment and developed a draft with inspired elements from The Thief of Bagdad (1940), such as a villain named Jaf'far, an aged sidekick retired human thief named Abu, and a human handmaiden for the princess. Then, directors Ron Clements and John Musker joined the production, picking Aladdin out of three projects offered, which also included an adaptation of Swan Lake and King of the Jungle—that eventually became The Lion King (1994). Before Ashman's death in March 1991, he and Menken had composed \"Prince Ali\" and his last song, \"Humiliate the Boy.\"\r\nMusker and Clements wrote a draft of the screenplay, and then delivered a story reel to studio chief Jeffrey Katzenberg in April 1991. Katzenberg thought the script \"didn't engage,\" and on a day known by the staff as \"Black Friday,\" demanded that the entire story be rewritten without rescheduling the film's November 25, 1992 release date. Katzenberg requested for Clements and Musker to not be heavily dependent on Ashman's vision,: 217 and the removal of Aladdin's mother, remarking, \"Eighty-six the mother. The mom's a zero.\" Katzenberg also influenced in changing the plot element about Jasmine's marriage, which originally had her required by law to be married by sixteen, to remove the age—the Sultan only says \"your next birthday\"—and make it more specific that her suitor needed to be a prince, which would also set up the ending where the Sultan, inspired by Aladdin's altruism, changes the law to make Jasmine able to marry anyone she deems worthy.\r\nScreenwriting duo Ted Elliott and Terry Rossio were brought in to rework the story, and the changes they made included the removal of Aladdin's mother, the strengthening of the character of Princess Jasmine, and the deletion of several Ashman and Menken's songs. Aladdin's personality was rewritten to be \"a little rougher, like a young Harrison Ford,\" and the parrot Iago, originally conceived as an uptight British archetype, was reworked into a comic role after the filmmakers saw Gilbert Gottfried in Beverly Hills Cop II (1987), who was then cast for the role. By October 1991, Katzenberg was satisfied with the new version of Aladdin. As with Woolverton's screenplay, several characters and plot elements were based on The Thief of Bagdad (1940), though the location of the film was changed from Baghdad to the fictional Arabian city of Agrabah.\r\nAccording to 1994 article in The Advocate, Katzenberg asked Thomas Schumacher, an openly gay producer, if any of the gay references in the film offended him, such as a scene where the Genie turns into an \"effeminate clothier\", and another in which he tells Aladdin that \"I really like you too, kid, but that doesn't mean I want to pick out curtains with you\". Schumacher responded that such references were in \"good fun\", remarking that \"I know we all argue amongst ourselves, but why try to deny the fact that swishy fashion designers exist? They do! What are we running from? Show me ten hairdressers; I'll show you eight gay men\".\r\nDesign and animation\r\nThe design for most characters was based on the work of caricaturist Al Hirschfeld, which production designer Richard Vander Wende also considered appropriate to the theme, due to similarities to the flowing and swooping lines found in Arabic calligraphy. Jafar's design was not based on Hirschfeld's work because Jafar's supervising animator, Andreas Deja, wanted the character to be contrasting. Each character was animated alone, with the animators consulting each other to make scenes with interrelating characters. Since Aladdin's animator Glen Keane was working in the California branch of Walt Disney Feature Animation, and Jasmine's animator Mark Henn was in the Florida one at Disney-MGM Studios, they had to frequently phone, fax or send designs and discs to each other. The animators filmed monkeys at the San Francisco Zoo to study their movements for Abu's character. Iago's supervising animator Will Finn tried to incorporate some aspects of Gottfried's appearance into the parrot's design, especially his semi-closed eyes and the always-appearing teeth. Some aspects of the Sultan were inspired by the Wizard of Oz, to create a bumbling authority figure. Andreas Deja, Jafar's supervising animator, tried to incorporate Jonathan Freeman's facial expressions and gesturing into the character. Animator Randy Cartwright described working on the Magic Carpet as challenging, since it is only a rectangular shape, that expresses itself through pantomime—\"It's sort of like acting by origami.\" Cartwright kept folding a piece of cloth while animating to see how to position the Carpet. After the character animation was done, the carpet's surface design was applied digitally.\r\n\"In early screenings, we played with him being a little bit younger, and he had a mother in the story. In design he became more athletic-looking, more filled out, more of a young leading man, more of a teen-hunk version than before.\"\r\n–John Musker on Aladdin's early design\r\nDesigned by a team led by supervising animator Glen Keane, Aladdin was initially going to be as young as thirteen, and was originally made to resemble actor Michael J. Fox. During production, it was decided that the design was too boyish and lacked appeal, so the character was made eighteen and redesigned to add elements derived from actor Tom Cruise and Calvin Klein models.\r\nFor the scenery design, various architectural elements seen in 19th-century orientalist paintings and photographs of the Arab world were used for guidance. Other inspirations for design were Disney's animated films from the 1940s and '50s and the 1940 film The Thief of Bagdad. The coloring was done with the computerized CAPS process, and the color motifs were chosen according to the personality—the protagonists use light colors such as blue, the antagonists darker ones such as red and black, and Agrabah and its palace use the neutral color yellow. Computer animation was used for several elements of the film, such as the tiger entrance of the Cave of Wonders and the scene where Aladdin tries to escape the collapsing cave. Some of the software that was used was Pixar's RenderMan.\r\nMusker and Clements created the Genie with Robin Williams in mind; even though Katzenberg suggested actors such as John Candy, Steve Martin and Eddie Murphy, Williams was approached and eventually accepted the role. Williams came for voice recording sessions during breaks while filming two other films he was starring in at the time, Hook (1991) and Toys (1992). Unusually for an animated film, much of Williams's dialogue was ad-libbed. For some scenes, Williams was given topics and dialogue suggestions, but allowed to improvise his lines. It was estimated that Williams improvised 52 characters. Eric Goldberg, the supervising animator for the Genie, then reviewed Williams's recorded dialogue and selected the best gags and lines that his crew would create character animation to match.\r\nThe producers added many in-jokes and references to Disney's previous works in the film, such as a \"cameo appearance\" from directors Clements and Musker and drawing some characters based on Disney workers. Beast, Sebastian, and Pinocchio make brief appearances, and the wardrobe of the Genie at the end of the film—a Goofy hat, a Hawaiian shirt, and sandals—are a reference to a short film that Robin Williams did for the Disney-MGM Studios tour in the late 1980s.\r\nRobin Williams' conflicts with the studio\r\nIn gratitude for his success with Touchstone Pictures' Good Morning, Vietnam, Robin Williams voiced the Genie for SAG scale pay—$75,000—instead of his asking fee of $8 million, on the condition that his name or image not be used for marketing, and his (supporting) character not take more than 25% of space on advertising artwork, since Williams' film Toys was scheduled for release one month after Aladdin's debut. For financial reasons, the studio went back on the deal on both counts, especially in poster art by having the Genie in 25% of the image, but having other major and supporting characters portrayed considerably smaller. The Disney Hyperion book Aladdin: The Making of an Animated Film listed both of Williams's characters \"The Peddler\" and \"The Genie\" ahead of main characters, but was forced to refer to him only as \"the actor signed to play the Genie.\"\r\nDisney, while not using Williams' name in commercials as per the contract, used his voice for the Genie in the commercials and used the Genie character to sell toys and fast food tie-ins, without having to pay Williams additional money; Williams unhappily quipped at the time, \"The only reason Mickey Mouse has three fingers is because he can't pick up a check.\" Williams explained to New York magazine that his previous Mork & Mindy merchandising was different because, \"the image is theirs. But the voice, that's me; I gave them myself. When it happened, I said, 'You know I don't do that.' And they apologized; they said it was done by other people.\" Disney attempted to assuage Williams by sending him a Pablo Picasso painting worth more than $1 million at the time, but this move failed to repair the damaged relationship, as the painting was a self-portrait of Picasso as the artist Vincent van Gogh and apparently really \"clashed\" with the Williams' wilder home decor. Williams refused to sign on for the 1994 direct-to-video sequel The Return of Jafar, so it was Dan Castellaneta who voiced the Genie. When Jeffrey Katzenberg was replaced by Joe Roth as Walt Disney Studios chairman, Roth organized a public apology to Williams. Williams would, in turn, reprise the role in the second sequel, Aladdin and the King of Thieves, in 1996.\r\nMusic\r\nAladdin was the third—after The Little Mermaid (1989) and Beauty and the Beast (1991)—and final Disney film Alan Menken and Howard Ashman had collaborated on, with Tim Rice taking over as lyricist after Ashman had died in March 1991. Although fourteen songs were written for Aladdin, only seven are featured in the film, three by Ashman and four by Rice. Menken, Ashman, and Rice were praised for creating a soundtrack that is \"consistently good, rivaling the best of Disney's other animated musicals from the '90s.\" The Special Edition soundtrack released in 2004 included four songs in early animation tests, and a music video of one, \"Proud of Your Boy,\" performed by Clay Aiken, which also appears on the album Disneymania 3. The version of the song \"A Whole New World\" performed by Peabo Bryson and Regina Belle, which plays over the end credits, is, as of 2019, the only Disney song to win a Grammy Award for Song of the Year.\r\nThemes\r\n\"The original story was sort of a winning the lottery kind of thing ... Like having anything you could wish for would be the greatest thing in the world and having it taken away from you is bad, but having it back is great. We didn't really want that to be the message of the movie.\"\r\n–Ron Clements\r\nThe filmmakers thought the moral message of the original tale was inappropriate, and decided to \"put a spin on it\" by making the fulfillment of wishes seem like a great solution, but eventually becoming a problem. Another major theme was avoiding an attempt to be what the person is not—both Aladdin and Jasmine get into trouble pretending to be different people, and the Prince Ali persona fails to impress Jasmine, who only falls for Aladdin when she finds out who he truly is. Being \"imprisoned\" is also presented, a fate that occurs to most of the characters—Aladdin and Jasmine are limited by their lifestyles, Genie is attached to his lamp, and Jafar to the Sultan—and is represented visually by the prison-like walls and bars of the Agrabah palace, and the scene involving caged birds which Jasmine later frees. Jasmine is also depicted as a different type of Disney Princess, being rebellious against the royal life and the social structure.\r\nRelease\r\nBox office\r\nA large promotion campaign preceded Aladdin's debut in theaters, with the film's trailer being attached to most Disney VHS releases (including One Hundred and One Dalmatians in April 1992 and Beauty and the Beast in October that year), and numerous tie-ins and licensees being released. Aladdin was released on November 11, 1992 in two theatres (the El Capitan Theatre in Los Angeles and the City Cinemas 1, 2 and 3rd Avenue in New York City) and grossed $196,664 in its first 5 days. The film expanded to 1,131 theaters on November 25, 1992, grossing $19.2 million for the weekend, finishing second at the US box office, behind Home Alone 2: Lost in New York. It took eight weeks for the film to surpass Beauty and the Beast as the most successful animated Disney film at the domestic box office (surpassed by The Lion King in 1994).\r\nFor its eighth week of release, Aladdin collected $15.6 million and reached the number one spot at the box office, beating A Few Good Men. By February 1993, it would go on to surpass Batman Returns to become the highest-grossing 1992 film domestically. In the United States, the film held the top spot for five times weekly and breaks the record for the week between Christmas and New Year's Eve with $32.2 million during its 22-week run. Aladdin was the most successful film of 1992, grossing $217 million in the United States and over $504 million worldwide. It was the biggest gross for an animated film until The Lion King two years later, and was the first full-length animated film to gross $200 million in the United States and Canada. Additionally, it was the first film to cross that mark since Terminator 2: Judgment Day (1991).\r\nOutside of the United States and Canada, the film grossed $200 million in 1993, and $250 million by January 1994. In Europe, Aladdin defeated Jurassic Park to become the continent's box office leader. It set an opening weekend record in South Africa. By 2002, the film had grossed $287 million overseas and $504 million worldwide. Currently, it is the 35th highest-grossing animated film and the third highest-grossing traditionally animated feature worldwide, behind The Lion King and The Simpsons Movie (2007). It sold an estimated 52.4 million tickets in the United States and Canada. When adjusted for inflation (in 2022 dollars), its domestic gross totals $491.4 million.\r\nHome media\r\nThe film was first released in VHS on September 29, 1993, as part of the Walt Disney Classics line, although, it was not officially advertised until October 1. In its first three days of availability, Aladdin sold 10.8 million copies, setting the fastest sales record and grossing about $265,000,000 (equivalent to $537,000,000 in 2022) in the United States. In less than three weeks, the VHS release of Aladdin sold over 16 million units and grossed over $400,000,000 (equivalent to $810,000,000 in 2022) in the United States. Upon release of the Sega Genesis video game adaptation in November, Aladdin sold about 30 million home video units, earning over $500,000,000 (equivalent to $1,010,000,000 in 2022) in the United States. It was the best-selling home video release up until its record was later broken by The Lion King. This VHS edition entered moratorium on April 30, 1994. A THX-certified widescreen LaserDisc was issued on September 21, 1994, and a Spanish-dubbed VHS for the American market was released on April 14, 1995. In Japan, 2.2 million home video units were sold by 1995.\r\nOn October 5, 2004, Aladdin was re-released onto VHS and for the first time released on DVD, as part of Disney's Platinum Edition line. The DVD release featured retouched and cleaned-up animation, which had been prepared for the film's planned but ultimately cancelled IMAX reissue in 2003, and a second disc with bonus features. Accompanied by a $19 million marketing campaign, the DVD sold about 3 million units in its first month. The film's soundtrack was available in its original Dolby 5.1 track or in a new Disney Enhanced Home Theater Mix. The DVD went into moratorium in January 2008, along with its sequels.\r\nAccording to an insert in the Lady and the Tramp Diamond Edition release case, Aladdin was going to be released on Blu-ray as a Diamond Edition in Spring 2013. Instead, Peter Pan was released on Blu-ray as a Diamond Edition on February 5, 2013, to celebrate its 60th anniversary. A non-Diamond Edition Blu-ray was released in a few select European countries in March 2013. The Belgian edition (released without advertisements, commercials or any kind of fanfare) comes as a single-disc version with its extras ported over from the Platinum Edition DVD. The same disc was released in the United Kingdom on April 14, 2013. Walt Disney Studios Home Entertainment released the film on a Diamond Edition Blu-ray on October 13, 2015. The film was released on Digital HD on September 29, 2015. Upon its first week of release on home media in the United States, the film topped the Blu-ray Disc sales chart and debuted at number 2 at the Nielsen VideoScan First Alert chart, which tracks overall disc sales behind the disaster film San Andreas. The film's Blu-ray release sold 1.81 million units and grossed $39 million, as of 2017.\r\nAladdin was re-released on HD and 4K digital download on August 27, 2019, with a physical media re-release on Blu-ray and Ultra HD Blu-ray on September 10, 2019, as part of the Walt Disney Signature Collection.\r\nReception\r\nCritical reception\r\nThe review aggregator website Rotten Tomatoes reports that 95% of 76 critics gave the film a positive review, with an average rating of 8.1/10. The site's consensus reads, \"A highly entertaining entry in Disney's renaissance era, Aladdin is beautifully drawn, with near-classic songs and a cast of scene-stealing characters.\" On Metacritic, the film has a weighted average score of 86 out of 100 based on 25 critics, indicating \"universal acclaim.\" Audiences polled by CinemaScore gave the film a rare \"A+\" grade.\r\nMost critics praised Robin Williams's performance as the Genie, with Janet Maslin of The New York Times declaring that children \"needn't know precisely what Mr. Williams is evoking to understand how funny he is.\" Roger Ebert of the Chicago Sun-Times commented that Williams and animation \"were born for one another.\" Warner Bros. Cartoons director Chuck Jones even called the film \"the funniest feature ever made.\" James Berardinelli gave it 3+1⁄2 out of 4 stars, praising the \"crisp visuals and wonderful song-and-dance numbers.\" Peter Travers of Rolling Stone said the comedy made the film accessible to both children and adults, a vision shared with Desson Howe of The Washington Post, who also said \"kids are still going to be entranced by the magic and adventure.\" Brian Lowry of Variety praised the cast of characters, describing the expressive magic carpet as \"its most remarkable accomplishment\" and considered that \"Aladdin overcomes most story flaws thanks to sheer technical virtuosity.\"\r\nSome aspects of the film were widely criticized. Ed Gonzalez of Slant Magazine wrote a negative review, describing the film as racist, ridiculous, and a \"narcissistic circus act\" from Robin Williams. Ebert, who had generally praised the film in his review, considered the music inferior to its predecessors The Little Mermaid and Beauty and the Beast, and claimed Aladdin and Jasmine were \"pale and routine.\" He criticized what he saw as the film's use of ethnic stereotypes, writing: \"Most of the Arab characters have exaggerated facial characteristics—hooked noses, glowering brows, thick lips—but Aladdin and the princess look like white American teenagers.\"\r\nAccolades\r\nThe film is recognized by American Film Institute in these lists:\r\n2000: AFI's 100 Years...100 Laughs – Nominated\r\n2004: AFI's 100 Years...100 Songs:\"Friend Like Me\" – Nominated \"A Whole New World\" – Nominated\r\n\"Friend Like Me\" – Nominated\r\n\"A Whole New World\" – Nominated\r\n2006: AFI's Greatest Movie Musicals – Nominated\r\nControversies\r\nOne of the verses of the opening song \"Arabian Nights\" was altered following complaints from the American-Arab Anti-Discrimination Committee (ADC). The lyrics were changed in July 1993 from \"Where they cut off your ear if they don't like your face\" in the original release to \"Where it's flat and immense and the heat is intense,\" with the change first appearing on the 1993 video release. The original lyric was intact on the initial CD soundtrack release, but the re-releases use the edited lyric. The Broadway adaptation also uses the edited line. The subsequent line however, \"It's barbaric, but hey, it's home,\" was left intact. Entertainment Weekly ranked Aladdin in a list of the most controversial films in history, due to this incident. The number has been described in reviews as \"simultaneously glamorizing and barbarizing the Arab world.\" The ADC also complained about the portrayal of the lead characters Aladdin and Jasmine. They accused the filmmakers of anglicizeing their features and giving them Anglo-American accents, in contrast to the other characters in the film, which have foreign accents, grotesque facial features, and appear villainous or greedy.\r\nConcerns were also raised to another scene. When Aladdin is threatened by the tiger Rajah on the palace balcony, Aladdin quietly says a line that some people reported hearing as \"Good teenagers, take off your clothes,\" which they considered a subliminal reference to promiscuity. However, according to the commentary track on the 2004 DVD, while Musker and Clements did admit Scott Weinger ad-libbed during the scene, they claimed \"we did not record that, we would not record that,\" and said the line was \"Good tiger, take off and go...\" and the word \"tiger\" is overlapped by Rajah's snarl. After the word tiger, a second voice can be heard which has been suggested was accidentally grafted onto the soundtrack.\r\nAnimation enthusiasts have noticed similarities between Aladdin and Richard Williams' unfinished film The Thief and the Cobbler (also known as The Princess and the Cobbler under Allied Filmmakers and Arabian Knight under Miramax Films). These similarities include a similar plot, similar characters, scenes and background designs, and the antagonist Zig-Zag's resemblance in character design and mannerisms to Genie and Jafar. Though Aladdin was released first, The Thief and the Cobbler initially began production much earlier in the 1960s, and was mired in difficulties including financial problems, copyright issues, story revisions and late production times caused by separate studios trying to finish the film after Richard Williams was fired from the project for lack of finished work. The late release, coupled with Miramax purchasing and re-editing the film, has sometimes resulted in The Thief and the Cobbler being labeled a rip-off of Aladdin.\r\nLegacy\r\nAlongside its role in the Disney Renaissance, Aladdin is often credited as the catalyst in the rise of casting film stars as voice actors in Hollywood animated films with the success of Robin Williams's Genie performance. Entertainment writer Scott Meslow wrote that compared with the character of Aladdin, \"Williams's Genie is the character audiences responded to, and—more importantly to Disney—its most marketable character by far,\" which he concludes led to the \"celebrification\" of later animated films such as Shark Tale (2004) and Puss in Boots (2011).\r\nLive-action adaptations\r\nLive-action prequel spin-off\r\nOn July 15, 2015, the studio announced the development of a live-action comedy adventure prequel called Genies. The film was being written by Mark Swift and Damian Shannon, while Tripp Vinson was on board to produce via his Vinson Films banner. It was intended to serve as a lead to the live-action Aladdin film. On November 8, Disney revealed it had originally planned to use Robin Williams' unused lines from the 1991–92 recording sessions for the film, but his will prohibited the studio from using his likeness for 25 years after his death in 2014.\r\nLive-action film\r\nIn October 2016, it was reported that Disney was developing a live-action adaptation of Aladdin with Guy Ritchie signed on to direct the film. John August wrote the script, which will reportedly retain the musical elements of the original film, while Dan Lin was attached as producer. Lin revealed that they were looking for a diverse cast. In April 2017, Will Smith entered talks to play the Genie. The following month, Jade Thirlwall entered talks to portray the role of Jasmine. Alan Menken said filming was slated to begin August 2017. Production had originally been scheduled to begin in July, but was delayed due to Disney having trouble finding the right people to play Aladdin and Jasmine. British actress Naomi Scott and Indian actress Tara Sutaria were being considered to play Jasmine. For the role of Aladdin, British actors Riz Ahmed and Dev Patel were initially considered, but it was later decided that a newcomer should be cast in the role. In July 2017, it was announced that Egyptian-Canadian actor Mena Massoud had been cast as Aladdin, Scott as Jasmine, and Smith as the Genie. At the 2017 D23 Expo, Menken announced that he would be co-writing new songs for the film with Academy Award winners Pasek and Paul while Vanessa Taylor would re-write the script. In August 2017, Marwan Kenzari, Nasim Pedrad, and Numan Acar joined the cast as Jafar, Dalia, and Hakim, respectively. The following month, Billy Magnussen and Navid Negahban were cast as Prince Anders and the Sultan, respectively. Filming began on September 6, 2017, at Longcross Studios and concluded on January 24, 2018. The film was released on May 24, 2019.",
    "html": "<p>Aladdin is a 1992 American animated musical fantasy comedy film produced by Walt Disney Feature Animation and released by Walt Disney Pictures. The 31st Disney animated feature film and the fourth produced during the Disney Renaissance, it is based on the Arabic folktale of the same name from the One Thousand and One Nights. The film was produced and directed by John Musker and Ron Clements from a screenplay they co-wrote with the writing team of Ted Elliott and Terry Rossio. Featuring the voices of Scott Weinger, Robin Williams, Linda Larkin, and Jonathan Freeman, the film follows the titular Aladdin, an Arabian street urchin, who finds a magic lamp containing a genie. With the genie's help, Aladdin disguises himself as a wealthy prince and tries to impress the Sultan in order to win the heart of his free-spirited daughter, Princess Jasmine, as the Sultan's evil vizier Jafar plots to steal the magic lamp for his own uses.</p><p>Lyricist Howard Ashman first pitched the idea, and the screenplay went through three drafts before then-Disney Studios president Jeffrey Katzenberg agreed to its production. The animators based their designs on the work of caricaturist Al Hirschfeld, and computers were used for both finishing the artwork and creating some animated elements. The musical score was written by Alan Menken and features six songs with lyrics written by both Ashman and Sir Tim Rice, who took over after Ashman's death.</p><p>Aladdin was released on November 11, 1992. It received positive reviews from critics (particularly for Williams' performance). It was a commercial success, becoming the highest-grossing film of 1992 with an earning of over $504 million in worldwide box office revenue. Upon release, it became the first animated feature to reach the half-billion-dollar mark and was the highest-grossing animated film of all time until it was surpassed by The Lion King (1994).</p><p>Aladdin garnered two Academy Awards, as well as other accolades for its soundtrack, which had the first and only number from a Disney feature to earn a Grammy Award for Song of the Year, for the film's \"A Whole New World,\" sung by Peabo Bryson and Regina Belle. The film's home video VHS release also set a sales record and grossed about $500 million in the United States. Aladdin's success led to various derived works and other material inspired by the film, including two direct-to-video sequels The Return of Jafar (1994) and Aladdin and the King of Thieves (1996), an animated television series, and a Broadway adaptation. A live-action film adaptation directed by Guy Ritchie was released on May 24, 2019.</p><br/><h3>Plot</h3><p>A peddler shows the viewers an oil lamp amongst his wares, and begins to tell the story of the lamp.</p><p>Jafar, a ruthless sorcerer and the royal vizier of the Middle Eastern city of Agrabah, seeks a lamp hidden within the Cave of Wonders. The cave's guardian tells him that only one person is worthy to enter: \"the diamond in the rough\", whom Jafar later identifies as a young street urchin named Aladdin. Meanwhile, Princess Jasmine is upset by her obligation to marry a prince due to the law rather than for love. Concealing herself, she escapes the palace and is saved from an angry merchant by Aladdin and his pet monkey Abu. As a bond between Aladdin and Jasmine develops, the palace guards capture Aladdin on Jafar's orders, during which Jasmine reveals herself. She confronts Jafar to demand Aladdin's release, but he lies to her, saying Aladdin has been executed.</p><p>Disguised as an elderly beggar, Jafar frees Aladdin and Abu and brings them to the cave, ordering them to retrieve the lamp. The guardian grants Aladdin entry, but warns him to touch nothing but the lamp. Aladdin finds both the lamp and a magic carpet inside, but Abu greedily grabs a large jewel, triggering the cave's collapse. Aladdin gives the lamp to Jafar, who throws him and Abu into the collapsing cave, though not before Abu steals it back. Trapped, Aladdin rubs the lamp and meets the genie who lives inside it. The Genie grants Aladdin three wishes, though Aladdin tricks him into freeing them all from the cave without using a wish. Upon learning that the Genie desires to be released from servitude, Aladdin promises to use his last wish to free him. Aladdin uses his first wish to become a prince, intending to woo Jasmine.</p><p>Jafar's parrot minion Iago suggests to his master that he can become Sultan by marrying Jasmine. Aladdin, as \"Prince Ali Ababwa,\" arrives in Agrabah with a large host, but Jasmine is angered when her father, the Sultan, discusses her marriage with only Aladdin and Jafar. As a means of apologizing, Aladdin takes Jasmine on a ride with the magic carpet. When she infers his true identity, he claims that he only dresses as a commoner to escape the stresses of royal life. After Aladdin brings Jasmine home, the palace guards capture him on Jafar's behest and throw him into the sea. The Genie appears and saves Aladdin at the cost of his second wish. Aladdin returns to the palace and exposes Jafar's plot, prompting the latter to flee, but not before he glimpses the lamp and determines Aladdin's true identity.</p><p>Fearing that he will lose Jasmine if the truth is revealed, Aladdin breaks his promise and refuses to free the Genie. Iago steals the lamp, and Jafar becomes the Genie's new master. He uses his first two wishes to become both Sultan and the world's most powerful sorcerer. He then exposes Aladdin, exiling him, Abu, and the carpet to a frozen wasteland. The three escape and return to Agrabah, where Jasmine tries to help Aladdin steal the lamp back. Jafar notices and overpowers her, Abu, and the carpet with his magic. Aladdin taunts Jafar for being less powerful than the Genie, tricking him into using his last wish to become an all-powerful genie himself. Now bound to his new lamp, Jafar ends up trapped inside it, taking Iago with him. The Genie then throws Jafar's lamp far into the desert, banishing Jafar and Iago to the Cave of Wonders for 10,000 years.</p><p>With Agrabah returned to normal, the Genie encourages Aladdin to use his third wish to regain his royal title and legally marry Jasmine. Aladdin instead decides to keep his promise and frees the Genie. Realizing Aladdin's nobility, the Sultan changes the law to allow Jasmine to marry whoever she chooses. The Genie bids the group a fond farewell and leaves to explore the world, while Aladdin and Jasmine start their new life together.</p><br/><h3>Cast</h3><ul><li>Scott Weinger as Aladdin, a poor yet kind-hearted Agrabah thief. For his audition, Weinger sent in a homemade audition tape as Aladdin with his mother playing the Genie, and after several callbacks found out six months later that he had been cast as the title character. Aladdin's supervising animator was Glen Keane. Brad Kane provides Aladdin's singing voice.</li><li>Robin Williams as the Genie, a hyperactive jinn with great power that can only be exercised when his master wishes it. He serves as the film's comic relief. Clements and Musker had written the role of the Genie for Robin Williams and, when met with resistance, created a reel of a Williams stand-up animation of the Genie. The directors asked Eric Goldberg, Genie's supervising animator, to animate the character over one of Williams' old stand-up comedy routines to pitch the idea to the actor. The resulting test, where Williams' stand-up about schizophrenia was translated into Genie growing another head to argue with himself, made Williams \"laugh his ass off\" and convinced him to sign on for the role. Williams' appearance in Aladdin marks the beginning of a transition in animation to use celebrity voice actors rather than specifically trained voice actors in animated films.Williams also voices a peddler who appears at the beginning of the film, who the directors confirmed to be the same Genie in disguise narrating the story. The peddler's singing voice was provided by Bruce Adler.</li><li>Williams also voices a peddler who appears at the beginning of the film, who the directors confirmed to be the same Genie in disguise narrating the story. The peddler's singing voice was provided by Bruce Adler.</li><li>Linda Larkin as Jasmine, the princess of Agrabah and daughter of the Sultan, who is bored with life in the royal palace. Larkin was chosen for the role of Jasmine nine months after her audition, and had to adjust, or lower, her high-pitched voice to reach the voice the filmmakers were looking for in the character. Jasmine's supervising animator was Mark Henn. Lea Salonga provides Jasmine's singing voice.</li><li>Jonathan Freeman as Jafar, the power-hungry Grand vizier of Agrabah. Freeman was the first actor cast and spent one year and nine months recording his dialogue. He later readjusted his voice after Weinger and Larkin were cast as he felt \"Jafar had to be seen as a real threat to Aladdin and Jasmine,\" as he was originally envisioned as an irritable character, but the directors decided that a calm villain would be scarier. Jafar's supervising animator was Andreas Deja, while Jafar's beggar and snake forms are animated by Kathy Zielinski.</li><li>Frank Welker as Abu, Aladdin's kleptomaniac pet monkey with a falsetto voice. Welker also voices Jasmine's tiger Rajah and the Cave of Wonders. Duncan Marjoribanks was the supervising animator for Abu, Aaron Blaise was the supervising animator for Rajah, and Goldberg was the supervising animator for the Cave of Wonders.</li><li>Gilbert Gottfried as Iago, Jafar's sardonic, hot-tempered parrot assistant. Although he is not anthropomorphic at all, he uses his ability to mimic speech to communicate on a human level. Will Finn was the supervising animator for Iago.</li><li>Douglas Seale as the Sultan, the naive yet friendly ruler of Agrabah, who desperately tries to find a suitor for his daughter Jasmine. The Sultan's supervising animator was David Pruiksma.</li><li>Jim Cummings as Razoul, the Captain of the Guards. Phil Young and Chris Wahl animated him and the other guards.</li><li>Charlie Adler as Gazeem, a thief that Jafar sends into the Cave of Wonders at the beginning of the film, but is trapped inside for being unworthy. Gazeem was animated by T. Daniel Hofstedt.</li><li>Corey Burton as Prince Achmed, an arrogant prince whom Jasmine rejects as a suitor.</li></ul><br/><h3>Production</h3><h4>Script and development</h4><p>In 1988, lyricist Howard Ashman pitched the idea of an animated musical adaptation of Aladdin. Ashman had written a 40-page film treatment remaining faithful to the plot and characters of the original story, but envisioned as a campy 1930s-style musical with a Cab Calloway/Fats Waller-like Genie. Along with partner Alan Menken, Ashman composed several songs and added original characters such as Aladdin's friends named Babkak, Omar, and Kassim to the story.: 216 However, Michael Eisner did not think a story set in the Middle East would be commercially appealing, and their project was removed from active development. Ashman and Menken were later recruited to compose songs for Beauty and the Beast (1991). Linda Woolverton, who had also worked on Beauty and the Beast, used their treatment and developed a draft with inspired elements from The Thief of Bagdad (1940), such as a villain named Jaf'far, an aged sidekick retired human thief named Abu, and a human handmaiden for the princess. Then, directors Ron Clements and John Musker joined the production, picking Aladdin out of three projects offered, which also included an adaptation of Swan Lake and King of the Jungle—that eventually became The Lion King (1994). Before Ashman's death in March 1991, he and Menken had composed \"Prince Ali\" and his last song, \"Humiliate the Boy.\"</p><p>Musker and Clements wrote a draft of the screenplay, and then delivered a story reel to studio chief Jeffrey Katzenberg in April 1991. Katzenberg thought the script \"didn't engage,\" and on a day known by the staff as \"Black Friday,\" demanded that the entire story be rewritten without rescheduling the film's November 25, 1992 release date. Katzenberg requested for Clements and Musker to not be heavily dependent on Ashman's vision,: 217 and the removal of Aladdin's mother, remarking, \"Eighty-six the mother. The mom's a zero.\" Katzenberg also influenced in changing the plot element about Jasmine's marriage, which originally had her required by law to be married by sixteen, to remove the age—the Sultan only says \"your next birthday\"—and make it more specific that her suitor needed to be a prince, which would also set up the ending where the Sultan, inspired by Aladdin's altruism, changes the law to make Jasmine able to marry anyone she deems worthy.</p><p>Screenwriting duo Ted Elliott and Terry Rossio were brought in to rework the story, and the changes they made included the removal of Aladdin's mother, the strengthening of the character of Princess Jasmine, and the deletion of several Ashman and Menken's songs. Aladdin's personality was rewritten to be \"a little rougher, like a young Harrison Ford,\" and the parrot Iago, originally conceived as an uptight British archetype, was reworked into a comic role after the filmmakers saw Gilbert Gottfried in Beverly Hills Cop II (1987), who was then cast for the role. By October 1991, Katzenberg was satisfied with the new version of Aladdin. As with Woolverton's screenplay, several characters and plot elements were based on The Thief of Bagdad (1940), though the location of the film was changed from Baghdad to the fictional Arabian city of Agrabah.</p><p>According to 1994 article in The Advocate, Katzenberg asked Thomas Schumacher, an openly gay producer, if any of the gay references in the film offended him, such as a scene where the Genie turns into an \"effeminate clothier\", and another in which he tells Aladdin that \"I really like you too, kid, but that doesn't mean I want to pick out curtains with you\". Schumacher responded that such references were in \"good fun\", remarking that \"I know we all argue amongst ourselves, but why try to deny the fact that swishy fashion designers exist? They do! What are we running from? Show me ten hairdressers; I'll show you eight gay men\".</p><h4>Design and animation</h4><p>The design for most characters was based on the work of caricaturist Al Hirschfeld, which production designer Richard Vander Wende also considered appropriate to the theme, due to similarities to the flowing and swooping lines found in Arabic calligraphy. Jafar's design was not based on Hirschfeld's work because Jafar's supervising animator, Andreas Deja, wanted the character to be contrasting. Each character was animated alone, with the animators consulting each other to make scenes with interrelating characters. Since Aladdin's animator Glen Keane was working in the California branch of Walt Disney Feature Animation, and Jasmine's animator Mark Henn was in the Florida one at Disney-MGM Studios, they had to frequently phone, fax or send designs and discs to each other. The animators filmed monkeys at the San Francisco Zoo to study their movements for Abu's character. Iago's supervising animator Will Finn tried to incorporate some aspects of Gottfried's appearance into the parrot's design, especially his semi-closed eyes and the always-appearing teeth. Some aspects of the Sultan were inspired by the Wizard of Oz, to create a bumbling authority figure. Andreas Deja, Jafar's supervising animator, tried to incorporate Jonathan Freeman's facial expressions and gesturing into the character. Animator Randy Cartwright described working on the Magic Carpet as challenging, since it is only a rectangular shape, that expresses itself through pantomime—\"It's sort of like acting by origami.\" Cartwright kept folding a piece of cloth while animating to see how to position the Carpet. After the character animation was done, the carpet's surface design was applied digitally.</p><blockquote>\"In early screenings, we played with him being a little bit younger, and he had a mother in the story. In design he became more athletic-looking, more filled out, more of a young leading man, more of a teen-hunk version than before.\"</blockquote><p>–John Musker on Aladdin's early design</p><p>Designed by a team led by supervising animator Glen Keane, Aladdin was initially going to be as young as thirteen, and was originally made to resemble actor Michael J. Fox. During production, it was decided that the design was too boyish and lacked appeal, so the character was made eighteen and redesigned to add elements derived from actor Tom Cruise and Calvin Klein models.</p><p>For the scenery design, various architectural elements seen in 19th-century orientalist paintings and photographs of the Arab world were used for guidance. Other inspirations for design were Disney's animated films from the 1940s and '50s and the 1940 film The Thief of Bagdad. The coloring was done with the computerized CAPS process, and the color motifs were chosen according to the personality—the protagonists use light colors such as blue, the antagonists darker ones such as red and black, and Agrabah and its palace use the neutral color yellow. Computer animation was used for several elements of the film, such as the tiger entrance of the Cave of Wonders and the scene where Aladdin tries to escape the collapsing cave. Some of the software that was used was Pixar's RenderMan.</p><p>Musker and Clements created the Genie with Robin Williams in mind; even though Katzenberg suggested actors such as John Candy, Steve Martin and Eddie Murphy, Williams was approached and eventually accepted the role. Williams came for voice recording sessions during breaks while filming two other films he was starring in at the time, Hook (1991) and Toys (1992). Unusually for an animated film, much of Williams's dialogue was ad-libbed. For some scenes, Williams was given topics and dialogue suggestions, but allowed to improvise his lines. It was estimated that Williams improvised 52 characters. Eric Goldberg, the supervising animator for the Genie, then reviewed Williams's recorded dialogue and selected the best gags and lines that his crew would create character animation to match.</p><p>The producers added many in-jokes and references to Disney's previous works in the film, such as a \"cameo appearance\" from directors Clements and Musker and drawing some characters based on Disney workers. Beast, Sebastian, and Pinocchio make brief appearances, and the wardrobe of the Genie at the end of the film—a Goofy hat, a Hawaiian shirt, and sandals—are a reference to a short film that Robin Williams did for the Disney-MGM Studios tour in the late 1980s.</p><h4>Robin Williams' conflicts with the studio</h4><p>In gratitude for his success with Touchstone Pictures' Good Morning, Vietnam, Robin Williams voiced the Genie for SAG scale pay—$75,000—instead of his asking fee of $8 million, on the condition that his name or image not be used for marketing, and his (supporting) character not take more than 25% of space on advertising artwork, since Williams' film Toys was scheduled for release one month after Aladdin's debut. For financial reasons, the studio went back on the deal on both counts, especially in poster art by having the Genie in 25% of the image, but having other major and supporting characters portrayed considerably smaller. The Disney Hyperion book Aladdin: The Making of an Animated Film listed both of Williams's characters \"The Peddler\" and \"The Genie\" ahead of main characters, but was forced to refer to him only as \"the actor signed to play the Genie.\"</p><p>Disney, while not using Williams' name in commercials as per the contract, used his voice for the Genie in the commercials and used the Genie character to sell toys and fast food tie-ins, without having to pay Williams additional money; Williams unhappily quipped at the time, \"The only reason Mickey Mouse has three fingers is because he can't pick up a check.\" Williams explained to New York magazine that his previous Mork & Mindy merchandising was different because, \"the image is theirs. But the voice, that's me; I gave them myself. When it happened, I said, 'You know I don't do that.' And they apologized; they said it was done by other people.\" Disney attempted to assuage Williams by sending him a Pablo Picasso painting worth more than $1 million at the time, but this move failed to repair the damaged relationship, as the painting was a self-portrait of Picasso as the artist Vincent van Gogh and apparently really \"clashed\" with the Williams' wilder home decor. Williams refused to sign on for the 1994 direct-to-video sequel The Return of Jafar, so it was Dan Castellaneta who voiced the Genie. When Jeffrey Katzenberg was replaced by Joe Roth as Walt Disney Studios chairman, Roth organized a public apology to Williams. Williams would, in turn, reprise the role in the second sequel, Aladdin and the King of Thieves, in 1996.</p><h4>Music</h4><p>Aladdin was the third—after The Little Mermaid (1989) and Beauty and the Beast (1991)—and final Disney film Alan Menken and Howard Ashman had collaborated on, with Tim Rice taking over as lyricist after Ashman had died in March 1991. Although fourteen songs were written for Aladdin, only seven are featured in the film, three by Ashman and four by Rice. Menken, Ashman, and Rice were praised for creating a soundtrack that is \"consistently good, rivaling the best of Disney's other animated musicals from the '90s.\" The Special Edition soundtrack released in 2004 included four songs in early animation tests, and a music video of one, \"Proud of Your Boy,\" performed by Clay Aiken, which also appears on the album Disneymania 3. The version of the song \"A Whole New World\" performed by Peabo Bryson and Regina Belle, which plays over the end credits, is, as of 2019, the only Disney song to win a Grammy Award for Song of the Year.</p><br/><h3>Themes</h3><blockquote>\"The original story was sort of a winning the lottery kind of thing ... Like having anything you could wish for would be the greatest thing in the world and having it taken away from you is bad, but having it back is great. We didn't really want that to be the message of the movie.\"</blockquote><p>–Ron Clements</p><p>The filmmakers thought the moral message of the original tale was inappropriate, and decided to \"put a spin on it\" by making the fulfillment of wishes seem like a great solution, but eventually becoming a problem. Another major theme was avoiding an attempt to be what the person is not—both Aladdin and Jasmine get into trouble pretending to be different people, and the Prince Ali persona fails to impress Jasmine, who only falls for Aladdin when she finds out who he truly is. Being \"imprisoned\" is also presented, a fate that occurs to most of the characters—Aladdin and Jasmine are limited by their lifestyles, Genie is attached to his lamp, and Jafar to the Sultan—and is represented visually by the prison-like walls and bars of the Agrabah palace, and the scene involving caged birds which Jasmine later frees. Jasmine is also depicted as a different type of Disney Princess, being rebellious against the royal life and the social structure.</p><br/><h3>Release</h3><h4>Box office</h4><p>A large promotion campaign preceded Aladdin's debut in theaters, with the film's trailer being attached to most Disney VHS releases (including One Hundred and One Dalmatians in April 1992 and Beauty and the Beast in October that year), and numerous tie-ins and licensees being released. Aladdin was released on November 11, 1992 in two theatres (the El Capitan Theatre in Los Angeles and the City Cinemas 1, 2 and 3rd Avenue in New York City) and grossed $196,664 in its first 5 days. The film expanded to 1,131 theaters on November 25, 1992, grossing $19.2 million for the weekend, finishing second at the US box office, behind Home Alone 2: Lost in New York. It took eight weeks for the film to surpass Beauty and the Beast as the most successful animated Disney film at the domestic box office (surpassed by The Lion King in 1994).</p><p>For its eighth week of release, Aladdin collected $15.6 million and reached the number one spot at the box office, beating A Few Good Men. By February 1993, it would go on to surpass Batman Returns to become the highest-grossing 1992 film domestically. In the United States, the film held the top spot for five times weekly and breaks the record for the week between Christmas and New Year's Eve with $32.2 million during its 22-week run. Aladdin was the most successful film of 1992, grossing $217 million in the United States and over $504 million worldwide. It was the biggest gross for an animated film until The Lion King two years later, and was the first full-length animated film to gross $200 million in the United States and Canada. Additionally, it was the first film to cross that mark since Terminator 2: Judgment Day (1991).</p><p>Outside of the United States and Canada, the film grossed $200 million in 1993, and $250 million by January 1994. In Europe, Aladdin defeated Jurassic Park to become the continent's box office leader. It set an opening weekend record in South Africa. By 2002, the film had grossed $287 million overseas and $504 million worldwide. Currently, it is the 35th highest-grossing animated film and the third highest-grossing traditionally animated feature worldwide, behind The Lion King and The Simpsons Movie (2007). It sold an estimated 52.4 million tickets in the United States and Canada. When adjusted for inflation (in 2022 dollars), its domestic gross totals $491.4 million.</p><h4>Home media</h4><p>The film was first released in VHS on September 29, 1993, as part of the Walt Disney Classics line, although, it was not officially advertised until October 1. In its first three days of availability, Aladdin sold 10.8 million copies, setting the fastest sales record and grossing about $265,000,000 (equivalent to $537,000,000 in 2022) in the United States. In less than three weeks, the VHS release of Aladdin sold over 16 million units and grossed over $400,000,000 (equivalent to $810,000,000 in 2022) in the United States. Upon release of the Sega Genesis video game adaptation in November, Aladdin sold about 30 million home video units, earning over $500,000,000 (equivalent to $1,010,000,000 in 2022) in the United States. It was the best-selling home video release up until its record was later broken by The Lion King. This VHS edition entered moratorium on April 30, 1994. A THX-certified widescreen LaserDisc was issued on September 21, 1994, and a Spanish-dubbed VHS for the American market was released on April 14, 1995. In Japan, 2.2 million home video units were sold by 1995.</p><p>On October 5, 2004, Aladdin was re-released onto VHS and for the first time released on DVD, as part of Disney's Platinum Edition line. The DVD release featured retouched and cleaned-up animation, which had been prepared for the film's planned but ultimately cancelled IMAX reissue in 2003, and a second disc with bonus features. Accompanied by a $19 million marketing campaign, the DVD sold about 3 million units in its first month. The film's soundtrack was available in its original Dolby 5.1 track or in a new Disney Enhanced Home Theater Mix. The DVD went into moratorium in January 2008, along with its sequels.</p><p>According to an insert in the Lady and the Tramp Diamond Edition release case, Aladdin was going to be released on Blu-ray as a Diamond Edition in Spring 2013. Instead, Peter Pan was released on Blu-ray as a Diamond Edition on February 5, 2013, to celebrate its 60th anniversary. A non-Diamond Edition Blu-ray was released in a few select European countries in March 2013. The Belgian edition (released without advertisements, commercials or any kind of fanfare) comes as a single-disc version with its extras ported over from the Platinum Edition DVD. The same disc was released in the United Kingdom on April 14, 2013. Walt Disney Studios Home Entertainment released the film on a Diamond Edition Blu-ray on October 13, 2015. The film was released on Digital HD on September 29, 2015. Upon its first week of release on home media in the United States, the film topped the Blu-ray Disc sales chart and debuted at number 2 at the Nielsen VideoScan First Alert chart, which tracks overall disc sales behind the disaster film San Andreas. The film's Blu-ray release sold 1.81 million units and grossed $39 million, as of 2017.</p><p>Aladdin was re-released on HD and 4K digital download on August 27, 2019, with a physical media re-release on Blu-ray and Ultra HD Blu-ray on September 10, 2019, as part of the Walt Disney Signature Collection.</p><br/><h3>Reception</h3><h4>Critical reception</h4><p>The review aggregator website Rotten Tomatoes reports that 95% of 76 critics gave the film a positive review, with an average rating of 8.1/10. The site's consensus reads, \"A highly entertaining entry in Disney's renaissance era, Aladdin is beautifully drawn, with near-classic songs and a cast of scene-stealing characters.\" On Metacritic, the film has a weighted average score of 86 out of 100 based on 25 critics, indicating \"universal acclaim.\" Audiences polled by CinemaScore gave the film a rare \"A+\" grade.</p><p>Most critics praised Robin Williams's performance as the Genie, with Janet Maslin of The New York Times declaring that children \"needn't know precisely what Mr. Williams is evoking to understand how funny he is.\" Roger Ebert of the Chicago Sun-Times commented that Williams and animation \"were born for one another.\" Warner Bros. Cartoons director Chuck Jones even called the film \"the funniest feature ever made.\" James Berardinelli gave it 3+1⁄2 out of 4 stars, praising the \"crisp visuals and wonderful song-and-dance numbers.\" Peter Travers of Rolling Stone said the comedy made the film accessible to both children and adults, a vision shared with Desson Howe of The Washington Post, who also said \"kids are still going to be entranced by the magic and adventure.\" Brian Lowry of Variety praised the cast of characters, describing the expressive magic carpet as \"its most remarkable accomplishment\" and considered that \"Aladdin overcomes most story flaws thanks to sheer technical virtuosity.\"</p><p>Some aspects of the film were widely criticized. Ed Gonzalez of Slant Magazine wrote a negative review, describing the film as racist, ridiculous, and a \"narcissistic circus act\" from Robin Williams. Ebert, who had generally praised the film in his review, considered the music inferior to its predecessors The Little Mermaid and Beauty and the Beast, and claimed Aladdin and Jasmine were \"pale and routine.\" He criticized what he saw as the film's use of ethnic stereotypes, writing: \"Most of the Arab characters have exaggerated facial characteristics—hooked noses, glowering brows, thick lips—but Aladdin and the princess look like white American teenagers.\"</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"background:#ccc; text-align:center;\"><th colspan=\"6\" style=\"background: LightSteelBlue;\">List of awards and nominations</th></tr><tr style=\"background:#ccc; text-align:center;\"><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th><th>Ref.</th></tr><tr><td rowspan=\"5\"><span>Academy Awards</span></td><td><span>Best Original Score</span></td><td><span>Alan Menken</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"5\" align=\"center\"></td></tr><tr><td rowspan=\"2\"><span>Best Original Song</span></td><td>\"<span>A Whole New World</span>\" <br> Music by Alan Menken; <br> Lyrics by <span>Tim Rice</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>\"<span>Friend Like Me</span>\" <br> Music by Alan Menken; <br> Lyrics by <span>Howard Ashman</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound</span></td><td><span>Terry Porter</span>, <span>Mel Metcalfe</span>, <span>David J. Hudson</span>, and <span>Doc Kane</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Sound Effects Editing</span></td><td><span>Mark Mangini</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Annie Awards</span></td><td colspan=\"2\"><span>Best Animated Feature</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"2\"><span>ASCAP Film and Television Music Awards</span></td><td>Top Box Office Films</td><td>Howard Ashman, Alan Menken, and Tim Rice</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\" align=\"center\"></td></tr><tr><td>Most Performed Songs from Motion Pictures</td><td>\"A Whole New World\" <br> Music by Alan Menken; <br> Lyrics by Tim Rice</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>BMI Film &amp; TV Awards</span></td><td>Film Music Award</td><td>Alan Menken</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\" align=\"center\"></td></tr><tr><td>Most Performed Song from a Film</td><td>\"A Whole New World\" <br> Music by Alan Menken; <br> Lyrics by Tim Rice</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>British Academy Film Awards</span></td><td><span>Best Score</span></td><td>Alan Menken</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" align=\"center\"></td></tr><tr><td><span>Best Special Visual Effects</span></td><td>Don Paul and Steve Goldberg</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Dallas–Fort Worth Film Critics Association Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" align=\"center\"></td></tr><tr><td colspan=\"2\"><span>Best Animated Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"6\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Motion Picture – Musical or Comedy</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"6\" align=\"center\"></td></tr><tr><td><span>Best Original Score</span></td><td>Alan Menken</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>Best Original Song</span></td><td>\"A Whole New World\" <br> Music by Alan Menken; <br> Lyrics by Tim Rice</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>\"Friend Like Me\" <br> Music by Alan Menken; <br> Lyrics by Howard Ashman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>\"<span>Prince Ali</span>\" <br> Music by Alan Menken; <br> Lyrics by Howard Ashman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Special Achievement Award</td><td><span>Robin Williams</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Golden Reel Awards</span></td><td><span>Best Sound Editing – Animated Feature</span></td><td>Doc Kane, Vince Caro, and Mark Mangini</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td colspan=\"3\"><span>Golden Screen Awards</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"8\"><span>Grammy Awards</span></td><td><span>Record of the Year</span></td><td>\"A Whole New World\" – <span>Peabo Bryson</span>, <span>Regina Belle</span>, and <span>Walter Afanasieff</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"8\" align=\"center\"></td></tr><tr><td><span>Song of the Year</span></td><td>\"A Whole New World\" – Alan Menken and Tim Rice</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Pop Performance by a Duo or Group with Vocals</span></td><td>\"A Whole New World\" – Peabo Bryson and Regina Belle</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Musical Album for Children</span></td><td><i><span>Aladdin: Original Motion Picture Soundtrack</span></i> – Various Artists</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Spoken Word Album for Children</span></td><td><i>Aladdin Sound &amp; Story Theatre</i> – Various Artists</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Instrumental Composition Written for a Motion Picture or for Television</span></td><td><i>Aladdin: Original Motion Picture Soundtrack</i> – Alan Menken</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Best Song Written Specifically for a Motion Picture or for Television</span></td><td>\"A Whole New World\" – Alan Menken and Tim Rice</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>\"Friend Like Me\" – Alan Menken and Howard Ashman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Hugo Awards</span></td><td><span>Best Dramatic Presentation</span></td><td><span>Ron Clements</span>, <span>John Musker</span>, <span>Ted Elliott</span>, <span>Terry Rossio</span>, <br> <span>Burny Mattinson</span>, <span>Roger Allers</span>, <span>Daan Jippes</span>, Kevin Harkey, <br> <span class=\"mw-redirect\">Sue Nichols</span>, <span>Francis Glebas</span>, <span>Darrell Rooney</span>, Larry Leker, <br> James Fujii, Kirk Hanson, <span>Kevin Lima</span>, Rebecca Rees, <br> David S. Smith, <span>Chris Sanders</span>, <span>Brian Pimental</span>, and Patrick A. Ventura</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td>ICG Publicists Awards</td><td colspan=\"2\">Maxwell Weinberg Publicist Showmanship Award</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Los Angeles Film Critics Association Awards</span></td><td><span>Best Animation</span></td><td>John Musker and Ron Clements</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"3\"><span>MTV Movie Awards</span></td><td colspan=\"2\"><span>Best Movie</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\" align=\"center\"></td></tr><tr><td><span>Best Comedic Performance</span></td><td>Robin Williams</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Song From a Movie</span></td><td>Peabo Bryson and Regina Belle – \"A Whole New World\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td><td align=\"center\"></td></tr><tr><td><span>Satellite Awards</span></td><td colspan=\"2\"><span>Outstanding Youth DVD</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"4\"><span>Saturn Awards <span style=\"font-size:85%;\">(1992)</span></span></td><td colspan=\"2\"><span>Best Fantasy Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"5\" align=\"center\"></td></tr><tr><td><span>Best Supporting Actor</span></td><td>Robin Williams</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Performance by a Younger Actor</span></td><td><span>Scott Weinger</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Music</span></td><td>Alan Menken</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Saturn Awards <span style=\"font-size:85%;\">(2004)</span></span></td><td colspan=\"2\"><span>Best Classic Film DVD Release</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Southeastern Film Critics Association Awards</td><td colspan=\"2\">Best Picture</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">3rd Place</td><td align=\"center\"></td></tr><tr><td><span>Young Artist Awards</span></td><td colspan=\"2\">Outstanding Family Entertainment of the Year</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr></tbody></table><p>The film is recognized by American Film Institute in these lists:</p><ul><li>2000: AFI's 100 Years...100 Laughs – Nominated</li><li>2004: AFI's 100 Years...100 Songs:\"Friend Like Me\" – Nominated \"A Whole New World\" – Nominated</li><li>\"Friend Like Me\" – Nominated</li><li>\"A Whole New World\" – Nominated</li><li>2006: AFI's Greatest Movie Musicals – Nominated</li></ul><h4>Controversies</h4><p>One of the verses of the opening song \"Arabian Nights\" was altered following complaints from the American-Arab Anti-Discrimination Committee (ADC). The lyrics were changed in July 1993 from \"Where they cut off your ear if they don't like your face\" in the original release to \"Where it's flat and immense and the heat is intense,\" with the change first appearing on the 1993 video release. The original lyric was intact on the initial CD soundtrack release, but the re-releases use the edited lyric. The Broadway adaptation also uses the edited line. The subsequent line however, \"It's barbaric, but hey, it's home,\" was left intact. Entertainment Weekly ranked Aladdin in a list of the most controversial films in history, due to this incident. The number has been described in reviews as \"simultaneously glamorizing and barbarizing the Arab world.\" The ADC also complained about the portrayal of the lead characters Aladdin and Jasmine. They accused the filmmakers of anglicizeing their features and giving them Anglo-American accents, in contrast to the other characters in the film, which have foreign accents, grotesque facial features, and appear villainous or greedy.</p><p>Concerns were also raised to another scene. When Aladdin is threatened by the tiger Rajah on the palace balcony, Aladdin quietly says a line that some people reported hearing as \"Good teenagers, take off your clothes,\" which they considered a subliminal reference to promiscuity. However, according to the commentary track on the 2004 DVD, while Musker and Clements did admit Scott Weinger ad-libbed during the scene, they claimed \"we did not record that, we would not record that,\" and said the line was \"Good tiger, take off and go...\" and the word \"tiger\" is overlapped by Rajah's snarl. After the word tiger, a second voice can be heard which has been suggested was accidentally grafted onto the soundtrack.</p><p>Animation enthusiasts have noticed similarities between Aladdin and Richard Williams' unfinished film The Thief and the Cobbler (also known as The Princess and the Cobbler under Allied Filmmakers and Arabian Knight under Miramax Films). These similarities include a similar plot, similar characters, scenes and background designs, and the antagonist Zig-Zag's resemblance in character design and mannerisms to Genie and Jafar. Though Aladdin was released first, The Thief and the Cobbler initially began production much earlier in the 1960s, and was mired in difficulties including financial problems, copyright issues, story revisions and late production times caused by separate studios trying to finish the film after Richard Williams was fired from the project for lack of finished work. The late release, coupled with Miramax purchasing and re-editing the film, has sometimes resulted in The Thief and the Cobbler being labeled a rip-off of Aladdin.</p><br/><h3>Legacy</h3><p>Alongside its role in the Disney Renaissance, Aladdin is often credited as the catalyst in the rise of casting film stars as voice actors in Hollywood animated films with the success of Robin Williams's Genie performance. Entertainment writer Scott Meslow wrote that compared with the character of Aladdin, \"Williams's Genie is the character audiences responded to, and—more importantly to Disney—its most marketable character by far,\" which he concludes led to the \"celebrification\" of later animated films such as Shark Tale (2004) and Puss in Boots (2011).</p><br/><h3>Live-action adaptations</h3><h4>Live-action prequel spin-off</h4><p>On July 15, 2015, the studio announced the development of a live-action comedy adventure prequel called Genies. The film was being written by Mark Swift and Damian Shannon, while Tripp Vinson was on board to produce via his Vinson Films banner. It was intended to serve as a lead to the live-action Aladdin film. On November 8, Disney revealed it had originally planned to use Robin Williams' unused lines from the 1991–92 recording sessions for the film, but his will prohibited the studio from using his likeness for 25 years after his death in 2014.</p><h4>Live-action film</h4><p>In October 2016, it was reported that Disney was developing a live-action adaptation of Aladdin with Guy Ritchie signed on to direct the film. John August wrote the script, which will reportedly retain the musical elements of the original film, while Dan Lin was attached as producer. Lin revealed that they were looking for a diverse cast. In April 2017, Will Smith entered talks to play the Genie. The following month, Jade Thirlwall entered talks to portray the role of Jasmine. Alan Menken said filming was slated to begin August 2017. Production had originally been scheduled to begin in July, but was delayed due to Disney having trouble finding the right people to play Aladdin and Jasmine. British actress Naomi Scott and Indian actress Tara Sutaria were being considered to play Jasmine. For the role of Aladdin, British actors Riz Ahmed and Dev Patel were initially considered, but it was later decided that a newcomer should be cast in the role. In July 2017, it was announced that Egyptian-Canadian actor Mena Massoud had been cast as Aladdin, Scott as Jasmine, and Smith as the Genie. At the 2017 D23 Expo, Menken announced that he would be co-writing new songs for the film with Academy Award winners Pasek and Paul while Vanessa Taylor would re-write the script. In August 2017, Marwan Kenzari, Nasim Pedrad, and Numan Acar joined the cast as Jafar, Dalia, and Hakim, respectively. The following month, Billy Magnussen and Navid Negahban were cast as Prince Anders and the Sultan, respectively. Filming began on September 6, 2017, at Longcross Studios and concluded on January 24, 2018. The film was released on May 24, 2019.</p><br/>"
  },
  "errorMessage": ""
}