{
  "imDbId": "tt6791350",
  "title": "Guardians of the Galaxy Vol. 3",
  "fullTitle": "Guardians of the Galaxy Vol. 3 (2023)",
  "type": "Movie",
  "year": "2023",
  "items": [
    {
      "publisher": "Screen Rant",
      "author": "Molly Freeman",
      "link": "",
      "rate": "90",
      "content": "Guardians of the Galaxy Vol. 3 mixes Gunn's usual wacky action and laugh-out-loud humor with a grounded, emotional story to create something special."
    },
    {
      "publisher": "TheWrap",
      "author": "William Bibbiani",
      "link": "https://www.thewrap.com/guardians-of-the-galaxy-3-review/",
      "rate": "83",
      "content": "For all the emotional resonance and action-packed blockbuster mayhem in Guardians of the Galaxy Volume 3, it’s still got a lot of impish nonsense, jarring tonal shifts, and enough morbidity and outright gore that it’s now abundantly clear that the PG-13 rating doesn’t mean anything more. This is a movie that will probably traumatize some kids and maybe a few adults."
    },
    {
      "publisher": "Collider",
      "author": "Ross Bonaime",
      "link": "",
      "rate": "83",
      "content": "Guardians of the Galaxy Vol. 3 isn’t just the ideal sendoff for this group, it’s the best MCU film in years, and a reminder of how much fun and moving the Marvel Cinematic Universe can actually be after film-after-film of recent disappointments. The Guardians of the Galaxy were the best corner of the MCU, and Gunn has created the perfect goodbye to this gang of misfits."
    },
    {
      "publisher": "IGN",
      "author": "Joshua Yehl",
      "link": "",
      "rate": "80",
      "content": "The Guardians of the Galaxy deliver their swan song in Vol. 3 and it’s a rockin’ good time. Through Rocket’s tragic origin story we’re given a new appreciation for this whole family of lovable malcontents. And even though the plot has a bit too much going on, some of the humor feels stale, and Adam Warlock was woefully underused, the cast’s incredible chemistry and James Gunn’s soulful style remain unlike anything else in the MCU, and this movie sends them out on an emotional and action-packed high note."
    },
    {
      "publisher": "Consequence",
      "author": "Liz Shannon Miller",
      "link": "https://consequence.net/2023/04/guardians-of-the-galaxy-3-review-james-gunn/",
      "rate": "75",
      "content": "A space adventure that is alternately funny and upsetting, featuring a literal menagerie of the strange and unconventional."
    },
    {
      "publisher": "RogerEbert.com",
      "author": "Brian Tallerico",
      "link": "https://www.rogerebert.com/reviews/guardians-of-the-galaxy-volume-3-2023",
      "rate": "75",
      "content": "Watching his Guardians of the Galaxy, Vol. 3 is to see a director who knows how to balance corporate need with personal blockbuster filmmaking. Mostly."
    },
    {
      "publisher": "Movie Nation",
      "author": "Roger Moore",
      "link": "https://rogersmovienation.com/2023/04/28/movie-review-guardians-of-the-galaxy-volume-3-takes-a-sharper-turn-towards-serious/",
      "rate": "50",
      "content": "These pictures have grown less cute, less charming and less fun with each passing installment, and this one just drags as it meanders towards its over-hyped lump-in-throat finale."
    },
    {
      "publisher": "Slant Magazine",
      "author": "",
      "link": "",
      "rate": "50",
      "content": "The film undermines its initial sense of intimacy and momentum with a stop-and-start story structure that by and large exists to make as much room as possible for its characters’ banter."
    },
    {
      "publisher": "Slashfilm",
      "author": "Chris Evangelista",
      "link": "https://www.slashfilm.com/1271063/guardians-of-the-galaxy-3-review/",
      "rate": "50",
      "content": "And that, perhaps, is the real fatal flaw of \"Guardians of the Galaxy Vol. 3.\" Gunn's first two movies felt different. They stood out from the pack and had their own unique personality. But \"Vol. 3\" feels like more of the same. I'm not suggesting Gunn and company are phoning it in this time around, but it certainly feels like the magic has faded. Whatever alchemy the filmmaker worked to make the first two \"Guardians\" movies memorable has evaporated into the ether."
    },
    {
      "publisher": "Arizona Republic",
      "author": "Bill Goodykoontz",
      "link": "https://www.azcentral.com/story/entertainment/movies/billgoodykoontz/2023/04/28/guardians-of-the-galaxy-vol-3-review/70154449007/",
      "rate": "50",
      "content": "It’s not a disaster, and it doesn’t lack for ambition. But it’s wildly uneven and kind of blah, if that can be said of a movie with nonstop, often incoherent action, self-aware needle drops and not nearly enough smart-aleck quips from a cast we’ve seen deliver plenty of them in the past."
    }
  ],
  "errorMessage": ""
}