{
  "imDbId": "tt0062622",
  "title": "2001: A Space Odyssey",
  "fullTitle": "2001: A Space Odyssey (1968)",
  "type": "Movie",
  "year": "1968",
  "items": [
    {
      "publisher": "Austin Chronicle",
      "author": "Marjorie Baumgarten",
      "link": "https://www.austinchronicle.com/events/film/2001-a-space-odyssey/",
      "rate": "100",
      "content": "This is the way this ground-breaking monument was meant to be seen: in mind-boggling 70mm."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "100",
      "content": "Its special effects are used so seamlessly as part of an overall artistic strategy that, as critic Annette Michelson has pointed out, they don't even register as such, and thus are almost impossible to trivialize, a feat unmatched in movies."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "Only a few films are transcendent, and work upon our minds and imaginations like music or prayer or a vast belittling landscape...Alone among science-fiction movies, 2001 is not concerned with thrilling us, but with inspiring our awe."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Michael Wilmington",
      "link": "",
      "rate": "100",
      "content": "A masterpiece that can still leave you dizzy with wonder. As much as any movie ever made, this visionary science-fiction tale of space travel and first contact with extraterrestrial life is a spellbinding experience."
    },
    {
      "publisher": "Empire",
      "author": "Angie Errigo",
      "link": "",
      "rate": "100",
      "content": "Its faults - sketchy narrative, overblown abstraction - are counterbalanced by its gripping engagement between man and machine, and its rhapsodic wonder at heaven and earth and the infinite beyond."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "",
      "rate": "100",
      "content": "Still the grandest of all science-fiction movies."
    },
    {
      "publisher": "Premiere",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "With 2001, Stanley Kubrick proved that a sci-fi movie could be philosophical rather than pulpy, profound rather than pedantic."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "100",
      "content": "Watching this film demands two qualities that are sadly lacking in all but the most mature and sophisticated audiences: patience and a willingness to ponder the meaning of what's transpiring on screen. 2001 is awe inspiring, but it is most definitely not a \"thrill ride.\" It is art, it is a statement, and it is indisputably a cinematic classic."
    },
    {
      "publisher": "Salon",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "Beloved for many different reasons, including its scrupulous scientific accuracy, its vast reach from \"The Dawn of Man\" to the next stage of human evolution, its unrivaled integration of musical and visual composition, its daring paucity of dialogue and washes of silence, its astonishingly creative psychedelic sequence and its still-gorgeous pre-digital special effects."
    },
    {
      "publisher": "",
      "author": "The New York Times",
      "link": "https://archive.nytimes.com/www.nytimes.com/library/film/040468kubrick-2001.html",
      "rate": "60",
      "content": "The movie is so completely absorbed in its own problems, its use of color and space, its fanatical devotion to science-fiction detail, that its is somewhere between hypnotic and immensely boring."
    }
  ],
  "errorMessage": ""
}