{
  "imDbId": "tt0062622",
  "title": "2001: A Space Odyssey",
  "fullTitle": "2001: A Space Odyssey (1968)",
  "type": "Movie",
  "year": "1968",
  "items": [
    {
      "username": "simon_booth",
      "userUrl": "https://www.imdb.com/user/ur1062540",
      "reviewLink": "https://www.imdb.com/review/rw0100969",
      "warningSpoilers": false,
      "date": "17 June 2003",
      "rate": "10",
      "helpful": "1,598 out of 2,231 found this helpful.",
      "title": "Unmatched accomplishment",
      "content": "Sometimes reading the user comments on IMDB fills me with despair for the species. For anybody to dismiss 2001: A Space Odyssey as \"boring\" they must have no interest in science, technology, philosophy, history or the art of film-making. Finally I understand why most Hollywood productions are so shallow and vacuous - they understand their audience.Thankfully, those that cannot appreciate Kubrick's accomplishment are still a minority. Most viewers are able to see the intelligence and sheer virtuosity that went into the making of this epic. This is the film that put the science in \"science fiction\", and its depiction of space travel and mankind's future remains unsurpassed to this day. It was so far ahead of its time that humanity still hasn't caught up.2001 is primarily a technical film. The reason it is slow, and filled with minutae is because the aim was to realistically envision the future of technology (and the past, in the awe inspiring opening scenes). The film's greatest strength is in the details. Remember that when this film was made, man still hadn't made it out to the moon... but there it is in 2001, and that's just the start of the journey. To create such an incredibly detailed vision of the future that 35 years later it is still the best we have is beyond belief - I still can't work out how some of the shots were done. The film's only notable mistake was the optimism with which it predicted mankind's technological (and social) development. It is our shame that the year 2001 did not look like the film 2001, not Kubrick's.Besides the incredible special effects, camera work and set design, Kubrick also presents the viewer with a lot of food for thought about what it means to be human, and where the human race is going. Yes, the ending is weird and hard to comprehend - but that's the nature of the future. Kubrick and Clarke have started the task of envisioning it, now it's up to the audience to continue. There's no neat resolution, no definitive full stop, because then the audience could stop thinking after the final reel. I know that's what most audiences seem to want these days, but Kubrick isn't going to let us off so lightly.I'm glad to see that this film is in the IMDB top 100 films, and only wish that it were even higher. Stanley Kubrick is one of the very finest film-makers the world has known, and 2001 his finest accomplishment. 10/10."
    },
    {
      "username": "Wesley-Wang",
      "userUrl": "https://www.imdb.com/user/ur73224356",
      "reviewLink": "https://www.imdb.com/review/rw4128309",
      "warningSpoilers": true,
      "date": "14 April 2018",
      "rate": "10",
      "helpful": "697 out of 827 found this helpful.",
      "title": "Legendary",
      "content": "A stand-alone monument in cinema history, Stanley Kubrick's magnum opus 2001: A Space Odyssey (1968) is an undeniable masterpiece. 2001 not only shattered science fiction genre conventions, but gave cinema a whole new meaning. From the grandiosity of its futuristic idea to its ambitious execution, 2001 isn't concerned with entertaining us- but rather to inspire us with awe. I've never seen a person say, \"2001: A Space Odyssey? I don't think I've seen it... oh wait, the one with like, the spaceships and stuff?\", while most movies today are forgotten once the credits roll. What viewers must understand is that 2001 not the type of movie where you \"get it\" or not, nor is it designed to thrill us with flashy special effects- but as Kubrick said, is \"...intended to be an intensely subjective experience that reaches the viewer at an inner level of consciousness.\" In it of itself, exploring the philosophical and scientific arenas of mankind while serving as a groundbreaking achievement both on a conceptual and technical level is a hell of an accomplishment, but to transcend the audience to a whole new dimension all in one- that's sheer genius at its highest form.At its premiere, 2001 polarized critics and audiences alike. Walkouts numbered well over 200, including Rock Hudson who asked, \"Will someone tell me what the hell this is all about?\" The New York Times remarked, \"Somewhere between hypnotic and immensely boring.\" \"Superb photography major asset to confusing, long-unfolding plot,\" Newsday commented. Renowned critic Pauline Kael even went as far as calling 2001 \"trash masquerading as art\". It's understandable, though. In a time in which excitement revolving around interstellar exploration and extra-terrestrial life was everyday talk, audiences came into 2001 expecting answers. When will we reach the moon? What does the future hold? Are we alone? To their great surprise, 2001 did the paradoxical; leaving more questions to answer than answered questions.Even though the late 60s marked the height of technological optimism, Kubrick saw ahead, highlighting the potential negatives of technological advancement. Notice the contrast between how apes and humans approach the monolith. The apes approach it with dignity, respect, and mindfulness. The humans approach it with arrogance, grouping astronauts in front of the monolith to take a picture. Since the monolith represents the incomprehensible (man, with his limited senses, cannot comprehend the absence (perfect black) of color or light), Kubrick may be suggesting the manner in which we handle new information is careless and hasty, emphasized in the Clavius base briefing. Scientists discuss how to distribute this exciting news to the public, for \"if the facts were prematurely and suddenly stated without adequate preparation and conditioning\", as stated by Dr. Heywood Floyd (William Sylvester), it may cause \"cultural shock and social disorientation\". It's a significant message to the anxious people of 1968 to perceive fresh information precisely and draw conclusions logically.Yet apes are not much better. They're not willing to share food and water with their fellow apes, and with the discovery of bones as weapons, kill their own race for a puddle of water- possibly foreshadowing our own demise if we continue to advance artificial intelligence. Because like our ancestors, at heart, mankind has been and will always be selfish.Far before The Terminator (1984) or The Matrix (1999) accentuated the dangers of artificial intelligence, there was 2001. H.A.L 9000, voice played by Douglas Rain, was ingeniously crafted into one of the most terrifying villains in film history. There's something about his calm voice, unpredictability, and especially, his omniscient single red eye that's so frightening. Kubrick utilizes one of his favorite filmmaking devices to compare artificial intelligence with humans: irony. Neither Dave Bowman (Keir Dullea) or Frank Poole (Gary Lockwood) display much emotion throughout the film, while H.A.L, albeit a machine, exhibits some while pleading for life singing \"Daisy\" (which, by the way, is a heart-wrenching scene) and murdering his crew members. There are clear connotations of humanity's fate when H.A.L attempts to kill Frank, Dave, and the hibernating crew members. Yet H.A.L, contrast to what he may think, is not perfect. If he was incapable of miscalculating even the slightest bit, he wouldn't have gotten himself killed. Kubrick implies that artificial intelligence has not yet reached the level of annihilating the human race, but if we are not careful, they soon will.This idea coincides with the perplexing final sequence, resembling man reaching the next stage of evolution. After the famous \"Star Gate\" sequence, Dave is enlightened in a room. The setting hints at the Enlightenment Era, exquisitely decorated in 18th century style and embellished with lavish paintings and furniture. Notice how the room is solely lit through the transparent ground, establishing a heavenly environment. The eerie silence is ominous, magnifying the mystical aura that is ever so present in the timelessness of the final scene. As Dave exits his EVA pod, he watches himself age rapidly through one-point perspective. He knocks over a wine glass while eating, suggesting that man, no matter how advanced, will keep making mistakes. As he lays on his deathbed later, he reaches out to the monolith, alluding to Adam reaching out to God in Michelangelo's The Creation of Adam. After man is enlightened, he inevitably dies.A pessimistic ending? No. Man is then transported back to Earth as a \"Space Baby\", an infinitely more advanced race, marking a new age of evolution. A masterful stroke of genius, Kubrick ends hopeful, giving us another chance to improve on our mistakes. Or is it hopeful? Is he implying that civilization is evolving badly? Or is he suggesting that civilization will NEVER evolve? There are multiple interpretations of the ending, and it's a question for you to answer.There is such a great deal of symmetry in 2001's composition throughout the film, possibly suggesting the equilibrium present in the universe. The painstakingly slow pace also compliments the exactness of its harmony, practically forcing you to admire its artistry. While Andrei Tarkovsky's work would breathe with such organic and poetic beauty, Kubrick's artificial visual fluidity mesmerizes the eye with meticulous precision and thoroughness. Each shot, averaging 13.6 seconds, possesses a sense of purity and perfection that can only be achieved through the medium of cinema.But of course, it's impossible not to talk about 2001 without mentioning one aspect. The visual effects are so unanimously praised that it's hopeless to even try to describe how groundbreaking and influential they were. Hopeless. I can talk for days about the impeccable zero-gravity effects, clever rotating sets, fastidiously constructed spaceships, the brilliant use of slit-scan photography for the psychedelic Star Gate sequence, or how it pioneered the use of front projection with retroreflective matting, but what's the point? You don't need me to appreciate 2001's immaculate visuals.Finally, the choice of music is outstanding. Originally, Alex North was appointed to score the film, but Kubrick turned it down in post-production. Critic Roger Ebert explains it perfectly, \"North's (rejected) score, which is available on a recording, is a good job of film composition, but would have been wrong for 2001 because, like all scores, it attempts to underline the action-to give us emotional cues. The classical music chosen by Kubrick exists outside the action. It uplifts. It wants to be sublime; it brings a seriousness and transcendence to the visuals.\"\"But why all the slow parts?\" asks the one who fell asleep. Primarily, to establish tone. Unlike the low-budget commercial science fiction movies preceding it, 2001 was meant to be taken seriously. It symbolizes a quest for whether God exists or not, challenges humanity's fate, and questions evolution as a whole. If each shot's average length was two seconds and there was some sappy romantic love subplot mixed in between, the whole film would've been a mess. Space isn't fast-paced like we see in most movies. Space is slow-really, really, slow. The addition of three minutes and seventeen seconds of a black screen in the beginning was also pure genius, a signal for casual moviegoers to get out of the theater now and save your time.Thankfully, its ingenuity was gradually recognized, and it's now widely regarded as one of the greatest and influential films of all time. It stands at an impressive #6 on the BFI \"Sight and Sound\" Critics' poll in 2012, ties for 2nd in the Director's poll, places 15th on AFI's 100 Years... 100 Movies, and tops the Online Film Critics Society list of \"greatest science-fiction films of all time\".2001: A Space Odyssey breaks almost every rule there is in filmmaking. The first half drags, the dialogue is unnatural, the static camera creates no visual interest, there are barely any emotional punches, characters are monotonous, and none of the protagonists, if there even are, have dimensionality, arcs or epiphanies. Nonetheless, it's transcendental and sublime, awe-inspiring and thought-provoking, visually revolutionary, technically impeccable, monumentally imaginative, substantially rich, and way ahead of its time, thriving with unparalleled originality and ambition.Only a few films will live forever. 2001 is one of them. Happy 50th birthday."
    },
    {
      "username": "Doylenf",
      "userUrl": "https://www.imdb.com/user/ur1048771",
      "reviewLink": "https://www.imdb.com/review/rw0100789",
      "warningSpoilers": false,
      "date": "17 June 2002",
      "rate": "",
      "helpful": "358 out of 530 found this helpful.",
      "title": "It's a puzzlement...",
      "content": "There are two schools of thought about 2001: A SPACE ODYSSEY. One, is that it is the greatest science-fiction epic ever made. This is supported by those who claim to understand the complexities involved and leading up the Star Child ending. The others, like myself, find it as absorbing as watching paint dry on woodwork.The musical background is glorious, the colors are dazzling, and there's an interesting use of HAL as a villainous computer. Beyond that, there is nothing the least bit interesting about the human characters (trite dialogue and no personality or warmth to any of the individuals), the pace is unbelievably slow (so the intellectually gifted can philosophize on the mysteries of space), and the payoff at the end leaves you either breathless with enlightenment or convinced that you have watched three hours of nothingness.I had the same letdown feeling when I watched THE CLOCKWORK ORANGE, so your like or dislike of this movie is purely dependent on personal taste. Intellectuals will take the position that you are a mentally challenged clod if you dare disagree with their elevated opinion of the movie--so be aware that this is not conventional story-telling in any sense whatsoever and only for those who admire Stanley Kubrick's way with unlikely cinematic material."
    },
    {
      "username": "CinemaClown",
      "userUrl": "https://www.imdb.com/user/ur20018357",
      "reviewLink": "https://www.imdb.com/review/rw2862085",
      "warningSpoilers": false,
      "date": "2 September 2013",
      "rate": "",
      "helpful": "39 out of 52 found this helpful.",
      "title": "The Sci-Fi That Put The Science In Science Fiction",
      "content": "Putting the science in science-fiction, 2001: A Space Odyssey is an unprecedented, undisputed & unparalleled achievement, and a landmark moment in cinema history, for it nearly killed its genre by setting the bar so high that it hasn't been equalled or challenged ever since. Universally & unanimously hailed as one of the greatest & most influential films ever made, it is without a doubt Stanley Kubrick's magnum opus."
    },
    {
      "username": "suws1",
      "userUrl": "https://www.imdb.com/user/ur44537684",
      "reviewLink": "https://www.imdb.com/review/rw2819250",
      "warningSpoilers": true,
      "date": "24 June 2013",
      "rate": "7",
      "helpful": "355 out of 471 found this helpful.",
      "title": "Ahead of its time but...",
      "content": "I felt the need to review this movie after reading some reviews from other users, simply because I agreed with all. Those who love it, those who hate it, those who enjoyed it, all of them. And the reason is simple: everything they say makes sense to me. I watched the movie for the first time about 10 years ago, and watched it again last night. It still doesn't make perfect sense to me. I mean, the story is absent, the characters don't really get through you, and the ending...who gets that ending?? #SPOILERS# BELOWThe end makes no sense to me... The psychedelic travel, the space child... Maybe I'm just plain stupid, but spending two and a half hours looking at space, slooowww space, and in the end just watch a man in bed, then a baby in a bubble, no explanations, no nothing... Truly, if someone got it and has the hability to explain it to me without calling it \"art\" or whatever, simply explain it to me, I would be very thankful, not kidding. Maybe that way I would be able to enjoy it next time I watch it, maybe ten years from now.That been said, why would I rate it a 7...? I believe when I watch a movie for the first time, I should put myself at the time, the era, the social paradigm, the movie was released. And this movie is cleary ahead of its time. Note, that I am talking about the visual effects, and the general idea of the movie. This movie clearly marked an era, a filmmaker, visual effects and the idea of what space was like. For that it deserves a high rating, maybe the highest. Not to mention the hype the movie STILL causes. We still can't reach an understanding...is it a masterpiece, is it overrated. The only way to really be able to discuss it and form your own opinion is to watch it, so the movie reaches its goal: to be watched and debated. A blockbuster rarely does this, we just watch them to get some good action scenes, visual effects, whatever, but when a filmmaker creates a movie that creates hype, controversy and most importantly, a vision of the future, he is creating a cult movie...a classic. To sum up, as I said in the beginning, when i read people calling it a classic, a masterpiece, I have to agree, but I also agree with those who say its overrated and boring...For me both sentences are true."
    },
    {
      "username": "briancham1994",
      "userUrl": "https://www.imdb.com/user/ur5788055",
      "reviewLink": "https://www.imdb.com/review/rw5979946",
      "warningSpoilers": false,
      "date": "10 August 2020",
      "rate": "6",
      "helpful": "120 out of 184 found this helpful.",
      "title": "I don't get it",
      "content": "Count me as one of the philistines who is too simple-minded to appreciate this so-called masterpiece. Actually, I have a degree in media studies and a great interest in science, science fiction and anything thought-provoking (the technical term is \"need for cognition\"). But I am just baffled by this film and why it is so esteemed. It is simply slow, empty and lifeless. When absolutely nothing is happening on screen, am I supposed to feel or think something profound? Even when my professor explicitly explained to me why this film is so great, I still cannot convince myself that it is so."
    },
    {
      "username": "Manthorpe",
      "userUrl": "https://www.imdb.com/user/ur2809796",
      "reviewLink": "https://www.imdb.com/review/rw0992671",
      "warningSpoilers": false,
      "date": "5 January 2005",
      "rate": "10",
      "helpful": "667 out of 1,005 found this helpful.",
      "title": "A film of monolithic proportions.",
      "content": "A review I have put off for far too long....Bluntly, 2001 is one of the best science-fiction films made to date, if not the very best. Stanley Kubrick was a genius of a film maker and this is one of his very best works. And although it is misunderstood by many, and respectively underrated, it is considered one of the best films of all time and I'll have to agree. Back in 1968, no one had done anything like this before, and no one has since. It was a marvel of a special effects breakthrough back then, and seeing how the effects hold up today, it is no wonder as to why. The film still looks marvelous after almost forty years! Take note CGI people. Through the use of large miniatures and realistic lighting, Kubrick created some of the best special effects ever put on celluloid. This aspect alone almost single-handedly created the chilling void of the space atmosphere which is also attributed to the music and realistic sound effects. I can't think of another film where you can't here anything in space, like it is in reality. Not only is the absence of sound effects in space realistic, it is used cleverly as a tool to establish mood, and it works flawlessly.Aside from the magnificent display of ingenious special effects, there are other factors that play a part in establishing the feel of the film. The music played, all classical, compliment what the eyes are seeing and make you feel the significance of man's journey through his evolution from ape to space traveler.The story, while seemingly simple, is profound. Sequentially, several mysterious black monoliths are discovered and basically trigger certain events integral to the film. What are they? Where did they come from? What do they do? These are all questions one asks oneself while watching the story develop and is asked to find his own way. While most come away with a general idea of what took place in the story, each individual will have to decide what it means to them. Any way one decides to answer these question results in profound solutions. It's not left entirely up to interpretation, but in some aspects it is. Experience it for more clarification. The end result is quite chilling, no matter your personal solution.While it is a long film, and sometimes slows down, it has to be in order to accurately portray the journey of man. It's not a subject that would have faired well in a shorter film, faster paced feature. Those with short attention spans need not apply.Last but not least, is the epitome of a remorseless antagonist, HAL 9000, the computer. Never has a machine held such a chilling screen presence. Which reminds me, for a film with such profound ambition and execution, there is surprisingly little dialogue. Another sign of Kubrick's genius.All in all, one of the best films made to date and one of the very best science fiction films made. A personal favorite. Everyone must see this film at least once.Very highly recommended."
    },
    {
      "username": "Lechuguilla",
      "userUrl": "https://www.imdb.com/user/ur2420383",
      "reviewLink": "https://www.imdb.com/review/rw1015461",
      "warningSpoilers": false,
      "date": "6 February 2005",
      "rate": "10",
      "helpful": "381 out of 640 found this helpful.",
      "title": "Cosmic Art",
      "content": "Mankind's Self awakening is the theme of \"2001: A Space Odyssey\", a process that unfolds along a space-time continuum. We \"see\" our primordial past, and we \"infer\" a cosmic future. The powers of intuition thus become the doors of perception, in our ongoing collective journey.From this transcendental perspective, a conventional, egocentric plot seems superfluous. Our frenzied conflicts and self-important dialogue are consumed in evolutionary change, and are irrelevant in a cosmos that is vast beyond comprehension. It's a tough lesson for a vain and aggressive species. Not surprising then that some of us huff and puff about the film's slowness and minimal story. For perceptive viewers, the remuneration is an inspirational sense of wonder and awe.In this film, which is mostly visual, geometric symbols guide our intuition. Circles and arcs represent nature. Right angles represent conscious intelligence. Some people think the sleek, black monolith is a Von Neumann probe. Maybe. Without doubt, the monolith is a visual metaphor for an extraterrestrial intelligence whose physical form is never shown. Mystery is more profound than explanation.\"2001 ... \" is unique among films in content and scope. The cinematography is out-of-this-world, the special and visual effects are breathtaking, and the classical music is sublime. I rarely use the word \"masterpiece\" to describe a movie. But Stanley Kubrick's \"2001: A Space Odyssey\" is art in the highest sense, like Leonardo da Vinci's \"Mona Lisa\", or Vincent Van Gogh's \"The Starry Night\"."
    },
    {
      "username": "drn5",
      "userUrl": "https://www.imdb.com/user/ur0147299",
      "reviewLink": "https://www.imdb.com/review/rw0100943",
      "warningSpoilers": false,
      "date": "20 April 2003",
      "rate": "10",
      "helpful": "1,195 out of 1,716 found this helpful.",
      "title": "My god, it's full of stars",
      "content": "For all those bewildered by the length and pace of this film (\"like, why does he show spaceships docking for, like, 15 minutes?\"), here's a word you might want to think about:Beauty. Beauty is an under-rated concept. Sure, you'll often see nice photography and so on in films. But when did you last see a film that contains beauty purely for the sake of it? There is a weird belief among cinemagoers that anything which is not plot or character related must be removed. This is depressing hogwash. There is nothing wrong with creating a beautiful sequence that has nothing to do with the film's plot. A director can show 15 minutes of spaceships for no reason than that they are beautiful, and it is neither illegal nor evil to do so. '2001' requires you to watch in a different way than you normally watch films. It requires you to relax. It requires you to experience strange and beautiful images without feeling guilty that there is no complex plot or detailed characterization. Don't get me wrong, plots and characters are good, but they're not the be-all and end-all of everything. There are different KINDS of film, and to enjoy '2001' you must tune your brain to a different wavelength and succumb to the pleasure of beauty, PURE beauty, unfettered by the banal conventions of everyday films. \"All art is quite useless\" - Oscar Wilde."
    },
    {
      "username": "Don-102",
      "userUrl": "https://www.imdb.com/user/ur0187170",
      "reviewLink": "https://www.imdb.com/review/rw0100727",
      "warningSpoilers": false,
      "date": "7 March 1999",
      "rate": "10",
      "helpful": "404 out of 645 found this helpful.",
      "title": "Tribute to one of the top 5 filmmakers of our time...",
      "content": "I write this review just after hearing of Stanley Kubrick's death. It's a great loss, and I write about 2001: A SPACE ODYSSEY, because I feel it is the consummate Kubrick film, the one he will be most remembered for. It is a picture like no other, not only revolutionizing science fiction, but changing the way films are conceptualized. It was probably America's first 'art' film and has inspired the likes of George Lucas and countless other writers and directors.Aside from its visual greatness, the reason the film spawns so much discussion and analysis is because so many people have so many different interpretations of it. Kubrick and Arthur C. Clarke, his co-writer, had a vision, but we have never really found out what was going through their minds. Of course, the skinny on its 'message' is how technology of the future will take over humanity and decide the course of our lives unless we are careful. 2001's ending is one of hope, a version of our rebirth through the star-child's flight back to earth. It is meaningless to many, but discerning filmgoers will understand.Although 2001 does not have the wicked, dark humor of DR. STRANGELOVE or CLOCKWORK ORANGE, or contain strong, eccentric characters that filled his earlier works like PATHS OF GLORY or SPARTACUS, I still feel he would've liked to be remembered most for this. If anything, HAL will be his most memorable character, dangerous, murderous, and artificial. It was a half-decade in the making at a time when Hollywood was still churning out dull musicals and just waking up to the New Wave of French and Italian cinema. Kubrick was a maverick director who made great films on his own terms, his own time, and for everyone else to marvel at. He will be missed."
    },
    {
      "username": "sol-",
      "userUrl": "https://www.imdb.com/user/ur1355003",
      "reviewLink": "https://www.imdb.com/review/rw0990793",
      "warningSpoilers": false,
      "date": "3 January 2005",
      "rate": "10",
      "helpful": "186 out of 332 found this helpful.",
      "title": "My brief review of the film",
      "content": "A whimsical, often spectacular view of a future in which advances in technology dominate the world. It is well shot and although slow-moving it is intense and enjoyable throughout. The featuring of classical music to establish atmosphere works brilliantly; it provides a feeling of awe, mystery and intrigue  the same aura that Walt Disney worked in creating 'Fantasia'. The special effects, both sound and visual, are still spellbinding by the standards of today's technology. Aside from the technical pluses of the film, it stands strong as it is one of not many films out there that has something important to say about humankind, and where the human race is heading in terms of our increasing reliance on machines and our unquenchable thirst to discover. Despite an ending that is hard to understand, it is even harder to overlook this film a true cinema classic."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw8689151",
      "warningSpoilers": false,
      "date": "22 November 2022",
      "rate": "8",
      "helpful": "12 out of 16 found this helpful.",
      "title": "Planet of the Hominins...",
      "content": "There's a monolith that seeks to influence, the evolution of the simian confluence, teaching apes how to compete, how to kill to get their meat, all leading to, a lunar revolution. On the moon, another block has been discovered, the apes now have the means to open wings and smother, it's to Jupiter they go, what they'll find nobody knows, but it doesn't seem to fill primates with dread. To protect they have a powerful A. I., it misses nothing, and nothing passes by, everything will not be fine, if you rely on an airline, as it watches with satanic, evil eye. At Jupiter, Darwin gets dispatched, down kaleidoscopic, psychedelic hatch, death brings birth and birth brings earth, a giant foetus wants to berth, I'm not sure hominins will make much of a match.A perpetually engrossing film that offers more conundrums than conclusions, your interpretations uniquely your own, but the scale, cinematography and concepts are truly out of this world."
    },
    {
      "username": "gavin6942",
      "userUrl": "https://www.imdb.com/user/ur1234929",
      "reviewLink": "https://www.imdb.com/review/rw3133907",
      "warningSpoilers": false,
      "date": "1 December 2014",
      "rate": "6",
      "helpful": "51 out of 87 found this helpful.",
      "title": "Visually Stunning, But Perhaps Overrated",
      "content": "Humanity finds a mysterious, obviously artificial, object buried beneath the Lunar surface and, with the intelligent computer H.A.L. 9000, sets off on a quest.Saying that \"2001\" is overrated is the sort of statement that can bring down hatred and vitriol from science fiction fans, Kubrick fans and more. Of course, it is possible to be a Kubrick fan and still generally dislike this film.Nobody can deny that this film is visually stunning, and a landmark in imagery. It also has the advantage of being the last film about space travel to be released before the moon landing, making it somewhat prescient in a way.But yet, does it need to be so long, so grand, with the music and long shots? Perhaps not quite \"pretentious\", but the film presents itself as being more important than it really is. Critics at the time (1968) denounced the film, and perhaps they were right. At the very least, two cuts could be made: a longer one for die-hard fans, and a shorter one for casual viewers."
    },
    {
      "username": "BA_Harrison",
      "userUrl": "https://www.imdb.com/user/ur0945066",
      "reviewLink": "https://www.imdb.com/review/rw3370285",
      "warningSpoilers": false,
      "date": "12 December 2015",
      "rate": "4",
      "helpful": "55 out of 98 found this helpful.",
      "title": "In space, no-one can hear you yawn.",
      "content": "I was born in 1968, the year that saw the original release of 2001: A Space Odyssey; of course, I didn't really get into sci-fi cinema until almost a decade later, when that other movie—you know, the one with the droids, blasters and aliens—broke box-office records. Now aged 47, and fully prepared (or so I thought) for a more cerebrally challenging experience than George Lucas's space opera, I've finally caught up with Kubrick's celebrated sci-fi 'masterpiece'. And I haven't been so bored in a long time.It's not that I need bucket-loads of action and excitement to enjoy a sci-fi movie—I have deep affection for leisurely '70s genre efforts such as Silent Running and Dark Star (both of which clearly owe a debt to 2001)—but Kubrick's film takes pomposity and tedium to a new level. Perhaps if I was stoned, as I imagine many of the film's original fans were when they first saw it, and watching on a cinema screen instead of a TV, I might have been a little more impressed: the visuals are undeniably awe inspiring, the music is grandiose, the psychedelic finale is a trip, and there is much symbolism and narrative ambiguity for intellectuals to chew over, but at two hours and twenty minutes, with very little dialogue and a tortuously slow pace, I struggled to stay awake.In short: give me a lightsaber battle any day of the week.4/10, mostly for the surprisingly effective ape-man suits and the highly detailed spacecraft model effects."
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw1030293",
      "warningSpoilers": false,
      "date": "28 February 2005",
      "rate": "1",
      "helpful": "437 out of 875 found this helpful.",
      "title": "2001: A Cure for Insomnia",
      "content": "I'm sorry, good music and cool special effects do not make a good movie! What the heck? I mean, I saw this movie when I was a kid, and I didn't like it. Now, I have a growing appreciation for movies, and I wanted to write a comment from a more grown up point of view. I had 2 hours to spare and I watched this movie, I swear I nearly went insane. I normally put on the subtitles, in case I miss something or misunderstand the dialoug, 89% of the movie is silent! Apes?! I could just go to the zoo and say I saw this movie! I could watch \"Star Wars\" and say I saw this movie! It's the same friggin' thing. I'm not trying to be so harsh on this film, but how can anyone find this entertaining?! How?! Unless you are 150 years old, that is the only way I could understand. Geez, people. This movie is so out dated and needs to be thrown away, especially from the top 250! Why are so many bad movies on top 250?! I'm getting sick of these over hyped movies! 1/10"
    },
    {
      "username": "mmt02",
      "userUrl": "https://www.imdb.com/user/ur0275161",
      "reviewLink": "https://www.imdb.com/review/rw0100237",
      "warningSpoilers": false,
      "date": "3 June 1999",
      "rate": "10",
      "helpful": "970 out of 1,459 found this helpful.",
      "title": "Greatest Movie of All Time",
      "content": "Instead of writing a paragraph, I'll give four good reasons why 2001 is the greatest cinema experience of all time: 1) It is a visual Odyssey that could only be told on the big screen. The special effects that won Kubrick his only Oscar are the most stunning effects before that age of Jurassic Park and T2. They allow Kubrick to give an accurate (or at least are the most accurate) depiction of space travel to date. The silence that fills the space scenes not only serves its purpose as accurate science, but also adds to the mood of the film (to be discussed in a later point with HAL). The fact that Kubrick shot the moon scenes before the Apollo landing is a gutsy yet fulfilling move. Many have said that upon its original release, it was a favorite \"trip\" movie. I can think of no other movie that has such amazing visuals for its time and even of all time (sorry Phantom Menace fans!) 2) Kubrick's directing style is terrific. As in all his films, Kubrick likes to use his camera as means to delve into the psychology of his characters and plots. His camera is not as mobile as other greats, such as Scorsese, but instead sits and watches the narrative unfold. Faces are the key element of a Kubrick film. Like classic movies, such as M and Touch of Evil, Kubrick focuses on the characters' faces to give the audience a psychological view-point. Even he uses extreme close-ups of HAL's glowing red \"eye\" to show the coldness and determination of the computerizd villain. I could go on, but in summation Kubrick is at the hieght of his style. 3) HAL 9000 is one of the most villainous characters in film history. I whole-heartedly agree with the late Gene Siskle's opinion of HAL 9000. Most of this film takes place in space. Through the use of silence and the darkness of space itself, a mood of isolation is created. Dave and his crewmen are isolated between earth and jupiter, with nowhere to escape. Combine this mood with the cold, calculated actions of HAL 9000 and you have the most fearful villain imaginable. I still, although having see this film several times, feel my chest tighten in a particular scene. 4) The controversial ending of 2001 always turns people away from this film. Instead of trying to give my opinion of the what it means and what my idea of 2001's meaning in general is, I'd like to discuss the fact that the ending serves to leave the movie open-ended. Kubrick has stated that he inteded to make 2001 open for discussion. He left its meaning in the hands of the viewer. By respecting the audience's intelligence, Kubrick allowed his movie to be the beginning, not the end, of a meaningful discussion on man's past, present, and future. The beauty of 2001 is that the ending need not mean anything deep, it can just be a purely plot driven explanation and the entire movie can be viewed as an entertaining journey through space. No other movie, save the great Citizen Kane, leaves itself open to discussion like 2001. It is truly meant to be a surreal journey that involves not only the eye but the mind. Instead of waiting in long lines for the Phantom Menace, rent a widescreen edition of 2001 and enjoy the greatest cinematic experience."
    },
    {
      "username": "Chaves7777",
      "userUrl": "https://www.imdb.com/user/ur8206701",
      "reviewLink": "https://www.imdb.com/review/rw1785653",
      "warningSpoilers": true,
      "date": "23 December 2007",
      "rate": "10",
      "helpful": "10 out of 13 found this helpful.",
      "title": "Strange, beautiful and excellently made for an open and patient mind",
      "content": "Undoubtelly, one of the best photographed movies of all time is Kubrick's masterpiece \"2001: A Space Oddisey\", but is maybe one of that masterpieces that much can see over and over again, and others not even finished in spite that know how much people and critic loves this movie.This Kubrick's movie is a beautiful show of a past and present human been for then going to our undeniable future, like a cycle, although that it could be a lot of other possibilities for it ending. Is a good and respectable opinion, no matter if was based or not in the book ideas. The film deals with the dawn of men, the apes, thing that reminds so much the Darwin theory i guess. The follow up to a world that not even today could imagine before seeing it. And its meaningful ending. But these three things are connected for an instrument, an element, that maybe could explain the continuity of the race, of future.I understand how people could be amazed in those times. Kubrick's manage of widescreen is very important, and here is not a joke! Just like in movies like Dario Argento's \"Suspiria\", that could be an excellent example. You cant feel the exactly masterful feeling if your eyes don't note all the whole thing, and here in \"2001\" this happen, as one of these masterful (Sorry the word repetition) achievements. The shots of space are more than wonderful, are breathtaking! The music is more than appropriate, is perfect. But is of course slowly, and this is one of its achievement, but is a thing too that undoubtedly some people can take as the boring thing. The film is very slowly and full of silence, just like space is. But of course, although that this film never going to be dated (i think none film is) but people of today for example now is accustomed for other things, with more action and quickly artificial effects, and this movie is not like those. This one have such spectacular special effects, so perfect that you don't see any artificiality, you believe it. The use of colors, as its music, are more than masterful, are used for be hypnotic, just what this film deserve.In other situation, through the story of course appears too a topic that was handled perfectly just before in Fritz Lang's \"Metropolis\", the technological domination, in this case our beloved infamous \"Hal\".This is undoubtedly one of the best movies ever made, but is, a funny thing, not one of my favorites. Sometimes i feel it so hard to taking it, maybe for be so slowing, that is, like i say before, another great achievement. In spite of this, i think that is a necessary movie, where it seems that our humanity is driven mad, but the ending of this movie is a true that humans, being physical or spiritual, must to face for grow up. In some way, for good.PD: Althoug that this film don't is one of my favorites, and i feel the thing very slowly, i give it a 10, because the idea is giving impartial and veridical critics, the film is breathtaking and is excellently made. Maybe i could change of opinion, i think that this is one of those films that you must see and see again. Don loose it, and be patient, is worth it! And please, see it in widescreen! *Sorry for the mistakes ... well, if there any."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2326551",
      "warningSpoilers": false,
      "date": "19 October 2010",
      "rate": "10",
      "helpful": "42 out of 75 found this helpful.",
      "title": "2001: A Mesmerising Odyssey",
      "content": "To me, this is not only Kubrick's best film but also a milestone of the genre. It is quite long at around two and a quarter hours, and it is slow, that I agree with. But it is never boring, well not to me it isn't. Besides, and this is up to interpretation, but I think the slow pacing is deliberate, it adds to the haunting and eerie quality 2001 has and also to assimilate every shot which speak volumes, and also 2001's greatest strength is actually in the details.The story is somewhat abstract in its structure but is also quite complex, innovative and interesting yet has a simple message, and the screenplay and direction by Kubrick are superb. The acting is not the film's best asset, but it is good enough, with Douglas Rain the standout as the voice of HAL 9000 as he is really quite brilliant. Two things especially make 2001 so good. One are the visuals- even after all those years they are simply outstanding. The cinematography is indeed splendid, as are the colours and settings, but there are so many memorable images. The images of the giant Starchild floating through space and the tribe of apes painfully putting two and two together still resonate considerably even now. The other is the music. Coming from a big classical music enthusiast, I was delighted by the use of Also Sprach Zarathustra and On the Beautiful Blue Danube and how they combined with the visuals were exceedingly clever.Overall, this is a truly wonderful film that is worth seeing for the visuals and music alone and still continues to intrigue and perplex with the ending. As much as I like Oliver and Chitty Chitty Bang Bang, two of my childhood favourites, and the brilliant Lion in Winter to me this is it... the best film of 1968. 10/10 Bethany Cox"
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1148108",
      "warningSpoilers": true,
      "date": "11 August 2005",
      "rate": "9",
      "helpful": "143 out of 274 found this helpful.",
      "title": "The final landing scene is the very hallmark of cinematic genius...",
      "content": "\"200l: A Space Odyssey\" is a supremely intriguing space-travel journey with a profound look at mankind's future... It is one of the very few great films of our times... It gives us something to think, talk and argue... It wonders about our importance in the universe and ignites our imagination and curiosity... It inspires us to dig for insights...As a science fiction fantasy, it is one of the most original films ever made... Kubrick's camera dances to the \"Blue Danube\" with planets floating exuberantly through the light years... It's an experience in the poetry of motion, a rich statement to the power of cinema...But \"2001\" reveals that it's not really a science fiction film after all... It's, instead, a philosophical enigma, a magnificent meditation on man's place in the grand scheme of things, and a quest to understand ourselves by knowing all else...\"2001\" is a unique film about man's evolution told in almost subliminal terms... The people in this classic science-fiction epic hardly matter... Kubrick relates a chronology in images of thingsthe mountains, the desert, the technology, the space capsule, the computer named HAL (who is more interesting than the humans), and the time warp... The final landing scene is the very hallmark of cinematic genius...As a terror story, too, it is a towering achievement (not on the same scream-inducing level as Hitchcock's \"Psycho\"), but in an innocent and far more haunting way...The film uses invisible but powerful forces to manipulate the plot but perhaps the most overwhelming one is the picture's vision of man... In Kubrick's fantasy, the Golden Age of man was a neglected instant between a man-ape's exaltation at discovering the first weapon and a nuclear-powered spaceship floating in a graceful orbit around the Earth... Man has indeed evolved!As a spectacle \"2001\" assaults the mind, eye and ear, with stimulating images and suggestions... We are surrounded by a totally believable futuristic environment... The film is filled with brilliant sequences and extraordinary moments: The first interesting minutes in which the story of the apes is told visually, without a single line of dialog; the zero-gravity toilet with its great list of instructions; the stewardess defying gravity by walking the walls calmly upside down; the frightening moment when we realize that HAL is reading the astronauts lips; the magical alignments of Sun, Moon, and Earth; the \"Starchild\" returning home to charm the orb...\"2001\" is filled with poetic imagery: the view of the Sun rising over the Earth; the tossing of the bone into the air in slow motion; the slow images of the giant spaceship revolving in a cosmic ballet...\"2001\" is also a work of great visual acuity... It allows us to view more than the mystery of existence and destiny implicit in every man... Its end troubles many viewers as they demand clarity where there can only be mystery... They insist upon an answer where there can only be a question... Every viewer had a different explanation of the mysterious end of Kubrick's film But for those who can accept mysticism, the climax is deeply moving..."
    },
    {
      "username": "rooprect",
      "userUrl": "https://www.imdb.com/user/ur2904674",
      "reviewLink": "https://www.imdb.com/review/rw2555027",
      "warningSpoilers": false,
      "date": "25 January 2012",
      "rate": "10",
      "helpful": "65 out of 120 found this helpful.",
      "title": "If only one film makes it off this planet, it should be 2001.",
      "content": "If the Earth was about to blow up and I could choose only 1 film to survive us, it would definitely be this. What's funny is \"2001\" isn't even my favourite movie. But I believe it tells the story of humankind better than anything else I've ever seen on the big screen. Essentially it asks the age old question \"what is the meaning of life?\", and for my money, it provides a very satisfying answer.What makes it such a phenomenal work of art is that it is able to address some of the most divisive, incompatible human attitudes (in particular, religion) and present us with a model that we ALL can accept. Judeo-Christians, Muslims, Hindus, Scientologists, Fundamentalists, Existentialists, Atheists and even Satanists can find truth in this film because it applies no labels. Like the mysterious yet commanding \"black box\" that appears in the film, it remains exactly that: a sealed black box which can be anything we choose to see.The black box may represent God. Or it may represent science. Or it may represent history. Or it may represent individuality. Make up your own mind, and you will learn a little something of yourself. Really, this movie is like a puzzle with infinite solutions, designed to teach us about ourselves by what we see in it. It's truly interactive. No other film has ever made me feel this way.The plot is almost irrelevant, so I won't bother summarizing. What you should pay attention to are the themes and questions the movie addresses.1) Are we alone in the universe? 2) Is there a point to life? 3) Are we heading in the right direction?By the time the movie ends, you should have an answer to all three, and yet all our answers will be different.SO WHAT THE HECK IS THE MOVIE ABOUT? OK, since you've read this far, I'll give you an idea. The movie is about evolution. Not just your Darwinian natural selection stuff, but a compelling proposal that evolution was (or continues to be?) guided by some extraordinary force. If you like, this is the marriage of God & science that we've all been waiting for. Or if you like, it's a testament to pure science. Or pure God. Like I said, Kubrick allows for every possibility. And I have to hand it to him for remaining so tight-lipped that nobody ever knew what his personal feelings were on the matter.The film starts in prehistoric times with a tribe of moribund ape-like creatures on the edge of either extinction or excellence. Then we jump ahead a million years or so to find humans in a similar state of stagnation yet on the edge of another fantastic evolutionary step forward. Finally we jump forward to catch a glimpse of what evolution may have in store for us in the not-too-distant future. If it sounds like a documentary, I suppose it almost is, except without Marlon Perkins talking over it. We are expected to fill in the details ourselves, and that is the beauty of what this film does. It takes a purely objective approach and manages to lead us to our own satisfying conclusions.A word of caution. I don't think you're supposed to \"get\" this film on one viewing. I certainly didn't, and I've never met anyone who did. Even Roger Ebert (who ranks this as the greatest film of all time) was initially lukewarm about it when it premiered in '68. So if you feel like you just got cheated, or if you have no idea what everyone's raving about, please be patient and give it some time to sink in. I saw this movie when I was 16 and loved the middle part but hated the ending. Decades later I saw it again and suddenly understood it better. But I confess there's still a lot I haven't realized. I suppose as I get older and hopefully wiser I'll continue to interpret new ideas. And that's why this is the greatest movie of all time. It is about evolution, and moreso it EVOLVES WITH US."
    },
    {
      "username": "utgard14",
      "userUrl": "https://www.imdb.com/user/ur1896124",
      "reviewLink": "https://www.imdb.com/review/rw3037292",
      "warningSpoilers": false,
      "date": "21 June 2014",
      "rate": "10",
      "helpful": "14 out of 22 found this helpful.",
      "title": "Kubrick's Masterpiece",
      "content": "What can I really say about one of the greatest films of all time that hasn't been said already? The first time I saw it as a teenager I was left amazed at what I had seen but at the same time confused as to what it all meant. This was the first movie I saw that didn't spell everything out for me. It took time for me to learn to enjoy that. It's a beautiful film. I've heard it described as visual poetry and I think that is as accurate a way of putting it as anything else. The visuals are stunning. The special effects, sets, costumes are all first-rate. I recently watched it with my girlfriend who had never seen it and has tastes that are strictly mainstream. She was in awe of the look of the film, particularly given its age. Not enough good things can be said about Kubrick's use of classical music in this, as well. It's a masterpiece that deserves every bit of praise it's received. Obviously a film that every serious film fan has to see. It might not be to everybody's tastes but it's an experience unlike any other and, in my opinion, worth repeated viewings. For those of you interested, there's obviously the Arthur C. Clarke books that are worth reading but I'm also going to recommend you check out the Jack Kirby 2001 comics. They're trippy and lots of fun!"
    },
    {
      "username": "alexcole10",
      "userUrl": "https://www.imdb.com/user/ur63888970",
      "reviewLink": "https://www.imdb.com/review/rw5822150",
      "warningSpoilers": false,
      "date": "13 June 2020",
      "rate": "10",
      "helpful": "83 out of 119 found this helpful.",
      "title": "Leaves the Viewer Thinking for Weeks on End",
      "content": "2001: A Space Odyssey is my favourite film of all time for simply one reason: the ending. Kubrick's ambiguous finish to this suspenseful trip will leave you debating and theorising its purpose for a long time.Further positive aspects include its eerie score and music throughout (notably at the beginning), the visually pleasing aesthetic, and contrastingly the use of silence to truly prove that \"no one can hear you scream in space.\"I strongly recommend watching this film in a dark room with no distractions in order to achieve the full cinematic experience, and hopefully it will not disappoint."
    },
    {
      "username": "Med-Jasta",
      "userUrl": "https://www.imdb.com/user/ur5750535",
      "reviewLink": "https://www.imdb.com/review/rw7032802",
      "warningSpoilers": true,
      "date": "15 June 2021",
      "rate": "1",
      "helpful": "22 out of 36 found this helpful.",
      "title": "Terribly amazing",
      "content": "I give this a 1 star because ultimately it's not enjoyable. Who can actually watch this movie? Because that's what movies are about. This can come in many shapes and sizes but this movie is unwatchable. I think people confuse it's enjoyably with it's technically achievements. Don't get me wrong, this is one of the most important movies of all time. But is it good? No. It's not good. And anybody who says it is is lying to themselves and either doesn't want to ruin their nerd credit or they want to make their film school teacher happy.Everything looks great. The special effects are amazing. And in context it's even more stunning. Especially because since it's release directors have cited this movie as an inspiration. And many movies were either made or rose to their potential because of this. This movie was the first legitimate A list sci-fi movie. The story lines are good. But the way the movie is presented is not. Everything goes on for way too long. It's boring as all hell. And when a story line ends or a self indulgence passes and things start to go somewhere we are quickly thrown into another pretension.This really stinks of sci-fi of the time. Everybody will say that it's artistic or some other crap but when it comes down to it so much of this movie is showing off the special effects. They paid a lot of money for it and they're going to get their money's worth on the screen. But no Kubrick wouldn't do that, he's an artist, right? Well he did it and you were all duped into thinking that a lot more was going on than actually was. This is how sci-fi was at the time and this movie is no different.No one can pretend that Kubrick wasn't pretentious and self indulgent. His movies are revered as untouchable these days but if you are able to think on your own you'll see that he does so much stuff just for the sake of doing it. He's contrived and disingenuous. He's not story driven, he's counter driven. He's the PT Anderson or Tarantino of his time. They are chalked full of cool things but in the end they aren't good movies. A few are.This movies biggest problem is that it goes out of it's way to not explain anything. I'm all up for a little ambiguity but this keeps you in the dark, leaving you to guess at best. If it was cut by about half I'd be able to stomach it and could accept it as visual experimentation. But since you are stuck watching so many things repeat over and over not only is the point made but it's driven into the ground and ruins the original effect. Like in the last sequence, after about 30 seconds of trippy patterns the coolness goes away and it gets old, then annoying and then boring. When if it was much shorter the effect would have maintained it's intent. Then we move onto the landscapes and all this repeats. Then he turns old and is reborn as a baby possibly? It's up for interpretation just like the rest of the movie is. Which is a bunch of BS if you ask me. A movie has a story, it's not a fill in the blanks how you want to kind of thing.I looked up the book and low and behold the plot is explained. I don't know how any of that was supposed to show up on the screen. The whole ending makes sense and is really cool and would have made these things that happened relevant. Don't even give me some crap of saying that this movie is art and that people just don't get it. Do you get it? Can you actually explain this movie? Or are you just guessing? I think the story was there and Kubrick either got caught up in all of the cool stuff or thought that it would be so unconventional to not have it make any sense. I would say he was on drugs but as we all know he claims that he wasn't. So we only have his ego and artistic pretensions to explain this movie.I know my opinion isn't popular on the internet. It is in real life because I have never met anyone that actually likes this movie. They all say the same things that I said. But it's okay to be yourself and be an individual and not succumb to per pressure to maintain your artistic credit. After all we are just talking about opinions here."
    },
    {
      "username": "preppy-3",
      "userUrl": "https://www.imdb.com/user/ur0463200",
      "reviewLink": "https://www.imdb.com/review/rw1964747",
      "warningSpoilers": true,
      "date": "23 October 2008",
      "rate": "2",
      "helpful": "77 out of 159 found this helpful.",
      "title": "Selt-indulgent, painfully slow and just boring",
      "content": "There are spoilers throughout this review.This starts at the \"Dawn of Man\". A bunch of apes find a black monolith and start to evolve slowly. Then it cuts to 2001. A black monolith has been discovered on the moon--buried. When the light hits the monolith it starts to emit a message to the moons of Jupiter. Astronauts David Bowman (Keir Dullea), Frank Poole (Gary Lockwood) and some other astronauts (in suspended animation) are sent to Jupiter to investigate. However their computer HAL (with the creepy voice of Douglas Rain) goes crazy and kills everybody except for Dullea. Dullea gets to Jupiter and \"enters\" a black monolith floating in space. He's then in a room being watched over by alien beings. He ages rapidly and dies...but becomes a \"star child\". It seems he has been chosen (for whatever reason) to show the next step in evolution to man. Basically the monolith is a gift from some alien beings who watch over the entire universe. They helped the human race evolve. The monolith on the moon was buried so man would dig it up. When they got to it the signal sent to Jupiter was to alert the aliens that man was ready for his next step.That's MY view of it. Everybody has different interpretations of this movie.I have vague recollections of seeing this back in 1968 at the age of 6 (the film is G rated). I remember the apes at the beginning scaring me...and then falling asleep. Since then I've seen it multiple times at revival theatres and, on one occasion, saw a brand new print with stereo at a play house. Yes--the special effects are impressive. Yes--the music is great. But the movie is long, far too slow and just boring! It moves at such a slow pace that it's sleep-inducing. There's very little dialogue but that's a blessing because what there is is pretty lousy. The human characters have no personality whatsoever and speak in monotones and simple short sentences. Lockwood and Dullea are supposedly buddies but I never got the feeling that they even liked each other! This isn't anything against either actor--these poor guys are given nothing to work with. For instance when HAL kills Lockwood and the other astronauts what's Dullea's reaction? Nothing. He barely raises an eyebrow. I don't blame Dullea--I think he was just playing it like director Stanley Kubrick told him. How can you care about characters who are given no personality or motivations? You know there's a problem when HAL comes across as more real than Poole and Bowman! Also HAL gets paranoid and kills Frank. Could someone please tell me how a COMPUTER gets paranoid???? They give an explanation (sort of) in \"2010\" but it was pretty stupid. There are a few good things about this. Douglas Rains' voice of HAL is suitably creepy. Lockwood strips down to his shorts at one point showing his muscular body. The entrance into the star gate is still impressive (if far too long).People seem to forget that a lot of people hated this movie when it first came out. MGM executives thought they had a disaster on their hands and most people couldn't make heads or tales out of the plot. During a break in a premiere screening for studio executives someone said, \"Something better happen in the second half or we're dead!\" But, inexplicably, audiences seemed to love it and it's now regarded as a masterpiece. Aside from being thoroughly bored by it I find it cold and impersonal too. The message seems to be that man is an insignificant little thing in the universe. It's all in the hands of these gods and you can't do anything to change it. That's a pretty creepy message but the movie drags out everything to a ridiculous degree. Boring, slow and sleep-inducing. The 2 is for the special effects and Dullea and Lockwood (I like both actors despite this movie)."
    },
    {
      "username": "Cain47",
      "userUrl": "https://www.imdb.com/user/ur0402390",
      "reviewLink": "https://www.imdb.com/review/rw0100628",
      "warningSpoilers": false,
      "date": "16 November 2001",
      "rate": "10",
      "helpful": "185 out of 280 found this helpful.",
      "title": "Nietzsche and 2001",
      "content": "I'm always surprised, given that the famous title track of 2001 is called \"Also sprach Zarathustra\", that nobody (nobody I've read, anyway) has noted the parallels between the movie and Nietzsche's famous work, \"Also sprach Zarathustra\". The idea of man's rebirth into a star child; an infant form of an indescribably more advanced being, is an explicit part of N.'s \"Zarathustra\"; there is a prominent passage called \"On how a camel becomes a lion, and a lion becomes a child\", in which N. describes the first incarnation of the overman as a child, transcending both the ascetic, altruistic side of man (the camel; always asking to bear more weight) and the rapacious, brutish, will-to-power side of man (the lion). The fact that the song plays during the star child sequence can hardly be coincidence. And also, Zarathustra said that \"man is a rope tied between beasts and the overman.\" The structure of the movie fits that description: a brief history of man as beast, until we become truly man by mastering weapons and acquiring reason, then a long sequence about man (the rope, as it were), and then a brief glimpse of the overman. The inscrutability of how these transformations occurred, and the suggestion that an external force caused them, is also Nietzschean; in \"Zarathustra\", he makes it pretty clear that he doesn't have a clue how people are going to be able to enact these changes themselves and suggests that we will have to depend on an outsider (Zarathustra) to show us how to \"go under\". Bowman's psychedelic sequence at the near-end could be seen as Kubrick's best 1960's-style attempt at depicting the mystical \"going under\".I know these parallels are pretty broad, and almost certainly have been noted elsewhere despite the fact that I have not personally seen it. But I just wanted to mention them, if for no other reason than to try to dispel the myth that Nietzsche was ultimately a gloomy philosopher. Few people find the ending of 2001 to be gloomy, and it is in my opinion, explicitly and unmistakeably Nietzschean. The case could certainly be made that 2001 is above all a dramatization of \"Zarathustra\" updated for the modern age. Feel free to disregard the outright snobbishness of my tying everything to Nietzsche."
    }
  ],
  "errorMessage": ""
}