{
  "imDbId": "tt0457430",
  "title": "Pan's Labyrinth",
  "fullTitle": "Pan's Labyrinth (2006)",
  "type": "Movie",
  "year": "2006",
  "items": [
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Liam Lacey",
      "link": "",
      "rate": "100",
      "content": "This is like no movie you've seen before, a haunting mixture of horror, history and fantasy that works simultaneously on every level."
    },
    {
      "publisher": "Premiere",
      "author": "Glenn Kenny",
      "link": "",
      "rate": "100",
      "content": "This intense film, a mix of horror, fantasy, and history that convinces on all those levels and mixes them up with dizzying brio, is a searing cinematic experience, a beautiful, terrifying vision from writer-director Guillermo del Toro."
    },
    {
      "publisher": "Village Voice",
      "author": "J. Hoberman",
      "link": "",
      "rate": "100",
      "content": "Literally and figuratively marvelous, a rich, daring mix of fantasy and politics."
    },
    {
      "publisher": "L.A. Weekly",
      "author": "Ella Taylor",
      "link": "",
      "rate": "100",
      "content": "Pan's Labyrinth Like his terrific 2001 \"The Devil’s Backbone,\" Mexican horrormeister Guillermo del Toro's new movie offers us both real-life and fantastical monsters, and if you know his work, you won't waste time figuring out which to root for."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Michael Wilmington",
      "link": "",
      "rate": "100",
      "content": "A brilliant work of the imagination capable of truly seizing and igniting our fantasies."
    },
    {
      "publisher": "Salon",
      "author": "Stephanie Zacharek",
      "link": "https://www.salon.com/2006/10/13/pans_labyrinth/",
      "rate": "90",
      "content": "This is a true fairy tale, and one of the finest fantasy pictures ever made, but please do not take your young children to see it unless you want them to be scarred for life."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/movies/p/pans_labyrinth.html",
      "rate": "88",
      "content": "The lack of family friendliness does not diminish what del Toro has achieved with this magical motion picture."
    },
    {
      "publisher": "Newsweek",
      "author": "David Ansen",
      "link": "",
      "rate": "80",
      "content": "Suspended between the brutally graphic and flights of lyrical fancy, Pan's Labyrinth unfolds with the confidence of a classical fable, one that paradoxically feels both timeless and startlingly new."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Ray Bennett",
      "link": "",
      "rate": "80",
      "content": "The performers are all good with Baquero poised and beautiful as Ofelia and Verdu vital and spirited as the rebellious Mercedes. Lopez gives an extraordinary performance as the bestial captain, an irredeemable villain to rank with Ralph Fiennes' Nazi in \"Schindler's List.\""
    },
    {
      "publisher": "Variety",
      "author": "Justin Chang",
      "link": "",
      "rate": "80",
      "content": "There's plenty of blood -- both literal and figurative -- coursing through the veins of Pan's Labyrinth, a richly imagined and exquisitely violent fantasy from writer-director Guillermo del Toro."
    }
  ],
  "errorMessage": ""
}