{
  "imDbId": "tt0457430",
  "title": "Pan's Labyrinth",
  "fullTitle": "Pan's Labyrinth (2006)",
  "type": "Movie",
  "year": "2006",
  "items": [
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw3615836",
      "warningSpoilers": false,
      "date": "8 January 2017",
      "rate": "10",
      "helpful": "27 out of 31 found this helpful.",
      "title": "Stop the Abuse",
      "content": "An incredibly creative piece of cinema. It incorporates an amazing fantasy world with the realities of war. It gives its protagonist a way of surviving and continuing on with a life after she could have lost everything. The visuality is striking, creating a world like we've never seen. There is an amazing use of computer generated images. Everything in this film is in balance as it shifts between fantasy and the horrors of the civil war under Franco. Del Torro is a director of the first order. If you don't like him, try to realize that he takes chances and there are always naysayers out there who want to tear down that creativity. Imagine Stravinsky stopping after \"The Rite of Spring\" because the Philistines who are stuck in the past couldn't give it its due or at least have some optimism."
    },
    {
      "username": "j30bell",
      "userUrl": "https://www.imdb.com/user/ur3245202",
      "reviewLink": "https://www.imdb.com/review/rw1527874",
      "warningSpoilers": false,
      "date": "23 November 2006",
      "rate": "9",
      "helpful": "748 out of 915 found this helpful.",
      "title": "A fey, beautiful and dark masterpiece",
      "content": "Set during Franco's mopping up exercise after the Spanish Civil War, Guillermo Del Toro's Pan's Labyrinth is a wonderful, dark fairy tale that, in a metaphor for Spain itself, teeters on the edge of nightmare dreamscapes of corruption, violence and the death of innocents.This film is definitely not for young children. Although the fantasy sequences are gorgeously realised, and are fairy tales in the truest sense (in that they are dark, fey, dangerous and violent), most of the story (about three quarters of it, in fact) exists outside of the dreamland, in the even more frightening (and sometimes shockingly violent) world of a real life struggle of ideas and ideology.Sergi Lopez is excellent as the brutal (and possibly sadistic) Falangist Captain tasked with routing out the remaining leftists from the woods and hills of Northern Spain. Into this precarious situation come his new wife (a widow of a former marriage, who is carrying his son) and his stepdaughter Ofelia (played to absolute perfection, by the then 11 year old, Ivana Baquero).Uncomfortable with her new surroundings, suspicious of her stepfather and desperately concerned about the worsening condition of her mother, Ofelia uncovers a strange alternative world, and the chance to escape forever the pain and uncertainty of her everyday life.Thus the film alternates between the world of Civil War Spain and the increasingly bizarre, dark and frightening world of the Pan's Labyrinth. As the twin plots progress, they intertwine, with the tasks of Ofelia becoming the choices faced by a Spain at the crossroads. The poignancy of the film lies partly in the fact that the victories of the child are reflected so starkly by the failures of the adult world.Apparently Pan's Labyrinth won a 20-minute standing ovation at Cannes, when it was shown. This may be a little bit over the top. I suspect when the furore has died down some will choose to swing the pendulum back and criticise it for its more obvious faults. Much of the film is derivative. There are few ideas in the film's magical dreamworld that haven't been seen before. There are also few ideas in the film's depiction of the Civil War that can't be read in Satre or Orwell; can't be viewed in Picasso's Guernica; or can't be watched in Land and Freedom.For all the evident truth of these observations, to accept them would be to entirely miss the majesty of Pan's Labyrinth, which doesn't lie in its originality but its absolute mastery of execution. People will watch Pan's Labyrinth in a way that most won't watch Land and Freedom. In doing so, they will also discover a world of fairy tales which existed before Disney sunk its claws into them: a dangerous world, where nothing is as it seems and every step is a possible death  a place which may leave even adults shivering under the duvet, part in terror, part in wonder. And all this backed up by the finest cinematography I've seen.The only real faults I am prepared to allow for this film is a slight tendency (particularly at the end) for a Narnia-like moralism, and the fact that the faun is, perhaps, is not quite wild enough! These are eminently forgivable, though. This is easily the best film I've seen this year, and a must see on the big screen."
    },
    {
      "username": "EVON1TY",
      "userUrl": "https://www.imdb.com/user/ur47939660",
      "reviewLink": "https://www.imdb.com/review/rw8902191",
      "warningSpoilers": false,
      "date": "2 March 2023",
      "rate": "10",
      "helpful": "19 out of 20 found this helpful.",
      "title": "Between the violence of the real world and charm of the Fantasy. ⭐",
      "content": "I know not everyone should like this movie as I am. I actually don't like this type of Fantasies. I like Fantasy movies that are belong to another Fictional Universe. Making a Fantasy movie in our world were not a great idea for me. But this movie shows you the real world, makes you feel the reality and all the bad things in the world. Then shows you a great land, I don't know like a Heaven. You're traveling one to another. You're seeing another aspect all the time.That is why this movie is so unique. It doesn't bring you another world. Bring the another world to your world. And somehow It manages to doing that so perfectly.Not only these but this movie has amazing fictonal characters. The terrifying villain, the innocent daughter that deserves to see miracles, the mother that doesn't have a choice, the creatures with unique visuals.Acting, costumes, makeups, editing are pretty good. But the Screenplay, Scores and Cinematography are just brilliant. Totally worth to see, you'll see another type of Fantasy with this movie."
    },
    {
      "username": "mizhelenuk",
      "userUrl": "https://www.imdb.com/user/ur1426008",
      "reviewLink": "https://www.imdb.com/review/rw1459456",
      "warningSpoilers": false,
      "date": "27 August 2006",
      "rate": "10",
      "helpful": "908 out of 1,078 found this helpful.",
      "title": "Just magical",
      "content": "I saw the film at FrightFest in London a couple of days ago, and was pretty well sure I'd be seeing something special - but I ended up seeing a film that is downright extraordinary. Brutal but beautiful, magical yet earthy, it has a remarkable cast, with standout performances all round.A special mention must go to Sergi Lopez, whose 'Captain Vidal' is indeed one of the most sadistic film creations ever seen. Yet he manages to make the audience understand why he is the way he is ... an astounding performance. Maribel Verdu's quiet but rebellious housekeeper is one of the strongest female roles I've seen in many a year, and she is supported by a wealth of talent. Young Ivana Baquero is surprisingly self-assured as 12-year-old Ofelia, and I especially liked her almost Alice-like approach to the magical creatures she encounters in the labyrinth. The icing on this warped fairy tale is Doug Jones, who gives a towering performance - and in this case literally, as well as figuratively - as the guardian of the labyrinth, a faun, full of grace and charm and latent menace. Although dubbed, his Spanish is perfect (Jones speaks not a word of the language), and his physical presence is incredibly powerful as his character teases, cajoles and harries Ofelia to fulfil her tasks. He also plays the devastatingly creepy and disgusting 'Pale Man' - a creature that almost equals Vidal in his terrorising habits.But the cast is just one facet of this gloriously photographed film, with Javier Navarrete's hauntingly simple score weaving itself into the fabric of a film perfectly edited and written. The brutality of post-Civil War Spain contrasts with the world of magic to which Ofelia is drawn, yet everywhere she goes she has choices to make. In fact the film is about choices, good and bad, and one discovers that no matter how desperate a situation becomes, a choice is always available - although that choice may mean one's death. The film is violent - very violent, but each moment of brutality, although graphic, has a purpose - nowhere is it gratuitous.I loved it - as I knew I would - and if the Oscar voters don't give this film at least a nod for Best Foreign Language Film next year, then I will know that they have lost any sense of reason or comprehension. Because this film is truly a masterpiece, and Del Toro's greatest work to date."
    },
    {
      "username": "Chris_Docker",
      "userUrl": "https://www.imdb.com/user/ur0064493",
      "reviewLink": "https://www.imdb.com/review/rw1527656",
      "warningSpoilers": true,
      "date": "22 November 2006",
      "rate": "10",
      "helpful": "217 out of 293 found this helpful.",
      "title": "A masterpiece",
      "content": "1944. Franco's authoritarian fascist regime is a horrid world for a child, barely into her teens. Ofelia retreats into herself, finding in her fantasy world the lessons of courage, self-discipline and integrity she will need. With her, we travel beyond outward appearances, through a labyrinth of fears and uncertainties, from which Spain will not escape for several decades.A dark, brutal fairytale, chillingly set in the real world but full of hope and warmth, Pan's Labyrinth accomplishes a masterpiece.Our film opens with a momentary shot of Ofelia, blood from a nosebleed disappearing as the frames are introduced in reverse. A voice-over takes us back to the time of the Spanish Civil War. Ofelia arrives (with her pregnant mother) at a nationalist military base in the woods and is introduced to her stepfather, a vicious commanding officer. Capitán Vidal dispenses arbitrary justice to anyone he suspects is against him. Two suspected rebels caught by his men are summarily executed. Only afterwards is a rabbit discovered in their bag, proving their claim that they are just woodsmen (and maybe also a throwaway reference to Alice in Wonderland). Ofelia is unwilling to accept this harsh adult world. She retreats into a labyrinth where she meets a strange Pan-like creatures, Fauno, who gives her a set of tasks where she has to face some of her darkest fears, winning a key for her next task. The story becomes more intense, both outside the labyrinth (where Vidal is busy torturing people) and inside, where Ofelia has to face the Pale Man - a creature that has plucked out its eyes and can only see by placing them in the stigmata on its hands. Around the walls of the room are pictures of people being cast into hell by the Pale Man (From inference or the director's comments, it is apparent that the Pale Man represents authoritarianism, whether that of the Fascists or the Church). In Pan's Labyrinth we have a parable about the journey of Spanish society from the 1940s to post-Franco, a magical fairytale of stunning beauty, a story of the struggle and character development of a child on the edge of puberty, and a tense story of battles between Nationalists and Republicans. That they are all welded together seamlessly and precisely in a multi-level narrative is a remarkable achievement and thrilling experience. The sheer artistry recalls Cocteau's La Belle at la Bête. Del Toro sweeps us into a dreamlike, poetic vision, with a minimum of CGI and a grasp of dialogue that seems almost transcendental. In a brave decision, an actor (Ivana Baquero) who is only as old as her character has been used to play the young Ofelia. But as the ethereal figure between two worlds, she is also there to cast the earthy characters involved in material battles into more visceral contrast. Editing is crisp throughout, without a single frame wasted. Rich colours and unflinching camera-work keep us rooted in the experience, whether it is Ofelia crawling face-down in the mud and covered with insects, or a hapless victim having his nose smashed in by the Capitán. Yet scenes of tenderness and beauty are equally as moving - Ofelia retreating into her mother's arms, a nursemaid powerless to help her republican lover, or a doctor performing an act of mercy.The movies, like our dreams, folklore and imagination, are rich with symbols and images that can strike a chord in our deepest being. Artists, as well as creators of myths and religion, have long employed such symbols to guide and inspire, knowing that the conscious mind may accept a sign more easily than rational argument alone.In watching a movie, we combine ideas of the real, the imaginary and the symbolic to find an inner affinity. And, if the filmmaker has done his job properly, will feel truly moved.One of the things that can make or break a movie that makes extensive use of symbols is whether those symbols echo in the collective unconscious, often through time honoured association, or not. Knowledge of mythology or Jungian psychology can make all the difference. Much has been made of the title. Originally 'El Laberinto del Fauno', the translation at first appears sloppy, but Del Toro has done his research well. While quipping that it 'just sounded better', a little investigation of classical authorities shows Faunus as a form of the ancient god Pan (Lempriere). Pan, the goat-like god that represents a totality of possibilities, together with goat-like stubbornness and independence of thought, is the perfect symbol. In the film he says, \"I've had so many names... I am the mountain, the forest and the earth. . . . I am a faun. Your most humble servant, Your Highness.\" In Greek Mythology, Pan also won the affections of a princess under the form of a goat. The freedom of thought (and sexuality) he advocated, with the rise of Christianity, caused him to be portrayed as the Devil; but we learn his intentions are good, whereas the holy-looking Pale Man offers temptation only as an excuse to rip his victims apart. As an aspect of the creative power, fauns in mythology also symbolise firm aspiration and human intelligence.The one symbol that Del Torro is less adept in using is that of dying. He tends to use the valid, if flawed connotation of redemption-through-death promoted by the religions he disavows, but it is a small point that in no way spoils the story.Pan's Labyrinth leads us through parallel stories and themes without once losing its internal consistency. Some audiences may be put off by the idea of using flights of fancy in such a blatant way or, sadly, by the fact that it is subtitled. Such minor monsters should not get in the way of enjoying the film on a simple entertainment level. Cinephiles, on the other hand, will not want to miss such a rare treat of talent."
    },
    {
      "username": "Wesley-Wang",
      "userUrl": "https://www.imdb.com/user/ur73224356",
      "reviewLink": "https://www.imdb.com/review/rw4180550",
      "warningSpoilers": true,
      "date": "27 May 2018",
      "rate": "10",
      "helpful": "182 out of 205 found this helpful.",
      "title": "In Depth Analysis of Interpretations",
      "content": "Sixth viewing: My appreciation only grows. Interpretations-1st interpretation: Ophelia's world is real- happy ending.If this interpretation is valid, we deal with themes of war and disobedience. Here, Pan's Labyrinth serves as an allegory against the totalitarian regime of Fascist Spain, symbolized by Vidal. Vidal is represented in the fantasy storyline by the Pale Man; they both sit at the end of the table at the feasts, and they are both violent and cruel. Furthermore, the Pale Man is an allegory to \"Saturn Devouring his Son\" by Fransisco Goya, as both Cronus and the Pale Man eat the heads off of their victims first. If Cronus represents the Pale Man, and the Pale Man represents Vidal, and Vidal represents Fascist Spain, Del Toro implies that Fascist Spain is just as cruel as Cronus; like how Cronus devours his own sons, Fascist Spain kills their own people.2nd interpretation: Ophelia's world is her imagination- tragic ending (or is it? Some might say that she was better off dead than having to live with her terrible hardships).If this interpretation is valid, we deal with themes of self-deception and how reality and fantasy can coexist. Here, Pan's Labyrinth explores how Ophelia creates a fantasy for herself to deal with the harsh realities of war. In this case, we can interpret the final fantasy sequence as Ophelia's imagination, her creation and the world she wished to live. Besides, you can tell she is still alive, as Del Toro shows her lips quiver right after the fantasy sequence.Observations-*The film features many smooth cuts, which Del Toro hides with trees and black screens. This could imply how reality and fantasy intertwine, supporting the second interpretation. BUT smooth cuts never go from fantasy to reality or reality to fantasy, only fantasy to fantasy or reality to reality. This could suggest the first interpretation, where reality and fantasy are separate.*Vidal sees the monster under the bed, which supports the 1st interpretation. Yet at the same time, he does not see the faun at the end, which supports the 2nd interpretation. But again, Vidal has just consumed some kind of poison, so it may be his hallucinations in which he does not see the faun.*Del Toro never cuts away from the violence, emphasizing the brutality of war.*Cinematography is magnificent- dark, gloomy, blue colors in reality sequences to depict its dreariness, while bright, vibrant reds and oranges to depict enthusiasm. In the final scenes, the reds of blood and explosions stand out because the blues have become so common with the eye. Del Toro consciously had the blood and explosions to stand out to emphasize the violence of war.*Notice how Del Toro establishes tension between Ophelia and Vidal; When Ophelia shakes with the wrong hand, Vidal points it out, forming an uneasy tone between them. This first encounter between the two main characters in their respective storylines is vital for their relationship in the future scenes, especially the climax.Bottom line is, both interpretations are valid, and Del Toro utilizes both of them to deliver both of their respective themes.As magnificent as this film is, there may be authenticity flaws. For example, why didn't Mercedes kill Vidal after she escaped? Is she still obedient to Vidal? Then why did he directly disobey his order at the end when Vidal asked to tell his son the time of his death? For me, it's clear why Del Toro left these authenticity flaws: to drive the story forward. Attempting to patch these flaws would've been at the expense of pacing, and the audience's engagement is more important than plot holes.After all, these flaws are more or less hidden; visible only to those who know where to look."
    },
    {
      "username": "areatw",
      "userUrl": "https://www.imdb.com/user/ur66517869",
      "reviewLink": "https://www.imdb.com/review/rw4052827",
      "warningSpoilers": false,
      "date": "4 February 2018",
      "rate": "9",
      "helpful": "34 out of 42 found this helpful.",
      "title": "Wonderful combination of fantasy and reality",
      "content": "Few would dispute that 'Pan's Labyrinth' is one of the best foreign language films of the 2000s, but I would go one step further and argue that it's also one of the best modern day fantasy/adventure films in general. There aren't many films that manage to blur the lines between fantasy and reality as effectively as 'Pan's Labyrinth'. The effortless transition between the real world and the underworld and the way the two worlds are interlinked really is something special and I've never seen it done as well before.The combination of a convincing and easy to buy into storyline and the magical fantasy underworld works perfectly. The fact that both parts of the story could easily stand alone without the other, and yet go together seamlessly, is an indicator of just how good it is. The horror elements also bring something completely different and unexpected to the film, though they are tastefully added and never overdone. Overall, a wonderful film and one of the best fantasy/adventures of the 00s."
    },
    {
      "username": "dante_leebo",
      "userUrl": "https://www.imdb.com/user/ur1740087",
      "reviewLink": "https://www.imdb.com/review/rw1458375",
      "warningSpoilers": false,
      "date": "25 August 2006",
      "rate": "9",
      "helpful": "576 out of 741 found this helpful.",
      "title": "Beautiful, violent, magical and sad....",
      "content": "I was fortunate enough to catch Pan's Labyrinth last night as part of the 'Fright Fest' programme in London and was completely blown away. Guillermo Del Toro himself was present to both introduce the movie and to answer questions afterwards. He spoke very passionately about the film, and it was easy to see why. Guillermo Del Toro has created something very special - part war movie, part fantasy, that everyone should see. The film features a fantastic performance by Sergi Lopez as Captain Vidal and as central character Ofelia, newcomer Ivana Baquero delivers the performance of a seasoned veteran. If you are the type of person who is put off by subtitled movies, don't be. This is a very 'visual' film that does not rely overly on dialogue. This does not open until 24 November in the UK and 29 December in the USA but already I am looking forward to seeing it again (and buying the Special Edition DVD).This is the first time I've felt the need to write a review on here. Do yourselves a favour and go and watch it on the big screen."
    },
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw3244694",
      "warningSpoilers": true,
      "date": "24 May 2015",
      "rate": "10",
      "helpful": "36 out of 53 found this helpful.",
      "title": "One of the best films ever made.....",
      "content": "You would think that, with 1000 or so positive reviews, one more would not matter? However, this is not only one of the most extraordinary films ever made, it is also a personal fave which I have seen many times.Comments include: * can Guillermo del Toro actually make a bad film? I don't think so. Because of his name on the credits I have checked out many films of his that, while not in the same class as this one, were nonetheless flawless in execution.* of many film I have seen about war (too many to count) this one manages to humanize the condition to a greater degree than I can recall. Each character is perfectly cast with perfectly written dialog to bring home the metaphor of trying to live your life while chaos reigns around you. A little girl with a sick pregnant mother who just lost her father and finds her step-father to be a monster ... perfect!* many films deliberately strive for that special \"ambiguous\" ending but this one nails it. I remember couples coming out out the theatre arguing over what the real purpose of the film was, what the real ending was, what the intent was, etc * the one single scene where the young girl has to enter a subterranean land and retrieve artifacts WITHOUT EATING THE FOOD ON THE TABLE is in many ways scarier than the scariest horror films you could name. Moreso because the audience knows how hungry she was and empathizes. It reminded me of the Cyclops scene in the 1950s 7th Voyage of Sinbad, considered a classic of its own.* the scenes of violence (and there are many) are done so well you can almost taste the copper in the blood on screen One of the best films ever made"
    },
    {
      "username": "dontslityourwrist_yet",
      "userUrl": "https://www.imdb.com/user/ur5748127",
      "reviewLink": "https://www.imdb.com/review/rw1544536",
      "warningSpoilers": false,
      "date": "14 December 2006",
      "rate": "10",
      "helpful": "475 out of 604 found this helpful.",
      "title": "Unexpected brilliance.",
      "content": "This is a movie with a simple and straightforward plot which contains layers and layers of intelligent writing, metaphors and message.To speak further about the script will end up in spoilers and that would be pointless since my very purpose writing this review is to encourage people to see it.This is no small feat, interpreting fantasy as something of a product of a real world, cross-referencing how the child acts to her real surroundings and the \"other world\", metaphors that describe the accelerated state of growing up some of us are put through... Incredible. Simple, straightforward yet there is so much to be appreciated.Those who are saying how it's predictable and thus not enjoyable, I ask of you, which movie nowadays aren't predictable? Hell, even 21 grams was predictable but so damned good. It's not about how it ends, you can always predict how a movie would end if you've ever taken a half-decent script writing class or have some common sense. It's always about how well you tell a story.I'm grateful there are still directors who aren't tied down to this new epidemic of including a plot twist simply because they need a plot twist.Pan's Labyrinth features some of the best storytelling and attention to detail without being affected by the now ever-popular opinion of cameras having to be put through several technical difficulties to make the shots eligible to be called a brilliant shot.I am also grateful for them not dubbing it. Watching it in its' original language is much, much more rewarding even if I had to rely on the subtitles for most of the time.This is a brilliant movie. Watch it."
    },
    {
      "username": "zetes",
      "userUrl": "https://www.imdb.com/user/ur0391152",
      "reviewLink": "https://www.imdb.com/review/rw1579072",
      "warningSpoilers": false,
      "date": "21 January 2007",
      "rate": "7",
      "helpful": "175 out of 307 found this helpful.",
      "title": "It's good, but nowhere near as good as the reviews would have you believe",
      "content": "I had unsurmountable expectations for this one, and, alas, they remain unsurmounted. It didn't even come close. It is an entertaining film, but, as a whole, it feels half-baked. Near the end of the Spanish Civil War, a little girl, Ofelia, is taken with her pregnant mother to an old mill, where her new husband, a sadistic army captain, awaits. At the mill, she meets a fairy who leads her to a faun, who asks her to perform three tasks so she might take her place as princess of a magical kingdom. It's less a fantasy film than a fairy tale. In that way, I suppose I'm obliged to forgive that its fantasy world goes completely unrealized and remains paper thin throughout. Honestly, except for a couple of sequences, there really isn't a fantasy world. Most of the film takes place in the real world, where the Captain is trying to rid the area of some pesky rebels and Ofelia's mother is struggling to survive her difficult pregnancy. What is much harder to forgive, though, is that Guillermo del Toro extends the two-dimensionality to the Spanish Civil War setting. The Captain is a completely cartoonish bad guy, and the situation is seen completely in black and white. I mean, we're talking about a real conflict here where many people died. It's kind of insulting. If this were an American made film, people would be railing against it. It's also insulting to Spirit of the Beehive, on which del Toro has said he based the film. Where Spirit is a gentle yet effective study on the nature of human cruelty, Pan celebrates human cruelty with extremely violent sequences which are meant to be enjoyed as they are in action films (the director did, of course, previously make Blade II and Hellboy). Wow, it sounds like I hated this film! I didn't, really. I have some ideological problems with it, obviously, and I wish it were better than it is. But it is an enjoyable little horror/fantasy film. You could do better, but you could do worse, too."
    },
    {
      "username": "allan-117",
      "userUrl": "https://www.imdb.com/user/ur4379409",
      "reviewLink": "https://www.imdb.com/review/rw1473483",
      "warningSpoilers": false,
      "date": "12 September 2006",
      "rate": "10",
      "helpful": "571 out of 733 found this helpful.",
      "title": "The best fantasy of the past decade",
      "content": "Everyone's been raving about this. My opinion doesn't differ too much. It did however suffer slightly from the overwhelmingly high expectations I'd developed based on how brilliant everyone said it was, and the whole \"20min ovation at Cannes\" thing. Really, who stands for that long? That said, it's an amazing work.Skipping the plot recap (find the briefest synopsis you can if you need to be filled in), I'll go straight to the tech specs. I'm not a huge Del Toro fan, Cronos was interesting but lacked something for me. Mimic was dross. Hellboy was enjoyable and Ron Perlman is always great on screen. But here, the director really outdoes himself. By far. He has wrapped together some amazing elements and somehow maintains a balance, that doesn't tip into the mundane or the ridiculous for a moment. And this is no mean feat. The story is part historical drama, part fantasy, part family melodrama. When it dips out of the fantasy, it still enchants.Sergi Lopez and Maribel Verdú really drive the story in the historical drama scenes. I haven't seen Lopez in anything other than a film called Lisbon, in which he played a character so completely opposite from the Captain. He is a fierce and terrifying guy but actually comes across as sympathetic in a couple of scenes. Verdu is incredible as Mercedes, the head housekeeper (or something) who is Ofelia's closest friend in the house. The scenes with these characters and the civil war subplot never fail to hold your attention. Ivana Baquero is excellent as the main character Ofelia, her performance is very mature and believable and she shares some beautiful scenes with her mother and Mercedes.When the fairy tale elements return, it's astounding how naturally they fit into the story. I think that is the real magic of this film. The war drama and the fairy tale stem so naturally from each other.One thing that most reviews haven't mentioned is the violence. I think it's been firmly established that this is an adult's fairytale, but at times it is a very intense and brutal film. There are a couple of scenes in particular which are very disturbing and difficult to watch. These do not distract from the tone and theme of the film however so they don't seem exploitative at all. If you are squeamish, it may get a bit much for you.A final and obvious point I spose I can't get away without making: the set design, costumes and effects are superb. That's all.I was perhaps expecting a little more fantasy, but the unique blend of genres is absolutely compelling. There wasn't a false note anywhere or a plot hole, which are too often present in fantasy films. I can't recall a good, original fantasy film from recent years. Fortunately this blows MirrorMask out of the water. It doesn't share any of the contrivances, vagueness or ineffectual characters with that film.I just wish I'd seen it without already having read so much. I've tried very hard to not reveal any plot details at all as it does go to some surprising and unexpected places. Fortunately most of the reviews have done the same. I'd urge anyone with the chance to see it to do so immediately, and try not to read too much more."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2068585",
      "warningSpoilers": false,
      "date": "19 May 2009",
      "rate": "10",
      "helpful": "35 out of 60 found this helpful.",
      "title": "Quite possibly the best foreign language film I have ever seen!",
      "content": "Don't let the fact that it is in Spanish throw you. This is a dark, moving and sometimes terrifying masterpiece of a film. Director Guilliemo Del Torro directs with briskness and deep understanding of the film. The film looks gorgeous, very beautiful in one scene, and quite Gothic in another. Another director I can think of that directs visually stunning films is Ridley Scott. The music score by Javier Navarette is haunting, poignant and beautiful. The script is very mysterious, suspenseful and genuinely moving at times, and there are some genuinely memorable characters, the idealistic protagonist, the brutal stepfather, the pregnant mother and the caring housemaid. Here is one of the few fantasies where the images stay with you forever. There are beautiful costumes and a stunning forest set, the labyrinth is very Gothic and dark, as is the wise and mysterious faun, and the war and torture scenes are unashamedly graphic. Another honourable mention should go to the monster that tricks children into eating his food when he is asleep, and then he wakes up and eats them. He was so terrifying, the very look of him, made my blood run cold. He is one of the most terrifying creatures I have ever seen in the history of film. All in all, a visually stunning and absolutely magnificent film, with a definite 10/10. Bethany Cox."
    },
    {
      "username": "luckyfay",
      "userUrl": "https://www.imdb.com/user/ur2675801",
      "reviewLink": "https://www.imdb.com/review/rw1397321",
      "warningSpoilers": false,
      "date": "19 June 2006",
      "rate": "9",
      "helpful": "290 out of 432 found this helpful.",
      "title": "A labyrinth you don't want to leave",
      "content": "I saw this film toward the end of the Cannes Film Festival; it edged out all the others I'd seen, 30 of them, because of its wonderful story; history, politics and fantasy woven into a fabric spun by a superlative creative team headed by Guillermo del Toro. In comparison to this, his latest effort, del Toro's other films only hinted at the depth and breadth of his talent. In this film, much as I pride myself on foreseeing the outcome of most stories, I could not guess what would happen next. The film is quite long, yet suspense is sustained throughout. The music is some of the best I've heard in years, so well suited to the action that you almost don't notice its specific effect because of how well it is intertwined with the visual, emotional and intellectual experience.In my opinion, del Toro's \"...Labyrinth\" deserved to win at Cannes over the Ken Loach film, \"The Wind That Shakes the Barley\". Actually, everyone I knew at the Festival who had seen both agreed with me. And the 22 minute ovation speaks clearly for the effect on the audience. It's hard to imagine that any film could beat it in a context other than Cannes where they have marked preferences, bordering on obsession, for certain directors.Let's hope that the late December opening favors an Oscar nomination which it should win hands down, unless some other work of genius appears on the horizon. That doesn't seem likely because at Cannes the somewhat disappointing array of films was attributed to the fact that not much great product is being released this year. I might add that I had already seen Volver prior to Pan's Labyrinth, and I maintain that Pan is the better film. For me, it displaced all three of my top films of the year. I do love The Departed but, luckily, that's in another category which does not threaten Pan's access to Oscar. If I had to choose the very best picture of the year, without limitation by category, it would most assuredly go to Pan's Labyrinth for it demonstrates del Toro's originality and brilliance as both writer and director."
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw1662887",
      "warningSpoilers": false,
      "date": "26 May 2007",
      "rate": "6",
      "helpful": "100 out of 188 found this helpful.",
      "title": "Entartaining but not one of the very best movies from last year",
      "content": "When I heard first time about the movie made by the Mexican director Guillermo del Toro that was a mixture of many genres, including drama, fantasy, thriller, and fairy tale for adults that takes place in Spain of 1944 in two parallel words, one of unbearable bleak and horrifying reality, and the other of deliciously dark magic fantasy, I wanted very much to see it. I knew that the movie has been praised by many critics and has made hundreds top lists of last year, that it was nominated for countless awards including six Academy awards and it won three Oscars, and that it had received 20 minutes standing ovation at Cannes. The main reason for me was the fact that I love del Toro's earlier film, \"The Devil's Backbone\" (2001), the ultimate ghost story that goes beyond the genre and very successfully mixes horror, suspense, and coming of age during the war time story.I hoped and expected \"Pan's Labyrinth\" to be as compelling, insightful, interesting, and engaging as \"The Devil's Backbone\" was. I finally saw \"Pan's Labyrinth\" couple of days ago and I was disappointed. The movie has an interesting concept, even if not original one. It brings to mind many famous works of literature and the earlier movies about the little girls escaping their dreadful realities of war or death of the loved ones or all sorts of abuse in the world of their imagination such as \"Forbidden Games\", \"Spirits of the Beehive\" (which \"Pan's Labyrinth\" tried to be but never was), the later also takes place in Spain during the Civil war, as well as \"Wizard of Oz\", \"Alice in Wonderland\", \"Legends and Myths of Ancient Greece\". One movie that \"Pan's Labyrinth\" has been often compared to is Terry Gilliam's \"Tideland\", his fairy tale for adults, his \"Alice in Wonderland meets Psycho\" which also tells the story of an 11-years-old girl and her world of imagination. \"Tideland\" was released last year and was either ignored or hated by majority of critics and left many viewers puzzled and confused. I am not completely in love with \"Tideland\" but I found it much more interesting that \"Pan's Labyrinth\" in all aspects. The main difference between the two - Gillian does not present reality in his film in the simplistic way and does not divide his characters to devilish monsters or shining knights the way Del Toro does in \"Pan Labyrinth\". I am not sure what the target audience for Del Toro's film is? Its story (the writer/director was nominated for the best screenplay and I found his writing the weakest and most ridiculous part of the movie) is so naive and primitive that you would think the movie was made for children but its shocking violence and horrifying tortures are not easy to watch even for adults. Another problem is with the characters. I know I should sympathize with Ofelia, and who would not feel empathy for an 11-year-old girl who had to live through the death of her mother and to confront her monstrous step-father but if frankly, her character is not very interesting. As for visual effects and cinematography, the film looks good but not especially spectacular or breathtakingly beautiful. Of five Oscar nominated films for best cinematography from last year, at least three seemed to be more interesting. Gilliam's \"Tideland\" that was completely ignored by the Academy, is always technically superb, visually arresting and much more impressive than \"Pan's Labyrinth\". I should admit that at least one scene in \"Labyrinth\" was absolutely brilliant - dark and scary it came directly from Francisco Goya's terrifying painting, \"Saturn Devouring His Children\" and it was extremely imaginative. I would not go as far as calling \"Pan's Labyrinth\" a bad movie and give it one star. It is not bad; it is just not as great as I thought it would be. As for all the awards, \"The Devil's Backbone\" is much more deserving than \"Pan's Labyrinth\" and that's the film I would give a standing ovation to."
    },
    {
      "username": "morrison-dylan-fan",
      "userUrl": "https://www.imdb.com/user/ur5424352",
      "reviewLink": "https://www.imdb.com/review/rw5789516",
      "warningSpoilers": true,
      "date": "31 May 2020",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "\"You're getting older, and you'll see that life isn't like your fairy tales. The world is a cruel place. And you'll learn that, even if it hurts.\"",
      "content": "After hearing about it for years, I was pleased when The Devil's Backbone (2001) surpassed all my expectations. Being very lucky in having a Del Toro box set thanks to Red-Barracuda from this site,I decided to enter the labyrinth.View on the film:Returning to Spain after five years to conjure up a \"Sister\" film to The Devil's Backbone (2001-also reviewed) writer/directing auteur Guillermo Del Toro (GDT) reunites with cinematographer Guillermo Navarro and turns the clockwork of a pocket watch to a continuation of the recurring themes and motifs across his works.Stating in the audio commentary that he \"Never wanted the camera to be settled\" and also to continue from Backbone in setting the title largely in a single location, so it can act \"As a microcosm to this stage of the Spanish Civil War.\" GDT crosses the line between fantasy and reality with highly stylised wipes moving in synch to drifting panning shots, which along with creating a page-turning sheen,also spins a fittingly unsettled atmosphere, as Ofelia drifts to follow the demands of the Faun, whilst also drifting out of sight from Captain Vidal.Enchanting with a death and rebirth bookend shots,GDT continues to build on the amber colours of Backbone, with the brooding amber lights emphasising the harsh, colourless reality Ofelia is in under the rule of General Franco,which is sharply contrasting by the lush, green magical realism unveiled in Ofelia's encounter with the Faun, which GDT subtly casts out to the republican rebels coming out of saturated green lands to fight for freedom.Reuniting with GDT, Doug Jones gives wonderful performances as Fauno / Pale Man,with GDT wisely deciding to stick to practical effects rather than CGI, giving Jones the chance to keep the creatures between the enticingly mythical, and the monstrously aggressive. Haunting all in the real world,Sergi Lopez gives a excellent turn as Vidal, whose Fascist viciousness Lopez keeps burning as Vidal inflicts horror on all he sees, with a chilling disregard for any life which is not his.Entering the labyrinth GDT (who gave up his entire salary,so the film could be made) has built, Ivana Baquero gives a magical performance as Ofelia. Discussed by GDT in the audio commentary that \"Choices and consequences\" is the main theme he wanted to explore, Basquero superbly expresses the subject in Ofelia's initial wide-eyed excitement at making the choice to enter the fantasy, a choice that leads Ofelia maturing and saying no to the evils of the real and fantasy world, aware of the consequences she will face in finding her own exit from the labyrinth."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw1581738",
      "warningSpoilers": false,
      "date": "24 January 2007",
      "rate": "",
      "helpful": "53 out of 102 found this helpful.",
      "title": "Not strong enough in important ways to make it the classic everyone is hailing it as but certainly interesting and engaging enough to be one of stronger films of 2006",
      "content": "Carmen has married Captain Vidal and, pregnant with his son, travels with her daughter Ofelia to join him in his woodland barracks where he is trying to quash the small bands of rebellion against the Fascist regime. Carmen is not well and Vidal immediately puts her into the care of Dr Ferreiro who confines her to her bed after a short time. Vidal is a cruel man, perhaps hardened by the battle he fights and the beliefs he holds and Ofelia finds him to have no time for her and her no interest in him. While she tries to cope with the reality of her new life she also finds herself taken by a fairy into a dark underworld where a faun offers her a new life as a princess if she completes a series of tasks for him.With all the papers and amateur reviewers here putting this film high up the list of best films of 2006 I rued that I missed my chance to see the film when it originally came out but got the opportunity recently on holiday in Cornwall at what my girlfriend called the \"smallest cinema on earth\" (it wasn't but it must have been close). Perhaps the weight of expectation on the film played a part but I confess to have enjoyed it but not found the masterpiece that the majority have claimed. The film works pretty well and has a very strong central narrative which, contrary to the marketing, is actually the real world and not the fantasy. This is an engaging real-world horror that focuses on the struggle between guerrilla fighters and the fascists led by Vidal. On the other side of the coin we have the fantasy involving Ofelia where, like the real world, she finds a world of darkness where she is not entirely sure who to trust. Now my main problem with the film is the overlap between these two elements and how they fit together.I have read others say that the fantasy echoes the real world but, as much as I want to see this, it just didn't ring true for me. On a very basic level I get it but that is different from the film cleverly weaving them together and making it work. This separation detracted from both aspects of the story (although less so the real parts) and also saw the fantasy be only partially explained and harder to become really engaged with. My girlfriend said she felt the story was simplistic enough to work best for older children and that the \"horror\" part was therefore too harsh as it prevented this audience getting in the door (in the UK this was rated a 15). At first I agreed with her but on reflection it actually works the other way because this is much more of an adult tale but just doesn't quite have the intelligence and complexity in all parts of the story (again specifically the fantasy).By this point my review will have been slated by all readers who are not used to a dissenting voice but for those who have made it this far let me just say that it is a very good film overall and that I did enjoy it. Outside of the plot there is much to enjoy as well. The writing is very good and the dialogue (albeit subtitled) interesting and never clunky or obvious even if some of the scenes would have made it easy for it to be so. The fantasy world is wonderfully created and engagingly dark with the creatures a mix of wonder and menace. The faun himself is good and well used although it was a shame to see such a terrifying vision such as the pale man so briefly used and with little expansion beyond a lurching menace in one scene. Del Toro directs well across all aspects of the film and keeps this sense of dark menace across everything. I also liked the references scattered across the narrative, such as Alice in Wonderland to name one in particular. He directs his cast well too, drawing a very good performance from Baquero in the central role. López could have hammed it up but, while he doesn't really make a person here, he avoids being a pantomime baddie. Verdú is strong as Mercedes while Gil is good but left with little to do outside of suffer and worry. Jones does well within his creatures to deliver the potential within the design.Overall then not strong enough in important ways to make it the classic everyone is hailing it as but certainly interesting and engaging enough to be one of stronger films of 2006. Visually impressive and very well delivered, I'm afraid I just found it hard to get over the disconnect between the two aspects of the story no matter how much I wanted to find it."
    },
    {
      "username": "Tweetienator",
      "userUrl": "https://www.imdb.com/user/ur64264987",
      "reviewLink": "https://www.imdb.com/review/rw4054653",
      "warningSpoilers": false,
      "date": "6 February 2018",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Ueber-Fantastic",
      "content": "Pan's Labyrinth is one of the few movies I rate with a straight ten: a fantastic and unusual story, an outstanding cast (Ivana Baquero is incredible good as Ofelia), a superb cinematography and directing - simply put, a movie without any flaw. Everything composed like a well-balanced opera or a play by Shakespeare.Guillermo del Toro did with this movie one of the finest moments in movie history. Pan's Labyrinth belongs to me in the same league as movies like Metropolis, Apocalypse Now, Godfather etc.A must-see. Especially for every lover of the unusual, fantastic and strange."
    },
    {
      "username": "damianphelps",
      "userUrl": "https://www.imdb.com/user/ur29500838",
      "reviewLink": "https://www.imdb.com/review/rw6087669",
      "warningSpoilers": false,
      "date": "12 September 2020",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Amazing Atmosphere",
      "content": "This film has such a unique style and essence, its beautiful and magical as much as it is ugly and harsh.I have never seen a movie quite like this one, I went into it not knowing much about it (I had seen the hands with eyes but that was about it) so it was very much a sense of discovery as the tale and the fantasy unfolded before me.Way more violent than I would have guessed but the story is brutal and cruel so it is fitting.If you are into the art-form of film (not just a movie buff) then this is a must watch."
    },
    {
      "username": "ThreeSpoons82",
      "userUrl": "https://www.imdb.com/user/ur7716945",
      "reviewLink": "https://www.imdb.com/review/rw1475048",
      "warningSpoilers": false,
      "date": "15 September 2006",
      "rate": "9",
      "helpful": "326 out of 477 found this helpful.",
      "title": "Beautiful!",
      "content": "I saw this at this years FrightFest Film Festival in London and absolutely loved it.Guillermo was there to introduce it and you can tell it really is a film he loves and is passionate about.He referred to it as a sister movie to The Devils Backbone.Anyway . . . so the film starts and I must admit I was expecting a lot more of a fantasy film however it is more of a 70/30 split between historical era movie/fantasy fairytale.Don't let this put you off though, the film really is stunning and brilliantly acted. The little girl carries pretty much the whole film on her shoulders and does so with the skill of Atlas himself! The violence is graphic and the monsters are scary but it is probably one of the most gorgeous and personal films from a director for a long time!Give it a go if you can get to a screening, DON'T WAIT FOR DVD, it really does need to be seen on a big screen!"
    },
    {
      "username": "ironhorse_iv",
      "userUrl": "https://www.imdb.com/user/ur34049683",
      "reviewLink": "https://www.imdb.com/review/rw3508783",
      "warningSpoilers": true,
      "date": "21 July 2016",
      "rate": "9",
      "helpful": "8 out of 11 found this helpful.",
      "title": "The door is locked. In that case. Create your own door. Open your mind and watch Pan's Labyrinth! It's an amazing movie. You just got to know where to look",
      "content": "Director Guillermo Del Toro stated that he considers the story to be a parable to his earlier film, 2001's 'The Devil's Backbone', as both addresses similar themes. Set in Spain during the aftermath of the Spanish Civil War (1936-1939) & influenced by children fairy tales from authors, L Frank Baum, Lewis Carroll, Hans Christian Andersen and the Brothers Grimm, along with adult-driven fantasies novels from authors, Jorge Luis Borges, Arthur Machen, Lord Dunsany, & Algernon Blackwood. \"Pan's Labyrinth' tells the story of Ofelia (Ivana Baquero), a young girl who comes to believe she is the reincarnation of a princess from the kingdom of the underworld. However, her new stepfather, Captain Vidal (Sergi López) thinks otherwise; who believes, that Ofelia is becoming too unstable for his plan for a stable Falangism regime for both his country and in his household. Without spoiling the movie, too much, there are two ways to look at this movie. One is looking at it through a child's mind where everything and anything is possible, regardless of circumstances. The other is through, an adult's mind, where rational thought dictates our actions. It's these two ways of thinking, that make the film, so thought provoking. Is Ofelia telling the truth and Vidal is the one, losing touch with reality or is Vidal right about the world, and everybody else is living in the fantasy world? Its complex questions like this that makes this fairy tale movie, so interesting to watch, but far too sophistical for small children. Definitely, it's not for toddlers or anybody under 8 year old, unless, you want them, to see something profoundly graphic/violent and disturbing. Not only that, it's somewhat depressing with a tear-jerker type ending. It's not family friendly, despite whatever, marketing wants you to think. Despite that, the film has really fine-adult-driven acting, mostly from both Ivana Baquero and Sergi López. I have to say, Sergi for sure, as he's one of the best villains in modern day film history. The Spanish dialogue also well-written, even if it's a bit confusing at times. The English subtitles, was very helpful in trying to understand the story. The music by composter Javier Navarrete was very haunting & beautiful. The piano & violins really brings the sounds of our own mortality and purpose into question. Well-done. The film also has a supernatural horror tone to its fantasy sequences. While, the film employs some computer-generated imagery in its effect, it mostly use complex make-up and animatronic to bring its creatures to life. There is no greater example of that, then the characters of the Pale Man & the Faun, both played by the same actor, Doug Jones. One of the biggest misconception about this film is that the Faun is Greek-deity-Pan, when Del Toro, himself, stated out that he is not. Instead, he along with the Pale Man is both original characters, taken straight out of the legendary nightmares fuel of Greek, Japanese, Nordic, Christian and Roman mythology and mixed together into something new. Both creatures represented the goods & evils of authoritarian. First off, you got the Pale Man who represented man-made-control like fascism & communism. In a way, the juxtaposition of the Pale Man's table with the scene of frightened townspeople lining up to take the only food they could probably get, rations doled out by the Fascists or the Communism rebels, has some significance to the plot. If we are to believe, that the Ofelia makes this fantasy story, up, taken from multiple sources. Then, it's become very clear, that the Pale Man is supposed to represent the adults around her. After all, they are the one that trying to shatter Ofelia's trauma-triggered fantasy perception of her harsh reality. Like the Pale-Man eating children, they are the ones killing the youth within all of us, only allowing those mature enough to breed and survive. It's control 'survival of the fittest' at its scariest. A very strong Holocaust overtone. Then you got the Faun that represented phenomena or the laws of nature. Just as much, as we have to follow man-made authoritarians; we're also dictated by the harsh changing environment in which, we lived in; which we mostly have no control of. Yet, we try to be disobedience against it. We always trying to control death and childbirth. It's no surprised that Del Toro chose the character's look to invoke a certain 'light-bringer'. Like mandrake roots, free choice in small amounts us to have some control of our lives, but in larger doses might kill us. Being submissive to something out of your control is not a bad thing. The existence of the unexplained, ever make this, belief, somewhat stronger. Overall: Regards to whether or not the fantasy underworld was real or a product of Ofelia's imagination, it doesn't really matter, as long, as you get that message. However, I didn't like, how Del Toro kinda ruin it, by spoiling his answer. In my opinion, having a film so deliberately ambiguous, is a stroke of genius. It's better off that way. In the end, it's a must watch from me. Highly recommended."
    },
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw3379078",
      "warningSpoilers": false,
      "date": "23 December 2015",
      "rate": "",
      "helpful": "6 out of 8 found this helpful.",
      "title": "fascinating",
      "content": "one of films who becomes an important experience. because it is, in same measure, a special war film and a fairy tale illustration. wise translation of idea of fiction as refuge against cruelty of every day life and homage to innocence. a great director. an extraordinary young actress. a story who mix fears, joy and need of measure in ambiguous world. a film like a poem. bitter, cold, touching, profound, necessary. because it is a precise exploration of life's purpose. because it is delicate and bitter and soft. a film about a war and a not ordinary, at the first sigh, manner to survive. one of films who becomes a personal memory. because it is a trip in your secret universe. and rediscover of unique colors from a special age."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw1584143",
      "warningSpoilers": false,
      "date": "27 January 2007",
      "rate": "",
      "helpful": "72 out of 149 found this helpful.",
      "title": "Thuggish",
      "content": "I get annoyed at movies that preach one thing and are themselves another.The story here has two components, a real and fantasy thread. The real world thread is simple. By that I mean there are no dramatic complications at all. The characters are theatrical cartoons. The situation starts out brutally and stays that way without any arc, development, evolution. It is in fact a formula movie, this thread, and one that follows a formula that is based on strict, strict boundaries. One would suspect it was written by a German, it is so regimented. One would almost believe it to be written by \"The Captain,\" the bad guy here.It marches. Its unambiguous. Its final and brutal in its morality, just as the Captian is. There are only good and bad people and the bad are not only very, very bad but they get their deserts. Justice isn't nuanced here. In fact nothing at all is.I suppose people celebrate it for its fantasy thread. Yes, the effects are good. Yes the creepy eyeless man was creepy. Yes the Tinkerbells were Tinkerbelly. But is this in any way better than \"Dark Crystal,\" which was similarly banal in its cosmology?Look, I'm one of the ones who get depressed at things like \"The Matrix,\" but if lacking in imagination, is copying was deep, complex, manylayered. This is something that Franco would have written, and little fascist parents would have trotted to, because its all about absolutes and the inability of humans to be rich, subtle, varied beings.The best we can do, is be \"innocent.\"I often can see some good in any film. But not this one. The world is too close to intolerant extremism as it is. Don't feed it by supporting this.Ted's Evaluation -- 1 of 3: You can find something better to do with this part of your life."
    },
    {
      "username": "poolandrews",
      "userUrl": "https://www.imdb.com/user/ur1355507",
      "reviewLink": "https://www.imdb.com/review/rw1857546",
      "warningSpoilers": true,
      "date": "14 April 2008",
      "rate": "5",
      "helpful": "24 out of 46 found this helpful.",
      "title": "Didn't do much for me at all.",
      "content": "El Laberinto del Fauno is set in Spain in 1944 during the Civil War, a widow named Carmen (Ariadna Gil) marries Captain Vidal (Sergi López) the sadistic ruler of a group of Nationalist soldiers. Carmen & her 11 year old daughter Ofelia (Ivana Baquero) move out to an old Mill in the countryside where Captain Vidal & his men are stationed trying to crush local rebel resistance. There Ofelia is lured into an ancient stone labyrinth by a fairy & down some steps into a magical fantasy realm, there she meets a creature called a Faun (Doug Jones) who says she was once the Princess of the magical realm & gives her three task's so she can reclaim her rightful place once again...This American, Spanish & Mexican co-production was written, produced & directed by Guillermo del Toro & after winning innumerable awards, accolades & critical acclaim I was expecting something a bit special which unfortunately wasn't forthcoming. Known more commonly under the title of Pan's Labyrinth in English speaking territories all the hype & advance publicity surrounding El Laberinto del Fauno stated that it was one of the best fantasy films of all time & like a fool I brought into it. The script by Toro is much, much more of a war time drama as it spends the vast majority of it's duration on the frankly depressing real life conflict between Spanish soldiers & rebels. In fact El Laberinto del Fauno is more of a drama than anything else, the quaint & sometimes charming fantasy elements are few & far between with only three or four notable sequences. When it focuses on Ofelia's fantasy world then it's often spellbinding but when it switches to the war time dramas it's horrible. When I watch a film I want to be entertained, nothing more nothing less. Watching El Laberinto del Fauno I was throughly depressed, it's hardly an uplifting tale & one that left me rather down. That's not what I want to feel like when watching a film, I'm sorry buts that the way it is. Some moments are genuinely unsettling & even upsetting to the extent that I sometimes found it quite hard to watch. The script leaves a lot of things open to the viewers interpretation but I thought it was pretty clear, the fantasy elements never really gel with the grim war time dramatics & the two make for uneasy bedfellows.Director Toro does a great job although I must admit I don't quite get what he was trying to do here. It's a tale of a girls imagination & hope but in the end he seems to want to crush any hope of any uplifting message in favour of some truly horrible moments of real life brutality, violence, torture & death. Some of the scenes in El Laberinto del Fauno are very disturbing, from people beaten to death, tortured, sliced open mouths & lots of bad things happening to good people. Presented entirely in Spanish with English subtitles I don't know about anyone else but while I'm reading the subtitles I can't get a good look at what's happening on screen, it's impossible, very frustrating & annoying. The special effects are pretty good, some of the CGI effects are a little below par I suppose but the make-up effects & creature design is very good. I wouldn't say El Laberinto del Fauno is scary but some of the character's do some really horrific things.Technically the film is very good, actually shot in Spain the production values are great & it's well made. The acting is excellent which makes it all the more powerful, whether that's a good thing I am not sure.El Laberinto del Fauno is a film lots of people seem to like for reasons which escape me, I thought it was a throughly depressing & disheartening experience that I have no desire to revisit. It has it's moments on occasion & it's often quite powerful stuff but that doesn't mean it makes good entertainment which I happen to think it isn't."
    },
    {
      "username": "davidcapa",
      "userUrl": "https://www.imdb.com/user/ur12573659",
      "reviewLink": "https://www.imdb.com/review/rw1495375",
      "warningSpoilers": false,
      "date": "12 October 2006",
      "rate": "10",
      "helpful": "301 out of 427 found this helpful.",
      "title": "Innocence and brutality",
      "content": "I saw the movie yesterday in the Spanish premiere and I confirm: it's one of the best Guillermo del Toro's films (if not the best ever). Innocence and brutality, fantasy and reality, together in a wonderful fairy tale about the power of magic in dark times. The performances are great, mainly from Sergi López, Maribel Verdú and the big revelation of the film: the 12 years girl Ivana Baquero. Del Toro repeats the context of the film \"El Espinazo del Diablo\" (\"The Devil's Backbone\"), the Spanish Post-Civil War, with the same philosophy: the supernatural invading the daily life in a depressive environment and the innocence of children trapped between both world. But \"El Laberinto del Fauno\" is most compact, most mature and best done in very aspects, and perhaps it's the most personal movie from Del Toro."
    }
  ],
  "errorMessage": ""
}