{
  "imDbId": "tt0095327",
  "title": "Grave of the Fireflies",
  "fullTitle": "Grave of the Fireflies (1988)",
  "type": "Movie",
  "year": "1988",
  "language": "en",
  "titleInLanguage": "Grave of the Fireflies",
  "url": "https://en.wikipedia.org/wiki/Grave_of_the_Fireflies",
  "plotShort": {
    "plainText": "Grave of the Fireflies (Japanese: 火垂るの墓, Hepburn: Hotaru no Haka) is a 1988 Japanese animated war tragedy film based on a 1967 short story by Akiyuki Nosaka. It was written and directed by Isao Takahata, and animated by Studio Ghibli for Shinchosha Publishing.\r\nThe film stars Tsutomu Tatsumi, Ayano Shiraishi, Yoshiko Shinohara and Akemi Yamaguchi. Set in the city of Kobe, Japan in June 1945, it tells the story of two siblings and war orphans, Seita and Setsuko, and their desperate struggle to survive during the final months of the Second World War. Universally acclaimed, Grave of the Fireflies has been ranked as one of the greatest war films of all time and is recognized as a major work of Japanese animation.",
    "html": "<p>Grave of the Fireflies (Japanese: 火垂るの墓, Hepburn: Hotaru no Haka) is a 1988 Japanese animated war tragedy film based on a 1967 short story by Akiyuki Nosaka. It was written and directed by Isao Takahata, and animated by Studio Ghibli for Shinchosha Publishing.</p><p>The film stars Tsutomu Tatsumi, Ayano Shiraishi, Yoshiko Shinohara and Akemi Yamaguchi. Set in the city of Kobe, Japan in June 1945, it tells the story of two siblings and war orphans, Seita and Setsuko, and their desperate struggle to survive during the final months of the Second World War. Universally acclaimed, Grave of the Fireflies has been ranked as one of the greatest war films of all time and is recognized as a major work of Japanese animation.</p>"
  },
  "plotFull": {
    "plainText": "Grave of the Fireflies (Japanese: 火垂るの墓, Hepburn: Hotaru no Haka) is a 1988 Japanese animated war tragedy film based on a 1967 short story by Akiyuki Nosaka. It was written and directed by Isao Takahata, and animated by Studio Ghibli for Shinchosha Publishing.\r\nThe film stars Tsutomu Tatsumi, Ayano Shiraishi, Yoshiko Shinohara and Akemi Yamaguchi. Set in the city of Kobe, Japan in June 1945, it tells the story of two siblings and war orphans, Seita and Setsuko, and their desperate struggle to survive during the final months of the Second World War. Universally acclaimed, Grave of the Fireflies has been ranked as one of the greatest war films of all time and is recognized as a major work of Japanese animation.\r\nPlot\r\nIn Kobe, the spirits of young war orphans Seita and Setsuko Yokokawa reunite and board a ghostly train as they recount how they survived the Bombing of Kobe in World War II.\r\nIn June 1945, a group of American Boeing B-29 Superfortress bombers destroy most of Kobe. Though Seita and Setsuko survive the bombing, their mother is severely injured and later dies. Seita conceals their mother's death from Setsuko in an attempt to keep her happy, which she later learns of despite Seita's efforts. Seita and Setsuko move in with a distant aunt, and Seita retrieves supplies he buried before the bombing and gives everything to his aunt, save for a tin of Sakuma drops. The aunt convinces Seita to sell his mother's silk kimono for rice as rations shrink and the number of refugees in the house grows. Seita uses some of his mother's money in the bank to buy supplies, but eventually, the aunt becomes resentful of the children, deeming them unworthy of earning her food.\r\nSeita and Setsuko leave their aunt's home after excessive insults, and they move into an abandoned bomb shelter. They release fireflies into the shelter for light. The next day, Setsuko is horrified to find that the insects have died. She buries them in a grave, asking why they and her mother had to die. As they run out of rice, Seita steals from farmers and loots homes during air raids, for which he is beaten and sent to the police by a farmer. The officer realizes Seita is stealing due to hunger and releases him. When Setsuko falls ill, a doctor explains that she is suffering from malnutrition. Desperate, Seita withdraws the last of the money in their mother's bank account. After doing so, he becomes distraught when he learns that Japan has surrendered, and that his father, an Imperial Japanese Navy captain, is most likely dead, as most of Japan's navy has been sunk. Seita returns to Setsuko with food, but finds her dying. She later dies as Seita finishes preparing the food. Seita cremates Setsuko's body and her stuffed doll in a straw casket. He carries her ashes in the candy tin along with his father's photograph.\r\nThat September, Seita dies of starvation at a Sannomiya train station surrounded by other malnourished people, as shown in medias res. A janitor is tasked with removing the bodies before the arrival of the Americans. The janitor sorts through Seita's possessions and finds the candy tin, which he throws into a field. Setsuko's ashes spread out, and her spirit springs from the tin and is joined by Seita's spirit and a cloud of fireflies. They board a ghostly train and, throughout the journey, look back at the events leading to Seita's death. Their spirits later arrive at their destination, healthy and happy. Surrounded by fireflies, they rest on a hilltop bench overlooking present-day Kobe.\r\nVoice cast\r\nProduction\r\nDevelopment\r\nGrave of the Fireflies author Akiyuki Nosaka said that many offers had been made to make a live-action film adaptation of his short story. Nosaka argued that \"it was impossible to create the barren, scorched earth that's to be the backdrop of the story\". He also argued that contemporary children would not be able to convincingly play the characters. Nosaka expressed surprise when an animated version was offered. After seeing the storyboards, Nosaka concluded that it was not possible for such a story to have been made in any method other than animation and expressed surprise in how accurately the rice paddies and townscape were depicted.\r\nIsao Takahata said that he was compelled to film the short story after seeing how the main character, Seita, \"was a unique wartime ninth grader\". Takahata explained that any wartime story, whether animated or not animated, \"tends to be moving and tear-jerking\", and that young people develop an \"inferiority complex\" where they perceive people in wartime eras as being more noble and more able than they are, and therefore the audience believes that the story has nothing to do with them. Takahata argued that he wanted to dispel this mindset. When Nosaka asked if the film characters were \"having fun\", Takahata answered that he clearly depicted Seita and Setsuko had \"substantial\" days and that they were \"enjoying their days\". Takahata said that Setsuko was even more difficult to animate than Seita, and that he had never before depicted a girl younger than five. Takahata said that \"In that respect, when you make the book into a movie, Setsuko becomes a tangible person\", and that four-year-olds often become more assertive and self-centered, and try to get their own ways during that age. He explained that while one could \"have a scene where Seita can't stand that anymore\", it is \"difficult to incorporate into a story\". Takahata explained that the film is from Seita's point of view, \"and even objective passages are filtered through his feelings\".\r\nTakahata said that he had considered using non-traditional animation methods, but because \"the schedule was planned and the movie's release date set, and the staff assembled, it was apparent there was no room for such a trial-and-error approach\". He further remarked that he had difficulty animating the scenery since, in Japanese animation, one is \"not allowed\" to depict Japan in a realistic manner. Animators often traveled to foreign countries to do research on how to depict them, but such research had not been done before for a Japanese setting. While animating the movie, Takahata also created several different cuts of the scene in which Seita cremates Setsuko's body. Takahata spent a lot of time on this scene, trying to create the perfect iteration of it. Each of these cuts remained unfinished and unused in the end.\r\nMost of the illustration outlines in the film are in brown, instead of the customary black. Black outlines were only used when it was absolutely necessary. Color coordinator Michiyo Yasuda said this was done to give the film a softer feel. Yasuda said that this technique had never been used in an anime before Grave of the Fireflies, \"and it was done on a challenge\". Yasuda explained that brown is more difficult to use than black because it does not contrast as well as black.\r\nGrave of the Fireflies was Takahata's first animated film produced with Studio Ghibli.\r\nTakahata insisted on working with well known animators Yoshifumi Kondō who was working for Nippon Animation at the time and Yoshiyuki Momose. Both animators played a pivotal role in creating fluid, realistic animations of the characters in the animation.\r\nTakahata drew from his personal experience to create a realistic depiction of the air raid on Okayama. In an interview, he criticized TV shows and movies that had recreated images of incendiary bombs, \"They include no sparks or explosions, I was there and I experienced it, so I know what it was like.\"\r\nThe location and background in the movie is based on a style created by 18th century Japanese artist Hiroshige and his follower Hergé, who created Tintin. Film critic Roger Ebert examines the contrast of the style of the background in comparison to the cartoonish animation of the characters. He claims that there is an unusual amount of detail in the evocative landscape, while the characters are a take on the modern Japanese animation with childlike bodies and enormous eyes. The depiction of Seita and Setsuko have Ebert believe that this deliberate animation style embodies the true purpose of animation, which is to recreate the raw emotion of human life by simplifying reality to emphasize ideas. He concludes his analysis with saying, \"Yes, it's a cartoon, and the kids have eyes like saucers, but it belongs on any list of the greatest war films ever made.\" According to Wendy Goldberg, Takahata's film also includes criticism of the emphasis on nationalism in Japan. In a particular scene, Seita's desire to join his father reflects a \"national fantasy of war,\" which leads him to neglect his sister.\r\nMusic\r\nThe film score was composed by Michio Mamiya. Along with the original soundtrack, the song \"Home Sweet Home\", performed by coloratura soprano Amelita Galli-Curci, was included. Dialogue of the film is part of the soundtrack, the music and dialogue are not separated in any way. Mamiya is also a music specialist in baroque and classical music.\r\nDuring an interview about his music, Mamiya stated that he creates his music to encourage peace. The songs in Grave of the Fireflies as well as other pieces by Michio Mamiya such as Serenade No.3 \"Germ\", express this theme.\r\nThemes and analysis\r\nIn his book about the film, Alex Dudok de Wit called Grave of the Fireflies an \"unusually personal adaptation\" of Nosaka's short story as Takahata had similar experiences during the war, though noted it deviated significantly in its portrayal of the children as ghosts in its opening sequence whereas the short story began immediately with the children losing their mother during the air raid.\r\nSome critics in the West have viewed Grave of the Fireflies as an anti-war film due to the graphic and emotional depiction of the pernicious repercussions of war on a society, and the individuals therein. The film focuses its attention almost entirely on the personal tragedies that war gives rise to, rather than seeking to glamorize it as a heroic struggle between competing nations. It emphasizes that war is society's failure to perform its most important duty: to protect its own people.\r\nHowever, Takahata repeatedly denied that the film was an anti-war film. In his own words, it \"is not at all an anti-war anime and contains absolutely no such message\". Instead, Takahata had intended to convey an image of the brother and sister living a failed life due to isolation from society and invoke sympathy particularly in people in their teens and twenties.\r\nSince the film gives little context to the war, Takahata feared a politician could just as easily claim fighting is needed to avoid such tragedies. In general, he was skeptical that depictions of suffering in similar works, such as Barefoot Gen, actually prevent aggression. The director was nevertheless an anti-war advocate, a staunch supporter of Article 9 of the Japanese Constitution, and has openly criticized Japan's penchant for conformity, allowing them to be rallied against other nations. He expressed despair and anxiety whenever the youth are told to fall in line, a reminder that the country at its core has not changed.\r\nDespite the public's emotional reaction, Takahata expressed that the purpose of the movie was not to be a tragedy or make people cry. Moreover, he regretted depicting Seita as a boy from that era because he wanted him to come off as a contemporary boy who acted like he had time-traveled to the period. He didn't intend for it to be retrospective or nostalgic. He wanted the Japanese audience to be weary of Seita's behavior. Furthermore, he says that his decision to show the audience that Seita and Setsuko have passed away at the beginning of the movie is to protect the audience from heartbreak, \"If an audience knows at the beginning of the film that the two will eventually die, they are more prepared to watch the film in the first place. I try to lessen an audience's pain by revealing everything at the beginning.\"\r\nThe fireflies in the film are portrayed as symbols of various themes such as the spirits of the lost children, the fires that burned the towns, Japanese soldiers, the machinery of war, and the regeneration of life through nature.Okypo Moon states in her essay \"Marketing Nature in Rural Japan\", that hundreds of fireflies were caught nightly in the 1920s and 1930s. In the 1960s and 1970s, there was a shift to reinstate this tradition and \"there are now eighty five 'firefly villages' (hotaru no sato) registered at the Ministry of the Environment in Japan. The movie uses fireflies to visually represent both deadly and beautiful imagery, such as fire-bombs and kamikazes. Takahata chooses to use the kanji \"fire\" instead of the normal character for the word firefly in the title, which has been interpreted to represent the widespread burning of wooden houses in Japan. Critic Dennis H. Fukushima, Jr. believes that this modification of the title is to emphasize parallels between beauty and devastation, citing the relationship between fireflies, M-69 incendiary bombs, naval vessels, city lights, and human spirits.\r\nIn the book, \"Imag(in)ing the war in Japan representing and responding to trauma in postwar literature and film,\" David Stahl and Mark Williams commend the film for not emphasizing Japanese victimhood to avoid responsibility for atrocities of the war they played a role in. They interpret that Seita's character embodies working towards healing historical trauma and victimization, because it is his nationalistic pride and selfishness which ultimately contributed to his sister's death.\r\nRelease\r\nTheatrical\r\nThe film was released on 16 April 1988, over 20 years from the publication of the short story.\r\nThe initial Japanese theatrical release was accompanied by Hayao Miyazaki's light-hearted My Neighbor Totoro as a double feature. While the two films were marketed toward children and their parents, the starkly tragic nature of Grave of the Fireflies turned away many audiences. However, Totoro merchandise, particularly the stuffed animals of Totoro and Catbus, sold extremely well after the film and made overall profits for the company to the extent that it stabilized subsequent productions of Studio Ghibli.\r\nGrave of the Fireflies is the only theatrical Studio Ghibli feature film prior to From Up on Poppy Hill to which Disney never had North American distribution rights, since it was not produced by Ghibli for parent company Tokuma Shoten but for Shinchosha, the publisher of the original short story (although Disney has the Japanese home video distribution rights themselves, thus replacing the film's original Japanese home video distributor, Bandai Visual). It was one of the last Studio Ghibli films to get an English-language premiere by GKIDS.\r\nHome media\r\nGrave of the Fireflies was released in Japan on VHS by Buena Vista Home Entertainment under the Ghibli ga Ippai Collection on 7 August 1998. On 29 July 2005, a DVD release was distributed through Warner Home Video. Walt Disney Studios Japan released the complete collector's edition DVD on 6 August 2008. WDSJ released the film on Blu-ray twice on 18 July 2012: one as a single release, and one in a two-film set with My Neighbor Totoro (even though Disney has never owned the North American rights, only the Japanese rights).\r\nIt was released on VHS in North America by Central Park Media in a subtitled form on 2 June 1993. They later released the film with an English dub on VHS on 1 September 1998 (the day Disney released Kiki's Delivery Service) and an all-Regions DVD (which also included the original Japanese with English subtitles) on 7 October 1998. On 8 October 2002, it was later released on a two-disc DVD set, which once again included both the English dub and the original Japanese with English subtitles as well as the film's storyboards with the second disc containing a retrospective on the author of the original book, an interview with the director, and an interview with critic Roger Ebert, who felt the film was one of the greatest of all time. It was released by Central Park Media one last time on 7 December 2004. Following the May 2009 bankruptcy and liquidation of Central Park Media, ADV Films acquired the rights and re-released it on DVD on 7 July 2009. Following the 1 September 2009 shutdown and re-branding of ADV, their successor, Sentai Filmworks, rescued the film and released a remastered DVD on 6 March 2012, and planned to release the film on digital outlets. A Blu-ray edition was released on 20 November 2012, featuring an all-new English dub produced by Seraphim Digital.\r\nStudioCanal released a Blu-ray in the United Kingdom on 1 July 2013, followed by Kiki's Delivery Service on the same format. It was the UK's tenth annual best-selling foreign language film on home video in 2019 (below seven other Japanese films, including six Hayao Miyazaki anime films). Madman Entertainment released the film in Australia and New Zealand.\r\nReception\r\nThe film was modestly successful at the Japanese box office, where it grossed ¥1.7 billion. As part of the Studio Ghibli Fest 2018, the film had a limited theatrical release in the United States, grossing $516,962.\r\nThe Ghibli ga Ippai Collection home video release of Grave of the Fireflies sold 400,000 copies in Japan. At a price of at least ¥4,935, this is equivalent to at least ¥1.974 billion in sales revenue.\r\nThe film received universal critical acclaim. Roger Ebert of the Chicago Sun-Times considered it to be one of the best and most powerful war films and, in 2000, included it on his list of great films. The film review aggregator website Rotten Tomatoes reported a 100% approval rating based on 43 reviews with an average rating of 9.30/10. The website's critical consensus reads: \"An achingly sad anti-war film, Grave of the Fireflies is one of Studio Ghibli's most profoundly beautiful, haunting works.\" Metacritic assigned the film a score of 94 out of 100 based on 16 reviews, indicating \"universal acclaim\".\r\nFilmmaker Akira Kurosawa praised the film and considered it his favourite Ghibli production. He wrote a letter of praise to Hayao Miyazaki, mistakenly believing he directed Grave of the Fireflies. Miyazaki himself praised the film as Takahata's masterpiece, but criticized Seita for not behaving how he believes the son of a navy lieutenant should behave.\r\nThe film ranked number 12 on Total Film's 50 greatest animated films. It was also ranked at number 10 in Time Out's \"The 50 greatest World War II movies\" list. Empire magazine ranked the film at number 6 in its list of \"The Top 10 Depressing Movies\". The film ranked number 19 on Wizard's Anime Magazine on their \"Top 50 Anime released in North America\". The Daily Star, ranking the film 4th on its list of greatest short story adaptations, wrote that \"There is both much and little to say about the film. It is simply an experience—a trip through the lonely boroughs of humanity that the world collectively looked, and still looks, away from\". Theron Martin of Anime News Network said that, in terms of the original U.S. Manga Corps dub, while the other voices were \"perfectly acceptable\", \"Setsuko just doesn't sound quite convincing as a four-year-old in English. That, unfortunately, is a big negative, since a good chunk of the pathos the movie delivers is at least partly dependent on that performance\".\r\nOn 25 December 2016, Toei Company made a Twitter post that read \"Why did Kiriya have to die so soon?\" (なんできりやすぐ死んでしまうん, Nande Kiriya sugu shinde shimaun?) in order to promote an episode of Kamen Rider Ex-Aid. The hashtag became popular, but Toei deleted the tweet after receiving complaints that referencing the Grave of the Fireflies line \"Why do fireflies die so soon?\" (なんで蛍すぐ死んでしまうん, Nande hotaru sugu shinde shimaun) was in poor taste. Before that, the ranking website Goo's readers voted the film's ending the number 1 most miserable of all anime films.\r\nIn June 2018, USA Today ranked 1st on the 100 best animated movies of all time.\r\nWell-known film director and critic Haruo Mizuno reviewed the Grave of Fireflies during his popular TV series. He praised the film for the honorary image of the soldiers of Japan through the depiction of the fireflies, and the moving depiction of a heartbreaking experience many people of Japan had lived through.\r\nAfter seeing the reactions of the audience after a screening of Le tombeau des lucioles at Festival « Pour éveiller les regards », Jean-Jacques Varret, head of Les Films du Paradoxe, knew he had to distribute the movie in France. It was released in two Parisian arthouses and the reaction was modest. Following the release however, Les Films du Paradoxe chose to release the movie on video cassettes and on the streaming service Canal+.\r\nPublic reactions\r\nAfter the international release, it has been noted that different audiences have interpreted the film differently due to differences in culture. For instance, when the film was watched by a Japanese audience, Seita's decision to not come back to his aunt was seen as an understandable decision, as they were able to understand how Seita had been raised to value pride in himself and his country. But American and Australian audiences were more likely to perceive the decision as unwise, due to the cultural differences in order to try to save his sister and himself.\r\nAccolades\r\nDerivative works\r\nPlanned follow-up\r\nFollowing the success of Grave of the Fireflies, Takahata drew up an outline for a follow-up film, based on similar themes but set in 1939 at the start of the second World War. This film was called Border 1939, based on the novel The Border by Shin Shikata, and would have told the story of a Japanese teenager from colonial Seoul joining an anti-Japanese resistance group in Mongolia. The film was intended as an indictment of Japanese imperialist sentiment, which is briefly touched upon in Grave of the Fireflies. Although Takahata finished a full outline (which is republished in his book Thoughts While Making Movies), the film was canceled before production could start due to the 1989 Tiananmen Square protests. Public opinion in Japan had turned against China, and Ghibli's distributor felt a film partly set there was too risky.\r\n2005 live-action version\r\nNTV in Japan produced a live-action TV drama of Grave of the Fireflies, in commemoration of the 60th anniversary of the end of World War II. The drama aired on 1 November 2005. Like the anime, the live-action version of Grave of the Fireflies focuses on two siblings struggling to survive the final months of the war in Kobe, Japan. Unlike the animated version, it tells the story from the point of view of their cousin (the aunt's daughter) and deals with the issue of how the war-time environment could change a kind lady into a hard-hearted woman. It stars Nanako Matsushima as the aunt, as well as Mao Inoue as their cousin.\r\n2008 live-action version\r\nA different live-action version was released in Japan on 5 July 2008, Reo Yoshitake as Seita, Rina Hatakeyama as Setsuko, Keiko Matsuzaka as the aunt, and Seiko Matsuda as the children's mother. Like the anime, this live-action version of Grave of the Fireflies focuses on two siblings struggling to survive the final months of the war in Kobe, Japan.",
    "html": "<p>Grave of the Fireflies (Japanese: 火垂るの墓, Hepburn: Hotaru no Haka) is a 1988 Japanese animated war tragedy film based on a 1967 short story by Akiyuki Nosaka. It was written and directed by Isao Takahata, and animated by Studio Ghibli for Shinchosha Publishing.</p><p>The film stars Tsutomu Tatsumi, Ayano Shiraishi, Yoshiko Shinohara and Akemi Yamaguchi. Set in the city of Kobe, Japan in June 1945, it tells the story of two siblings and war orphans, Seita and Setsuko, and their desperate struggle to survive during the final months of the Second World War. Universally acclaimed, Grave of the Fireflies has been ranked as one of the greatest war films of all time and is recognized as a major work of Japanese animation.</p><br/><h3>Plot</h3><p>In Kobe, the spirits of young war orphans Seita and Setsuko Yokokawa reunite and board a ghostly train as they recount how they survived the Bombing of Kobe in World War II.</p><p>In June 1945, a group of American Boeing B-29 Superfortress bombers destroy most of Kobe. Though Seita and Setsuko survive the bombing, their mother is severely injured and later dies. Seita conceals their mother's death from Setsuko in an attempt to keep her happy, which she later learns of despite Seita's efforts. Seita and Setsuko move in with a distant aunt, and Seita retrieves supplies he buried before the bombing and gives everything to his aunt, save for a tin of Sakuma drops. The aunt convinces Seita to sell his mother's silk kimono for rice as rations shrink and the number of refugees in the house grows. Seita uses some of his mother's money in the bank to buy supplies, but eventually, the aunt becomes resentful of the children, deeming them unworthy of earning her food.</p><p>Seita and Setsuko leave their aunt's home after excessive insults, and they move into an abandoned bomb shelter. They release fireflies into the shelter for light. The next day, Setsuko is horrified to find that the insects have died. She buries them in a grave, asking why they and her mother had to die. As they run out of rice, Seita steals from farmers and loots homes during air raids, for which he is beaten and sent to the police by a farmer. The officer realizes Seita is stealing due to hunger and releases him. When Setsuko falls ill, a doctor explains that she is suffering from malnutrition. Desperate, Seita withdraws the last of the money in their mother's bank account. After doing so, he becomes distraught when he learns that Japan has surrendered, and that his father, an Imperial Japanese Navy captain, is most likely dead, as most of Japan's navy has been sunk. Seita returns to Setsuko with food, but finds her dying. She later dies as Seita finishes preparing the food. Seita cremates Setsuko's body and her stuffed doll in a straw casket. He carries her ashes in the candy tin along with his father's photograph.</p><p>That September, Seita dies of starvation at a Sannomiya train station surrounded by other malnourished people, as shown in medias res. A janitor is tasked with removing the bodies before the arrival of the Americans. The janitor sorts through Seita's possessions and finds the candy tin, which he throws into a field. Setsuko's ashes spread out, and her spirit springs from the tin and is joined by Seita's spirit and a cloud of fireflies. They board a ghostly train and, throughout the journey, look back at the events leading to Seita's death. Their spirits later arrive at their destination, healthy and happy. Surrounded by fireflies, they rest on a hilltop bench overlooking present-day Kobe.</p><br/><h3>Voice cast</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th rowspan=\"2\">Character</th><th rowspan=\"2\">Japanese voice actor</th><th colspan=\"2\">English voice actor</th></tr><tr><th><small>Skypilot Entertainment/<span>CPM</span> (1998)</small></th><th><small><span>Toho</span>/<span class=\"mw-redirect\">Seraphim</span>/<span>Sentai</span> (2012)</small></th></tr><tr><th>Seita Yokokawa<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">横川 清太</span></span>)</span></th><td><span class=\"new\">Tsutomu Tatsumi</span><span class=\"noprint\" style=\"font-size:85%; font-style: normal;\"> </span></td><td><span>J. Robert Spencer</span></td><td><span>Adam Gibbs</span></td></tr><tr><th>Setsuko Yokokawa<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">横川 節子</span></span>)</span></th><td><span class=\"new\">Ayano Shiraishi</span><span class=\"noprint\" style=\"font-size:85%; font-style: normal;\"> </span></td><td><span>Corinne Orr</span></td><td><span>Emily Neves</span></td></tr><tr><th>Mrs. Yokokawa<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">横川 さん</span></span>)</span></th><td><span class=\"new\">Yoshiko Shinohara</span><span class=\"noprint\" style=\"font-size:85%; font-style: normal;\"> </span></td><td><span>Veronica Taylor</span></td><td><span>Shelley Calene-Black</span></td></tr><tr><th>Seita and Setsuko's aunt</th><td><span class=\"new\">Akemi Yamaguchi</span><span class=\"noprint\" style=\"font-size:85%; font-style: normal;\"> </span></td><td>Amy Jones</td><td>Marcy Bannor</td></tr><tr><th>Seita and Setsuko's cousin</th><td>Kazumi Nozaki</td><td><span>Shannon Conley</span></td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">Unknown</td></tr><tr><th>Doctor</th><td>Hiroshi Kawaguchi</td><td><span>Dan Green</span></td><td><span>David Wald</span></td></tr></tbody></table><br/><h3>Production</h3><h4>Development</h4><p>Grave of the Fireflies author Akiyuki Nosaka said that many offers had been made to make a live-action film adaptation of his short story. Nosaka argued that \"it was impossible to create the barren, scorched earth that's to be the backdrop of the story\". He also argued that contemporary children would not be able to convincingly play the characters. Nosaka expressed surprise when an animated version was offered. After seeing the storyboards, Nosaka concluded that it was not possible for such a story to have been made in any method other than animation and expressed surprise in how accurately the rice paddies and townscape were depicted.</p><p>Isao Takahata said that he was compelled to film the short story after seeing how the main character, Seita, \"was a unique wartime ninth grader\". Takahata explained that any wartime story, whether animated or not animated, \"tends to be moving and tear-jerking\", and that young people develop an \"inferiority complex\" where they perceive people in wartime eras as being more noble and more able than they are, and therefore the audience believes that the story has nothing to do with them. Takahata argued that he wanted to dispel this mindset. When Nosaka asked if the film characters were \"having fun\", Takahata answered that he clearly depicted Seita and Setsuko had \"substantial\" days and that they were \"enjoying their days\". Takahata said that Setsuko was even more difficult to animate than Seita, and that he had never before depicted a girl younger than five. Takahata said that \"In that respect, when you make the book into a movie, Setsuko becomes a tangible person\", and that four-year-olds often become more assertive and self-centered, and try to get their own ways during that age. He explained that while one could \"have a scene where Seita can't stand that anymore\", it is \"difficult to incorporate into a story\". Takahata explained that the film is from Seita's point of view, \"and even objective passages are filtered through his feelings\".</p><p>Takahata said that he had considered using non-traditional animation methods, but because \"the schedule was planned and the movie's release date set, and the staff assembled, it was apparent there was no room for such a trial-and-error approach\". He further remarked that he had difficulty animating the scenery since, in Japanese animation, one is \"not allowed\" to depict Japan in a realistic manner. Animators often traveled to foreign countries to do research on how to depict them, but such research had not been done before for a Japanese setting. While animating the movie, Takahata also created several different cuts of the scene in which Seita cremates Setsuko's body. Takahata spent a lot of time on this scene, trying to create the perfect iteration of it. Each of these cuts remained unfinished and unused in the end.</p><p>Most of the illustration outlines in the film are in brown, instead of the customary black. Black outlines were only used when it was absolutely necessary. Color coordinator Michiyo Yasuda said this was done to give the film a softer feel. Yasuda said that this technique had never been used in an anime before Grave of the Fireflies, \"and it was done on a challenge\". Yasuda explained that brown is more difficult to use than black because it does not contrast as well as black.</p><p>Grave of the Fireflies was Takahata's first animated film produced with Studio Ghibli.</p><p>Takahata insisted on working with well known animators Yoshifumi Kondō who was working for Nippon Animation at the time and Yoshiyuki Momose. Both animators played a pivotal role in creating fluid, realistic animations of the characters in the animation.</p><p>Takahata drew from his personal experience to create a realistic depiction of the air raid on Okayama. In an interview, he criticized TV shows and movies that had recreated images of incendiary bombs, \"They include no sparks or explosions, I was there and I experienced it, so I know what it was like.\"</p><p>The location and background in the movie is based on a style created by 18th century Japanese artist Hiroshige and his follower Hergé, who created Tintin. Film critic Roger Ebert examines the contrast of the style of the background in comparison to the cartoonish animation of the characters. He claims that there is an unusual amount of detail in the evocative landscape, while the characters are a take on the modern Japanese animation with childlike bodies and enormous eyes. The depiction of Seita and Setsuko have Ebert believe that this deliberate animation style embodies the true purpose of animation, which is to recreate the raw emotion of human life by simplifying reality to emphasize ideas. He concludes his analysis with saying, \"Yes, it's a cartoon, and the kids have eyes like saucers, but it belongs on any list of the greatest war films ever made.\" According to Wendy Goldberg, Takahata's film also includes criticism of the emphasis on nationalism in Japan. In a particular scene, Seita's desire to join his father reflects a \"national fantasy of war,\" which leads him to neglect his sister.</p><h4>Music</h4><p>The film score was composed by Michio Mamiya. Along with the original soundtrack, the song \"Home Sweet Home\", performed by coloratura soprano Amelita Galli-Curci, was included. Dialogue of the film is part of the soundtrack, the music and dialogue are not separated in any way. Mamiya is also a music specialist in baroque and classical music.</p><p>During an interview about his music, Mamiya stated that he creates his music to encourage peace. The songs in Grave of the Fireflies as well as other pieces by Michio Mamiya such as Serenade No.3 \"Germ\", express this theme.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Original soundtrack</caption><tbody><tr><th>No.</th><th>Title</th><th>Length</th><th>No.</th><th>Title</th><th>Length</th><th>No.</th><th>Title</th><th>Length</th></tr><tr><td>1</td><td>節子と清太~メインタイトル<p>(Setsuko and Seita - Main Title)</p></td><td>2:57</td><td>7</td><td>波打際<p>(The Beach)</p></td><td>1:37</td><td>13</td><td>ほたる<p>(Fireflies)</p></td><td>4:12</td></tr><tr><td>2</td><td>焼野原<p>(The Burnt-out Area)</p></td><td>6:51</td><td>8</td><td>日傘<p>(The Parasol)</p></td><td>2:26</td><td>14</td><td>ほたるの墓<p>(Grave of the Fireflies)</p></td><td>1:46</td></tr><tr><td>3</td><td>母の死<p>(Mother's Death)</p></td><td>6:34</td><td>9</td><td>桜の下<p>(Under the Cherry Blossoms)</p></td><td>1:31</td><td>15</td><td>夕焼け<p>(Sunset Colors)</p></td><td>0:53</td></tr><tr><td>4</td><td>初夏<p>(Early Summer)</p></td><td>3:14</td><td>10</td><td>ドロップス<p>(Drops)</p></td><td>2:13</td><td>16</td><td>修羅<p>(Scene of Carnage)</p></td><td>3:08</td></tr><tr><td>5</td><td>池のほとり<p>(At the Shore of the Pond)</p></td><td>2:21</td><td>11</td><td>引越し<p>(Moving)</p></td><td>2:17</td><td>17</td><td>悲歌<p>(Elegy / Song of Sorrow)</p></td><td>3:12</td></tr><tr><td>6</td><td>海へ<p>(To the Ocean)</p></td><td>1:37</td><td>12</td><td>兄妹<p>(Older Brother, Younger Sister)</p></td><td>2:15</td><td>18</td><td>ふたり~エンドタイトル<p></p></td><td>8:52</td></tr></tbody></table><br/><h3>Themes and analysis</h3><p>In his book about the film, Alex Dudok de Wit called Grave of the Fireflies an \"unusually personal adaptation\" of Nosaka's short story as Takahata had similar experiences during the war, though noted it deviated significantly in its portrayal of the children as ghosts in its opening sequence whereas the short story began immediately with the children losing their mother during the air raid.</p><p>Some critics in the West have viewed Grave of the Fireflies as an anti-war film due to the graphic and emotional depiction of the pernicious repercussions of war on a society, and the individuals therein. The film focuses its attention almost entirely on the personal tragedies that war gives rise to, rather than seeking to glamorize it as a heroic struggle between competing nations. It emphasizes that war is society's failure to perform its most important duty: to protect its own people.</p><p>However, Takahata repeatedly denied that the film was an anti-war film. In his own words, it \"is not at all an anti-war anime and contains absolutely no such message\". Instead, Takahata had intended to convey an image of the brother and sister living a failed life due to isolation from society and invoke sympathy particularly in people in their teens and twenties.</p><p>Since the film gives little context to the war, Takahata feared a politician could just as easily claim fighting is needed to avoid such tragedies. In general, he was skeptical that depictions of suffering in similar works, such as Barefoot Gen, actually prevent aggression. The director was nevertheless an anti-war advocate, a staunch supporter of Article 9 of the Japanese Constitution, and has openly criticized Japan's penchant for conformity, allowing them to be rallied against other nations. He expressed despair and anxiety whenever the youth are told to fall in line, a reminder that the country at its core has not changed.</p><p>Despite the public's emotional reaction, Takahata expressed that the purpose of the movie was not to be a tragedy or make people cry. Moreover, he regretted depicting Seita as a boy from that era because he wanted him to come off as a contemporary boy who acted like he had time-traveled to the period. He didn't intend for it to be retrospective or nostalgic. He wanted the Japanese audience to be weary of Seita's behavior. Furthermore, he says that his decision to show the audience that Seita and Setsuko have passed away at the beginning of the movie is to protect the audience from heartbreak, \"If an audience knows at the beginning of the film that the two will eventually die, they are more prepared to watch the film in the first place. I try to lessen an audience's pain by revealing everything at the beginning.\"</p><p>The fireflies in the film are portrayed as symbols of various themes such as the spirits of the lost children, the fires that burned the towns, Japanese soldiers, the machinery of war, and the regeneration of life through nature.Okypo Moon states in her essay \"Marketing Nature in Rural Japan\", that hundreds of fireflies were caught nightly in the 1920s and 1930s. In the 1960s and 1970s, there was a shift to reinstate this tradition and \"there are now eighty five 'firefly villages' (hotaru no sato) registered at the Ministry of the Environment in Japan. The movie uses fireflies to visually represent both deadly and beautiful imagery, such as fire-bombs and kamikazes. Takahata chooses to use the kanji \"fire\" instead of the normal character for the word firefly in the title, which has been interpreted to represent the widespread burning of wooden houses in Japan. Critic Dennis H. Fukushima, Jr. believes that this modification of the title is to emphasize parallels between beauty and devastation, citing the relationship between fireflies, M-69 incendiary bombs, naval vessels, city lights, and human spirits.</p><p>In the book, \"Imag(in)ing the war in Japan representing and responding to trauma in postwar literature and film,\" David Stahl and Mark Williams commend the film for not emphasizing Japanese victimhood to avoid responsibility for atrocities of the war they played a role in. They interpret that Seita's character embodies working towards healing historical trauma and victimization, because it is his nationalistic pride and selfishness which ultimately contributed to his sister's death.</p><br/><h3>Release</h3><h4>Theatrical</h4><p>The film was released on 16 April 1988, over 20 years from the publication of the short story.</p><p>The initial Japanese theatrical release was accompanied by Hayao Miyazaki's light-hearted My Neighbor Totoro as a double feature. While the two films were marketed toward children and their parents, the starkly tragic nature of Grave of the Fireflies turned away many audiences. However, Totoro merchandise, particularly the stuffed animals of Totoro and Catbus, sold extremely well after the film and made overall profits for the company to the extent that it stabilized subsequent productions of Studio Ghibli.</p><p>Grave of the Fireflies is the only theatrical Studio Ghibli feature film prior to From Up on Poppy Hill to which Disney never had North American distribution rights, since it was not produced by Ghibli for parent company Tokuma Shoten but for Shinchosha, the publisher of the original short story (although Disney has the Japanese home video distribution rights themselves, thus replacing the film's original Japanese home video distributor, Bandai Visual). It was one of the last Studio Ghibli films to get an English-language premiere by GKIDS.</p><h4>Home media</h4><p>Grave of the Fireflies was released in Japan on VHS by Buena Vista Home Entertainment under the Ghibli ga Ippai Collection on 7 August 1998. On 29 July 2005, a DVD release was distributed through Warner Home Video. Walt Disney Studios Japan released the complete collector's edition DVD on 6 August 2008. WDSJ released the film on Blu-ray twice on 18 July 2012: one as a single release, and one in a two-film set with My Neighbor Totoro (even though Disney has never owned the North American rights, only the Japanese rights).</p><p>It was released on VHS in North America by Central Park Media in a subtitled form on 2 June 1993. They later released the film with an English dub on VHS on 1 September 1998 (the day Disney released Kiki's Delivery Service) and an all-Regions DVD (which also included the original Japanese with English subtitles) on 7 October 1998. On 8 October 2002, it was later released on a two-disc DVD set, which once again included both the English dub and the original Japanese with English subtitles as well as the film's storyboards with the second disc containing a retrospective on the author of the original book, an interview with the director, and an interview with critic Roger Ebert, who felt the film was one of the greatest of all time. It was released by Central Park Media one last time on 7 December 2004. Following the May 2009 bankruptcy and liquidation of Central Park Media, ADV Films acquired the rights and re-released it on DVD on 7 July 2009. Following the 1 September 2009 shutdown and re-branding of ADV, their successor, Sentai Filmworks, rescued the film and released a remastered DVD on 6 March 2012, and planned to release the film on digital outlets. A Blu-ray edition was released on 20 November 2012, featuring an all-new English dub produced by Seraphim Digital.</p><p>StudioCanal released a Blu-ray in the United Kingdom on 1 July 2013, followed by Kiki's Delivery Service on the same format. It was the UK's tenth annual best-selling foreign language film on home video in 2019 (below seven other Japanese films, including six Hayao Miyazaki anime films). Madman Entertainment released the film in Australia and New Zealand.</p><br/><h3>Reception</h3><p>The film was modestly successful at the Japanese box office, where it grossed ¥1.7 billion. As part of the Studio Ghibli Fest 2018, the film had a limited theatrical release in the United States, grossing $516,962.</p><p>The Ghibli ga Ippai Collection home video release of Grave of the Fireflies sold 400,000 copies in Japan. At a price of at least ¥4,935, this is equivalent to at least ¥1.974 billion in sales revenue.</p><p>The film received universal critical acclaim. Roger Ebert of the Chicago Sun-Times considered it to be one of the best and most powerful war films and, in 2000, included it on his list of great films. The film review aggregator website Rotten Tomatoes reported a 100% approval rating based on 43 reviews with an average rating of 9.30/10. The website's critical consensus reads: \"An achingly sad anti-war film, Grave of the Fireflies is one of Studio Ghibli's most profoundly beautiful, haunting works.\" Metacritic assigned the film a score of 94 out of 100 based on 16 reviews, indicating \"universal acclaim\".</p><p>Filmmaker Akira Kurosawa praised the film and considered it his favourite Ghibli production. He wrote a letter of praise to Hayao Miyazaki, mistakenly believing he directed Grave of the Fireflies. Miyazaki himself praised the film as Takahata's masterpiece, but criticized Seita for not behaving how he believes the son of a navy lieutenant should behave.</p><p>The film ranked number 12 on Total Film's 50 greatest animated films. It was also ranked at number 10 in Time Out's \"The 50 greatest World War II movies\" list. Empire magazine ranked the film at number 6 in its list of \"The Top 10 Depressing Movies\". The film ranked number 19 on Wizard's Anime Magazine on their \"Top 50 Anime released in North America\". The Daily Star, ranking the film 4th on its list of greatest short story adaptations, wrote that \"There is both much and little to say about the film. It is simply an experience—a trip through the lonely boroughs of humanity that the world collectively looked, and still looks, away from\". Theron Martin of Anime News Network said that, in terms of the original U.S. Manga Corps dub, while the other voices were \"perfectly acceptable\", \"Setsuko just doesn't sound quite convincing as a four-year-old in English. That, unfortunately, is a big negative, since a good chunk of the pathos the movie delivers is at least partly dependent on that performance\".</p><p>On 25 December 2016, Toei Company made a Twitter post that read \"Why did Kiriya have to die so soon?\" (なんできりやすぐ死んでしまうん, Nande Kiriya sugu shinde shimaun?) in order to promote an episode of Kamen Rider Ex-Aid. The hashtag became popular, but Toei deleted the tweet after receiving complaints that referencing the Grave of the Fireflies line \"Why do fireflies die so soon?\" (なんで蛍すぐ死んでしまうん, Nande hotaru sugu shinde shimaun) was in poor taste. Before that, the ranking website Goo's readers voted the film's ending the number 1 most miserable of all anime films.</p><p>In June 2018, USA Today ranked 1st on the 100 best animated movies of all time.</p><p>Well-known film director and critic Haruo Mizuno reviewed the Grave of Fireflies during his popular TV series. He praised the film for the honorary image of the soldiers of Japan through the depiction of the fireflies, and the moving depiction of a heartbreaking experience many people of Japan had lived through.</p><p>After seeing the reactions of the audience after a screening of Le tombeau des lucioles at Festival « Pour éveiller les regards », Jean-Jacques Varret, head of Les Films du Paradoxe, knew he had to distribute the movie in France. It was released in two Parisian arthouses and the reaction was modest. Following the release however, Les Films du Paradoxe chose to release the movie on video cassettes and on the streaming service Canal+.</p><h4>Public reactions</h4><p>After the international release, it has been noted that different audiences have interpreted the film differently due to differences in culture. For instance, when the film was watched by a Japanese audience, Seita's decision to not come back to his aunt was seen as an understandable decision, as they were able to understand how Seita had been raised to value pride in himself and his country. But American and Australian audiences were more likely to perceive the decision as unwise, due to the cultural differences in order to try to save his sister and himself.</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Recipient</th><th>Result</th></tr><tr><td>1989</td><td><span>Blue Ribbon Awards</span></td><td><span class=\"mw-redirect\">Special Award</span></td><td rowspan=\"3\"><span>Isao Takahata</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\">1994</td><td rowspan=\"2\"><span>Chicago International Children's Film Festival</span></td><td>Animation Jury Award</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Rights of the Child Award</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><br/><h3>Derivative works</h3><h4>Planned follow-up</h4><p>Following the success of Grave of the Fireflies, Takahata drew up an outline for a follow-up film, based on similar themes but set in 1939 at the start of the second World War. This film was called Border 1939, based on the novel The Border by Shin Shikata, and would have told the story of a Japanese teenager from colonial Seoul joining an anti-Japanese resistance group in Mongolia. The film was intended as an indictment of Japanese imperialist sentiment, which is briefly touched upon in Grave of the Fireflies. Although Takahata finished a full outline (which is republished in his book Thoughts While Making Movies), the film was canceled before production could start due to the 1989 Tiananmen Square protests. Public opinion in Japan had turned against China, and Ghibli's distributor felt a film partly set there was too risky.</p><h4>2005 live-action version</h4><p>NTV in Japan produced a live-action TV drama of Grave of the Fireflies, in commemoration of the 60th anniversary of the end of World War II. The drama aired on 1 November 2005. Like the anime, the live-action version of Grave of the Fireflies focuses on two siblings struggling to survive the final months of the war in Kobe, Japan. Unlike the animated version, it tells the story from the point of view of their cousin (the aunt's daughter) and deals with the issue of how the war-time environment could change a kind lady into a hard-hearted woman. It stars Nanako Matsushima as the aunt, as well as Mao Inoue as their cousin.</p><h4>2008 live-action version</h4><p>A different live-action version was released in Japan on 5 July 2008, Reo Yoshitake as Seita, Rina Hatakeyama as Setsuko, Keiko Matsuzaka as the aunt, and Seiko Matsuda as the children's mother. Like the anime, this live-action version of Grave of the Fireflies focuses on two siblings struggling to survive the final months of the war in Kobe, Japan.</p><br/>"
  },
  "errorMessage": ""
}