{
  "imDbId": "tt0118849",
  "title": "Children of Heaven",
  "fullTitle": "Children of Heaven (1997)",
  "type": "Movie",
  "year": "1997",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/children-of-heaven-1999",
      "rate": "100",
      "content": "Children of Heaven is very nearly a perfect movie for children, and of course that means adults will like it, too."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Michael Wilmington",
      "link": "https://www.chicagotribune.com/news/ct-xpm-1999-02-05-9902050006-story.html",
      "rate": "100",
      "content": "Though Majidi draws from familiar Iranian sources, he's made something unique and moving: a sweet tale with a stirring finish."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "",
      "rate": "100",
      "content": "This modestly produced family drama has all the poignancy and humor associated with today's vibrant Iranian film industry."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2000/jul/07/culture.reviews",
      "rate": "100",
      "content": "This is a pellucid and gentle film, made with the simplicity and grace of a children's tale and yet its humour, emotional clarity and directness speak directly to adults and children alike - and the pre-teen principals shoulder an adult burden of performance."
    },
    {
      "publisher": "",
      "author": "The A.V. Club",
      "link": "https://www.avclub.com/children-of-heaven-1798197964",
      "rate": "90",
      "content": "Majidi masterfully balances the serious subtext with entertaining vignettes."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Lisa Alspector",
      "link": "",
      "rate": "80",
      "content": "One problem leads to another, but because the children's points of view are so powerfully rendered, the plot of this elegant and lightly magical-realist 1997 drama never seems merely coincidental."
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Marjorie Baumgarten",
      "link": "https://www.austinchronicle.com/events/film/1999-04-30/142865/",
      "rate": "78",
      "content": "The poverty that is at the heart of the situation is in prominent relief, yet there is a happiness about their lives that defies sheer gloss. Here is a brother and sister who truly love each other and are bonded by their complicity."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Peter Stack",
      "link": "https://www.sfgate.com/movies/article/Heavenly-Rewards-in-Children-Innocence-2948685.php",
      "rate": "75",
      "content": "Haunting in its charm, Children of Heaven opens a window on both contemporary Tehran and the hopeful heart of childhood. This lovely, amusing film deserves a big audience -- especially families. It touches on the innocence of children with tremendous affection."
    },
    {
      "publisher": "The New York Times",
      "author": "Janet Maslin",
      "link": "https://www.nytimes.com/1999/01/22/movies/film-review-for-a-pair-of-sneakers-longing-lies-and-a-plan.html",
      "rate": "50",
      "content": "In Children of Heaven, life is sweet despite countless hardships, and no reality beyond the economic intrudes upon a fairy tale atmosphere. Only through heavy-handed emphasis does the quest for new sneakers take on any greater meaning."
    },
    {
      "publisher": "Village Voice",
      "author": "Michael Atkinson",
      "link": "",
      "rate": "30",
      "content": "Clumsily staged (a bike accident any 15-year-old Super-8 maven could’ve cut better), lit like a soap opera, and acted with all the bribed relish of a peanut butter commercial, Majidi’s movie is merely the simplistic bid being made by every national industry impatient for mass audience attention. Gallingly, it may succeed."
    }
  ],
  "errorMessage": ""
}