{
  "imDbId": "tt0038650",
  "title": "It's a Wonderful Life",
  "fullTitle": "It's a Wonderful Life (1946)",
  "type": "Movie",
  "year": "1946",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/great-movie-its-a-wonderful-life-1946",
      "rate": "100",
      "content": "It's one of those ageless movies, like \"Casablanca\" or \"The Third Man,\" that improves with age. Some movies, even good ones, should only be seen once. When we know how they turn out, they've surrendered their mystery and appeal. Other movies can be viewed an indefinite number of times. Like great music, they improve with familiarity. It's a Wonderful Life falls in the second category."
    },
    {
      "publisher": "",
      "author": "The Hollywood Reporter",
      "link": "https://www.hollywoodreporter.com/news/general-news/a-wonderful-life-review-1946-movie-754681/",
      "rate": "100",
      "content": "This couldn't be other than a Capra picture, the humanness of its story the dominant factor at every turn of situation. His direction of the individual characterizations delivered is also distinctively his, and the performances, from the starring roles of James Stewart and Donna Reed down to the smallest bit, are magnificent. When Capra is at his best, no one can top him."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2007/dec/14/family.drama",
      "rate": "100",
      "content": "The film is gripping enough simply with the telling of George's lifestory. A genuine American classic."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/it-s-a-wonderful-life",
      "rate": "100",
      "content": "Whether you view this film in the middle of the summer or at Christmas, Capra's greatest film represents one of the most transcendent and joyful experiences any movie-lover can hope for."
    },
    {
      "publisher": "Empire",
      "author": "Ian Freer",
      "link": "https://www.empireonline.com/movies/reviews/wonderful-life-review/",
      "rate": "100",
      "content": "Although peppered with colourful, sharply drawn characters, this is Stewart's movie, instantly loveable as a small town dreamer who sacrifices everything for others. His journey to despair and back warms the cockles like little else. Enjoy it in a cinema so you can sob among others."
    },
    {
      "publisher": "The Telegraph",
      "author": "Marc Lee",
      "link": "https://www.telegraph.co.uk/films/",
      "rate": "90",
      "content": "The inspirational, thoroughly festive ending is guaranteed to bring tears to the eyes."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1946/film/reviews/it-s-a-wonderful-life-1200414860/",
      "rate": "90",
      "content": "Frank Capra and James Stewart, in returning to films after long years in uniform, endow the pic with its most telling contributions. Herewith, Stewart touches the thespic peak of his career. He hasn’t lost a whit of his erstwhile boyish personality (when called to turn it on) and further shows a maturity and depth he seems recently to have acquired."
    },
    {
      "publisher": "New York Daily News",
      "author": "Kate Cameron",
      "link": "https://www.nydailynews.com/entertainment/movies/wonderful-life-designed-lift-spirits-1946-review-article-1.2916205",
      "rate": "88",
      "content": "The film is too sprawling in extent, too noisy as to background music and voices and much too obvious in the application of its social significance notes. But while it isn’t the best picture to come out of Hollywood this year, nor is it Capra’s masterpiece, it tells a good story and its conclusion has a heart-warming effect on the audience."
    },
    {
      "publisher": "Slant Magazine",
      "author": "",
      "link": "",
      "rate": "75",
      "content": "Without overlooking It’s a Wonderful Life‘s lapses into populist bathos, it’s necessary to rescue the Frank Capra film from its status as an untouchable American “classic.”"
    },
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://www.nytimes.com/reviews/movies?res=9E00EFDE163DEE3BBC4B51DFB467838D659EDE",
      "rate": "70",
      "content": "Indeed, the weakness of this picture, from this reviewer's point of view, is the sentimentality of it—its illusory concept of life. Mr. Capra's nice people are charming, his small town is a quite beguiling place and his pattern for solving problems is most optimistic and facile. But somehow they all resemble theatrical attitudes rather than average realities. And Mr. Capra's \"turkey dinners\" philosophy, while emotionally gratifying, doesn't fill the hungry paunch."
    }
  ],
  "errorMessage": ""
}