{
  "imDbId": "tt0038650",
  "title": "It's a Wonderful Life",
  "fullTitle": "It's a Wonderful Life (1946)",
  "type": "Movie",
  "year": "1946",
  "items": [
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1247136",
      "warningSpoilers": false,
      "date": "25 December 2005",
      "rate": "10",
      "helpful": "272 out of 308 found this helpful.",
      "title": "\"To My Big Brother George, The Richest Man In Town\"",
      "content": "I've always thought that the reason It's A Wonderful Life has had such enduring popularity is that more than in any other film it shows what can be the value of a single individual and the contribution to the greater good they can make.George Bailey as portrayed by James Stewart is the kind of every man hero we can all identify with. He's got the every day problems to be sure, raising and providing for a family, but he's got bigger problems than that. Fate has made him the rallying point of opposition in his small town of Bedford Falls to the \"richest and meanest man in town\", embodied in Lionel Barrymore.It's a real David vs. Goliath battle. Barrymore seems to have unlimited resources at his disposal. Samuel S. Hinds as Peter Bailey put it so well to him in asking what are you doing all this for? Barrymore does have more money than he could ever possibly use. A little charity wouldn't hurt him.Remember the basic plot outline. A whole lot of people in Bedford Falls one post World War II Christmas Eve see that their friend George is toting a heavy load of mysterious origins. Their prayers reach the heavens where an angel is dispatched to aid.But before Henry Travers the angel arrives, he's given the story of George Bailey's life. And we see the kind of struggles he's had, the sacrifices he's made for the good of a whole lot of others. We've also seen a greedy and grasping Potter, grabbing everything that George Bailey cannot save. Something happens that day before Christmas through no fault of his own, Bailey is in big trouble. It's driven him to the brink of despair. That's why the angel is sent down. He shows him the alternate universe that would have been had he never existed. It's something each and every one of us should try to do, step outside ourselves see just what our contributions can be.But I think what Frank Capra is trying to say in this greatest of his films is that having done that and we realize we haven't contributed to the greater good of humankind, we resolve to do so. It's a simple, but profound lesson.What if Potter got the same opportunity? In a sense Charles Dickens did just that in A Christmas Carol. Would Lionel Barrymore change? It's an interesting point of speculation.In addition to those cast members already mentioned a whole group of players who worked with Capra before grace this film. Add to that some others and you have a perfectly cast feature picture.Donna Reed has an interesting part as well. Your choice of mate is real important in life. Had she not been as loving and supportive to George Bailey, he might very well have taken a different route in life. Mary Hatch Bailey became a signature part for her, more identified than her role in From Here to Eternity which got her an Oscar. It certainly was the basis for her TV series.When Todd Karns who plays Harry Bailey toasts his brother he's saying that the riches of the world are not necessarily things that can be quantified. Your life is not measured in material things, but in how you use the material things given you. And that universal lesson will be taught into eternity as long as It's A Wonderful Life is shown every year. Wouldst we all learn it."
    },
    {
      "username": "Coxer99",
      "userUrl": "https://www.imdb.com/user/ur0257957",
      "reviewLink": "https://www.imdb.com/review/rw0034395",
      "warningSpoilers": false,
      "date": "4 March 1999",
      "rate": "10",
      "helpful": "423 out of 477 found this helpful.",
      "title": "A Great Influence...",
      "content": "No movie ever made has influenced me more than this classic. I had the honor of doing a play version of it about 5 years ago. I had seen the film thousands of times, had loved it, but I never really knew what it meant. During the course of the production, I suddenly felt alive. I felt that I wasn't having enough fun. I felt that I wasn't doing enough in my life. Crazy things, like kissing my mother or my father. I hadn't really hugged one of them in a while. It makes you think. It's more of a thinking person's film than a mere Christmas film. If you think it's just a Christmas film, I insist you watch it again and again, until you get the message.Stewart gives the finest performance of his career, in one of the most difficult characters ever portrayed. A character all of us are familiar with...a person looking to find himself/herself. It's the great struggle for finding what it is in life you really want to do. George Bailey teaches us so lessons throughout the film and in the end he teaches us the most important lesson of all, that life, although a long and winding road, truly is (for lack of a better word) wonderful..."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2227530",
      "warningSpoilers": false,
      "date": "28 March 2010",
      "rate": "10",
      "helpful": "91 out of 105 found this helpful.",
      "title": "One of those quintessential Christmas movies....",
      "content": "It's a Wonderful Life is something truly special, and along with Scrooge, the original Miracle on 34th Street and Home Alones 1 and 2, it is something I watch every Christmas. Why? Because I love this movie, seriously I do. Looking through my 1000 or so reviews here, I couldn't believe I hadn't reviewed this movie; I have seen movies that I have loved and cherished since childhood and I have seen movies that belong at the bottom of the garbage. It's a Wonderful Life belongs to the former, although I am 17, I appreciate a good movie when I see one. This is more than a good movie, it's a timeless masterpiece, that holds up on repeated viewings and never loses its magic.It's a Wonderful Life could have easily been overly-sentimental and clichéd, but the quality of the direction and the screenplay that others have summed up perfectly assured it was a beautiful, heart-warming and somewhat poignant film. While there are some funny parts, not bursting-your-gut funny but funny in a subtle sort of way, other parts are close to heart-rending. The direction from Frank Capra is excellent, sensitive and nuanced, and Capra shows even more talent as a screenwriter having penned one of the most honest and touching scripts ever in a film. Casablanca, All About Eve and The Shawshank Redemption all had wonderful scripts, but the script here has a lot to say about community spirit and shows that this film is much more than feel-good sentimentality. There is the element of feel good here, no doubt about it, but it doesn't overpower what the film intends.Visually, It's a Wonderful Life is a wonder. I don't think it is dated at all, the cinematography is crisp, the black and white looks beautiful and the pristine Christmas scenery really does take me back. Some of my favourite ever memories was of Christmas, whether it was watching nostalgic Christmas videos, eating Christmas dinner or singing carols under the Christmas tree. Another thing I have to mention is that the movie is richly and beautifully scored, Dmitri Tiomkin's music here is absolutely gorgeous, lyrical, whimsical, nostalgic and most importantly it never felt intrusive in the more integral parts of the film. And I have to mention the story, never in my life(and I genuinely mean this) have I seen a movie where it communicates such a strong message and so well too. The story of a suicidal man who is shown the value of his life by his guardian angel is an effective, timeless one, imitated perhaps but never equalled.Finally the acting is wonderful. James Stewart, and I seriously don't give a damn whether he was a racist or not and neither should you, is absolutely superb as George Bailey, a truly complex character who goes through such a lot to get to where he is at the end of the movie. George Bailey is like Mr Deeds, John Doe and Mr Smith rolled into one, and in my opinion only James Stewart could have given justice to a character that has self-doubt gnawed at his essential decency. Also the character change, like that of Alistair Sim's Scrooge at the end of Scrooge, was heart-breakingly believable. Donna Reed is radiant and charming as his wife, who is like a caring lover, devoted wife and dedicated mother, while Thomas Mitchell gives one of his more memorable performances as Uncle Billy. Henry Travers is a revelation as Clarence the guardian angel, but there is another performance I think is worth of mention. For a good morality tale, you need a good villain. Well in the name of Potter, you have one. Who better to portray him than the great Lionel Barrymore acting at the peak of his powers? Overall, a timeless classic with a true and heart-rendingly poignant ending. 10/10, one of the easiest perfect scores I have made recently. Bethany Cox"
    },
    {
      "username": "FlickJunkie-2",
      "userUrl": "https://www.imdb.com/user/ur0556711",
      "reviewLink": "https://www.imdb.com/review/rw0034473",
      "warningSpoilers": false,
      "date": "6 December 2000",
      "rate": "10",
      "helpful": "275 out of 320 found this helpful.",
      "title": "A Wonderful Film and Timeless Classic",
      "content": "This film has become a Christmas tradition in my family. We watch it every year and never tire of it. Frank Capra is a master of creating films with a message that reinforce strong values. This is probably his greatest film in that regard. Both he and Stewart have publicly stated that this is their favorite film.The message in this film is one of courage and sacrifice for the greater good as George Bailey, a man with big ideas about seeing the world, continually forsakes his own desires to do what is right for the town. The second message is that each life important. No matter how insignificant we feel we are, we are all inextricably linked to each other and play an important part in the fabric of one another's lives.Capra's direction is brilliant. His genius is bringing human stories to life in a ways that not only make a point, but that totally involve the audience in the lives of the characters. He is always extremely optimistic about the human condition. He is known for testing his characters with overwhelming adversity to make them struggle to triumph in a way that causes the world to change and the character to grow. For this reason his films were always crowd pleasers and this film was the best of all in that regard.Led by Capra's understanding hand, the actors all did a magnificent job. Stewart's wide-eyed enthusiasm and boyish charm, coupled with an unbending strength of character made him the perfect folk hero. Donna Reed was lovely and charming and attained the right balance between being supportive and inspirational. The romantic chemistry between her and Stewart was subtle and charming. Lionel Barrymore was towering as the greedy old skinflint who was trying to take over the town. Thomas Mitchell plays one of my favorite characters, as the bumbling Uncle Billy in probably his most memorable role.This film is number eleven on AFI's list of best films of the century. It was nominated for five academy awards and won none. It was swept in 1947 by `The Best Years of Our Lives', a great film that won seven Oscars that year but in my opinion was the lesser film. History has corrected that minor injustice by rendering `It's a Wonderful Life' an enduring classic that is viewed and loved by generation after generation. Of course, I rated it a 10/10. I can't wait to see it again this Christmas."
    },
    {
      "username": "PyrolyticCarbon",
      "userUrl": "https://www.imdb.com/user/ur0270791",
      "reviewLink": "https://www.imdb.com/review/rw0034486",
      "warningSpoilers": false,
      "date": "13 September 2002",
      "rate": "10",
      "helpful": "205 out of 245 found this helpful.",
      "title": "A wonderful film that should be watched again and again.",
      "content": "This is one of the best films of all time, without a doubt. I challenge anyone to watch this film and not be touched, if you can, you have no heart!James Stewart is one of my favourite actors, and in this film he acts so naturally you even forget he's an actor playing a part, you really believe his story. You're pulled on a roller coaster of emotions throughout this film, and by no means is this a light hearted look at life, as many believe. This is not a rose tinted look at the wonderful life we have, this is a dark, downtrodden start to a film where the lead character is about to commit suicide.However, it is a beautiful film, and is one of the few that you can watch again and again and walk away with the same glowing feeling as you did when you first watched it."
    },
    {
      "username": "dweck",
      "userUrl": "https://www.imdb.com/user/ur0174106",
      "reviewLink": "https://www.imdb.com/review/rw0034456",
      "warningSpoilers": false,
      "date": "9 December 1998",
      "rate": "",
      "helpful": "428 out of 463 found this helpful.",
      "title": "Atop my Top Ten",
      "content": "I am a film lover from 'way back, having even served a stint as a newspaper movie critic. Entries in my personal list of Greatest Films of All Time include \"Fantasia,\" \"To Kill A Mockingbird,\" \"Casablanca,\" \"Singin' in the Rain,\" \"North by Northwest,\" and \"The Sound of Music. But sitting atop all of them, as undisputed champ, is \"It's a Wonderful Life.\"I have seen it hundreds of times (dating back to, oh, when I was a teenager I suppose, and our local PBS station ran it as part of a pledge drive). I drive my wife and family to distraction when we watch it together because I quote all the dialogue along with the actors.I cry every time--and this is after viewing upon viewing--when Harry Bailey toasts his big brother George as \"...the richest man in town.\" The emotions in that scene are so true and pure that I can't help but be affected by them.The performances are unparalleled. Stewart is brilliant as a small-town dreamer who loses and finds his way. His superlative acting abilities cause us to identify strongly with him (how many of us have lamented--even to ourselves--that no one seems to notice the sacrifices we've made?), which is, I think, why the movie bears up under so many repeat viewings. Reed is just lovely here, the epitome of sunny girlfriend, caring lover, devoted wife, dedicated mother.Capra's talent as a screenwriter are all over this script. He knows just how hard to tug the heartstrings without becoming overblown or phony. And his technical wizardry is evident too. I've never seen--before or since--more natural-looking onscreen snow.Watching IAWL has become a tonic, a pick-me-up when I really need one--whether it's the Christmas season or not. Its message--that each one of us is important and has *something* to contribute to the greater good--is one about which the world could use some reminding from time to time."
    },
    {
      "username": "Aidan McGuinness",
      "userUrl": "https://www.imdb.com/user/ur0839067",
      "reviewLink": "https://www.imdb.com/review/rw0034376",
      "warningSpoilers": false,
      "date": "11 February 2002",
      "rate": "9",
      "helpful": "177 out of 209 found this helpful.",
      "title": "Best feel good movie ever? Quite possibly.",
      "content": "Here's a new definition of cold-hearted: a man or woman who remains completely untouched by the 1946 Capra classic \"It's a Wonderful Life\". You can't not be moved by this wonderful little gem.The acting is all great. One of the film's greatest strengths for me is making George Bailey - the star of the movie played by James Stewart - a nice normal man. He's not perfect and that's pretty much essential to the film's success because Bailey could be *any* man. The lesson of the movie is fairly simple - we all have our role to play in the world and we are all important. Most movies would make this into a schmaltzy affair but Capra delivered a touching, heart warming tale. Bailey consistently denies himself to allow others to live as he sacrifices his life to make sure people can have enough money to avoid having to sell-their-soul in debt to the evil H. Potter (alas not a Harry Potter...). His complete and utter humility is great - he doesn't see how much he accomplished until his guardian angel Clarence shows him. Again Clarence isn't played in the usual clichéd manner but more as a believable character who honestly loves Bailey for his strengths.The movie is a success because you can't but want Bailey to succeed. The manner in which he does could be classified as corny but, because it's so deserved, that doesn't matter. The music, the set pieces, all the touches add to a wonderful movie and give you hope that life can indeed also be wonderful. A lovely mood-lifter. 8.8/10."
    },
    {
      "username": "JFHunt",
      "userUrl": "https://www.imdb.com/user/ur4157754",
      "reviewLink": "https://www.imdb.com/review/rw1584123",
      "warningSpoilers": false,
      "date": "27 January 2007",
      "rate": "10",
      "helpful": "717 out of 768 found this helpful.",
      "title": "Who are you, really?",
      "content": "Honestly, I don't think I've ever seen anything quite like It's A Wonderful Life. Does it take me back to that place in my heart, that makes me long for everything that once was great and it could be again? Does it remind me of my childhood, Christmas in my home? No. Maybe it's just simply what I always wanted from life and every man I want to be. Everything about this film is well for lack of better words, perfect. No question to it any longer, the best performance by an actor I have ever seen. It's more than just beautiful, timeless or fair. All of Stewart is revealed. Everything coming together for Capra. Lionel Barrymore at his best, which seems to be his worst. Sometimes I think there is a reason why somethings happen. And I'm pretty sure there is some magical reason why this film was made. I'm 27 years old and saw it for the first time Christmas Eve of this year. I've watched it 3 times since. The only movie to ever make me cry. I probably wouldn't have all the answers for you, if you asked me why. I'm still trying to figure Stewart out and just how beautiful was Reed.What can I say? This movie is a life changing experience. Makes me feel good to be alive. What a wonderful little world it is. And if I waited my entire life, it would not be a waste of time."
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6466782",
      "warningSpoilers": true,
      "date": "11 January 2021",
      "rate": "10",
      "helpful": "27 out of 30 found this helpful.",
      "title": "It's a Wonderful Life",
      "content": "One of the best family movies I have ever seen, the storyline is amazing and puts hope in your heart. When the movie is over, when you feel useless in life, watch the movie and your thinking will change and you will know that you have a positive impact on the lives of the people you know. The events of the film were fun. The characters of the film were good. Two characters were prepared, James and Clarence. They were very interesting characters and I really enjoyed watching them. The end of the film is one of the best movie endings in history. I recommend watching it especially the black and white version. The black version is better than the color version. It's a Wonderful Movie"
    },
    {
      "username": "brianlion",
      "userUrl": "https://www.imdb.com/user/ur3092046",
      "reviewLink": "https://www.imdb.com/review/rw0034491",
      "warningSpoilers": false,
      "date": "5 November 2002",
      "rate": "10",
      "helpful": "208 out of 244 found this helpful.",
      "title": "IT'S NOT OFFICIALLY CHRISTMAS SEASON UNTIL I WATCH THIS MOVIE",
      "content": "I am so glad Frank Capra had a vision to make \"It's A Wonderful Life\". I'm glad he chose Jimmy Stewart to play George Bailey. There are some little gems in life that help make life pleasant. It is not officially the Christmas season without watching this little gem. The supporting cast is perfectly matched. Donna Reed is wonderful as well as all the characters of the town. This would be a great movie, even if it were not in a Christmas setting. The holiday flavor makes it even more charming and memorable. A angel trying to get his wings is a little far-fetched, but Capra pulls it off. The impact of living a good life cannot be underestimated. What would life be like for your family if you had never been born? Our actions do speak loudly. In an age of 9-11, we need this movie more than ever. The values of \"It's A Wonderful Life\" still hold true today. Yes, I'll say it, it's a wonderful movie."
    },
    {
      "username": "jon-larsen",
      "userUrl": "https://www.imdb.com/user/ur20194047",
      "reviewLink": "https://www.imdb.com/review/rw2220704",
      "warningSpoilers": false,
      "date": "14 March 2010",
      "rate": "10",
      "helpful": "221 out of 238 found this helpful.",
      "title": "One of the greatest movie ever made in cinema history!!",
      "content": "When I heard about this movie for the first time, I thought it was just a forgettable and funny movie. But I was wrong. I saw this movie last Christmas and I did not find it funny, but I loved it, though! Everything is so great in this movie. The story is amazing. The characters are great, and the character's development is fantastic! the cinematography is grea, and the acting is fantastic. James Stewart was mind blowing. The whole movie is amazing,touching and encouraging. You cannot describe how good this movie is. Nor can you describe how good the message is.This is the best feel-good movie ever. It's a life changing movie, actually. It makes you feel good to be alive. Do me a favor and watch this movie as soon as possible! When you're sad, think about the message this movie delivers, because you will get a smile on your face! I'm 14 years old. My English is not very good, but I hope this review was useful!"
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0034541",
      "warningSpoilers": true,
      "date": "29 October 2003",
      "rate": "10",
      "helpful": "64 out of 84 found this helpful.",
      "title": "So is the movie...",
      "content": "Review edited and therefore quite choppy due to maximum word limit. Has there ever been a truer and more heartfelt character than George Bailey? This is a man whose life is one of great significance, but he, like all of us, does not always realize that this is so. He does not recognize his impact on the world until an angel erases his existence like chalk on a board. It is then that he is hit by the fact that one man's failing life isn't always as inconsequential as it may seem. We all remember when Clarence (Henry Travers) first appears on that snowy bridge and saves George Bailey (James Stewart) from committing suicide. He explains nonchalantly that he is an angel and George is incredulous--until Clarence wipes away his entire past. His mother doesn't recognize him. George tells her about his uncle as a source of belief. She states that his uncle has been dead for some time, now. The best scene in the entire film is that following when George is thrown out by his mother. He runs towards the camera in an intense wide shot, his face registering emotions of fear, horror, and ultimately the horrid understanding of what has happened. This role is the highlight of James Stewart's career--he never came anywhere close to the superb performance he gives in this movie. There is a reason it was his favorite film he ever starred in. Stewart's portrayal of George Bailey is the grown image of all of us: As a child he dreamed of nothing but exotic locations and adventurous travels to foreign lands. But now he is a family man, a father and a husband. He has left behind his silly bachelor notions, but they still come back to haunt him. Bailey owns the town savings and loan, left to him by his father. The cranky Mr. Potter (Lionel Barrymore) wants complete monopoly over the town, and all that stands in his way is Bailey and his little bank. But Bailey, an inner disgust and hatred towards Potter brewing since his childhood days, refuses to cave in and give it all away. Then one day, George's absentminded and quite eccentric uncle (Thomas Mitchell), misplaces a large sum of money, leaving George hopeless and Potter with a serious advantage. After blowing up at his wife (Donna Reed) and kids at home, George gets drunk at a local bar, is scorned at by a schoolteacher's wife, and left dazed and confused, walking through the snowy town at night during the happy Christmas season without a hope in the world. Battered and delirious, thinking back over his apparently pointless and wasted life, he contemplates suicide. He prays to God and wishes that he had never existed. Which is why Clarence comes down from heaven to sort things out and answer his prayer. Essentially bombing at the box office when it was first released, and then proceeding to fall into copyright problems for years, \"It's a Wonderful Life\" resurfaced only years later when it was brought back into the public domain circa 1970. When other channels were airing expensive Hollywood movies during the Christmas season, PBS picked up the film and played it as a counter attack, a weak hope prevailing in them that the classic film buffs out there would tune in. They did. And so did families across the nation. Every year the ratings got stronger and stronger and now, almost sixty years following the movie's initial release, it is considered a holiday tradition. George considers suicide as a way of escaping his problems without really thinking over the possible outcomes given his final choice. He looks back upon his life as wasted potential; he wanted to become an adventurer, break his family's small-town tradition and become something huge. Mentally scanning his life to the point in time when he stands on that bridge, George Bailey believes that he has simply and truly created a waste of space. He's ready to end his (assumed) pointless life when his entire point of view is wholly altered by the power of God. George suddenly realizes that though he never lived out his boyhood fantasies, he did so much more than he ever dreamed of. He saved his brother's life, which resulted in a huge impact in later years; he made an influence in the lives of others and brought peace and harmony to an otherwise small town by prevailing at the requests of Mr. Potter; he married a beautiful wife and had children, all of whom will no doubt have some measure of significance later in the world. And his wish on that bridge was that he had never been born. Often I am asked to name my favorite movie, and though I ignore requests and state that I have not seen every existing movie and therefore my judgment carries no significance, I have the lightest whimsy that \"It's a Wonderful Life\" may be my favorite motion picture to date. I cherish few other films just as close, but to me, \"It's a Wonderful Life\" is more moving than \"Casablanca,\" a better study of one man's life than \"Citizen Kane,\" and a movie that will live on in the hearts and memory of viewers long after we are gone. I believe that this is the definitive Americana motion picture, regardless of how I compare it to my other favorites, which may carry the same weight but not the same true significance. Few films come as close to the heart as \"It's a Wonderful Life.\" And few films come as close to \"It's a Wonderful Life\" at all, for that matter. 5/5."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw2354955",
      "warningSpoilers": true,
      "date": "18 December 2010",
      "rate": "10",
      "helpful": "15 out of 18 found this helpful.",
      "title": "\"Each man's life touches so many other lives\".",
      "content": "If there's one movie I probably haven't watched enough times, it would be \"It's a Wonderful Life\". The characters, the situations, the message all come together in a way that intrinsically defines it as a Christmas movie, but when you get right down to it, the film transcends Christmas in a way that's truly heartwarming and magical. Jimmy Stewart had that unique ability to put the Everyman into his roles, and this picture certainly qualifies as one of his finest performances. Donna Reed could not have been a better choice to play Mary, displaying a wholesome sex appeal to go along with those traditional home town American values that pictures of the era were so skillful in portraying. Had Director Frank Capra made only this one picture, it would have earned him recognition as one of the true masters of cinema. I could go on and on, but there's really no point in trying to heap further accolades on a picture that has earned it's place in American film right at the top. Watch it, and watch it again, and in taking the picture's message to heart, reach out and help an angel earn it's wings."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw1564670",
      "warningSpoilers": false,
      "date": "5 January 2007",
      "rate": "10",
      "helpful": "33 out of 46 found this helpful.",
      "title": "One of the Most Beautiful Movies of the Cinema History Ever",
      "content": "On the Christmas Eve of Bedford Falls, the guardian angel Clarence (Henry Travers) is assigned to convince the desperate George Bailey (James Stewart) to not commit suicide. George is a good man, that sacrificed his dreams and his youth on behalf of the citizens of his small town. He inherited the loan business of his father and he gave up traveling the world and joining the university as scheduled. Later he resisted the proposals of the evil banker Mr. Potter (Lionel Barrymore) and has never sold his business to protect the poor community of Bedford Falls and offer a means to afford to buy their own house. He married his beloved Mary Hatch Bailey (Donna Reed) and had four children with her and a tough life with his family. When his uncle Billy (Thomas Mitchell) loses US$ 8,000.00, found and stolen by Mr. Potter, George decides to commit suicide, since he believes he worth more dead than alive. When Clarence sees that he is not able to persuade George to give up his intention, he decides to show the life in town if George had never existed. George concludes that life is wonderful.\"It's a Wonderful Life\" is certainly one of the most beautiful movies of the cinema history ever. This masterpiece has a touching and moralist story, showing that the famous sentence that a man can make the difference is true. Everything works perfectly in this movie. The original screenplay develops the situation and the characters accurately, using flashbacks and magnificent lines. The direction of Frank Capra is outstanding as usual. The cinematography in black & white and using shadows and lights is fantastic. James Stewart leads an amazing cast, showing a perfect chemistry with the gorgeous Donna Reed, in the role of a compassionate and enlightened good man. Lionel Barrymore is also amazing in the role of the despicable banker. I do not recall how many times I have already seen this film, but last time was 16 Dec 2000. This is the type of movie that a lover of cinema will never get tired of watching many times. My vote is ten.Title (Brazil): \"A Felicidade não se Compra\" (\"The Happiness Is not Bought\")"
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw2943425",
      "warningSpoilers": true,
      "date": "17 January 2014",
      "rate": "9",
      "helpful": "17 out of 22 found this helpful.",
      "title": "Great Christmas (and all year round) movie",
      "content": "Frank Capra's 1946 drama/fantasy IT'S A WONDERFUL LIFE is one of the best-remembered films of all time, and it's no surprise; this moralistic tale of human suffering, poverty, greed, courage and determination is one that resounds through the ages, particularly so in our modern age of fat-cat bankers and a growing gap between rich and poor.James Stewart gives a dependably decent turn as George Bailey, a family man who finds himself at the mercy of Lionel Barrymore's criminal banker, Mr. Potter. What follows is lengthy and often profound, an occasionally twee but ultimately moving exploration of the human character and the effect one man can have on his world.What I particularly liked about IT'S A WONDERFUL LIFE is the way that every part of the narrative hangs together without any unnecessary extras. Even the little bits like the accident on the ice at the outset later come back to haunt our characters. It's very well written, and expertly directed by Frank Capra; an unashamedly old-fashioned, heart-warming and sentimental piece of movie-making on a grand scale. I'd even go so far as to call it the ultimate Christmas film."
    },
    {
      "username": "mark.waltz",
      "userUrl": "https://www.imdb.com/user/ur0968789",
      "reviewLink": "https://www.imdb.com/review/rw4532943",
      "warningSpoilers": true,
      "date": "25 December 2018",
      "rate": "10",
      "helpful": "15 out of 20 found this helpful.",
      "title": "Each man's life touches so many others.",
      "content": "In looking at this glorious Christmas classic, it's easy to get so involved in the psychology behind it. we obviously become so caught up in our own lives that we often forget about how others around us have influenced who we become and vice versa. This film, which has been redone in many different forms, including taking popular characters from TV shows, both daytime and nighttime and putting them in the same situation as Jimmy Stewart, truly stands the test of time. Not only is it watching one man's slow destruction from things that seem to be beyond his control, it's seeing how one person can deal with the ruthless machinations of the pure evil around him and open the eyes of everybody else to see what's really going on.In a return to the Christmas theme that he earlier used in 1941 classic \"Meet John Doe\", director Frank Capra saves the seasonal Twist of the story for the film's last half-hour. An unseen angel is sent to a small town to aid a possible suicide victim when the actions of the greedy and evil Lionel Barrymore threatens to send him to prison for embezzlement. Stewart's life is seen in flashbacks for much of the film, but when the film joins the present day, it is almost like it has gone some 70 years into the future to today with Barrymore representing the truly evil Scrooge like banker who wants to control everybody's life.It is quite a shocker to see Barrymore playing such a nasty, evil man after playing the kindly Dr. Gillespie in the series of MGM medical dramas. he is basically expanding the role of Scrooge which he did on radio for many years and adds an essence of true malevolence to his characterization. Even Scrooge wasn't as crass as his character here. It seems to be a continuation of the role that Edward Arnold played so beautifully in Capra's earlier films \"Mr Smith Goes to Washington\" and \"Meet John Doe\".The lovely Donna Reed crosses over from MGM ingenue to classy leading lady, adding much depth to her role of Stewart's girlfriend, later wife, with Beulah Bondi saintly as usual his lovable mother. (Bondi played Stewart's mother in so many films and on TV that it is obvious that somehow in real life, he did call her ma.) Then there's Gloria Grahame as the town flirt, Thomas Mitchell as Stewart's rascal uncle, and of course Henry Travers as Clarence, the angel who desperately wants his wings. The smaller roles are filled out by many familiar actors, some of whom were in pretty much every Capra film, as well as Danny Mummert and Larry Simms, both from the \"Blondie\" series and Karolyn Grimes, an underrated child star who stole many movie programmers in the mid-1940s.There are so many other things to credit for this film's excellence beyond the cast and direction, namely the brilliant script, fast pacing and brilliant production design. This film holds up regardless of whether you see it in its original black-and-white form or it's decently restored colorized version. I'm not in favor of colorizing classic movies, but somehow this one actually came out all right. while I watch this one every other year rather than every year, I can say that I am continuously touched and discover new seems in its that I had not seen before. It is no wonder that this is on nearlt everybody's list of the top Christmas movies of all time."
    },
    {
      "username": "nickenchuggets",
      "userUrl": "https://www.imdb.com/user/ur107418055",
      "reviewLink": "https://www.imdb.com/review/rw7678136",
      "warningSpoilers": true,
      "date": "24 December 2021",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "No man is a failure who has friends",
      "content": "Even though it is nowadays considered one of the best christmas movies ever, It's a Wonderful Life was not always seen that way. People at the time thought it was barely mediocre, and that it would probably be forgotten about in a year or two, but 70 years later it has endured. So why is this? At first, I didn't really know whether or not I should consider it a christmas movie, because it does have the aesthetic of the holiday, but a big middle portion of the film doesn't really have a holiday feel to it. In fact, it's actually pretty depressing. I think this movie is constantly remembered as one of the best because it has a very original idea. The story is about a guy named George Bailey (Jimmy Stewart), who intends to kill himself on Christmas Eve because his life is turning into a disaster. An angel is sent from heaven in order to show him how even though he might not realize it right now, his life has meaning to others. Before the angel, Clarence, decides to interfere in George's life, we are shown the events that happened throughout his life starting with his childhood. We see how as a 12 year old in 1919, George is sledding with his brother Harry but falls into a pool of ice water, costing him the use of one of his ears for the rest of his life. We also see how George is lusted after by a young girl named Mary (Donna Reed), who later comes back into his life during his time in college. Sadly, George's father dies soon after, and Mr. Potter (Lionel Barrymore), wants to dissolve George's father's former business now that he is dead. George, with the help of his uncle Billy, run the company now. Under George's direction, his company builds Bailey Park, which is a housing project designed to challenge Potter's control of the town. Potter even calls George into his office and offers to make him his assistant for almost half a million (modern) dollars, but George declines, knowing his real objective is to shut down his father's business. Later on, World War 2 is underway, and George is not drafted because of his partial deafness. His brother Harry becomes a fighter ace and shoots down a japanese plane that was about to bomb a transport ship. Billy goes to rub in Potter's face the fact that one of his relatives is a war hero, but inadvertently misplaces a huge amount of money in Potter's office. A bank examiner then calls out George's company on the missing money, and George realizes he's now in serious trouble, possibly facing jail time. He tries to figure out where in the world the missing money could be, and takes out his bad mood on his innocent family members in the meantime, since he is now married to Mary. Desperate, George heads to Potter in order to surrender his life insurance policy to him to make up for the lost cash, but Potter tells him he's calling the police anyway. George runs away and eventually comes to a bridge, where he sees someone drowning in the freezing water below. After diving in and saving him, it's revealed that the man is Clarence, George's guardian angel, but George doesn't believe him. He says he wishes he never existed, and the angel grants this wish. George's town is now called Pottersville, there's crime everywhere, and nobody (even his own family members) recognize him anymore. He learns that Bailey park is now a cemetery, and George finds that his brother Harry is dead, drowned in a lake at age 9. This means all the men on the transport ship in ww2 were killed, since Harry wasn't there to rescue them. George even sees his wife Mary, who's now a librarian, but she doesn't recognize him either. Now convinced the world is horrible without him in it, George pleads with Clarence to give him his old life back. It does come back, and George rushes home to eagerly await being arrested. Just when it looks like he is actually going to be taken into custody, the townspeople pull through and show up at George's house to make up for the missing 8000 dollars. George also receives a final thank you note from Clarence, saying that he finally has wings now because he was able to successfully help George. What a wonderful movie. It isn't everyday when I watch something that is worth seeing every holiday season, but now that I've seen this, I can completely understand its legendary reputation. Everything about this film is great. There's way too many aspects of it that are worthy of praise, so I'm not going to go over all of them. I will say though that the acting is truly worthy of a classic movie, and both Stewart and Donna Reed live up to their reputations. As George, Jimmy Stewart is an anxious, depressed person who doesn't know what his next move is going to be. He's shown to love Mary a lot, but is more frustrated the longer the film goes on by the threat of Potter blackmailing him. He takes his hate out on his family who simply don't deserve it. He knows he shouldn't, and he feels bad that he did, so he mistakenly assumes that by just literally dropping dead, he would be doing the world a favor. Clarence later shows him how wrong he is. Donna Reed as Mary is the love of George's life ever since he was a kid. It's clear to see why she hates to see him so bitter, especially around christmastime. Lionel Barrymore as Potter does his job really well. He's everything you want to see in an antagonist. He always belittles George and makes him feel unimportant, and intends to make life really difficult for him by closing down his company. Even Gloria Grahame shows up at one point. In my opinion, this is an odd holiday movie because there is a big portion of it that doesn't feel like christmas, but the second half of it makes it worthwhile. It reminds me a lot of A Christmas Carol, because Scrooge sees how horrible his world will be if he doesn't change, and so he decides to become a better person. To be clear, It's a Wonderful Life truly earns its praise as not just one of the best christmas movies, but one of the best movies, period. Capra really did know how to make films."
    },
    {
      "username": "Sunsphxsuns",
      "userUrl": "https://www.imdb.com/user/ur46581731",
      "reviewLink": "https://www.imdb.com/review/rw7647604",
      "warningSpoilers": false,
      "date": "15 December 2021",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "FRANK CAPRA'S OPUS",
      "content": "If you were to ask me what Holiday-themed film I enjoy the most and never get tired watching, my answer would invariably be, Frank Capra's \"It's A Wonderful Life\" (1946).Of course, there are many other great holiday movies that are also genuine cinematic treasures, even though they're not as well known as \"It's A Wonderful Life.\" My \"must watch\" holiday list includes many of the black and white classics I have previously reviewed on IMDb such as, \"Holiday Inn (1942),\"It Happened On 5th Avenue,\" (1947), A Christmas Carol (1951),\" \"Christmas In Connecticut,\" (1945) and although it's in color, \"White Christmas\" (1954). And for good measure I still immensely enjoy watching \"Home Alone 1 & 2\" (1990-1992) and the charming trilogy, \"The Santa Clause\" (1994-2004-2006).Nevertheless, \"It's A Wonderful Life\" is the singular holiday film that continues to resonate with me on multiple levels. It is a supremely powerful story of self-worth and destiny, bolstered by superb acting, laced with unforgettable characters like George Bailey, Clarence Oddbody, and Mr. Potter, thoughtful cinematography which perfectly captures the small town ambiance of Bedford Falls, sharp editing (no surprise since Capra began his film career as an editor), a beautiful score by Russian composer Dimitri Tiomkin, and more memorable quotes than could ever be listed here.Ironically, \"It's A Wonderful Life\" may never have popped up on anyone's cinematic radar screen had the proper copyright ownership documents been registered. How this error occurred is fascinating.The original 1945 ownership of \"It's A Wonderful Life\" belonged to Liberty Films, an independent motion picture production company created by the film's brilliant director, Frank Capra. The following year, Liberty was purchased by Paramount. Ten years later, in 1955, M. & A. Alexander subsequently purchased the rights to the short story, \"The Greatest Gift,\" on which the film was based. With the purchase also came the rights to the film itself, television syndication, and the music score. Shortly thereafter, National Telefilm Associates (NTA) became the new owner. Amazingly, a clerical error meant NTA had neglected to renew its copyright. By 1974, the movie fell into the \"public domain.\"In essence, Capra's masterpiece no longer had copyright protection, and therefore, anyone could make copies of the film, package it anyway they chose, all without having to pay for it. Because of this, television studios began broadcasting \"It's A Wonderful Life\" during the Christmas holidays, while dozens of other companies packaged and sold the film in various media forms such as VHS, and later, Laser Disc and DVD. The good news- This nearly forgotten film was now being seen for the first time by millions of people. The bad news - Many of the reproductions were of poor quality, with some crudely edited down from the original 131 minute run time into a shorter length to accommodate TV scheduling. Nevertheless, these unusual series of events managed to breathe new life into Capra's stunning film for future generations.As often occurs with films destined for immortality, \"It's A Wonderful Life\" was initially a financial box office failure, although it was nominated for five Academy Awards (including Best Picture) and has been revered by the American Film Institute as one of the 100 best American films ever made.There's nothing more I can add to this review that hasn't been covered already by other astute IMDb reviewers, but I will say that if you have still not seen \"It's A Wonderful Life\" by now (2021) then stop whatever you're doing and buy the BR, DVD, or stream it. I'm confident even after your first viewing you are going to feel like you've just seen one of the greatest films ever made, and you would be absolutely right!No spoilers here as usual but I will reveal that while much of the film happens in the fictional town of Bedford Falls during a very cold, snowy, Wintery Christmas holiday, it was actually filmed in Southern California which was experiencing a sweltering record heat wave!"
    },
    {
      "username": "bradman2000",
      "userUrl": "https://www.imdb.com/user/ur0573001",
      "reviewLink": "https://www.imdb.com/review/rw0034447",
      "warningSpoilers": false,
      "date": "18 April 2000",
      "rate": "",
      "helpful": "210 out of 253 found this helpful.",
      "title": "Sheer brilliance!",
      "content": "After strong performances in films such as \"Mr Smith Goes to Washington\" and \"The Philadelphia Story\", James Stewart confirmed his status as one of the greats with his performance as George Bailey in \"It's a Wonderful Life\". This movie is, without a doubt, the best of all time.\"It's a Wonderful Life\" is a movie that you can watch over and over again. It's movie that makes you think, about life in general and how each person makes a difference, and about how great life can be (hence the title \"It's a Wonderful Life). Whilst making you think, it also entertains with many light hearted moments, particularly towards the end of the film. The direction, sound and casting in \"It's a Wonderful Life\" are second to none. Yet it is the fact that almost any person can watch this movie and come away feeling inspired that makes it easily the best movie of all time!A 10/10 without a doubt!"
    },
    {
      "username": "alansabljakovic-39044",
      "userUrl": "https://www.imdb.com/user/ur70682706",
      "reviewLink": "https://www.imdb.com/review/rw5353254",
      "warningSpoilers": false,
      "date": "25 December 2019",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "It just doesn't age",
      "content": "This is basically my only Christmas tradition movie. I have to watch this every Christmas or else I would go nuts. James Stewart really steals the scene with his acting and beautiful charm. He was great in every movie I've ever watched him in. It is wonderful, it is funny, it is touching and it is human."
    },
    {
      "username": "rokomo",
      "userUrl": "https://www.imdb.com/user/ur123630428",
      "reviewLink": "https://www.imdb.com/review/rw6396179",
      "warningSpoilers": true,
      "date": "24 December 2020",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Tonight I saw this movie again, I burst into tears again",
      "content": "Many often cites the best films of 1940s as Citizien Kane, Casablanca, The Great Dictator, etc. These are great movies, but It's a Wonderful Life surpasses them all unrivalled. It's a Wonderful Life is a truly great movie and I, like many others, have a habit of watching this movie very year on Christmas Eve, so I am this year. From where to start, this is from music, acting, screenplay, camera, directing, scenery, plot to adorable little details (squirrel on Uncle Billy's shoulder) the wonderful movie. The film tells the wonderful story about everyone beign worthy of existence and that the abscence of someone would make a big hole in the existence. I can't put into words this film and all its wonderfulness, but that's why I watch it and enjoy in this."
    },
    {
      "username": "shelbythuylinh",
      "userUrl": "https://www.imdb.com/user/ur142375144",
      "reviewLink": "https://www.imdb.com/review/rw7655671",
      "warningSpoilers": true,
      "date": "18 December 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "James Stewart A Legendary Performance",
      "content": "Really it is about George Bailey's struggle as everything in life that keeps passing him by but his younger successful brother Harry keeps on thriving.As that he has too much of a heart of gold there. That will not give up nor say no. Even canceling his own honeymoon there. While he becomes miserable as an angel named Clarance watches George nearly kill himself there.Clarence in hearing George wishes he never was born finally \"gets his wish\" as he is going to be arrested for stealing money there that the mean old antagonist Mr. Potter in trying to ruin George.Had George not lived it would had been Pottersville with clubs and x-rated movies the kind of town that nobody would ever wanted and it was prevented due to George's big heart.You do not have to be rich in money. But rich in love and how George put others first prove that the real loser is Potter and he will have to answer to his maker there. For all the wrong he did.While George helps Clarance get his wings after second class as George wins back his life, his family, and loved ones saving him from prison.One of the best holiday films ever. For all generations to come. As it was a flop originally but later on it became such a huge Christmas hit."
    },
    {
      "username": "Piedradura",
      "userUrl": "https://www.imdb.com/user/ur0347162",
      "reviewLink": "https://www.imdb.com/review/rw4532774",
      "warningSpoilers": false,
      "date": "25 December 2018",
      "rate": "10",
      "helpful": "22 out of 28 found this helpful.",
      "title": "Beautiful and more relevant than ever",
      "content": "I've seen this film at least 20 times over the years and it never fails to move me. It Is so relevant more than seven decades later. Our wonderful nation could very well face the same future that Mr. Potter wanted to inflict on Bedford Falls. Amazing how its basic premise of redemption and good winning over greed resonates in 21st century America.The older I get the more emotional this film makes me. It is simply that good."
    },
    {
      "username": "r96sk",
      "userUrl": "https://www.imdb.com/user/ur49400835",
      "reviewLink": "https://www.imdb.com/review/rw6401234",
      "warningSpoilers": false,
      "date": "26 December 2020",
      "rate": "8",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Enjoyable, hearty and well crafted",
      "content": "Lovely film.'It's a Wonderful Life' is enjoyable, hearty and well crafted. It takes longer than I would've predicted to get to 'the event', but it's very much worth seeing the journey that comes before - as we see the arc of James Stewart's George. It all crescendos with an ending that you can't help but smile at.Stewart is excellent in the lead role, you really do see every single emotion that his character goes through. He is, by far, the standout performer, but there are of course good performances from the likes of Donna Reed (Mary), Lionel Barrymore (Henry) and Henry Travers (Clarence).I did notice a few weird cuts in there, not that I hold that against it or did it affect my enjoyment - it's just noticeable. I see, via other reviewers, that there's a colour version - Channel 4 showed the black-and-white version over here in the UK. I can't say I felt the need for colour, which is always a good sign.Wholesome. Not that it, evidently given the average rating, needs to be said by someone like me, but: I'd certainly recommend this."
    },
    {
      "username": "thelandofoo",
      "userUrl": "https://www.imdb.com/user/ur153264970",
      "reviewLink": "https://www.imdb.com/review/rw8746172",
      "warningSpoilers": false,
      "date": "20 December 2022",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "A Deeply Moving Holiday Classic",
      "content": "Shortly after the end of WW2, the tastes of the American people yearned for something more real like the war, which lead to the underperformance of Frank Capra's It's a Wonderful Life as it was deemed too sentimental. After years of being played on television, it eventually got the attention it rightfully deserved. George Bailey, played by James Stewart, yearns to leave Bedford Falls, but one unfortunate event after another calls for George to make sacrifice after sacrifice, until it all culminates to one crucial moment on the night of Christmas Eve when he is at his lowest and most vulnerable. James Stewart presents a wide range and a layered character and one we can root for as his dreams go further out from his reach. How the writers brought Christianity into the story was appealing to me and is approached in a way that makes it universally digestible. We have ourselves a great cast of memorable characters that show some growth and then there is the easily detestable Mr. Potter, who seeks to take over the town and is continuously at odds with the Baileys. The tone of the movie itself I found to be perfectly balanced as we get plenty of heartfelt moments, but also some dark and intense ones as well. It's a Wonderful Life proves to be more than a holiday classic, as it excels with its story that everyone can take something away from. Final verdict: 10/10."
    }
  ],
  "errorMessage": ""
}