{
  "imDbId": "tt0038650",
  "title": "It's a Wonderful Life",
  "fullTitle": "It's a Wonderful Life (1946)",
  "type": "Movie",
  "year": "1946",
  "language": "en",
  "titleInLanguage": "It's a Wonderful Life",
  "url": "https://en.wikipedia.org/wiki/It%27s_a_Wonderful_Life",
  "plotShort": {
    "plainText": "It's a Wonderful Life is a 1946 American Christmas fantasy drama film produced and directed by Frank Capra. It is based on the short story and booklet The Greatest Gift self-published by Philip Van Doren Stern in 1943, which itself is loosely based on the 1843 Charles Dickens novella A Christmas Carol. The film stars James Stewart as George Bailey, a man who has given up his personal dreams in order to help others in his community and whose thoughts of suicide on Christmas Eve bring about the intervention of his guardian angel, Clarence Odbody (Henry Travers). Clarence shows George all the lives he touched and what the world would be like if he did not exist.\r\nTheatrically, the film's break-even point was $6.3 million, about twice the production cost, a figure it did not come close to achieving on its initial release. Because of the film's disappointing sales, Capra was seen by some studios as having lost his ability to produce popular, financially successful films. Although It's a Wonderful Life initially received mixed reviews and was unsuccessful at the box office, it became a Christmas classic after its copyright lapsed in 1974 and it fell into the public domain, which allowed it to be broadcast without licensing or royalty fees.\r\nToday, It's a Wonderful Life is considered to be one of the greatest films of all time and among the best Christmas films. It was nominated for five Academy Awards, including Best Picture, and has been recognized by the American Film Institute as one of the 100 best American films ever made. It was No. 11 on the American Film Institute's 1998 greatest movie list, No. 20 on its 2007 greatest movie list, and No. 1 on its list of the most inspirational American films of all time. Capra revealed that it was his favorite among the films he directed and that he screened it for his family every Christmas season. It was one of Stewart's favorite films. In 1990, It's a Wonderful Life was designated as \"culturally, historically or aesthetically significant\" and added to the National Film Registry of the Library of Congress.",
    "html": "<p>It's a Wonderful Life is a 1946 American Christmas fantasy drama film produced and directed by Frank Capra. It is based on the short story and booklet The Greatest Gift self-published by Philip Van Doren Stern in 1943, which itself is loosely based on the 1843 Charles Dickens novella A Christmas Carol. The film stars James Stewart as George Bailey, a man who has given up his personal dreams in order to help others in his community and whose thoughts of suicide on Christmas Eve bring about the intervention of his guardian angel, Clarence Odbody (Henry Travers). Clarence shows George all the lives he touched and what the world would be like if he did not exist.</p><p>Theatrically, the film's break-even point was $6.3 million, about twice the production cost, a figure it did not come close to achieving on its initial release. Because of the film's disappointing sales, Capra was seen by some studios as having lost his ability to produce popular, financially successful films. Although It's a Wonderful Life initially received mixed reviews and was unsuccessful at the box office, it became a Christmas classic after its copyright lapsed in 1974 and it fell into the public domain, which allowed it to be broadcast without licensing or royalty fees.</p><p>Today, It's a Wonderful Life is considered to be one of the greatest films of all time and among the best Christmas films. It was nominated for five Academy Awards, including Best Picture, and has been recognized by the American Film Institute as one of the 100 best American films ever made. It was No. 11 on the American Film Institute's 1998 greatest movie list, No. 20 on its 2007 greatest movie list, and No. 1 on its list of the most inspirational American films of all time. Capra revealed that it was his favorite among the films he directed and that he screened it for his family every Christmas season. It was one of Stewart's favorite films. In 1990, It's a Wonderful Life was designated as \"culturally, historically or aesthetically significant\" and added to the National Film Registry of the Library of Congress.</p>"
  },
  "plotFull": {
    "plainText": "It's a Wonderful Life is a 1946 American Christmas fantasy drama film produced and directed by Frank Capra. It is based on the short story and booklet The Greatest Gift self-published by Philip Van Doren Stern in 1943, which itself is loosely based on the 1843 Charles Dickens novella A Christmas Carol. The film stars James Stewart as George Bailey, a man who has given up his personal dreams in order to help others in his community and whose thoughts of suicide on Christmas Eve bring about the intervention of his guardian angel, Clarence Odbody (Henry Travers). Clarence shows George all the lives he touched and what the world would be like if he did not exist.\r\nTheatrically, the film's break-even point was $6.3 million, about twice the production cost, a figure it did not come close to achieving on its initial release. Because of the film's disappointing sales, Capra was seen by some studios as having lost his ability to produce popular, financially successful films. Although It's a Wonderful Life initially received mixed reviews and was unsuccessful at the box office, it became a Christmas classic after its copyright lapsed in 1974 and it fell into the public domain, which allowed it to be broadcast without licensing or royalty fees.\r\nToday, It's a Wonderful Life is considered to be one of the greatest films of all time and among the best Christmas films. It was nominated for five Academy Awards, including Best Picture, and has been recognized by the American Film Institute as one of the 100 best American films ever made. It was No. 11 on the American Film Institute's 1998 greatest movie list, No. 20 on its 2007 greatest movie list, and No. 1 on its list of the most inspirational American films of all time. Capra revealed that it was his favorite among the films he directed and that he screened it for his family every Christmas season. It was one of Stewart's favorite films. In 1990, It's a Wonderful Life was designated as \"culturally, historically or aesthetically significant\" and added to the National Film Registry of the Library of Congress.\r\nPlot\r\nOn Christmas Eve 1945, in Bedford Falls, New York, George Bailey contemplates suicide. The prayers of his family and friends reach Heaven, where guardian angel second class Clarence Odbody is assigned to save George in order to earn his wings. Clarence is shown flashbacks of George's life. He watches 12-year-old George rescue his younger brother Harry from drowning, leaving George deaf in his left ear. George later prevents the pharmacist, Mr. Gower, from accidentally poisoning a customer's prescription.\r\nIn 1928, George plans a world tour before college. He is reintroduced to Mary Hatch, who has been enamored with him since childhood. When his father dies suddenly, George postpones his travel to settle the family business, Bailey Brothers Building and Loan. Avaricious board member Henry Potter, who controls most of the town, seeks to dissolve it, but the board votes to keep the Building and Loan open if George runs it. George acquiesces and works alongside his uncle Billy, giving his tuition to Harry with the understanding that Harry will run the business when he graduates.\r\nHarry returns from college married and with a job offer from his father-in-law, and George resigns himself to running the Building and Loan. George and Mary rekindle their relationship and wed. They witness a run on the bank and use their honeymoon savings to keep the Building and Loan solvent. Under George, the company establishes Bailey Park, a housing development surpassing Potter's overpriced slums. Potter entices George with a $20,000/year job, but realizing that Potter's true intention is to close the Building and Loan, George rebuffs him.\r\nOn Christmas Eve 1945, the town prepares a hero's welcome for Harry, who, as a U.S. Navy fighter pilot, was awarded the Medal of Honor for preventing a kamikaze attack on a troop transport. Billy goes to Potter's bank to deposit $8,000 of the Building and Loan's money. He taunts Potter with a newspaper headline about Harry, then absentmindedly wraps the cash in Potter's newspaper. Potter finds and keeps the money, while Billy cannot recall how he misplaced it. With a bank examiner reviewing the company's records, George realizes scandal and criminal charges will follow. Fruitlessly retracing Billy's steps, George berates him and takes out his frustration on Mary and their children. George appeals to Potter for a loan, offering his life insurance policy as collateral. Potter scoffs that George is worth more dead than alive, refuses to help, and phones the police.\r\nGeorge flees Potter's office, gets drunk at a bar, and prays for help. Suicidally despondent, he goes to a nearby bridge, but before he can jump, Clarence dives into the river, and George rescues him. When George wishes he had never been born, Clarence shows George a timeline in which he never existed. Bedford Falls is now Pottersville, an unsavory town occupied by sleazy entertainment venues, crime, and callous people. Mr. Gower was imprisoned for manslaughter because George was not there to stop him from poisoning the customer. George's mother does not know him. Uncle Billy was institutionalized after the Building and Loan failed. Bailey Park is a cemetery, where George discovers Harry's grave. Without George, Harry drowned as a child, and without Harry to save them, the troops aboard the transport ship were killed. George finds Mary, now a spinster, and when he grabs her and claims to be her husband, she screams and runs.\r\nGeorge flees back to the bridge and begs Clarence for his life back. The original reality is restored, and a grateful George rushes home to await his arrest. Meanwhile, Mary and Billy have rallied the townspeople, who come into the Bailey home and donate more than enough to cover the missing money. Harry arrives and toasts George as \"the richest man in town\". Among the donations George finds a copy of The Adventures of Tom Sawyer, a gift from Clarence and inscribed, \"Remember, no man is a failure who has friends. Thanks for the wings!\" When a bell on the Christmas tree rings, George's youngest daughter, Zuzu, explains that \"every time a bell rings, an angel gets his wings.\" George looks upward smiling and says, \"Atta boy, Clarence!\"\r\nCast\r\nJames Stewart as George Bailey\r\nDonna Reed as Mary Hatch Bailey\r\nLionel Barrymore as Henry Potter\r\nThomas Mitchell as Uncle Billy\r\nHenry Travers as Clarence\r\nBeulah Bondi as Mrs. Bailey\r\nFrank Faylen as Ernie Bishop\r\nWard Bond as Bert\r\nGloria Grahame as Violet Bick\r\nH. B. Warner as Mr. Gower\r\nFrank Albertson as Sam Wainwright\r\nTodd Karns as Harry Bailey\r\nSamuel S. Hinds as Pa Bailey\r\nMary Treen as Cousin Tilly\r\nVirginia Patton as Ruth Dakin\r\nCharles Williams as Cousin Eustace\r\nSara Edwards as Mrs. Hatch\r\nBill Edmunds as Mr. Giuseppe Martini\r\nLillian Randolph as Annie\r\nArgentina Brunetti as Mrs. Martini\r\nBobbie Anderson as Little George\r\nRonnie Ralph as Little Sam\r\nJean Gale as Little Mary\r\nJeanine Ann Roose as Little Violet\r\nDanny Mummert as Little Marty Hatch\r\nGeorgie Nokes as Little Harry Bailey\r\nSheldon Leonard as Nick\r\nFrank Hagney as Potter's Bodyguard\r\nRay Walker as Joe (Luggage Shop)\r\nCharlie Lane as Real Estate Salesman\r\nEdward Kean as Tom (Bldg. & Loan)\r\nCarol Coomes as Janie\r\nKarolyn Grimes as Zuzu\r\nLarry Simms as Pete\r\nJimmy Hawkins as Tommy\r\nFamous or memorable uncredited cast members include:\r\nJimmy as Uncle Billy's pet raven\r\nStanley Andrews as Mr. Welch, the teacher's husband\r\nAl Bridge as the Sheriff with the arrest warrant against George\r\nAdriana Caselotti as Singer at Martini's\r\nEllen Corby as Bailey Brothers Building & Loan customer, Miss Davis\r\nDick Elliott as the bald man on his front porch\r\nTom Fadden as the bridge tollhouse keeper\r\nCharles Halton as the bank examiner, Mr. Carter\r\nHarry Holman as high school principal, Mr. Partridge\r\nHarold Landon as Marty Hatch\r\nJ. Farrell MacDonald as the man whose great-grandfather planted the tree George drives into\r\nMark Roberts as Mickey, the student with the swimming pool floor key\r\nAlmira Sessions as Potter's secretary\r\nCarl Switzer as Freddie Othello, the student who unsuccessfully tries to flirt with Mary\r\nJoseph Granby voiced the Angel Joseph\r\nMoroni Olsen voiced the Senior Angel Franklin\r\nMarian Carr as Jane Wainwright\r\nProduction\r\nBackground\r\nThe original story, The Greatest Gift, was written by Philip Van Doren Stern in November 1939. After it was rejected by several publishers, he had it printed as a 24-page pamphlet and mailed to 200 family members and friends for Christmas 1943. The story came to the attention of either Cary Grant or RKO producer David Hempstead, who showed it to Grant's agent. In April 1944, RKO Pictures bought the rights to the story for $10,000, hoping to turn it into a vehicle for Grant.\r\nDalton Trumbo, Clifford Odets, and Marc Connelly each worked on versions of the screenplay before RKO shelved the project. In Trumbo's draft, George Bailey is an idealistic politician who grows more cynical as the story progresses, then tries to commit suicide after losing an election. The angel shows him Bedford Falls not as it would be if he had never been born, but if he had gone into business instead of politics. Grant went on to make another Christmas movie staple, The Bishop's Wife.\r\nRKO studio chief Charles Koerner urged Frank Capra to read \"The Greatest Gift\". Capra's new production company, Liberty Films, had a nine-film distribution agreement with RKO. Capra immediately saw its potential, and wanted it for his first Hollywood film after making documentaries and training films during the war. RKO sold Capra the rights for $10,000 and threw in the three earlier scripts for free. (Capra claimed the rights and the scripts cost him $50,000.) Capra salvaged a few scenes from Odets' earlier screenplay and worked with writers Frances Goodrich and Albert Hackett, Jo Swerling, Michael Wilson, and Dorothy Parker (brought in to \"polish\" the script), on many drafts of the screenplay.\r\nIt was not a harmonious collaboration. Goodrich called Capra \"that horrid man\" and recalled, \"He couldn't wait to get writing it himself.\" Her husband, Albert Hackett, said, \"We told him what we were going to do, and he said 'That sounds fine.' We were trying to move the story along and work it out, and then somebody told us that and Jo Swerling were working on it together, and that sort of took the guts out of it. Jo Swerling was a very close friend of ours, and when we heard he was doing this we felt rather bad about it. We were getting near the end and word came that Capra wanted to know how soon we'd be finished. So my wife said, 'We're finished right now.' We quickly wrote out the last scene and we never saw him again after that. He's a very arrogant son of a bitch.\"\r\nLater, a dispute ensued over the writing credits. The final screenplay, renamed by Capra It's a Wonderful Life, was credited to Goodrich, Hackett, and Capra, with \"additional scenes\" by Jo Swerling. Capra said, \"The Screen Writers' Arbitration committee decided that Hackett and Goodrich and I should get the credit for the writing. Jo Swerling hasn't talked to me since. That was five years ago.\"\r\nSome in Seneca Falls, New York, believe Capra was inspired to model Bedford Falls after the town following a visit in 1945. The town has an annual \"It's a Wonderful Life Festival\" on the second weekend in December. On December 10, 2010, the \"It's a Wonderful Life\" Museum opened in Seneca Falls, with Karolyn Grimes, who played Zuzu in the movie, cutting the ribbon. However, film historian Jeanine Basinger, curator of the Frank Capra archives at Wesleyan University and author of The 'It's A Wonderful Life' Book, has said no evidence exists for Seneca Falls' claim. \"I have been through every piece of paper in Frank Capra's diaries, his archives, everything. There's no evidence of any sort whatsoever to support this. That doesn't mean it isn't true, but no one is ever going to prove it.\" Basinger said that Capra always described Bedford Falls as an \"Everytown\".\r\nPhilip Van Doren Stern said in a 1946 interview, \"Incidentally, the movie takes place in Westchester County. Actually, the town I had in mind was Califon, N.J.\" The historic iron bridge in Califon is similar to the bridge that George Bailey considered jumping from in the movie.\r\nCasting\r\nIn his autobiography, Capra recalled: \"Of all actors' roles I believe the most difficult is the role of a Good Sam who doesn't know that he is a Good Sam. I knew one man who could play it ... James Stewart. ... I spoke to Lew Wasserman, the MCA agent who handled Jimmy, told him I wanted to tell Jimmy the story. Wasserman said Stewart would gladly play the part without hearing the story.\" Stewart and Capra had previously collaborated on You Can't Take It with You (1938) and Mr. Smith Goes to Washington (1939).\r\nHenry Fonda, Stewart's best friend, was also considered. Both actors had returned from the war with no employment prospects. Fonda, however, was cast in John Ford's My Darling Clementine (1946), which was filmed at the same time that Capra shot It's a Wonderful Life. For 17 supporting roles in the film, Capra considered more than 170 established actors.\r\nJean Arthur, Stewart's co-star in You Can't Take It With You and Mr. Smith Goes to Washington, was first offered the role of Mary, but had recently dropped out of the Broadway show Born Yesterday from exhaustion shortly before its premiere. Capra next considered Olivia de Havilland, Martha Scott, Ann Dvorak, and Ginger Rogers before borrowing Donna Reed from MGM. Rogers turned it down because she considered it \"too bland\". In chapter 26 of her autobiography Ginger: My Story, she questioned her decision by asking her readers: \"Foolish, you say?\"\r\nA long list of actors was considered for the role of Potter (originally named Herbert Potter): Edward Arnold, Charles Bickford, Edgar Buchanan, Louis Calhern, Victor Jory, Raymond Massey, Thomas Mitchell, and Vincent Price. Lionel Barrymore, who eventually was cast, was a famous Ebenezer Scrooge in radio dramatizations of A Christmas Carol at the time, and was a natural choice for the role. Barrymore had also worked with Capra and Stewart on Capra's 1938 Best Picture Oscar winner, You Can't Take It with You.\r\nBefore Capra decided on Ward Bond as Bert, he also considered Sam Levene, Barton MacLane, Robert Mitchum, John Alexander and Irving Bacon for the role.\r\nBefore Capra cast Thomas Mitchell as Uncle Billy, he also considered Walter Brennan and W. C. Fields for the role.\r\nH. B. Warner, who was cast as Mr. Gower, the pharmacist, had studied medicine before going into acting. He was also in some of Capra's other films, including Mr. Deeds Goes to Town, Lost Horizon, You Can't Take It with You, and Mr. Smith Goes to Washington. In the silent era, he had played the role of Jesus Christ in Cecil B. DeMille's The King of Kings (1927). The name Gower came from Capra's employer Columbia Pictures, which had been located on Gower Street for many years. Also on Gower Street was a drugstore that was a favorite for the studio's employees.\r\nCharles Williams, who was cast as Eustace Bailey, and Mary Treen, who was cast as Matilda \"Tilly\" Bailey, were both B-list actors, having appeared in 90 films each before It's a Wonderful Life.\r\nJimmy the raven (Uncle Billy's pet) appeared in You Can't Take It with You and each subsequent Capra film.\r\nFilming\r\nIt's a Wonderful Life was shot at RKO Radio Pictures Studios in Culver City, California, and the 89-acre RKO movie ranch in Encino, where \"Bedford Falls\" was adapted from Oscar-winning sets originally designed by art director Max Ree for the 1931 epic film Cimarron. Covering 4 acres (1.6 ha), the town consisted of a main street stretching 300 yards (three city blocks) with 75 stores and buildings, and a residential neighborhood. Capra added a tree-lined center parkway, built a working bank set, and planted 20 full-grown oak trees. Pigeons, cats, and dogs were allowed to roam the mammoth set to give the \"town\" a lived-in feel.\r\nDue to the requirements of filming in an \"alternate reality\", as well as different seasons, the exterior set was extremely adaptable. RKO studio's head of special effects, Russell Shearman, developed a new compound using water, soap flakes, foamite, and sugar to create \"chemical snow\" for the film. Before then, movie snow was usually made from untoasted cornflakes, which were so loud when stepped on that dialogue had to be redubbed afterwards.\r\nFilming started on April 15, 1946, and wrapped on July 27, 1946, exactly on deadline for the 90-day principal photography schedule.\r\nOnly two locations from the film survive. The first, the swimming pool that was unveiled during the high-school dance sequence, is located in the gymnasium at Beverly Hills High School and is still in use as of 2013. The second is the \"Martini home\" in La Cañada Flintridge, California. RKO's movie ranch in Encino was razed in 1954.\r\nThe scene where young George saves his brother Harry from drowning was different in an early draft of the script. The boys play ice hockey on the river (which is on Potter's property) as Potter watches with disdain. George shoots the puck, but it goes astray and breaks the \"No Trespassing\" sign and lands in Potter's yard. Potter becomes irate and his gardener releases attack dogs, which cause the boys to flee. Harry falls in the ice and George saves him with the same results.\r\nIn another draft, after he unsuccessfully attempts to consult his father about Mr. Gower and the pills, George considers asking Uncle Billy, but he is on the phone with the bank examiner. Billy lights his cigar and throws his match in the wastebasket. George turns to Tilly (who, along with Eustace, are his cousins, although not Billy's kids), but she is on the phone with her friend, Martha. She says, \"Potter's here, the bank examiner's coming. It's a day of judgment.\" The wastebasket suddenly catches fire and Billy cries for help. Tilly runs in and puts the fire out with a pot of coffee. George decides to deal with the Gower situation by himself.\r\nAccording to Bobbie Anderson, in the confrontation between Mr. Gower and young George, H. B. Warner, who was drunk at the time of the drug store scene, slapped him for real and made his ear bleed, reducing him to tears. Warner hugged him after the scene was shot.\r\nComposer Dimitri Tiomkin had written \"Death Telegram\" and \"Gower's Deliverance\" for the drugstore sequence, but Capra elected to forgo music in those scenes. Tiomkin had worked on many of Capra's previous films, but those changes, and others, led to a falling out between the two men. Tiomkin felt as though his work was being seen as a mere suggestion. In his autobiography Please Don't Hate Me, he called the incident, \"an all around scissors job\".\r\nIn the scene where Uncle Billy gets drunk at Harry and Ruth's welcome home/newlyweds' party and staggers away off camera, a crash is heard off screen. Mitchell, as Uncle Billy, yells, \"I'm all right! I'm all right!\", implying that Uncle Billy had knocked into some trash cans. A technician had actually knocked over some equipment; Capra left in Mitchell's impromptu ad lib and rewarded the technician with $10 (equal to $141.84 in 2021), thanking him for his 'sound improvement'.\r\nAccording to rare stills that have been unearthed, several sequences were filmed but subsequently cut. Alternative endings were also considered. Capra's first script had Bailey fall to his knees to recite \"The Lord's Prayer\" (the script also called for an opening scene with the townspeople in prayer). Feeling that an overly religious tone undermined the emotional impact of the family and friends rushing to George's rescue, the closing scenes were rewritten.\r\nCapra found the film's original cinematographer Victor Milner slow and pretentious, and when Milner became ill, Capra borrowed Joseph Walker from Columbia. Walker had lensed 19 previous Capra films. But when Rosalind Russell demanded that Walker return to Columbia Pictures to shoot her next film, Walker trained veteran camera operator Joseph Biroc to be his replacement. Although working with three cinematographers was difficult for Capra, in Walker's opinion it turned out very well because the scenes each cinematographer shot were so different that they did not have to match each other's visual styles.\r\nReception\r\nCritical response\r\nAccording to a 2006 book, \"A spate of movies appeared just after the ending of the Second World War, including It's a Wonderful Life (1946) and Stairway to Heaven (1946), perhaps tapping into so many people's experience of loss of loved ones and offering a kind of consolation.\" It's a Wonderful Life premiered at the Globe Theatre in New York City on December 20, 1946, to mixed reviews. While Capra thought the contemporary critical reviews were either universally negative, or at best dismissive, Time said, \"It's a Wonderful Life is a pretty wonderful movie. It has only one formidable rival (Goldwyn's The Best Years of Our Lives) as Hollywood's best picture of the year. Director Capra's inventiveness, humor, and affection for human beings keep it glowing with life and excitement.\"\r\nBosley Crowther, writing for The New York Times, complimented some of the actors, including Stewart and Reed, but concluded, \"the weakness of this picture, from this reviewer's point of view, is the sentimentality of it—its illusory concept of life. Mr. Capra's nice people are charming, his small town is a quite beguiling place and his pattern for solving problems is most optimistic and facile. But somehow, they all resemble theatrical attitudes, rather than average realities.\"\r\nThe film, which went into general release on January 7, 1947, placed 26th ($3.3 million) in box-office revenues for 1947 (out of more than 400 features released), one place ahead of another Christmas film, Miracle on 34th Street. The film was supposed to be released in January 1947, but was moved up to December 1946 to make it eligible for the 19th Academy Awards held in March 1947. This move was seen as worse for the film, as 1947 did not have quite the stiff competition as 1946. If it had entered the 1947 awards, its strongest competitor would have been Miracle on 34th Street. The number-one grossing movie of 1947, The Best Years of Our Lives, made $11.5 million.\r\nThe film recorded a loss of $525,000 at the box office for RKO.\r\nOn May 26, 1947, the Federal Bureau of Investigation issued a memo stating, \"With regard to the picture It's a Wonderful Life, stated in substance that the film represented rather obvious attempts to discredit bankers by casting Lionel Barrymore as a 'scrooge-type' so that he would be the most hated man in the picture. This, according to these sources, is a common trick used by Communists. addition, stated that, in his opinion, this picture deliberately maligned the upper class, attempting to show the people who had money were mean and despicable characters.\" Film historian Andrew Sarris observed as \"curious\" that \"the censors never noticed that the villainous Mr. Potter gets away with robbery without being caught or punished in any way\".\r\nIn 1990, It's a Wonderful Life was deemed \"culturally, historically, or aesthetically significant\" by the United States Library of Congress and selected for preservation in their National Film Registry.\r\nIn 2002, Channel 4 in the United Kingdom ranked It's a Wonderful Life as the seventh-greatest film ever made in its poll \"The 100 Greatest Films\". The channel airs the film to British viewers annually on Christmas Eve.\r\nIn June 2008, AFI revealed its 10 Top 10, the best 10 films in 10 \"classic\" American film genres, after polling over 1,500 people from the creative community. It's a Wonderful Life was acknowledged as the third-best film in the fantasy genre.\r\nSomewhat more iconoclastic views of the film and its contents are occasionally expressed. In his review for The New Republic in 1947, film critic Manny Farber wrote, \"To make his points, always takes an easy, simple-minded path that doesn't give much credit to the intelligence of the audience\", and adds that it has only a \"few unsentimental moments here and there\". Wendell Jamieson, in a 2008 article for The New York Times which was generally positive in its analysis of the film, observing that far from being simply a sweetly sentimental tale, it \"is a terrifying, asphyxiating story about growing up and relinquishing your dreams, of seeing your father driven to the grave before his time, of living among bitter, small-minded people. It is a story of being trapped, of compromising, of watching others move ahead and away, of becoming so filled with rage that you verbally abuse your children, their teacher, and your oppressively perfect wife.\"\r\n... one of the most profoundly pessimistic tales of human existence ever to achieve a lasting popularity.\r\n—Film historian Andrew Sarris in \"You Ain't Heard Nothin' Yet.\": The American Talking Film History & Memory, 1927-1949.\r\nIn a 2010 essay for Salon, Richard Cohen described It's a Wonderful Life as \"the most terrifying Hollywood film ever made\". In the \"Pottersville\" sequence, he wrote, George Bailey is not seeing the world that would exist had he never been born, but rather \"the world as it does exist, in his time and also in our own\". Nine years earlier, another Salon writer, Gary Kamiya, had expressed the opposing view that \"Pottersville rocks!\", adding: \"The gauzy, Currier-and-Ives veil Capra drapes over Bedford Falls has prevented viewers from grasping what a tiresome and, frankly, toxic environment it is ... We all live in Pottersville now.\"\r\nThe film's elevation to the status of a beloved classic came three decades after its initial release, when it became a television staple during Christmas season in 1976. This came as a welcome surprise to Frank Capra and others involved with its production. \"It's the damnedest thing I've ever seen\", Capra told The Wall Street Journal in 1984. \"The film has a life of its own now, and I can look at it like I had nothing to do with it. I'm like a parent whose kid grows up to be President. I'm proud ... but it's the kid who did the work. I didn't even think of it as a Christmas story when I first ran across it. I just liked the idea.\" In a 1946 interview, Capra described the film's theme as \"the individual's belief in himself\" and that he made it \"to combat a modern trend toward atheism\". It ranked 283rd among critics, and 107th among directors, in the 2012 Sight & Sound polls of the greatest films ever made.\r\nThe film's positive reception has continued. On review aggregator Rotten Tomatoes, the film holds an approval rating of 94% based on 93 reviews, with an average rating of 9.10/10. The website's critical consensus reads, \"The holiday classic to define all holiday classics, It's a Wonderful Life is one of a handful of films worth an annual viewing.\" On Metacritic, which assigns a normalized rating to reviews, the film has a score 89 out of 100, based on 17 critics, indicating \"universal acclaim\".\r\nMany filmmakers have praised the film, ranging from Steven Spielberg, Akira Kurosawa, Frank Darabont and David Lynch. Spielberg once said of the film: \"It’s a Wonderful Life shows that every human being on this Earth matters -- and that’s a very powerful message.\" Orson Welles played Mr. Potter in the made-for-television remake It Happened One Christmas; when asked by Henry Jaglom what he thought of the movie, Welles said, \"There's no way of hating that movie\".\r\nAwards and honors\r\nPrior to its Los Angeles release, Liberty Films mounted an extensive promotional campaign that included a daily advertisement highlighting one of the film's players, along with comments from reviewers. Jimmy Starr wrote, \"If I were an Oscar, I'd elope with It's a Wonderful Life lock, stock and barrel on the night of the Academy Awards\". The New York Daily Times published an editorial that declared the film and James Stewart's performance to be worthy of Academy Award consideration.\r\nIt's a Wonderful Life received five Academy Award nominations:\r\nThe Best Years of Our Lives, a drama about servicemen attempting to return to their pre-World War II lives, won most of the awards that year, including four of the five for which It's a Wonderful Life was nominated. (The award for \"Best Sound Recording\" was won by The Jolson Story.) The Best Years of Our Lives, directed by William Wyler, Capra's business partner along with George Stevens in Liberty Films, was also an outstanding commercial success, ultimately becoming the highest-grossing film of the decade, in contrast to the more modest initial box-office returns of It's a Wonderful Life.\r\nIt's a Wonderful Life received a Golden Globe Award for Capra as Best Motion Picture Director. He also won a \"CEC Award\" from the Cinema Writers Circle in Spain, for Mejor Película Extranjera (Best Foreign Film). Jimmy Hawkins won a \"Former Child Star Lifetime Achievement Award\" from the Young Artist Awards in 1994; the award recognized his role as Tommy Bailey as igniting his career, which lasted until the mid-1960s.\r\nRelease\r\nOwnership and copyright issues\r\nLiberty Films was purchased by Paramount Pictures, and remained a subsidiary until 1951. In 1955, M. & A. Alexander purchased the movie. This included key rights to the original television syndication, the original nitrate film elements, the music score, and the film rights to the story on which the film is based, The Greatest Gift. National Telefilm Associates took over the rights to the film soon thereafter.\r\nA clerical error at NTA prevented the copyright from being renewed properly in 1974. Despite the lapsed copyright, television stations that aired it still had to pay royalties because—though the film's images had entered the public domain—the film's story was still restricted as a derivative work of the published story The Greatest Gift, whose copyright Philip Van Doren Stern had renewed in 1971. The film became a perennial holiday favorite in the 1980s, possibly due to its repeated showings each holiday season on hundreds of local television stations. It was mentioned during the deliberations on the Copyright Term Extension Act of 1998.\r\nIn 1993, Republic Pictures, which was the successor to NTA, relied on the 1990 U.S. Supreme Court ruling in Stewart v. Abend (which involved another Stewart film, Rear Window) to enforce its claim to the copyright. While the film's copyright had not been renewed, Republic still owned the film rights to The Greatest Gift; thus, the plaintiffs were able to argue its status as a derivative work of a work still under copyright. That year, Republic made a deal with Turner Broadcasting System, authorizing only three airings of the movie, all on cable's TNT and TBS. However, the studio's attempt to reassert control was widely ignored since there were still some existing distribution deals that Republic had to honor.\r\nIn 1994, the studio sold exclusive television rights to NBC. \"We're thrilled that we will have the opportunity to broadcast this picture,\" said NBC Entertainment President Warren Littlefield at the time. \"We will broadcast the original director's cut in black and white, full-length, the way Frank Capra intended this picture to be seen.\"\r\nNBC traditionally shows it during the holidays after Thanksgiving and on Christmas Eve. Paramount (via parent company Viacom's 1998 acquisition of Republic's then-parent, Spelling Entertainment) once again has distribution rights for the first time since 1955.\r\nDue to all the above actions, this is one of the few RKO films not controlled by Turner Entertainment/Warner Bros. in the US. It is also one of two Capra films Paramount owns despite not having originally released it—the other is Broadway Bill (originally from Columbia, remade by Paramount as Riding High in 1950).\r\nColorization\r\nDirector Capra met with Wilson Markle about having Colorization Inc. colorize It's a Wonderful Life based on an enthusiastic response to the colorization of Topper from actor Cary Grant. The company's art director, Brian Holmes, prepared 10 minutes of colorized footage from It's a Wonderful Life for Capra to view, which resulted in Capra signing a contract with Colorization Inc., and his \"enthusiastic agree to pay half the $260,000 cost of colorizing the movie and to share any profits\" and giving \"preliminary approval to making similar color versions of two of his other black-and-white films, Meet John Doe (1941) and Lady for a Day (1933)\".\r\nHowever, the film was believed to be in the public domain at the time, and as a result, Markle and Holmes responded by returning Capra's initial investment, eliminating his financial participation, and refusing outright to allow the director to exercise artistic control over the colorization of his films, leading Capra to join in the campaign against the process.\r\nThree colorized versions have been produced. The first was released by Hal Roach Studios in 1986. The second was authorized and produced by the film's permanent owner, Republic Pictures, in 1989. Both Capra and Stewart took a critical stand on the colorized editions. The Hal Roach color version was re-released in 1989 to VHS via Video Treasures. A third, computer-colorized version was produced by Legend Films in 2007 and has been released on DVD, Blu-ray, and streaming services.\r\nHome media\r\nVHS\r\nThroughout the 1980s and early 1990s, when the film was still under public domain status, It's a Wonderful Life was released on VHS by a variety of home video companies. Among the companies that released the film on home video before Republic Pictures stepped in were Meda Video (which would later become Media Home Entertainment), Kartes Video Communications (under its Video Film Classics label), GoodTimes Home Video, and Video Treasures (now Anchor Bay Entertainment). After Republic reclaimed the rights to the film, all unofficial VHS copies of the film still in the hands of video distributors were supposed to have been destroyed.\r\nArtisan Entertainment (under license from Republic) took over home video rights in the mid-1990s. Artisan was later sold to Lions Gate Entertainment, which continued to hold US home video rights until late 2005, when they reverted to Paramount, which also owns video rights throughout Region 4 (Latin America and Australia) and in France. Video rights in the rest of the world are held by different companies; for example, the UK rights were once with Universal Studios, but have since reverted to Paramount.\r\nTechnological first: CD-ROM\r\nIn 1993, due in part to the confusion of the ownership and copyright issues, Kinesoft Development, with the support of Republic Pictures, released It's a Wonderful Life as one of the first commercial feature-length films on CD-ROM for the Windows PC (Windows 3.1). Antedating commercial DVDs by several years, it included such features as the ability to follow along with the complete shooting script as the film was playing.\r\nGiven the state of video playback on the PC at the time of its release, It's a Wonderful Life for Windows represented another milestone, as the longest-running video on a computer. Prior to its release, Windows could play back only about 32,000 frames of video, or about 35 minutes at 15 frames per second. Working with Microsoft, Kinesoft was able to enhance the video features of Windows to allow for the complete playback of the entire film—all of this on a PC with a 486SX processor and 8 MB of RAM.\r\nComputer Gaming World said in April 1994, \"The picture quality still has a way to go before it reaches television standards\", but was \"a noble effort\" that would \"please fans of the film\".\r\nDVD and Blu-ray\r\nThe film has seen multiple DVD releases since the availability of the format. In the autumn of 2001, Republic issued the film twice, once in August, and again with different packaging in September of that same year. On October 31, 2006, Paramount released a newly remastered \"60th Anniversary Edition\". On November 13, 2007, Paramount released a two-disc \"special edition\" DVD of the film that contained both the original theatrical black-and-white version, and a new, third colorized version, produced by Legend Films using the latest colorization technology. On November 3, 2009, Paramount re-released the previous DVD set as a \"Collector's Edition\" and debuted a Blu-ray edition, also containing both versions of the film.\r\nRestoration\r\nIn 2017, the film was restored in 4K resolution, available via streaming services and DCP.\r\n4K Ultra HD Blu-ray\r\nOn October 29, 2019, the film was released for the first time on 4K Ultra HD Blu-ray, along with digital copy featuring a new Dolby Vision transfer.\r\nAdaptations in other media\r\nThe film was twice adapted for radio in 1947, first on Lux Radio Theater (March 10) and then on the Screen Guild Theater (December 29), then again on the Screen Guild Theater broadcast of March 15, 1951. James Stewart and Donna Reed reprised their roles for all three radio productions. Stewart also starred in the May 8, 1949 radio adaptation presented on the Screen Directors Playhouse.\r\nA musical stage adaptation of the film, titled A Wonderful Life, was written by Sheldon Harnick and Joe Raposo. This version was first performed at the University of Michigan in 1986, but a planned professional production was stalled by legal wrangling with the estate of Philip Van Doren Stern. It was eventually performed in Washington, DC, by Arena Stage in 1991, and had revivals in the 21st century, including a staged concert version in New York City in 2005 and several productions by regional theatres.\r\nAnother musical stage adaptation of the film, titled It's a Wonderful Life – The Musical, was written by Bruce Greer and Keith Ferguson. This version premiered at the Majestic Theatre, Dallas, Texas, in 1998. It was an annual Christmas show at the theater for five years. It has since been performed at venues all around the United States.\r\nIn July 2019, it was revealed that another stage musical adaptation was in development with music and lyrics by Paul McCartney (making his musical theatre debut), lyrics and book by Lee Hall and produced by Bill Kenwright. The musical was set to debut late 2020, but is still yet to be announced.\r\nA 1986 skit on Saturday Night Live features William Shatner introducing the \"lost ending\" of It's a Wonderful Life in which George Bailey (Dana Carvey) and the citizens of Bedford Falls discover that Mr. Potter (Jon Lovitz) has stolen George's money and take turns beating him up in his office.\r\nIn 1992, the final episode of Tiny Toon Adventures parodied It's A Wonderful Life entitled \"It's A Wonderful Tiny Toon Christmas\". In it, Buster Bunny feels sad after the failure of his play and wishes he had never become a Tiny Toon, so a guardian angel shows Buster what life would have been like without him.\r\nThe film was also adapted into a play in two acts by James W. Rodgers. It was first performed on December 15, 1993, at Paul Laurence Dunbar High School. The play opens with George Bailey contemplating suicide and then goes back through major moments in his life. Many of the scenes from the movie are only alluded to or mentioned in the play rather than actually dramatized. For example, in the opening scene, Clarence just mentions George having saved his brother Harry after the latter had fallen through the ice.\r\nIt's a Wonderful Life: A Live Radio Play, a stage adaptation presented as a 1940s radio show, was adapted by Joe Landry and has been produced around the United States since 1997. The script is published by Playscripts, Inc.\r\nIn 1997, PBS aired Merry Christmas, George Bailey, taped from a live performance of the 1947 Lux Radio Theatre script at the Pasadena Playhouse. The presentation, which benefited the Elizabeth Glaser Pediatric AIDS Foundation, featured an all-star cast, including Bill Pullman as George, Nathan Lane as Clarence, Martin Landau as Mr. Potter, Penelope Ann Miller as Mary, and Sally Field as Mother Bailey.\r\nIn 2002, the television film It's a Very Merry Muppet Christmas Movie premiered on NBC. The film is a homage to It's a Wonderful Life. In the film, Kermit the Frog wishes that he had never been born.\r\nTony Palermo's 2005 stage adaptation has the story presented as actors making a radio-play complete with them making live sounds effects\r\nPhilip Grecian's 2006 radio play based on the film It's a Wonderful Life is a faithful adaptation, now in its third incarnation, that has been performed numerous times by local theatres in Canada.\r\nThe Last Temptation of Clarence Odbody is a 2011 novel written by John Pierson. The novel imagines the future lives of various characters if George had not survived his jump into the river.\r\nScenes from the film are seen in the 2016 documentary Abacus: Small Enough to Jail, where Abacus Federal Savings Bank founder and chairman Thomas Sung talked about how It's a Wonderful Life influenced him.\r\nA stage-adaptation of the story was presented at The Tower Theatre in Winchester in December 2016 by Blue Apple Theatre with Lawrie Morris in the role of George Bailey. This is believed to be the first time an actor with an intellectual disability (Lawrie Morris had Down's Syndrome) has had the role.\r\nA new \"cinematic audio\" adaptation by David Ossman of the Firesign Theatre was produced and directed by Ossman and his wife Judith Walcutt of Otherworld Media in December 2019 at the Whidbey Island Center for the Arts. Their version combined elements of traditional and radio theatre, with costumes, sets, makeup, and lighting effects, as well as live music, live sound effects, and over 20 microphones.\r\nRemakes\r\nIt Happened One Christmas was a 1977 television movie remake of the classic film, whose screenplay Lionel Chetwynd based on both the original Van Doren Stern short story and the 1946 screenplay. This remake employed gender-reversal, with Marlo Thomas as the protagonist Mary Bailey, Wayne Rogers as George Hatch, and Cloris Leachman as the angel Clara Oddbody. Leachman received her tenth Emmy nomination for this role. In a significant departure from his earlier roles, Orson Welles was cast as Mr. Potter. Following initial positive reviews, the made-for-television film was rebroadcast twice in 1978 and 1979, but has not been shown since on national re-broadcasts or issued to home media.\r\nMerry Christmas, George Bailey was a 1997 PBS television movie adaptation of the film directed by Matthew Diamond and starring Bill Pullman as George Bailey, Penelope Ann Miller as Mary, Nathan Lane as Clarence and Martin Landau as Potter.\r\nThe Christmas Spirit was a retelling of the movie starring Nicollette Sheridan as Charlotte Hart. This was a made-for-TV film aired on December 1, 2013, on the Hallmark Channel executive produced by Sheridan under her company, Wyke Lane Productions, and Brad Krevoy Television. The film was directed and written by Jack Angelo. Spirit was set in the present day, with the Hart character working to save a \"quiet New England town from a ruthless real estate developer\". The film was planned to kick off a film series about the Hart character. The film had 3.372 million viewers overall.\r\n\"The Greatest Gift\", the 2011 Warehouse 13 season 3 Christmas episode, tells a similar story after agent Pete Lattimer touches Stern's brush.\r\nSequel\r\nIn 1990, the made-for-television film Clarence stars Robert Carradine in a new tale of the helpful angel, Clarence Odbody.\r\nPotential\r\nA purported sequel was in development for a 2015 release, and was to be called It's a Wonderful Life: The Rest of the Story. It was to be written by Bob Farnsworth and Martha Bolton and follow the angel of George Bailey's daughter Zuzu (played once again by Karolyn Grimes), as she teaches Bailey's evil grandson how different the world would have been if he had never been born. Producers were considering directors and hoped to shoot the film with a $25–$35 million budget in Louisiana early in 2014.\r\nThe film had been announced as being produced by Star Partners and Hummingbird Productions, neither of which are affiliated with Paramount, owners of the original film (Farnsworth claimed that It's a Wonderful Life was in the public domain). Later, a Paramount spokesperson claimed that they were not granting permission to make the film; \"To date, these individuals have not obtained any of the necessary rights, and we would take all appropriate steps to protect those rights\", the spokesperson said. As of Christmas 2022, no further developmental plans have since arisen.\r\nSesame Street urban legend\r\nIt is commonly believed that the characters of Bert and Ernie on Sesame Street were named after Bert the cop and Ernie the cabdriver. However, in a correction for the 1999 \"Annual Xmas Quiz\" in the San Francisco Chronicle, which made this claim, series writer Jerry Juhl confirmed that, per producer Jon Stone, the shared names were merely a coincidence. Despite this, the 1996 holiday special Elmo Saves Christmas references the rumor, during a scene where Bert and Ernie walk by a TV set, which is playing the movie. The pair are surprised by the line: \"Bert! Ernie! What's the matter with you two guys? You were here on my wedding night!\"\r\nStephan's Quintet usage\r\nThe angelic figures depicted at the beginning of the film is an image of Stephan's Quintet, a group of four interacting galaxies.",
    "html": "<p>It's a Wonderful Life is a 1946 American Christmas fantasy drama film produced and directed by Frank Capra. It is based on the short story and booklet The Greatest Gift self-published by Philip Van Doren Stern in 1943, which itself is loosely based on the 1843 Charles Dickens novella A Christmas Carol. The film stars James Stewart as George Bailey, a man who has given up his personal dreams in order to help others in his community and whose thoughts of suicide on Christmas Eve bring about the intervention of his guardian angel, Clarence Odbody (Henry Travers). Clarence shows George all the lives he touched and what the world would be like if he did not exist.</p><p>Theatrically, the film's break-even point was $6.3 million, about twice the production cost, a figure it did not come close to achieving on its initial release. Because of the film's disappointing sales, Capra was seen by some studios as having lost his ability to produce popular, financially successful films. Although It's a Wonderful Life initially received mixed reviews and was unsuccessful at the box office, it became a Christmas classic after its copyright lapsed in 1974 and it fell into the public domain, which allowed it to be broadcast without licensing or royalty fees.</p><p>Today, It's a Wonderful Life is considered to be one of the greatest films of all time and among the best Christmas films. It was nominated for five Academy Awards, including Best Picture, and has been recognized by the American Film Institute as one of the 100 best American films ever made. It was No. 11 on the American Film Institute's 1998 greatest movie list, No. 20 on its 2007 greatest movie list, and No. 1 on its list of the most inspirational American films of all time. Capra revealed that it was his favorite among the films he directed and that he screened it for his family every Christmas season. It was one of Stewart's favorite films. In 1990, It's a Wonderful Life was designated as \"culturally, historically or aesthetically significant\" and added to the National Film Registry of the Library of Congress.</p><br/><h3>Plot</h3><p>On Christmas Eve 1945, in Bedford Falls, New York, George Bailey contemplates suicide. The prayers of his family and friends reach Heaven, where guardian angel second class Clarence Odbody is assigned to save George in order to earn his wings. Clarence is shown flashbacks of George's life. He watches 12-year-old George rescue his younger brother Harry from drowning, leaving George deaf in his left ear. George later prevents the pharmacist, Mr. Gower, from accidentally poisoning a customer's prescription.</p><p>In 1928, George plans a world tour before college. He is reintroduced to Mary Hatch, who has been enamored with him since childhood. When his father dies suddenly, George postpones his travel to settle the family business, Bailey Brothers Building and Loan. Avaricious board member Henry Potter, who controls most of the town, seeks to dissolve it, but the board votes to keep the Building and Loan open if George runs it. George acquiesces and works alongside his uncle Billy, giving his tuition to Harry with the understanding that Harry will run the business when he graduates.</p><p>Harry returns from college married and with a job offer from his father-in-law, and George resigns himself to running the Building and Loan. George and Mary rekindle their relationship and wed. They witness a run on the bank and use their honeymoon savings to keep the Building and Loan solvent. Under George, the company establishes Bailey Park, a housing development surpassing Potter's overpriced slums. Potter entices George with a $20,000/year job, but realizing that Potter's true intention is to close the Building and Loan, George rebuffs him.</p><p>On Christmas Eve 1945, the town prepares a hero's welcome for Harry, who, as a U.S. Navy fighter pilot, was awarded the Medal of Honor for preventing a kamikaze attack on a troop transport. Billy goes to Potter's bank to deposit $8,000 of the Building and Loan's money. He taunts Potter with a newspaper headline about Harry, then absentmindedly wraps the cash in Potter's newspaper. Potter finds and keeps the money, while Billy cannot recall how he misplaced it. With a bank examiner reviewing the company's records, George realizes scandal and criminal charges will follow. Fruitlessly retracing Billy's steps, George berates him and takes out his frustration on Mary and their children. George appeals to Potter for a loan, offering his life insurance policy as collateral. Potter scoffs that George is worth more dead than alive, refuses to help, and phones the police.</p><p>George flees Potter's office, gets drunk at a bar, and prays for help. Suicidally despondent, he goes to a nearby bridge, but before he can jump, Clarence dives into the river, and George rescues him. When George wishes he had never been born, Clarence shows George a timeline in which he never existed. Bedford Falls is now Pottersville, an unsavory town occupied by sleazy entertainment venues, crime, and callous people. Mr. Gower was imprisoned for manslaughter because George was not there to stop him from poisoning the customer. George's mother does not know him. Uncle Billy was institutionalized after the Building and Loan failed. Bailey Park is a cemetery, where George discovers Harry's grave. Without George, Harry drowned as a child, and without Harry to save them, the troops aboard the transport ship were killed. George finds Mary, now a spinster, and when he grabs her and claims to be her husband, she screams and runs.</p><p>George flees back to the bridge and begs Clarence for his life back. The original reality is restored, and a grateful George rushes home to await his arrest. Meanwhile, Mary and Billy have rallied the townspeople, who come into the Bailey home and donate more than enough to cover the missing money. Harry arrives and toasts George as \"the richest man in town\". Among the donations George finds a copy of The Adventures of Tom Sawyer, a gift from Clarence and inscribed, \"Remember, no man is a failure who has friends. Thanks for the wings!\" When a bell on the Christmas tree rings, George's youngest daughter, Zuzu, explains that \"every time a bell rings, an angel gets his wings.\" George looks upward smiling and says, \"Atta boy, Clarence!\"</p><br/><h3>Cast</h3><ul><li>James Stewart as George Bailey</li><li>Donna Reed as Mary Hatch Bailey</li><li>Lionel Barrymore as Henry Potter</li><li>Thomas Mitchell as Uncle Billy</li><li>Henry Travers as Clarence</li><li>Beulah Bondi as Mrs. Bailey</li><li>Frank Faylen as Ernie Bishop</li><li>Ward Bond as Bert</li><li>Gloria Grahame as Violet Bick</li><li>H. B. Warner as Mr. Gower</li><li>Frank Albertson as Sam Wainwright</li><li>Todd Karns as Harry Bailey</li><li>Samuel S. Hinds as Pa Bailey</li><li>Mary Treen as Cousin Tilly</li><li>Virginia Patton as Ruth Dakin</li><li>Charles Williams as Cousin Eustace</li><li>Sara Edwards as Mrs. Hatch</li><li>Bill Edmunds as Mr. Giuseppe Martini</li><li>Lillian Randolph as Annie</li><li>Argentina Brunetti as Mrs. Martini</li><li>Bobbie Anderson as Little George</li><li>Ronnie Ralph as Little Sam</li><li>Jean Gale as Little Mary</li><li>Jeanine Ann Roose as Little Violet</li><li>Danny Mummert as Little Marty Hatch</li><li>Georgie Nokes as Little Harry Bailey</li><li>Sheldon Leonard as Nick</li><li>Frank Hagney as Potter's Bodyguard</li><li>Ray Walker as Joe (Luggage Shop)</li><li>Charlie Lane as Real Estate Salesman</li><li>Edward Kean as Tom (Bldg. & Loan)</li></ul><ul><li>Carol Coomes as Janie</li><li>Karolyn Grimes as Zuzu</li><li>Larry Simms as Pete</li><li>Jimmy Hawkins as Tommy</li></ul><p>Famous or memorable uncredited cast members include:</p><ul><li>Jimmy as Uncle Billy's pet raven</li><li>Stanley Andrews as Mr. Welch, the teacher's husband</li><li>Al Bridge as the Sheriff with the arrest warrant against George</li><li>Adriana Caselotti as Singer at Martini's</li><li>Ellen Corby as Bailey Brothers Building & Loan customer, Miss Davis</li><li>Dick Elliott as the bald man on his front porch</li><li>Tom Fadden as the bridge tollhouse keeper</li><li>Charles Halton as the bank examiner, Mr. Carter</li><li>Harry Holman as high school principal, Mr. Partridge</li><li>Harold Landon as Marty Hatch</li><li>J. Farrell MacDonald as the man whose great-grandfather planted the tree George drives into</li><li>Mark Roberts as Mickey, the student with the swimming pool floor key</li><li>Almira Sessions as Potter's secretary</li><li>Carl Switzer as Freddie Othello, the student who unsuccessfully tries to flirt with Mary</li><li>Joseph Granby voiced the Angel Joseph</li><li>Moroni Olsen voiced the Senior Angel Franklin</li><li>Marian Carr as Jane Wainwright</li></ul><br/><h3>Production</h3><h4>Background</h4><p>The original story, The Greatest Gift, was written by Philip Van Doren Stern in November 1939. After it was rejected by several publishers, he had it printed as a 24-page pamphlet and mailed to 200 family members and friends for Christmas 1943. The story came to the attention of either Cary Grant or RKO producer David Hempstead, who showed it to Grant's agent. In April 1944, RKO Pictures bought the rights to the story for $10,000, hoping to turn it into a vehicle for Grant.</p><p>Dalton Trumbo, Clifford Odets, and Marc Connelly each worked on versions of the screenplay before RKO shelved the project. In Trumbo's draft, George Bailey is an idealistic politician who grows more cynical as the story progresses, then tries to commit suicide after losing an election. The angel shows him Bedford Falls not as it would be if he had never been born, but if he had gone into business instead of politics. Grant went on to make another Christmas movie staple, The Bishop's Wife.</p><p>RKO studio chief Charles Koerner urged Frank Capra to read \"The Greatest Gift\". Capra's new production company, Liberty Films, had a nine-film distribution agreement with RKO. Capra immediately saw its potential, and wanted it for his first Hollywood film after making documentaries and training films during the war. RKO sold Capra the rights for $10,000 and threw in the three earlier scripts for free. (Capra claimed the rights and the scripts cost him $50,000.) Capra salvaged a few scenes from Odets' earlier screenplay and worked with writers Frances Goodrich and Albert Hackett, Jo Swerling, Michael Wilson, and Dorothy Parker (brought in to \"polish\" the script), on many drafts of the screenplay.</p><p>It was not a harmonious collaboration. Goodrich called Capra \"that horrid man\" and recalled, \"He couldn't wait to get writing it himself.\" Her husband, Albert Hackett, said, \"We told him what we were going to do, and he said 'That sounds fine.' We were trying to move the story along and work it out, and then somebody told us that and Jo Swerling were working on it together, and that sort of took the guts out of it. Jo Swerling was a very close friend of ours, and when we heard he was doing this we felt rather bad about it. We were getting near the end and word came that Capra wanted to know how soon we'd be finished. So my wife said, 'We're finished right now.' We quickly wrote out the last scene and we never saw him again after that. He's a very arrogant son of a bitch.\"</p><p>Later, a dispute ensued over the writing credits. The final screenplay, renamed by Capra It's a Wonderful Life, was credited to Goodrich, Hackett, and Capra, with \"additional scenes\" by Jo Swerling. Capra said, \"The Screen Writers' Arbitration committee decided that Hackett and Goodrich and I should get the credit for the writing. Jo Swerling hasn't talked to me since. That was five years ago.\"</p><p>Some in Seneca Falls, New York, believe Capra was inspired to model Bedford Falls after the town following a visit in 1945. The town has an annual \"It's a Wonderful Life Festival\" on the second weekend in December. On December 10, 2010, the \"It's a Wonderful Life\" Museum opened in Seneca Falls, with Karolyn Grimes, who played Zuzu in the movie, cutting the ribbon. However, film historian Jeanine Basinger, curator of the Frank Capra archives at Wesleyan University and author of The 'It's A Wonderful Life' Book, has said no evidence exists for Seneca Falls' claim. \"I have been through every piece of paper in Frank Capra's diaries, his archives, everything. There's no evidence of any sort whatsoever to support this. That doesn't mean it isn't true, but no one is ever going to prove it.\" Basinger said that Capra always described Bedford Falls as an \"Everytown\".</p><p>Philip Van Doren Stern said in a 1946 interview, \"Incidentally, the movie takes place in Westchester County. Actually, the town I had in mind was Califon, N.J.\" The historic iron bridge in Califon is similar to the bridge that George Bailey considered jumping from in the movie.</p><h4>Casting</h4><p>In his autobiography, Capra recalled: \"Of all actors' roles I believe the most difficult is the role of a Good Sam who doesn't know that he is a Good Sam. I knew one man who could play it ... James Stewart. ... I spoke to Lew Wasserman, the MCA agent who handled Jimmy, told him I wanted to tell Jimmy the story. Wasserman said Stewart would gladly play the part without hearing the story.\" Stewart and Capra had previously collaborated on You Can't Take It with You (1938) and Mr. Smith Goes to Washington (1939).</p><p>Henry Fonda, Stewart's best friend, was also considered. Both actors had returned from the war with no employment prospects. Fonda, however, was cast in John Ford's My Darling Clementine (1946), which was filmed at the same time that Capra shot It's a Wonderful Life. For 17 supporting roles in the film, Capra considered more than 170 established actors.</p><p>Jean Arthur, Stewart's co-star in You Can't Take It With You and Mr. Smith Goes to Washington, was first offered the role of Mary, but had recently dropped out of the Broadway show Born Yesterday from exhaustion shortly before its premiere. Capra next considered Olivia de Havilland, Martha Scott, Ann Dvorak, and Ginger Rogers before borrowing Donna Reed from MGM. Rogers turned it down because she considered it \"too bland\". In chapter 26 of her autobiography Ginger: My Story, she questioned her decision by asking her readers: \"Foolish, you say?\"</p><p>A long list of actors was considered for the role of Potter (originally named Herbert Potter): Edward Arnold, Charles Bickford, Edgar Buchanan, Louis Calhern, Victor Jory, Raymond Massey, Thomas Mitchell, and Vincent Price. Lionel Barrymore, who eventually was cast, was a famous Ebenezer Scrooge in radio dramatizations of A Christmas Carol at the time, and was a natural choice for the role. Barrymore had also worked with Capra and Stewart on Capra's 1938 Best Picture Oscar winner, You Can't Take It with You.</p><p>Before Capra decided on Ward Bond as Bert, he also considered Sam Levene, Barton MacLane, Robert Mitchum, John Alexander and Irving Bacon for the role.</p><p>Before Capra cast Thomas Mitchell as Uncle Billy, he also considered Walter Brennan and W. C. Fields for the role.</p><p>H. B. Warner, who was cast as Mr. Gower, the pharmacist, had studied medicine before going into acting. He was also in some of Capra's other films, including Mr. Deeds Goes to Town, Lost Horizon, You Can't Take It with You, and Mr. Smith Goes to Washington. In the silent era, he had played the role of Jesus Christ in Cecil B. DeMille's The King of Kings (1927). The name Gower came from Capra's employer Columbia Pictures, which had been located on Gower Street for many years. Also on Gower Street was a drugstore that was a favorite for the studio's employees.</p><p>Charles Williams, who was cast as Eustace Bailey, and Mary Treen, who was cast as Matilda \"Tilly\" Bailey, were both B-list actors, having appeared in 90 films each before It's a Wonderful Life.</p><p>Jimmy the raven (Uncle Billy's pet) appeared in You Can't Take It with You and each subsequent Capra film.</p><h4>Filming</h4><p>It's a Wonderful Life was shot at RKO Radio Pictures Studios in Culver City, California, and the 89-acre RKO movie ranch in Encino, where \"Bedford Falls\" was adapted from Oscar-winning sets originally designed by art director Max Ree for the 1931 epic film Cimarron. Covering 4 acres (1.6 ha), the town consisted of a main street stretching 300 yards (three city blocks) with 75 stores and buildings, and a residential neighborhood. Capra added a tree-lined center parkway, built a working bank set, and planted 20 full-grown oak trees. Pigeons, cats, and dogs were allowed to roam the mammoth set to give the \"town\" a lived-in feel.</p><p>Due to the requirements of filming in an \"alternate reality\", as well as different seasons, the exterior set was extremely adaptable. RKO studio's head of special effects, Russell Shearman, developed a new compound using water, soap flakes, foamite, and sugar to create \"chemical snow\" for the film. Before then, movie snow was usually made from untoasted cornflakes, which were so loud when stepped on that dialogue had to be redubbed afterwards.</p><p>Filming started on April 15, 1946, and wrapped on July 27, 1946, exactly on deadline for the 90-day principal photography schedule.</p><p>Only two locations from the film survive. The first, the swimming pool that was unveiled during the high-school dance sequence, is located in the gymnasium at Beverly Hills High School and is still in use as of 2013. The second is the \"Martini home\" in La Cañada Flintridge, California. RKO's movie ranch in Encino was razed in 1954.</p><p>The scene where young George saves his brother Harry from drowning was different in an early draft of the script. The boys play ice hockey on the river (which is on Potter's property) as Potter watches with disdain. George shoots the puck, but it goes astray and breaks the \"No Trespassing\" sign and lands in Potter's yard. Potter becomes irate and his gardener releases attack dogs, which cause the boys to flee. Harry falls in the ice and George saves him with the same results.</p><p>In another draft, after he unsuccessfully attempts to consult his father about Mr. Gower and the pills, George considers asking Uncle Billy, but he is on the phone with the bank examiner. Billy lights his cigar and throws his match in the wastebasket. George turns to Tilly (who, along with Eustace, are his cousins, although not Billy's kids), but she is on the phone with her friend, Martha. She says, \"Potter's here, the bank examiner's coming. It's a day of judgment.\" The wastebasket suddenly catches fire and Billy cries for help. Tilly runs in and puts the fire out with a pot of coffee. George decides to deal with the Gower situation by himself.</p><p>According to Bobbie Anderson, in the confrontation between Mr. Gower and young George, H. B. Warner, who was drunk at the time of the drug store scene, slapped him for real and made his ear bleed, reducing him to tears. Warner hugged him after the scene was shot.</p><p>Composer Dimitri Tiomkin had written \"Death Telegram\" and \"Gower's Deliverance\" for the drugstore sequence, but Capra elected to forgo music in those scenes. Tiomkin had worked on many of Capra's previous films, but those changes, and others, led to a falling out between the two men. Tiomkin felt as though his work was being seen as a mere suggestion. In his autobiography Please Don't Hate Me, he called the incident, \"an all around scissors job\".</p><p>In the scene where Uncle Billy gets drunk at Harry and Ruth's welcome home/newlyweds' party and staggers away off camera, a crash is heard off screen. Mitchell, as Uncle Billy, yells, \"I'm all right! I'm all right!\", implying that Uncle Billy had knocked into some trash cans. A technician had actually knocked over some equipment; Capra left in Mitchell's impromptu ad lib and rewarded the technician with $10 (equal to $141.84 in 2021), thanking him for his 'sound improvement'.</p><p>According to rare stills that have been unearthed, several sequences were filmed but subsequently cut. Alternative endings were also considered. Capra's first script had Bailey fall to his knees to recite \"The Lord's Prayer\" (the script also called for an opening scene with the townspeople in prayer). Feeling that an overly religious tone undermined the emotional impact of the family and friends rushing to George's rescue, the closing scenes were rewritten.</p><p>Capra found the film's original cinematographer Victor Milner slow and pretentious, and when Milner became ill, Capra borrowed Joseph Walker from Columbia. Walker had lensed 19 previous Capra films. But when Rosalind Russell demanded that Walker return to Columbia Pictures to shoot her next film, Walker trained veteran camera operator Joseph Biroc to be his replacement. Although working with three cinematographers was difficult for Capra, in Walker's opinion it turned out very well because the scenes each cinematographer shot were so different that they did not have to match each other's visual styles.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>According to a 2006 book, \"A spate of movies appeared just after the ending of the Second World War, including It's a Wonderful Life (1946) and Stairway to Heaven (1946), perhaps tapping into so many people's experience of loss of loved ones and offering a kind of consolation.\" It's a Wonderful Life premiered at the Globe Theatre in New York City on December 20, 1946, to mixed reviews. While Capra thought the contemporary critical reviews were either universally negative, or at best dismissive, Time said, \"It's a Wonderful Life is a pretty wonderful movie. It has only one formidable rival (Goldwyn's The Best Years of Our Lives) as Hollywood's best picture of the year. Director Capra's inventiveness, humor, and affection for human beings keep it glowing with life and excitement.\"</p><p>Bosley Crowther, writing for The New York Times, complimented some of the actors, including Stewart and Reed, but concluded, \"the weakness of this picture, from this reviewer's point of view, is the sentimentality of it—its illusory concept of life. Mr. Capra's nice people are charming, his small town is a quite beguiling place and his pattern for solving problems is most optimistic and facile. But somehow, they all resemble theatrical attitudes, rather than average realities.\"</p><p>The film, which went into general release on January 7, 1947, placed 26th ($3.3 million) in box-office revenues for 1947 (out of more than 400 features released), one place ahead of another Christmas film, Miracle on 34th Street. The film was supposed to be released in January 1947, but was moved up to December 1946 to make it eligible for the 19th Academy Awards held in March 1947. This move was seen as worse for the film, as 1947 did not have quite the stiff competition as 1946. If it had entered the 1947 awards, its strongest competitor would have been Miracle on 34th Street. The number-one grossing movie of 1947, The Best Years of Our Lives, made $11.5 million.</p><p>The film recorded a loss of $525,000 at the box office for RKO.</p><p>On May 26, 1947, the Federal Bureau of Investigation issued a memo stating, \"With regard to the picture It's a Wonderful Life, stated in substance that the film represented rather obvious attempts to discredit bankers by casting Lionel Barrymore as a 'scrooge-type' so that he would be the most hated man in the picture. This, according to these sources, is a common trick used by Communists. addition, stated that, in his opinion, this picture deliberately maligned the upper class, attempting to show the people who had money were mean and despicable characters.\" Film historian Andrew Sarris observed as \"curious\" that \"the censors never noticed that the villainous Mr. Potter gets away with robbery without being caught or punished in any way\".</p><p>In 1990, It's a Wonderful Life was deemed \"culturally, historically, or aesthetically significant\" by the United States Library of Congress and selected for preservation in their National Film Registry.</p><p>In 2002, Channel 4 in the United Kingdom ranked It's a Wonderful Life as the seventh-greatest film ever made in its poll \"The 100 Greatest Films\". The channel airs the film to British viewers annually on Christmas Eve.</p><p>In June 2008, AFI revealed its 10 Top 10, the best 10 films in 10 \"classic\" American film genres, after polling over 1,500 people from the creative community. It's a Wonderful Life was acknowledged as the third-best film in the fantasy genre.</p><p>Somewhat more iconoclastic views of the film and its contents are occasionally expressed. In his review for The New Republic in 1947, film critic Manny Farber wrote, \"To make his points, always takes an easy, simple-minded path that doesn't give much credit to the intelligence of the audience\", and adds that it has only a \"few unsentimental moments here and there\". Wendell Jamieson, in a 2008 article for The New York Times which was generally positive in its analysis of the film, observing that far from being simply a sweetly sentimental tale, it \"is a terrifying, asphyxiating story about growing up and relinquishing your dreams, of seeing your father driven to the grave before his time, of living among bitter, small-minded people. It is a story of being trapped, of compromising, of watching others move ahead and away, of becoming so filled with rage that you verbally abuse your children, their teacher, and your oppressively perfect wife.\"</p><blockquote>... one of the most profoundly pessimistic tales of human existence ever to achieve a lasting popularity.</blockquote><p>—Film historian Andrew Sarris in \"You Ain't Heard Nothin' Yet.\": The American Talking Film History & Memory, 1927-1949.</p><p>In a 2010 essay for Salon, Richard Cohen described It's a Wonderful Life as \"the most terrifying Hollywood film ever made\". In the \"Pottersville\" sequence, he wrote, George Bailey is not seeing the world that would exist had he never been born, but rather \"the world as it does exist, in his time and also in our own\". Nine years earlier, another Salon writer, Gary Kamiya, had expressed the opposing view that \"Pottersville rocks!\", adding: \"The gauzy, Currier-and-Ives veil Capra drapes over Bedford Falls has prevented viewers from grasping what a tiresome and, frankly, toxic environment it is ... We all live in Pottersville now.\"</p><p>The film's elevation to the status of a beloved classic came three decades after its initial release, when it became a television staple during Christmas season in 1976. This came as a welcome surprise to Frank Capra and others involved with its production. \"It's the damnedest thing I've ever seen\", Capra told The Wall Street Journal in 1984. \"The film has a life of its own now, and I can look at it like I had nothing to do with it. I'm like a parent whose kid grows up to be President. I'm proud ... but it's the kid who did the work. I didn't even think of it as a Christmas story when I first ran across it. I just liked the idea.\" In a 1946 interview, Capra described the film's theme as \"the individual's belief in himself\" and that he made it \"to combat a modern trend toward atheism\". It ranked 283rd among critics, and 107th among directors, in the 2012 Sight & Sound polls of the greatest films ever made.</p><p>The film's positive reception has continued. On review aggregator Rotten Tomatoes, the film holds an approval rating of 94% based on 93 reviews, with an average rating of 9.10/10. The website's critical consensus reads, \"The holiday classic to define all holiday classics, It's a Wonderful Life is one of a handful of films worth an annual viewing.\" On Metacritic, which assigns a normalized rating to reviews, the film has a score 89 out of 100, based on 17 critics, indicating \"universal acclaim\".</p><p>Many filmmakers have praised the film, ranging from Steven Spielberg, Akira Kurosawa, Frank Darabont and David Lynch. Spielberg once said of the film: \"It’s a Wonderful Life shows that every human being on this Earth matters -- and that’s a very powerful message.\" Orson Welles played Mr. Potter in the made-for-television remake It Happened One Christmas; when asked by Henry Jaglom what he thought of the movie, Welles said, \"There's no way of hating that movie\".</p><br/><h3>Awards and honors</h3><p>Prior to its Los Angeles release, Liberty Films mounted an extensive promotional campaign that included a daily advertisement highlighting one of the film's players, along with comments from reviewers. Jimmy Starr wrote, \"If I were an Oscar, I'd elope with It's a Wonderful Life lock, stock and barrel on the night of the Academy Awards\". The New York Daily Times published an editorial that declared the film and James Stewart's performance to be worthy of Academy Award consideration.</p><p>It's a Wonderful Life received five Academy Award nominations:</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Result</th><th width=\"500\">Nominee / Winner</th></tr><tr><td rowspan=\"6\"><span>1946</span></td><td><span>Best Picture</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>Liberty Films</span> <br> <small>Winner was <span>Samuel Goldwyn Productions</span> – <i><span>The Best Years of Our Lives</span></i></small></td></tr><tr><td><span>Best Director</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>Frank Capra</span> <br> <small>Winner was <span>William Wyler</span> – <i><span>The Best Years of Our Lives</span></i></small></td></tr><tr><td><span>Best Actor</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>James Stewart</span> <br> <small>Winner was <span>Fredric March</span> – <i><span>The Best Years of Our Lives</span></i></small></td></tr><tr><td><span>Best Film Editing</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>William Hornbeck</span> <br> <small>Winner was <span>Daniel Mandell</span> – <i><span>The Best Years of Our Lives</span></i></small></td></tr><tr><td><span class=\"mw-redirect\">Best Sound Recording</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span class=\"mw-redirect\">John Aalberg</span> <br> <small>Winner was <span>John P. Livadary</span> – <i><span>The Jolson Story</span></i></small></td></tr><tr><td><span>Technical Achievement Award</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><span>Russell Shearman</span> and <span>RKO Radio Studio Special Effects Dept.</span><br> <small>For the development of a new method of simulating falling snow on motion picture sets.</small></td></tr></tbody></table><p>The Best Years of Our Lives, a drama about servicemen attempting to return to their pre-World War II lives, won most of the awards that year, including four of the five for which It's a Wonderful Life was nominated. (The award for \"Best Sound Recording\" was won by The Jolson Story.) The Best Years of Our Lives, directed by William Wyler, Capra's business partner along with George Stevens in Liberty Films, was also an outstanding commercial success, ultimately becoming the highest-grossing film of the decade, in contrast to the more modest initial box-office returns of It's a Wonderful Life.</p><p>It's a Wonderful Life received a Golden Globe Award for Capra as Best Motion Picture Director. He also won a \"CEC Award\" from the Cinema Writers Circle in Spain, for Mejor Película Extranjera (Best Foreign Film). Jimmy Hawkins won a \"Former Child Star Lifetime Achievement Award\" from the Young Artist Awards in 1994; the award recognized his role as Tommy Bailey as igniting his career, which lasted until the mid-1960s.</p><br/><h3>Release</h3><h4>Ownership and copyright issues</h4><p>Liberty Films was purchased by Paramount Pictures, and remained a subsidiary until 1951. In 1955, M. & A. Alexander purchased the movie. This included key rights to the original television syndication, the original nitrate film elements, the music score, and the film rights to the story on which the film is based, The Greatest Gift. National Telefilm Associates took over the rights to the film soon thereafter.</p><p>A clerical error at NTA prevented the copyright from being renewed properly in 1974. Despite the lapsed copyright, television stations that aired it still had to pay royalties because—though the film's images had entered the public domain—the film's story was still restricted as a derivative work of the published story The Greatest Gift, whose copyright Philip Van Doren Stern had renewed in 1971. The film became a perennial holiday favorite in the 1980s, possibly due to its repeated showings each holiday season on hundreds of local television stations. It was mentioned during the deliberations on the Copyright Term Extension Act of 1998.</p><p>In 1993, Republic Pictures, which was the successor to NTA, relied on the 1990 U.S. Supreme Court ruling in Stewart v. Abend (which involved another Stewart film, Rear Window) to enforce its claim to the copyright. While the film's copyright had not been renewed, Republic still owned the film rights to The Greatest Gift; thus, the plaintiffs were able to argue its status as a derivative work of a work still under copyright. That year, Republic made a deal with Turner Broadcasting System, authorizing only three airings of the movie, all on cable's TNT and TBS. However, the studio's attempt to reassert control was widely ignored since there were still some existing distribution deals that Republic had to honor.</p><p>In 1994, the studio sold exclusive television rights to NBC. \"We're thrilled that we will have the opportunity to broadcast this picture,\" said NBC Entertainment President Warren Littlefield at the time. \"We will broadcast the original director's cut in black and white, full-length, the way Frank Capra intended this picture to be seen.\"</p><p>NBC traditionally shows it during the holidays after Thanksgiving and on Christmas Eve. Paramount (via parent company Viacom's 1998 acquisition of Republic's then-parent, Spelling Entertainment) once again has distribution rights for the first time since 1955.</p><p>Due to all the above actions, this is one of the few RKO films not controlled by Turner Entertainment/Warner Bros. in the US. It is also one of two Capra films Paramount owns despite not having originally released it—the other is Broadway Bill (originally from Columbia, remade by Paramount as Riding High in 1950).</p><h4>Colorization</h4><p>Director Capra met with Wilson Markle about having Colorization Inc. colorize It's a Wonderful Life based on an enthusiastic response to the colorization of Topper from actor Cary Grant. The company's art director, Brian Holmes, prepared 10 minutes of colorized footage from It's a Wonderful Life for Capra to view, which resulted in Capra signing a contract with Colorization Inc., and his \"enthusiastic agree to pay half the $260,000 cost of colorizing the movie and to share any profits\" and giving \"preliminary approval to making similar color versions of two of his other black-and-white films, Meet John Doe (1941) and Lady for a Day (1933)\".</p><p>However, the film was believed to be in the public domain at the time, and as a result, Markle and Holmes responded by returning Capra's initial investment, eliminating his financial participation, and refusing outright to allow the director to exercise artistic control over the colorization of his films, leading Capra to join in the campaign against the process.</p><p>Three colorized versions have been produced. The first was released by Hal Roach Studios in 1986. The second was authorized and produced by the film's permanent owner, Republic Pictures, in 1989. Both Capra and Stewart took a critical stand on the colorized editions. The Hal Roach color version was re-released in 1989 to VHS via Video Treasures. A third, computer-colorized version was produced by Legend Films in 2007 and has been released on DVD, Blu-ray, and streaming services.</p><br/><h3>Home media</h3><h4>VHS</h4><p>Throughout the 1980s and early 1990s, when the film was still under public domain status, It's a Wonderful Life was released on VHS by a variety of home video companies. Among the companies that released the film on home video before Republic Pictures stepped in were Meda Video (which would later become Media Home Entertainment), Kartes Video Communications (under its Video Film Classics label), GoodTimes Home Video, and Video Treasures (now Anchor Bay Entertainment). After Republic reclaimed the rights to the film, all unofficial VHS copies of the film still in the hands of video distributors were supposed to have been destroyed.</p><p>Artisan Entertainment (under license from Republic) took over home video rights in the mid-1990s. Artisan was later sold to Lions Gate Entertainment, which continued to hold US home video rights until late 2005, when they reverted to Paramount, which also owns video rights throughout Region 4 (Latin America and Australia) and in France. Video rights in the rest of the world are held by different companies; for example, the UK rights were once with Universal Studios, but have since reverted to Paramount.</p><h4>Technological first: CD-ROM</h4><p>In 1993, due in part to the confusion of the ownership and copyright issues, Kinesoft Development, with the support of Republic Pictures, released It's a Wonderful Life as one of the first commercial feature-length films on CD-ROM for the Windows PC (Windows 3.1). Antedating commercial DVDs by several years, it included such features as the ability to follow along with the complete shooting script as the film was playing.</p><p>Given the state of video playback on the PC at the time of its release, It's a Wonderful Life for Windows represented another milestone, as the longest-running video on a computer. Prior to its release, Windows could play back only about 32,000 frames of video, or about 35 minutes at 15 frames per second. Working with Microsoft, Kinesoft was able to enhance the video features of Windows to allow for the complete playback of the entire film—all of this on a PC with a 486SX processor and 8 MB of RAM.</p><p>Computer Gaming World said in April 1994, \"The picture quality still has a way to go before it reaches television standards\", but was \"a noble effort\" that would \"please fans of the film\".</p><h4>DVD and Blu-ray</h4><p>The film has seen multiple DVD releases since the availability of the format. In the autumn of 2001, Republic issued the film twice, once in August, and again with different packaging in September of that same year. On October 31, 2006, Paramount released a newly remastered \"60th Anniversary Edition\". On November 13, 2007, Paramount released a two-disc \"special edition\" DVD of the film that contained both the original theatrical black-and-white version, and a new, third colorized version, produced by Legend Films using the latest colorization technology. On November 3, 2009, Paramount re-released the previous DVD set as a \"Collector's Edition\" and debuted a Blu-ray edition, also containing both versions of the film.</p><h4>Restoration</h4><p>In 2017, the film was restored in 4K resolution, available via streaming services and DCP.</p><h4>4K Ultra HD Blu-ray</h4><p>On October 29, 2019, the film was released for the first time on 4K Ultra HD Blu-ray, along with digital copy featuring a new Dolby Vision transfer.</p><br/><h3>Adaptations in other media</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>needs additional citations for <span>verification</span></b>.<span class=\"hide-when-compact\"> Please help <span class=\"external text\">improve this article</span> by <span>adding citations to reliable sources</span> in this section. Unsourced material may be challenged and removed.</span>  <span class=\"date-container\"><i>(<span class=\"date\">September 2020</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><p>The film was twice adapted for radio in 1947, first on Lux Radio Theater (March 10) and then on the Screen Guild Theater (December 29), then again on the Screen Guild Theater broadcast of March 15, 1951. James Stewart and Donna Reed reprised their roles for all three radio productions. Stewart also starred in the May 8, 1949 radio adaptation presented on the Screen Directors Playhouse.</p><p>A musical stage adaptation of the film, titled A Wonderful Life, was written by Sheldon Harnick and Joe Raposo. This version was first performed at the University of Michigan in 1986, but a planned professional production was stalled by legal wrangling with the estate of Philip Van Doren Stern. It was eventually performed in Washington, DC, by Arena Stage in 1991, and had revivals in the 21st century, including a staged concert version in New York City in 2005 and several productions by regional theatres.</p><p>Another musical stage adaptation of the film, titled It's a Wonderful Life – The Musical, was written by Bruce Greer and Keith Ferguson. This version premiered at the Majestic Theatre, Dallas, Texas, in 1998. It was an annual Christmas show at the theater for five years. It has since been performed at venues all around the United States.</p><p>In July 2019, it was revealed that another stage musical adaptation was in development with music and lyrics by Paul McCartney (making his musical theatre debut), lyrics and book by Lee Hall and produced by Bill Kenwright. The musical was set to debut late 2020, but is still yet to be announced.</p><p>A 1986 skit on Saturday Night Live features William Shatner introducing the \"lost ending\" of It's a Wonderful Life in which George Bailey (Dana Carvey) and the citizens of Bedford Falls discover that Mr. Potter (Jon Lovitz) has stolen George's money and take turns beating him up in his office.</p><p>In 1992, the final episode of Tiny Toon Adventures parodied It's A Wonderful Life entitled \"It's A Wonderful Tiny Toon Christmas\". In it, Buster Bunny feels sad after the failure of his play and wishes he had never become a Tiny Toon, so a guardian angel shows Buster what life would have been like without him.</p><p>The film was also adapted into a play in two acts by James W. Rodgers. It was first performed on December 15, 1993, at Paul Laurence Dunbar High School. The play opens with George Bailey contemplating suicide and then goes back through major moments in his life. Many of the scenes from the movie are only alluded to or mentioned in the play rather than actually dramatized. For example, in the opening scene, Clarence just mentions George having saved his brother Harry after the latter had fallen through the ice.</p><p>It's a Wonderful Life: A Live Radio Play, a stage adaptation presented as a 1940s radio show, was adapted by Joe Landry and has been produced around the United States since 1997. The script is published by Playscripts, Inc.</p><p>In 1997, PBS aired Merry Christmas, George Bailey, taped from a live performance of the 1947 Lux Radio Theatre script at the Pasadena Playhouse. The presentation, which benefited the Elizabeth Glaser Pediatric AIDS Foundation, featured an all-star cast, including Bill Pullman as George, Nathan Lane as Clarence, Martin Landau as Mr. Potter, Penelope Ann Miller as Mary, and Sally Field as Mother Bailey.</p><p>In 2002, the television film It's a Very Merry Muppet Christmas Movie premiered on NBC. The film is a homage to It's a Wonderful Life. In the film, Kermit the Frog wishes that he had never been born.</p><p>Tony Palermo's 2005 stage adaptation has the story presented as actors making a radio-play complete with them making live sounds effects</p><p>Philip Grecian's 2006 radio play based on the film It's a Wonderful Life is a faithful adaptation, now in its third incarnation, that has been performed numerous times by local theatres in Canada.</p><p>The Last Temptation of Clarence Odbody is a 2011 novel written by John Pierson. The novel imagines the future lives of various characters if George had not survived his jump into the river.</p><p>Scenes from the film are seen in the 2016 documentary Abacus: Small Enough to Jail, where Abacus Federal Savings Bank founder and chairman Thomas Sung talked about how It's a Wonderful Life influenced him.</p><p>A stage-adaptation of the story was presented at The Tower Theatre in Winchester in December 2016 by Blue Apple Theatre with Lawrie Morris in the role of George Bailey. This is believed to be the first time an actor with an intellectual disability (Lawrie Morris had Down's Syndrome) has had the role.</p><p>A new \"cinematic audio\" adaptation by David Ossman of the Firesign Theatre was produced and directed by Ossman and his wife Judith Walcutt of Otherworld Media in December 2019 at the Whidbey Island Center for the Arts. Their version combined elements of traditional and radio theatre, with costumes, sets, makeup, and lighting effects, as well as live music, live sound effects, and over 20 microphones.</p><h4>Remakes</h4><ul><li>It Happened One Christmas was a 1977 television movie remake of the classic film, whose screenplay Lionel Chetwynd based on both the original Van Doren Stern short story and the 1946 screenplay. This remake employed gender-reversal, with Marlo Thomas as the protagonist Mary Bailey, Wayne Rogers as George Hatch, and Cloris Leachman as the angel Clara Oddbody. Leachman received her tenth Emmy nomination for this role. In a significant departure from his earlier roles, Orson Welles was cast as Mr. Potter. Following initial positive reviews, the made-for-television film was rebroadcast twice in 1978 and 1979, but has not been shown since on national re-broadcasts or issued to home media.</li><li>Merry Christmas, George Bailey was a 1997 PBS television movie adaptation of the film directed by Matthew Diamond and starring Bill Pullman as George Bailey, Penelope Ann Miller as Mary, Nathan Lane as Clarence and Martin Landau as Potter.</li><li>The Christmas Spirit was a retelling of the movie starring Nicollette Sheridan as Charlotte Hart. This was a made-for-TV film aired on December 1, 2013, on the Hallmark Channel executive produced by Sheridan under her company, Wyke Lane Productions, and Brad Krevoy Television. The film was directed and written by Jack Angelo. Spirit was set in the present day, with the Hart character working to save a \"quiet New England town from a ruthless real estate developer\". The film was planned to kick off a film series about the Hart character. The film had 3.372 million viewers overall.</li><li>\"The Greatest Gift\", the 2011 Warehouse 13 season 3 Christmas episode, tells a similar story after agent Pete Lattimer touches Stern's brush.</li></ul><h4>Sequel</h4><p>In 1990, the made-for-television film Clarence stars Robert Carradine in a new tale of the helpful angel, Clarence Odbody.</p><h4>Potential</h4><p>A purported sequel was in development for a 2015 release, and was to be called It's a Wonderful Life: The Rest of the Story. It was to be written by Bob Farnsworth and Martha Bolton and follow the angel of George Bailey's daughter Zuzu (played once again by Karolyn Grimes), as she teaches Bailey's evil grandson how different the world would have been if he had never been born. Producers were considering directors and hoped to shoot the film with a $25–$35 million budget in Louisiana early in 2014.</p><p>The film had been announced as being produced by Star Partners and Hummingbird Productions, neither of which are affiliated with Paramount, owners of the original film (Farnsworth claimed that It's a Wonderful Life was in the public domain). Later, a Paramount spokesperson claimed that they were not granting permission to make the film; \"To date, these individuals have not obtained any of the necessary rights, and we would take all appropriate steps to protect those rights\", the spokesperson said. As of Christmas 2022, no further developmental plans have since arisen.</p><br/><h3>Sesame Street urban legend</h3><p>It is commonly believed that the characters of Bert and Ernie on Sesame Street were named after Bert the cop and Ernie the cabdriver. However, in a correction for the 1999 \"Annual Xmas Quiz\" in the San Francisco Chronicle, which made this claim, series writer Jerry Juhl confirmed that, per producer Jon Stone, the shared names were merely a coincidence. Despite this, the 1996 holiday special Elmo Saves Christmas references the rumor, during a scene where Bert and Ernie walk by a TV set, which is playing the movie. The pair are surprised by the line: \"Bert! Ernie! What's the matter with you two guys? You were here on my wedding night!\"</p><br/><h3>Stephan's Quintet usage</h3><p>The angelic figures depicted at the beginning of the film is an image of Stephan's Quintet, a group of four interacting galaxies.</p><br/>"
  },
  "errorMessage": ""
}