{
  "imDbId": "tt0052618",
  "title": "Ben-Hur",
  "fullTitle": "Ben-Hur (1959)",
  "type": "Movie",
  "year": "1959",
  "items": [
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw3355127",
      "warningSpoilers": false,
      "date": "15 November 2015",
      "rate": "10",
      "helpful": "182 out of 196 found this helpful.",
      "title": "Epic",
      "content": "When I first saw 'Ben Hur' I was 8 years old and hadn't seen many films, since we were hardly ever allowed to watch television. Imagine what an impact this film had on me (my movie diet had so far consisted of Chaplin and Disney films - which, of course, is not at all a bad thing).The experience was simply mesmerizing. Awe and wonder filled me as I watched this story of shocking betrayal, revenge and forgiveness unfold on screen - and by the time the heart-stopping chariot race was over, my fate as a future movie addict was sealed. Despite its 212 minutes running time, this is storytelling at its finest that knows how to entertain; as we follow Judah Ben-Hur's dramatic journey from Jerusalem to Rome and back again, the film just never lets up and immerses you completely.It's hard to imagine anything more cinematic, especially at the time: if ever there was an epic that was meant to be seen on the big screen in all its bombastic glory, it's Ben Hur. And even now, after I've seen the film many, many times, I feel like this story has a certain sense of greatness to it that is touching (and I don't mean that in a religious sense).My verdict: this film was and is nothing like the many \"sandal and sword\" or bible films of that era; it is (at least to me) the ultimate film epic. With its touching story and fantastic action sequences - which I think hold up amazingly well - Ben Hur is among the milestones of its era and part of film history.Pure cinema and a must see. 10 stars out of 10.Favorite TV-Shows reviewed: imdb.com/list/ls075552387/Favorite films: IMDb.com/list/mkjOKvqlSBs/Lesser-Known Masterpieces: imdb.com/list/ls070242495/Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/"
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw2631110",
      "warningSpoilers": false,
      "date": "22 June 2012",
      "rate": "10",
      "helpful": "18 out of 20 found this helpful.",
      "title": "Film-making on a truly epic scale",
      "content": "What's not to love about BEN-HUR? It's a film that tells an epic story in an epic way, filling every shot with artistry and colour until the screen overflows with splendour. Despite a lengthy running time, the pacing never flags. The episodic structure of the storyline works in the film's favour, ably chronicling the adventures of the titular character as he undergoes a thrilling journey to hell and back.It has Charlton Heston playing his most famous role and being incredibly manly and heroic in it. It has a cast of seasoned performers in support, not least Jack Hawkins as the sympathetic Roman. It has Stephen Boyd as a truly nasty piece of work villain. It has the most spectacular and complex action sequence ever put on film in the shape of the chariot race, which is just as thrilling and breathtaking as it was when it was first released in cinemas back in the day.And, finally, it's a film engages the senses and the emotions. It never forgets, amid all the glory and the epic wonder of the scenery and action, that this is a human story about real people struggling with their lives. There's a message there for any viewer, Christian or otherwise, and that's the reason why BEN-HUR hasn't dated a day since it was first released. It's a true classic for a reason."
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw4023461",
      "warningSpoilers": false,
      "date": "4 January 2018",
      "rate": "10",
      "helpful": "52 out of 64 found this helpful.",
      "title": "The Tale of all Tales...",
      "content": "In the ears and minds of any movie lover, the word \"Ben-Hur\" resonates like the quintessential Hollywood classic oozing respectability in every inch of celluloid but the same respect we owe to an old relic. In our cynical modern world, who would enjoy a pompous-looking big-budget swords-and-sandals religious epic when you have Tarantino and Appatow?I saw \"Ben-Hur\" for the first time in fourth grade, it was part of our history course and being an Asterix buff, I loved watching real-life legionaries, galley slavery not to mention the chariot race, the film also enlightened me on Christianity and on Judaism (when my only religious reference was monotheism number three) and scared the hell out of me with leper. It worked on a cinematic level as much as educational, I guess even in its TV-sized crappy 80's VHS look, we kids enjoyed \"Ben-Hur\" especially the rivalry between Judah (Charlton Heston) and Messala (Stephen Boyd).I never watched \"Ben-Hur\" after that but nor did I have any doubt over its status as a colossal masterpiece. Watching it again a few years ago and then a few days ago, I was surprised by how engraved in my memory \"Ben-Hur\" was, and how the moments that stood out were still having the same effect. When Ben-Hur and Messala meet after many years, I'm always anticipating that first breech in the fortress of their friendship when the young Roman tribune will have one word too many about Ben-Hur's people, taking for granted their friendship and Judah's nobility as marks of submission. The second encounter is even more thrilling because it's like watching a shaking edifice waiting to collapse.It was a nice call from the director Wyler to mark the feud between the two ex-friends at the second encounter, hence putting more gravitas around their relationship, that screenwriter Gore Vidal tried to impregnate with homoerotic subtext. The story is known by movie buffs, Vidal wanted to make the interactions look as the two rivals were former lovers, the subtext works even more when you look at Stephen Boyd's \"enamored\" eyes toward Charlton Heston. But 'Chuck' never knew the trick and was annoyed about it, I guess I prefer the way their hatred epitomize the conflict between Romans and Jews sealing as one of the most memorable rivalries in history of cinema, with the most heart-pounding climactic face-to-face (or should I say wheel-to-wheel).I had positive feelings about \"Gladiator\" but \"Ben-Hur\" is the masterpiece that dwarfs any contemporary masterpiece, a sweeping revenge story that doesn't rely at all on fake CGI and special effects. It took William Wyler's expertise built up in three decades of experience to make \"Ben-Hur\" equal the reference of the time that was Cecil B. De Mille's 1925 version. As a matter of fact, \"Ben-Hur\" has been blockbuster material from the start, ever since Lewis Wallace's best-seller of the late century, it was played on theaters and not with modest budgets. A revenge story, with galley combats, a chariot race and an oblique take on the greatest story ever told, with a hero going from idealism to anger, from revenge to love, all wrapped up in a subtle religious conversion, \"Ben-Hur\" was an instant classic Hollywood couldn't ignore.If 1925 had the race and the thrills, the 1959 one had a bigger scope, bigger budget, the colors, the talking and all the determination of a big studio like MGM to prove a 50's audience that TV wasn't yet the pinnacle of spectacular entertainmnet. When I hear my Dad talking about going to the movies, like \"Ben-Hur\", \"Spartacus\", \"Guns of Navarone\" or \"Taras Boulba\" you would think he went there, inside the screen. And right now, I can't imagine the eyes of people staring at the screen during the chariot race, there comes a moment where you stop watching the moment as a plot element, but as a real race, and it never, never suspends your disbelief, it's like at any new viewing, Messalah can finally win.There are so many classic moments that filled the three-hour-and-half journey that you're never in a state of non-anticipation, when the new inquisitor's parade starts, you keep an eye on that loose roof tile, the one that started the whole chain of events. In the desert, you wait for the 'greatest cameo ever made', in the galleys, the big fight and Ben-Hur rescuing Arrius (Jack Hawkins) and it goes on and on. I must reckon after the chariot race, the film gets a tad too long, but only because you can't just sweep off such a rich epic with a five-minute resolution, and Charlton Heston, in his greatest role, contributed a lot to the everlasting appeal of the film, I don't think he gets the credit he deserved, he brings to his Judah Ben-Hur a dimension of emotional vulnerability that could have been laughable from a lesser actor.Other cast members include Oscar-winning Hugh Griffin enjoying his role as Arab sheikh and Judah's mentor, Israeli actress Haya Harareet as Esther, Martha Scott and Cathy O'Donnell as Judah's mother and sister... the film is served by a solid cast, editing, directing, having swept off all the major Oscar by breaking the record of 11 wins, only to be matched in 1997 with \"Titanic\" and \"The Return of the King\" and oddly enough, these titles could somewhat apply to \"Ben-Hur\". I haven't seen the 'original' and I'm in no hurry for the remake, but I don't get I'll be in a minority if I say that this is the ultimate version. I didn't see it many times in my life but it's always present in my memories as if it wasn't about the number of times you watch it but the intensity of each experience. And let's not forget the name of the director: William Wyler who outdid himself by making his masterpiece, which is saying a lot, given his previous streaks.\"Ben-Hur\": A Christ Tale, a tale of vengeance, in fact a tale of all tales..."
    },
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw3199566",
      "warningSpoilers": false,
      "date": "10 March 2015",
      "rate": "10",
      "helpful": "69 out of 89 found this helpful.",
      "title": "pretty much sets the bar for epic entertainment",
      "content": "We are by nature a cynical and critical group.With the attention span of a bumblebee, moreso the current generation than the earlier ones, because of exposure to mobile devices and other modern disposable non-repairable tech.It is probably for that reason that epics like this one have become forgotten over time. Even the late CH has become more a societal joke and less of an icon over time. Michael Moore made Heston's participation in the NRA a joke. (If Heston's concerns over where society is headed prove to be true, the final joke may be on Moore.) Back to the film. It is almost perfect. Then, as now. The script continually builds. Modern writers could learn from that. No matter what is presently on screen as you watch, the inevitability of the final climax beckons.The acting is perfect.The mixture of myth and drama is perfect.True the Roman dialog did not benefit from the verbal tricks that Stephen McKnight used in Spartacus (bending the script to match the flow of actual Roman) but it is more than enough to entertain and entrance.From the \"accident\" early in the film which starts the flow of events, to the chariot race WHICH HAS NEVER BEEN EQUALLED IN THE HISTORY OF FILM, to the reunion with lost family at the end, this is one of the most powerful and entertaining films of all time"
    },
    {
      "username": "lambiepie-2",
      "userUrl": "https://www.imdb.com/user/ur0874373",
      "reviewLink": "https://www.imdb.com/review/rw0067231",
      "warningSpoilers": true,
      "date": "20 April 2003",
      "rate": "10",
      "helpful": "58 out of 75 found this helpful.",
      "title": "One of the Top Five Films of All Time!",
      "content": "Anyone want to know how to make a darned good EPIC remake? Then this is the film to see.William Wyler made an epic, a film that is exciting, violent, heartfelt film. Make no mistake, it is the story of two childhood friends, one gets drunk with power and the other who was a Jewish Prince gets thrown into a life of hardship though his boyhood 'friend'. But he has faith and keeps on going. The ultimate battle to beat all battles, to settle the score...is at the Chariot race and that is a sight to behold.Films like Ben-Hur will NEVER get greenlighted today and if it did, too much CGI and not enough of what Director Wyler and old Hollywood was good at. The actors, well, they are to die for. Excellent acting. And let me share with you my favorite part...(tee-hee) when Pilate holds up his hankerchief to start the chariot race, plays with the racers and audience - he's very smug ya know..then the WAY he finally drops it. Who couldn't tell how he'd eventually turn out, hmmmmmmm?There is nothing more I can add that others have said. This film is near and dear to me and for my vote -- is one of the top five films of all time. I never tire of watching this film, I find something new in it every time, its done that well.This is an epic remake, something else that Hollywood has trouble doing -- to remake a film on this scale that finds new audiences year after year, after year. Brilliant, wonderful, every bit of it. A must, must see. Just plain excellent!"
    },
    {
      "username": "filipemanuelneto",
      "userUrl": "https://www.imdb.com/user/ur53053227",
      "reviewLink": "https://www.imdb.com/review/rw3650853",
      "warningSpoilers": false,
      "date": "1 March 2017",
      "rate": "10",
      "helpful": "21 out of 26 found this helpful.",
      "title": "Wonderfully epic.",
      "content": "Some movies are so good that they just haven't age. They are timeless, like any work of art. This is one of those movies, perhaps one of the best movies ever and surely one of the biggest and most epic biblical movies ever made. The story is based on a novel by Lew Wallace (which I have read and I have at home) and is so famous that it doesn't allow spoils: the injustice committed against Judah Ben-Hur and his path of revenge, deeply linked to the life and death of Jesus, a latent and ever palpable subplot, even when it does not arise. Epic in every detail, the film features scenarios and costumes carefully crafted in the style of Imperial Rome. Some sequences are truly anthological, as is the case with the chariot race. The representation of the Roman legionaries influenced for decades the conception that we have, individually, on how they were and fought. The visual and special effects used in the film were the best there was at the time and even today, more than half a century later, they're able to surprise by the realism. The color is vivid and intense, cinematography is truly imposing and accentuates the epic ambiance. As for the cast's work, it's definitely the movie of Charlton Heston's life. He not only became famous with it but made here the most remarkable character of his career. Steven Boyd, Jack Hawkins, Haya Harareet, Martha Scott and Hugh Griffith also shone. It's a long movie, but the audience gets so caught up in it that they don't even feel the time go by. Wonderful!"
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1855979",
      "warningSpoilers": false,
      "date": "11 April 2008",
      "rate": "10",
      "helpful": "12 out of 15 found this helpful.",
      "title": "still a gigantic achievement in epic film-making",
      "content": "What distinguishes Ben-Hur as a powerful film in epic scope is not simply that it is shot and stylized and acted and executed in action sequences to iconic effect (though there is that to a degree), but that it's human dimensions stay intimate in scope. I was expecting what I had heard about with Ben-Hur, and got that- the vengeance plot, the chariot race, a story of redemption with Christ as a background figure and major presence- but I wasn't expecting such things revealed like the devastation left on a family by leprosy, and the disintegration of one's morality by the cloud of vengeance on one's mind. Even if you're not much of a Christian (and even as a non-practicing Jew as I am), there are some deep chords that are struck with the material for an audience that is going in not expecting a lot of sermonizing. Only in the final reels, as we see first-hand the 'Christ' as he is sent to die on the cross, does the film get overbearing with the symbolism and heavy weight of the circumstance of this being a \"tale of the Christ.\"This isn't to say also that with Judah Ben-Hur having the strife in coming to terms with his family being at first, he thinks, dead, and then later as made deformed thanks to the Roman's imprisonment, that this is all the film is. It's also grand spectacle, a film that takes you along on its epic ride with imagery that pierced the public consciousness so strongly that you've seen the scenes as parodies or referenced before you've even seen the film. Surely we have the chariot race to contend with, which has been so influential on modern action sequences and chases that Lucas copied most of the choreography for the pod race in Phantom Menace. And to give credit where it's due, you could show that same sequence in any theater today and it would unquestionably bring down the house, not just for its technical achievement but for the visceral impact (i.e. the downfall of Ben-Hur's rival by his own undoing).But there's also other great images; possibly my favorite are the scenes with Judah Ben-Hur as #41 among the rowing slaves, all moving at the whim of the drum beat. That in and of itself would make Ben-Hur a must-see. But then there are more emotionally impactive places and settings, like the valley of the lepers, Judah's struggle across the desert (and the tastefully done angle of Jesus' back only), many others that would take too long to mention. It's all so massive a production that it's almost TOO big (according to Charlton Heston the budget, at 14 million then as the most expensive film ever made, would today cost something like 250 million), and it's a credit to William Wyler that he never makes it too dull, even as supporting characters may verge on leaning to overacting. With only calling attention to it at certain moments (and sometimes not at all with a more subtle effect), Wyler is a virtuoso here in corralling all aspects of the production under his firm handle.And then there's Heston, who gives one of the very best of his (now late) career. He's full of bravura and gusto, and seems like a guy- for those guys who crave action film stars- who can get things done in the right mindset. But he's also excellent at conveying the tragedy of this character, a very good man with high ideals who becomes corrupted by his need to get his respite. Underneath all of that machismo and the swagger that eventually became old hat for Heston, is a strong presence at the helm of Ben-Hur. Stephen Boyd, too, is also very good as the boyhood friend turned rival. In fact, most of the actors here are very good, from Hawkins to Hazareet to Jaffe to O'Donnel and so on, as they all contribute to the epic scope. It's massive and directly concerning the efforts of then Rabbi from Nazareth to bring peace and love to humanity. Despite it being not-too-thinly veiled religious fable (and not without a couple of things noticeable as parody in Life of Brian), Ben-Hur is a great success for its time, surviving today in good, not-too-dated tact."
    },
    {
      "username": "SimonJack",
      "userUrl": "https://www.imdb.com/user/ur17816293",
      "reviewLink": "https://www.imdb.com/review/rw8099542",
      "warningSpoilers": false,
      "date": "29 April 2022",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "One of the greatest films of all time",
      "content": "\"Ben-Hur\" is the lavish and classic 1959 film by MGM that is based on an 1880 novel by Lew Wallace, \"Ben-Hur: A Tale of the Christ.\" It is a remake of MGM's 1925 silent film that had the full title of the novel. The story is a fictional adventure set in the time of Christ. The religious aspect is toned down and subtly built into this adaptation of Wallace's story, beginning with an opening scene of the nativity.The film plot centers around the family of Judah Ben-Hur during the time the Roman Empire occupied Israel. The main characters are Judah and Messala. The latter is a Roman soldier who grew up as a boyhood friend of Judah. The Ben-Hurs were a wealthy family with a trade business. Now, in adult times the two men become enemies - until Judah's interior conversion. That occurs after chance encounters with a mysterious man. He later learns that this is Jesus of Nazareth, whom Esther and some others think may be the promised Messiah.The film has a great cast of the day. Charlton Heston gives an Oscar-winning performance as Judah Ben-Hur. And Hugh Griffith won best supporting actor for his role of Sheik Ilderim. All of the cast excel - Jack Hawkins as Quintus Arrius, Stephen Boyd as Messala, Martha Scott as Miriam, Sam Jaffe as Simonides, Frank Thring as Pontius Pilate, and more. In its day, this film was the most expensive movie ever made, at just over $15 million. But its box office was nearly 10 times that amount. \"Ben-Hur\" was the first film to win 11 Oscars at the Academy Awards. Only two more films have accomplished that since then. They are \"Titanic\" of 1997 and \"The Lord of the Rings: The Return of the King\" of 2003.From the time MGM first announced it would remake the film in color, it took several years to get it done. It went through a number of planned casting changes, and screenplays and rewrites. If for nothing else, this movie likely always will be known for its spectacular chariot race. It took nearly a year just to plan the race, acquire the horses, build the chariots, and train and practice for the race.At 18 acres, the race arena was the largest film set ever made to that time. It took 1,000 men a year to make the track in a rock quarry. That was done so it would look real -- like the historic circus that had been in Jerusalem. It took more than 40,000 tons of sand from the Mediterranean to cover the race track. Numerous other aspects made the chariot race so unique and unlikely ever to be repeated for real. Charlton Heston was an accomplished rider and horse handler already. But when he got to Rome he took daily three-hour lessons in chariot driving. He had special contact lenses to protect his eyes from injury by the dirt kicked up by the horses.The chariot race is an historic feature of this film. It's not likely that modern moviemakers would ever again go to such lengths to have and film such a realistic race. Just look at the 2016 revised \"Ben-Hur\" film with its heavy use of CGI. The crash scenes in that chariot race are almost laughable.This tremendous film was greatly condensed and adapted from a novel of more than 500 pages. And, the story of the book author himself, is fascinating. Lewis Wallace (1827-1905) was a man of many talents and careers. He was a soldier, a lawyer, a politician and a diplomat. His writing career overlapped all of these. Wallace served in the Mexican-American War and fought in the American Civil War. He commanded an Indiana regiment of the Union Army and took part in several battles. He later rose to the rank of Maj. General. He served nearly four years as governor of the New Mexico Territory (1878-1881). And he was U. S. minister to the Ottoman Empire from 1881 to 1885. After that he retired to continue his writing career which began with publication of his first book in 1873, \"The Fair God.\"Wallace wrote his adventure novel, \"Ben-Hur: A Tale of the Christ,\" as a story of revenge and redemption. He worked on it for several years during his military postings. When it was published in 1880, the book made Wallace famous and wealthy. It was translated into seven languages and became popular around the world. It sold more than 400,000 copies in less than a decade. By 1900, it had become the best-selling American novel of the 19th century.This is an epic film with a message that is subtly delivered in a most entertaining package. The actors all show the right amounts of various emotions throughout. The sets and settings, and filming and color are superb in all respects. Audiences should enjoy this film for generations to come."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1211429",
      "warningSpoilers": false,
      "date": "8 November 2005",
      "rate": "10",
      "helpful": "148 out of 258 found this helpful.",
      "title": "Deserved All The Honors",
      "content": "Wow, what can you say about a film that won 11 Academy Awards back in the days where the best films actually were honored, not the garbage they salute today.In other words, this film lives up to its reputation and has to be ranked as one of the most memorable movies of all time. Nobody who ever saw this film ever forgot the chariot race, for instance, perhaps the greatest action scene filmed without special effects. This can be a very sad film as well. I doubt if I've ever watched this without a few tears in my eyes at certain points. The scenes with hero's mother and sister suffering with leprosy are still some of the most heart-wrenching scenes I've ever witnessed on film. They can just tear you apart. The combination of drama, action and romance, along with very involving storyline is aided by an incredible soundtrack, once again one of the best ever put on film. The more one hears this music, the more was is moved by it. To fully appreciate the cinematography in this film I recommend you purchase the recently-released 4-disc DVD special edition which also includes the first rendition of this story, the silent movie \"Ben-Hur: A Tale Of The Christ.\" That was name of the book, by the way, the second part of the title being left off the 1959 movie as Hollywood slowly began deemphasizing Christianity in films. However, there is a reverence for Jesus Christ in this film, which should be there since it's a key element of the storyline, even though most folks forget that.In summary, this is about as good an example as ever found of what is labeled an \"epic\" movie. It's an incredible story transferred memorably on screen."
    },
    {
      "username": "ironhorse_iv",
      "userUrl": "https://www.imdb.com/user/ur34049683",
      "reviewLink": "https://www.imdb.com/review/rw3688381",
      "warningSpoilers": true,
      "date": "18 April 2017",
      "rate": "9",
      "helpful": "23 out of 32 found this helpful.",
      "title": "OMG! Ben-Hur is one of the best movies ever made. It's a sweet chariot. That's worth the ride.",
      "content": "Winner of 11 Academy Awards in 1959, including Best Picture, Best Director, Best Actor, and Best Supporting Actor. 'Ben-Hur' remains one of the most inspirational, epic action spectacles ever made by a major Hollywood studio. It was a landmark achievement in grand peplum/biblical genre storytelling. Directed by William Wyler, the film tells the story of a kind, wealthy Jew, Judah Ben-Hur (Charlton Heston) whose life is thrown upside down, when he is betrayed and falsely accused of crimes against the Roman Empire by his childhood friend, turn tribune Messala (Stephen Boyd). Spending three years as a galley slave, Judah must find, a way to restore himself to high standing and while, also seeking revenge on his enemies. Without spoiling the movie, too much, while everybody thinks that this movie was the original; it was in fact, the third movie, follow after 1907 & 1925 of the same name to be made from Lew Wallace's successful novel, 1880's 'Ben-Hur: A Tale of The Christ'. It can be argued that a talking picture made from the same story as an earlier silent film is not a true remake, since the storytelling techniques each employ are so radically different, but that's up to debate, but at least, it's more original than the later films that came after it, like the 2003's animation version & the 2016 remake. Anyways, like the book, the movie also has a sub-story running in parallel with Judah's main event narrative; which was the unfolding story of Jesus. While, Jesus does play a more important role in this story more than other films, his cameo presence is still somewhat tangential. It's jarring to see a violent revenge plot, mixed his story about love thy neighbor. Thank God, the film cut the sequences of Ben-Hur faking his death, and raising a Jewish army to overthrow the Romans, as it felt that Christ's message of forgiveness, could be lost. Still, 'Ben-Hur' is the only Hollywood film to make the Vatican approved film list in the category of religion, despite having scenes of him killing an innocent guard. However, the film does have other problems than the mixed messages, it was presenting. The book and the films have always been accuse of being too similar to the book, 'The Count of Monte Cristo\" by author Alexandre Dumas to the point that some critics have stated out that the film is 'The Count of Monte Cristo meets Quo Vadis'. While, me, personal, I don't see much of anything comparable; some critics says, the film is ripping off, that premise, way too much. Regardless, I did like the changes by the many screenwriters, did, to couther, being too similar to the novel, like having Messala's vindictiveness be motivated by a sexual and romantic rejection as much as a political one. I'm one of the few people that, kinda like the somewhat hidden homoerotic overtones between Judah and Messala. I also love how Heston didn't know about this; adding an interesting uncomfortable dynamic to the tense dialogue scenes between the two actors. It adds some spice and realism that was really needed for this period film. I also like how the film, add symbolism to the ocean scenes and also cut other things, like the character of Ira from the novel. I always felt that the scenes with her, was time-wasting. On top of that, the other changes like having Judah's sister being the one who dislodge the roof tile & how they treat Messala after the climatic chariot race were equally as important. However, the movie still have pacing issues. 212 minutes running time is way too long. While, I get why, the soul-stirring scenes of Christ's birth and crucifixion was needed, as it provide biblical bookends for MGM's action-packed epic. I think the outdated, theatrical overture & intermission sequence should had been delete in future releases. If anything, scenes like Judah declines the race at times, even after he learns that Messala will also compete, could had been delete as well, as the famous chariot race sequence did happen, later on the film, regardless of Judah wanting to do it or not. It felt like filler. Despite that, the climactic chariot race, which includes collisions, men dragged under chariots, bloody injuries, and intensely suspenseful competition, was so impressive in the stunt work & make up that it set new standards for action-filmmaking without modern cinematic razzle-dazzle. It was very surprising to hear that nobody got kill or seriously hurt. The colorful 1959 version was the most expensive film ever made up to its time, and the most expensive film of the 50s decade. Shot on the grand scale of $15 million, the film took six years to prepare, and over a half year in production, it was a tremendous make-or-break risk for MGM Studios. Luckily, for them, the project, ultimately saved the studio from bankruptcy as it became a box office hit, earning three times more than it took to make. Does it hold up? Yes, while it's slow at times, and some of the acting feels now, mannered, stiff, and awkward like Hugh Griffith in blackface. It still worth the praise and achievements, it got, when it first released. It still has great acting from all the cast, including more physically than emotionally compelling Heston, amazing color widescreen cinematography from Robert Surtees, beautiful music from composter Miklós Rózsa & wonderful costumes from Elizabeth Haffenden and her crew. However, this movie might be too intense to be rated G, even at the time. After all, this movie has a leper colony where two principles characters are shown with open, rotting sores and a few men drowning in the ocean battle. If anything, it could be rated PG or PG-13 now. Regardless of that, I have say, Ben-Hur is one of the ultimate epics movies of all time. A legendary movie that needs to be rewatch, time after time again. Highly recommended."
    },
    {
      "username": "CubsandCulture",
      "userUrl": "https://www.imdb.com/user/ur83822756",
      "reviewLink": "https://www.imdb.com/review/rw4438152",
      "warningSpoilers": false,
      "date": "4 November 2018",
      "rate": "10",
      "helpful": "27 out of 38 found this helpful.",
      "title": "Human Drama, Grand Spectacle, Moving Divinity",
      "content": "This film is so much more than the chariot race. Undoubtedly, that is the most famous sequence and for good reason. It is stunning, electric, tense and the so very exciting. There is nothing like simply seeing a chariot race unfold by actually filming a group a chariots. But the sequence is filled with meaning because the film spends so much time building up the personal relationship between Judah and Messala; their hatred for each other displayed in the chariot race is alive and bitter. Because we have seen them expressing deep kinship and spiritual love.There is a famous dispute between Wyler and Vidal about how much of the Judah-Messala relationship was intended to have a subtext of a gay jilted lovers. I think to dwell on that is to sort of miss the point. While it it is really easy to read an erotic love (especially on Messala's part) between the two it is clear that spiritual love is present in anycase. The erotic element is present if one cares to look but it is not needed. There is clearly an emotional intimacy between the two. This intimacy gets soured by politics. The story is richer, deeper and more personal as a result.Richer is a good word for this movie. It is nearly 4 hours long but it is a fully fleshed out epic that engages the entire time. I rather enjoyed how the Christian themes are restrained-You never see Christ's face, you only hear what he says second hand etc.-it makes the film feel about Jesus of Nazareth and not necessarily Jesus Christ. I feel like it makes the film more accessible to nonChristians while Christians can infer what the wish. Biblical epics can often be very stuffy and overwrought. Wyler's use of deep focus really gives the film a feel of intimate epicness. The scope is grand; the focus personal,Wyler was a very good filmmaker; this is something of a departure for him. Nonetheless this film is still the work of a master."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1343144",
      "warningSpoilers": false,
      "date": "16 April 2006",
      "rate": "10",
      "helpful": "27 out of 42 found this helpful.",
      "title": "A \"Real\" Character",
      "content": "General Lew Wallace, a somewhat controversial commander of the Union forces in the Civil War happened to be on a train with Robert Ingersoll, noted atheist in the 19th century. Wallace was a moderately religious man and attempted to debate Ingersoll. The story has it that Ingersoll whipped him to a frazzle and Wallace knew it. But he resolved to study the Bible and learn about his faith so that he would be better prepared.He never got to debate Ingersoll again, but Wallace got so immersed in religion that he decided to put that knowledge to use. While he was Territorial Governor of New Mexico and while he wasn't dealing with the Lincoln County War and the hunting down of Billy the Kid, he spent his spare time creating what became the widest selling work of fiction in his century, Ben-Hur, A Tale of the Christ.He did his research well. Judah Ben-Hur and his mother and sister are descended from a very ancient family of Hebrew nobility. The founder of this house was Hur who in the Bible was the husband of Miriam who was Moses's sister. Hur pops up as a peripheral character during the whole story of the Exodus. He invested the characters that Charlton Heston, Martha Scott, and Cathy O'Donnell play with a heroic lineage which makes their fall all the more tragic.So on the consciousness of the public were the Hur family that one often thinks of them as real people. Case in point, many years ago a teacher of mine wanted to demonstrate how many true characters Charlton Heston played on the screen. I count 15 in his list of credits on IMDb, some he's played in more than one film or television show. Inevitably more than just one person named Ben-Hur as a real character. A tribute to the timelessness of the character and to Charlton Heston's abilities as actor.The story is that Heston and his family greet an old friend newly arrived back in Judea province, Messala who is now a tribune. Messala played by Stephen Boyd, is one ambitious fellow and he wants Heston to rat out potential leaders of rebellion in this most unruly of Roman provinces. Heston refuses.The next day Boyd frames an incident where a piece of old tile accidentally falls from the Hur family home while the new Judean governor is passing by into an assassination attempt. Scott and O'Donnell are thrown in prison and Heston is sentenced to the galleys. The story is then Ben-Hur's adventures in trying to get back to Judea and set things right.Ben-Hur meets a whole host of people who aid him in his endeavor. Jack Hawkins as a commander of the galley fleet he's serving on, Finlay Currie as Balthazar one of the Three Wise Men now seeking the child whose birth he witnessed in the year Anno Domini, Hugh Griffith as Sheik Ilderim whose horses Ben-Hur races.It's not often mentioned, but among the Oscars collected for this most honored film, besides the ones that the film itself, Wyler, and Heston won, was Hugh Griffith's for Best Supporting Actor. His Arab sheik is a blustering, but very wise and compassionate fellow. The events of this film are taking place some six centuries before the Prophet Mohammed arrived on the scene. The Arab people at that time were involved in a hedonistic animist kind of religion, but it's left up in the air that they might turn Christian. Certainly some of them did and some are Christian to this day as the country of Lebanon attests.Griffith had the wildest pair of eyes in film history next to Jack Elam's and he used them to great effect. Watch his expressions during the film, they're what got him the Oscar.Stephen Boyd also got rave notices for the evil Messala. When he's not stepping on people to move up in Roman politics, Messala likes to race chariots. During his odyssey Ben-Hur becomes a charioteer and the climax of the film is the thrilling chariot race that turns into a race for survival. You'll see in the film, Messala doesn't exactly play by Marquis of Queensbury rules for charioteers. Boyd did some leads after Ben-Hur, but never really took as a hero. But he was one grand villain.While Ben-Hur is a prisoner being led to the galleys the Roman prison convoy stops in a town called Nazareth and a carpenter faces down a Roman guard to give the thirsting Ben-Hur a drink of water. The two men go their separate ways, Ben-Hur's is described in the book by Lew Wallace, the carpenter's way in the first four books of the New Testament. Later on after Ben-Hur discovers his mother and sister and what's become of them, they hear about Jesus of Nazareth, a rabbi with a message of hope and reputation for miracles. Of course when they seek Jesus it's when He's just been tried and condemned and on the way to the cross. It's now Ben-Hur's turn to offer the carpenter a drink of water on the way, to show his trust and faith. And as the sky darkens and Jesus breathes his last, the film depicts what the New Testament describes as the blackest day in Earth's history. But even at that point Heston's new found faith is rewarded, a miracle at the point of death. What was the miracle, for that you buy the DVD or wait until Ben-Hur is on television.Ben-Hur should really be seen in a theater, even a letter box version doesn't do justice to the chariot race or the sea battle with pirates.Ben-Hur is the story of two paths, one of vengeance and one of faith. Our protagonist tries his way and in the end realizes the path of faith is the more rewarding."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1556179",
      "warningSpoilers": true,
      "date": "28 December 2006",
      "rate": "10",
      "helpful": "17 out of 25 found this helpful.",
      "title": "If you're going to watch one Biblical epic, this is the one",
      "content": "It's odd, but during the 1950s, Hollywood made a huge number of Biblical epics--most of which were pretty wretched films. SAMSON AND DELILAH and David AND BATHSHEBA quickly come to mind, but even the more respected TEN COMMANDMENTS was, despite all the hype, a pretty lousy film--with cardboard characters and silly writing. Even QUO VADIS was a pretty uninspired film, despite the violent nature of the film. So, in light of this, I am so happy to say that a Biblical epic CAN be exceptional and worth seeing!What makes BEN-HUR so worth while? Well, of course the film does contain some of the very greatest (if not the greatest) action scenes of all-time. You just can't do better than the unbelievable chariot race sequence for excitement and spectacle. Even the naval battle scene is great despite it being filmed with large models--it's state of the art for the time it was made. In addition to the spectacle, it also handles the religious aspects of the film in a less heavy-handed manner than most of its contemporaries. You do see Jesus from behind throughout the film and you do not hear him speak--instead, the film focuses on Jesus' teachings on others. And, while they do not show the resurrection, you are not left with the impression that he stayed dead like the 1925 version--a definite No-No for a Biblical film!Now as for the acting, it was generally exceptional--especially from Steven Boyd, Jack Hawkins and Hugh Griffith. I also liked Charlton Heston in the title role, but I could see how some might see this performance as a bit more wooden. Also, there are times (especially at the very beginning and end) where the pacing is just too slow. However, given the exceptional nature of the film on every other level, this can easily be forgiven and the film is a truly magnificent work--not to be missed by any true fan of film."
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0067160",
      "warningSpoilers": false,
      "date": "15 March 2001",
      "rate": "",
      "helpful": "134 out of 227 found this helpful.",
      "title": "Stunning Film That Was Worthy of 11 Oscars",
      "content": "\"Ben-Hur\" is a dominant Best Picture Oscar winner that is perhaps more impressive now than it was when it was first released in 1959. Charlton Heston (Oscar-winning) stars as a rich Jewish nobleman during the time of Jesus Christ who is turned into a slave by the Romans after a freak accident. Now he is manning an oar in a ship's galley and his family is imprisoned. Years pass and now Heston is after the former childhood friend (Stephen Boyd), a Roman, that turned against him. The 17 minutes of footage for the chariot race is some of the best during the history of the cinema. Hugh Griffith won a Best Supporting Actor Oscar and William Wyler won his third and final Best Director Oscar. A monumental film that is great in every cinematic category known to man. 5 stars out of 5."
    },
    {
      "username": "The-Sarkologist",
      "userUrl": "https://www.imdb.com/user/ur27175177",
      "reviewLink": "https://www.imdb.com/review/rw2503131",
      "warningSpoilers": true,
      "date": "14 October 2011",
      "rate": "10",
      "helpful": "11 out of 14 found this helpful.",
      "title": "Deserves every single Oscar that it won (and more)",
      "content": "Simply put this movie deserves each and every Oscar that it won, and more. One wonders whether, if it was put to the Oscars today whether it would have easily wiped the floor with Titanic, but that is beside the point, Ben Hur is one of the best movies that I have ever seen.The subtitle of this movie is 'a story about the Christ' and as you watch this movie it becomes quite clear how this is so. To put it better, it is a movie about the Christ as seen through the eyes of Judah Ben Hur. Ben Hur (Charlton Heston) is a Jewish noble who is torn between his loyalties to his people and his duty to Rome. Every time he is faced with that choice, he chooses his people, and in doing so tends to make enemies of Rome. His first enemy is Masala, a Roman diplomat in Jerusalem, and when his sister accidentally knocks a roof tile onto a Roman dignitary, he is arrested and sold as a slave. While traveling through the desert on his way to Ceserea to be put onto a slave galley he meets a man in the wilderness who gives him water.However, to cut a very long story short, he saves the captains life during a battle with pirates, and is made a freeman. He then returns to Jerusalem where he confronts Masala in the famous chariot race, and wins. However, he discovers that his family have been outcast as lepers and rages against Rome. But this rage is tempered through the teachings of Christ, and the movie concludes with him sitting at the foot of the cross watching Jesus die.Water plays a significant role in this movie. Christ gives him water in the desert which enables him to survive. His life is again saved when he is on the water after the slave master frees him from his chains. When he watches Christ go to the cross, he attempts to return the favour by giving him water, and when Christ dies, rain falls from the heavens in a ferocious storm.Ben Hur is about the rage that overwhelms us, and the freedom that Christ gives us from this rage. Ben Hur is torn by betrayal. He was betrayed by Masala when he was sold as a slave, and he was betrayed by Rome when his mother and sister where thrown into the leper colonies. He is further betrayed by Rome when he takes his mother and sister to see Christ only to find that he has been sentenced to death.I wish to finish with a discussion on how Christ is portrayed in this movie. You never see his face and you never hear him speak. We always see him at a distance, or from behind. His words do not come directly from him, but are passed on by his faithful followers. However, it is the words about not seeking revenge that take the center stage in Ben Hur because it is Ben Hur's desire for revenge that is destroying him. He is a friend of Rome, but he is in danger of alienating them once again through his love for the family that he has lost."
    },
    {
      "username": "safenoe",
      "userUrl": "https://www.imdb.com/user/ur34307814",
      "reviewLink": "https://www.imdb.com/review/rw3434048",
      "warningSpoilers": true,
      "date": "19 March 2016",
      "rate": "10",
      "helpful": "11 out of 15 found this helpful.",
      "title": "Claude Heater (who played Jesus Christ) - one of the last surviving main actors of Ben-Hur",
      "content": "Along with Haya Harareet, I think Claude Heater is one of the last of the surviving main cast members from Ben-Hur (1959). Quite symbolic in a way given Mr Heater's moving performance as Jesus Christ in the movie. When I saw Ben-Hur at a church gathering night a few years ago, the Pastor(who was quite conservative) told us that even though Ben-Hur is a \"Hollywood\" movie, it's the one that probably came closest to honoring and glorifying the Son of God. In Ben-Hur you never see the face of Jesus Christ, and that was a deliberate choice by the director. But Claude Heater gives the emotional gravitas required for the role.Ben-Hur is a movie that stands the test of time. No wonder we say \"It's bigger than Ben-Hur\" to describe something spectacular. Ben-Hur is an epic, it's spectacular, and it's moving."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2366057",
      "warningSpoilers": false,
      "date": "8 January 2011",
      "rate": "10",
      "helpful": "15 out of 23 found this helpful.",
      "title": "Amazing epic",
      "content": "Simply one of the best epics on film. It is long, but with everything so good I was never bored even in the talky and more leisurely parts. The film looks wonderful, the sets are beautiful, the costumes are nice and the cinematography is excellent, and Miklos Rosza's rousing score is one of his best. William Wyler's direction is superb, and the story is engrossing complete with a fine script and solid pacing. As for effective scenes, I cannot stress how riveting the chariot racing climax is, no wonder it is one of cinema's iconic moments. The acting is also fine, Charlton Heston of course is excellent and the supporting cast including Stephen Boyd and Finlay Currie(Magwitch in David Lean's Great Expectations) solidly support him. Overall, this is how an epic should be made. 10/10 Bethany Cox"
    },
    {
      "username": "lasttimeisaw",
      "userUrl": "https://www.imdb.com/user/ur3967726",
      "reviewLink": "https://www.imdb.com/review/rw3589079",
      "warningSpoilers": false,
      "date": "30 November 2016",
      "rate": "8",
      "helpful": "13 out of 19 found this helpful.",
      "title": "the apotheosis of mainstream studio production in Hollywood's Golden Era",
      "content": "The newest iteration of BEN-HUR (2016) made by schlockmeister Timur Bekmambetov crashed and burned in the box-office front, which prompts my belated viewing of this grandiose historical epic under the supervision of William Wyler, the film won him a third Oscar for directing and swept with 11 wins out of its total 12 nominations (only Karl Tunberg lost BEST ADAPTED SCREENPLAY to Jack Clayton's ROOM AT THE TOP).Adapted from Lew Wallace's 1880 novel, BEN-HUR: A TALE OF THE Christ, this Hollywood juggernaut opens with the birth of Jesus Christ, jand condones quite a chunk of time in padding out the Calvary crucification after the iconic chariot racing money shot (which partially explains its drawn-out length, running up to 212 minutes), vehemently gets its feet wet as a Christianity- moralizing tale by casting J.C. as the Messiah who literally saves our hero Judas Ben-Hur (Heston) from perishing during his trials and tribulations, and jumps the shark in its miraculous ending, gratifyingly throws humankind's fate under the omnipresence's whims, which gives a staid aftertaste. The main plot is of course, about Judas, a wealthy Jewish prince in Jerusalem, AD 26, falls foul of his childhood friend, now a Roman tribune, Messala (Boyd), who swears allegiance to the Roman Empire, and fails to rope the freedom-advocating Judas into joining his side. Under Messala's cunning malfeasance out of a mere accident, Judas is sentenced to toil in the galleys whilst his mother Miriam (Scott) and sister Tirzah (O'Connell) are cooped up in prison. Revenge is the mainspring behind Judas' odyssey from a galley slave to an heir of the childless Roman Consul Quintus Arrius (Hawkins), it is hatred that keeps his head above water against adversity, alert to a golden window to enact his exit strategy and he even magnanimously hatches a son-father rapport with the tyrannical Arrius. This is the thorny knot in the otherwise rather Manichaean racial feud depicted in the story, how far one can go to love your enemy? Which remains a quintessential challenge for those who endorse Christianity, and the film could have delved deeper into Judas' psyche on that issue, yet, Arrius wholly disappears from the narrative after the mid-stream, and he merely functions as a springboard to Judas' glorious homecoming with his rehabilitation, reunion and rediscovery. At the end of the day, justice belatedly prevails, but Judas still gets all shaken up in the aftermath, revenge might keep him alive but it is religion that gives him the ultimate peace.For what it's worth, BEN-HUR's visual spectacle still holds water to an awe-inspiring amazement and thrill, it is a historic accomplishment not just because of its cutting-edge technicalities but also for the staggering manpower it strenuously deploys, the film itself is a panegyric of human's creativity, which is something no dissenter can take away. Romans are played by a crop of top-notch British thespians, whilst Jews are mostly impersonated by Americans, although how come Hugh Griffith's ludicrously swarthy portrayal of the Arabic Sheik can walk off with that Oscar statute still eludes me, he is not even the top-pick among the supporting cast in the film, both Hawkins and Boyd can easily upstage him with their more engaging agent and emotive bravura, especially the latter, truly deserves at least an Oscar nomination which usurped by Griffith. That is not to say, Heston wins his Oscar all fair and square, but at least one can understand the logic, Heston has a dominating role whacked by an unimaginable baptism of fire, he is undeniably sympathetic and mostly affective with a very theatrical flair. An unsung heroine, is Israeli beauty Haya Harareet's divine presence as Esther, the daughter of Judah's former slave Simonides (Jaffe), and Judah's sweetheart, who livens up the scenes whenever poignancy comes into play, a classic godsend. When all is said and done, BEN-HUR is the apotheosis of mainstream studio production in Hollywood's Golden Era, its phenomenal scale, its breathtaking grandeur and the imposingly plangent score by Miklós Rózsa can unnerve any redux project even tries to emulate its success, and furthermore, its \"revenge is never the cure\" message can earnestly transcend any religious persuasions and reach to a broader demography out of its faith-base home-turf."
    },
    {
      "username": "sauravjoshi85",
      "userUrl": "https://www.imdb.com/user/ur47100167",
      "reviewLink": "https://www.imdb.com/review/rw4528848",
      "warningSpoilers": false,
      "date": "23 December 2018",
      "rate": "9",
      "helpful": "21 out of 32 found this helpful.",
      "title": "A must watch movie for every movie buff",
      "content": "Great and entertaining period drama. Great acting by all the stars. Must watch movie"
    },
    {
      "username": "Doylenf",
      "userUrl": "https://www.imdb.com/user/ur1048771",
      "reviewLink": "https://www.imdb.com/review/rw0067176",
      "warningSpoilers": false,
      "date": "5 May 2001",
      "rate": "9",
      "helpful": "9 out of 13 found this helpful.",
      "title": "New DVD version is a full restoration of sight and sound...brilliant achievement!",
      "content": "'Ben-Hur' is such a great film, it's a pleasure to report that the newly restored Wide Screen 4-Disc DVD version (which includes the 1925 silent screen film with Ramon Novarro) is right on the mark. The color has been restored to its original brilliance with every scene clearly in focus and the soundtrack gives full range to Miklos Rozsa's impressive score. More than ever, Rozsa's score seems to have an energy and force of its own, underlining all the drama inherent in a story of this kind. And Charlton Heston's work in the title role is sheer perfection. He captures the character so completely that he IS Ben-Hur.Not often does such an epic have human characters that are not dwarfed by all the spectacle. The characters are all fully-dimensional human beings--particularly the two antagonists (Judah Ben-Hur and Messala), once great friends but now divided by political loyalties. Charlton Heston and Stephen Boyd are outstanding in the leads (Boyd should definitely have won an Oscar as Messala for his chilling death scene alone!). All the other important roles are flawlessly cast. The chariot race is the most explosive and breathtaking seventeen minutes ever given to such a spectacular event--and all of the stunts look perfectly real. It's hard to believe that none of the stunts ended with more than minor injuries.The final scene, which follows soon after the chariot race, with Ben-Hur returning home and slowly climbing the steps to find that his mother and sister have been cured, still gives me goose bumps when I see it. As does the poignant scene in the leper colony where he insists on seeing their cave dwelling. Both scenes are strongly bolstered by Miklos Rozsa's brilliant score.Fully deserved all the awards it won. Should be released theatrically to show folks that even in 1959, Hollywood had all the technical skill to bring something like this off--with spectacular results! But in the meantime, this newly restored DVD is a keeper."
    },
    {
      "username": "galahad58",
      "userUrl": "https://www.imdb.com/user/ur2972539",
      "reviewLink": "https://www.imdb.com/review/rw1225145",
      "warningSpoilers": false,
      "date": "26 November 2005",
      "rate": "10",
      "helpful": "247 out of 389 found this helpful.",
      "title": "The pinnacle of film making",
      "content": "I own over 2,000 movies on DVD or VHS. I have gone to many many more movies that have not been worthy of my collection, thus my exposure to film has been extensive. I mention this because through every film I have seen; I still come back to a film from 1959 as the greatest achievement in cinematic history. I have seen great films like: Return of the King, Saving Private Ryan, Braveheart and many more. While the modern films are wonderful and have a fantastic richness to them, they still are a \"small\" notch below Ben-Hur. Today's films use a lot of computer effects for their battles scenes, their backgrounds, and even computer images for the stunts of their actors. Yet, Ben-Hur did it all without computers. I am still fascinated by the chariot race. Never, in film history, has anything matched the depth and excitement of the chariot race. Remember folks, this is 1959, nothing is computer generated. Some may say the naval battle scenes look a bit cheesy, but again it was 1959 and the scenes still work today. What can you say about the acting? Every single actor is wonderful. Heston is in top form as Ben-Hur. Steven Boyd is incredible playing the merciless Messala. Jack Hawkins, Haya Harareet, Martha Scott--all fantastic in their roles. Each performing the role of a life time. The actors are fantastic, but William Wyler brings more out of each actor than any director ever could in this day and age. Wyler had no computer animation to rely on, he had no high tech special effects crew, he had no computer program to fill in extras. Wyler had to find thousands of extras for many scenes and maintain control. Did you ever see Steven Boyd better? Probably not. Did you ever see any of the actors (except Heston, who is an acting marvel) better in any other role? Wyler just pulled the greatest performance out of each actor. The story: fantastic from beginning to end. While the film is over 3 hours long, you do not feel that it is that long. Every scene is lovingly crafted: the reunion between Messala and Judah, the trek to the gallows, the rowing scene, the naval battle, the chariot race, the Messala death scene, the reunion with Judah and his family, etc. After seeing thousands and thousands of movies, I always come back to Ben-Hur. This is the mark of fantastic movie making. Today's film makers could learn a lot by watching this film and \"learning\" about acting, directing, and screen writing."
    },
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0067286",
      "warningSpoilers": false,
      "date": "23 September 2004",
      "rate": "",
      "helpful": "54 out of 105 found this helpful.",
      "title": "Sometimes Overdone, But Entertaining & Worthwhile",
      "content": "It's hard to deny that William Wyler's lavish version of \"Ben-Hur\" is sometimes a bit overdone, but it nevertheless remains an entertaining and worthwhile classic. The material does justify the big-budget approach, since the story contains several interesting themes as well as plenty of action sequences. While some parts could have been stream-lined with little loss, in order to make the movie as a whole flow more smoothly, in general the film as it is keeps a good balance between action and substance. There are some very good dramatic moments in addition to the action highlights.Charlton Heston is well-cast as Ben-Hur, a role that plays right to his strengths. The strained relations between Ben-Hur and Messala provide one set of themes for the story, as well as driving much of the action. Heston handles his end of it pretty well, although Stephen Boyd could have been a little less static in his portrayal of Messala. Jack Hawkins works very well as Quintus Arrius, and his scenes with Heston are used well in establishing some of the inner workings of Heston's character. Hugh Griffith also has a couple of good scenes as Sheik Ilderim.The chariot race and other action sequences usually get most of the attention, but there are also some worthwhile ideas in the story (which are really the focus of the original novel) that are developed well enough. There is also a very good silent movie version of \"Ben-Hur\" from 1925, which at times takes a different approach from this version, and which is well worth seeing in itself for those who like the story."
    },
    {
      "username": "filmbuff-05706",
      "userUrl": "https://www.imdb.com/user/ur119773892",
      "reviewLink": "https://www.imdb.com/review/rw8734240",
      "warningSpoilers": false,
      "date": "14 December 2022",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "My Favorite Best Picture Winner.",
      "content": "Ben-Hur is one of the best movies of all time- Biblical or otherwise. In fact, the Oscars lauded this film. Ben-Hur won 11 Academy Awards, including Best Picture. This has never been topped but equaled twice- by Titanic and Lord of the Rings: Return of the King.And it's all earned. Since I love Biblical epics, this is my favorite Oscar-winning movie. Some Christians say that Hollywood hates Christian movies, but Ben-Hur proves otherwise. It's not that they hate religious movies, it's just that this is a movie and God's Not Dead is a hateful sermon.The plot follows Judah Ben-Hur, played by Charlton Heston. He's a Jew who reunites with a childhood friend who becomes a Roman, named Messala. After he betrayed by his friend- sold into slavery and separated from his mother and sister, he seeks vengeance. However, his heart changes when he meets a merciful man- one who gives him water and later dies on a cross.As with The Ten Commandments, the movie is very grand- from sets to costumes to the famous chariot race scene, which is one of the best scenes in cinematic history, and intense no matter how many times you see it.Then of course, there's the Christian elements of Ben-Hur. I have asked atheists before what their favorite religious films are, and quite a few people have cited Ben-Hur among them. This shows that a lack of religious belief does not diminish the power of this grand epic.Many modern Christian movies are disliked, and one reason is because the religious message is put before the story. In other words, the message is hammered in, and the story is put last. Those who feel this way should put Ben-Hur on their must watch list.While Jesus is in the center of the message, He is barely shown. In fact, we never hear His voice or see His face. We hear others repeat His words, but Christ Himself is mute whenever He appears. This makes for a unique depiction of Him, and His message here actually speaks louder than words.While the Christian message that Jesus died for mankind is shown, another one shines even more- Christ-like love. When Ben-Hur sees that God loves him so much that He became man to die for him, he finds the strength to forgive his Roman friend-turned-enemy.If Jesus can forgive all the sins of all mankind, how could he not forgive the one sin of his betrayer? I struggle with this myself, but it's still inspiring.I mentioned in my review of The Ten Commandments (written back in April) that it's lengthy at 231 minutes long. This is shorter, but only by 19 minutes. However, as with The Ten Commandments, the time is well used and goes by decently.When I watch Ben-Hur, I notice that few Biblical epics of this level and quality have not been made since The Passion of the Christ, which was released 45 years later. That's disappointing. I wish more Biblical epics could be made on this level. But for now, I'll be eternally grateful for the powerful epic that is Ben-Hur.Note: This is posted with Christmas reviews since it opens with a Nativity scene."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw0067142",
      "warningSpoilers": true,
      "date": "23 April 2000",
      "rate": "10",
      "helpful": "31 out of 56 found this helpful.",
      "title": "The firstand for a long time the finestfilm spectacular",
      "content": "With his distinctive visual style and a taste for solemn material, William Wyler was meticulously individualistic director, triple winner of the Best Picture Oscar... As a devoted artist, he showed visual clarity and sensitive portrayal of character, dignifying melodrama, epic and Westerns... His \"Ben-Hur\" is a semi-biblical adventure set in the First Century AD, during the life of Christ...In \"Ben-Hur,\" Heston reaches the peak of his career winning an Oscar for his outstanding performance of Judah Ben-Hur... Judah is a peaceful Jewish prince who stands the tyranny of Rome through the sadistic mind of Messala... Heston gives a spiritual performance of the title role... Judah is noble, aggressive, proud and warm... He is authentic, believing that his existence had a purpose, and that his God will free him to take revenge on his enemy... He is a man of terrific complexity and great courage and fortitude... From the land of Judea, to the galley of a Roman warship and to the Valley of the Lepers, Judah struggles for dignity and freedom... Judah's spirit is nearly broken until a hand reaches toward him with a ladle of water... Judah/Messala friendship is great, but their relationship, damaged for ideological differences, makes them become bitter enemies... Messala (Stephen Boyd) sees only a Roman world in the future... Judah believes in the future of his people... Tribune Messala had the same attributes, the same traits of Judah, but inverted upside down ideologically... Messala is an ambitious autocratic commander, and a despot ruler, who wants Judea a more obedient and disciplined province...Quintus Arrius (Jack Hawkins) realizes much about Judah's character... After whipping his back, he told him: \"You have the spirit to fight back but the good sense to control it. Your eyes are full of hate, forty-one. That's good. Hates keeps a man alive. It gives him strength.\" And that's why Judah can be called more a survival than a hero...Sheik Ilderim (Hugh Griffith), is the wealthy Arabian horse trainer, who needed a real man to race his strong and magnificent Arabian team...Haya Harareet is the Jewish maiden who tenderly falls in love with Judah...Sam Jaffe is Simonides, Judah's loyal friend and keeper of the Hur fortune... André Morell is Sextus, the pagan ruler whom Messala replaces...With dramatic musical score, breathtaking sets and costumes, huge masses of people, a vigorous sea battle between Roman fleet and Macedonian pirates, a memorable and spectacular chariots race, this inspiring film is an unforgettable solid motion picture, more religious than \"The Ten Commandments.\""
    },
    {
      "username": "searchanddestroy-1",
      "userUrl": "https://www.imdb.com/user/ur17559480",
      "reviewLink": "https://www.imdb.com/review/rw8652830",
      "warningSpoilers": false,
      "date": "3 November 2022",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Pure masterpiece",
      "content": "Thanks to Andrew Marton and Yakima Canutt and for their unforgettable chariot race directing, not Wyler's, but many viewers would pefer B Reeves Eason work for the 1926 version made by Fred Niblo. I don't know...Both are absolutely fantastic, riveting, mind blowing to watch, to enjoy. Two major epics, both kings of the antiquity, sword and sandal - cheap words to use for such high scale jewels - genres, with of course the TEN COMMANDMENTS. Gigantic epics where the climax curiously never occur in the end - chariot races for BEN HUR and Red Sea \"opening\"for the TEN COMMANDMENTS. Charlton Heston was the best choice for this movie - for BOTH movies - where it is again question of Christianity, as in nearly any of antiquity films from Hollywood, and strangely less from Italian spaghetti peplums of the sixties...Strange, because Italians are fond of everything related to Christ, Catholicism, as Polish and Spanish are too. So, back to this masterpiece, yes, everyone must see it in his life. At least once."
    }
  ],
  "errorMessage": ""
}