{
  "imDbId": "tt0105695",
  "title": "Unforgiven",
  "fullTitle": "Unforgiven (1992)",
  "type": "Movie",
  "year": "1992",
  "items": [
    {
      "publisher": "Los Angeles Times",
      "author": "Kenneth Turan",
      "link": "https://www.latimes.com/archives/la-xpm-1992-08-07-ca-4625-story.html",
      "rate": "100",
      "content": "Simultaneously heroic and nihilistic, reeking of myth but modern as they come, it is a Western for those who know and chrish the form, a film that resonates with the spirit of films past while staking out a territory quite its own. [7 Aug 1992]"
    },
    {
      "publisher": "Variety",
      "author": "Todd McCarthy",
      "link": "",
      "rate": "100",
      "content": "Clint Eastwood has crafted a tense, hard-edged, superbly dramatic yarn that is also an exceedingly intelligent meditation on the West, its myths and its heroes."
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/movies/unforgiven/review/2030129296/",
      "rate": "100",
      "content": "The cast is universally strong. Hackman, Freeman and Harris don't do anything they haven't done before, but the roles suit their personae to a degree where they approach archetypal status."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Dave Kehr",
      "link": "https://www.chicagotribune.com/news/ct-xpm-1992-08-07-9203110190-story.html",
      "rate": "100",
      "content": "This dark, melancholic film is a reminder -- never more necessary than now -- of what the American cinema is capable of, in the way of expressing a mature, morally complex and challenging view of the world. [7 Aug 1992]"
    },
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "https://www.rollingstone.com/tv-movies/tv-movie-reviews/unforgiven-2-182289/",
      "rate": "100",
      "content": "Unforgiven is the most provocative western of Eastwood's career, and with Gene Hackman, Morgan Freeman and Richard Harris along for the ride, it's also the most potently acted."
    },
    {
      "publisher": "USA Today",
      "author": "Mike Clark",
      "link": "",
      "rate": "88",
      "content": "It's the actor/director's best movie - and the best Western by anybody in over 20 years. [7 Aug 1992]"
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "https://www.csmonitor.com/1992/0813/13121.html",
      "rate": "75",
      "content": "Plays out its drama with enough old-fashioned sobriety to lend the proceedings a classical air, offering the comfort of familiarity rather than the thrill of discovery. [13 Aug 1992]"
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Mick LaSalle",
      "link": "",
      "rate": "50",
      "content": "Though the movie is riddled with memorable scenes of violence, its pace is slow -- too slow. It has an epic sprawl, but it's not an epic. It's more like a bloated fairy tale. [7 Aug 1992]"
    },
    {
      "publisher": "Washington Post",
      "author": "Hal Hinson",
      "link": "",
      "rate": "40",
      "content": "If Eastwood had any emotional depth as an actor, the character's anguish might come through."
    },
    {
      "publisher": "The New Republic",
      "author": "Stanley Kauffmann",
      "link": "",
      "rate": "30",
      "content": "At the last, we're left with a film that tries to doll up a conventional genre with hints of depth, hoping to disguise the cross-dressing by putting it in the shape of an epic. Murnau, Mizoguchi, Ford, even you authors of the Book of Genesis, rest easy. [12 Oct 1992]"
    }
  ],
  "errorMessage": ""
}